{"jobID": "2661382143", "jobLocation": "Washington_DC", "jobTitle": "GENERAL PHYSICAL SCIENTIST", "companyRating": null, "companyInfo": {"Website": "www.navy.com", "Headquarters": "San Diego, CA", "Size": "1001 to 5000 employees", "Founded": " 1775", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Duties Help  Duties  Summary The selectee for this position will serve as a GENERAL PHYSICAL SCIENTIST for the DEPARTMENT OF THENAVY.  THIS IS AN EXPEDITED HIRING AUTHORITY ANNOUNCEMENT. The Duncan Hunter National Defense Authorization Act (NDAA) FY 2009 provides that the Secretary of Defense can designate acquisition positions as shortage positions and recruit and appoint highly qualified persons to these positions. This announcement is open to accept resumes from candidates interested in helping the Department of the Navy meet our mission requirements for the acquisition of systems, equipment and facilities.  This public notice announcement is for anticipated vacancies to be filled under the Expedited Hiring Authority (EHA) for acquisition positions located at Department of Navy installations identified in this public notice. Positions may be filled as permanent, term, or temporary with a full-time or part-time work schedule. Pay will vary by geographic location. There may or may not be actual/projected vacancies at the time you submit your application. As such, Notices of Results (NORs) may or may not be sent to applicants who apply to this announcement. Please read this Public Notice in its entirety prior to submitting your application for consideration.  Vacancies filled from this announcement may be filled at any grade level listed and in equivalent pay systems (e.g., NH, NJ, NK, etc.). Selectees may be appointed to a position with promotion potential (e.g. selected at the GS-5 grade with potential to the GS-11). If selected below the full performance level, incumbent may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. Promotion is neither implied nor guaranteed.  Recruitment incentives may be authorized. Information on Temporary and Term Appointments: Temporary appointments may be extended up to 3 years at the discretion of management and in accordance with applicable regulations.  Temporary actions taken under this announcement may be made permanent without further competition.  Term appointments may be extended up to 6 years at the discretion of management and in accordance with applicable regulations. Additionally, selectees may be noncompetitively converted to permanent career-conditional or career appointments under specific conditions.  Temporary or term positions may be terminated at any time before the established not-to-exceed date.Learn more about this agencyResponsibilities Duties and responsibilities will vary based on Position Description and Grade Level.  Positions may be subject to work an uncommon tour, including nights, weekends, and holidays to meet mission requirements. Overtime or night differential pay and/or unusual duty hours may be required.  Positions may be eligible for part time, full time or ad-hoc telework at the discretion of management.  Positions may require a Financial Management Level I, II, or III certification per the National Defense Authorization Act (NDAA) 2012, Section 1599d. The certification level must be achieved within prescribed timelines. Certification requirements are outlined in the DoD Instruction 1300.26 available at http://www.esd.whs.mil/Portals/54/Documents/DD/issuances/dodi/130026_dodi_2017.pdf Travel RequiredOccasional travel - Travel requirements will vary. Travel from normal duty station to CONUS and OCONUS may be required and may include remote or isolated sites. Travel may be on military and commercial aircraft for extended periods of time. Supervisory statusNo Who May Apply  This job is open to…  United States CitizensQuestions? This job is open to 1 group. Job family (Series)1301 General Physical Science Requirements Help  Requirements  Conditions of Employment Must be a US Citizen.Males must be registered or exempt from Selective Service. www.sss.govMust be determined suitable for federal employment.Must participate in the direct deposit pay program.May be required to successfully complete a probationary/trial period.See Other Information and Requirements section for additional requirements.Requirements: All eligibility and qualifications requirements must be met by the referral cut-off date.  This position is covered under the Defense Acquisition Workforce Improvement Act (DAWIA) and requires additional education, training and experience. Positions may be in any DAWIA Career Field at Level I, II, or III. If you possess DAWIA Certification, please indicate your Certification Level and Career Field information in your resume.  Applicants not certified may still apply and be selected, but must achieve certification within 24 months of appointment. Certification requirements may be viewed at http://icatalog.dau.mil/onlinecatalog/CareerLvl.aspx.  Certain positions may be designated as Critical Acquisition Positions (CAPs). In addition to DAWIA certification requirements, individuals selected for CAP must also be a member of the Acquisition Corps, become a member, or obtain a position waiver at the time of selection and sign a three-year tenure agreement prior to assuming the position. If you are an Acquisition Corps member, please indicate your membership in your resume. Acquisition Corps requirements may be viewed at http://www.secnav.navy.mil/rda/workforce/Documents/dawiaoperatingguide21dec2011forwebsite1.pdf  Senior level positions may be designated as CAP with further designation as a Key Leadership Position (KLP). As a KLP, the selectee will be required to sign a Tenure Agreement which requests the selectee to remain in this position for a designated period of time, generally 3-4 years.  Must be able to obtain an interim and/or final (e.g., confidential/secret/top secret, etc.) security clearance prior to entrance on duty AND must be able to maintain the required level of clearance while employed in the subject position. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal.  Positions that are supervisory/ managerial require that first time supervisors/managers complete a one-year trial/probationary period if not previously completed in a competitive or other excepted service position. Supervisors in the executive branch have a heightened personal responsibility for advancing government ethics. The selectee will be required to review the 14 General Principles of Ethical Conduct at 5 CFR 2635.101.  A tentative offer of employment will be rescinded if the selectee fails to meet the pre-employment requirements, including failure to report to any of the scheduled appointments. Qualifications In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities as they relate to this position. Therefore, we encourage you to be clear and specific when describing your experience.  GS-07: Your resume must also demonstrate that you have successfully completed one full year of graduate level education OR you have have successfully completed a bachelor's degree with superior academic achievement OR you have at least one year of specialized experience at or equivalent to the GS-05 grade level or pay band in the Federal service or equivalent experience in the private or public sector 1) Interpreting basic environmental laws; 2) Assisting higher graded personnel with environmental program areas (e.g. air, potable water, waste water, storm water, storage tanks, hazardous waste); and 3) Assisting with environmental compliance audits. NOTE: This information must be supported in your resume to be considered for the position OR you have a combination of education and experience that equates to one year of experience.  GS-09: Your resume must also demonstrate that you have successfully completed a master's or equivalent graduate degree OR have successfully completed two full years of progressively higher graduate level education leading to a master's degree OR you have obtained an LL.B. or J.D. that is related to the position being filled OR you have at least one year of specialized experience at or equivalent to the GS-07 grade level or pay band in the Federal service or equivalent experience in the private or public sector 1) Evaluating the impact of complex environmental laws on supported organizations; 2) Assisting in the management of environmental program areas (e.g. air, potable water, wastewater, storm water, storage tanks, hazardous waste); and 3) Revising and reviewing guidelines, point papers, and instructions in order to provide guidance to staff. NOTE: This information must be supported in your resume to be considered for the position OR you have a combination of education and experience that equates to one year of experience.  GS-11: Your resume must also demonstrate that you have have successfully completed a Ph.D. or equivalent doctoral degree OR you have successfully completed three full years of progressively higher level graduate education leading to a Ph.D. or equivalent degree OR you have successfully completed an LL.M. degree that is related to the position being filled OR you have at least one year of specialized experience at or equivalent to the GS-09 grade level or pay band in the Federal service or equivalent experience in the private or public sector 1) Providing information/guidance to others on environmental methods and guidelines in relations to public safety, employee safety, and environmental matters related to all environmental compliance media ; 2) Identifying environmental compliance issues with the management of facilities; 3) Providing input on the planning and execution of environmental programs/projects. NOTE: This information must be supported in your resume to be considered for the position OR you have a combination of education and experience that equates to one year of experience.  GS-12: Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-11 grade level or pay band in the Federal service or equivalent experience in the private or public sector 1) Ensuring projects are in compliance with local, state, Federal and regional environmental laws and regulations.; 2) Providing technical advice on environmental compliance with regulatory codes and regulations; and 3) Tracking service provider performance (i.e. deliverable deadlines, regulatory deadlines, environmental permit requirements); 4)Using principles, practices and techniques of environmental plans, programs and methods in identifying problems with projects and implementing corrective action. NOTE: This information must be supported in your resume to be considered for the position.  GS-13: Your resume must also demonstrate at least one year of specialized experience at or equivalent to the GS-12 grade level or pay band in the Federal service or equivalent experience in the private or public sector 1) Utilizing project management and environmental engineering/science concepts, principles, and practices to oversee environmental remediation and restoration projects; 2) Utilizing knowledge of interdisciplinary environmental sciences (i.e., chemistry, biology, geology, hydrogeology, and/or geochemistry) and physical sciences to develop environmental restoration project solutions; 3) Applying latest developments to solve environmental remediation problems that are outside present practices and methods; 4) Making recommendations and decisions for smooth transition of environmental technologies in research and design; and 5) Identifying potential impacts of decisions and recommendations on public safety, ecology, and environmental programs at the activity level. NOTE: This information must be supported in your resume to be considered for the position.  Additional qualification information can be found from the following Office of Personnel Management website:  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/general-physical-science-series-1301/  Warrant authority above the small purchase threshold may be required. EducationEducation: If you are using education to meet all or part of the qualification requirements, you must submit a copy of your transcripts or an itemized list of college courses which includes equivalent information from the transcript (course title, semester/quarter hours, and grade/degree earned) in your resume. See OPM's General Policies for information on crediting education.  Education completed in foreign colleges or universities may be used to meet the qualification requirements if the applicant can provide documentation indicating that the foreign education is comparable to that received in an accredited educational institution in the United States. It is the responsibility of the applicant to provide such evidence when applying for further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html  Applications will be accepted from students who expect to complete qualifying education within 9 months from the date of application. However, agencies are required to verify that the education has been completed successfully before any applicant can be appointed (report to work); therefore, your selection or start date may be impacted by proof and completion of all position requirements. Additional information Referral Lists may be issued on an as needed basis as vacancies occur. Multiple vacancies may be filled by this announcement.  This position is covered by the Department of Defense (DoD) Priority Placement Program.  Within the DoD, the appointment of retired military members within 180 days immediately following retirement date to a civilian position is subject to the provisions of 5 United States Code 3326.  Selectee may be required to complete ethics orientation within three months of appointment and submit a Confidential Financial Disclosure Report, OGE-450, within 30 days of appointment.  Active duty military members MAY apply under this announcement. If selected, appointment eligibility requirements must be met prior to the effective date of appointment.  Successful completion of a pre-employment drug test may be required. A tentative offer of employment will be rescinded if the applicant fails to report to the scheduled drug test appointment. Incumbents of drug testing designated positions will be subject to random testing. Drug test results will be provided to the employing activity/command. Please Note: Marijuana is a Schedule I drug under the Controlled Substances Act and therefore use of marijuana is illegal under Federal law regardless of State laws. A positive drug test result for marijuana (or any other drug tested for) will result in withdrawal of the tentative job offer and ineligibility to apply for a position within the Department of Defense for 6 months from the date of the drug test.  May be required to successfully complete a pre-appointment physical examination.  The Department of the Navy uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify.  Overseas Info. for Guam and Hawaii locations:  To learn more about the living and working condition at an overseas military installation go to: http://www.militaryinstallations.dod.mil/pls/psgprod/f?p=MI:ENTRY:0  For applicants located outside of the overseas commuting area, a service agreement may be negotiated in accordance with the Joint Travel Regulation and applicable Department of the Navy policies.  Overseas tour of duty will vary depending on location.  A Cost-of-Living-Allowance (COLA) will be added to the stated salary. COLA is subject to change at any time.  For more info. go to: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/Overseas_Recruitment_information_NonForeign.pdf  Federal annuitant information: The selection of an annuitant is subject to the Department of Defense and Department of the Navy policy on the employment of annuitants. Policy information may be found at: http://www.secnav.navy.mil/donhr/Documents/CivilianJobs/FedCivAnnuitants.pdf The Interagency Career Transition Assistance Program (ICTAP) provides eligible displaced Federal competitive service employees with selection priority over other candidates. To be eligible for ICTAP you must submit appropriate documentation (a copy of your agency separation notice, your most recent performance rating, and your SF-50 noting current position, grade level, and duty location) and be rated well qualified by exceeding the minimum qualification requirements and being able to satisfactorily perform the duties of the position upon entry. For additional information click here https://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/Read more How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above.  When the application process is complete, we will review your resume to ensure you meet the hiring eligibility and qualification requirements listed in this announcement. You will be rated based on the information provided in your resume and responses to the Occupational Questionnaire, along with your supporting documentation.  If selected, you may be required to provide supporting documentation.  If, after reviewing your resume and supporting documentation, a determination is made that you inflated your qualifications and/or experience, your score may be adjusted to more accurately reflect your abilities or you may be found ineligible/not qualified.  Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment.  You will receive credit for all qualifying experience, including volunteer and part time experience. You must clearly identify the duties and responsibilities in each position held and the total number of hours per week.  Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., professional, philanthropic, religious, spiritual, community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. Read more Background checks and security clearance  Security clearanceOther Required Documents Help  Required Documents A COMPLETE RESUME IS REQUIRED. Your resume must<"}