{"jobID": "2826067144", "jobLocation": "Southfield_MI", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.modis.com/us", "Headquarters": "Jacksonville, FL", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Robert Half Technology, TEKsystems, Aerotek"}, "estimatedSalary": null, "jobDescription": " Modis has new opportunities for Data Scientists onsite in the Metro Detroit area. The ideal candidate would be comfortable using Spark, SQL, and work with Hadoop. Must also be able to work with various stakeholders, teams, and have great communication! This position is direct W2, and a long term opportunity. at Cannot at this time work with 3rd party employers, but can support sponsorship. Modeling and framing business scenarios which translate into solutions the business can use to growProviding on-going tracking and monitoring of performance of decision systems and statistical modelsPerforming experimental design approaches to validating findings or testing hypothesis which provide business valueAsses data quality and create Data Transformations, collaborate to support data collection, integration, and retention requirements based on the input collected with the business. Skills Required: Solid Python / Apache Spark coding skills.Experience with tools such as: Hadoop, Teradata, R, etc.2-5 years of relevant quantitative and qualitative experience in Research and Analytics.Demonstrated skills in manipulation and data mining / pattern recognition of large structured and unstructured data sets.Code and code testing to deliver automated data profiling, cleansing, standardization, transformation and reasoning capabilities.Partnering with Data Governance to ensure that all information utilized adheres to compliance, access management, and control policies.Business development and relationship building to establish partnerships with stakeholders. Skills Preferred: Proficiency in statistical analysis and techniques, quantitative analytics, forecasting / predictive analytics, multivariate testing, and optimization algorithms.Alteryx and/or QlikView experience.provided by Dice Hadoop, Spark, Python, Data Science"}