{"jobID": "2817740572", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "87000", "jobDescription": "Job Description We are in a data science renaissance. Companies that embrace data science will lead and those who do not will fall behind. To help IBM's clients lead, we are building an elite team of data science practitioners to help them learn how to succeed with data science. The team will include data science engineers, machine learning engineers, operations research / optimization engineers and data journalists.  The team will engage directly in solving real-world data science problems in a wide array of industries around the globe with IBM clients and internally to IBM. This elite team of data professionals will work with other IBMers and client data science teams to solve problems in banking, insurance, health care, manufacturing, oil & gas and automotive industries, to name a few. We will teach our client data science teams how to execute on key responsibilities. Responsibilities:Develop subject-matter expertise with clients we work withBe a trusted partner to the analytics team, engineering team and enable them to use data to run analytics at scale and integrate analytics with product platformsEngineer efficient, adaptable and scalable data pipelines to process structured and unstructured dataEnable analytics by building robust data sets that can power various ML techniques like regression, classification, clustering etc.Who you are:You share our passion for producing high quality work and continuously improving the ways we use dataYou have a passion for intuitive data model and you are an expert in distributed data processing patterns.You have experience in engineering data pipelines using big data technologies on large scale unstructured data setsYou have programming expertise: functional, scripting or object orientedYou excel at taking vague requirements and crystallizing them into scalable data solutionsYou have demonstrated communication skillsIndependent, self-starter, with demonstrated communication, collaboration and willing to learn passionatelyEntrepreneurial drive and demonstrated ability to achieve stretch goals in an innovative and fast-paced environment.Key skills:Independent, self-starter, with demonstrated communication, collaboration and willing to learn passionatelyEntrepreneurial drive and demonstrated ability to achieve stretch goals in an innovative and fast-paced environment.Excellent problem-solving and analytical skillsPreferred Work Location: Austin, TX, NY, & SVL Required Technical and Professional Expertise At least 8 years experience with relational SQL and NoSQL databases, including Postgres, DB2 event store, Cassandra, Neo4j. Familiarity with file formats such as Avro and Parquet is a plusAt least 8 years experience in: Python, Scala, Java, RAt least 6 years experience with big data compute: M/R, Spark, Beam, Flink etc.At least 4 years experience with streaming ETL and analytics using KafkaAt least 2 years experience in orchestration and containerization technologies to instrument infrastructure as code: Kubernetes, Docker, Ansible. Preferred Tech and Prof Experience At least 3 years experience in team leadership and ownershipAt least 5 years experience working on Agile team EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}