{"jobID": "2777297307", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.edo.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Who We Are EDO is a data science software firm that develops analytics tools to make data accessible and actionable for the media and entertainment industry. Currently focused on film and TV, we work with many major movie studios and TV networks to help them forecast, market and distribute their content more effectively. Building from this strong base, we are growing into adjacent verticals. We are a team of world-class engineers and data scientists backed by top leaders in entertainment and technology. Our co-founders and executive leadership have an established track record with other successful ventures. What You Will Do Generate data-driven insights to help guide client decision-making Discover novel applications of data within entertainment Work on a small team and take ownership of high impact projects Work in a fast paced environment with continuous deployment and rapid product iteration Meet and work directly with media and entertainment clients to understand their needs and translate into product solutions Understand how the futures of media, entertainment and advertising are being defined by the innovative applications of technology and data Learn about how a startup is built from an early stage What We Are Looking For Self-driven individuals who take ownership of their work Ability to build products quickly and efficiently Strong understanding of data science practices and principles Interpersonal and communication skills to work on a small team Willingness to learn about our clients and their unique problems Experience with R or Python and comfort with databases Benefits Early-stage equity and competitive salary Medical, dental, and vision insurance Meals and snacks during work Movie tickets, fitness discounts, commuter subsidies, and Apple hardware"}