{"jobID": "2830592872", "jobLocation": "Holmdel_NJ", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewThe Data Scientist IV is responsible analyzing and modeling big data to develop analytics that will influence our products and customers. The Data Scientist IV reports into the Senior Manager, Software Development.  iCIMS extends a work culture unlike any other East Coast-based technology provider. We focus on hiring candidates who display our seven core competencies passion, drive, transparency, adaptability, empathy, kaizen, and customer commitment. If you eat, sleep, and breathe our competencies and desire to work in a casual yet results-driven environment that embraces innovation then youre just what were looking for!  iCIMS is a high-growth Software-as-a-Service (SaaS) company thats voted one of the Best Places to Work in New Jersey. We are the industry's premier recruitment software provider delivering technology that supports more than 3,500 contracted customers around the globe. Committed to both growth and stability, we have a lot of opportunities for career advancement within our organization. Come grow with us. Apply today!Responsibilities• Extract actionable insights from huge volumes of data using data mining, statistics, and database techniques• Apply advanced statistical and predictive modeling techniques to build, maintain, and improve on decision making• Conduct studies, rapid pilots, and identify metrics• Guide other team members on best practices and review their analysis. • Be the go to person for advanced models, analysis and data science. • Identify best practices on data quality issues, root causes and remedies to be implemented by the data engineers• Design and implement large scale data projects• Influence and persuade others to support large scale projects and hypotheses • Communicate ideas and theories to a wide audience• Work directly with business teams and leaders to understand requirements and communicate results• Consistently ensure that business is conducted with integrity at all times and that behavior aligns with iCIMS policies, procedures, and core competenciesQualifications• Minimum of 7 years of related work/graduate experience • Experience working with big data is a plus• Strong written and verbal communication skills with an ability to communicate ideas clearly to a wide audience• Ability to develop and query databases, and perform statistical analysis• Skills to create examples, prototypes, demonstrations to help management better understand data science work• A good understanding of design and architecture principles• Experience with high level statistical software (R, Matlab, Pandas, SAS etc)• Experience with SQL• Experience with Apache Spark is a plus• Previous work experience with machine learning is a plus• Ability to influence and lead others • Experience in designing and leading large scale projects Education/Certifications/Licenses Required• Bachelors or preferably Masters/PhD degree in statistics or another quantitative discipline  iCIMS is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, protected veteran status, disability status or any other characteristic protected by law."}