{"jobID": "2776005063", "jobLocation": "Northbrook_IL", "jobTitle": "Data Scientist (Supply Chain)", "companyRating": "3.2", "companyInfo": {"Website": "www.walgreens.com", "Headquarters": "Deerfield, IL", "Size": "10000+ employees", "Founded": " 1901", "Type": " Company - Public (WBA) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " CVS Health, Target, Walmart"}, "estimatedSalary": "117000", "jobDescription": " Job Summary  Responsible for providing specialized expertise through process management. Responsible for leading moderately complex project, process or program assignments. Has expertise in the field, using professional concepts in resolution of moderately complex issues. May act independently to determine methods and procedures on new or special assignments. May drive change on assigned projects or processes.  Job Responsibilities Works on moderately complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. May exercise independent judgment in methods, techniques, and evaluation criteria for obtaining results.Acts independently to determine methods and procedures on new or special assignments. Acts as a specialist in the field, uses professional concepts in developing resolution to moderately complex issues. Provides expertise and knowledge in a moderately complex area of specialization. Identifies and researches somewhat unique customer opportunities, issues, and requests.Establishes and maintains constructive working relationships and keeps stakeholders informed of progress or status , addressing the underlying needs of the stakeholders.Provides expertise and knowledge in a moderately complex area of specialization. Outlines specific objectives and processes that are focused on generating innovative solutions to business problems.Participates in functional and cross functional teams to meet objectives, improve processes, and improve stakeholder satisfaction.Creates networks involving coordination among groups.Outlines specific objectives and processes that are focused on generating innovative solutions to moderately complex business problems.May implement innovative processes or changes that support the goals of the department.May develop and submit ideas which support the achievement of innovative goals.May exhibit leadership on projects and/or processes. Walgreens, one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc., the first global pharmacy-led, health and wellbeing enterprise. More than 10 million customers interact with Walgreens each day in communities across America, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. Walgreens operates 8,175 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands. Walgreens omnichannel business includes Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.  As the neighborhood drugstore and retailer, our goal is to make health and happiness simpler, easier and within reach. And we remain a trusted wellness provider offering convenient access to important health services, such as immunizations and an array of pharmacy services that can help patients improve their health. To our team members, Walgreens represents a unique opportunity to excel in their careers in a welcoming and inclusive environment. We offer the chance to work in a truly supportive environment, and be a part of a progressive organization dedicated to the well-being of our customers, team members and the communities we all call home.  Basic Qualifications Bachelor's Degree and at least 3 years of experience in a supply chain or business role OR a High School Diploma/GED and at least 6 years of experience in a supply chain or business role.Advanced level skill in Microsoft Excel (for example: using AVERAGE function, merging and centering cells, printing centered page and/or creating a pivot table).Willing to travel up to 10% of the time for business purposes (within state and out of state). Preferred Qualifications APICS CSCP Certification. Apply Save jobSavedSDL2017"}