{"jobID": "2830542790", "jobLocation": "Washington_DC", "jobTitle": "Advanced Practice Nurse Practitioner Perioperative Care Clinic", "companyRating": "3.6", "companyInfo": {"Website": "www.childrensnational.org", "Headquarters": "Washington, DC", "Size": "5001 to 10000 employees", "Founded": " 1870", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Children's Hospital of Philadelphia, MedStar Health, Shriners Hospitals For Children"}, "estimatedSalary": "112000", "jobDescription": " As the nation’s children’s hospital, the mission of Children’s National Health System (CNHS) is to excel in Care, Advocacy, Research, and Education. We accomplish this through:  • Providing a quality healthcare experience for our patients and families Improving health outcomes for children regionally, nationally, and internationallyLeading the creation of innovative solutions to pediatric health challenges  We’re seeking a Nurse Practitioner to assume responsibility for the management of care to patients including diagnostic and therapeutic interventions, and the assessment, implementation, and evaluation of an appropriate plan of care. Additional Duties:Provide leadership and consultation within perioperative careParticipate in division/departmental and organization-wide initiatives to represent advanced practice and leverage the role of the advanced practice providerIdentify significant changes in patient status using a physical exam, lab values, diagnostic tests, and patient/family inputCollaborate with nursing, medicine, and other members of the healthcare team to regularly ensure quality patient care QualificationsMaster's Degree in Nursing with National Board certification in one of four APRN rolesContinuing education necessary to maintain national board certification and state licensureAt least three years of experience as a Pediatric Nurse PractitionerStrong knowledge of clinical specialty and services  We offer a competitive salary and benefits package. To review the full posting and apply, visit https://cnhs.taleo.net/careersection/1phys/jobdetail.ftl?job=180000B7&tz;=GMT-04:00&> Equal Opportunity Employer of Minorities, Females, Protected Veterans, and Individuals with Disabilities."}