{"jobID": "2722496104", "jobLocation": "Austin_TX", "jobTitle": "Technical Consultant, Data Science", "companyRating": "3.8", "companyInfo": {"Website": "www.rockwellautomation.com", "Headquarters": "Milwaukee, WI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (ROK) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Emerson, ABB, Siemens"}, "estimatedSalary": "88000", "jobDescription": " The Technical Consultant provides pre-sales services to both internal and external customers focusing on the implementation and deployment of Information Software offerings. The primary focus of the position is to support the IS Sales Team in working with our Customers on their Connected Enterprise Journeys in the area of machine learning and predictive analytics.  Reporting to the Manager of Information Software, Technical Consultants, this position primarily provides sales support to the Information Solutions Sales  Executives primarily within North America as well as other key customer engagements from other sales teams.  The role requires excellent communication skills and the ability to interact and influence effectively across all levels of the company. In addition, strong commercial, product/service/solution and application skills are necessary. This position requires moderate to extensive travel primarily within North America, but could include some in our other global regions. SUMMARY OF RESPONSIBILITIESRespond to RFIs and RFQsWork with Rockwell sales representatives on sales strategies, plans and executionPresent qualitative and quantitative value of the proposed solutionsCreate custom presentations and documents that clearly state customer business problems and Rockwell solutions and benefitsCommunicate with customer IT representatives to understand customer IT infrastructure and policies and to present solutions that fit into customer IT environmentProvide guidance to customers and implementers on ways to deploy proposed products including alternatives and their costs and benefitsWork with deployment teams (internal or partners) on deployment strategies and specific proposals as neededPrepares technical materials, presentations and tools to improve sales force effectiveness.Evaluates products and provides feedback on product features and performance.Serves as technical expert for pre-sale customers and internal events.Develops product enhancements to be used by various delivery teams in order to either extend existing product functionality and/or to improve development efficiency.Serve as RA technical representative to industry associations and standards committees.Customer focused attitude.Works on issues of diverse scope where analysis of data requires evaluation of identifiable factors.Demonstrates good judgment in selecting methods and techniques for obtaining solutions.Normally receives little instruction on day-to-day work.Is a self-sufficient knowledge worker.Receives guidelines and goals on new assignments and is expected to develop their own plan to achieve these goals.Ability to manage an ad-hoc team of individuals in order to meet a project goal.This position ideally will be worked from our offices in either: Milwaukee, Mayfield Heights, OH, Austin or San Jose. However, working remotely within the USA (except Alaska & Hawaii) is possible. EOE, M/F/Disable, Vet #LI-DS2"}