{"jobID": "2829858742", "jobLocation": "Benicia_CA", "jobTitle": "Junior Project Designer (Interior Design)", "companyRating": null, "companyInfo": {"Website": "www.robertsboche.com", "Headquarters": "Benicia, CA", "Size": "1 to 50 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Junior Project Designer Roberts Boché Associates, Inc. is a full-service Architecture and Interior Design firm with a focus in the field of Commercial Interiors. Located in historic downtown Benicia, RBA provides services to clients throughout the Greater Bay Area and beyond.  Currently, we are seeking a full time Junior Project Designer. Our ideal candidate should have strong leadership skills, attention to detail, enjoy working in a dynamic, fast paced, collaborative team environment and be a good overall addition to our close knit team.  Responsibilities: Work with Project Designers, Principals and other senior level staff in field observation / measurement and AutoCAD inputWork with Project Designers, Principals and other senior level staff in design, production and detailing of commercial interior projects including tenant improvement, corporate office, medical, retail and industrialWork with Project Designers, Principals and other senior level staff in the selection and specification of commercial finish materialsWork with Project Designers, Principals and other senior level staff in Construction Administration proceduresAccuracy in all phases of work in a timely mannerWork with Project Designers, Principals and other senior level staff in coordination with vendors, consultants, contractors and clientsAbility to multi-task numerous projectsOther duties as assigned Qualifications: Degree in architecture / interior design / or related fieldProficient in AutoCAD and SketchUpWorking knowledge of Adobe Suite, Excel and MS WordExcellent communication skills (verbal and written)Strong organizational skills and work ethicMinimum one to three years experience with commercial interior projects Our greatest asset is our people. We are dedicated to the well-being of our team members. RBA offers a competitive benefits package, including full medical, dental, and vision care coverage and a 401(k) profit sharing plan.  Please send Cover Letter, Resume and Portfolio to info@robertsboche.com. Resumes will only be accepted in PDF format. Word documents will not be considered.  Job Type: Full-time"}