{"jobID": "2731118440", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.isaca.org", "Headquarters": "Rolling Meadows, IL", "Size": "51 to 200 employees", "Founded": " 1969", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Department: Information Technology  Reports To: Manager, Information Integration and Mining  Classification: Exempt  Summary:  The Senior Data Engineer implements extract, transform, and load (ETL) processes that establish consistency across enterprise data, reducing risk, and promoting efficiencies in support of the organization's goals and objectives. This role performs data design, data modeling, development, and integration, and applies knowledge of business needs and information management disciplines to successfully deliver innovative solutions that include data integration, transformation, mapping, modeling, mining and reporting functions.  Essential Job Functions:  • In collaboration with the Information Technology Operations team and key business units, analyze procedures and design and implement data movement solutions to attain high data quality and process automation  • Develop/Deploy SSIS ETL processes for various business processes. Perform complex Extract, Transform, Load (“ETL”) coding  • Design and develop SQL Server stored procedures, functions, views and triggers to be used during the ETL process. Write complex T-SQL queries.  • Perform data profiling and source to target mappings (while capturing ETL and business metadata) for populating dimensional models.  • Develop and maintain advance reports and dashboards (utilizing SQL Server Reporting Services). Ensures accurate and timely development, configuration and implementation of dashboard metrics, reports, tools and customizations to meet business needs.  • Write and maintain documentation of the ETL processes via process flow diagrams.  • Conduct appropriate functional and performance testing to identify bottlenecks and data quality issues. Perform tuning of stored procedures and execute workflow  Requirements and Skills:  Minimum Experience Required:  • B.S. degree in Computer Science, Software Engineering, MIS or related discipline from an accredited instituition  • 5-7 years of related experience  • Integrations with application development and database development  • Using business intelligence (BI) to present actionable information to others  • Interfacing with business users and understanding their requirements  • Developing operational reporting and dashboards  Preferred Experience:  • M.S. degree in Computer Science, Software Engineering, MIS or related discipline from an accredited instituition  • 10+ years of related experience  • Developing with .NET stack or Java  • Professional Association/volunteer engagement  • Non-profit  • Global experience  • Multi lingual  Competencies/Skills Required  • Solid knowledge of Enterprise Resource Planning (ERP) or Customer Relationship Management (CRM) software  • Heterogeneous data systems (Oracle, SQL Server, XML, Json, flat file, etc.)  • Microsoft SQL Server stack including SQL Server Integration Services (SSIS) SQL Server Analysis Services (SSAS), SQL Server Reporting Services (SSRS) and SQL Server Management Studio (SSMS) and Crystal Reports  • ETL tools such as Cognos, Business Objects, Statistical Analysis System (SAS)  • Knowledge of different technologies and technology domains (Data transformation, SQL, DB2, Modeling, Mapping, Data Warehousing, etc.)  • Amazon Web Services (AWS) or Azure  • Proficiency in Microsoft Office products (Word, PowerPoint, and Excel)  • Ability to understand the business requirements and converting them into solution designs  • Exceptional customer service and customer centric acumen  • Ability to work independently  • Excellent oral, written communication, presentation, and interpersonal skills  • Ability to present innovative ideas, approaches and information clearly and influence  • Time management & organizational skills  • Multi-tasking and attention to detail  • Diligent work ethic  • Insatiable desire to learn and develop skills, self-mastery, self- starter, highly motivated  • Cultural sensitivity/awareness  • Collaborative team player, ability to build strong relationships internally, across functional areas, organizations (ISACA Enterprise) externally with vendors, suppliers, members, constituents, and volunteers  • Strong business acumen, analytical skills, creativity and entrepreneurial skills  • Must be able to travel upWork Environment  • This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines.  Physical Demands  • The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  • While performing the duties of this job, the employee is regularly required to talk or hear. This a largely a sedentary role; however, some filing is required. This would require the ability to lift files, open filing cabinets and bend or stand as necessary  It’s through our genuine ability and desire to demonstrate ISACA’s values that incredible moments occur. We believe when staff focus individual behaviors on the moments we interact with one another individually, among our teams, and with our customers and communities we serve, not only will ISACA be a “best place to work,” ISACA will embody the spirit of our vision:  ISACA is a global community of the most engaged business and technology professionals whose thought leadership and skills assure trust in a dynamically changing digital world.  WE ARE ONE  We care deeply about people and recognize that employees and members are our extended family who we must support and nurture.  WE ARE ACCOUNTABLE  We stand behind the work we do and the contributions we make. This is the cornerstone of our success.  WE ARE DEDICATED  We are unfailingly passionate about ISACA. We are dedicated to maximizing its influence and impact globally. We are committed to lifelong learning and volunteering as part of our professional growth.  WE ARE AUTHENTIC  We operate with honesty, integrity and the highest level of professionalism in everything we do. Trust and respect is our operational foundation.  WE ARE INNOVATIVE  We thrive on being creative and innovative, and we have the will to take measured risks. We openly share knowledge and insights to deliver solutions that build trust in our digital world.  The values above describe some of the behaviors expected of individuals performing successfully in this role.  ISACA is an equal opportunity employer. ISACA strictly prohibits and does not tolerate, nor condone discrimination against applicants, employees because of age, race, color, religion, sex, national origin, sexual orientation, gender, disability, protected veteran status, genetic information, and any other protected class as recognized by applicable federal, state and local laws."}