{"jobID": "1940542076", "jobLocation": "Washington_DC", "jobTitle": "Earn 2-3x More as a Soothe Massage Therapist", "companyRating": null, "companyInfo": {"Website": "www.soothe.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " zeel, Massage Envy"}, "estimatedSalary": null, "jobDescription": "Soothe is expanding in Washington DC. We are looking to bring on highly-skilled certified massage therapists with a history of excellence in customer service to deliver on-demand massage therapy. This is a promising opportunity for therapists looking to earn extra money and work flexible hours.Apply by visiting: http://www.soothe.com/APPLYIf you have a customer account with Soothe, please use a different email address when applying to become a Soothe therapist.Why Soothe?Pay: We pay approximately 2.5x more than industry standard. Payment is transferred within 1-2 business days of service.Flexible Hours: Work when you want! You decide when to accept job offers based off of your availability.Safety: Our 24/7 dispatch team ensures safety by verifying the identity of clients and tracking your location during massages.Do You Have What It Takes?Up-to-date certified massage therapist license and insurance.Ability to perform Swedish, deep tissue, prenatal, and sports massage.Excellent customer service, communication, and integrity.Have an iOS or Android mobile phoneFlexibility and willingness to work fluctuating hours, including nights and weekends.Skill and passion for massage.Therapists must provide own massage table, fresh linens, oil/lotions, and music.About SootheSoothe delivers five-star massage to your home, hotel, or office in as little as an hour. Booking a massage is simple using our mobile app or website. We seek to provide the best possible massage while fostering a community of highly-skilled, passionate therapists. For more information, visit www.soothe.com.PressThe Ellen Show: http://www.ellentv.com/videos/0_jqau054vEntrepreneur: https://www.entrepreneur.com/article/275906Tech Crunch: http://techcrunch.com/2016/03/10/soothe-raises-35-million-series-b-round/WWD:http://wwd.com/beauty-industry-news/health-beauty-aids/massage-on-demand-service-soothe-expands-internationally-10440162/The Late Late Show with James Corden: https://youtu.be/HUStMhgQo94?t=72"}