{"jobID": "2741953983", "jobLocation": "Torrance_CA", "jobTitle": "Clinical Laboratory Scientist (CLS) - Generalist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Summary  **Clinical Laboratory Scientist (CLS) - GENERALIST REQUIRED**  BioHealth Laboratory (BHL) is a leader in integrative medicine and functional lab testing. We are in the business of taking patient specimens and turning them into powerful data for clinicians and patients so that health and longevity may be improved.  We are looking for a Clinical Laboratory Scientist to perform various assays at our Torrance location. This position reports directly to, collaborates with, and takes direction from the Operations Manager and Technical Supervisor.  BHL is a family owned business, with 15 years of experience, performing functional lab testing. We’re an intimate crew with long-time employees committed to taking BHL to the top.  The Ideal Candidate  Must have a current CLS license. You have effective communication, organization, and analytical skills. You work well with others and maintain a positive attitude in dynamic situations.  Other  Participate in research and development of new or upgraded testing processes and equipment, as needed.  Perform tasks and assist in projects, as needed and determined by management.  Starting salary: negotiable plus additional health benefit  Responsibilities and Duties  Responsibilities  Careful evaluation and statistical analysis of patient results, quality control, maintenance records, and proficiency testing for salivary endocrinology and urine chemistry departments.  Patient test report review and release for high volume, rapid turnaround time laboratory.  Hands-on patient testing using both manual and automated enzymatic and ELISA methodologies for urine metabolic analytes and salivary hormones.  Assist as needed in microbiology department evaluating stool samples via microscopy, antigen detection, culture, and automated biochemical identification techniques.  Experience with PerkinElmer Janus Automated Liquid Handler and Biomerieux Vitek is a plus.  Qualifications and Skills  Qualifications  Currently licensed as a Clinical Laboratory Scientist (CLS) in the State of California  Minimum education: Bachelor of Science (BS) in related field  Job Type: Full-time"}