{"jobID": "2823272876", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.trianz.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Trianz Careers Data AnalystAnalytics  Chicago,  Illinois Apply DescriptionJob Title: Data AnalystLocation: Rosemont, ILTerms: Contract 3-6 monthsAbout Trianz Trianz is a global professional services firm committed to enabling leaders to develop and execute operational strategies, leverage new business and technology paradigms, and achieve results expected by senior management in their organizations- predictably. What We Stand For Our clients are transforming their businesses, competitive strategies, product and service portfolios, customer-partner-employee interactions and their ecosystem. The cost of misses is not financial alone but a lost window of opportunity. So getting things right the first time is absolutely critical.  As a result, Trianz is focusing on three important themes in our engagement model with clients. Crystallize business impact from a top management point of viewHelp Clients achieve results from strategy-by making execution predictable through innovative execution techniquesCreate a positive, enriching partnership experience in everything we doIndustries, Clients & Practices Trianz works with clients across High Technology, Banking, Insurance, Manufacturing, Retail, Telecom, e-businesses and Public Services. Most clients are Fortune 1000 organizations and our relationships are sponsored by senior leaders in Enterprise Analytics Sales, Finance, Marketing, Human Resources, Operations and Information Technology. We partner with our clients to address the following key service areas: CloudAnalyticsDigitizationInfrastructureSecurityAbout the Role; Trianz is looking for a strong Data Analyst with Management Consultant experience. Experience: 5+ years of IT experience with 5+ years of as a Data Analyst Skills: Strong SQL skills and Consulting experience Data Analyst: This position is responsible for designing enhancements and new business applications and/or information systems solutions through integration of technical and business requirements; serving as technical designer to identify best solution and resulting technical specifications within limits of code environment; linking Business Analyst needs and Architect definition to technical solutions. Required Job Qualifications:Bachelor Degree and 5 years Information Technology experience.5 years of data mapping experienceExperience in creating mapping rules from source to target with transformations.Support Data integrity in various environments.Knowledge of application configuration.Knowledge of Integration Technologies such as SSIS / DataStage / Talend / Big Data.Knowledge of Data Modeling, Data Warehousing and ETL concepts.Strong SQL skills.Exposure to Big Data patterns and data formats.Strong data profiling and analysis skills.Requirements definition & management.SDLC Methodology - Agile / Scrum / Iterative Development.Experience with code optimization and performance tuning.Problem solving and analytical thinking.Strong oral/written communication skills.Healthcare experience; preferably payer, membership systems, and claims.Previous experience working for a management / technology consulting firm and/or Big 4 type of environment.We are Growing Rapidly: 2017 Highlights Trianz is rapidly growing professional services organization. Here are some highlights. Voted significantly above other services firms by 90% + of clients for business impact, execution predictability and organizational commitment in the recent Trianz wide client satisfaction survey.Won the “Customer Obsession Award” from Amazon Web Services for our innovation and execution record in Cloud Infrastructure and Business Applications strategy and services.Won UNICOM awards for the #1 Digitization and #1 Analytics project over a wide array of competition.Featured by IDC in their Spotlight series under the theme of “Operationalizing Strategies through Execution Excellence: A New Paradigms in Technology Delivery”.Achieved 50%+ revenue and employee growth compared to prior year’s exit showing an increasing acceptance of our models and success from our differentiated methodologies in strategic execution.Talk to us, Join us & Develop into Leaders Come join a dynamic global company. We are an open, non-bureaucratic and no-nonsense culture. We believe in a culture of innovation, encouraging our people to create. We believe training and development of all our associates is the most important thing we can provide to our talent. We are investing heavily- in classroom, online and on the job training. Seeing our talent develop into leaders- is what’s fundamental for everyone at Trianz.  We are hiring at all levels of Trianz. And we are hiring globally. So- if you have a passion for execution and would like to develop into a leader capable of taking on anything, or are already a leader, talk to us!  Equal Opportunity Employer  Trianz does not discriminate on the basis of race, color, creed, national or ethnic origin, gender, religion, disability, age, political affiliation or belief, disabled veteran, veteran of the Vietnam Era, or citizenship status (except in those special circumstances permitted or mandated by law). Apply  Apply Later  ← Back to Current Openings Share  inShare  LinkedIn  Facebook  Twitter  Email Powered by Jobvite"}