{"jobID": "2759591714", "jobLocation": "Dallas_TX", "jobTitle": "Sr. Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.southwest.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1967", "Type": " Company - Public (LUV) ", "Industry": " Travel & Tourism", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " OverviewWe are committed to provide our Employees a stable work environment with equal opportunity for learning and personal growth. Creativity and innovation are encouraged for improving the effectiveness of Southwest Airlines. Above all, Employees will be provided the same concern, respect, and caring attitude within the organization that they are expected to share externally with every Southwest Customer.ResponsibilitiesWORK ACTIVITIES/CONTEXT: Technical Expertise:Effectively applies knowledge and skills of analysis, business processes, tools, domains, project methodologies, requirements definitions, and testing to solve a range of problems.Partners with other Technology Teammembers to provide advice or solutions within his or her area of expertise.Stays informed about current developments within his or her expertise.Analytical Expertise:Identifies problems, performs root cause analysis, investigates information, performs impact analysis, and formulates and executes plans to develop solutions.Identifies strengths and weaknesses of alternative solutions, conclusions, or approaches to problems.Understands and can estimate effort and value for solutionsUnderstands at a broad level how technology platforms/architectures are applied to automated business solutions.Business Knowledge:Actively engaged in industry, domain, process or technology trends.Task Management:Acts as a coordination and facilitation point for organizing work efforts.Sets up or follows established procedures to ensure high quality of work.Understands dependency identification processes in technology work, verifies information and carefully reviews and checks the accuracy of own work.Establishes or follows prioritization processes to drive work, and has a sense of urgency about getting work completed.Looks for and seizes opportunities to do more or to do things better.Communication:Appropriately shares ideas and information with othersPractices attentive and active listening.Ensures that regular and consistent communications take place.Expresses ideas as well as business or technical requirements clearly and concisely in writing using appropriate levels of summary and synthesis.Expresses oneself clearly in conversation and interaction with others. Must be able to meet any physical ability requirements listed on this description.  May perform other job duties as directed by Employee’s Leaders.QualificationsBASIC QUALIFICATIONS: High School Diploma, GED or equivalent education required. Must be at least 18 years of age. Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986. EDUCATION:BS, Business, Engineering, Computer Science, or Information Systems, or equivalent formal training preferred.EXPERIENCE:Minimum of 5 years work experience as an Analyst or equivalent position required.Must have strong SQL experience.Well versed in SCRUM and Agile methodologies.Data Modeling, Oracle, Teradata.ETL background is a plus.PHYSICAL ABILITIES: May be asked on occasions to lift and/or pull weights loads of approx. 20 lbs. on a periodic basis.May require extended work hours per Leaders' request.May be asked to climb, bend, kneel, crawl, and stoop on a periodic basis.SKILLS/ABILITIES/KNOWLEDGE/WORK STYLE:Core Knowledge:Advanced knowledge of business analysis, process modeling and redesign.Advanced knowledge of technical environments.Advanced knowledge of software development methodologies.Critical Skills:Excellent partnering, communication, and negotiation skills in working with various Teams and/or external partners.Able to analyze large, complex, or vague Business or technical problems, articulating the problem or root cause, and translating the analysis into viable solution recommendations.Able to work effectively in a strong Customer service / team oriented environment.Able to research, create, and document requirements, processes, and technical specifications.Ability to manage and prioritize multiple and widely varied work streams / tasks.Able to take on multiple assignments, whether administrative or project related, while maintaining a successful level of completion in all responsible work. Able to mentor others to do the same.Able to develop, present and effectively communicate ideas and strategies to a variety of audiences.Able to teach and mentor others concerning technical and business subjects. Must be able to comply with Company attendance standards as described in established guidelines. OTHER QUALIFICATIONS:Limited travel with potential for increased/decreased travel based upon Technology Department needs. Must maintain a well-groomed appearance per Company appearance standards as described in established guidelines. Southwest Airlines is an Equal Opportunity Employer."}