{"jobID": "2812826605", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst/Communication Specialist", "companyRating": "4.0", "companyInfo": {"Website": "www.rmcweb.com", "Headquarters": "Lexington Park, MD", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Resource Management Concepts, Inc. (RMC) provides high-quality, professional services to government and commercial sectors. Our mission is to deliver exceptional management and technology solutions supporting the protection and preservation of the people and environment of the United States of America.  RMC is hiring for a Data Analyst/Communication Specialist. The selected applicant will work closely with government and contractor staff to gather, review, analyze, and model occupational safety and health (OSH) - and workers' compensation-related data, providing analytical support and conducting statistical analyses and identifying and presenting statistical trends. The selected applicant will review data and develop insights and trend data and support the development of useful reports and presentations of data and work closely with government and contract staff to support agency communications and outreach goals, interacting with personnel, gathering requirements, and researching and developing content to support communications, and planning and attending communications and outreach events. Working knowledge of OSH matters and workers' compensation is desirable. The selected applicant will provide support for general requirements necessary to support the needs of the OSH Branch and field sites.  A bachelor's degree and two (2) years of related work experience is required. Training and or a certification in Adobe Connect is highly desired.  Security Clearance: An active clearance is not required to start. Qualified candidates MUST be able to obtain and maintain a security clearance; US citizenship is required.  RMC is an equal opportunity employer. All qualified women, minorities, individuals with disabilities and veterans are encouraged to apply for RMC job vacancies. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.SDL2017"}