{"jobID": "2802952021", "jobLocation": "Troy_MI", "jobTitle": "Call Center Representative", "companyRating": "3.4", "companyInfo": {"Website": "www.msgcu.org", "Headquarters": "Clinton Township, MI", "Size": "201 to 500 employees", "Founded": " 1954", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": " Michigan Schools & Government Credit Union (MSGCU) has been providing families with trustworthy financial products and dependable services for sixty years. Throughout our rich history of helping members “set it right\" for themselves and their families, we have grown to be the 6th largest Credit Union in Michigan and the largest Credit Union in Macomb county with over 115,000 members and over $1.8 billion in assets. MSGCU is continuing to grow and has 14 branches across Macomb, Oakland and Wayne counties.  If you have a passion for helping people and giving fair and dependable service, we want you on our team! Getting yourself on the right path to financial success begins here!  Call Center Representatives will work an average of 40 hours per week during our call center hours: Monday-Wednesday 8am-5pm, Thursday-Friday 8am-6pm, and Saturday 8am-1pm. Summary: Performs a broad range of member service and teller functions by telephone, e-mail, and fax. Accurately processing savings, draft/checking, and certificate (CD) account transfers and making loan payments. Assists members with setting up automated services offered through the Credit Union. Follows Credit Union policies and procedures and assists in achieving Credit Union goals. Generates loan applications and enters application data with accompanying notes. Actively promotes additional Credit Union services. Performs a variety of account maintenance, and generates correspondence. Responds to member’s requests via the telephone, email, mail, and fax as directed. Essential Duties and Responsibilities: • Consults with members by telephone to obtain information and explain available financial services to members. Provides routine information to members by telephone related to credit union services or policies, including eligibility for membership, types of credit union accounts, insurance programs, loan policies, interest rates, current dividend rates, wire transfers, locations and office hours and promotes remote access channels. Processes various savings certificate, and checking account programs explaining options such as single and joint ownership. Gathers needed information from members to efficiently transfer funds from existing accounts. Prepares transfer forms or initiates electronic transfer of funds to conveniently obtain members’ funds from other sources.Processes member address changes, check orders, and reorders.Offers loan quotes, calculations, and rates to members. Determines if the loan meets the criteria to process immediately.Inputs member loan applications through the Credit Union’s computer system using designated software. Prepares paperwork and accurately processes loan requests. Sets up closing date and instructs member concerning necessary documents needed to complete the closing process. Reviews applications and calls on loans not closed.Assists members with completing all arrangements and documents for automated services such as direct deposit, payroll deduction, automated teller machines (ATM), and audio response services. Assist with ordering Debit/Credit Cards (after the original is Lost or Stolen) and PIN numbers, audio access response PIN numbers (forgotten or locked out) and Internet Banking (direct member through the Forgot Password process).Mails IRA and certificate of deposit account applications and related documents. Process deposits and/or distribution of funds to members’ accounts for IRA (can not set up new IRA accounts) and CD transactions.Provides routine information to members by telephone related to Credit Union services or policies, including eligibility for membership, types of Credit Union accounts, insurance programs, loan policies, interest rates, current dividend rates, locations and office hours.Answers and returns all correspondence within established regulations, procedures, and performance and productivity standards.Exceed member service expectations by providing superior quality service in a professional, efficient and courteous manner. Sets and achieves high standards of excellence while interacting with coworkers and members.Effectively listens for cues and reviews account data to determine the nature and extent of members’ needs and suggest appropriate products and services.Understands the principles of the Credit Union’s financial success. Efficiently promotes additional credit union products and services when applicable. Courteously resolve member problems, using active listening techniques and suggests alternate products and services to avoid reoccurrence of problems in the future.Demonstrates willingness to help internal/external members by willingly stepping into other areas as requested, making suggestions for improvements and learning new skills. Actions consistently serve to improve relationships and trust with coworkers and members.Behavior consistently demonstrates engagement with members and commitment to Credit Union initiatives. Essential Preparation and Training:High school graduate andAt least one year of progressively responsible experience within a financial institution to become familiar with the variety of financial products and services and account options available. Experience in a fast-paced customer service environmentSuggestive selling and business solicitation experiences strongly preferredEssential Skills and Abilities:Effective interpersonal skills to relate to members in a friendly, courteous, professional manner.Ability to collect and analyze data. Average reasoning and mathematical ability.Ability to work in a highly organized, restrictive environment requiring extended periods at a fixed workstation.Ability to work in an environment exposed to audible distractions.Proficient in the use of PCs, Microsoft Office, and with other standard office equipment.Above average clerical perception; average general learning ability, verbal and numerical aptitude form perception and manual dexterity.Working Conditions:Environment generally good, with little discomfort from noise, extreme temperature, dust or other factors. Required traveling throughout the Credit Union's service area to provide adequate service to members.Strength Level - Sedentary: Exerting up to 10 pounds of force occasionally and/or a negligible amount of force frequently to lift, carry, push, pull, or otherwise move objects. Sedentary work involves sitting most of the time, but may involve walking or standing for brief periods of time."}