{"jobID": "2572576650", "jobLocation": "Northridge_CA", "jobTitle": "Clinical Laboratory Scientist I (Continuous) (JID 7114)", "companyRating": "4.0", "companyInfo": {"Website": "www.calstate.edu", "Headquarters": "Long Beach, CA", "Size": "10000+ employees", "Founded": " 1962", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "36", "jobDescription": "CSU Job Listing Details Printable version  E-Mail this listing Campus: Northridge Job ID: 7114Job Title: Clinical Laboratory Scientist I (Continuous) (JID 7114) Appointment Type: Temporary Time Base: Part-Time Date Posted: October 27, 2017 Closing Date: Open until filled Link to Apply Online: http://www.csun.edu/careers Campus Employment Homepage: http://www-admn.csun.edu/ohrs/ Description: Clinical Laboratory Scientist I (Continuous) (JID 7114)  Student Health Center  Part Time / $25.25- $35.00 / hr.  CSUN's Commitment to You  CSUN is committed to achieving excellence through teaching, scholarship, learning and inclusion. Our values include a respect for all people, building partnerships with the community and the encouragement of innovation, experimentation and creativity. CSUN strives to cultivate a community in which a diverse population can learn and work in an atmosphere of civility and respect. CSUN is especially interested in candidates who make contributions to equity and inclusion in the pursuit of excellence for all members of the university community.  About the University  One of the largest universities in the country, California State University, Northridge (CSUN) is an urban, comprehensive university that delivers award-winning undergraduate and graduate programs to nearly 40,000 students annually and counts more than 330,000 alumni who elevate Southern California and beyond. Since its founding in 1958, CSUN has made a significant and long-term economic impact on California, generating nearly $1.9 billion in economic impact and more than 11,700 jobs each year. The LAEDC recognized CSUN as its 2015 Eddy Award winner for its positive economic impact. Serving more students on Pell Grants than any other institution in California, CSUN is also a social elevator and one of the most diverse universities in the country. CSUN ranks 13th in awarding bachelor’s degrees to underrepresented minority students and seventh in bachelor’s degrees to Latino students, serves the 13th largest Jewish student population, and enrolls the largest number of students who are Deaf and hard-of-hearing of any U.S. state university. The journal Nature recently named CSUN a Rising Star for scientific research, and the NSF ranks CSUN in the top five nationally among similar institutions for graduates who go on to earn doctorates in the sciences. CSUN is where individuals rise. And through them, so does Greater Los Angeles and beyond.  Major Duties  Under general supervision of the Student Health Services Laboratory Director and the Lead Clinical Laboratory Scientist II, the Clinical Laboratory Scientist I performs a variety of clinical laboratory tests, which provide the medical staff with essential data and information for the detection, diagnosis and treatment of illnesses, diseases and other conditions found within the university setting. The incumbent performs complex and advanced tests in addition to standard clinical laboratory tests; collects specimens including via phlebotomy; performs proper preparation of specimens to ensure their integrity; maintains quality control data, proficiency and competency testing; uses automated and manual data reporting systems, such as a laboratory information system to maintain records of laboratory tests conducted; monitors patient data; prepares reports and ensures information accuracy; and performs other duties as assigned. Qualifications Bachelor's degree in clinical laboratory science or equivalent from an accredited institution; OR equivalent post-secondary education, training and experience as defined by the California Division of Laboratory Science; OR a combination of education and experience which provides the required knowledge and abilities. LICENSE: CANDIDATE MUST POSSESS AND MAINTAIN A CALIFORNIA CLINICAL LABORATORY SCIENTIST LICENSE. Knowledge, Skills, & Abilities  Thorough knowledge of the theories, principles and practices of clinical laboratory science including the use and care of all applicable laboratory equipment. Working knowledge of the preparation of specimens; various laboratory disciplines, tests and procedures including chemical, physical, microscopic, microbiological, bacteriological, serological, hematological, immunological, and other related disciplines and laboratory tests; automated information systems used in clinical laboratory settings. General knowledge of clinical laboratory quality control and assurance procedures, protocols and standards; and state and federal regulations pertaining to the operation of a clinical laboratory. General knowledge of mycology, virology, and genetics. Working knowledge of Equipment: Sysmex XS-1000i, Microscope, centrifuge, pipette, water bath, mixer, CO2 incubator, and incinerator. Ability and Specialized Skills to: identify incongruities in test procedures and inconsistencies in reports of test results for a patient; demonstrate skill in the performance of a variety of laboratory analyses and evaluate information against measurable criteria; notice pertinent details of specimens under microscopic study; perform applicable mathematical calculations rapidly and accurately; keep current in developments in the field of clinical laboratory science; and if assigned, provide lead work direction to laboratory support staff.  Pay, Benefits, & Work Schedule  The salary range for this classification is: $25.25 - $44.60 per hour.  The anticipated HIRING RANGE: $25.25- $35.00, dependent upon qualifications and experience.  HOURS: Intermittent; hours and schedule vary.  TEMP: This is a Temporary-renewable position; end date to be determined.  General Information  The Student Health Center is accredited by the Accreditation Association for Ambulatory Health Care, Inc. and as such, will recommend certain vaccinations or screenings free of charge for the successful candidate.  This position is a sensitive position as designated by the CSU. The selected candidate must pass a fingerprint clearance (LiveScan).  A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who apply for the position.  The person holding this position is considered a 'mandated reporter' under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment.  How to Apply  Applications are currently being accepted to establish an HOURLY CLINICAL LAB SCIENTIST POOL. Applications for these on-call positions will be accepted on a continuing basis through June 30, 2018 or until an adequate amount of applications have been received.  Please complete the on-line application/resume upload submission process in order to be considered for any open position within the university and its auxiliaries. The hiring department will contact the best qualified candidates and invite them to participate in the interview process.  Application Screening begins November 10, 2017, and will continue on an ongoing basis.  In order to be considered in the initial review, applications must be submitted prior to the date listed above. Application submissions received after the application screening date will be reviewed at the discretion of the University.  For more detailed information on the application and hiring process, please view the link below:  http://www.csun.edu/careers/  Equal Employment Opportunity  California State University, Northridge is an Affirmative Action/Equal Opportunity Employer. We consider applicants for employment without regard to race, color, religion, national origin, age, gender, gender identity/expression, sexual orientation, genetic information, medical condition, marital status, veteran status, or disability. Reasonable accommodations will be provided for applicants with disabilities who self-disclose by contacting Recruitment Services."}