{"jobID": "2821905478", "jobLocation": "Los_Angeles_CA", "jobTitle": "Associate Scientist, Built Heritage Research Initiative", "companyRating": null, "companyInfo": {"Website": "www.getty.edu", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The GCI's Science Department is seeking an Associate Scientist to join our Built Heritage Research Initiative to conduct scientific research and analysis on building materials, traditional and modern, and to explore their performance and deterioration.  This Built Heritage Research Initiative focuses on the development of testing protocols to improve conservation practice of built heritage (buildings, monuments, and sites) from ancient to modern and across the world; and to disseminate our findings through professional publications and conferences.  Initially reporting to the Head of Science, the Associate Scientist will work primarily on evaluating conservation treatments for sandstone and other building materials, and undertake analysis and testing of them. The Associate Scientist will: develop and implement research strategies to test building materials and their conservation treatments; undertake analysis on samples; assess a range of field-based evaluation techniques to provide additional information on treatment effectiveness; collect, analyze and interpret data collected; synthesize information from many sources of data; and produce documentation for internal and external use.  The Associate Scientist must have a Master’s degree in materials science, geology, or other natural science, PhD preferred; 3-7 years of experience in scientific research, with experience in the field of cultural heritage conservation or a related field.  The Associate Scientist must have broad familiarity with analytical instrumentation, including SEM-EDS, XRF, FTIR, mechanical testing, and surface characterization; and the ability to take samples, conduct scientific research, and synthesize and interpret data from a number of sources. The successful candidate must be adaptable, analytical, and a creative problem-solver and thinker; able to work effectively in a highly collaborative and variable environment; and possess excellent organization, communication, and writing skills. Experience working with conservators or other conservation professionals is preferred.  An excellent benefits package and salary commensurate with experience will be provided.  All interested applicants must apply for this job online. Please prepare a cover letter and curriculum vitae in a single PDF file. Note: When prompted by the online application system to select or submit your “resume”, please upload your cover letter and curriculum vitae as a single PDF file.  Candidates who successfully complete the online application process will receive an automated email message (Subject: Thank you for your application). If you have specific questions about the Associate Scientist position, please email gcistaffing@getty.edu. The deadline for applications is July 3, 2018."}