{"jobID": "2820059758", "jobLocation": "Menlo_Park_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.uplift.com", "Headquarters": "Menlo Park, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Love the passion and promise of start-up? Want to use your data analytics expertise to help millions of people turn their travel dreams into reality?  UpLift operates at the intersection of travel, technology and alternative lending. Founded by luminaries from the travel industry, UpLift is a well-financed Series B startup that provides point-of-sale financing for consumer travel. The consumer travel segment is a $1 Trillion global market that is underfinanced relative to other key consumer verticals. UpLift is generating revenue and rapidly scaling, and yet is still early enough for the right candidate to make their mark in a fundamental way on the company.  Reporting to the CFO, the Senior Data Scientist is responsible for applying judgement and analytical skills to assessing the creditworthiness of potential borrowers for loans facilitated by UpLift. The analyst will enhance UpLift’s existing credit model with state of the art data science and machine learning. The primary responsibilities will be Credit Modeling, the systematic assessment of potential borrowers’ creditworthiness, Data Selection and Integration, the assessment, selection, and integration of strategic, alternative data sources to support conventional credit bureau data, and Research of modeling literature to identify valuable tools and techniques to support Credit Modeling efforts. The results of the analyst’s work will be directly incorporated into the UpLift credit decision framework, and will require close interface with the implementation engineering team. RequirementsSkills and ExperienceAdvanced data science skills, including sampling, statistical modeling, machine learning, and data processing and integrationProfessional code development skills, including versioning, documentation, source control, etc.Experience building robust testing frameworks and infrastructurePrior credit analysis and financial industry experienceCandidate must have experience with some visualization techniques and demonstrated success communicating results to business managers/CFOPython is a prerequisite but expertise building scalable, production systems is preferredMinimum 3 years professional experienceBenefits Full-time competitive salary, equity, annual bonus, 401k and health/dental. Small entrepreneurial environment."}