{"jobID": "2769843830", "jobLocation": "Chicago_IL", "jobTitle": "Dir, Analytics & Data Science", "companyRating": "3.2", "companyInfo": {"Website": "www.greatwolf.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " Job Summary: Lead Commercial Analytics, establishing best practices for analytics and visualization efforts. Direct responsibility for all aspects of commercial analytics, including Marketing, Web, Contact Center, Revenue Management, and Onsite Revenue. Lead the Center of Excellence (COE) for analytics across the company, establishing and optimizing process management for bespoke and self-service analytics for all analytics resources. Job Duties:Lead and manage direct reports within the commercial analytics. Establish and manage individual development plans for each team member and align with organizational goals.Partner with IT on BI / Data Lake architecture and data management / data engineering to create scalable and reliable business intelligence ecosystem. Establish and document data governance principles.Stay abreast of new analytic methods and technologies and support development of these new capabilities internally.Work collaboratively with stakeholders to develop clear, compelling reports of analytic results and insights.Oversee process management for new reporting and modeling features, coordinating with stakeholders in the field as well as corporate to ensure throughput and timely response.Create library of self-service reporting and visualization tools to enable resort and corporate level analysisCreate customer dashboards using visualization tools to communicate critical KPIsPresent findings and recommendations to the relevant department and team members, including assumptions, data problems, and future/continuing research guidance.Oversee and contribute to the build advanced statistical models, leveraging and deploying machine learning and AI where applicable. Maintain and curate library of statistical models.Lead testing efforts including establishing test methodology and measurement. Review test outcomes and present fact based recommendations to relevant stakeholders.Qualifications:Three plus years of leadership experience in Analytics with experience presenting and communicating at the executive level.Bachelor's degree in statistics, operations research, economics, consumer sciences, or related field.Advanced degree (MBA or MS) in Analytics, Statistics, Operations Research, or other quantitative field.Experience with one or more programming languages, including but not limited to SAS, SPSS, R, or Python. Experience with R Studio Server a plus.Experience working with large data sets and applying statistical models, including predictive modeling, in an academic or professional setting.Experience with varied qualitative and/or quantitative research methods, as well as sampling methodologies and experimental design.Strong database knowledge, including both structured (SQL) and unstructured (NoSQL) environments.Experience with cloud based analytics platforms including AWS or Azure, as well as data transport tools (ETL, ELT, and Middleware).Experience with data visualization tools and best practices.Computer science and technical architecture knowledge required, including understanding of security and PII, data transfer and transformation programs, and machine learning or prescriptive software products. Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}