{"jobID": "2826773401", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.joinhoney.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Honey is helping millions save money on a daily basis and we're growing!  Our team is looking for an experienced analyst to help us discover, interpret, and communicate new insights from our data.  We're growing and shipping software quickly - this person will need to execute just as fast.  The ideal candidate will be curious, data-savvy, and eager to learn. What Youll Do: • Create, measure, and analyze various KPIs to inform decisions and support recommendations across the company Innovate! Implement innovative quantitative analyses, try new data wrangling techniques, and experiment with new visualization toolsWork with other analysts to build tools and set processes to automate data analysesWork closely with all engineering, product, finance, and marketing departments to understand, solve, and anticipate their analytics needsFoster a culture of transparency: act as the main liason between other departments to ensure data accuracy and uniform understanding of key metricsPossess excellent communication and presentation skills About You: • At least 2 years of experience with dashboarding tools like Tableau or similar (Periscope Data is a plus)At least 2 years of experience with SQL (BigQuery and MySQL is a plus)Ability to take vague requirements and transform them into concise deliverablesAbility to manage multiple priorities and a fast-paced environmentStrong working knowledge of Python, R, and/or D3 is a plusBachelors Degree in Statistics, Mathematics or similarProficiency in ExcelPrior experience at a tech company is a plus  Honey is an equal opportunity employer. We are committed to building a diverse and inclusive company. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, disability status or genetic information, in compliance with applicable federal, state and local law."}