{"jobID": "2531510013", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.astreya.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Milestone Technologies, Taos, GDH Consulting"}, "estimatedSalary": null, "jobDescription": " Description: If you are an ambitious and driven individual with a passion for data, tools and problem solving of vexing operational challenges, then this role of Data Analyst is for you. You will be working within a very dynamic and evolving Insights team as part of our largest global support program.  You will be traversing a vast landscape of evolving tools and technologies to harness large sets of data to produce enhance reporting, live dashboard and analysis results for Managers across the globe. You will work collaboratively alongside peer analysts to produce and maintain insight deliverables. You will work directly with operational managers, client program managers and cross functional stakeholders to gather requirements and produce data in consumable formats and end-point.  This role will also partake in BI initiatives to continually improve the process of data management, transformation and visualization of raw data into meaningful information and insights.  Work Experience (3+ yrs of experience across the following): Write, review, optimize SQL queries, views, and set stored/scheduled procedures to extract dataDesign, develop, publish and maintain dashboards in Tableau or similarMS Office Excel Ninja (Pivot tables, Power Pivot, formulas, VBA /Macros)Experience with testing, validating and enhancing report outputWork simultaneously across multiple data sources and reporting toolsCreate scripts for importing, exporting, cleansing, analyzing, mapping and converting dataAnalyze performance data and provide intelligent synthesis, interpretation and provide recommendations where appropriatePresentation building and visualizing data in charts, graphs and tables Requirements Strong analytical skills with the ability to collect, organise, analyse, and disseminate significant amounts of information with attention to detail and accuracyAbility to learn new software and tools in an efficient mannerCritical-thinking skills and the ability to identify trends in the data and come up with key takeaways and recommendationsStrong interpersonal skills, oral communication skills, and problem solving abilitiesBA/BS/MS degree with strong academic record"}