{"jobID": "2813175707", "jobLocation": "Washington_DC", "jobTitle": "Senior Security Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.cspacesol.com", "Headquarters": "Fairfax, VA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Cyberspace Solutions is searching for a Senior Systems Engineer with an ACTIVE TS/SCI clearance with ability to successfully complete CI Polygraph to support the Stone Ghost Central Management Office. This program provides operation, support and sustainment services for systems engineering, testing and evaluation of hardware and software information technology systems, hardware design, procurement assistance, system integration, and software maintenance (i.e. upgrades, fixes, and coding repairs) as part of an integrated team. The Senior Systems Engineer ensures efficient delivery of capabilities using industry standards and repeatable processes, mitigates risks, and leads engineering efforts for large scale, integrated projects. Ten or more years of experience with load balancers, proxy appliances, firewalls, and networking required. Essential Job Functions: Architects highly complex, global solutions across the appropriate engineering environments to meet business requirements or enhance performance.  Reviews and recommends highly complex systems investment(s) to management and customers based on results of independent assessment of current and future performance, stability, and systems management/ life cycle issues.  Provides escalated, highly complex technical support to customers by investigating and resolving systems-related matters of significance; provides support telephonically and/or electronically.  Plans, conducts and oversees the technical aspects of large, complex projects; coordinates the efforts of technical support staff in the performance of assigned projects. Reviews completion and implementation of system additions and/or enhancements and provides management overview.  Develops and applies advanced methods, theories and research techniques in the investigation and solution of highly complex system requirements and problems. Develops training tools and documentation; oversees implementation of same.  Reviews literature, patents and current practices to support business requirements and/or new industry technology. Prepares reports and/or recommendations regarding new technology to appropriate personnel.  Provides leadership and work guidance to less experienced personnel. Technical Qualifications: · Ten or more years of experience in systems engineering, software engineering, operating systems programming or network architecture.  · Design, documentation, and integration of systems, networks, applications.  · Network engineering with experience in reverse & forward proxy, firewalls, intrusion detection.  · Systems administration - CentOS/Linux, email admin, PKI/LDAP.  · Installation, configuration, and maintenance of scripting language applications (e.g .Perl, Python, BASH, etc.)  · Security engineering – must have intermediate to advanced experience working with controlled interfaces.  · Hands-on experience with Hardware Security Modules (HSMs).  · Network infrastructure diagnostics (TCP/IP general networking knowledge, network monitoring tools)  Virtualization technologies (ESX/ESXi).  · Developing and updating systems documentation (e.g., ConOps, Operating procedures, systems architecture documents).  · Load Balancer knowledge revolving around how they work, various deployment models and how they're used in proxied environments.  · Practical and theoretical knowledge of web and web application server components such as IIS, Apache, Tomcat, Websphere, JBoss, etc.  · Understand High Availability and Disaster Recovery concepts as apply to Network and Security designs.  · Experience with Windows Active Directory, DNS, Email required.  · Bluecoat ProxySG Appliance experience desired. Education: Bachelor's degree in engineering, systems engineering, physics, computer science, or management information systems, and 5+ years of relevant field experience or equivalent combination of technical training and relevant field experience. Other Qualifications · TS/SCI clearance is required with ability to successfully complete CI Polygraph  · DoD 8570 IAT Level II certification required (i.e. Security + CE)  · CISSP Preferred  · Windows experience required/LINUX experience desired  · Strong organization skills to prioritize work, balance and lead complex projects  · Knowledge and experience with the following technologies:  o F5 load balancers  o Blue Coat appliances  o Cisco products  o Palo alto products  o Reverse proxy  o Forward proxy  o Data Loss Prevention (DLP)"}