{"jobID": "2833953445", "jobLocation": "Austin_TX", "jobTitle": "SR Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " Sr Data Analyst  Direct-Hire  Austin, TX (Southside)  Job Summary  The Data Analyst will act as the primary Data Steward, Business Intelligence and Reporting champion for the company. This person will be responsible for monitoring and managing the inbound and outbound data loads between the company and external clients and report to the VP of Technology. Responsibilities Manage data integration between the company and clients (members). Monitor daily data loads to ensure quality data exchange and clean/merge any data that does not meet the guidelines  Create and maintain reports and BI dashboards to serve the needs of internal and external clients  Oversee analytics/data related activities for implementation work for all new clients, coordinate testing prior to launch and address any performance gaps prior to launching a new program.  Actively monitor data transfer error logs and perform necessary actions to correct/recover from data related issues  Update and maintain our Data Flow Diagrams (DFD) to ensure our serving of data to our clients as well as internal users in the most effective and efficient manner  Contribute to and execute the strategic plan to ensure data is supporting business growth, client requirements, risk mitigation, security and disaster recovery/business continuity  Responsible for ensuring client technology/data standards are met and regularly exceeded  Process improvement initiatives  Participate in periodic status calls with clients to address questions, updates, or any issues in daily file exchanges Qualifications Minimum of 3 years relative experience as a Sr. level Data Analyst  Experience managing data and systems integrations along with data cleansing and merging  Experience in serving enterprise-grade clients, creating reports and dashboards, and supporting data analytics for a call center environment would be a plus Education Bachelor's Degree in a data analytics, business analysis or related field"}