{"jobID": "2794023750", "jobLocation": "Chicago_IL", "jobTitle": "Research Scientist - Pulmonary Medicine", "companyRating": "3.6", "companyInfo": {"Website": "www.luriechildrens.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": " Experienced research position using bench and bioinformatics tools to identify and define molecular pathways of genes that are correlated with lung disease severity in cystic fibrosis. Ideal candidate executes experiments following protocols and compiles accurate records of data. The Research Scientist should have considerable experience in all aspects of laboratory immunology, molecular biology, histology as well as genotyping. Proficiency in DNA sequencing, cDNA and Affymetrix microarray, RNA seq, Nanostring expression array laboratory techiques, cell culture and data analysis, FACS analysis as well as strong computer skills required. Ability to perform RNA isolations, labeling, array hybridizations, clone sequencing, and confirmatory RT-PCR as well as genotyping. Additionally will collaborate with faculty members in the performance and analysis of complex research studies. Maintains knowledge of relevant scientific literature and technical resources to provide consultative, educational, technical and informational services as needed to staff and faculty.Communicates the results of the study work to the general scientific community through publications and/or oral presentations.Designs, conducts and/or coordinates clinical research studies and projects. Develops and evaluates new procedures and protocols. Collaborates with faculty members and scientists in the performance and analysis of complex research studies. Independently performs various laboratory procedures, including cell culture, microscopy, DNA, RNA and protein isolation and manipulation, PCR, DNA sequencing. May develop own specific project and/or protocols of specific research interest and within focus of the laboratory.Maintains accurate research records, and presents data in group settings.Builds scientific knowledge by reading relevant articles and attending seminars.Demonstrates initiative in solving problems and implementing laboratory procedures.Communicates effectively and builds working relationship with supervisor and co-workers.Participates in the development of new procedures and protocols in the conduct of research studies.Maintains research related materials to include study supplies and equipment, data, publications, submitted grants and other scientific documents.Collaborates with Scientists in the preparation of manuscripts.Conducts literature searches for the development of grant proposals.Bachelor’s degree in Medical or Biological Sciences or related field required. Master’s degree preferred.A minimum of 5 years of related experience in genetic, epidemiological and/or epigenetic research required.Prior data analysis experience in genetics, genomics, epigenomics and bioinformatics is required.Prior work experience in a clinical research setting; experience in an academic medical setting strongly preferred.Proficiency in DNA sequencing, cDNA and Affymetrix microarray, RNA seq, Nanostring laboratory technologies and tissue culture.Advanced computer proficiency in Microsoft Suite.Strong oral and written communication skills.Strong organizational skills and ability to work in a fast paced environment."}