{"jobID": "2810542660", "jobLocation": "Austin_TX", "jobTitle": "Data Management Analyst I", "companyRating": "3.0", "companyInfo": {"Website": "www.forcepoint.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FireEye, Zscaler, Palo Alto Networks"}, "estimatedSalary": "55000", "jobDescription": " Forcepoint is transforming cybersecurity by focusing on what matters most: understanding peoples intent as they interact with critical data and intellectual property wherever it resides. Our uncompromising systems enable companies to empower employees with unobstructed access to confidential data while protecting intellectual property and simplifying compliance. Based in Austin, Texas, Forcepoint supports more than 20,000 organizations worldwide. For more about Forcepoint, visit www.Forcepoint.com and follow us on Twitter at @ForcepointSec.  The Data Management Analyst I is responsible for monitoring/auditing the quality of sales data and managing the resolution of data quality issues. The Data Management Analyst I will ensure and monitor data accuracy and synchronization across all CRM systems. Essential Functions: Work with business areas in maintaining the evolving data policies across the organization on sales data and sales operational issues.Maintaining and enhancing recurring data collections and data reports on a variety of topics.Resolving data integrity issues across stakeholders.Analyzing data for quality and reconciling data issues.Analyze, review, and interpret sales data in order to support new initiatives and programs.Work with business areas to developRepresent the data management team as a key subject-matter expert.Perform other duties and projects as assigned.Education, Experience, and Skills: Exceptional analytical, conceptual and problem-solving abilities required.Excellent communication skills with ability to communicate effectively at different levels of the organizationVery strong Excel skillsExperience with Salesforce.comSelf-directed, but can work as part of collaborative team environmentFluency in English essentialExpertise with data profiling, data cleansing, and standardizationAdvanced data analysis skills using reporting toolsExperience with data process flowcharting techniquesGlobal work experienceBachelors degree0-2 years experience in technology industry"}