{"jobID": "2722455561", "jobLocation": "Reston_VA", "jobTitle": "Jr. Data Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.soctelemed.com", "Headquarters": "Reston, VA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "At SOC Telemed (“SOC”), it is our mission to partner with healthcare organizations to bring clinicians and patients together using innovative technologies to improve clinical care and patient outcomes in a measurable way. We are the nation’s most experienced and trusted provider of telemedicine solutions to acute hospitals. We are proud to be the first private telemedicine company to earn The Joint Commission’s Gold Seal of Approval and we have maintained that accreditation every year since 2006.  To achieve our mission, we need to get the word out into the healthcare market about what we uniquely offer. This Jr. Data Scientist will work independently and apply modern data analytics techniques and develop analytical models. You will be part of SOC’s growth as the analytical engine and provide actionable insights to senior management and functional leadership. You will support SOC’s business decision-making and make a lasting impact on customer experience and patient outcomes. You thrive on teamwork in a fast paced, flexible, and dynamic environment. Everything you do demonstrates professionalism, reliability, resourcefulness, flexibility, and attention to detail, while always maintaining strict privacy of confidential data. You are never bored: there is always another skill to master, another question to ask. Your intellectual curiosity is boundless. This highly visible and impactful role is based in Reston, VA, where you will closely work with cross functional teams and directly report to the VP of Analytics. Our Vision as an organization is to transform healthcare: come be a part of it.RESPONSIBILITIES:Discover patterns and solve strategic business problems using both structured and unstructured data sets across many environmentsDevelop predictive models and optimization models that drive better outcomes for customers, patients and SOC operationsThe first project will focus on predicting demand (volume) and matching up with optimized supply (physician resource). Understand levers to the physician supply requirements and provide capacity planning to optimize supply and demand equation while supporting excellent patient careCollaborate with business owners, gather requirement, determine the best fitting method of analysis, translate and articulate analytical results, make recommendations with common sense approach to a non-technical business audience including executive management, internal staffs and external customersTrain and mentor team members as neededRequirementsSPECIFIC JOB KNOWLEDGE, SKILL AND ABILITY: The individual must possess the following knowledge, skills and abilities to be able to perform the essential functions of the job, with or without reasonable accommodation. Strong practical knowledge and experience of analytical techniques and methodologies such as machine learning/supervised and unsupervised techniques, segmentation, mix and time series modeling, stochastic modeling, response modeling, lift modeling, experimental design, neural networks, data mining, Bayesian inference, text analytics and optimization techniquesDesired skills include programming (SQL, R or Python), working with large data sets, data collection, data normalization, and data visualization.Ability to demonstrate professionalism, reliability, resourcefulness, flexibility, and attention to detail, and to maintain strict privacy of confidential dataSuccessful track record of thriving in a fast paced, flexible, and dynamic environmentAbility to manage multiple, concurrent projects of varying size and scope and core team activities in a fast paced environment. Ability to set reasonable timeline to meet objectives and prioritize conflicting deadlinesEnergetic and enthusiastic self-starter comfortable taking the initiative to develop new levels of analyticsAbility to build consensus, collaborate and motivate othersAbility to work independently and collaborativelyREQUIRED QUALIFICATIONS:A Bachelor’s degree in Statistics1+ years of full-time work experience in data science, advanced analytics, machine learning and predictive analyticsExperience driving large analytic projects, research and programs to completionBenefitsBenefits Include:Health Insurance (Medical, Dental, Vision)Health Savings AccountFlexible Spending (Medical and Dependent Care)Employer Paid Short and Long Term DisabilityEmployer Paid 1x Life and AD&D; (Supplemental available)401(k) & Roth 401(k)Up-to 16 days of PTO10 Paid HolidaysPregnancy and Parental LeaveMilitary Leave PayCommuter Assistance"}