{"jobID": "2834877088", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Nursing", "companyRating": "4.2", "companyInfo": {"Website": "www.ncphs.org", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": "SUMMARY:Provides leadership, direction, and supervision of the community’s Nursing Services. Oversees the quality of resident care and ensures continual operations in compliance with Federal and State regulations as well as NCPHS policies and procedures.ESSENTIAL FUNCTIONS:Develops short and long term goals and objectives in consultation with community management and consistent with NCPHS Mission, Vision, Core Values and Commitment to Inclusion.Oversees nursing practice, care standards, and nursing quality for all levels of care and ensures implementation.Oversees the administrative operations and personnel management of the nursing staff. Interviews, hires, supervises trains, motivates, and oversees performance management of nursing and related line staff in health center.Oversees nursing practices for licensed staff in Independent Living (IL), Assisted Living (AL), and Memory Care (MC).Ensures compliance with administrative, legal, regulatory, governmental and accrediting agency requirements for health care organization management. Implements the NCPHS and community policy and procedures accordingly. Creates implements, maintains, and ensures the compliance of the nursing related policies, procedures, and manuals.Establishes resident care standards and standards of nursing practices to maintain and improve quality of resident care. Evaluates needs and services continually in health center. Takes actions to prepare health center for inspections by regulatory agencies at any time and upgrades nursing care as needed. Assists Administrator in preparing for surveys in AL and MC, as needed.Plans, organizes, coordinates and directs all nursing functions and activities to meet the needs of the residents. Develops a nursing organization structure; assigns responsibility and delegates authority. Establishes staffing needs, monthly time schedules and productivity standards of Skilled Nursing Facility (SNF) staff and provides input to other levels of care.Assists in the preparation of the health center operating and capital budget recommendations, monitors expenditures, approves charges, establishes priorities for expenditures and prepares budget variance analysis.Oversees nursing processes including, but not limited to nursing notes, physician orders, reporting of symptoms and reactions and documentation for compliance with Federal and State regulations and reviews. Follows-up on pharmacy and medical records audits to verify compliance.Communicates and acts as liaison with physicians, residents, families, administrative personnel, appropriate staff and consultants in various disciplines regarding residents’ current physical/mental condition and the residents’ care needs.Oversees Medicare Utilization, Nursing Continuous Quality Improvement (CQI) Program, Informal Reconsideration (IR) Process, and participates in annual Resident Review Committee for all levels of care.Coordinates Risk Management Program and Infection Control Process for the community. Oversees department workplace safety and risk control programs to ensure employees are provided education and training regarding safe work practices and occupational exposure. Ensures all workplace injuries are reported and investigated in a timely and thorough manner in accordance to NCPHS procedures. Works with Human Resources and employees regarding Return-to-Work programs, Workers Compensation and Leave of Absence requests.Recognizes and reports concerns regarding residents' physical, mental and/or emotional status to a member of Management Staff.Performs other work as assigned.QUALIFICATIONS REQUIRED:Current licensed Registered Nurse (RN) in the State of California and CPR Certification. Bachelor of Science degree required from an accredited School of Nursing. Minimum of six (6) years practical experience in clinical nursing, two (2) years of administrative nursing experience and experience in rehabilitative care and/or acute care. Minimum of three (3) years management experience. Gerontological nursing experience highly desirable.SUPERVISORY RESPONSIBILITY:Full management responsibility for up to 60 employees and outside vendors. Manages directly or through Nurse Managers and/or Charge Nurses. "}