{"jobID": "2755917070", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.centro.net", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mediaocean, The Trade Desk, MediaMath"}, "estimatedSalary": "180000", "jobDescription": " We’re here to ensure the advertising industry and the people in it are healthy and engaging positively and effectively with those around them. We’re here, ultimately, to improve the lives of people working in the media industry. And we take our responsibility seriously.ABOUT THE PRODUCT AND ENGINEERING TEAMAt Centro, we’ve always been about making people’s lives better—from our employees to our clients. Today, we’re building a unified platform to execute every digital media advertising transaction, thus providing a new level of automation and intelligence in ad tech. This is an enormous task that will disrupt an industry and improve the lives of those who work within it.  To do this, we’re aggressively growing our team of engineers, product developers and designers. We are imaginative, passionate, determined and relentless in our efforts. Of course, we are fascinated by the complexity of engineering problems at this scale—it’s what brings bright minds together. But what keeps us coming back (and why we love coming to work everyday) is the chance to improve how work gets done: freeing up people’s time so that they can dream bigger and make life better.  Come build something amazing with us.ABOUT THE ROLEWe are seeking forward-thinking Data Engineer to join Data team. You will be involved in the design and implementation of the Data Platform. We're looking for a Data Engineer who has passion for data processing and the challenges presented by different types of data at high velocity.CORE RESPONSIBILITIESImplement scalable, fault tolerant and accurate ETL pipelines.Gather and process raw data at scale from diversified sources.Build enterprise business analytics and reporting applications.Develop platform services to operate the data applications at scale.QUALIFICATIONSProficiency with relational databases and SQL queries (Postgres, MySQL, Oracle or similar).Understanding of factors affecting performance of ETL processes and SQL queries, ability to work on performance tuning.Experience in data modeling for OLTP and OLAP applicationsExperience implementing data pipelines.Experience coding in Python.Experience with tools such as Git, Jenkins, Jira, IntelliJ.Experience with Pentaho is a plus.Knowledge of Hadoop ecosystem components (Spark, Hive, Impala, Kafka, Oozie) is a plus.Experience with other big data technologies such as Cassandra, MongoDB, Elastic Search is a plus.Knowledge of Scala is a plus.Ability to work independently as well as part of a team.Strong aptitude toward problem solving and working with different data sets.Having a passion and knowledge of AdTech industry is a plus.Have a Bachelor’s degree in computer science or software engineering.Centro is an Equal Opportunity Employer and does not discriminate against any employee or applicant on the basis of race, gender, age, disability or any other basis protected under the law."}