{"jobID": "2814251569", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.motiveinteractive.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Liftoff (Palo Alto, CA)"}, "estimatedSalary": "84000", "jobDescription": "Data Scientist Motive Interactive is a global mobile app optimization and marketing company that combines over 15 years of experience in the digital advertising industry and sophisticated programmatic technology to drive user acquisition for some of the world's top mobile app companies including Amazon, Apple and Pandora. In 2017, Motive Interactive was recognized as a top 20 partner by Singular's Mobile ROI index, a ranking that evaluates over 1000 mobile ad networks, 1500 apps, and over $3B in ad spend to identify the world's best performing ad networks across the globe. Additionally, Motive is recognized as part of Inc. 5000's exclusive Hall of Fame list for its five-year consecutive rating as one of the fastest-growing private firms in America. To continue the build-out of our programmatic capability, we are looking for a data scientist to join our engineering team full-time. Responsibilities:Mine and analyze data sets and develop machine learning/deep learning models to support programmatic advertising optimizationWork with Engineering team to productionize models and analyze model performance and data accuracyWork with stakeholders including Media buying, Product and Business teams to identify opportunities for leveraging our data to drive business growthHelp build our data platform including data pipeline, A/B test framework, external data evaluation and ingestion, etc.Qualifications: Skilled real world modeling with machine learning/deep learning techniques such as clustering, decision tree, random forest and artificial neural networksSolid foundation in statistics such as regression, correlation, statistical tests, etc.At least 4 years of data modeling experienceFamiliar with common data tools such as R, scikitLearn, Spark ML, Tensorflow, etc.Solid background in data analyticsStrong scripting and programming skills (Python experience preferred)Knowledge of SQL and experience with relational databasesGood written and verbal communication skillsPassionate about learningKnowledge of Ad technology and programmatic bidding is highly preferredEducation: PhD degree in Computer Science, Statistics, Data Science, Mathematics or related technical fields, is required"}