{"jobID": "2811788692", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Artificial Intelligence Consultant", "companyRating": null, "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": null, "jobDescription": "Job descriptionOrganization: Digital AnalyticsTravel: 100% (Monday – Thursday)Position: Data Science ConsultantJoin Accenture and help transform leading organizations and communities around the world. The sheer scale of our capabilities and client engagements and the way we collaborate, operate and deliver value provides an unparalleled opportunity to grow and advance. Choose Accenture, and make delivering innovative work part of your extraordinary career.  People in our Client & Market career track drive profitable growth by developing market-relevant insights to increase market share or create new markets. They progress through required promotion into market-facing roles that have a direct impact on sales. Analytics professionals create new insights from predictive statistical modeling activities that target and deliver value to our clients.  The Data Science Senior Consultant manages, architect and analyze big data in order to build data driven business insights and high impact data models to generate significant business value. Create models and processes to collect, distill and interpret data with a view to aid better, more informed decision making. Examine and explore data from multiple disparate sources with the goal of discovering insights which in turn can provide competitive advantage for our clients. Job DescriptionAnalytics professionals use quantitative methods to derive actionable insights and outcomes from data. A professional at this position level within Accenture has the following responsibilities: Analyzes and solves problems that are lower complexity and may be routine in nature, requiring varied responses depending on the situation.Interacts with peers within Accenture before updating supervisors.Likely has some interactions with non-management levels at the client and/or within Accenture.Receives minimal instruction on daily work tasks and a moderate level of instruction on new assignments.Decisions impact own work and may impact the work of others.  Individual contributor and/or oversees a small work effort and/or team.Additional Responsibilities:Understand customers business needs and guide them to solutions using AWS AI Services and Platforms.Collaborate with AWS Architects in AI project planning.Use DL/ML to create scalable solutions for business problemsDeliver ML/DL projects from beginning to end, including:Business understandingData aggregationData explorationModel building and validationModel deploymentUsing DL frameworks such as MXNet, Caffe 2, Tensorflow, Theano, CNTK, Chainer, Keras, etc.Using Amazon ML services and platforms such as SageMaker, Rekognition, Comprehend, Lex, etc. + Basic qualificationsBasic Qualifications:Bachelor 's degree in Computer Science, Statistics, Mathematics, Engineering or relatedA minimum of 3 year of experience of hands-on experience in data science and statistical modeling.A minimum of 3 year Experience using either one of the following (Python, R, Scala)A minimum of 3 year experience writing production level codeA minimum of 3 year Experience with Machine Learning libraries such as scikit-learn, mlr, mllibPreferred Skills:A Mater's or PhD in Computer Science, Machine Learning, Statistics, Mathematics, Engineering or related.industry experience in predictive modeling and data analysisexperience with deep learningTrack record of Artificial Intelligence consulting experienceExperience with AWS technologies such as Redshift, S3, EC2, EMR, etc.Experience working with GPUs to develop modelsExperience with large data sets and tools like Spark, MapReduce, Hadoop, Hive, etc.Using Amazon Machine Learning services and platforms such as SageMaker, Rekognition, Comprehend, Lex, etc.OUR COMMITMENT TO YOUYour entrepreneurial spirit and vision will be rewarded, and your success will fuel opportunities for career advancement.You’ll make a difference for some pretty impressive clients. Accenture serves many of the Fortune Global 100 on high-profile projects.Opportunities to learn daily through training, assignments and collaboration with experts across the company.Access to leading-edge technology.Along with a competitive salary, Accenture offers a comprehensive package that includes generous paid time off, 401K match and an employee healthcare plan. Learn more about our extensive rewards and benefitsCALL TO ACTIONNow is the time to become a digital disrupter. The opportunity is here—what’s stopping you from pursuing it?Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment OpportunityAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state or local law.  Accenture is committed to providing veteran employment opportunities to our service men and women. APPLY SAVE THIS JOBShare"}