{"jobID": "2733365155", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.saahp.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Functional Area:FA - FinanceEstimated Travel Percentage (%): No TravelRelocation Provided: NoVARIABLE ANNUITY LIFE INSURANCE COMPANY INCData Science is fundamentally changing the way we do business. At AIG Life and Retirement, we reinvent the business of financial services every day. Our mission is to help our participants retire confidently, improve our customer’s experience, and well, just be greater.  We are a team of high performers with diverse backgrounds—our roster includes marketers, economists, computer scientists, mathematicians, psychologists, and more. While our degrees may be different, we all share a passion for data and a desire to make an impact. We are looking for talented, curious, and creative Data Scientists to join our growing team.  You will be part of the decision and data science function for VALIC: including contributing to the development of predictive analytics, customer segmentation methodologies, marketing targeting, attribution and response models, as well as the evaluation of new data sources and perform advanced data processing technologies.  What you will do:  You will carry out data processing and analysis including statistical analysis, variable selection, dimensionality reduction, feature engineering, etc.  Build predictive models utilizing both traditional statistical methods (Generalized Linear Models,  Mixed Effects Models, Ridge, Lasso, etc.) and modern machine learning techniques (Gradient  Boosted Trees, Random Forests, Kernel methods, Deep Learning, etc.). You will help with the design, development, evaluation and monitoring of predictive models and advanced algorithms that help business to drive decisions throughout the customer lifecycle (prospecting, acquisition,  interactions, fraud, etc).  You will apply your technical data/ETL/programming skills to ingest, wrangle and explore external and internal data to create reports, function as the data expert and prepare data for modeling and support production deployment of models OR apply your technical modeling skills to build worldclass predictive models for solving tangible business problems.  Extract, clean, and manipulate large datasets (structured and unstructured) for model building.  Communicate (written and verbal) insights from quantitative analyses to technical and non-technical  audiences.  Stay current on the latest machine learning and big data trends.  Work with business sponsors and IT teams to implement analytic solutions.  Train, mentor, and lead junior data scientists.  Serve as a technical expert on one or more domains (e.g. Time Series Analysis, Text Mining, etc.)  You will leverage methods from diverse disciplines like machine learning, statistical modeling, information theory, information retrieval and other areas to gain customer insights, draw conclusions and work with business partners to put those insights into action.  You will work closely with business partners, technology and customer analytics teams to evaluate  new and alternate data sources as well as computing paradigms and analytical tools.  You will participate in data architecture decisions and partner with technology teams to implement models/algorithms in production systems.  You will apply your high energy level and business sense to communicate with internal stakeholders and external vendors while effectively contributing to complex analytics projects.  You will be part of a growing and exciting team and will help document your assumptions, methodologies, as well as carry out validation and testing to facilitate peer reviews and independent  model validation.  What you bring to the table:  Advanced degree (PhD or Masters) in quantitative areas like Applied Math, Statistics, Engineering, Computer Science or related disciplines.You have expertise in at least one modeling/machine learning platform such as R, Python, or SAS.You have knowledge of an additional general purpose programming language such as C++ or Java.You have advanced SQL skills and experience with NoSQL technologies.You have built several predictive models that have been put into live production.You obsess over sample bias, over-fitting, variable selection, missing values, etc.You understand the need to balance predictive power, interpretability, and ease of implementation.You appreciate that all models are wrong, but some are useful.Hands-on experience with multivariate analysis, statistical modeling, time series analysis, information theory, machine learning, clustering, and/or dimensionality reduction techniques in financial services, customer analytics, digital marketing, or similar domains.Prior modeling experience in risk, marketing response modeling and forecasting is strongly preferred.Experience with Machine Learning techniques including neural networks, Hidden Markov Models, support vector machines, and random forests, and others, is highly desired.Experience working with large data sets and Big Data tools and stack (e.g., Hadoop, Spark, etc.).Experience with one or more modeling tools (R, Matlab, Octave, etc/) and one or more mainstream programming language (Python, Java, C, Scala, C, C++, etc.).Ability to explain complex statistical models and analysis to drive business ideas. What you can expect from us: Unparalleled opportunity to apply state-of-the-art machine learning techniques to real world datasets.A friendly fast paced work environmentWork with highly intelligent and accomplished individuals who understand and value technical challengesA prompt and personal application process. If you’re well qualified for this position, we know you have several options in front of youNo egos, no bravado and no hostility. We value character and achievements, not who speaks the loudest in the roomAnd, if the process goes well, an extremely competitive offer It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission – creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives."}