{"jobID": "2543845435", "jobLocation": "San_Francisco_CA", "jobTitle": "Customer Relationship Marketing Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.housecanary.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " At HouseCanary, were using data and analytics to predict the future of US residential real estate. Our goal is to help people make better decisions by offering innovative and unparalleled insights. HouseCanarys platform accurately forecasts values 36 months into the future for four million residential blocks and more than 100 million properties.  We are seeking a passionate Customer Relationship Marketing (CRM) Manager to help develop and execute email and push-notification marketing strategies to drive engagement, product usage and loyalty.  What you will do: Own HCs email and SMS marketing, championing mobile experiences, deliverability, captivating prose and thoughtful offers/communicationsDesign, create and deliver robust marketing automation programs to support the growth and expansion of our core products while also improving retention and loyaltyUnderstand the needs of our target segments (investors, lenders, appraisers, and agents) to help deliver communications tailored to nurture them through the funnelUse marketing automation and customer relationship management tools to deliver timely and relevant campaigns with a focus on recency and relevancyGuide copywriters and designers in end-to-end campaign management including synthesizing quantitative and qualitative data into actionable insightsMaintain a clean, clearly segmented database through regular optimizations What you have: 3+ years of experience with CRM or email marketingSupreme project management skillsAbility to prioritize and manage multiple tasks involving cross-functional partnersProven ability to proactively develop B2B communication strategy, execute day-to-day tactics, and optimize based on performance trackingPassion for providing a delightful user experienceKnowledge of latest trends and technologies related to email marketing, automation, and marketing operations Bonus points for: Marketo and/or Salesforce expertiseExperience with Adobe Creative Suite and/or SketchAbility to code HTML and CSSFinancial services or real estate industry exposure HouseCanary is the authoritative source for accurate, uniform information, analyzed and visualized real-time to make better, faster decisions.  HouseCanary - see into the future of real estate."}