{"jobID": "2814432630", "jobLocation": "Seaside_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.perspecta.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2018", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DescriptionEvery day at Perspecta, we enable hundreds of thousands of people to take on our nations most important work. Were a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nations most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselvesto respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.Perspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many waysnot only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.Perspectas talented and robust workforce14,000 strongstands ready to welcome you to the team. Lets make an impact together.Perspecta has an immediate need in our US Public Sector group for a Data Analyst in Seaside, CA or Alexandria, VA  • Work under minimal direction; may lead small teams. Elicit, document, manage, and validate data requirements/specifications; using high-maturity methods, processes and tools.Conduct research on solutions to data problems; advise on methods to improve data related business processes.Produce Entity-relationship diagram (ERD) and Data Flow Diagram (DFD), user experience and configuration elements of solution design.Participate in proposals, feasibility studies, and new business development.Produce data dictionary for complex database and projects.Write complex database query, simple DB procedures, functions or packages to pull relevant data for analysis.Produce reports with medium complexity.Produce simple dimensional models. QualificationsEducation and Experience Required: Secret Or DOD Public Trust Clearance  6-8 years experience, Candidates with CAP (Certified Analytics Professional or equivalent certification would be preferred; , can Produce data dictionary, physical and logical data model.Experienced with RDBMS.Utilize DB tools and IDE to write complex database query, produce complex reports and prepare the date model.Structured analysis techniques (decomposition).Knowledge and Skills Required:"}