{"jobID": "2623290983", "jobLocation": "Jessup_MD", "jobTitle": "Data Scientist / Software Engineer - Big Data / Cloud", "companyRating": "3.9", "companyInfo": {"Website": "www.clearedgeit.com", "Headquarters": "Annapolis Junction, MD", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": " ClearEdge IT Solutions is seeking Data Science and Software Engineer Interns for Summer of 2018 (full or part time). This internship will provide the candidate with practical hands-on experience performing research and development across a wide range of big-data and cloud-related topics. The candidate will be provided with the opportunity to work with skilled engineers and administrators in a lab environment. ClearEdge will provide the candidate with real-world experience and technical mentorship throughout the internship. The internship may result in follow-on opportunities such as a continued internship, full-time employment, and/or clearance sponsorship. Tasking: Research various topics in the areas of software engineering, big data & cloud, data analytics, and data flow engineering using technologies such as Hadoop, MapReduce, Elasticsearch, Spark, MongoDB, Docker, Kubernetes, Jupyter, etc. Perform prototype development on the aforementioned topics and technologies Assist system administrators with the setup and configuration of various software systemsRequired Skills: Familiarity with Linux and basic shell commands A basic understanding of the Java programming language Flexibility in day-to-day tasking Strong debugging, problem-solving ability, and troubleshooting skills Ability to collaborate with other engineers and non-technical staffDesired skills: Familiarity with distributed computing frameworks Familiarity with Python Sound mathematical and statistics backgroundAdditional Requirements: Candidates must be currently enrolled student US citizenship is required"}