{"jobID": "2783018340", "jobLocation": "San_Diego_CA", "jobTitle": "Analytical Methods Development Scientist", "companyRating": null, "companyInfo": {"Website": "www.hologic.com", "Headquarters": "Marlborough, MA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Company - Public (HOLX) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " GE Healthcare, Illumina, Boston Scientific"}, "estimatedSalary": null, "jobDescription": "Job SummaryThe Scientist/Senior Scientist position will assume a leadership role focused on supporting Analytical Development to meet company pipeline objectives. The candidate will assure timely, appropriate method development, validation and implementation to meet project deadlines. The candidate will work with Quality group to ensure that high quality standards are maintained and appropriate documentation is completed.Essential Duties and ResponsibilitiesThe incumbent may be asked to perform other function-related activities in addition to the below mentioned responsibilities as reasonably required by business needs. Responsible for developing robust analytical methods prior to analytical method transfer to QC Provide technical and trouble-shooting support for analytical instrumentation and all analytical development activities.Trouble-shoot, calibrate, validate and maintain instruments for HPLC, and mass spectrometric methods.Keep up with new developments in analytical methods and make recommendations for implementation of new measurement methods and instrumentationIdentify, execute, and support process improvement initiatives to increase efficiency Oversees the resolution of product and process issues to ensure on-market product availabilityGenerates and presents proposals for product specification changes.Understands and is able to effectively put into practice the principles of root cause analysis and scientific method.Applies and interprets product and process risk analyses. Able to work independently and requires minimal guidance to perform required tasksWork with peers and/or subordinates to ensure timely completion of projects and tasksDemonstrate effective communication style working with all levels of organizational structure, through multiple departments, and across global sitesProvide leadership to junior staffEducation and ExperienceBS in Chemistry or Biochemistry with 6-8 years or MS with 4 to 6 years of relevant experience,SkillsExperience in developing and qualifying analytical methods, primarily HPLC and mass spectroscopyHands on experience with HPLC and mass spectrometry troubleshooting.Hands on experience conducting method transfer both as the originating and receiving groupExperience evaluating analytical data and drawing meaningful conclusionsExperienceStrong attention to detail, excellent written and oral communication skillsExperience working in a timeline driven settingKnowledge of cGMP expectations for laboratory records and quality systemsAbility to provide ideas for process improvements, and the enthusiasm to implementAbility to work with a team of individuals to meet goalsAgency and Third Party Recruiter Notice:Agencies that submit a resume to Hologic must have a current executed Hologic Agency Agreement executed by a member of the Human Resource Department. In addition Agencies may only submit candidates to positions for which they have been invited to do so by a Hologic Recruiter. All resumes must be sent to the Hologic Recruiter under these terms or they will not be considered.Hologic, Inc. is proud to be an Equal Opportunity Employer inclusive of disability and veterans."}