{"jobID": "2803614335", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.metso.com", "Headquarters": "Helsinki, Finland", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": "How about working with challenging tasks in a respectful and friendly working environment, developing world leading solutions, and being part of a global yet tight-knit network of 12,000 colleagues in 50 countries?  This is Metso.  Job posting end date: Position Summary Metso is looking for a Data Scientist to join our Digital Office functions in Waukesha, WI, USA.  We are developing digital services to Metso’s mining, aggregates and recycling equipment in our Digital Office. In this role, you will be working together with the rest of the data and analytics team in developing solutions for predictive maintenance, performance improvement and process optimization use-cases.  As a member of the team, you will have the ability to participate in the development of IoT(Internet of Things) solutions from the HW(Hardware) for data gathering all the way to business where the value of your work is captured. With the existing IoT platform and fresh data & analytics platform you have a great opportunity to put your skills to work right away and participate to further development work of these with the rest of the team of motivated and skilled professionals.  In this role, your responsibilities will include: Collaboration between the Digital Office and Metso business units, and proactively finding analytics solutions to the business needs.Development of predictive models and deploying them to the production environment (mean-time-to-failure, product recommendations, anomaly and failure detection, optimization, forecasting).Improving the data and analytics methodologies and capabilities within Metso,Visualizing and communicating the findings to the stakeholdersManagement and monitoring of the performance of the models and data accuracyQualificationsMaster’s of Science degree required or Ph.D. degree preferred in Statistics, Computer Science, Physics, Applied Mathematics, or other related degree.Relevant working experience in creating and using advanced machine learning algorithms (regression, simulation, clustering, classification, decision trees, neural networks, etc.) and distributed data/computing tools.Required technical skills in Python, (U-)SQL, HiveQL accompanied by knowledge of Agile working methodologies.Preferred technical skills in R, Spark, Scala, Docker and working in Azure environment.Good understanding of manufacturing and process industry or mining, aggregates and recycling equipment is a plus.You have business-savviness, a can-do attitude and good team-working capabilities.Excellent interpersonal and communication as well as coordination skills are needed in this role.We Offer We offer you an interesting role with monitoring solutions in a dynamic, global business environment. This is an excellent opportunity for a personal and professional development. You will get to influence and see the development of the solutions up close and be part of the Digital Office functions that has a significant role in Metso group’s strategy.  Metso is a world-leading industrial company offering equipment and services for the sustainable processing and flow of natural resources in the mining, aggregates, recycling and process industries. With our unique knowledge and innovative solutions, we help our customers improve their operational efficiency, reduce risks and increase profitability. Metso is listed on the Nasdaq Helsinki in Finland and had sales of about EUR 2.7 billion in 2017. Metso employs over 12,000 people in more than 50 countries.  metso.com, twitter.com/metsogroup"}