{"jobID": "2830956979", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Manager - Ad Systems", "companyRating": "2.2", "companyInfo": {"Website": "www.adcolony.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Vungle, Tapjoy, Chartboost"}, "estimatedSalary": "107000", "jobDescription": " As Product Manager for one or more of our ad systems, you'll partner with the Product, Design, and Engineering teams to help AdColony lead in mobile advertising. As a technical-creative, you will dissect ambiguous challenges as they develop into workable projects that engineers can build. Communication across teams is integral to the company, so your documentation skills of business requirements and implementation details will be essential to success. Your expertise in the product development and the advertising space will position you as a natural consultant to our teams. With an SDK footprint of over 1.3 billion users globally, AdColony has built an Ad Server Platform that runs at high scale and generates tremendous volumes of data. The Ad Server Platform receives requests from our mobile ad SDK and server-to-server ad exchanges communicate with our data science engine to predict the quality of users and respond with a relevant ad, all within very tight latency constraints.In this high visibility role, you will utilize experience with internet-based product development, qualitative and quantitative analysis, and agile development. You'll coordinate on the business aspects of the product backlog and participate in our Kanban development workflow. Responsibilities Identify market opportunities and define product vision and strategy. Launch product features on a regular basis. Understand customer needs and gather product requirements. Develop new products and enhance existing products. Engage closely with the product and engineering teams to help determine the best technical implementation methods as well as a reasonable implementation schedule. Manage project schedules, identify possible issues and clearly communicate them to project stakeholders. Take responsibility for release schedules and milestones, supporting a high velocity in a fast-paced environment. Provide business guidance for product success, coordinating priorities for products, UI/UX, data science, and engineering, leading cross-functional teams to take features to market, ensuring success metrics are informing future efforts, and quickly fine-tuning the product as needed.QualificationsMinimum Qualifications Bachelors degree or foreign equivalent degree or equivalent practical experience. 4 years of product management or related experience. Experience with product management or product design with a focus on internet products and technologies. Experience in advertising, marketing, or business development.Preferred Qualifications Proven successful product management outcomes from idea to launching programs in multiple contexts throughout your career. 5 years of relevant work experience. Ability to craft a compelling message and tailor it for a given audience. Ability to blend technical topics with simple, everyday language to deliver a story that is memorable and useful. Comfortable talking about technical matters with business people and business matters with technical people. Able to express complex concepts in plain language to reach broader audiences. Demonstrated ability to achieve strategic goals in an innovative and fast-paced environment. Ability to evolve product strategy based on research, data and industry trends. Knowledge of multiple functional areas such as Product Management, Engineering, UX/UI, Sales, Customer Support, Finance or Marketing. Excellent problem-solving, organizational and analytical skills. Perks and Benefits At AdColony, we believe that the health of our company mirrors the health and happiness of our people. Accordingly, our employees enjoy: A competitive compensation package with performance-based bonus incentives The opportunity to make meaningful contributions from day one A strong company culture where contributions are recognized and achievements are celebrated Great Medical, Dental, Vision, Life, and AD&D; insurance A 401(k) program with employer match Wellness/gym stipend Weekly catered lunches and fully-stocked kitchens with unlimited snacks and drinks Office outings and events (i.e. ball games, happy hours, company off-sites, and more) Best-in-class equipment to work with on a daily basis An informal work environment where you will be part of a talented, fun, and collaborative team AdColony Goals AdColony is on a mission to make mobile advertising experiences more meaningful and rewarding for users, app publishers, and advertisers. Were building a company that cares deeply about the way users encounter and interacts with ads to help them find new apps that theyll enjoy and to connect with brands they value. That is reflected in our company values of transparency, empowerment, one team, and doing the right thing, and were looking for more like-minded people to help us iterate, solve problems, and invent."}