{"jobID": "2650779792", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.goat.com", "Headquarters": "Culver City, CA", "Size": "201 to 500 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "With over 7 million members and more than 400,000 listings, GOAT is the worlds largest marketplace for authentic sneakers. Were looking for a Data Engineer to help us build out our data pipelines and projects from the ground up!In this role you will: Support existing data pipelines and systems in productionDesign and develop new ETL data pipelines and streaming processes that are highly available, scalable, and reliableDesign, maintain and optimize highly distributed analytics data storesLeverage AWS managed services to streamline data transfer while maintaining availabilityWork with engineering, analytics, and product stakeholders to define data ingestion standards and best practicesWe are looking for:BS/MS in Computer Science, Computer Engineering or related technical discipline3+ years experience building and maintaining large scale analytics systems2+ years programming experience, Python preferred, GoLang and Java is a plusStrong understanding of architecting, developing, and maintaining cloud technologies on the AWS platformExperience with distributed databases and data warehouses - Postgres, DynamoDB, RedshiftExperience with distributed computing like Hadoop or MesosExperience building out distributed streaming applications with Kafka or KinesisExperience with Elasticsearch is a plusBenefits & Perks:Join the early team and work closely with founders on all aspects of the companyMedical, dental and vision coverageCompetitive salaryDaily catered lunches from LAs best restaurantsUnlimited vacationFounded in 2015 and based in Los Angeles, California, GOAT is the safest way to buy and sell sneakers. Whether youre looking to buy rare sneakers, discover new ones, or earn money by listing sneakers you already own, GOAT is your destination. And with an authentication service, buyer protection guarantee and great customer service, its the safest option in the industry.We are backed by some of the leading names in venture capital including Accel Partners, Andreessen Horowitz, Ashton Kutcher, Guy Oseary, Matrix Partners, NEA, SV Angel, Upfront Ventures and Y Combinator.GOAT will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance, if applicable."}