{"jobID": "2712140473", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "69000", "jobDescription": "Job Description The Senior Data Analyst within the CACI Data Analytics lab is responsible for providing senior-level support for cases within the lab. This includes managing cases from initiation to closure, developing deliverables and serving as a primary point-of-contact for Attorneys and Case teams. Senior Data Analysts gather a wide variety of data types from primary and secondary sources through diverse channels using a combination of methods that will be researched and employed by the Data Analytics Lab Management team. Senior Data Analysts develop, maintain, and enforce streamlined and efficient processes for project lifecycles, from collection through transformation of data; manage timelines, training, resources, and budgets; and assist senior staff in the finalization of client deliverables. Manage the collection, documentation, vetting and onboarding of data, manage the database development and set up, and oversee the population of data into the appropriate analytical tools. Must have the ability to guide and assist other data analysts as required. POSITION SUMMARY: The senior systems analyst is responsible for defining, developing, and communicating data analytics solutions to support the customer. This includes: corresponding with key case personnel to elicit requirements and provide regular status updates,performing data analysis and modeling to understand and identify data relationships/trends/classifications/predictions,proposing reporting solutions that best present the information to the end user, anddelivering the completed solution. This position requires strong analytical, problem solving, and communication skills with a keen attention to detail. Additionally, the problems and toolset are quite varied, and the candidate should take the initiative to attack new challenges and learn new skills independently. This person must be well organized and flexible. We desire someone with the diverse experience and skills in data analysis, litigation support, statistical software, analytic programming languages (Python, R, Java, SAS), visualization software, database management. RESPONSIBILITIES:Take the lead in working with client case teams to identify their needs and jointly develop solutions through leveraging all available analytic and visualization optionsConduct regular consultations with clientsProvides regular status updates regarding assigned tasksEnsures successful completion of work, timeliness of deliverables, and quality controlBuild experience in all available analysis and visualization softwareQualificationsEDUCATION & EXPERIENCEBachelors degree or equivalent; 5+ years of experience using analytics tools, methods, and visualization softwareSignificant experience in one or more of the following tools is required: IBM i2 Analyst Notebook / EIA / iBasePalantir GothamBackground in Law Enforcement, Data Science, Investigation, Data Analysis, or StatisticsIndustry analytics/business intelligence knowledge including current industry trends and challenges, including data quality approachesDeep understanding of database, ETL, and analytics tools and conceptsMust be able to work independently and prioritize work effectively, as well as to function as an effective team member in a local and virtual team development environmentStrong analytical and problem solving skills with an unsurpassed attention to detailExcellent communication (written and verbal) skillsExperience supporting federal agenciesSQL experience is required What We Can Offer You: Weve been named a Best Place to Work by the Washington Post.Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.We offer competitive benefits and learning and development opportunities.We are mission-oriented and ever vigilant in aligning our solutions with the nations highest priorities.For over 55 years, the principles of CACIs unique, character-based culture have been the driving force behind our success. Job Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}