{"jobID": "2570538328", "jobLocation": "Hamilton_NJ", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.mdlab.com", "Headquarters": "Hamilton, NJ", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 17-0360 Post Date 2/15/2018 Title Research Scientist City Hamilton State NJ Company Medical Diagnostic Laboratories LLC DescriptionMedical Diagnostic Laboratories, LLC (MDL) is a CLIA certified clinical laboratory with multiple state licensing, specializing in state of the art, automated DNA based molecular analysis of a variety of chronic and infectious illnesses. ONCOVEDA Cancer Research Center at MDL has an opening for a PhD level immuno-oncology specialist to complement its existing drug-discovery effort in this new and expanding area. The successful applicant will become a core member of a small team of  senior and junior scientists with expertise in immunology, drug-discovery, pharmacology, assay design, cytokine biology, immunogenetics, tumor biology and human cancer. This position is based entirely in the laboratory. Job Duties:Develop, validate, and implement biochemical and cell based assaysDevelop and maintain cell linesEnter and analyze data using software such as Microsoft Excel and GraphPad PrismWrite reports and presentations on research dataProgram and operate microplate readersPerform related job duties as required RequirementsJob Requirements:As a successful applicant, is a scientist who has experience in innate immunology, specifically, cGAS-STING axis and induction of type I interferons (IFNs) or related IFN experience.Strong bench skills in several of the following areas are required: mammalian cell culture; cell line engineering, cell based assay development, enzymatic assay development, protein purification, and standard molecular and cellular techniques.Some expertise in flow cytometry, immunology based techniques, or high throughput screening is a plus.A strong publication record.Excellent written, spoken and presentation skills to specialists and non-specialists.Excellent interpersonal skills.We OfferMedical, Dental & Vision InsuranceShort and Long Term DisabilityLife InsuranceDependent Care Flex Spending AccountVoluntary Policies (Accident, Hospital Indemnity, Critical Illness & Supplemental STD)Legal Plan & Identity Theft Protection401(k) PlanPaid Vacation & HolidayBusiness Casual Environment Visit us at www.mdlab.com  Medical Diagnostic Laboratories, LLC is an equal opportunity employer"}