{"jobID": "2837900971", "jobLocation": "Austin_TX", "jobTitle": "Engineering Scientist - Storage Architect", "companyRating": "4.3", "companyInfo": {"Website": "www.utexas.edu", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1883", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " Engineering Scientist - Storage Architect Hiring department TACCMonthly salary $7,916 - $8,333+ depending on qualificationsHours per week 40.00 Standard from 800AM to 500PMPosting number 18-07-03-01-4204Job Status OpenFLSA status ExemptEarliest Start Date 07/03/2018Position Duration Funding expected to continuePosition open to all applicantsLocation Austin - J. J. Pickle Research Campus (North Austin)Number of vacancies 1 General NotesNone provided Required Application Materials  A Resume is required in order to apply A Letter of Interest is required in order to apply. A List of 3 References is required in order to apply. Additional Information  PurposeThis position will provide technical expertise and leadership to TACC's Advanced Computing Systems group focusing on storage research, development and production system management. Essential FunctionsOperate the production parallel file systems at maximal availability maintaining expected performance levels. Identify performance issues and provide timely resolution of errors preventing global outage in data access to the file systems. Track of the production system usage trends and identify upgrade strategies based on observed operational issues in conjunction with evolving user demands and feedback. Investigate the upcoming storage technologies and evaluate the relevant impact on TACC's expectation and needs. Monitor and troubleshoot interconnect and tiered storage based on in-depth understanding and working knowledge of each layer correlating error messages and the failing component. Act as system administrator to deploy, maintain and keep large scale systems operational. Marginal/Incidental functionsOther related functions as assigned. Required qualificationsBachelor's degree in engineering, computer and information science or other applied sciences. Three years of experience. Excellent troubleshooting skill including the ability to quickly recognize the diverse failure modes and corresponding symptoms. Expert knowledge in designing and implementing InfiniBand (IB), OmniPath Architecture (OPA), and Fibre Channel (FC) networks. Experience with High Availability tools including Pacemaker and Corosync. Familiarity in machine room environment with ability to evaluate power and cooling requirements and design redundancy tests. In-depth knowledge of benchmarking tools with clear understanding of what different tunable parameters measure. Excellent verbal/written communication skill in a team environment. Ability to collaborate with team members, external vendors as well as a diverse user community. Equivalent combination of relevant education and experience may be substituted as appropriate. Preferred Qualifications10+ years of experience in parallel file system in HPC environment with corresponding experience in high speed interconnects and RAID technology. Interest in additional parallel file systems beyond Lustre, GPFS and ability to identify their limitations and potential extension for exa-scale I/O requirements. Experience configuring, operating and maintaining HPC Linux clusters. Knowledge of hardware based RAID solutions available beyond traditional spinning disk arrays.Experience with DataDirect Network controller solutions with either Lustre or GPFS filesystem Understanding of RAID principles including the declustered arrays and their operational issues. Working knowledge of ZFS and its Lustre version in the context of parallel system backend. Experience in an academic research environment. Working conditionsMay work in all weather conditions May work in extreme temperatures May work around standard office conditions May work around electrical and mechanical hazards Repetitive use of a keyboard at a workstation Climbing of ladders Lifting and movingA criminal history background check will be required for finalist(s) under consideration for this position.  The retirement plan for this position is Teacher Retirement System of Texas ( TRS ), subject to the position being at least 20 hours per week and at least 135 days in length.  The University of Texas at Austin, as an equal opportunity/affirmative action employer, complies with all applicable federal and state laws regarding nondiscrimination and affirmative action. The University is committed to a policy of equal opportunity for all persons and does not discriminate on the basis of race, color, national origin, age, marital status, sex, sexual orientation, gender identity, gender expression, disability, religion, or veteran status in employment, educational programs and activities, and admissions.  If hired, you will be required to complete the federal Employment Eligibility Verification form, I-9. You will be required to present acceptable, original documents to prove your identity and authorization to work in the United States. Information from the documents will be submitted to the federal E-Verify system for verification. Documents must be presented no later than the third day of employment. Failure to do so will result in dismissal.  UT Austin is a Tobacco-free Campus"}