{"jobID": "2687600207", "jobLocation": "Livonia_MI", "jobTitle": "Tractor Trailer Driver", "companyRating": null, "companyInfo": {"Website": "www.upsjobs.com", "Headquarters": "Atlanta, GA", "Size": "10000+ employees", "Founded": " 1907", "Type": " Company - Public (UPS) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Tractor Trailer DriverUPS is hiring individuals to work as full-time, temporary, seasonal Tractor-Trailer Drivers. This position involves driving a tractor-trailer unit to one or more destinations and then returning to the original domicile during the same work shift. Some work is performed outdoors.  Seasonal Tractor-Trailer Drivers typically work weekdays (Monday through Friday) and are required to meet driver appearance standards. UPS Tractor-Trailer Drivers usually begin work in the evening and finish the following morning.  Applicants must pass a DOT physical and successfully pass a UPS road test. Qualified applicants must have a valid commercial driver’s license issued in the state that you live and a doubles endorsement is desired. Tractor-Trailer Drivers are expected to comply with UPS appearance guidelines and wear the company-provided uniform. UPS also requires a copy of your motor vehicle record driver abstract that has been issued within the past 30 days.  This job posting includes information about the minimum qualifications (including the UPS Uniform and Personal Appearance Guidelines), locations, shifts, and operations within the locations which may consider my application. An applicant or employee may request an exception or change to, or an accommodation of, any condition of employment (including the UPS Uniform and Personal Appearance Guidelines) because of a sincerely held religious belief or practice.UPS is an equal opportunity employer – race/color/religion/sex/national origin/veteran/disability/sexual orientation/gender identity"}