{"jobID": "2817690795", "jobLocation": "Troy_MI", "jobTitle": "Data Scientist, Junior", "companyRating": "3.1", "companyInfo": {"Website": "www.aquilent.com", "Headquarters": "Laurel, MD", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " Employee Type: Full-Time Location: Troy, MI Job Type: Entry Level, Science Experience: Not Specified Date Posted: 6/14/2018 About Us At Booz Allen, we harness our collective ingenuity to solve our clients' toughest management and technology problems. We work with governments, Fortune 500 corporations, and not-for-profits around the globe, in industries ranging from defense to health, energy to international development. We believe there is no product, code, or strategy that can create progress-only people can. That's why for more than 100 years we've empowered our team: over 24,000 dreamers, drivers, and doers who work together to change the world. Job Description Job Number: R******* Data Scientist, Junior Key Role: expertise in advanced analytics to accelerate deeper insights from Big Data sources, including unstructured text, images, full motion video, and acoustics. Work as part of a client facing team to assess customer challenges, design or build data products, and present technical results. technical training and experience with applied mathematics or statistics, natural language processing, and machine learning. Leverage experience with scaling data products across distributable Cloud environments. Basic Qualifications: -Experience with applying advanced statistics, including natural language processing and machine learning -Experience with building data products using open source programming languages, including Python, R, or JavaScript -Experience with scaling data products across distributed computer environments, including Hadoop -Secret clearance -BA or BS degree Additional Qualifications: -3+ years experience with applying advanced statistics, including natural language processing and machine learning -MA or MS degree preferred Clearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required. We're an EOE that empowers our people - no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran status - to fearlessly drive change. SIG2016"}