{"jobID": "2824842822", "jobLocation": "San_Francisco_CA", "jobTitle": "Tax Senior (Partnership Tax)", "companyRating": null, "companyInfo": {"Website": "www.bpmcpa.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Novogradac & Company, Moss Adams LLP, Armanino"}, "estimatedSalary": null, "jobDescription": "BPM Overview:BPM is a full service accounting firm providing comprehensive assurance, tax, and consulting services to clients globally. We are one of the largest California-based accounting firms and have built our success by focusing on our clients and our people. Our client base encompasses a complex array of sophisticated clients that keep our staff intellectually challenged every day.Our people-centered culture and firm motto Because People Matter has allowed us to be consistently recognized as one of the Best Places to Work in the Bay Area. We are dedicated to providing meaningful careers for all of our employees along with fostering an environment that allows an integrated lifestyle. Our flexible culture allows our professionals to live a balanced lifestyle between their work responsibilities and personal commitments.Learn more about BPM on Glassdoor or some key leaders on our Partnership Tax team like Jackie Matsumura, Erik Weinapple, and Helen Williams on LinkedIn. You will likely meet some of these people during your interview process! We Have: A unique people-centered culture that attracts the brightest and most forward-thinking accounting professionals.The resources, expertise, and global capability of a Big Four accounting firm together with the responsiveness and accessibility of a local firm.A regional presence in the Bay Area, while still serving our clients nationally and internationally.Recognition as one of the Bay Areas Best Place to Work and No. 1 Best Large Accounting Firm to Work for by Accounting Today.You Have (Requirements):2+ years experience in public accounting with an emphasis in Partnership Taxation..BS/BA degree in Accounting or related field (Masters degree a plus)Licensed CPA, or in the process of obtaining the CPACapability to research complex tax issues and exposure to a variety of entities and industries.Strong analytical ability and problem-solving skills.Excellent communication and presentation skills.Demonstrates proactive thinking.Experience developing and training associate level professionals.You Will (Job Responsibilities):Provide tax compliance and consulting to a diverse base of partnership clients in the Real-Estate, Crypto Currency, Venture Capital, and Private Equity space.Develop and deliver innovative financial planning ideas that meet or exceed client expectations.Oversee complex tax research projects for a variety of clients and diverse industries.Work with clients to minimize their federal, state, and local tax liability.Supervise tax associates' assignments and managing the day-to-day delivery of tax compliance / consulting services to the client.Develop and motivate tax associates by providing them with counseling, leadership and career guidance.LinkedIn Code: #LI-AW2"}