{"jobID": "2837671432", "jobLocation": "N_o_n_e", "jobTitle": "Retirement Planning Consultant", "companyRating": null, "companyInfo": {"Website": "www.transamerica.com", "Headquarters": "Baltimore, MD", "Size": "5001 to 10000 employees", "Founded": " 1904", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " MetLife, Prudential, New York Life"}, "estimatedSalary": null, "jobDescription": " Job Description Summary  Provides dedicated on-site support, educational and advisory services for a major client at one or more locations. Ensures that overall program objectives are met, including the delivery of quality group educational meetings and one-on-one retirement meetings. Serves as a trusted connector to Transamerica products and services for retirement advice.  Job DescriptionResponsibilities Develop and execute strategies and approaches to promote participant action toward a fully funded retirement; deliver on key plan metrics (i.e. retirement outlook, increase participant deferral rates, etc.).Develop and manage client relationships from an educational perspective; build and foster productive relationships with Human Resources, management team and participants.Conduct group education meetings, deliver workshops, webinars and enrollment meetings to achieve client and Transamerica goals.Conduct one-on-one retirement planning meetings with client employees.Use Transamerica products and services to help participants deliver a strategy to meet retirement objectives.Provide participants with insight into the funds offered under each client plan, including fund objectives and performance.Identify asset retention needs and initiate discussions with participants, including opening and funding solutions as an IAR and/or referring opportunities to the Transamerica Advice Center. Retain assets in plan and roll plan assets to an IRA under DOL fiduciary advice rules.Explain and ensure participants understand product options; make appropriate recommendations.Work with participants with multi-product needs and connect with other product specialists as needed.Maintain current and accurate records to document progress towards goals.Promote, educate and enroll participants into Managed Advice; provide on-going financial and planning support to participants in the Managed Advice program.Provide ongoing support to high value participants that leave their employer and choose to keep assets within the Transamerica plan.Hold regular meetings with internal partners, such as client executives, communication directors, account managers and other key company stakeholders.Participate in projects for the expansion or enhancement of the Retirement Education and Planning Services organization. Qualifications Bachelors degree in a related field or equivalent business experience.FINRA Series 6 or 7.FINRA Series 63, or obtain within six months.FINRA Series 65 or 66, or obtain with six months.Retirement Plans Associate (RPA) or Charted Retirement Plan Counselor (CRPC), or obtain within 12 months. Higher certification (e.g. CFP, CRC, CEBS, ChFC, CIMA, CRPS) acceptable in lieu of RPA or CRPC.Three years of financial services or related experience. Behavioral Qualifications Strong communication and interpersonal skills.Presentation skills to support the sales process.Self-motivated to drive toward set targets.Organization and time-management skills.Ability to quickly learn new systems/technology. Preferred Qualifications Certified Financial Planner (CFP) Our Culture  At Transamerica we promote a Future Fit mindset. What is a Future Fit mindset? Acting as One fosters an environment of positive collaboration.Accountability allows us to own the problem as well as the solution.Agility inspires new ideas, innovation and challenges the status quo.Customer Centricity encourages an above and beyond approach to our customer. Working Conditions Office environment.Occasional local travel."}