{"jobID": "2836979294", "jobLocation": "Houston_TX", "jobTitle": "Business Intelligence Analyst III", "companyRating": "2.8", "companyInfo": {"Website": "www.nblenergy.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1932", "Type": " Company - Public (NBL) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Marathon Oil, Cabot Oil & Gas, Murphy Oil"}, "estimatedSalary": "120000", "jobDescription": " Description Job Title Business Intelligence Analyst III Location Houston, TX, US Organization Name 2021 Business Analytics Brief DescriptionGathers and drives stakeholder requirements and product vision through the planning analysis, development, and testing phases. Responsible for working closely within IT and the end user community and assists to define, plan and monitor business and technical projects impacting Noble’s information strategy. Must be able to work at a detailed level while maintaining a broader view of overall business goals and objectives. Responsible for the timely delivery and quality of information systems projects that meet the business goals and objectives established within area of responsibility. Detailed DescriptionWorks with Sr. Business Intelligence Analysts in defining, planning and monitoring business and technical projects.Establishes, maintains and ensures compliance with standards and procedures for design, development, testing, and documentation, contributing to high quality, reliable and serviceable systems that meet or exceed business needs.Functions as a technical resource for reporting projects utilizing Business Intelligence applications.Designs Business Intelligence dashboards, scorecards, charts/graphs, drill-downs, and dynamic reports to meet the new information needs.Translates stakeholder requirements into various documentation deliverables such as functional specifications, use cases, workflow/process diagrams, and data flow/data model diagrams.Assists in the design of Business Intelligence dashboards, scorecards, charts/graphs, drill-downs, and dynamic reports to meet the new information needs.Assists in the development of logical and physical data models to create and maintain database schemas in support of BI/DW requirements.Assists the BI Solution Reporting lead for the installation, configuration and administration of Business Intelligence applicationsAssists in establishing, maintaining and ensuring compliance with standards and procedures for design, development, testing, and documentation, contributing to high quality, reliable and serviceable systems that meet or exceed business needs. Job RequirementsBachelor’s degree in Business, Computer Science or EngineeringTypically requires 5 years of experience in relevant application design and development methods, business requirements analysis, software integration, operational readiness, service level agreements and system support of a continuous operating environment.Two years of experience in assisting in designing, building, deploying and sustaining enterprise Business Intelligence / Data Warehouse reporting solutions.Three years of experience working within an established project management framework.Experience providing reporting and BI solutions within the Oracle E-Business Suite (EBS)Strong design and development experience with Business Intelligence systems utilizing Oracle database and Oracle Business Intelligence Enterprise Edition (OBI EE) reporting tool including hands-on experience with OBIEE administration.Experience with OBIA.Strong design and development experience with Spotfire.Strong experience in data warehouse design, dimensional modeling, and ETLUnix/ Linus experience a plus Additional DetailsNormal office environmentMust be legally authorized to work in the United States without visa sponsorship. Apply Now!"}