{"jobID": "2794985324", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Manager (Research Science)", "companyRating": null, "companyInfo": {"Website": "www.grubhub.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (GRUB) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " DoorDash"}, "estimatedSalary": null, "jobDescription": " About The Opportunity Got a taste for something new? We’re Grubhub, the nation’s leading online and mobile food ordering company. Since 2004 we’ve been connecting hungry diners to the local restaurants they love. We’re moving eating forward with no signs of slowing down. With more than 80,000 restaurants and over 14 million diners across 1,600 U.S. cities and London, we’re delivering like never before. Incredible tech is our bread and butter, but amazing people are our secret ingredient. Rigorously analytical and customer-obsessed, our employees develop the fresh ideas and brilliant programs that keep our brands going and growing. Long story short, keeping our people happy, challenged and well-fed is priority one. Interested? Let’s talk. We’re eager to show you what we bring to the table.  Some Challenges You’ll TackleAs a Lead Research Scientist, you will be responsible for managing a team of Research Scientists who work closely with business units and engineering teams to cultivate a deep understanding of the ever-evolving systems, processes, and most importantly, data upon which our business runs. You will use this understanding to transform our data and big data into supporting data structures, metrics, statistical models, and ad hoc analysis providing actionable insights to inform and improve decision-making at all levels of the business. Support product growth through a combination of statistical modeling, data mining, and other data science methodologiesMaintain research best practices through peer review, socialization of knowledge, and other new methodsMentor and develop team of research scientists to improve overarching business metricsDevelop and target new opportunities for large research projects You Should Have 7+ years’ working experience, including 2+ years of demonstrated leadership experience.Intellectual and analytical curiosity – initiative to dig into the \"why\" of various results.Expertise with SQL based query languages and relational data concepts is a must.Solid understanding of online analytics metrics and KPI formulationFamiliarity with statistical analysis tools such as R and PythonDirect experience managing a team of data scientistsSubstantial experience with machine learning and advanced statistical methodsExcellent communication skills – requires confidence in communicating complex test result findings and recommendations persuasively, in a compelling and easy to understand manner.Got these? Even better:Experience with a compiled programming languageFamiliarity with data warehousing conceptsExperience with data processing on large clusters via MapReduce or SparkExperience with model productionization including best practicesExposure to geospatial data including spatial econometricsData modeling experience for Cassandra or other NoSQL column-stores.Conceptual, non-technical understanding/familiarity with big data pipelines and flows.Experience with Python or Scala for sourcing, manipulating, and analyzing data.Experience working with big data e.g. Hadoop/Hive/Spark. And Of Course, Perks! Unlimited paid vacation days. Choose how your time is spent.Never go hungry! We provide weekly GrubHub/Seamless credit.Regular in-office social events, including happy hours, wine tastings, karaoke, bingo with prizes and more.Company-Wide Initiatives encouraging innovation, continuous learning and cross-department connections. We deliver favorites every day. Join us as we move eating forward. Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster. Grubhub is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and your contact information."}