{"jobID": "1954611712", "jobLocation": "Paso_Robles_CA", "jobTitle": "Physical Therapist", "companyRating": null, "companyInfo": {"Website": "www.wilshirehcs.org", "Headquarters": "San Luis Obispo, CA", "Size": "Unknown", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Physical Therapist - Full Time, Part TimeWilshire Home Health is a mid-sized, well established home health agency located in San Luis Obispo; our service area includes San Luis Obispo and Northern Santa Barbara counties. We offer a comprehensive benefits pkg. including competitive wages and mileage reimbursement. We also offer family friendly schedules, progressive technology, and a Mentoring Program for staff new to home health. The Physical Therapist, as an integral part of our interdisciplinary team, develops and implements a plan for providing physical rehab therapeutic treatment and education to patients, family and/or caregivers in the home setting. Knowledge of assistive devices, transfer techniques, home safety, gait training techniques and pain control modalities is essential. Requirements:Current California PT licenseCPR certificationCalifornia driver's licenseAt least of 1 year experience is required.  Our agency supports progressive technology and uses a tablet-based electronic records system, therefore a willingness to learn our software program is essential. Benefits start on the first of the month after 30 days. (full time) Several different health insurance plans to choose from.DentalVisionLife insuranceDisability insurance.Paid Time Off (PTO)403B Retirement Savings PlanScholarship programGym membership discountCompany phone providedPaid mileage Join our supportive interdisciplinary rehab team treating patients where they recover best - in their own homes.  Wilshire Home Health is part of the Wilshire Health & Community Services family, a local not-for-profit health and community services oriented organization which has been established on the Central Coast since 1998. For more about our organization, please go to www.wilshirehomehealthcc.org."}