{"jobID": "2761604222", "jobLocation": "Washington_DC", "jobTitle": "Reliability Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "Clearance Level Must Currently Possess:Interim SecretClearance Level Must Be Able to Obtain:SecretSuitability:No Suitability RequiredJob Family:Engineering & SciencesJob Description:The Reliability Data Analyst will support ship acquisition programs in maintaining the readiness of in-service ships. Accessing, analyzing, and developing metrics from a relational database in support of Reliability Engineering efforts. Coordinate with R&M; team to develop reports, metrics, and data sets in support of Program Office initiatives.Responsibilities will include:Maintain a relational reliability database to track and analyze failure data for trends. Work with the R&M; Program Modeling & Analysis team during analysis of recent failure events and previous failure data to identify potential high priority reliability issues.Work with R&M; team to analyze data and provide failure trending at the system, sub system and component level.Assist R&M; team with the development of top-level, summary, decision-quality information and materials for presentation, including results of analysis where necessary.Develop inputs to R&M; reports including failure curves, tables, risk charts, and other relevant KPIs. Basic Qualifications:US CitizenshipBachelor's degree or equivalent combination of education and experienceThree or more years of experience utilizing relational databases for engineering and statistical analysisProficiency in Microsoft Office products (specifically Excel, Word, and PowerPoint)Preferred Qualifications:Bachelor's degree in electrical engineering, mechanical engineering, reliability, statistics or related field preferredU. S. Navy surface ship operational and maintenance experienceExperience working with statistical analysis, engineering reviewsShipboard Operational, Repair, and Maintenance experienceExperience with Reliability Centered MaintenanceExperience in developing data sets, trending curvesExpertise in development of maintenance work packages based on predicted reliability analysesExperience with Naval Sea Systems Command, Original Equipment Manufacturers, and In-service Engineering Support AgentsPresentation skills to provide management, customers and vendors recommendations/suggestions of product change and/or issuesActive DoD Secret Security Clearance# of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Some Telecommuting AllowedWork Location:USA DC Washington - 1201 M St SE (DCS006)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}