{"jobID": "2807332030", "jobLocation": "Troy_MI", "jobTitle": "Healthcare - Account Optimization Specialist - Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.htcinc.com", "Headquarters": "Troy, MI", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Syntel, Infosys, Hexaware Technologies"}, "estimatedSalary": "65000", "jobDescription": " Account Optimization Specialist - Knowledgebase Specialist II  Ref #10356  Location: Troy, MI  Employment Terms: Perm Duties: The experienced Account Optimization Specialist will collect, analyze data from multiple internal and external sources and organize it into a Client Optimization Plan. The analyst must be able to think critically and tackle complex requests. The Account Optimization Specialist will need to identify opportunities, root cause issues, develop solutions and work with a cross functional team to provide recommendations to clients. The AOS must be able to manage a project plan and facilitate group project meetings. You will respond to client requests, support Manage Your Business initiatives and communicate with all levels of leadership. Responsibilities: Design and produce user-friendly intelligence reporting; business metrics, reports, dashboards and data solutions  Summarize and simplify data for client review  Create & manage project plans to ensure the accurate development and execution of solutions for the life cycle of improvements  Work independently to initiate, identify and coordinate the analysis of client workflows, business processes and requests  Maintain library of model documents, templates or other reusable knowledge assets  Providing analytical support to clients/management; identify/anticipate needs  Supporting multiple account CRMs in Managing Your Business activity  Work on account optimization requests from sales/PEX Leadership Knowledge, Skills and Abilities (KSAs): Ability to think critically and tackle complex challenge  Microsoft Office software suite/Advanced Excel skills; Proficient in functions, pivot tables and macros  Strong statistical knowledge  Strong oral and written communication skills  Ability to work in a fast paced environment  Working knowledge of Electronic Health Record workflows and/or system applications (Remedy)  Outstanding interpersonal skills able to articulate across all levels of an organization Education and Experience: Bachelors degree in Business or Computer Science  3-5 years data analysis experience  5+ years in healthcare IT or industry relevant experience preferred  Green Belt of Lean Six Sigma preferred EEO/M/F/V/H Contact: Eric.Harrison@htcinc.com"}