{"jobID": "2738332708", "jobLocation": "Livonia_MI", "jobTitle": "Senior Research Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.cooperstandard.com", "Headquarters": "Novi, MI", "Size": "10000+ employees", "Founded": " 1960", "Type": " Company - Public (CPS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " American Axle & Manufacturing, Aptiv, BorgWarner"}, "estimatedSalary": "101000", "jobDescription": "Summary:Cooper Standard is a Tier 1 global automotive supplier committed to success through innovation and technology. The company has been investing aggressively in materials-related innovations since 2014. In late 2017 we opened our Global Technology Center in Livonia, Michigan, which contains unique capabilities for materials development, industrialization, and product validation. The Senior Research Scientist will build a research agenda and oversee investigations into relevant areas of materials science.Responsibilities:Engage with product line leaders to understand the state of technology in the industry.Evaluate technical potential of the company’s material science innovations through analysis or structured trials and testing.Propose & execute a research agenda to develop superior solutions for basic materials and / or processing techniques.Engage with external partners in industry and academia as needed to ensure we maintain technological leadershipEducation & Experience Desired:Ph.D. or established record of significant research achievements in any of the following areas: Chemistry, Chemical Engineering, Polymer Science, Materials Science, or related fields.Expertise with any of the following materials or processes: Rubber (natural & synthetic), thermoplastic resins, silanes, coatings, polymer extrusion process, polymer injection molding process.Not required, but the ideal candidate will also have capability for analytical techniques such as modeling and simulation or machine learning.The candidate must have a mindset and history of creative thinking and flexible problem solving in a dynamic environment."}