{"jobID": "2816047552", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.evolenthealth.com", "Headquarters": "Arlington, VA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (EVH ) ", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "It’s Time For A Change…Your Future Evolves Here Evolent Health has a bold mission to change the health of the nation by changing the way health care is delivered. Our pursuit of this mission is the driving force that brings us to work each day. We believe in embracing new ideas, challenging ourselves and failing forward. We respect and celebrate individual talents and team wins. We have fun while working hard and Evolenteers often make a difference in everything from scrubs to jeans.  Are we growing? Absolutely—56.7% in year-over-year revenue growth in 2016. Are we recognized? Definitely. We have been named one of “Becker’s 150 Great Places to Work in Healthcare” in 2016 and 2017, and one of the “50 Great Places to Work” in 2017 by Washingtonian, and our CEO was number one on Glassdoor’s 2015 Highest-Rated CEOs for Small and Medium Companies. If you’re looking for a place where your work can be personally and professionally rewarding, don’t just join a company with a mission. Join a mission with a company behind it. What You’ll Be Doing: We are looking for a bright and energetic individual for the Data Analyst role in our Operational Performance department. This position involves the preparation and analysis of data with an emphasis on performance metrics. This selected applicant must have experience using SQL to pull data. The Analyst, Operations will: Define and Develop reports using SQL, MicroStrategy, Excel, and Other BI tools to track operational performance metrics, such as Claim inventory, resource productivity and tracking to Service Level Agreement.Identify, using data analysis, priority process improvement opportunities across our operational functions and lead or contribute to related projects.Analyze data using SQL, MicroStrategy, Excel, and Other BI tools and format solutions towards operational inventory reduction in partnership with cross functional stakeholders.Compile and organize healthcare data from multiple data sources.Monitor and manage operational metrics and summarize recommendations to plan and modify/realign resources as required to meet the objectives.Develop clear and well-structured analytical plans.Identify, communicate and resolve data gaps that impact the fulfillment of claims objectivesDocument, track and resolve issues related to operational data quality.Act as liaison with cross functional stakeholders and leaders to resolve operational issues and identify and implement continual process improvement activities.Support and contribute to projects and/or operational improvement activities.Other duties as assigned.The Experience You’ll Need (Required):Strong analytical skills with the ability to collect, organize, analyze, visualize, and disseminate significant amounts of information with attention to detail and accuracy.Proficient in MS WORD, EXCEL and MS Office applications including the ability to manipulate, organize, and visualize large data sets in Excel.2-3 years of experience with and ability to write complex SQL queries to retrieve data for analysisStrong background in health care related operations with an acuity for operational efficienciesExperience with the Agile/Kanban methodologies and the use of JIRA or other ticketing systems for tracking/managing workMust have a passion for data and dedication to internal and external customersWork successfully in a team setting towards meeting common objectivesAbility to multi-task and meet deadlines in a fast-paced environmentAbility to access data in varied formats with different methods of analyzing and processing dataPossess the desire to advance and grow personally and professionallyBachelor’s degree or equivalent claims/healthcare work experience3-5 years’ experience in health plan operations preferably in claimsFinishing Touches (Preferred):Proficiency with the Aldera claims processing platform preferredProficiency in MicroStrategy or other Business Intelligence ToolsLeanSix Sigma or Project Management Experience or Certifications (PMP, Agile Coach, Scrum Master)Evolent Health is an equal opportunity employer and considers all qualified applicants equally without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}