{"jobID": "2829221745", "jobLocation": "N_o_n_e", "jobTitle": "Data Security Analyst", "companyRating": null, "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": null, "jobDescription": "Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.  The Air Force Education and Training Command is creating a new Chief Data Officer function to help manage the learning experience for over 70,000 learners, educators, and administrators. Be a part of a technical support team who would build and manage a new learning services ecosystem that will help bring the command’s learning environment into the digital age. This would include engaging with educators and vendors to learn about needs and existing solutions, creating a new technical backbone for the command, and helping develop a modern data strategy that ties it all together. Working on this project is an opportunity to get in on the ground floor of an exciting new program and function that will only grow into other parts of the Air Force the future. It will also give team members a broad set of skills, experience, and understanding of learning solution providers and their technical architecture. Roles and Responsibilities: - Implementing or manage security functionality or controls in data center environments. - Provide excellent technical skills and knowledge to successfully manage project work; broad understanding of network, database and application security issues. - Provide broad hand-on knowledge of firewalls, intrusion detection systems, anti-virus software, data encryptions, and other industry-standard techniques and practices.  Basic Qualifications: - 5+ years of direct experience implementing or managing security functionality or controls in data center environments. - Excellent technical skills and knowledge to successfully manage project work; broad understanding of network, database and application security issues. - Broad hand-on knowledge of firewalls, intrusion detection systems, anti-virus software, data encryptions, and other industry-standard techniques and practices. - Versed in strategic policy guidance and is familiar with the higher headquarter offices who develop government policy that effects the configuration of the Learning Services Ecosystem. - Bachelors or Masters Degree in Information Systems, Computer Science or related field - Ability to obtain a government clearance - Ability to obtain a government clearance About ICF International: ICF International (NASDAQ:ICFI) partners with government and commercial clients to deliver professional services and technology solutions in the energy and climate change; environment and infrastructure; health, human services, and social programs; and homeland security and defense markets. The firm combines passion for its work with industry expertise and innovative analytics to produce compelling results throughout the entire program life cycle, from research and analysis through implementation and improvement. Since 1969, ICF has been serving government at all levels, major corporations, and multilateral institutions. More than 5,000 employees serve these clients worldwide. ICF's Web site is http://www.icfi.com/. ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) ICF International is an Equal Opportunity and Affirmative Action Employer - M/F/D/V For a listing of other career opportunities at ICF, please visit our Career Center at www.icf.com/careers/ Bachelor’s Degree in associated discipline area.  Texas Client Office (TX88)"}