{"jobID": "2820073629", "jobLocation": "Wall_Township_NJ", "jobTitle": "Staff Environmental Scientist or Geologist - Mid-Level", "companyRating": "3.1", "companyInfo": {"Website": "www.gesonline.com", "Headquarters": "Wall Township, NJ", "Size": "501 to 1000 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Our Wall Township, NJ office seeks a mid-level Geologist or Environmental Scientist.This position typically consists of 30% fieldwork and 70% office work, and may include some overnight travel.Responsibilities and Duties: • Accountable for project budgets and invoice preparation.  • Accountable for H&S; goals and initiatives agreed upon annually with supervisor.  • Prepares weekly project updates and meets with supervisor weekly.  • Prepares remediation plans and specifications to determine the most appropriate environmental solutions  • Preparation of draft LSRP submittals.  • Track mandatory and regulatory project-specific requirements.  • Costs out, plans, prepares, and performs any type of pilot test activity to make solid field-related decisions.  • Management of the preparation of remedial system design for smaller-scale projects. Assists with detailed proposals and cost estimates on larger projects.  • Coordinates and oversees construction activities during smaller-scale system installation procedures.  • Manages and oversees soil borings, well installations, test pitting, and general small construction activities.  • Manages installation and operation and maintenance of remedial systems, including fieldwork management, preparing field work orders, system evaluations and upgrades, advanced troubleshooting and ensuring permit compliance.  • Completes groundwater monitoring and other technical reports, including generation of tables, figures and appendices • Prepares NJDEP forms, including individual Report forms, Case Inventory Documents (CIDs), Receptor Evaluations (RE), Pubic Notifications, Full Laboratory Data Deliverables, Vapor Concern and Immediate Environmental Concern, and Well Searches • Communicates with vendors, contractors, 3rd parties, clients and generates weekly project updates.  • Must be able to anticipate and be prepared for clients questions and concerns.  • Assists senior project managers on larger-scale projects.  • Works in the office or the field to fulfill environmental project needs.  • Team Player, dynamic, eagerness to learn, motivated and highly responsive  • Interest in Career Development  • General knowledge of LSRP program and willingness to review and ability to comprehend NJDEP guidance.  • A Bachelor's degree or higher in Geology, Environmental Science, Engineering or a related discipline and3 -7 yearsof related experience. Retail petroleum and/or industrial site experience is a plus. • Must have excellent technical writing, delegation, mentoring, negotiation, decision-making, and time management skills.  • Must also have excellent leadership skills, have the ability to interact with senior level client management, be resourceful, and possess a high degree of initiative.  • Must have OSHA 40 hr. Hazwoper and up to date on 8 hr. Refresher Training.  • Possession of TWIC card is preferred.  • Must have a clean driving record, and be able to drive a company vehicle.  • Drug/Alcohol screening and a Background check are required. Our comprehensive benefits include: medical, dental, vision, prescription, 401k, FSA, LTD, STD, New Parent Leave, 529 CollegeBound Fund, Tuition Assistance, Bonus Plan, and more.  GES is an equal opportunity/affirmative action employer that strongly values diversity. EOE/AA/M/F/V/D"}