{"jobID": "2676186437", "jobLocation": "Mountain_View_CA", "jobTitle": "Machine Learning Scientist Intern", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "165000", "jobDescription": " Samsung Research Americas Artificial Intelligence Team is currently seeking a talented, competent, and highly motivated individual to join our Collective Rationality group as a Machine Learning Scientist Intern. Collective Rationality group is an interdisciplinary and hands-on research group focusing on building consumer focused recommendation engine on top of Samsungs product line such as Samsung Pay, Samsung Smart TV, Bixby and so on.  The successful candidate will research on and develop Machine Learning algorithms to solve challenging problems involving big data and will work with other team members to build machine learning systems for proof-of-concept prototypes or consumer-oriented services.  Responsibilities: Develop scalable solutions based on state-of-the-art machine learning and AI methodologies.Contribute to the teams research and development activities.Apply expert software development skills to a wide range of ML-related coding projects.Develop prototypes and execute experiments to evaluate the performance of ML/AI architectures/algorithms in large-scale industrial applications.Write well-structured and re-usable code.Create proof-of-concept technology demonstrations. Basic Qualifications: MS in Computer Science, Mathematics, Statistics, Physics, or similar quantitative fields.Solid background in at least one area of machine learning and/or AI research.Solid background in linear algebra, calculus, and probability theory.Experience in working with supervised, unsupervised machine learning.In-depth experience in building systems based on machine learning and/or AI methods.Strong programming skills in Python and/or C/C++ and/or Java.Experience in working with numpy, scipy, scikit-learn, surprise. Preferred Qualifications: Experience in designing/developing scalable algorithms for large-scale recommendation systems.Experience in deep learning, transfer learning.Experience in working with one or few of these tools: Pytorch, Tensorflow, Keras, Edward, FastML.Good knowledge and hands-on experience in distributed technologies such as Hadoop, Hive, Spark Experience in Scala programming language. Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}