{"jobID": "2836366250", "jobLocation": "San_Diego_CA", "jobTitle": "Technical Applications Scientist 1", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "92000", "jobDescription": "Position Summary:As an in-house Support Scientist (Technical Applications Scientist) of Illumina products and applications, you will provide technical advice and troubleshooting assistance for Sequencing and Microarray customers focusing on assay performance, data analysis software, and bioinformatics. As a key member of the Service and Support Team you will also assist in the development and improvement of key commercial processes to ensure that Illumina provides its customers with world class technical support. Candidates will receive extensive product training, competitive salaries and stock. Illumina is growing rapidly and offers excellent opportunities for career development.All About YouResponsibilities:• Answer, evaluate, and prioritize incoming phone, email, and in person requests for assistance from customers.• Handle problem recognition, research, resolution, and follow up for routine and complex problems.• Provide technical guidance regarding the choice and use of the appropriate Illumina product to existing and prospective customers.• Develop, write, and edit technical documentation and training materials for internaland external customers.• Participate in core product sustaining and development teams.• Triage and dispatch issues requiring field support to Illumina Engineers andApplications Scientists.• Log and manage customer feedback using Illumina's case tracking database.Education:• Ph.D., M.S, or B.S. with 3 plus years relevant lab experience in molecular biology,genetics, bioinformatics or related field.Requirements:• Customer support experience highly desirable• Experience with data analysis tools and bioinformatics desirable• Practical Sequencing and/or Microarray experience desirable• Excellent analytical, problem solving and interpersonal skills required• Outstanding written and verbal communication and training skills a MUST• Willing to travel up to 10%Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}