{"jobID": "2828835428", "jobLocation": "Washington_DC", "jobTitle": "Sr. Statistical Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.analytica.net", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "Analytica is seeking a Sr. Statistical Data Analyst . Primary Responsibilities May Include:At least 10 years of professional experience, including at least 3 years experience analyzing inpatient claims and payment error data and DRGsBackground supporting the Center for Program Integrity (CPI) at CMS or a healthcare provider specifically around billing and coding activities related Fraud, Waste and Abuse activities.Experience and knowledge of Diagnosis Related Group (DRG) and payment error data.Knowledge of claims complexity for Part A providers (i.e. Inpatient Hospital, Skilled Nursing Facility (SNF), Home Health Agency (HHA) and Hospice care.Minimum Qualifications:At least 10 years of professional experience, including at least 3 years experience analyzing Medicare claims and payment error data and DRGsAt least 10 years of experience arraying, analyzing and reporting inpatient outlier dataStrong educational background in Statistics or Data AnalyticsBackground supporting the Center for Program Integrity (CPI) at CMS or a healthcare provider specifically around billing and coding activities related Fraud, Waste and Abuse activitiesExperience and knowledge of Diagnosis Related Group (DRG) and payment error dataKnowledge of claims complexity for Part A providers (i.e. Inpatient Hospital, Skilled Nursing Facility (SNF), Home Health Agency (HHA) and Hospice careAdditional Qualifications Desired:Knowledge or experience working with the Comparative Billing Reports (CBR) or Program for Evaluating Payment Patterns Electronic Report (PEPPER) at CMS or another provider of care (Hospital, etc.)AboutANALYTICA: Analytica is a leading consulting and information technology solutions provider to public sector organizations supporting health, civilian, and national security missions. Founded in 2009 and headquartered in Washington D.C., the company is an established SBA certified HUBZone and 8(a) small business that has been recognized by Inc. Magazine each of the past three years as one of the 250 fastest-growing companies in the U.S. Analytica specializes in providing software and systems engineering, information management, analytics & visualization, agile project management, and management consulting services. The company is appraised by the Software Engineering Institute (SEI) at CMMI® Maturity Level 3 and is an ISO 9001:2008 certified provider."}