{"jobID": "2796624449", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Scientist / Predictive Analytics / Predictive Modeler / Statistician / Advanced Analytics", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist / Predictive Analytics / Predictive Modeler / Statistician / Advanced Analytics DATE 29 Apr LOCATION Washington, D. C. COMPENSATION $120,000.00 KEY SKILLS DESCRIPTION  Award winning multi-channel data marketing company; offering Data Sourcing, processing, warehousing and advanced analytics capabilities to fortune 100 clients across industries. Join the advanced analytics team and apply your specialist knowledge; sheer analytics, data mining or predictive modeling, to a wide variety projects.  FURTHER DETAILSJOB DESCRIPTION  Responsibilities  · Manage the full life cycle of predictive model builds  · Analyse and improve the effectiveness of existing models and optimization strategies  · Work with clients to understand their requirements and consult on the effectiveness of marketing strategies  Qualifications  · 3 – 5 years’ experience direct marketing experience, preferably in banking or insurance  · Exceptional data mining abilities, working with extremely large data sets  · SQL programming a must, SAS / Cart / Treenet experience is a plus  · Excellent critical thinking, problem solving and communication skills  In return they offer  · Competitive salary and benefits package; $100,000 - $120,000 (DOE)  · Varied and challenging advance analytics exposure to management and Fortune 100 companies  · Collaborative work environment with opportunity to learn from experienced academics and professionals  This is an immediate & priority hire, interviews are ongoing and early applications are advised. GQR also welcomes tentative enquiries from suitably qualified individuals.  Confidentiality and utmost discretion is 100% assured.  Key Words: Proactive Analysis, Decision Trees, Regression, Data Modelling, Data Research, Bayesian Statistics, Statistical Data, Machine Learning, Trend Analysis, Pattern Recognition, Data Analysis, Strategic Data, Data Strategy, Business Intelligence, Distributed Databases, big data, data analytics, data model, problem solving. CONTACTAPPLY | data.americas@gqrgm.com  VISIT US | www.gqrgm.com  While a resume is preferable we also welcome tentative enquiries from well-qualified persons. Utmost confidentiality and discretion is assured.  LOS ANGELES | 1.310.807.5030  631 Wilshire Boulevard, Santa Monica, CA 90401 | Office Hours: 7.00-20.00 PDT  NEW YORK | 1.212.763.8333  340 Madison Avenue, New York, NY 10173 | Office Hours: 8.00-20.00 EDT  LONDON | 0203.141.8000  Westminster Tower, London SE1 7SP| Office Hours: 8.00-20.00 GMT  HONG KONG | 852.3678.6738  2 Exchange Square, 8 Connaught Place, Central | Office Hours: 9.00-21.00 HKT  GQR Global Markets  We are committed to protecting and respecting your privacy. Information on our privacy policy, together with our terms of business are available at www.gqrgm.com.  For the latest vacancies, please join our group on Linkedin: http://www.linkedin.com/groups?gid=1615777&trk;=myg_ugrp_ovrWhile a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an  agent please contact one of our regional offices. Utmost confidentiality and discretion is assured."}