{"jobID": "2836764785", "jobLocation": "Washington_DC", "jobTitle": "HVAC Design Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.jjkllc.com", "Headquarters": "Rockville, MD", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Advocating an integrated design-build model, Kirlin Design Build (KDB) combines in-house engineering and BIM coordination capabilities with self-performed construction, prefabrication, and commissioning to successfully provide customers a single-source solution. KDB's single-source, or turn-key, approach to design-build delivery is ideally suited for difficult and complex projects because the majority of services related to the project's mechanical scope of are performed in-house. By providing most of the services in-house, we can better control costs, coordination, schedule, and commissioning, while being more responsive to ownership concerns and requirements during the design and construction processes, the owner ultimately receives a better end result.  KDB is looking for talented individuals who enjoy challenges to join the team. We are currently seeking for a Sr. HVAC Design Engineer. Senior HVAC Design Engineer at Kirlin Design Build is generally assigned to a project after award and has the primary responsibility of ensuring project design success. This person oversees and actively participates in calculations and design document production; including managing the activities of other engineers and staff, while working collaboratively with the outside team members. At times a Senior HVAC Design Engineer will be responsible for multiple projects, depending upon project size and schedule. A Senior HVAC Design Engineer is expected to be a strong mentor to KDB design engineers and interns within the office.  The Lead HVAC Design Engineer is responsible for Complex Design for HVAC,Laboratory, and some Clean Room Design.  Heavy focus in Design Build with Healthcare, Hospital experience and some Laboratory experience  (Government Labs or Military Healthcare experience a Plus). Responsibilities: Relies on extensive experience and judgment to plan and accomplish goals including: Strong knowledge of relevant building Codes and Standards; often memorized.Strong understanding of building mechanical system design and stays current with advancing technologies.Excellent working knowledge of BIM and REVITAbility to direct and manage other project members in design and production.Competent with design tools including, load calculation, sizing, equipment selection;Knowledge of energy modeling, stress analysis and CFD a plus.Working knowledge of MS Office Suite, particularly as it applies to design work.Knowledge of the mechanical construction process to improve design documents.Team player! Appreciates a work-hard, play-hard environment.Self-motivated problem solver. Does not require constant direction or attention.Represent and protect the interest of KDB in an active and collaborative manner.Understanding of project budgets and design productivity.Clear and concise written and oral communication skills.Collaborate with KDB Pre-Con, Coordination, Pre-fabrication, Field Staff and the Commissioning teams.Is generally excited about mechanical systems and the design build process.Required Qualifications:Education: BS Mechanical Engineer or ArchitecturalExperience: Minimum 5-10+ years experience, PE Licensed engineer in any state with ability to have license reciprocated in various states.Software Skills: Ability to work in Revit. Efficient in AutoCAD and Microsoft Excel and Word.Abilities: Mechanical design including HVAC, ductwork and piping layout and design, system sizing, humidity and temperature control, and other design tasks related to mechanical engineering.Must be able to interpret and apply codes including NFPA, IBC, ASHRAE, UFGS and UFC criteria.Experience in Hospital is a MUST, Experience of Laboratory (BSL 3 & BSL 4) is a PLUS!!!Must be able to interpret and apply codes including NFPA, IBC, ASHRAE, and UFGS and UFC criteriaDesired Qualifications:Strong knowledge of BSL 3 & BSL 4Strong knowledge of Hospital and Laboratory, and Federal Government ProjectsCompetencies:Communication.Relationship Management.Critical EvaluationAbility to function in fast paced, ever changing, high demand environment assuring to meet all final deliverables, detail specifications, and deadlines.Work Environment: This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, printers, scanners, and photocopiers. Physical Demands: The physical demands of this position are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable an individual with disabilities to perform the essential functions. Work tasks may include observational survey of existing conditions within or around buildings. Some Construction Site or Fabrication Shop visits may be required for this position. Position Type and Expected Hours of Work This is a full-time position, and hours of work and days are Monday through Friday, 8:00 a.m. to 5:00 p.m. Travel Some travel may be required if deemed necessary. Benefits Include Competitive Salary  Medical, Dental and Vision  Disability and Life Insurance  401(k) Retirement Plan with Company Match  Paid Time Off and Holidays  Education Tuition Assistance An Equal Opportunity Employer:EEO/Drug Free/M/F/Disability/Veterans"}