{"jobID": "2821085471", "jobLocation": "Los_Angeles_CA", "jobTitle": "Medical Technologist/Clinical Lab Scientist", "companyRating": "3.9", "companyInfo": {"Website": "stvincent.verity.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "37", "jobDescription": "Department Clinical Lab Services Schedule full-time Shift night Hours 2230-0700 Req Number 9439 Job Details CA LICENSE - CLINICAL LAB SCIENTIST  FIRE/SAFETY CARD (must be presented within 30 days from DOH)  1-3 years of experience POSITION SUMMARY   Performs routine laboratory tests in one or more departments in the Clinical Laboratory. Is responsible for all aspects of documentation and compliance with regulatory agencies. Monitors routine laboratory functions, initiates corrective action and works to improve laboratory service and patient care. Must be available to work on weekends (tech rotation). A Medical Technologist with two years of clinical experience may function as a general supervisor or a technical supervisor as defined in the Clinical Laboratory Improvement Amendments (CLIA) of 1988.     · Indirect Patient Care Performs testing on blood, body fluids and other specimens using standard equipment and adhering to department and section standards of operations. Works in multiple laboratory sections · Evaluates the acceptability of specimens prior to initiating the testing process. Adheres to Department S.O.P.s in accepting specimens for testing. Knows ordering, collection, labeling. Transportation and processing requirements.  · Evaluates results as specified in department S.O.P.s; recognizes abnormal results for specific age of patient.  · Reports patient results in compliance with department policies and procedures.  · Assures the quality of testing results by performing quality control procedures, instrument calibration, instrument function checks and instrument maintenance according to laboratory policies and procedures.  · Assures the quality of testing results by performing proficiency testing and competency assessments according to laboratory policies and procedures.  · Reviews laboratory and section policies and procedures as required by S.O.P.s.  · Performs basic computer functions within the Laboratory Information System.  · Maintains an adequate inventory of supplies. EDUCATION/LICENSURE/CERTIFICATION  Must have a four year degree from an accredited college or university in science, medical technology or a related field.Must have completed a one year training program from an accredited School of Medical Technology.Requires a valid current license issued from the State Department of Health as a Clinical Laboratory Scientist.  MINIMUM EXPERIENCE REQUIRED    1. Minimum of one year current and continuous experience as a Clinical Laboratory Scientist in an acute care hospital.  2. Computer experience or course work in computer and data processing is required."}