{"jobID": "2801812607", "jobLocation": "Foster_City_CA", "jobTitle": "AI and Innovation Scientists, Visa Predictive Models", "companyRating": null, "companyInfo": {"Website": "www.visa.com", "Headquarters": "Foster City, CA", "Size": "10000+ employees", "Founded": " 1958", "Type": " Company - Public (V) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " American Express, Mastercard, Discover"}, "estimatedSalary": null, "jobDescription": " Company DescriptionVisa has the worlds largest consumer payment transaction data set. We see data on over 100 billion transactions per year from all over the world. We use that data to help our clients in the payment ecosystem grow their businesses and to help consumers access a fast, safe, and rewarding payment experience.  From across the globe, people are increasingly relying on digital payments and mobile technology to use their money any time, make purchases online, transfer funds across borders and access basic financial services. To ensure that payment transactions are secure and reliable, Visa has invested heavily in advanced authentication and fraud prevention technologies, and the company continues to develop and deploy new and innovative programs to fight fraud, enable acceptance, and support consumers. We also invest heavily in helping banks and merchants understand the behavior of their customers so they can bring products and services to market that more effectively meet their customers needs.Job DescriptionVisa is one of the original digital technology companies, with an extensive network connecting tens of thousands of banks and millions of merchants. More than 60 years later we continue seek new ways to push the boundaries of payment technologies and the development of innovative payment solutions. This position reports to the VP of Models for Data and Credit and will occupy a unique space which intersects the disciplines of predictive modeling, machine learning / AI and innovative product development.  We are seeking passionate and talented AI / Machine Learning scientists and engineers to collaborate with product designers in Visas suite of global Innovation Labs. You will be part of a multi-disciplinary team collaborating with business, design and development professionals. You will blur the lines between business strategy, creativity, computer science and deep learning algorithms helping to leverage Visa data to enhance new solutions, such as connected homes, connected cars and IoT.  We are currently recruiting for two open roles. These roles may be located in Foster City, CA or Ashburn,VA. Ashburn team members would require periodic travel to Bay Area to meet with Innovation Lab team members.  As a member of AI & Innovation within the Models for Data and Credit Products team you will: Join a team of world-class, collaborative data scientistsDevelop AI/machine learning solutions targeted towards disruptive opportunities for Visa businessBuild novel machine learning/AI algorithms to develop intellectual property for VisaLeverage experience with systems, and application development to realize products/offerings in multi-disciplinary settings.Rapidly prototype proof of concept solutions that can demonstrate utility, value and lead to scalable solutionsStay up-to-date on developments in the field and propose long term capability buildupCollaborate with designers and engineers in Visas global suite of Innovation LabsProvide leadership expertise and technical guidance for new model builds and/or existing model deep dives and trouble shooting Additional responsibilities for senior roles: Lead collaboration with designers and engineers in Visas global suite of Innovation LabsDefine an R&D; agenda around machine learning, artificial intelligence, and modeling capabilities to ensure we will stay leading edgeProvide leadership expertise and technical guidance for new model builds and/or existing model deep dives and trouble shootingEnsure all models are following the established rules for data privacy and governance of production modelsQualificationsStrong background in two or more of the following areas: machine learning/AI algorithms, computations/statistical learning theory, scalable systems (e.g. Spark, Hadoop), large scale data analysis, optimization, functional analysis and deep learning.Experience in deep learning frameworks (e.g., Tensorflow, MxNet), and large-scale optimizationDemonstrated success integrating AI into innovative product architecturesDemonstrated ability to drive innovation from incubation to productDemonstrated ability in the application of Machine Learning/AI in real-world industrial settings with large scale dataA history of developing novel algorithms, solutions and delivered/deployed projects in the area preferred.Familiarity with agile execution methodologies.A sense of ambition and passion to change the world using AI and machine LearningYou balance precision with practicality and act decisively to move projects forwardStrong leadership competencies including the ability to champion the strategy, drive an inspiring culture, build trust and deliver customer focused innovationYou are a thought leader, innovator and a problem solver. Challenger of the status quo. Experience We are recruiting for two roles within this team. All levels of experience will be considered as long as you have practical experience in the application of Machine Learning/AI in real-world industrial settings with large scale data. Level and compensation will be commensurate with relevant experience.Advanced degree in quantitative discipline with a focus on Machine Learning / AI / Reinforcement learning or related areasStrong background in two or more of the following areas: machine learning/AI algorithms, computations/statistical learning theory, scalable systems (e.g. Spark, Hadoop), large scale data analysis, optimization, functional analysis and deep learning.Experience working as part of a small and nimble modeling team in a fast-paced environmentExperience with human centered design and agile product developmentAbility to bridge the gap between technological approaches and business outcomes.Ability to communicate with both business and technology leaders, with a strong understanding of business data requirements and technology capabilities and an ability to make technical concepts accessible to non-technical audiences. Additional InformationAll your information will be kept confidential according to EEO guidelines."}