{"jobID": "2795824375", "jobLocation": "Foster_City_CA", "jobTitle": "Research Scientist II, Drug Metabolism", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "144000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities: The primary responsibility of this pharmacokinetic (PK) scientist is to serve as a PK and drug metabolism(DM) representative and provide guidance to drug project teams Essential Duties and Job Responsibilities:Serve as DMPK subject matter expert on dynamic cross-functional teams, to define ADME strategy to achieve target product profile, provide in vitro and in vivo drug disposition data, interpretation, and presentations to teams.Work closely with internal and external resources to assure a high level of quality and timely delivery of DMPK support.Design and perform complex PK analysis, model development and PK/PD analyses to answer translational questions and to provide DMPK guidance for project teams.Makes major contributions to scientific literature and conferences through publication and presentation of research results.Supervising associate scientists may be required.Knowledge, Experience and Skills:Requires a highly motivated individual with PhD degree in life sciences with 3-9 year experience.Demonstrates excellent scientific verbal and technical communication skills and interpersonal skills. Must be organized, pay attention to details and have strong organizational and planning skills.Requires hands-on experience in pharmacokinetics, drug metabolism or pharmacology.Expertise and Experience in one or more of the following areas: Mechanistic PK and pharmacodynamics (PD) analysis, design, interpret, simulation, and report to provide guidance for drug discovery and development projects. For example - PK/PD and physiology based PK modeling or systems biology using MATLAB/Simbiology, WinNonlin/Phoenix, NONMEM or R.Principles and theories on PK and ADME science, applying such knowledge to the direction that supports the advancement of drug candidatesCapability in the state of the art bioanalysis with previous experience in applying automation to enable high throughput bioanalysis For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}