{"jobID": "2786489558", "jobLocation": "Iselin_NJ", "jobTitle": "Senior Data Modeler", "companyRating": "3.5", "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": "102000", "jobDescription": " Prudential is seeking an experienced data modeler having the following hands on experience. It is an amazing opportunity for individuals who want to work in a fast-paced dynamic environment. Job Responsibilities:Hands on experience with frameworks including support for taxonomies, entity relationships (ER models), ontology and modeling languages such as RDF, OWL and VMLTechnical evaluation for assignments involving existing models for legacy applications and creation of new model in support of application developmentParticipates in collaborative working environment using the agile methodologyKeep abreast of new technological innovationsProvide technical leadership and guidance to business partners, peers and vendor partners.Performs related duties as assigned or requested.Bachelor’s Degree or equivalent experience required.Experience in data modeling principles/methods including conceptual, logical & physical Data Models.Capable of facilitating data discovery sessions involving business subject matter experts.Strong inter-personal skills and ability to work as part of a team.Experience in translating/mapping relational data models into Data Base Schemas.Experience with modeling tools (ERWin and ER/Studio)Knowledge of RDBMS platforms (e.g. SQL Server, Oracle, DB2 / UDB, NoSql, MongoDB, Hadoop) with experience in generating DDLAbility to create and maintain conceptual/business, logical and physical data models.Ability to translate a logical model into a physical model, adding appropriate physical objects needed to create the database e.g. indexes.Experience maintaining a model repository.Ability to synchronize models to ensure that database structures match models.Familiar with metadata ingestion and translation.Expert in CDM, LDM & PDM (persistent and data in motion)"}