{"jobID": "2829831465", "jobLocation": "Oak_Brook_IL", "jobTitle": "Associate Food Scientist", "companyRating": null, "companyInfo": {"Website": "www.flagstonefoods.com", "Headquarters": "Saint Paul, MN", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employee Type:Full timeLocation:IL Oak BrookJob Type:Research and DevelopmentJob Posting Title:Associate Food ScientistJob Description:Major Responsibilities · Under direct supervision, researches, executes experiments, gather data, develops preliminary findings and prepares written reports  · Develops products (i.e. new, line extensions, optimized, CCR’s) beginning at conception through successful commercialization and verification  · Provides technical support to product, production, suppliers, and Quality  · Seeks inputs and recommends appropriate methods, tests and procedures for testing  · Maintain accurate, complete and confidential records  · Complete project objectives/timelines  · Coordinate and execute pilot and plant trials and new product start-ups  · Develop and issue Fit for Use, Consumer Based Specifications, processing and raw ingredients specifications  · Prepare technical reports with clear and accurate summaries/abstracts  · Support identification and development of ideas for technology improvements/cost savings Essential Experiences Gained from this Role: · Understand the organization & beginning integration with cross functional organization  · Navigate with support to drive projects to completion through the Product Development Life Cycle  · Navigate and generate specifications within the Product Vision system  · Develop technical foundation in field assigned  · Demonstrated ability to effectively communicate (verbal and written)  · Ability to execute at least two projects simultaneously with quality and efficiency  · Support leadership in approaching technical solutions  · Develop technical timeline skills  · Develop problem solving skills Required Qualifications: · BS in Food Science or related field  · Recommended Food/Lab/Science related experiences (i.e. course work, internship, job, etc.)  · Creative and the need for a challenge  · Self-Starter TreeHouse Operating Principles · Drive for Results & Accountability  · Collaboration/Teamwork  · Internal and External Customer Focus  · Self and People Development  · Innovation & Continuous Improvement  · Integrity and Courage Disability Assistance TreeHouse Foods is an Equal Employment Opportunity Employer and offers opportunities to all job seekers, including those with disabilities. If you need a reasonable accommodation to assist with your job search or application for employment, please contact us by sending an email to disability-accommodations@treehousefoods.com. In your email please include a description of the specific accommodation you are requesting and a description of the position for which you are applying. EEO Considerations All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability or protected veteran status."}