{"jobID": "2827405706", "jobLocation": "Lawrenceville_NJ", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.townsend-associates.com", "Headquarters": "Morris Plains, NJ", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Research ScientistResponsibilities:Aide in the advancement of early stage therapeutic in tumor immunobiologyEffectively collaborate with colleagues in the oncology, immunology, immuno-oncology, proteinengineering/antibody development and medicinal chemistry groupsDemonstrate clear and professional verbal and written communication, capable of presenting scientific results to multidisciplinary teams and key stakeholdersHighly motivated, interactive, and creative individual that possesses the ability to work across a highly matrixed environment to advance preclinical drug development programs from target identification/validation through IND enabling activitiesQualifications:B.S. with clearly demonstrated skill set in oncology, immuno-oncology, or immunology is requiredProficiency in utilizing scientific software such as Prism, GraphPad, Excel, etc. for data analysis and figure generation is requiredExperience with a wide range of in-vitro cellular and biochemical assays, including cell culture, isolation of leukocyte subpopulations and experience with T cell and NK cell functional assays, western blotting, immunoprecipitation, ELISAs (MSD), reporter assays, siRNA/shRNA knockdown, and the ability to incorporate state-of-the-art techniques to enhance productivity would be highly desired especially as these skills apply to pharmacology-derived samplesExpertise in isolation, characterization and functional assay development using primary immune cells of rodent and/or human origin is desiredAn expert knowledge in the design, validation and execution of in vitro and ex vivo flow cytometry- and/or mass cytometry-based phenotypic and functional characterization of immune cell populations is desiredTissue culture expertise is a must. Experience with ex vivo pharmacology, including common procedures including tissue processing is desired"}