{"jobID": "2751304285", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.goguardian.com", "Headquarters": "El Segundo, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Join us in our mission to provide students with a safe and stimulating learning environment! At GoGuardian, youll get to work with interesting and motivated people and solve challenging problems in a great environment. If youre passionate about protecting and cultivating a generation of learners, this is a great opportunity for you! Youll be a joining a fluid, talented, and innovative analytics team focused on enabling and empowering our organization to make data-driven decisions. At GoGuardian, we pride ourselves on bringing the very best talent to empower millions of student lives in the most impactful way.Who We Need: Were looking for a self-motivated, data-driven individual who is passionate about improving internal and external customer experiences. We need someone who is excited to take ownership of our internal data to develop actionable insights and tools, which will be used to support company wide growth and key strategic decisions. The ideal candidate will combine a passion for innovative analysis and a comfort with ambiguity with a drive to overcome difficult and complex analytical challenges.Your Challenge:Collaborate with stakeholders across all business functions (i.e. Product, Sales, Marketing) to develop actionable insights and toolsBuild scalable, reliable, and high quality analytics products that enable impactful actionable analysis and predictive modelsCreate, support and maintain data models, reports and dashboards as well as find creative solutions for a variety of challenges facing our growing data requirementsUse statistical and machine learning principles to discover hidden patterns, perform predictive analysis and build models that drive insightsActively explore opportunities to acquire & integrate new data sources to expand breadth & depth of analysis What You'll Need 3+ years of relevant experience in solving analytical problems using quantitative approachStrong cross-functional and interpersonal skills with demonstrated ability to communicate technical content to general audiencesHands on experience analyzing data in R or PythonExperience in SQL preferred Extras  M.S. in Math, Statistics, Economics, Computer Science, or other quantitative fieldPrevious experience using data visualization tools (Looker, Tableau, Chart.JS, Raw. etc.)"}