{"jobID": "2822933163", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate - Data Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.moodys.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1900", "Type": " Company - Public (MCO) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Role/Group: The Data Intelligence Analyst may perform a variety of different data management job functions, including data acquisition, data processing, data operations, managing financial institution/data vendor relationships, client support, data science/analytics, data engineering, and supporting the creation of data products. This position involves a blend of qualitative/quantitative financial research, data science, and technical skills to source and maintain credit risk data and models. This position is for you, if you are a quick learner, have a passion for data to identify trends, uncover patterns, solve problems and your favorite question is 'why'. The Data Management group is responsible for managing the critical processes that ensure the accuracy and timely delivery of vital financial data that is linked to our industry-standard credit risk measurement tools and related software applications. This role will facilitate that process, working with the IT, support and development teams to ensure the timely and seamless delivery of data to clients. Additionally, the role is responsible for gathering and inputting financial data from clients into the company's credit risk measurement tools and software, as well as running the data processing and calculations that feed the company's credit risk measurement and management products. Responsibilities: Gather financial data from banks/clients/financial institutions and external data vendors, including exploration of new data sources Manage data relationships and provide customer support/feedback to banks/clients/financial institutions/internal clients and feedback to external data vendors Process/cleanse/standardize data from multiple sources for input into a centralized database Build and maintain data processing and calculations to feed MA's credit risk measurement and related products/models Identify ways to improve data operations processes either by automation or other means Perform quality control on data by analyzing patterns and data discrepancies and resolve related issues Perform data analysis using a variety of methods including statistics and relational databases Produce reports using Business Intelligence tools that describe data characteristics and highlight trends and issues Coordinate with other MA teams such as IT, Client Services, Product Management, Research, Engineering Work schedule may require occasional evening/weekend/holiday shifts and may be centered around major submission cycles May contribute to exploratory data science/analytics projects May contribute to data process engineering projects May contribute to developing requirements for the creation of new data products Department: The ERS Data Intelligence (DI) department creates value-added information, IP and content that are used by our clients to meet their business needs and to produce actionable data-driven intelligence. Our team consists of experts at acquiring and cleansing data, interpreting financial information, developing data-driven analytics and insights, applying insights and analytics to our customer's business needs, and developing data products. This is a fast-paced and growing team within the Moody's Analytics (MA) organization that provides excellent career opportunities. Qualifications: Requires Bachelor's degree in Economics, Statistics, Finance, Accounting, Operations, Engineering or a related field. Graduate degree and/or 1-2 years of work experience is a plus Superb analytical skills, persistence in problem solving, and a bility to learn quickly and independently Strong organizational skills, attention to detail, and ability to manage multiple projects with tight deadlines Excellent written and oral communication skills Exposure or interest in financial services space Proficiency in SQL (SQL Server, PostgreSQL, MySQL) Proficiency in a statistical package (R, SAS, Matlab) Experience with a scripting language (Python, Bash) Proficiency in MS Office, especially MS Excel Preferred: Experience working with major financial data feeds Familiarity with: equity and fixed-income markets with the ability to correctly read and interpret financial statements such as 10K and 10Q; US GAAP, IFRS, and other regional accounting principles ; foreign and domestic bankruptcy/insolvency Exposure to third-party BI Tools: Tableau, Qlik, Looker, R Shiny Exposure to ETL tools (SSIS, CloverETL, Talend, etc.) Experience in data modeling and query optimization Exposure to machine learning Knowledge or interest in cloud computing Exposure to Java, C++ or other major programming language Moody's is an essential component of the global capital markets, providing credit ratings, research, tools and analysis that contribute to transparent and integrated financial markets. Moody's Corporation (NYSE: MCO) is the parent company of Moody's Investors Service, which provides credit ratings and research covering debt instruments and securities, and Moody's Analytics, which offers leading-edge software, advisory services and research for credit and economic analysis and financial risk management. The Corporation, which reported revenue of $4.2 billion in 2017, employs approximately 11,900 people worldwide and maintains a presence in 41 countries. Further information is available at www.moodys.com. Moody's is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, gender, age, religion, national origin, citizen status, marital status, physical or mental disability, military or veteran status, sexual orientation, gender identity, gender expression, genetic information, or any other characteristic protected by law. Moody's also provides reasonable accommodation to qualified individuals with disabilities in accordance with applicable laws. If you need to inquire about a reasonable accommodation, or need assistance with completing the application process, please email ...@moodys.com.. This contact information is for accommodation requests only, and cannot be used to inquire about the status of applications. For San Francisco positions, qualified applicants with criminal histories will be considered for employment consistent with the requirements of the San Francisco Fair Chance Ordinance. For New York City positions, qualified applicants with criminal histories will be considered for employment consistent with the requirements of the New York City Fair Chance Act. For all other applicants, qualified applicants with criminal histories will be considered for employment consistent with the requirements of applicable law. Click here to view our full EEO policy statement. Click here for more information on your EEO rights under the law. Candidates for Moody's Corporation may be asked to disclose securities holdings pursuant to Moody's Policy for Securities Trading and the requirements of the position. Employment is contingent upon compliance with the Policy, including remediation of positions in those holdings as necessary. Associate - Data Intelligence Analyst"}