{"jobID": "2826021411", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Business Systems Analyst (Cognos Reporting/Data warehouse/Salesforce)", "companyRating": "3.1", "companyInfo": {"Website": "www.aig.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (AIG) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Functional Area:IT - Information Technology  Estimated Travel Percentage (%): No Travel  Relocation Provided: No  American General Life Insurance Company  Picture yourself building a successful career at AIG Life and Retirement working alongside other talented, highly motivated individuals committed to reaching our goal of becoming the premier provider of protection, investment and income solutions needed for financial and retirement security. We believe that our success depends on building a world-class team. If you would like to be a part of our team, we invite you to consider putting your talents to work with the Sales Management Support team for AIG Financial Distributors located in Woodland Hills. Job DescriptionPossesses strong knowledge of the Salesforce platform, including the foundational concepts of the application and the functions contained within.Work closely with functional and business areas to translate business needs into technical specifications for Salesforce, reporting and other data integration projects.Triage a wide range of data issues, perform research & analysis required to determine root cause and work with the IT and Business team for remediation.Research/learn new and converging technologies and make recommendations with respect to their applicability or integration with existing Salesforce and Data Warehouse architecture.Assist in QA, UAT of IT project deployments, reconciliation and, data quality efforts.Understand complex business challenges, come up with best solutions, manipulate large data sets, and handle complex ad hoc requests.Fast learner to understand internal systems with the ability to identify and link data into ************** in an effort to maximize effectiveness and efficiency.Research and recommends changes in Salesforce and related workflows based on available technology, cost/benefit analysis, users experience and related industry experience.Strong analytical/problem-solving abilities, with the ability to clearly communicate ideas precisely to technical and non-technical audiences.Ability to conduct training, document business processes and system procedures. Job Skills: Required Possesses strong knowledge of the Data warehousing & Business Intelligence concepts, basics of Salesforce platform, including the foundational concepts of the application and the functions contained within.Work closely with functional and business areas to translate business needs into technical specifications for Salesforce, Cognos reporting and other data integration projects.Triage a wide range of data issues, perform research & analysis required to determine root cause and work with the IT and Business team for remediation.Research/learn new and converging technologies and make recommendations with respect to their applicability or integration with existing Salesforce and Data Warehouse architecture.Assist in QA, UAT of IT project deployments, reconciliation and, data quality efforts.Understand complex business challenges, come up with best solutions, manipulate large data sets, and handle complex ad hoc Cognos reporting requests.Ability to understand the architecture and data model of the internal systems and databases. Analyze existing data model and suggest design changes to maximize the effectiveness and efficiency of the systems and business processes.Research and recommends changes in Salesforce and related workflows based on available technology, cost/benefit analysis, users experience and related industry experience.Strong analytical/problem-solving abilities, with the ability to clearly communicate ideas precisely to technical and non-technical audiences.Ability to conduct training, document business processes and system procedures.Requirements:Bachelors degree from a four-year college or university in Computer Science or related quantitative field.3 to 5 years of job-related experience.1+ years of Salesforce admin knowledge.2+ years of experience in SDLC processes, data analysis, writing and debugging SQL queries, data modeling, working with SQL Server and Oracle Databases.2+ years of experience in developing reports using IBM Cognos Report Studio 10+. Hands-on experience with data viz tools like QlikView is a plus.Must possess strong skills and experience in oral and written communications, including analysis documentation, and application and system specifications.Strong proficiency using .Ability to multi-task, work independently and maintain work quality in a fast-paced, dynamic environment.Ability to make presentations and conduct Salesforce training preferred.Experience working in the insurance field or financial services sector. It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives.  We consider qualified applicants with criminal histories, consistent with applicable law."}