{"jobID": "2746918608", "jobLocation": "Rockville_MD", "jobTitle": "Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.hzdg.com", "Headquarters": "Rockville, MD", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " HZDG is seeking an Data Analyst to join our growing analytics team. The Data Analyst is responsible for gathering and analyzing data using various analytics platforms across multiple digital channels, synthesizing the data for internal teams, and creating actionable reports for clients. The ideal candidate will not only be able to report on data, but pull meaningful and actionable insights out of any dataset.  Responsibilities: Analyze data to translate multi-channel digital marketing program (website traffic, social media, digital advertising, SEM, SEO, email, etc.) KPI’s using analytics platforms.Collaborate with team members to provide data insights and improvements to optimize toward marketing goals, campaign spending, and user experience across digital channels.Develop, audit, and publish various tagging through the use of Google Tag Manager and Adobe’s Dynamic Tag Manager.Conducting and monitor A/B tests across digital channels using tools such as Google Optimize, to optimize on-site conversions and engagement.Develop and execute measurement and implementation plans for new and existing clients.Produce scheduled analytics reports on campaign and site performance. Qualifications: Hands on experience with analytics platforms such as, Adobe Analytics and Google Analytics, as well as tag management platforms such as, Adobe Dynamic Tag Manager and Google Tag Manager.Ability to build and manage tracked campaign URLs through UTM parameters.Working knowledge of social media reporting tools such as SimplyMeasured, Spredfast, and Facebook Insights.Knowledge of initializing and managing cross-platform retargeting integrations between analytics platforms and third party services.Expertise with mining insights using data analysis and database platforms such as, Microsoft Excel, Super Metrics, and Tableau.In-depth knowledge of concepts and trends in emerging media and the ability to stay ahead of the market for implementation and strategy.Excellent written and verbal communication skills, with experience in delivering presentations to stakeholder.An analytical mindset that goes beyond just reporting.Ability to thrive in a fast-paced, collaborative team environment and manage multiple projects and deliverables across numerous clients.Bachelor's degree with 4-6 years of experience in analyzing advertising, communications, or marketing data. Agency experience is preferred, but not required. "}