{"jobID": "2831113931", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Engineer - Business Intelligence", "companyRating": "4.4", "companyInfo": {"Website": "www.leafgroup.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Public (LFGR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "115000", "jobDescription": " Leaf Group is a diversified Internet company that builds platforms to enable communities of creators to reach dedicated audiences in the ever-growing lifestyle categories.  We are looking for a Data Engineer to join our Business Intelligence team and help provide data-driven insights that enable better decision-making.  A big vision calls for a big job. As we grow, our need for a Data Engineer grows with us.  A typical day as a Data Engineer might include:Develop, implement and maintain critical ETL solutions using Python & SQLBuild scalable data-pipelines between various databases, data sources & APIs to perform data-miningHelp drive optimization and testing in existing data-pipelines to improve data qualityInvestigate data anomalies and perform Root Cause Analysis (RCA)Build data models and complex SQL queries to perform exploratory data analysis over myriad data sourcesCollaborate with Software Engineers, Data Analysts, Data Scientists and business-stakeholders(Optional) Visualize and explore data using TableauYoull be successful if you are a motivated Engineer with strong Python & SQL skills and looking to join an energetic, fast-paced, and project-driven BI team.What You Have:Bachelors degree in Computer Science, Engineering, Statistics, Mathematics or related fieldProficiency in Python & SQL. Bonus points for experience in Javascript/Django.3+ years practical experience in ETL scripting, debugging, and architecture.Extensive knowledge of data modeling, data access, and data storage techniquesSolid understanding of complete SDLCHighly detail-oriented with excellent verbal and written communicationExperience with SQL database like Redshift or PostgreSQL is desired. Experience with other Relational and NoSQL databases is a plus. Proficiency in Tableau or other data visualization tools is a plusNot afraid to wear multiple hats - no job being too small or too large.We're casual and informal but we work hard and work responsibly. A pleasant and supportive demeanor goes a long way.Who We Are: We create experiences that celebrate the best of art, design, and technology. We want smart, curious people committed to putting people first, having fun while they work, a commitment to high quality service to make things better and a desire for constant growth. We work in a fun, hard-working collaborative environment that is diverse, adventurous, and open-minded. Check us out here: https://www.leafgroup.com/brands/ What We Have:Winner of the 2017 Best Company for Diversity award ComparablyWinner of the 2017 Best Company Los Angeles award ComparablyCool office environment and culture (i.e., Thirsty Thursdays, Free Lunch Fridays, and all of the other fun activities we gather for)Discounted gym membershipsPaid-to-play vacation rewardsDiscretionary unlimited vacation timeEmployee discounts for Saatchi Art, Society6, and Deny Designs401KMedical, Dental, VisionFlexible Spending Accounts Leaf Group, Ltd. is an equal opportunity employer. Applicants for all job openings are welcome and will be considered without regard to race, color, religion, national origin, sex, age, sexual orientation, physical or mental disability, or any other basis protected by state, federal, or local law. It is the intent of the Company to comply with all applicable federal, state, and local legislation concerning equal opportunity in employment. Agency Disclosure: If the Leaf Group Talent Acquisition department, or any current company employee, receives an unsolicited resume from a third party recruiting agency and Leaf Group does not have a signed Agency Agreement active, Leaf Group will not be deemed liable to pay a placement fee. The unsolicited resume will be considered a gift and can be considered for our recruitment efforts."}