{"jobID": "2813134421", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Project Engineer", "companyRating": "4.2", "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": "95000", "jobDescription": " Senior Project Engineer Location  CA-San Francisco Department  190-No CA Construction (Core & Shell) Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance.What You’ll Do: As a Project Engineer, you’ll have both hands-on experience and training and development opportunities to ensure you’re on a clear path for growth and rotation within the organization. You will: Learn how to build, including all aspects of the planning and execution process.Assist the Project Manager and team members in the planning, coordination, and administration of assigned projects. This includes areas such as RFI’s, contracts, change orders, purchasing, scheduling, and progress reports.Track and perform jobsite safety meetings. Promote safety at all times.Focus on continuous improvement and innovation in all you do.What You Need to Succeed:A Bachelor’s degree (preferably in Construction Management, Civil or Mechanical Engineering, or Architecture) or equivalent experience.Minimum two years construction experience.Basic knowledge of contract formats, surveying, scheduling drawings, and construction sequencing.Advanced knowledge of MS office, Adobe, and Visio.Basic drafting skills using CAD.You love communicating! You are also a born leader and enjoy using creativity to solve problems.You are authentic and are known for going above and beyond what is asked of you.The Legal Stuff: Webcor is AN EQUAL OPPORTUNITY EMPLOYER. Performance of the required duties will require physical ability to climb permanent and temporary stairs, passenger use of construction personnel hoists, ability to climb ladders and negotiate work areas under construction. Specific vision abilities required by this job include close vision, peripheral vision, depth perception, and the ability to adjust focus. Performing this job requires use of hands to finger, handle, or feel objects, tools or controls, sit, talk, hear, stand, climb, balance, stoop, kneel, crouch, or crawl. While performing the duties of this job, the employee regularly works on-site at the construction work site where the employee is exposed to moving mechanical parts, high precarious places, fumes or airborne particles, outside weather conditions, and risk of electrical shock. The noise in these work environments is usually moderate to very loud. This is a general statement of required major duties and responsibilities performed on a regular and continuous basis. It does not exclude other duties that may be assigned.  #KRT"}