{"jobID": "2788655941", "jobLocation": "Chicago_IL", "jobTitle": "VP, Data Partnerships - Entertainment and Media Industry Opportunity", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Company DescriptionPart of Publicis Groupe (Euronext Paris Exchange: FR0000130577; CAC 40 index), Publicis Spine was established in 2017 to serve the data and analytics and technology needs of Publicis Groupe agencies and their clients. Its mission is to grow clients businesses through the transformative application of data and is the home to Publicis Groupes proprietary technology platform, Publicis PeopleCloud. It includes a consistent, transparent, best-in-class approach to data, analytics solutions, partnerships and technology via a closely joined network of engineers, technology experts, product designers, analysts and data scientists all empowering marketing and digital business transformation.  Our global platform is Publicis PeopleCloud. It starts with a simple principle: the more we know about people, the more we can drive brand growth by converting people at scale. Publicis PeopleCloud is an end-to-end platform that organizes data into Publicis IDs, integrating 1st, 2nd, and 3rd party data and using machine learning to match cookies, devices, and offline behaviours to actual people, in a privacy-compliant manner. Aggregating these IDs provides a basis for growth planning, building audiences, creating content, managing and measuring consumer campaigns. The platform sits within the Publicis Spine and supports the full spectrum of marketing transformation and digital business transformation for our clients. Job Description The Partnership & Data team is responsible for ensuring that, from a knowledge and audience understanding perspective, Publicis PeopleCloud is fueled with appropriate sources of data in each market.  Each member of the team has specific responsibilities centrally and in working with the local markets and regional leads to ensure that we operate in a global consistent but locally relevant way in choice of data partners. To do so, the Pureplay and DMP/DSP Partnership lead for ID level data works within the partnership team summarized next to assess needs, understand options, recommend solutions and support markets in acquiring and leveraging relevant and unique data sources.  The Partnership & Data integration lead is also supporting on the connectivity layer, by working closely with Technology and Activation groups in local market to market to define and implement the ID growth strategy. As more markets are brought on board for PeopleCloud, these central teams will expand to support local market needs in addition to dotted line reporting in local markets to global teams as needed. Key Responsibilities: Global prioritization and regional alignment  Working with existing Peoplecloud team, prioritize foundational data sets needed to support platform in 7 existing markets  Negotiate terms and align contracts against platform needs  Prioritize additional data sets to meet vertical category business measurement for top Publicis Groupe client categories ( CPG, Consumer Electronics, Fin Serv, Pharma etc)  Drive and support regional/local teams in their efforts to meet local needs.  Connectivity and Quality  Ensures that the ID pool of Publicis in each market meets the expected standard, both in terms of volume and cross device attributes (ID graph)  Consistency & Relevance  Drive consistency across markets where thats possible in terms of data providers taking into account existing deals (Publicis, clients) and that we are still relevant to markets when driving consistency  Requirements gathering  Gathering requirements from markets, informing back on deals availability, volumes and prices in alignment with Global Data Acquisition teams.  Continuity  Ensures that Publicis PeopleCloud maintains any data provider synchronization with Publicis ID and matching operations to keep these data / segments available for teams in markets.  The successful candidate will have experience and expertise in how to intersect consulting skills, data, advanced analytics and data strategy to drive and improve clients business results.  Specific tasks  Consult with local audience and data acquisition teams to define and answer their most important audience and data coverage questions.  Consult with local technology and activation group (TAAG) and regional TAAG lead to ensure that strategy on ID growth is define and implemented.  Work collaboratively with rest of the Global Partnership team to consolidate needs from local and leverage global deals at local / regional level. Create and maintain a data coverage map.  Work with the full PeopleCloud team to ensure best prioritization in terms of data coverage and leverage experience / expertise from the teams on the data needed.  Identifies new data providers to help support data enrichment  Consults and negotiates with providers and partners to ensure optimized data acquisition  Leverage cross client opportunities to drive more value creation for Publicis clients.  Tells the data story on why the data integration and partnerships matter today more than yesterday.  Provides POV and a high value consultation layer to local / regional level leads on data integration needs to deliver against strategy. Qualifications The candidate must have 5-8 years of experience consulting clients on their data strategy  Senior resource must have strong functional understanding of ad tech, data integration and data economy, as well as an innovative vision on how the practice should evolve to keep pace with the ever changing marketing environment.  Must have demonstrably quantitative skills and the ability to roll up sleeves and dig into the numbers when necessary.  Must have strong entrepreneurial mind-set with the drive to dig in, problem solve, and evolve the agencys data sources & product for the mutual benefit of our client and the agency  Must be able to cultivate excellent relationships with data & technology and research partners  Candidate must have a strong attention to detail, and be able to quality check their teams work to ensure that data anomalies/mistakes are caught prior to delivery of the analysis to the client teams  Ability to meet deadlines in a fast-paced environment  Hands on, problem solving abilities can do approach (someone who is a thinker and a doer)  Excellent communication skills written and spoken Additional Information All your information will be kept confidential according to EEO guidelines."}