{"jobID": "2834363890", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.maximintegrated.com", "Headquarters": "San Jose, CA", "Size": "5001 to 10000 employees", "Founded": " 1983", "Type": " Company - Public (MXIM) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Texas Instruments, Intersil, Analog Devices"}, "estimatedSalary": "82000", "jobDescription": " Requisition Number 4830BR  External Posting Title Data Analyst  Time Type Full time  Pay Rate Type Salary  Work Shift Regular - Salaried  Country United States  Locations San Jose, CA (HQ)  Minimum Degree Required Master's Degree  Career Level Non-Manager - Entry-Level (0+ years exp) Job Description Maxim Integrated is a highly successful, $2.31 billion company. With offices and manufacturing sites around the world, we design award-winning semiconductors that make the world more integrated. We also know that it's our people who make us a great company. So we reward bold thinking, teamwork, personal growth, and community involvement. Want to make a difference and be challenged every day? Join us at Maxim Integrated. With analog integration, the possibilities are endless.  Maxim is seeking a Data Analyst who will be responsible to ensure customer supply health by proactively managing our customer delivery programs, driving process improvement, and interfacing at all levels of the organization to manage customer delivery expectations. Primary Responsibilities:Web Application maintenance and user support to Manufacturing team. Web server management.Collaborate with cross-functional groups such as Solutions IT, Supply Chain, Operations and Engineering to enhance tools, data sources, system functionalities.Review high-volume data to identify issues with forecast-to-load accuracy and capacity performance models.Create custom Tableau dashboards to help track model performance KPIs (Cycle time, delinquency metrics)Minimum QualificationsMaster of Science or equivalent in Information science, Industrial engineering or equivalent.Excellent SQL skills, with strong experience in building complex, custom SQL queriesAnalytical, quantitative mindset with a keen attention to detailHigh level of computer skills to effectively use multiple systemsWillingness to adapt to a constantly changing, customer-driven work environmentAbility to work on routine tasks both independently and with the teamSelf-starter and comfortable taking initiative while quickly grasping concepts, processes and ideasFamiliarity with scripting.Knowledge of JDA planning engine (extra credit) Maxim is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability or protected veteran status.  Percentage of Travel 0% - 10%  Relocation Assistance Available Yes  Visa Sponsorship Available Yes  Removal Date 07/25/2018"}