{"jobID": "2825147239", "jobLocation": "Mahwah_NJ", "jobTitle": "Environmental Scientist/Geologist", "companyRating": "3.8", "companyInfo": {"Website": "www.hdrinc.com", "Headquarters": "Omaha, NE", "Size": "10000+ employees", "Founded": " 1917", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "Job Description Environmental Scientist/Geologist  Environmental Scientist/Geologist (******) About UsAt HDR, we specialize in engineering, architecture, environmental and construction services. While we are most well-known for adding beauty and structure to communities through high-performance buildings and smart infrastructure, we provide much more than that. We create an unshakable foundation for progress because our multidisciplinary teams also include scientists, economists, builders, analysts and artists. That's why we believe diversity is our greatest strength. HDR is proud to be an equal opportunity workplace and an affirmative action employer.  We believe that the way we work can add meaning and value to the world. That ideas inspire positive change. That coloring outside the lines can illuminate fresh perspectives. And that small details yield important realizations. Above all, we believe that collaboration is the best way forward.  Mid-level Geologist or Environmental Scientist professional sought for active environmental and hazardous waste investigation group in expanding northern NJ-based practice of large, international consulting firm. Needed to support Preliminary Assessment/Site Investigation, Remedial Investigation/Feasibility Study, Responsible Party Oversight and Remedial Action projects at various levels of complexity, in accordance with NJDEP, NYSDEC and Federal regulations. Will also provide environmental support of other business sector projects, including transportation, mining, energy and water. Opportunities to work on state-of-the-art Federal projects, gain experience with managers who are licensed/involved in setting standards, developing and implementing NJ Site Remediation, environmental permitting, Superfund and other state and Federal program guidance. Responsibilities Position involves hazardous waste site investigation and remediation project scoping, costing and implementation for PA/SI, RI/FS, Oversight or Corrective Actions. Requires working independently on smaller projects or as a team leader on larger projects in the field and planning and reporting work.  Assignments can include observation, participation and/or management of field activities including drilling, monitoring well installation and sampling, soil excavation/removal, soil sampling, vapor intrusion investigations, UST removal and closure, remediation system pilot testing and system installation, and operation, maintenance and monitoring of remediation systems.  Responsibilities also include conducting analyses to develop design options or recommendations; application of standard and non-standard techniques for data collection; assisting in the preparation of professional deliverable documents; and assisting with project management and proposal development. This position is a mix of field and office assignments with project management responsibilities, potentially leading to a project management position. Keyword(s): Environmental Scientist, Geologist. Environmental Consulting, job #****** Qualifications Required Qualifications  BS or MS degree in Environmental Science, Geology, Chemistry or related discipline.  Proficiency with MS Office programs including Word, Excel and Access; familiarity with Earthsoft EQuIS software, experienced ESRI ArcGIS user. Excellent oral and written communication skills and ability to work in a fast-paced team environment are a must. Knowledge of NJDEP, NYSDEC and Superfund regulations and guidance a plus. Current HAZWOPER 40 hour certification is required.  Preferred Qualifications  Candidates from the metro NY/NJ area are preferred. Hiring preference will be given to HUD Section 3 eligible residents.  Why HDRAt HDR, we know work isn't only about who you work for; it's also about what you do and how you do it. Led by the strength of our values and a culture shaped by employee ownership, we network with each other, build on each other's contributions, and collaborate together to make great things possible. When you join HDR, we give you license to do the same. We help you take charge of your career, giving you multiple growth opportunities along the way.  At HDR, we are committed to the principles of employment equity.  USA: We are a Federal Contractor, Affirmative Action and Equal Opportunity Employer. We consider all qualified candidates regardless of minority, veteran, disability, sexual orientation, gender, gender identity or any other status protected by law.  CANADA: We welcome applications from all qualified individuals.  AUSTRALIA: We consider all qualified candidates regardless of gender, ethnicity, country of birth, political or religious affiliation, health status, or any other status protected by law.  At HDR, health and safety matters.  For some positions, you may be required to provide drug and alcohol testing, before or during employment, based on our Drug Testing and Drug Free Workplace Policy.  If you are required to drive for us, we require a valid driver's license and compliance with our vehicle policy."}