{"jobID": "2823681226", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Analyst - Finance", "companyRating": "4.5", "companyInfo": {"Website": "www.snowflake.net", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Amazon, Google, Microsoft"}, "estimatedSalary": "75000", "jobDescription": "Snowflake started with a clear vision: make modern data warehousing effective, affordable, and accessible to all data users. Because traditional on-premises and cloud solutions struggle with this, Snowflake developed an innovative product with a new built-for-the-cloud architecture that combines the power of data warehousing, the flexibility of big data platforms, and the elasticity of the cloud at a fraction of the cost of traditional solutions. Snowflake: Your data, no limits.As a Data Analyst for our Finance team, your work is used to uncover insights about the financial operations of Snowflake, helping to drive important strategic decisions. You will join a small, growing finance team and also work with some of the leading data scientists and engineers in the field.We are looking for someone who is passionate about analytics and is able to approach complex problems in an organized and detail-oriented manner. As Finance touches on all aspects of the business, you should be an intellectual athlete who has the desire to learn about customer behavior and the important drivers of various departments.Responsibilities:Develop and maintain company-wide analytics reporting and processes that provide insights to business performance and key company metrics for a fast growing, SaaS-based companyProvide regular, timely reporting and performance monitoring to Finance, Executive Team, and other key business stakeholdersDevelop data collection and appropriate analytical tools, models and processesSynthesize data from various sources such as AWS, ERP, and other internal systemsMeet regularly with sales teams, executive management, and key stakeholders to present analysis and actionable recommendationsThink creatively to find optimal solutions to our complex, often unstructured problemsOur ideal candidate will have:3+ years of experience working with SQL and relational dataSolid understanding of financial and accounting concepts as well as familiarity with SaaS metrics2+ years of experience working with large-scale data3+ years of experience with tools commonly used for data analysis such as Python (numpy, pandas, and scikit), or R.Strong experience with at least one scripting language, such as Python, Ruby, Perl, or Bash.Experience working with Excel, ERP and Financial Planning toolsExperience with business intelligence tools such as Looker, Tableau, Business Objects, or Microstrategy.Familiarity with MPP databases, such as Snowflake, Redshift, BigQuery, Vertica, etc.Experience identifying and debugging data problemsExposure to automating processesExposure to building ETL pipelinesAbout SnowflakeSnowflake Computing, the cloud data warehousing company, has reinvented the data warehouse for the cloud and todays data. The Snowflake Elastic Data Warehouse is built from the cloud up with a patent-pending new architecture that delivers the power of data warehousing, the flexibility of big data platforms and the elasticity of the cloud at a fraction of the cost of traditional solutions. Snowflake can be found online at snowflake.net.Snowflake has been voted as one of the Bay Area Best Places to Work in 2015, 2016, and 2017. We are a place where people work effectively with the same values and vision. We focus on doing what is right for our customers, shareholders, and employees. We create great products, individually and as a team.Snowflake is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, color, gender identity or expression, marital status, national origin, disability, protected veteran status, race, religion, pregnancy, sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances."}