{"jobID": "2827554778", "jobLocation": "Washington_DC", "jobTitle": "Post Doctoral Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.business.gwu.edu", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1821", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Posting Details I. DEPARTMENT INFORMATIONJob Description Summary: GW's Department of Electrical and Computer Engineering (ECE) provides leading edge programs in electrical and computer engineering in order to provide leadership in a rapidly evolving global information society in the service of humanity and to advance the state of knowledge in our disciplines by actively pursuing scholarly research for publication and dissemination. The Department offers undergraduate and graduate degrees in computer, electrical, and telecommunications engineering. The Department also offers a Certification in High-Performance Computing. Additional information on ECE can be found at http://www.ece.seas.gwu.edu.  ECE is searching for a full-time Post-Doctoral Scientist that will report directly to the Principal Investigator (PI), and assist with research initiatives related to the study of identifying trends in big data. Responsibilities Include: Designs algorithms to help cleanse, match, transform, and identify trends in big data.  Implements systems and methods to identify and help address the analytical and security challenges involved with big data.  Contribute to the development of reports, publications, and proposals in reputable science journals.  Performs other work related duties as assigned. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position. Minimum Qualifications: Qualified candidates will hold a PhD in a related discipline. Degree must be conferred by the start date of the position  Additional Required Licenses/Certifications/Posting Specific Minimum Qualifications: Preferred Qualifications:  PhD in Computer Engineering, Computer Science, or related areas. Experience and publications in leading conferences and journals on computer systems, high-performance computing, and big data is required. II. POSITION INFORMATION Campus Location: Foggy Bottom, Washington, D.C. College/School/Department: School of Engineering and Applied Sciences (SEAS) Family Research and Labs Sub-Family Laboratory Research Stream Individual Contributor Level Level 3 Full-Time/Part-Time: Full-Time Hours Per Week: 40 Work Schedule: 9:00am to 5:30pm -Monday through Friday Position Designation: Essential: Employees who perform functions that have been deemed essential to maintaining business or academic operations. Employees are generally expected to work from home during an event and may be asked to physically report to work. Telework: Required Background Check Criminal History Screening, Education/Degree/Certifications Verification, Social Security Number Trace, and Sex Offender Registry Search Special Instructions to Applicants: Internal Applicants Only? No Posting Number: R000585 Job Open Date: 06/22/2018 Job Close Date: If temporary, grant funded or limited term appointment, position funded until: Background Screening Successful Completion of a Background Screening will be required as a condition of hire. EEO Statement:  The university is an Equal Employment Opportunity/Affirmative Action employer that does not unlawfully discriminate in any of its programs or activities on the basis of race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity or expression, or on any other basis prohibited by applicable law."}