{"jobID": "2667337556", "jobLocation": "Pasadena_CA", "jobTitle": "Speech Research Scientist (Speech Synthesis)", "companyRating": null, "companyInfo": {"Website": "www.oben.me", "Headquarters": "Pasadena, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SPEECH SPEECH RESEARCH SCIENTIST (SPEECH SYNTHESIS)ObEN’s mission is to enable everyone in the world to create their own Personal AI (PAI), intelligent 3D avatars that look, sound, and behave like the individual user. Secured and authenticated on the Project PAI blockchain, ObEN’s technology creates more productive, more personalized digital interactions. ObEN is a K11, Tencent, Softbank Ventures Korea and HTC Vive X portfolio company, and we work with our strategic investors to expand PAI technology across multiple verticals including hospitality, retail, healthcare, and entertainment.  Working at ObEN means taking on extraordinary transformations every day, in an environment that celebrates and encourages innovation. You’ll be working in small, agile teams (including world class researchers in areas of speech, computer vision, machine learning, NLP, and blockchain). We are blazing new trails in AI and blockchain technology, and we encourage and support publications to top conferences and journals. Learn more about working at ObEN in our blog post.Job Description: As a Speech Research Scientist specialized in Speech Synthesis, you’ll be working on improving ObEN’s speech synthesis technology. This will include the improvement of our current voice model and development of new speech generation approaches based on deep generative models. Responsibilities:Develop and extend ObEN’s glottal source model, in view of improving the quality, flexibility and control (e.g. voice quality, expressivity) of ObEN’s speech and singing voice synthesis system;Develop new speech generation approaches based on deep generative models (e.g. wavenet) with reduced amount of data and better control.Requirements:PhD with strong experience in Speech Synthesis demonstrated by publications in top Speech Journals and Conferences (Icassp, Interspeech, etc);Expertise in signal processing in particular in the design of voice models (glottal source model, …) allowing a fine control of the characteristics of the synthesized voice (speech and singing voice);Experience in deep generative model of raw audio (wavenet) and Generative Adversarial Network (WGAN);Fluent in Python and C++, and good knowledge of deep learning packages (TensorFlow, Theano, Keras, etc);Familiarity with linguistic phonetics;Knowledge of basic digital signal processing techniques for audio.Application requirements:Please send the following to careers@oben.comDetailed resume and/or LinkedIn profileLinks to any research / papers you have been an instrumental part of and are proud ofName of instructor / adviser, if any along with link to their profileCover Letter identifying your five favorite apps on your phoneIntroduction to ObEN: https://goo.gl/gxpxwTInterview process:STAGE 1: Phone Interview STAGE 2: In-person Interview at Idealab (we cover travel expenses for the day) STAGE 3: We require a sample project submission and a candidate proposal submission(To know more about what an ObEN candidate proposal is, click here) STAGE 4: Spend a day at our office and participate in all team activities. STAGE 5: Offer Letter "}