{"jobID": "2645761439", "jobLocation": "Glendale_CA", "jobTitle": "Clinical Laboratory Scientist, Full Time, Day", "companyRating": "3.2", "companyInfo": {"Website": "www.adventisthealth.org", "Headquarters": "Roseville, CA", "Size": "10000+ employees", "Founded": " 1973", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60", "jobDescription": " Clinical Laboratory Scientist, Full Time, Day Job Number: 00739  Shift: Day Shift  Adventist Health Glendale  Glendale, CAApplyApply  Keep Me In MindAdventist Health is more than an award-winning health system. We provide whole-person care to our communities and champion the greater good – from the operating room to the boardroom, we are driven by our unique passion to live God’s love through health, wholeness and hope. From Oregon to Oahu, we have a calling to always do more. Now is your chance to apply your passion to our mission.  Located in Los Angeles County, California, Adventist Health Glendale has been serving its community since 1905, and has been named one of the ‘Best Places to Work in Los Angeles’ by the Los Angeles Business Journal. It is home to a compassionate team of people living their mission in the medical field, and it shows-Adventist Health Glendale has achieved a number of major distinctions, including being a Joint Commission ‘Top Performer’ in the areas of stroke, cardiac care and pneumonia, as well as being one of only five hospitals in California with a cancer program recognized with an Outstanding Achievement Award by the American College of Surgeons.  Glendale is divided into 34 neighborhoods rich in culture, history and art. From Universal Studios Hollywood to Dodger Stadium or the Museum of Neon Art-you’ll never run out of things to do here.  We’re looking for someone to join our team as a Clinical Laboratory Scientist who:  Prioritizes and performs a wide variety of clinical laboratory tests on various biological specimens. Reviews, evaluates, documents and reports results. Preserves confidentiality of patients and follows lab safety and maintenance protocols. Trains and supervises trainees, laboratory assistants and clerks as needed.Essential Functions:Employs positive patient identification procedures to ensure the integrity of each specimen for pre-analytical, analytical and post-analytical testing. Performs proper specimen collection (including phlebotomy procedures as necessary), labeling, handling, preservation or fixation, processing or preparation, transportation and storage. Adheres to Health Insurance Portability and Accountability Act (HIPAA) and other patient confidentiality guidelines and regulations.Prioritizes lab orders according to type (STAT, ASAP, routine and timed studies) and performs various testing (including chemistry, coagulation, hematology, special chemistry, urinalysis, blood bank, serology, immunology, bacteriology, microbiology, referral testing and more) following prescribed quality assurance policies and procedures. Performs, evaluates and documents quality control checks. Reviews testing results evaluating validity of test results in comparison to anticipated results indicated per procedure manual.Reviews and evaluates the validity and accuracy of test results, recognizing the interdependency of tests, the physiological conditions affecting results, patient age and normal values, controls, linearity errors, instrument codes, delta checks and more. Correlates test results with diagnoses and questions incompatible results. Thoroughly documents and communicates test results, expediting all critical values and results to appropriate clinicians.Disposes of contaminated materials and equipment in accordance with policy and assures that work area is properly cleansed after each test. Performs equipment and instrumentation maintenance, troubleshooting and calibration as needed. Inventories and restocks reagents, calibrators, controls and supplies as needed.Participates in the collection and evaluation of data for Performance Improvement evaluations. Documents adverse events using incident reporting tool. Orients, instructs and supervises laboratory assistants and clerks as needed.Performs other job-related duties as assigned.  You’ll be successful with the following qualifications: Education: Bachelor’s Degree or equivalent (some certifications will require Bachelor’s): Preferred  Master’s Degree: Preferred Work Experience: Clinical laboratory experience: Preferred Required Licenses/Certifications: American Society for Clinical Pathology (ASCP) certification: Preferred  Valid Clinical Laboratory Scientist (CLS) license in state of employment: Required  National Credentialing Agency (NCA) for Laboratory Personnel certification: Preferred  Point of Care Testing (POCT) Specialist certification: Preferred"}