{"jobID": "2831116723", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Connected Vehicle Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.deerybrotherschryslerdodgeramjeep.com", "Headquarters": "Iowa City, IA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "QualificationsFCA’s Connected Vehicle Operations team is looking for an enthusiastic and capable Data Analyst who will be responsible for generating, analyzing, refining and presenting connected vehicle data that is critical to building better products as well as improved customer experience. FCA’s connected vehicle team is growing rapidly and provides challenges and opportunities to make a difference. If this is something you are looking for then look no more.  Main Responsibilities include: Lead connected vehicle data analysis by writing SQL queries to pull data from several FCA internal databases, analyze and refine data to generate and present meaningful reportsSupport new product launches, Firmware-Over-The-Air (FOTA) campaigns, volume forecasts, factory VIN feed process and several other ad-hoc data analysis requests.Support Connected Vehicle Operations support teams on all data needs to resolve customer issuesCoordinate and Collaborate with internal as well as external IT and engineering teams to monitor and, analyze back-end information flow on key connected vehicle processesWork actively with product planning and marketing teams to generate data that is essential to launching features as well as customer communicationBasic Qualifications:Bachelor of Science degree in Computer Science, IT, Engineering, or other related technical subjectMinimum of 5 years of overall experienceMinimum of 2 years of experience in OEM Telematics/Connected Services/ArchitectureExpert in the database communication language, SQLExperience working with DB Visualizer and MS AccessExcellent working knowledge in MS-Office Suite especially Excel (Pivot tables, V-Lookup etc), Access and Power PointExcellent analytical, organizational, multi-tasking and time management skillsPreferred Qualifications:Working knowledge/experience in other programming languages (Java) to automate reportsExperience working with Qlik Sense or Eclipse for JavaWorking knowledge of FCA’s tools and processesOur benefits reflects the FCA commitment to helping you reach your personal and professional goals. In addition to an environment that promotes career development, we offer benefits for a healthy lifestyle and a rewarding future, designed to take care of you and your family, in various stages of life.  As a global company, our employee packages will vary by country, customary norms and the legal entity into which you are hired.  Apply"}