{"jobID": "2830932511", "jobLocation": "Roseville_CA", "jobTitle": "Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.sedgwick.com", "Headquarters": "Memphis, TN", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Data AnalystCLAIM YOUR FUTURE AS A GREAT PERFORMER!Providing both satisfying and challenging work along with a highly professional and friendly work atmosphere, Sedgwick has a strong commitment to its colleagues and its clients. If you are seeking a place where you can do great things for those whose lives you touch while maximizing your own career possibilities, Sedgwick is the place for you. As the largest and most innovative Third Party Administrator in the claims industry and the first and only TPA to receive both recognition as theBest TPA in America and the covetedEmployer of Choice designation, we invite you to come be a part of our team and,\"Claim Your Future.\"PRIMARY PURPOSE: To collect, analyze and report data; to be responsible for the data integrity; and to generate reports verifying and ensuring data integrity and accuracy. ESSENTIAL FUNCTIONS and RESPONSIBILITIESCompiles data; prepares and distributes reports; and analyzes results.Ensures data integrity; develops and produces reports utilized in measuring data accuracy.May assist in the completion of appropriate client set-up and maintenance (parameter) forms.Supports internal and external users including reports, installation, screen, etc.Creates exception reports to identify fields of incorrect data.Generates custom reports for internal and external client.ADDITIONAL FUNCTIONS and RESPONSIBILITIESPerforms other duties as assigned.Supports the organization's quality program(s).QUALIFICATIONSEducation & Licensing Bachelor's degree from an accredited college or university preferred. Experience Five (5) years of related experience or equivalent combination of education and experience required. Two (2) years query and report writing experience strongly preferred. Skills & KnowledgeStrong knowledge of query and report writingExcellent oral and written communication, including presentation skillsPC literate, including Microsoft Office productsAnalytical and interpretive skillsStrong organizational skillsExcellent interpersonal skillsAbility to work in a team environmentAbility to meet or exceed Performance CompetenciesWORK ENVIRONMENTWhen applicable and appropriate, consideration will be given to reasonable accommodations. Mental: Clear and conceptual thinking ability; excellent judgment, troubleshooting, problem solving, analysis, and discretion; ability to handle work-related stress; ability to handle multiple priorities simultaneously; and ability to meet deadlines Physical: Computer keyboarding, travel as required Auditory/Visual: Hearing, vision and talking NOTE: Credit security clearance, confirmed via a background credit check, is required for this position.  The statements contained in this document are intended to describe the general nature and level of work being performed by a colleague assigned to this description. They are not intended to constitute a comprehensive list of functions, duties, or local variances. Management retains the discretion to add or to change the duties of the position at any time. Sedgwick is an Equal Opportunity Employerand aDrug-Free Workplace #LI-TS"}