{"jobID": "2803284961", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.intelliloan.com", "Headquarters": "Irvine, CA", "Size": "51 to 200 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "We are a growing mortgage company based out of Irvine, California and are looking to immediately fill the position of Data Analyst. This position will provide critical insights to support the management team's ability to make data based decisions. The Data Analyst will build an understanding of the business at a level of detail that enables them to identify and address critical metrics and measurements. They will provide data that is accurate and reliable, and document processes for consistent reporting. The position will work closely with the executive, sales, and marketing teams for the purpose of analysis and option exploration. The ideal candidate has strong critical thinking and analytic skills, and uses their superior communication skills to present findings in a clear and impactful way.  Job Responsibilities:Develop and build interpretations of data utilizing multiple tools.Identify, analyze, and interpret trends or patterns in complex data setsDesign and implement data collection systems and other strategies that optimize statistical efficiency and data qualityClearly convey the key insights the data reveals in a visual format that is grouped, summarized, and formatted to be easily understood and actionable.Develops demand forecasts for products and processesProvides input to the development of information quality metricsWork with IT and related parties in resolving data issues and improve data environment. Have ownership of marketing data.Document business and technical reporting methodology, best practices and related rules for generating reports to ensure results accurately represent the underlying data.Query relevant data from databases, such as Microsoft SQL server, using complex Structured Query Language (SQL), manipulate large unstructured and structured datasets to build insightful solutions to complex problems, and present the results in visually engaging and intuitive reports and dashboards.Ability to work independently, manage conflicting priorities, and communicate effectively both verbally and in writingAble to work in multiple projects simultaneouslyPartners with management team to develop and analyze data requests.  Required SkillsBachelor's degree in Computer Science, Information Systems, Business Management or specialized training/certification or equivalent work experience.Strong communication and presentation skills.Proven working experience as a data analystTechnical expertise regarding data models, database design development, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing large datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsAbility to interface with all levels of the business to define business and functional requirements.Mortgage Banking experience preferredExperience with Motivity and Encompass is preferred, but not requiredHourlyNoBachelor’s DegreeMonday, June 18, 20184 Park Plaza, Irvine, California, Irvine, California, United States of America Apply Now  See all jobs"}