{"jobID": "2801500306", "jobLocation": "Berkeley_CA", "jobTitle": "Scientist I-II-Senior", "companyRating": "3.3", "companyInfo": {"Website": "www.dynavax.com", "Headquarters": "Berkeley, CA", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Public (DVAX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " AstraZeneca, Bristol-Myers Squibb"}, "estimatedSalary": "113000", "jobDescription": " This position will support drug discovery and drug development programs in the area of immuno-oncology. The area of responsibility will include, but not be limited to, the discovery and characterization of novel compounds. Based on the company’s scientific strategy, the ideal candidate will independently design and execute experiments to assess in vitro and in vivo immune responses to progress discovery and IND-enabling pipeline and/or portfolio projects.  The Senior Scientist level position will lead and manage lower level research associates. Develops, initiates, and leads new research projects.Serves as the subject expert in one or more scientific areas.Consults with colleagues as needed to define project goals, experimental design, and data interpretation.Contributes to strategic planning and initiation of new research directions.Keeps current in area of expertise through reading, conferences, interaction with colleagues inside and outside of company.Primary responsibility for reports, patents, and SOPs in area of expertise.Prepares group, project, and management presentations with minimal supervision. Active contributor to internal scientific and technical discussions.Expected to be author and/or co-author of scientific papers and grants, and supervises communications from direct reports.May directly and indirectly supervise activities of laboratory personnel.Analyzes experimental data, prepares and submits detailed technical reports, and presents results at team meetings.Supports the organization in maintaining a work environment focused on quality and that fosters learning, respect, open communication, collaboration, integration, and teamwork.Other duties as assigned.PhD in immunology or related field. The Scientist I will have a minimum of 1-2 years’ related post-doctoral or industry experience, or a BS/MS with 10+ years’ industry experience. The Scientist II will have a PhD and 3 to 6 years’ relevant experience or a BS/MS with 15+ years’ industry experience and 1-3 years independently functioning at the scientist level. The Senior Scientist will have a PhD in immunology or related field and a minimum of 7+ years’ related experience in the biotech/pharma industry and will have at least 1 year experience managing lower level technicians.Several years of technical expertise in key immunological techniques including in vivo tumor immunology, ELISPOT, cellular immunology, cell-based assays, immunofluorescent microscopy, and flow cytometry.Critical thinking ability as well as demonstrated and proven problem-solving skills.Professional, driven to excel in science and self- motivated.Highly effective communicator with excellent written and verbal communication skills and demonstrated ability to effectively collaborate across functional lines.Strong organizational and planning skills; must be able to work independently as well as in a team and collaborative environment.Personal attributes include: Flexibility and integrity,Commitment to quality and attention to detail,Practical approach to science,Demonstrated good judgment,Respectful of others. Additional knowledge and skills desired, but not required: Experience conducting in vivo experiments.Experience working with external collaborators, such as partner companies or external laboratories."}