{"jobID": "2394460597", "jobLocation": "Troy_MI", "jobTitle": "Underwriting Boot Camp", "companyRating": null, "companyInfo": {"Website": "www.unitedshore.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "THE GIGIntense Training Provided? YESUniform Required? NO This training program is no joke. 8-10 weeks of training that will prepare you to be an Underwriting ROCKSTAR. So, are you up for the challenge?  The mortgage industry is hot and growing. Now is the time to move your career in this direction. United Shore has a unique opportunity for you to build a promising career in mortgage underwriting. We offer comprehensive training and mentoring to learn the mortgage business with career advancement opportunities including credit policy and operations management.  Our goal is to provide all our clients with the best service in the industry. Our amazing team achieves this goal by possessing and demonstrating positive attitudes, and superior product knowledge. WHAT YOU WILL BE DOINGProvide world-class service to all internal and external clientsLearn investor guidelines, lending policies as well as a required documentation, policy and procedures of United ShoreApply knowledge and judgment to detailed loan analysis in order to offer effective underwriting alternatives to clientsDevelop strong computer skills including internet knowledgeManage multiple priorities while continuing to achieve strong rapport with clientsWHAT WE NEED FROM YOURequired: Bachelor's degree in a business concentration such as finance, economics, accounting, mathematics, statistics, business administration, actuarial science, or other business related fieldsMinimum 3.0 cumulative GPAClient Service Experience (Phone Preferred)You are open to learning, willing to be coached, and able to be flexible in an ever-changing industryYou thrive in a team environment. We're one big family who has fun together and helps each otherYou take accountability for your actionsYou have a strong work ethicYou drive to get better every dayThis position requires on-site attendance.THE PLACE & THE PERKS United Shore is a diverse group of over 2,200 mortgage experts, sales superstars, tech gurus, marketing whizzes, and more – all working toward the same goals. We’re a $30 billion and growing, family-owned-and-operated company that still feels like family. We have an award-winning workplace that just happens to be home to the #1 wholesale mortgage lender in the country, United Wholesale Mortgage. We’re committed to a 40-hour workweek. And we believe in setting our team members up for success by creating a unique, energetic culture where you can be yourself and still reach your goals. Here are just a few of the reasons you’ll love working here:Be well here - Salta Direct is our in-house doctor’s office, available to all team members!Work-life balance. Give us 40-hours and the rest is yours.Generous benefits package including health and wellness, community involvement, personal and professional development, and rewards and recognitionFree fruit, soft drinks, and coffeeGourmet cafeteria featuring homemade breakfast, lunch, sushi Mondays, and Mediterranean food.State-of-the-art fitness center open 5 a.m.–11 p.m. daily24/7 convenience storeOur very own StarbucksCool company events that always include a surprise or twoLawn vouchers to concerts at DTE Energy Music Theater DISCLAIMERAll the above duties and responsibilities are essential job functions subject to reasonable accommodation. All job requirements listed indicate the minimum level of knowledge, skills and/or ability deemed necessary to perform the job proficiently. Employees may be required to perform any other job related instructions as requested by their supervisor, subject to reasonable accommodations. This document does not create an employment contract, implied or otherwise, other than an \"at will\" employment relationship. United Shore Financial Services is an Equal Opportunity/Affirmative Action Employer."}