{"jobID": "2834410814", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist - iCloud", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Data Scientist - iCloud Job Number: 113720305Santa Clara Valley, California, United StatesPosted: May. 19, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish.  Are you in love with data? Do you love deciphering obscure statistics? If so, we would love to have you at iCloud Big Data Analytics! We are a growing team of engineers and scientists positively impacting iCloud and Apple.  In this role you will provide data driven insights to improve revenue, margin and customer experience for strategic iCloud services. You will invent and build novel products and statistical/machine learning models to surface actionable business insights, and communicate results and ideas to key decision makers.  We work closely with multi-functional teams such as marketing, finance, product engineering teams. We work together to understand their processes and analytic needs. We then provide statistical modeling and insights that benefit Apple.Key Qualifications 5+ years of experience in analyzing data and reportingStrong data mining and statistical modeling backgroundMathematical knowledge understanding of machine learning techniques such as regression, time series analysis, clustering, decision tree techniquesRecent experience with building models such as Forecasting growth, Predicting churn, Customer clustering and detecting anomalyExperience in data engineering in Big Data systemsExpertise in designing Data Models for high performance and scalabilityExperience with Spark, Hadoop or other distributed frameworksExperience in high-level programming language for analysis (e.g Python, R, Scala) Description Performing adhoc data analysisBuild data engineering assets using Scala, Python and other big data SQL technologiesProgram in Java/Python/R to develop predictive and forecasting modelsInvent advanced statistical/machine learning methods to improve current KPIsOperationalize the data engineering and machine learning modelsCraft visualizations to communicate insights and analytics finding EducationBA/BS/BE in a quantitative field (Statistics, Computer Science, Ops Research etc.)  Masters or PhD in Statistics/Mathematics is a plus"}