{"jobID": "2492597926", "jobLocation": "Chicago_IL", "jobTitle": "Data Integrity Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.mattersight.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Public (MATR) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " NICE, Verint Witness"}, "estimatedSalary": "79000", "jobDescription": " Company OverviewWho Mattersight is:  The rubber hits the road when someone picks up the phone to talk to a company. It happens over 250 million times a day. With over 60 percent of people dumping brands because of bad customer service, that phone call can make or break a business.  Enter Mattersight – the only company that uses personality analysis and big data analytics to improve every customer call, increase customer satisfaction and lower costs for Fortune 500 enterprises. Our patented technology mines a private database of over 1 billion customer service calls to quickly pair customers with call center agents they will naturally, effortlessly click with. Awkward and annoying becomes satisfying and enjoyable. Frustrated becomes enthusiastic.  Mattersight helps companies make positive conversations with their customers the rule, not the exception by fostering emotional connections that turn complainers into fans.Responsibilities & QualificationsWho you are: Mattersight is seeking a Data Integrity Analyst who is excited about data analysis, software testing, and product quality to join our Data Integrity & Testing team. We are looking for entry-level individuals who are energized by the prospect of using data to solve real world problems, are comfortable working in an agile and entrepreneurial environment, and will be able to help our company grow. The role will be challenging, but will reward those who thrive in a fast-paced, client-focused, and entrepreneurial environment. What you’ll do: Individuals in the Data Integrity Analyst role are responsible for, but not limited to, the following tasks: Overall project and service quality managementParticipate in new product feature and designDrive quality into new feature and product developmentTest, troubleshoot, and critique software components and interfacesReview and analyze effectiveness of system modificationsProvide efficient reports on team progress and own assignmentsUnderstand customer requirementsDesign and develop solutions for test management, execution, and reportingClient issue managementParticipate in change management function to upgrade client systemsProvide analyst support to client and project teams All Data Integrity Analysts receive initial training, followed by division or department specific training over varying lengths of time. The goal of the Analyst training program is to provide the knowledge and skills necessary to become an integral member of the Behavioral Analytics Service group as quickly as possible. The ideal candidate is someone who seeks, and is capable of, rapid career progression. With the growth of our solution and client base, there are a variety of career paths available at Mattersight. Career Track & Advancement Mattersight stresses internal growth and promotion. Employees in the Analyst role are encouraged to explore career paths and opportunities available with Mattersight teams. Over the course of their careers, Analysts will work with their Manager and Employee Mentors to develop the skill sets required for new and expanded roles so they continue to advance at Mattersight. Typically, Analysts demonstrate the ability to take on additional responsibilities and move into expanded Career Tracks after 18 – 24 months.  Career Tracks include, but are not limited to paths in the following areas: Data Integrity & Testing – Support successful delivery of Behavioral Analytics solutions through analyzing business requirements, communicating with technical teams, and leveraging testing techniques to drive data and software qualityBehavioral Science - Strengthen our core offerings by creating and improving upon our cutting edge, market differentiating featuresCustomer Success - Drive tangible business benefits at our clients using a data-driven management consulting approachData Science- Provide high impact data driven analyses, research and develop predictive models, and uncover insights for new and potential offeringsImplementation & Program Management – Manage deployment of our prorietary solutions while managing timelines, partnering with clients, and streamlining Mattersight delivery processesProduct Management - Define the vision and requirements for the Behavioral Analytics product development and innovation initiatives from concept to installationService Delivery Management - Maintain the operation of the Behavioral Analytics solution and associated customer satisfaction in a project management/account management consultative roleTraining & Adoption - Behavioral Model experts responsible for preparing client organization for adoption of Behavioral Analytics in a change management consultative role; transfers Behavioral Model knowledge and new coaching methodology to the clientRequired Knowledge, Skills, & AbilitiesApplicants must meet ALL of the following criteria: Mattersight is seeking entry-level candidates with a Bachelor’s Degree from an accredited University. Coursework of a quantitative or analytical nature is preferred. This can include, but is not limited to: Business, Computer Science, Economics, Engineering, Mathematics, Psychology, Sociology and Statistics.Other FactsCompany Culture & Facts Corporate Culture Mattersight values diversity amongst its employees. Employees from all levels of experience and backgrounds are mingled together and are encouraged to learn about projects others are working on. Mattersight’s Chicago office fosters teamwork as well as self motivation. Eligibility & Location Mattersight seeks candidates authorized to work without sponsorship in the United States. The Data Integrity Analyst role will be based out of Mattersight’s Chicago location; candidates should anticipate little to no travel. Compensation Mattersight is prepared to offer a highly competitive benefits and compensation package for the ideal candidate. Questions Any questions regarding the position should be communicated to Patrick Stearns, Director of Talent Acquisition, patrick.stearns@mattersight.com  For more information about Mattersight, visit http://www.mattersight.com/. Mattersight is committed to equal opportunity and affirmative action in all employment matters: Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, ancestry, marital or domestic partner status, national origin, disability or medical condition, pregnancy, veteran or military status, sexual orientation, gender identity, or on account of membership or affiliation with anyone in any of the foregoing categories, or any other protected category under federal, state or local law. Although particular legal provisions may differ in various locations in which we do business, our principles are the same worldwide."}