{"jobID": "2837801376", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Scientist / Geologist Project Manager", "companyRating": "3.2", "companyInfo": {"Website": "www.aecom.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ACM) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bechtel, ABB, Louis Berger"}, "estimatedSalary": "50000", "jobDescription": " Job Summary AECOM is actively seeking a highly motivated mid-level geologist (or related field) or project manager for employment in the Grand Rapids, Michigan office. The position is perfect for an experienced science lead or manager in the environmental consulting field that wants to expand their career at a global company. AECOM can offer a vast array of opportunities for a driven individual. Our Grand Rapids office is currently performing groundbreaking work on several sites that involve emerging contaminants. These high profile projects, along with our strong backlog of consulting work, will help to broaden the knowledge, experience level and value of our employees.  The responsibilities of this position include, but are not limited to: Project and Field ManagementAssist with all aspects of management both in the office and in the fieldPrepare and review proposals to win work from existing and new clientsPlan and implement field and office tasks using field level scientists and technician to complete the workData evaluation and report writingReport to the AECOM program manager and directly to the clientSupervise financials and client billings related to projects you manage Minimum RequirementsBachelors degree in Geology or related science degree4+ years of related experienceMust be able to work in a team environment; individually; and interact with other engineers, scientists, and administrative supportExperienced with environmental science principles, including site assessment and characterization, remediation, risk assessment, environmental chemistry, etc.Tolerance for overnight travel and working a some amount of the time in an outdoor environmentMust pass a State and Federal criminal history/security background check; many projects/ clients are security sensitiveMust participate in and successfully complete a post-offer, pre-employment fitness for duty questionnaireMust possess a valid driver's licenseCandidate must be able to meet the medical clearance requirements of an OSHA (HAZWOPER) medical surveillance physical examination40-Hour Hazwoper Certificate/Training, with 8-Hour Refresher (current)Effective oral and written communication skillsProficiency with Microsoft Office(Word, Excel, Outlook)Due to the nature of work, candidate must be a US Citizen or Permanent Resident of the United States Preferred Qualifications7+ years of related experienceProject ManagementPFAS related work preferredData AnalysisFinancial AnalysisIntegrityFirst Aid/CPR TrainingLockout/Tagout TrainingFall Protection/Prevention Training/CompetencyConfined Space Entry Training/CompetencyExcavation/Trenching Training/Competency Fire Extinguisher Use/Inspection TrainingHAZWOPER Supervisor (8-Hour) Certification What We Offer AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.  At AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&E; is a part of our company culture and participation is required for all employees.  NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM."}