{"jobID": "2828720365", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.bosch.us", "Headquarters": "Farmington Hills, MI", "Size": "10000+ employees", "Founded": " 1886", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Continental, Delphi, FCA Fiat Chrysler Automobiles"}, "estimatedSalary": "155000", "jobDescription": " Company DescriptionThe Bosch Center for Artificial Intelligence provides services in AI technologies to Boschs business units and plants. The center works in collaboration with a large team of researchers, engineers, and software service providers. Our data mining methods and solutions are implemented in a modern distributed architecture in order to scale up to very large data sets.  Artificial intelligence technologies are impacting Boschs products and services in many domains: manufacturing, predictive maintenance, vehicle diagnostics, supply chain, large-scale simulations, etc. This is a technical position for someone who is skilled at bringing together disparate technologies to solve business problems.Job DescriptionPrimary Responsibilities:Execute complex data science / data engineering projects that have a significant impact on Bosch global business.Share knowledge by clearly articulating results and ideas to customers, managers, and key decision makers.Collaborate with product, engineering, and marketing teams across many Bosch business domains (automotive, industrial, internet of things) to translate business needs into technical solutionsSelect and apply appropriate statistical, machine learning, and computing methods to large-scale, high-dimensional dataDevelop analytic methods for decision support in various Bosch businessesStay current with the latest research and technology and communicate your knowledge throughout the enterpriseTake responsibility for preparing data for analysis, review data preparation/ETL code and provide critical feedback on issues of data integrityContribute to Bosch&apos;s patent portfolioUp to 10% travel may be required. QualificationsBasic Qualifications:M.S. in Computer Science, Statistics, Mathematics, Industrial Engineering, Computer Engineering, Electrical Engineering, Physics, or Bioscience3+ year programming experience in at least 1 of the following: Python, Java, Scala, R, C++2+ years professional work experience in Data Science with focus on Probabilistic Graphical Models, Bayesian NetworksPreferred Qualifications:Ph.D. in Computer Science, Statistics, Mathematics, Industrial Engineering, Computer Engineering, Electrical Engineering, Physics, or BioscienceStrong background in statistics, machine learning, and/or big data processingExperience working with big data tool chains (e.g. Hadoop & Spark ecosystems)Experience with neural networks and deep learning methods, a plusStrong analytical and problem solving skillsExcellent communication skills Additional InformationBy choice, we are committed to a diverse workforce - EOE/Protected Veteran/Disabled.  BOSCH is a proud supporter of STEM (Science, Technology, Engineering & Mathematics)Initiatives: FIRST Robotics (For Inspiration and Recognition of Science and Technology)AWIM (A World In Motion)"}