{"jobID": "2834323943", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist/Modeling & Simulation Engineer", "companyRating": null, "companyInfo": {"Website": "www.b3groupinc.com", "Headquarters": "Leesburg, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " B3 Group Inc. is looking for a talented Data Scientists/Modeling & Simulation Engineer to support Data Analytics programs at the Department of Veterans Affairs (VA) in Austin, TX. The ideal candidate will have experience in creating and applying simulation models that allow manipulation of variables as defined by customer using a variety of modeling and simulation tools. They will also possess knowledge of software modeling and device characterization, hard and soft modeling development, parametric testing, and measurement automation, as well as have experience in the construction of simulations to customer specifications.  Key responsibilities include: Analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses.Integrates and prepares large, varied datasets for analysis. Identify and assess data attributes using statistical software packages in order to develop recommendations and analytical processes based on mission requirements.Obtains critical information from cross-referenced datasets while collaborating with counterparts, customers, data stewards, project/program managers, and other IT teams.Researches, develops, implements and utilizes statistical methods and strategies to address tactical and strategic problem sets, while working with a technical team.Interprets and analyze sdata collected from a variety of sources using exploratory and statistical techniques, validating findings using an experimental and iterative approach.Coordinates multifaceted scientific research and analytic activities and provide scientific and technical consultation about applicable best practices and new techniques.Designs and implements or coordinates systematic and rigorous scientific procedures for determining reliability, validity and statistical confidence associated with specific technologies and methodologies.  In order to be successful in this position, we expect you to have the following skills and experience:At least 5 years of relevant experience and strong knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrievalBachelors degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering or related field.Experience in extracting, cleaning, preparing, and modeling data; command-line scripting, data structures, and algorithms; and working in a Linux environment and proficiency in analysis packages (e.g. R, SAS, Matlab) and programming languages (e.g. Python, Ruby, Java, Scala)Ability to translate engagement objectives to a project plan with milestones, and resource/technology requirements, and teach, lead, and manage projects to successful executionAbility to work across multiple engagements with clients to assess needs, provide assistance, and resolve problems, using excellent problem-solving skills and verbal/written communication to non-technical audiences.  Desired / Preferred Qualifications:  • Demonstrated experience in the use of Scrum and Agile methodology and processes.Experience supporting Department of Veterans Affairs or other federal organizations. Preference will be given to those individuals where their primary residency is located in a qualified HUBZone (https://maps.certify.sba.gov/hubzone/map/) Successful B3 Group employees will display the following characteristics:You strive to be an expert in your field currently and in the future.You take care in learning your customers business and drivers in order to ensure solutions meet not only technical needs, but also support their mission properly in a way that meeting their client's mission.You like to make your client look good.You find solutions, where others only see problems.You are proactive, you make and meet commitments, and you perform your duties exceedingly well.You are aware of the clients needs at all times and are well-versed in what both your team and B3 Group can offer them as a whole.You have the ability to work with diverse, integrated, deliverable-driven teams to accomplish the larger mission. Our Benefits  Our reputation is built upon the talents and integrity of our employees. We value the contributions of each and every person who is a member of our organization. We offer challenging career opportunities, competitive salaries and a comprehensive benefits package to include the following: Paid Federal HolidaysAnnual Leave/Paid Time Off (PTO) and Sick LeaveHealth, Dental and Vision Insurance401(k) plan with contribution matchContinuing education assistanceFlexible Spending AccountsProfit SharingEmployee Referral ProgramLife and Accidental Death and Dismemberment (AD&D;) InsuranceShort (STD) and Long-Term Disability (LTD) Insurance About B3 Group, Inc.  B3 Group, Inc. is a fast-growing Service-Disabled Veteran-Owned Small Business (SDVOSB) and HUBZone certified health IT firm providing end-to-end technology support services to the federal government and enterprise customers. Our values-driven team of business, IT and management professionals blend innovation and client-first thinking to deliver sustainable solutions for better healthcare outcomes.  Established in 2008 and located in a Historically Underutilized Business Zone (HUBZone) headquartered in Leesburg, Virginia, B3 Group is founded on the principles of servant leadership. Those principles are reflected in every aspect of our operations. B3 Group, Inc. does not discriminate in employment opportunities, terms and conditions of employment, or practices on the basis of race, age, gender, religious or political beliefs, national origin or heritage, disability, sexual orientation, or any characteristic protected by law."}