{"jobID": "2737997535", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.confluent.io", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Backed by Benchmark, Index Ventures, and Sequoia Capital, Confluent is an infrastructure company founded and led by the original authors and thought leaders behind Apache Kafka, one of the most successful open source data projects ever. Confluent’s products let leaders in industries spanning retail, logistics, manufacturing, financial services, technology and media move data from isolated silos into a real-time data nervous system. We believe all businesses will come to be modeled in software and built atop a streaming platform, and we want to put ours at the heart of every company, both on-premises and in the cloud.About the Team:The Confluent marketing team builds awareness and generates demand for the leading streaming platform based on Apache Kafka. This small but mighty team works closely with every department at Confluent to help every enterprise realize the power of streaming data. We are outside-the-box thinkers who love a good challenge, and have fun while doing it.About the Role:The Data Analyst will work with business owners throughout the marketing organization to improve decision making speed and quality through better, scalable analysis of many aspects of our business. Strongly precise and an excellent communicator, the ideal candidate is able to understand broad business challenges, apply analysis to it, then present conclusions clearly and on time. A self-starter, the candidate actively seeks challenges the organization is having, and looks for opportunities to solve them through the correct application of data.They will also work closely with key systems owners (Marketing, Sales Operations, Finance, IT, Product) to understand the accuracy of our data and make system reportability easier.Responsibilities: Support strategic initiatives of the company through analysis of key business issuesUse GA, SFDC, Netsuite, and other core systems to extract insights on user behavior, prospects and persona definition. Be or become an expert in our core analysis tools (Chartio, SFDC reporting, Excel)Use the internally developed methods for measuring pipeline, campaign performance and other growth metrics for the Marketing Department, to develop and deploy goals to sales and marketing teams. Use the same to support regular business reporting.Identify gaps in processes/systems and work cross-functionally to implement scalable solutions to improve and automate themBuild systems that improve our cost forecasting ability in MarketingWhat We're Looking For:"}