{"jobID": "2661380168", "jobLocation": "Washington_DC", "jobTitle": "General Physical Scientist - Direct Hire Authority", "companyRating": null, "companyInfo": {"Website": "www.af.mil", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1947", "Type": " Government", "Industry": " Government", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Duties Help  Duties  Summary The mission of the United States Air Force is to fly, fight and win...in air, space and cyberspace. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do.  This is a Public Notice for positions being filled under the Direct Hiring Authority (DHA) for Domestic Defense Industrial Base Facilities and Major Range and Test Facilities Base, NDAA 1125 (a) and (c). Positions may be filled as permanent, temporary or term with a full-time or part-time work schedule. Pay will vary by grade level and geographic location. Under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application.  Please read this Public Notice in its entirety prior to submitting your application for consideration.  You are applying to a resume database, your resume and any documents submitted will be retained for six months and may be used at any time during this period. When a position is requested to be filled under the Direct Hire Authority, a list of applicants may be provided to management for review and possible selection. You will not receive any notifications and your resume will not be reviewed for qualifications until a position is requested to be filled. This Public Notice may be used to fill positions in other equivalent pay systems. This public notice may be used to fill one or more vacancies at any time without notification. Duties and responsibilities vary and may increase according to the grade level. This public notice may also be used to fill target grades (e.g. WG-08 Target WG-10).Learn more about this agencyResponsibilities General Schedule Salary Table for \"Rest of US\" (RUS) was used, salaries may vary dependent upon location selected. Please refer to the Salary Tables link for more information: https://www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/2017/general-schedule/  Link to GS Qualifications for additional information:  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=List-by-Occupational-Series Travel RequiredOccasional travel - You may be expected to travel for this position. Supervisory statusNo Who May Apply  This job is open to…  This public notice is to gather applications that may or may not result in a referral or selection.Questions? This job is open to 1 group. Job family (Series)1301 General Physical Science Requirements Help  Requirements  Conditions of Employment U.S. Citizenship is requiredMales must be registered for Selective Service, see www.sss.govTotal salary varies depending on location of positionPCS expenses if authorized will be paid IAW JTR and Air Force RegulationsRecruitment incentives may be authorizedThis posn is subject to provisions of the DoD Priority Placement Program Conditions of employment: ) Some positions may be deemed drug testing designated positions and require participation in random drug testing.) Incumbent may be subject to pre-employment drug testing as a condition of employment, and participation in random drug testing.) Appointment may be contingent upon passing a physical examination.) Incumbent may be required to obtain and maintain appropriate background investigation or security clearance.) May be required to drive a motor vehicle. A valid driver's license may be required for the position.) Employee may be required to work other than normal duty hours, to include evenings, weekends, and/or holidays.) Shift work and emergency overtime may be required.) Employee must maintain current certifications depending on series.) PCS or moving costs may be paid for approved positions, dependent upon Organizational needs and authorization.) Recruitment incentives or bonuses may be available for approved positions.*There may be additional conditions and/or requirements as determined by the position being filled.** Qualifications EXPERIENCE: Applicants will be rated in accordance with the OPM Qualification Standards; for additional information refer to the General Schedule (GS) qualifications link above. Position requirements vary dependent upon the specific series and grade, you must meet any minimum experience or training requirements per OPM qualifications standards and show through experience and/or training that you possess the quality level of knowledge, skill and ability necessary to perform the duties of the position at the level for which applying. EducationIF USING EDUCATION TO QUALIFY: You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education. FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying. Additional information Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location. Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information. Temporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position. Selective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here. Direct Deposit: All federal employees are required to have direct deposit.  If you have questions regarding this announcement and have hearing or speech difficulties click here.Read more How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above.  Your latest resume will be used to determine your qualifications.  Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment.  To apply for this position, you must provide a complete Application Package which includes: Your Resume (your latest resume will be used to determine your qualifications) If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application.  If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy.  For qualification determinations your resume must contain hours worked per week and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. Additional Required Documents (see Required Documents section below). Ensure all submitted documents contain your full name, address, phone number, and last four digits of your social security number. Read more Background checks and security clearance  Security clearancePublic Trust - Background Investigation"}