{"jobID": "2831343737", "jobLocation": "Chicago_IL", "jobTitle": "CMC Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.hcsc.com/careers/index.html", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " UnitedHealth Group, Aetna, Humana"}, "estimatedSalary": "68000", "jobDescription": "Job ID: JY-1025691 Description:Job Purpose: This position is responsible for providing analysis and problem solving to SDO using data analytics and related tools, data mining, its concepts, techniques and implementation, to meet business objectives, including strategic and immediate services goals; interacting with technology vendors, ITG and contact center management. Required Job Qualifications:Bachelor Degree and 3 years experience with business information analysis or information requirements gathering to include business intelligence tools, techniques and technology OR 7 years experience with business information analysis or information requirements gathering to include business intelligence tools, techniques and technology.Information reporting experience, including knowledge of information repository issues and concepts.Interaction design skills and detail oriented.Experience creating user experience deliverables, feature/functionality matrices, usage scenarios, site maps, flow diagrams and wireframes, metrics mockups, reports and interactive multi-dimensional analysis tool mockups;Experience translating business and user requirements into meaningful user experiences.Project management skills and experience meeting deadlines.Interpersonal and presentation skills.Clear concise verbal, written and communication skills.Analytical, conceptual and root cause analysis skills.Experience working on multiple projects, simultaneously both independently and as part of a team to accomplish goals.Result oriented.Experience solving complex problems.Experience utilizing database concepts and design.Experience with data mining, its concepts, techniques and implementation.Experience with data discovery with large and complex data assets from varied information sources.Experience with translating analytical data into business needs, and provide training and consulting services.Experience managing ad hoc projects, as well as define and deliver ongoing dashboards, reports & metrics to provide actionable insights to inform marketing strategy.Experience with Business Intelligence reporting and analysis applications.PC proficiency to include SQL, Word, Excel, and PowerPoint.Preferred Job Qualifications:Bachelor degree in Computer science, Economics, Mathematics, Statistics.Experience with Clarabridge and Tableau.Experience with Ciscos ICM and CVP.Experience using BI and Data Warehousing tools or BI requirements;Knowledge of relational database concepts, and the creation of queries and reports using SQL or reporting tools (i.e., Cognos). HCSC is committed to diversity in the workplace and to providing equal opportunity and affirmative action to employees and applicants. We are an Equal Opportunity Employment / Affirmative Action employer dedicated to workforce diversity and a drug-free and smoke-free workplace. Drug screening and background investigation are required, as allowed by law. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.  Requirements: Expertise Analytics & Reporting Job Type Full-Time Regular Location IL - Chicago, TX - RichardsonSDL2017"}