{"jobID": "2816525540", "jobLocation": "Crofton_MD", "jobTitle": "Registered Nurse - Behavioral Health Dept", "companyRating": null, "companyInfo": {"Website": "www.annapolispediatrics.com", "Headquarters": "Annapolis, MD", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SUMMARYFor over 70 years Annapolis Pediatrics has provided superior healthcare to the infants, children, adolescents, and young adults in the Annapolis area and surrounding communities. We commonly care for children of former patients and are proud of the outstanding level of continuity of care Annapolis Pediatrics provides. This position is based in our Crofton office.This position will support the needs of the Behavioral Health Department by acting as a liaison between the patient/families and the provider in addition to performing routine clinical responsibilities as needed. The position requires an interest in the field of behavioral health and the ability to work closely with the behavioral health providers to establish and follow guidelines pertaining to caring for the behavioral health patient population. The position will perform direct patient care such as obtaining vital signs, completing forms, and scoring screenings before and during patient visits. The RN is also responsible for educating patients and families regarding patient care needs and assists with coordination of care under the direction of the provider.Work ScheduleMust be available to work weekdays (M, T, Th, F) with some evenings. Position will be located primarily in the Crofton office.Experience and QualificationsLicensed Registered Nurse with CPR certification required.Minimum 1-2 years medical office or nursing experience. Pediatric experience required.Some basic knowledge on use of Electronic Medical Records.Demonstrate clinical expertise in pediatrics with superior nursing process skills including assessing, prioritizing, planning and evaluation utilizing critical thinking, problem solving, and teaching skills as well as consider caller safety factors effectively over the telephone.Ability to identify and apply planning, care and/or intervention techniques appropriate to the physical, motor, and sensory, cognitive and psychosocial characteristics of pediatric patient population.Ability to work independently, remotely, and as a team member.Excellent written, interpersonal and telephone communication skills.Adapts communication style to persons representing diverse personal, professional, cultural, and socio-economic backgrounds.Must be organized and the ability to set priorities.Must have a positive, enthusiastic, helpful personality.Interest in Behavioral Health and willingness to learn about specialty.Additional details of this position can be found on our website under Job Opportunities. Interested candidates may send cover letter and resume.Annapolis Pediatrics offers a comprehensive benefit package to include health benefits, paid time off, disability benefits and a retirement plan. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Annapolis Pediatrics is an Equal Opportunity Employer."}