{"jobID": "2823478454", "jobLocation": "Alexandria_VA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.apexsystems.com", "Headquarters": "Glen Allen, VA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " TEKsystems, Insight Global"}, "estimatedSalary": null, "jobDescription": " *Data Analyst Wanted in the Alexandria VA area!*  The incident analyst specifically, will analyze ITSM ticketing information and data to recognize and report trends in errors that are being experienced by the NSF User community. Communicate with Leadership, employees and contractors, as well as NSF customers; displaying strong customer service skills, using professionalism, tact and diplomacy always to perform tasks related to the role of Incident Analyst. The Incident Analyst needs to possess an in-depth understanding of the functions of a help desk system to properly analyze the levels of service provided to the customer daily. The Incident Analyst should be capable of medium to complex data analytics to take raw ticketing data and ascertain whether the staff are meeting Key Performance Indicators (KPIs) or not. Must also be able to dig deeper into KPIs that are not being met and tell the reasons, based on the data facts. This includes a focus on First Contact Resolution, P1 and P2 Severity. Candidate must be able to understand the current scope of services provided for desktop Support and helpdesk service to NSF to include custom business applications support.  The role will manage and mature our Incident Management process. They will manage the effort of tracking Incident KPIs, metrics, reporting, dashboards, and process data requests for the Incident Process. They will be responsible for process support activities such as creating work instructions, policy and procedures as well as researching issues that occur within the process. They will also support better tool instrumentation and functions with well-planned Incident tool enhancements. Finally, they will partner with other process teams to ensure cross process integration and a unified support experience. They will promote adoption of the Incident Management process across the organization, including multiple outside service providers. Although the primary focus is on internal operations, they may be asked to collaborate across organizational boundaries to optimize and ensure efficiency within the Incident Process. Proven working experience as a data analyst or business data analystStrong knowledge of and experience with reporting packages (OBIEE, and other reporting systems)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findings Qualifications  Bachelors and 6 years experience or High School Diploma and 12 years experience.  Required Skills Interpret data, analyze results using statistical techniques and provide ongoing reportsDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and interpret trends or patterns in complex data setsFilter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct code problemsWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesITIL Foundations Certified with in depth understanding of Incident Management and Service ManagementBusiness process design experience, MS Visio experienceExperience with service desk software in relation to ITIL processes2+ years helpdesk experience in an enterprise service desk environment including support for Microsoft, Windows and Apple systems; and custom business application support2+ years Data Analytics and analysisExpert proficiency in MS Excel, MS Word, MS PowerPoint,Excellent written and oral communication skills with the ability to train staff on materials3+ years of customer service experience Desired Skills  1+ years of Requirements Definition/Analysis  1+ years of Design Analysis  User Acceptance Testing"}