{"jobID": "2757323745", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist 2", "companyRating": "3.6", "companyInfo": {"Website": "www.hologic.com", "Headquarters": "Marlborough, MA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Company - Public (HOLX) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " GE Healthcare, Illumina, Boston Scientific"}, "estimatedSalary": "75000", "jobDescription": "To perform this job successfully a Customer Product Support Scientist 2 must be able to perform each essential duty successfully. The job requires investigation and resolution of customer complaints, planning and executing own experimental work and projects and overseeing others to accomplish project goals and execute CAPAs realized from investigational findings and/or customer feedback. Experience working in a GMP environment is a plus.Duties & Responsibilities:Works on problems to support customer satisfaction, product performance and improvement.Defines tasks and plans the work required to meet investigation deadlines as well as project milestones.Analyzes associated lines of investigation and devises and recommends methods to resolve problems.Works in cross-functional environment to plan tasks and address resource needsEnsures data, protocols and reports meet project objectivesMaintains project documentations in accordance with internal and external requirements.Authors technical reports, including GMP documents.May participate in external collaborations.May presents results and progress for management and key external customer review.May oversee junior level Product Support Associates.Qualifications:To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the basic knowledge, skills, and/or abilities required.Good knowledge of microbiology, molecular biology, biochemistry, chemistry or related disciplinesGood understanding of nucleic acid amplification and detection technologiesGood understanding of Scientific Method and statistical analysisAbility to plan and supervise execution of projects, keep to timelines and prioritize resourcesAbility to troubleshoot and solve technical issues across multiple assays and platformsAbility to analyze data and come to valid scientific conclusionsAbility to document technical work and lead investigations and improvements in a GMP environmentGood technical writing skills and ability to prepare and present data Ability to form work collaboratively with intra and interdepartmental teams.Working knowledge of FDA and ISO regulations that govern the Medical Device and Molecular Diagnostic IndustryEducation and Experience:BS and 6+ years related experience or MS and 4+ years or PhD and 0-2 years related experience in a scientific discipline or equivalent in engineeringAgency and Third Party Recruiter Notice:Agencies that submit a resume to Hologic must have a current executed Hologic Agency Agreement executed by a member of the Human Resource Department. In addition Agencies may only submit candidates to positions for which they have been invited to do so by a Hologic Recruiter. All resumes must be sent to the Hologic Recruiter under these terms or they will not be considered.Hologic, Inc. is proud to be an Equal Opportunity Employer inclusive of disability and veterans."}