{"jobID": "2802796145", "jobLocation": "Manhattan_Beach_CA", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.purviewinfotech.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Data Engineer  Location: Manhattan Beach, CA  Duration: Contract  Job Description  · 5+ years work experience.  · Demonstrated ability in data modeling, ETL development,  and data warehousing.  · A desire to work in a collaborative, intellectually  curious environment.  · Industry experience as a Data Engineer or  related specialty (e.g., Software Engineer, Business Intelligence Engineer,  Data Scientist, Business Analyst) with a track record of manipulating,  processing, and extracting value from large datasets.  · Experience with a data warehouse or data lake  technology (Oracle, Teradata, Netezza, Redshift, etc) and relevant data  modeling.  · Experience with Hadoop or other map/reduce  \"big data\" systems and services.  · Coding proficiency in at least one modern  programming language (e.g. Python, Java, JavaScript).  · Experience processing large amounts of data, in  various formats such as Parquet, ORC and processing data in batch mode, and  streaming mode.  · Experience processing files in various image,  audio and video media formats.  · Exposure and knowledge of Security, encryption  and Data Governance.  · Experience building/operating systems for data  extraction, ingestion, and processing of large data sets.  · Experience building data products incrementally  and integrating and managing datasets from multiple sources.  · Experience working on large-scale data  warehousing and analytics projects, including using AWS and Apache technologies  Redshift, S3, EC2, Data-pipeline, Spark and other big data technologies.  · Experience building flexible data APIs that  consumers use to power other parts of the business.  · Experience with scalable service architecture  and design.  · Experience with automation and deployment (e.g.  Terraform, Cloudformation).  · Knowledge and direct experience using business  intelligence reporting tools. (OBIEE, Business Objects, Cognos, Tableau,  MicroStrategy, SSAS Cubes, Datanet, etc.)  Keyskills - Must Have  · Oracle  · Netezza  · Teradata  · Java  · Python  · JavaScript  · Apache "}