{"jobID": "2748141980", "jobLocation": "Branchburg_NJ", "jobTitle": "Regulatory Scientist", "companyRating": null, "companyInfo": {"Website": "www.lilly.co.uk", "Headquarters": "Basingstoke, United Kingdom", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " It is an exciting time to join Lilly. Are you looking for a role in Global Regulatory where you can impact the submission of early phase through late phase molecule submissions? This exciting opportunity is for someone with regulatory submission experience to make a real impact on human health. You will have the chance to grow and learn while working with exceptional scientists. We are looking for a Regulatory Scientist to join our team. Your role would be to develop and execute global regulatory CMC submission plans for assigned biologic development projects and/or marketed products. You will partner with appropriate Regulatory CMC management and scientists. This includes planning, review, coordination of all aspects of submissions including elements such as IMPDs, CTAs, INDs, and BLAs.  In this role you are responsible for preparing accurate, clear and concise regulatory documents; and for dedicatedly providing knowledgeable input to interdisciplinary project teams and appropriate management level. You assess current/emerging regulations, guidance documents and corporate/industry standards for impact to the business area. You collaborate effectively with partners across project teams, third party vendors and/or development partners to ensure effective project communication and coordination for submission assignments and special projects. Some primary responsibilities could include:Represent Regulatory CMC on interdisciplinary teams and technical project teams to outline submission requirements, negotiate timelines for delivery of regulatory CMC submissions.Collaborate with multi-disciplinary teams, prepare the CMC section of INDs, BLAs, CTAs, CTDs, amendments, supplements and annual reports, including the compilation and review of the required data, scientific reports, and written submission contributions.Lead cross functional Health Authority response teams for assigned development projects to set objectives for HA meetings, lead interactions and oversee preparation of HA responses.Drive quality control of business function components within assigned role to meet timelines and to provide quality deliverables.Review and assess the regulatory impact of change controls/requests for the manufacture, testing and release of development and marketed products in collaboration with internal departments (Research, Manufacturing and Product Development and QA/QC) and external business partners.Provide regulatory guidance to ensure development activities are aligned with relevant health authority regulations and in line with current global guidance.Assist in preparation of risk analyses and contingency plans for CMC regulatory strategies and dossiers.Guide manufacturing in developing data for approval of post-marketing changes.Understand and apply regulatory CMC requirements, FDA, EMEA, ICH guidelines and relevant government regulations (21 CFR, EU Directive)."}