{"jobID": "2722000464", "jobLocation": "Irving_TX", "jobTitle": "Data Scientist / Analytic Consultant 4", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": "Job DescriptionAt Wells Fargo, we have one goal: to satisfy our customers financial needs and help them achieve their dreams. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Wells Fargos Chief Administrative Office (CAO) consists of enterprise functions that work together to promote and protect the Wells Fargo culture and brand, and support our team members. Groups within CAO work to protect our reputation, tell our story, bolster team member engagement, connect with our customers, and bring new and innovative solutions to life. CAO functions include Commitment to Customer, Corporate Responsibility & Community Relations, Data Management & Insights, Human Resources, Marketing, and Stakeholder Relations.  The Enterprise Analytics and Data Science team is looking for a new team member with natural analytic curiosity, who takes the initiative to offer ideas and add value with limited direction. This role will be responsible for performing text analysis and advanced analytics supporting LOBs across the enterprise. This includes using machine learning techniques and programming languages to derive relevant analysis and metrics, including building proof of concepts to determine value of implementing in future projects. Key Responsibilities Include: As part of a team focused on understanding the customer experience across the organization, the analyst will work within the team to follow and develop the analysis according to our analytic process: Define/understand business objectivesIdentify/assess data sourcesBuild text analytic and machine learning modelsData visualizationCommunicating the results In addition to a demonstrated ability using programming languages to perform text analysis, the ideal candidate should be able to think outside the box to uncover new ways to analyze unstructured data in conjunction with analytical tools to answer complicated business questions. Data Management and Insights (DMI) , which offers Chief Data Office capabilities to Wells Fargo, focuses on leveraging data as a strategic asset. Data is critical to Wells Fargos continued success, deepening relationships with our customers, creating a seamless and convenient multi-channel experience, and meeting our commitment to satisfy our customers financial needs. DMI defines how we use information across the company, align our business practices and support our continued focus on great customer experience.Required Qualifications6+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 4+ years of experience in one or a combination of the following: reporting, analytics, or modeling2+ years of Python experience2+ years of SQL experience2 + years of experience using quantitative machine learning techniques2+ years of Natural Language Processing (NLP) experienceDesired QualificationsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skills2+ years of statistical modeling experienceExtensive statistical modeling, analysis, optimization and segmentation experienceExperience with Tensorflow, Theano or KerasExperience with design, implementation and governance with Artificial Intelligence, Natural Language Processing or Machine Learning ArchitectureOther Desired QualificationsStrong ability to retrieve, combine and transform data from numerous information systemsExperience working with big data infrastructure with tools such as Hive, Spark and h2oAbility to think creatively to find innovative solutions to complex analytical questionsReading, understanding and implementing algorithms and other techniques from academic paperProven ability to take initiatives and drive each project to completion with minimal guidance while effectively managing multiple projects at a timeAbility to translate and summarize complex analysis into understandable, actionable insights and recommendations that directly drive effective business strategy1+ years experience operationalizing ML or NLP solutions Text Analytics:2 + years of text analytics experienceExperience using GitHub for version control and collaborationKnowledge and/or experience with the following:Implementing solutions with common NLP frameworks and libraries in Python (NLTK, spaCy, gensim) or Java (Stanford CoreNLP, NLP4J)Common NLP techniques, such as Pre-processing (tokenization, part-of-speech tagging, parsing, stemming)Semantic analysis (named entity recognition, sentiment analysis)Modeling and word representations (TF-IDF, LSA, LDA, word2vec) Data engineering skills (deploying analytical solutions across an organization in a production format) Serving as an in-house expert on NLP and speech analytics, teaching others advanced techniques and using state-of-the-art methods Experience with design, implementation and governance with Artificial Intelligence, Natural LanguageDisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}