{"jobID": "2688851308", "jobLocation": "Washington_DC", "jobTitle": "High School Science Teacher", "companyRating": "4.4", "companyInfo": {"Website": "www.elhaynes.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Start Date: July 2018AboutE.L. Haynes Public Charter School was founded in 2004 and has an award-winning program based on effective practices for advancing student achievement. E.L. Haynes is among the top-performing charter schools in Washington D.C., and is recognized locally and nationally as a model and for our exceptional student achievement gains. E.L. Haynes currently serves 1,200 students in grades Pre-Kindergarten through 12th grade.Our Mission Every E.L. Haynes student of every race, socioeconomic status, ability level, and home language will reach high levels of academic achievement and be prepared to succeed at the college of his or her choice. Every E.L. Haynes student will be adept at mathematical reasoning, will use scientific methods effectively to frame and solve problems, and will develop the lifelong skills needed to be successful individuals, active community members, and responsible citizens.Teacher ResponsibilitiesPlan and deliver exceptional instruction aligned to E. L. Haynes' rigorous academic standards, assessments, student assessment data, and E. L. Haynes curriculum framework.Conduct and organize on-going assessments of student performance using multiple assessment tools including standardized tests, performance assessments, anecdotal records, homework and individualized assessments as appropriate.Collaborate and co-teach with Inclusion and ELL teachers and Teaching Associates (when applicable).Create a classroom culture and environment that demonstrates the E. L. Haynes Promise by consistently modeling the promise, practicing Responsive Classroom techniques, displaying recent high-quality student work, and maintaining a classroom that is designed and organized for maximal student learning.Integrate developmentally appropriate, culturally competent, research based strategies into teaching and assessment practices.Integrate the use of complex, engaging, standards based problems into teaching practice.Create and assess standards based intellectual and relational connections across difference.Integrate STEM enhanced theme into teaching and assessment practice.Engage parents and families in their students' academic success.Be an active member of the E. L. Haynes Professional Learning Community.Contribute to the productivity of the school as a whole.Attend and participate in school events outside of regular school hours.Lead student Advisory groupOther duties as assignedScience Teacher ResponsibilitiesIncorporate problem solving strategies and literacy strategies into daily instructional routine.Present human history as a connected, human story composed of many multiple stories.Use primary sources to help students understand the past by connecting specific subject matter to larger historical patterns.Remediate skill deficits without compromising the curricular program.Differentiate formative assessments (independent practice, homework, exit tickets, etc.)Set, monitor, and meet class-wide achievement goals.Monitor progress towards school wide achievement goals.Create student growth plans based on student performance data.QualificationsThe ideal candidate will have two or more years of teaching experience in an urban setting and will be highly qualified and possess the following knowledge and skills: Content and teaching expertise in Science and skilled in the use of document based questions to assess student learning. Proven ability to teach rigorous college ready texts to diverse populations.Clear understanding of standards based curriculum, standards based assessment, and differentiated instruction.Proven ability to use models and exemplars to drive instruction.Proven ability to work as a member of a team.Commitment to meeting the needs of every child in a diverse population.Commitment to his/her own learning and professional development.Strong collaborative capabilities.Proven ability to align instruction to high quality, rigorous, relevant assessments.  Spanish speakers and persons of color are strongly encouraged to applySalary & Benefits We offer a competitive salary depending on experience and qualifications. Our benefits package includes medical, dental, vision, life & disability and flexible spending accounts. E.L. Haynes is an equal-opportunity employer and it is our policy to recruit, hire, and promote for all jobs on the basis of merit, qualifications, skills and competence. We do not discriminate on the basis of race, color, national origin, marital status, religion, sex, age, sexual orientation, disability, or any other protected status. E.L. Haynes will fully comply with all employment-related and other laws. All employment decisions will be made solely on the basis of the individual's qualifications as related to the requirement of the position being filled.To ApplyPlease visit the Join Our Team page on the E.L. Haynes website; https://www.elhaynes.org/apply-for-a-job to submit an application. You may upload your resume and other relevant documents."}