{"jobID": "2813937854", "jobLocation": "San_Antonio_TX", "jobTitle": "Information Security Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.capitalgroup.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1931", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "Req ID: 16145 Experience Level: Professional Other Location(s): N/A Come grow with us At Capital Group, how we work is defined by shared values that include absolute integrity, respect and collaboration. But it’s more than that. It’s smart and highly driven people united in purpose to serve our investors and one another.  Bring your energy and unique perspective to Capital and you’ll have the opportunity to grow with us professionally, personally, and financially. You’ll be part of a team that genuinely cares about helping you succeed. You’ll work alongside talented colleagues, many of whom build long careers while progressing through multiple roles, establishing lifelong friendships and making a difference in our communities. In return for your contributions, you’ll receive premier compensation and benefits, and a company-funded retirement plan that ranks among the most generous.As an Information Security Data Scientist, you will use machine learning and other data science techniques to assist in protecting Capital Group’s assets by detecting potential cyber threats. You will do this by leveraging supervised and unsupervised machine learning, anomaly detection, behavioral modeling, NLP, data visualization and descriptive analytics. You will work alongside the rest of Capital Group’s cybersecurity team: the Capital Group Security Intelligence Response Team (SIRT), in their purpose built facility in San Antonio, TX.The SIRT objective is to preempt, detect and respond to cybersecurity threats through the use of actionable intelligence gained from our internal and external environments.Responsibilities:Develop and then communicate an understanding of expected and anomalous behaviors across diverse entities and events throughout Capital Groups environment.Identify proactively behavior and trends that could be indicative of risk then seek to develop models to understand and detect risk patterns.Facilitate in the development of data science processes as the team expands.Leverage existing algorithms to identify trends buried in big data.Assist as an end user in the progress toward a next generation data science platform for CG.Use real-time and historical data to solve real-world cyber security problems.Select and incorporate appropriate data mining and analysis techniques to solve specific problems.Maintain cutting edge knowledge of data science techniques and practices.Communicate trends, metrics and actionable recommendations in verbal briefs, dashboards and reports to a wide ranging IT and business audience.Qualifications:3 years’ experience in data science or machine learning.Proven track record or demonstrable agility in providing value, gained through data science, to a large organization using complex datasets.Experience in predictive modeling, machine learning, or data mining.Experience wrangling unstructured data.Excellent analytical skills.Experience in the following: SQL; R or Python; Tableau, Qlikview, D3, or Splunk.Bachelors or Master’s Degree in Mathematics, Computer Science, Economics, or related fields.Experience working with TB size data a plus.Familiarity with event logs a plus.Experience with Splunk, Spark, Cloudera Hadoop Distribution, Kafka, Scala, and/or Tableau a plus.Company Overview: Founded in 1931, Capital Group is one of the world’s largest and most trusted investment management companies and home to the American Funds. We manage more than US$1.39 trillion in assets, and our 7,500 associates make our clients their first priority every day. When we do our job right, millions of investors around the world fulfill their dreams and financial goals, from home ownership and higher education, to a comfortable retirement. Our long-term investment results and outstanding service set us apart from our competitors, while our workplace sets us apart from other employers.We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law."}