{"jobID": "1900994289", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist, Machine Learning", "companyRating": "3.8", "companyInfo": {"Website": "www.zestfinance.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": " As a Data Scientist at ZestFinance, you will develop radically new methods for manipulation and prediction that will enable us to provide fair, transparent credit. Using a combination of machine learning technology and vast amounts of data sources, we seek to transform the credit market while expanding our team into interesting and revolutionary frontiers within the credit world. In this role you will:Translate unstructured business problems into well-defined machine learning projectsCollaborate with a cross-functional team of Engineers, Product Managers, and Business Analysts to identify and manage high leverage opportunities for modeling workDesign and implement highly generalizable models for predicting various outcomesTake responsibility for modeling implementation in real world settings to solve real world problemsMentor junior team members in modeling artistryWe are looking for:Bachelor’s Degree in a quantitative discipline; advanced degrees preferredExpert experience designing, developing, and implementing machine learning models/algorithmsSuccessful Kaggle competition experience is encouragedExtensive programming experience in R or Python and an interest in learning new languages and technologiesKnowledge of data structures and parallelizationPerks and benefits:People – the best part of ZestRobust healthcare plans, matching 401K and unlimited vacation timeDog friendly office with lounge areas, video games and gigantic jigsaw puzzlesOn-site gym with yoga, salsa and other employee run fitness classesGenerous family leave policy (6 month maternity leave/3 month paternity leave)Tuition reimbursement, conference allowance and Zest talksComplimentary massages, manicures, pedicures and moreDaily catered lunches from LA’s best restaurants and fully stocked kitchenAbout ZestFinance: ZestFinance, Inc. applies its unique credit-decisioning technology platform — based on data science and machine learning — to help lenders effectively predict credit risk so they can increase revenues, reduce risk and ensure compliance. ZestFinance was founded in 2009 by Douglas Merrill and a team of former Google employees with the mission of making fair and transparent credit available to everyone.  We are committed to diversity in hiring, professional development, and everyday discussion. Zest is determined to hire crazy smart people who are different from each other to create broad thinking, lots of different ideas, and by extension, the best team possible."}