{"jobID": "2705351416", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Integration Architect", "companyRating": "4.4", "companyInfo": {"Website": "www.demandbase.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Engagio, Marketo, Evergage"}, "estimatedSalary": "123000", "jobDescription": " What do industry leaders like Adobe, American Express, Box, Salesforce.com and SAP have in common? They all use Demandbase solutions to power their business-to-business (B2B) marketing!  Demandbase, a leading SaaS-based B2B marketing technology, is looking for more inspired and driven people to join us. With a roster of loyal, blue-chip customers thats growing every day, were in a phase of pre-IPO growth and building the team that will take us to the next level. If you thrive on innovation and working with the best in industry, youre probably a good fit for us.  Integration with third-party infrastructure such as Salesforce, Microsoft Dynamics, SAP CRM, Marketo, Pardot is increasingly at the core of all of our products. We are looking for a hands on developer to contribute to the design and implementation our integration efforts. What youll be doingDesign and develop robust, scalable, well tested applications (and APIs) for internal and external customersDesign and build reusable REST APIs and integrate with third-party cloud platformsWork as a member of an Agile team to deliver on business requirementsWork closely with DevOps to deploy, secure, and support the applications in productionMentor, train, and grow junior engineers through collaboration and pair programming as neededWhat were looking for5+ years of experience as a software engineer building large scale systemsBS/MS in Computer Science or related disciplineExperience integrating CRMs such as Salesforce, Pardot and/or Marketo etcExperience working with a RESTful back end architecture in Scala, Java or other JVM languagesOther nice to havesExperience building big data and stream processing infrastructureExperience with technologies such as Spark, Kinesis, RDS, Redshift, ElasticCache, etcLeadership of small teams of developers (note, this is an individual contributor role for now)Why you want to join us?Recent $65M funding round to extend our ABM leadership position and fast-track innovation behind AI-powered Account-Based Marketing solutionsDrive the next generation of intelligent CRM technologies and invent how Artificial Intelligence, product design, and applications convergeWork with a world class team of engineers, PMs, data scientists, sales and marketers. We believe in an integrated closed loop team with direct feedback from customers to engineers/data scientists.We manage one of the largest Business-2-Business datasets in the world.Have the flexibility of a start up with the security of a publicly-traded organizationAbout Demandbase: The Demandbase ABM Platform is the only comprehensive set of ABM solutions, Artificial Intelligence and patented technology purpose built for the account-based needs of B2B. This allows B2B companies to execute their marketing and sales efforts across the funnel to identify, attract, engage, and convert their target accounts and then measure the results. You can scale and grow your efforts with the leading ABM vendor instead of trying to patch everything together with multiple point solutions. The Demandbase ABM Platform allows customers to define their ABM strategies and initiatives and then take action from a single platform. It leverages unique B2B data sets, Artificial Intelligence and IP targeting technology, Real-Time Intent as well as ingesting our customers first party and CRM data in order to provide insights and initiate account activities. Enterprise leaders and high-growth companies such as Accenture, Adobe, DocuSign, GE, Grainger, Salesforce and others use Demandbase to drive their ABM strategy and maximize their marketing performance. Demandbase was named a Best Place to Work by SF Business times in 2015, 2016, and 2017 and Glassdoors Top 10 Best Places to Work in 2016. For more information, please visit https://www.demandbase.com or follow the company on Twitter @Demandbase. Benefits: Our benefits include 100% paid for Medical, Dental and Vision for you and your entire family, short-term/long-term disability, life insurance, flexible vacation policy, 401k, commuter benefits, free snacks, catered lunch every Friday, Pinot Noir Fridays, chair massages, weekly yoga and much more!"}