{"jobID": "2829540134", "jobLocation": "Monterey_Park_CA", "jobTitle": "Data Migration Analyst", "companyRating": null, "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Migration Analyst - Monterey Park, CA - 9+ month contract  Please Note: At this time we can only consider candidates that are able to work on out W2. If you require to work on a C2C basis, please do not apply  Rate: $30-37/hr. Summary: Design, configuration, data migration during the implementation of the Central Policy Portal; partner with technology group and testing group as well as end users to perform SIT and UAT Applies business and technical knowledge in determining end-to-end design requirements for projects involving line of business.  Works closely with business partners to determine requirements and develop functional designs based on the analysis of line of business needs, objectives and existing systems infrastructure.  Drives and participates in design, development and implementation of applications, often using new technologies.  Works closely with developers and testers to ensure requirements and functional designs are translated accurately into working technical designs and that test plans/scripts serve customer needs.  Perform tests and work on remediation of issues.  Preferred skills: An understanding of project management processes, understand basic components of a technology platform.  Example would be understand Meta Data, differentiate options in the system.  Someone who has done a detailed functional design, mapping of existing policy docs into a mapping tool to perform a large match upload into platform.  Great communication skills needed (oral, written), roles not expected to do coding but may require some system configurations."}