{"jobID": "2722798246", "jobLocation": "Branchburg_NJ", "jobTitle": "Environmental Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.vertexeng.com", "Headquarters": "Weymouth, MA", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " The Vertex Companies, Inc. is regarded as one of the premier engineering, construction, environmental and IT companies serving many top insurance companies, real estate owners, contractors, banks, real estate investors and attorneys across the country. VERTEX has 25 offices worldwide and a dedicated staff of over 450 engineers, architects, environmental, and construction professionals. VERTEX offers comprehensive solutions for construction and environmental exposures. With 55,000 projects completed since inception, our experience speaks for itself.  In late 2013, VERTEX implemented an Employee Stock Ownership Program (ESOP). VERTEX’s employee-owners help our clients identify and mitigate risks to a project’s physical, environmental and economic well-being; it drives every decision we make. We offer highly personalized and customized service to address highly specialized challenges. By applying technical and scientific skills to our clients’ real business challenges, VERTEX creates integrated solutions that minimize risks while achieving the required results.  For more information about VERTEX visit us here http://vertexeng.com/.  VERTEX is looking for a dynamic, energetic Environmental Scientist who welcomes challenge to join the VERTEX team in our Branchburg, NJ office. The individual we are looking for will enjoy the challenge of working on multiple projects on a fast-paced schedule, working with senior staff to assess sites across the country, and providing field oversight on a variety of projects. More specific details are described below. Environmental ScientistCore ResponsibilitiesConduct Phase I Environmental Site AssessmentsConduct/Direct field investigation activitiesCollect soil, groundwater, and indoor air samplesAnalyze laboratory and engineering dataWrite regulatory and summary reports for senior reviewRepresent VERTEX to the client in a professional mannerSchedule and coordinate subcontractor activities for projectsPrepare and implement Health and Safety Plans for sites where requiredMake employee safety a priority both in-house and on-site, in accordance with corporate policyPosition RequirementsExperience in the execution of Phase I Environmental Site Assessments, Phase II Subsurface Investigations, and remediationFrequent travel and/or field work (valid driver’s license and reliable vehicle required)Able to communicate effectively (written and verbal) with co-workers, clients and subcontractorsAble to work with minimal oversight, but take direction from Senior managersAble to meet deadlines, both internally and externallyOther project duties as assigned by senior staffExperience with Property Condition Assessments (PCAs) is a plus!QualificationsExperienceMinimum of one to three years’ experience in technical activities directly related to Environmental Assessment activities, including report writing and field investigationKnowledge & SkillsMust be able to perform complex tasks and handle multiple priorities, and have the ability to perform exceptionally under high stress conditionsKnowledge of computer operations and standard software packages (word processing, spreadsheets, Adobe) requiredProficiency or working knowledge of CAD a plusEducationBachelor’s degree in Environmental Engineering, Geology, Environmental Science, or related environmental fieldSpecialPosition requires Health & Safety Certification pursuant to OSHA 29 CFR 1910.120 (HAZWOPER 40 Hour) (Training provided if necessary)Position requires OSHA 10 (Training provided if necessary)Physical RequirementsWalk job sites during inspections, sometimes on uneven terrainCarry field testing equipment (up to 30 pounds) onto job sites with regularity The Vertex Companies, Inc. is an equal opportunity employer committed to workforce diversity. M/F/D/V. 11"}