{"jobID": "2776749120", "jobLocation": "Sacramento_CA", "jobTitle": "Sr. Data Engineer - Galaxy of Heroes", "companyRating": "3.9", "companyInfo": {"Website": "www.ea.com", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Company - Public (EA) ", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Riot Games, Google, Activision Blizzard"}, "estimatedSalary": "140000", "jobDescription": " Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones, and tablets.  At Electronic Arts we put our players first, and were looking for the most talented and creative game developers in the world to help us become the worlds #1 mobile gaming company. Mobile is the future of our industry and the future of our company. Our mobile team is growing fast, with 17 exciting studios around the world and a portfolio of blockbuster titles like FIFA, The Simpsons: Tapped Out, Madden, Real Racing, Plants vs. Zombies, the Sims and Star Wars: Galaxy of Heroes.  Creativity, Collaboration, and Communication are what makes us tick as we prepare ourselves for massive amounts of growth and an incredible amount of fun. We want to engage our players and create the most entertaining mobile titles in the world. Come and see for yourself, the future is here.  Were pushing the boundaries on every front, so youll get a chance to stretch beyond your comfort zone and have the ability to learn while you contribute. Our team culture is collaborative and high-performance, and we expect everyone to think like game makers and approach development with a Player First perspective.  Responsibilities: Serve as technical lead and partner with members of the Analytics TeamParticipates in design and development of Analytics solutionsWorks with other architects, developers and data analysts to review requirements for optimal performanceParticipates in on-going evolution, improvement, and automation of Analytics solutionsProvides on-going support of data warehouses and marts perform tuning, add new data and maintain hierarchiesParticipates in testing of all data warehouse changesDevelop and maintain technical vision and roadmaps based on the key performance indicators (KPIs)Lead the development of capabilities in all facets from strategic to tactical implementation and from conception to post-deploymentEnsure smooth ongoing operations of data platform with high availability while making continuous improvementsHelp key users across the entire organization to understand and consume the data sets and platform for enhanced decision making and analyticsAdvance the data architecture and platform and ensure adherence to key architectural tenets and best practicesDesign and implement relational and dimensional models Must have skills: Working experience with Amazon Web Services(S3, EC2, RedShift, Data Pipeline and EMR)Extensive experience and understanding of SQLExperienced in Redshift schema design, performance optimization, capacity planningExperienced in monitoring and optimizing system performance Skew, Distribution, Sort Keys, Query plans and work loadNeeds to have experience with various data structures, information management concepts in order to determine the appropriate implementation of the solution.Hands on experience with Redshift Copy commands, data types, backup recovery etc.Experienced in ensuring best practices are set up and followed. Good to have skills: Hands on Big Data/Hadoop/EMR/ETL/ Spark.Working experience in Linux bash/shell/python scripting and automationGood communication skills and hands-on working knowledge of Big Data #LI-TS1"}