{"jobID": "2545851829", "jobLocation": "Seaside_CA", "jobTitle": "Metrics & Data Analytics Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Clearance Level Must Currently Possess: No Active Clearance Required Clearance Level Must Be Able to Obtain: No Active Clearance Required Suitability: No Suitability Required Job Family: Information Technology Job Description: As a Metrics & Data Analytics Anaylst you will develops, inspects, mines, transforms, and models data to raise productivity, improve decision making, and gain competitive advantage. Conducts statistical analysis on data and information to ensure correct predictive forecasting or classification. Manages all aspects of end-to-end data processing utilizing customized report building functions of systems. Maintains analytical systems, verifies the accuracy of the data, and acts as liaison with business.  The major objective of this role is work to discover, report upon, and correct data quality issues throughout DEERS production databases, that may have a negative impact to patient registry data, identity (duplicated or overlaid identity) and the data stream. The overarching goal is to continually improve the general state of data quality, specifically patient data, identity management AND the organization’s visibility into its current state of data quality.  As the first order of business after starting, you will work with Data Quality Lead, senior EandB/DMDC staff, and other EandB Data Quality Team analysts to rapidly learn the business rules, business processes, and technical architecture of DEERS and DMDC, DEERS internal/external customers, upstream/downstream customers, as well as the processes employed by the EandB Data Quality Team in their daily work. Broadly understanding the business and technical details of the organization is absolutely critical for a data quality analyst to have a meaningful impact. Due to the complexity of DEERS and the nature of the team’s work, this learning is a continual process.  The team always has more work on its plate than there is time for and new issues frequently arise that pre-empt current work. As such, multi-tasking and prioritizing are absolutely vital skills. A successful candidate must be an excellent multi-tasker and must prioritize work based on the real world impact of each issue at hand.  Work on a fast-paced team responsible for monitoring and maintaining Data Quality within very large Oracle production databases. Find, investigate, and map out strategies to correct data quality issues that impact any of numerous DEERS business areas, particularly military healthcare benefits & eligibility and duplicate identities resolution.Research, design and implement remediation plans to reduce duplicated identities in the system. Work includes both responding to urgent data quality issues as they arise as well as proactive analysis to discover and research previously unknown problem areas.Use SQL and PL/SQL to investigate data quality issues and continue to expand the team’s suite of recurring and ad-hoc error reports to assess the state of data quality in DEERS and monitor these reports for anomalies pointing to new issues to examine.Work closely with other data quality team analysts, management, project managers, business analysts, developers, quality assurance and DBAs, internal and external customers, upstream and downstream customers to determine root causes for data quality issues or data/identity discrepancy between DMDC and upstream/downstream master data index, or discrepancy between various internal data schemas. Devise remediation plans that both prevent future occurrences and restore data that has already been affected.Position demands active, continuous collaboration and learning about the business rules underlying the many lines of business, as well as the variety of data stores, data sources, applications and tiers that make up the DEERS architecture. Candidate must be willing to constantly seek out this knowledge from other senior staff in the course of day to day work.Candidate must be a self-driven individual who can work on many concurrent projects and deliver results on each, whether working independently or collaborating with other members of the team. Role has potential for advancement for high-achieving individuals. As a Metrics & Data Analytics Anaylst you will develops, inspects, mines, transforms, and models data to raise productivity, improve decision making, and gain competitive advantage. Conducts statistical analysis on data and information to ensure correct predictive forecasting or classification. Manages all aspects of end-to-end data processing utilizing customized report building functions of systems. Maintains analytical systems, verifies the accuracy of the data, and acts as liaison with business.  The major objective of this role is work to discover, report upon, and correct data quality issues throughout DEERS production databases, that may have a negative impact to patient registry data, identity (duplicated or overlaid identity) and the data stream. The overarching goal is to continually improve the general state of data quality, specifically patient data, identity management AND the organization’s visibility into its current state of data quality.  As the first order of business after starting, you will work with Data Quality Lead, senior EandB/DMDC staff, and other EandB Data Quality Team analysts to rapidly learn the business rules, business processes, and technical architecture of DEERS and DMDC, DEERS internal/external customers, upstream/downstream customers, as well as the processes employed by the EandB Data Quality Team in their daily work. Broadly understanding the business and technical details of the organization is absolutely critical for a data quality analyst to have a meaningful impact. Due to the complexity of DEERS and the nature of the team’s work, this learning is a continual process.  The team always has more work on its plate than there is time for and new issues frequently arise that pre-empt current work. As such, multi-tasking and prioritizing are absolutely vital skills. A successful candidate must be an excellent multi-tasker and must prioritize work based on the real world impact of each issue at hand.  Work on a fast-paced team responsible for monitoring and maintaining Data Quality within very large Oracle production databases. Find, investigate, and map out strategies to correct data quality issues that impact any of numerous DEERS business areas, particularly military healthcare benefits & eligibility and duplicate identities resolution.Research, design and implement remediation plans to reduce duplicated identities in the system. Work includes both responding to urgent data quality issues as they arise as well as proactive analysis to discover and research previously unknown problem areas.Use SQL and PL/SQL to investigate data quality issues and continue to expand the team’s suite of recurring and ad-hoc error reports to assess the state of data quality in DEERS and monitor these reports for anomalies pointing to new issues to examine.Work closely with other data quality team analysts, management, project managers, business analysts, developers, quality assurance and DBAs, internal and external customers, upstream and downstream customers to determine root causes for data quality issues or data/identity discrepancy between DMDC and upstream/downstream master data index, or discrepancy between various internal data schemas. Devise remediation plans that both prevent future occurrences and restore data that has already been affected.Position demands active, continuous collaboration and learning about the business rules underlying the many lines of business, as well as the variety of data stores, data sources, applications and tiers that make up the DEERS architecture. Candidate must be willing to constantly seek out this knowledge from other senior staff in the course of day to day work.Candidate must be a self-driven individual who can work on many concurrent projects and deliver results on each, whether working independently or collaborating with other members of the team. Role has potential for advancement for high-achieving individuals. Desired: Skills Excellent problem solving and analysis abilityStrong verbal and written communicationProficient in gathering information, organizing and documenting complex business conceptsProficient at using Microsoft product suite (Words, Excel, Access, OneNote, etc.)OracleBackground in StatisticsData quality experience and familiarity with commercial data quality softwareExperience with Informatica or IBM Infosphere data quality toolsFamiliarity with IBM Initiate, Workbench and/or Identity ManagementKnowledgeable of or experience with data warehouse, graphical presentation of large dataset# of Openings:0Scheduled Weekly Hours:40Telecommuting Options: Telecommuting Not Allowed Work Location: USA CA Seaside - 400 Gigling Rd (CAC001) Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}