{"jobID": "2824005841", "jobLocation": "Troy_MI", "jobTitle": "Associate Account Rep", "companyRating": null, "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": null, "jobDescription": " Discover the new Micro Focus now the worlds 7th largest pure-play software company. By combining HPE Software and Micro Focus offerings, we have built a brand new company with a stronger, bigger portfolio that delivers customer-centered innovation. We are now uniquely positioned to help enterprise customers solve their most pressing business problems and operate in the Hybrid environmentfrom mainframe to mobile to cloud.  Our portfolio spans the following areas: DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, & Analytics Take charge of your future and join our dynamic Sales team as we go to market with a best-in-class portfolio that will help shape the worlds software landscape. #discoverthenew About the Role The Associate Account Representative (AAR) is an entry level position in the sales organization, with the goal of providing support to the sales team while developing company knowledge, sales skills, and an understanding of the sales process and business systems. The individual must demonstrate the aptitude, motivation, and desire to advance as a sales professional.  The Associate Account Representative will learn to work as a sales professional through the guidance and mentorship of other Sales team members. The AAR will develop a working knowledge of sales concepts, company policies and work procedures to assist with sales opportunities and manage routine customer issues.  The AAR individuals will be assigned to a Field Sales Managers team, which is made up of individual Account Executives who cover a Territory made up of Named Accounts and works under specific direction of a Field Sales Manager on tasks and assignments to improve the outcome of the efforts of the Account Executives, with the ultimate goal of driving additional License Revenue.  Over time, the AAR will take on some direct sales responsibilities as they prepare for transition into a direct selling role. The Associate Account Representative willProvide Sales Managers and Account Executives with support to achieve sales targetsConduct Call Campaigns to customers and prospects for specific sales initiativesGenerate and qualify potential leads to be worked on with the Field Sales teamProactively review account activities in pursuit of new business or up-selling opportunitiesAssist with CRM data management and QuotingManage RFP responses and build customer proposalsAssist in planning client events and meetingsCoordinate contract proposals, extensions, and amendments creation and processing with LegalCoordinate resolution of credits, approvals, and billing issues with FinanceOrchestrates the resources and sponsorship essential for executing business effectivelyInteracts with contacts and information of a sensitive, complex, and sometimes confidential nature both inside and outside of the company, requiring exceptional judgment and discretion.Education and ExperienceBachelors degree or equivalent experience required.Some experience in administration and business support; some sales experience preferred (0-3 years).Skills and KnowledgeAbility to multi-task, priorities, organize and work within tight timelinesGood knowledge of Microsoft Office (Word, Excel and PowerPoint)IT and internet savvyKnowledge of general office practice and business etiquetteCustomer focus, with experience in a professional sales environment preferredGood judgment, able to handle confidential informationExcellent communication and interpersonal skills, presentation skills are helpfulUnderstands how to work in a professional environmentConducts in a manner that ensures team successSelf-motivated and goal oriented, with desire to improve skills consistently If you want to be part of what's next and find out more about our available opportunities, visit Micro Focus Careers."}