{"jobID": "2537751039", "jobLocation": "Irving_TX", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.vastika.com", "Headquarters": "Irving, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Current Openings  Data Analyst Published Date: March 4, 2014 - March 31, 2014 Vastika, Inc. seeks Data Analyst in Irving, Texas (and other U.S. locations, as needed).  Work on various projects related to application design and development. Design UML diagrams (Use Case Diagrams, and Activity diagrams, Business/work Flow Diagrams, Sequence diagrams) using MS Visio and Rational Rose. Capture business requirements using Rational Requisite Pro, MS word and MS Excel and organize meetings with all levels of stakeholders. Develop Business Requirement Documents, Functional Requirement Documents, and System Requirements Documents. Track System Requirement Document (SRD), Test Specification Documents (TSD) and Change Request Documents (CRD). Create Test Approach documents and execute Test Procedures, Test Cases, Test Plans, Functional Testing and User Acceptance Testing. Responsible for quality reporting, analysis and audits and for developing plans and programs to support continuous quality improvement using RSA (Requirement and Solution Analysis) Agile Inspection.  Requires a Bachelors degree in Computer Science, Engineering, Business Administration, or a related field, plus one year of experience. Requires experience as a programmer in Business Analysis, Data Analysis, Quality Center, ALM, Visio, Project Management Softwares, Erwin, Data Modeling, RUP, Agile, Database Programming and Sharepoint. Requires knowledge of web technologies. Requires willingness to travel within the U.S., as necessary. Required duties and responsibilities:Source to target mapping and Writing sql queriesDevelop business rule that support on transformation of dataAssist in development plans within the organizationSupport the verification of data accuracyAssist in ETL development, documentation and testing.Perform analysis of all data into, out of and within CareSource as needed.Identify and quantify data issues within the organization and assist in the development plans to resolve data issues.Develop, document and perform testing and validation as needed.Assist in ETL development, documentation and testing as needed.Work with SMEs to develop business rules that support the transformation of data Please apply at  dallas@vastika.com  This email address is being protected from spambots. You need JavaScript enabled to view it. Vastika, Inc. seeks Business Analysts in Irving TX (& othr US locs as needd). Wrk on Apps dsgn & dvlpmnt. MS in CS, Engrng, Biz Admin, reltd + 1 yr exp. Exp as progrmr in Biz Anlyss, Data Anlyss, Quality Centr, ALM, Visio, Proj Mgt S/Ws, Erwin, Data Modeling, RUP, Agile, DB Progrmng & Sharepoint. Know web techs. Trvl w/in U.S. as necssry. Auth to wrk in US. Aply @ www.jobpostingtoday.com #1825CallSend SMSAdd to SkypeYou'll need Skype CreditFree via Skype"}