{"jobID": "2797011872", "jobLocation": "McLean_VA", "jobTitle": "Senior Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "83000", "jobDescription": " 1750 Tysons (12023), United States of America, McLean, Virginia  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Senior Data Analyst  Senior Data Analyst position with Capital One, National Association in McLean, VA; Multiple positions available:  -Perform quantitative and qualitative analysis of econometric data, relating constants and variables, restrictions, alternatives, conflicting objectives, and their numerical parameters.  -Define data requirements and gather and validate information, applying judgment and statistical tests.  -Develop data structures to support the generation of business insights and strategy.  -Maintain data infrastructure and develop scripts for regular processes.  -Analyze data analysis requests obtained from management to determine operational problems and define data modeling requirements, validation of content, and problem solving parameters.  -Identify opportunities to use data to develop new strategies and improve business performance and utilize knowledge of mathematical modeling and other optimization methods to perform quantitative and qualitative data analysis.  -Utilize programming and analytical tools including SAS, SQL, Teradata or similar relational database tool, and Unix to formulate mathematical or simulation models.  -Communicate and present data to management by developing reports.  The position requires a Masters degree or foreign equivalent in Economics, Finance, Engineering, Mathematics, Science, Information Technology, Business Administration or a related quantitative analytical field, and the following skill set through education or work experience: quantitative and qualitative analysis; data modeling; developing reports; Teradata or similar relational database tool; SQL; SAS; Unix programming. All listed qualifications may or may not be acquired concurrently. Must pass companys assessment.  #LI-DNI"}