{"jobID": "2832211069", "jobLocation": "Los_Angeles_CA", "jobTitle": "Intern - Summer 2018 - Undergraduate - Data Engineering", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "OVERVIEW OF THE COMPANY Fox Networks Group  Fox Networks Group (FNG) is a primary operating unit of 21st Century Fox (NASDAQ:FOXA). FNG consists of FOX Television Group, which includes FOX Broadcasting Company and 20th Century Fox Television; FOX Cable Networks, which includes FX Networks; FOX Sports Media Group, and National Geographic Partners. Together these units create, program and distribute on a worldwide basis much of America's most popular entertainment, sports and nonfiction programming. JOB DESCRIPTION Fox is proud to support a culture of creativity, entrepreneurial spirit and community that attracts the industry's brightest talent. The Fox Internship Program offers an exciting opportunity for you to gain practical experience while interning for one of the biggest media and entertainment companies in the world. You will have the opportunity to participate in real-world projects, which provides valuable work experience and leadership skills.  The Fox Internship Program provides mentoring and learning opportunities to help you develop your skills, network with Fox employees, and learn more about what it's like to work in the entertainment industry.  In this role, you will have the opportunity to learn, build and use the data platform in the cloud, will get the opportunity to grasp complex analytic principles and techniques.  Learning Objectives Working knowledge of Data & Analytics basics and enterprise implementation experience.Understand Multi-cloud technology stack and best practices in each area.Introduction to Advance analytics & ML EngineeringQualifications:Computer Science MajorGood knowledge of SQL, Shell, and Python code to process, manipulate and transform dataWork with various AWS technologies to build out our data pipeline and other Interfaces To participate in Fox's Internship program you must meet the following criteria: Applicants must be enrolled full-time in an undergraduate degree program at an accredited university and be sophomore status or above.Be eligible to work in the United States without sponsorship by the Company.Housing is not provided, so please have a housing option guaranteed before applying.Application Process: Please submit a resume and a cover letter detailing your qualifications.  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law.SDL2017"}