{"jobID": "2809042579", "jobLocation": "Mountain_View_CA", "jobTitle": "Lead Growth Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.livongo.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Why Livongo?Come for the Mission: Livongo empowers people with chronic conditions to live better and healthier lives. As the leading innovator in the digital chronic condition space, were connecting the pieces of the healthcare puzzle: treating and caring for the whole person physically and emotionally extending care and support beyond the doctors office, and applying real-time data to real-time solutions, across multiple conditions. We are experiencing astronomical growth and our success stems from our proven ability to make a real, measurable improvement in peoples health.Make an Impact: Top candidates are attracted to Livongo because they want their work to have impact. They want to accomplish something meaningful and make a tangible difference in other peoples lives. We combine smart digital technology with real-time, personal connections, to create amazing support systems for people with conditions like diabetes and high blood pressure. These conditions are currently costing the U.S. hundreds of billions of dollars, and our solutions reduce these costs while simultaneously improving outcomes, with a product people love using.We Believe in Our People: Like our health solutions, our working environment is people-centric. We focus on our members, our clients, and our employees. If were good to those folks, well succeed. We bring passion and excitement to the workplace, creating an inspiring environment powered by smart, fun, passionate individuals with wildly diverse professional backgrounds.We Are the Next Billion-Dollar Startup according to Forbes in their 2017 top 25 young companies list. Join us during this period of dynamic growth and innovation and help Livongo revolutionize the healthcare industry and impact millions of lives around the world.The OpportunityCome lead the charge for growth data science at Livongo, a category-defining company thats revolutionizing health care for chronic conditions. Experience in healthcare is valuable, but even more important is deep experience using data to measure and drive growth, regardless of the domain.This is a hands-on role where you will have the chance to use your world-class data skills. It is also a leadership role, in which you will be key to driving strategy and will lead another data scientists work in developing metrics and dashboards, conducting experiments, creating attribution models and finding insights that maximize growth. Over time this role has the potential to evolve into a manager role as the team grows.Your strategic and keenly analytical approach will enhance our team of industry innovators and thought-leaders, who are working to change the lives of people with chronic health conditions, and redefine the healthcare industry as a whole. Leverage your analytical mind to help us achieve mission-critical objectives and solidify the foundation for future succesResponsibilities Use data analytics and modeling to accelerate Livongo growth and successAnalyze data using SQL, R, Python, Spark, Hadoop, etc.Guide the work of a small number of junior data scientists in your departmentUse statistical modeling skills to build attribution models, including Markov chains, survival analysis, etc.Develop dashboards and BI tools to share your workCommunicate and present the results of your models to non-technical audiences, effectively helping internal decision-makers plan and set expectationsCollaborate with Livongo Engineering to ensure instrumentation and data pipelines support achievement of company goalsCreate plans of execution for yourself and other data scientists, and direct efforts to stay on plan and achieve goalsBuild reusable tools and methods that make the work faster; efficiencies add up fast Candidate Profile 5+ years data analytics and modeling experienceWorld-class expertise in at least one of the following: SQL, R,/Python, Spark, Hadoop SQL or something similarExtensive knowledge of databases and data processing languagesA track record of delivering results that support company objectivesSkill with multi-channel attributionA history of finding creative solutions to challenging problemsThe ability to frame problems in a practical but statistically-defensible wayStrong communication and presentation skillsA drive for continual learning and optimizationFundamental respect for people, with the desire to use data for social goodA deep respect for confidentialityAn advanced degree in statistics, management science, operations research, economics computer science, or physical/biological sciencesLivongo Health is on a mission to change how healthcare is delivered to people with chronic conditions around the world, starting with diabetes in the US.We are creating a smart data cloud capable of collecting and processing millions of data points from wearable devices, EHRs, and our cellular-connected blood glucose meters. We are also building delightful web and mobile front-end apps to provide consumers with intelligent workflows and visualizations to manage their chronic conditions effectively.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}