{"jobID": "2753379466", "jobLocation": "San_Diego_CA", "jobTitle": "Technical Data Mining Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.petco.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " PetSmart, Walmart, Costco Wholesale"}, "estimatedSalary": "57000", "jobDescription": "Our vision at Petco is Healthier Pets. Happier People. Better World. We’re making things better for pets, people and the planet through our Think Adoption First philosophy, the Petco Foundation and other important initiatives that focus on putting animals first, educating pet parents and reducing our carbon footprint. The journey starts with knowledgeable, passionately engaged associates who are proud to recommend Petco as a place to work, who believe in our Vision and who are committed to delivering a superior customer experience. From our retail stores and our network of Distribution Centers to our Corporate offices, you'll work with others who share your values and commitment. We seek individuals who are passionate about animal welfare, have great people skills and are driven to grow and advance in their careers with us. Our ongoing growth is creating exceptional opportunities for professional development and personal enrichment throughout our organization.Position Purpose:The Technical Data Mining Analyst will be in our San Diego, CA office, and will responsible for creating and updating statistical models used for site and store evaluation, customer behavior modeling, as well as other purposes.Essential Job Functions: The incumbent must be able to perform all of the following duties and responsibilities with or without a reasonable accommodation. Develops and updates a variety of predictive models to maximize revenue for the given objective (50>). Cutting edge statistical techniques will be leveraged to develop and update the models.Educate themselves in the site selection process. How do the models work, in what situations are the models more or less effective? Are there ways to minimize the model limitations thus maximizing their effectiveness? This development is critical for advancement and being able to speak to the models in front of the executives (15>).Run and evaluate the analog models for real estate committee and provide analog support for assortment planning and pricing (5>).Analyze and interpret data to develop and implement behavioral and predictive models. Utilize multivariate statistical analysis (linear & logistic regression, categorical analysis, cluster analysis, statistical sampling, decision trees, neural networks, multidimensional scaling, etc.) (10&)Add to the development of measures to create repeatable analytics practices, processes and procedures. (5>)Work with other team members to proactively identify key indicators, validate results and monitor success. Assist in the implementation of best practices. (5\")Supervisory Responsibility:NoneWork Environment:Most tasks are performed while seated indoors at a personal computer. Limited travel to conferences or real estate strategy tours may be required periodically throughout the year.Education/Experience:Master’s Degree in Statistics, Economics, Computer Science or a related field.2 - 4 years experience or equivalent combination of education and experience in the areas of data mining and statistics. Experience with programming and working with large data sets. Extensive experience performing advanced statistical analysis (using SAS, SPSS, R, etc.) including predictive modeling, cluster analysis, and advanced regression techniques. Excellent verbal presentation and written communication skills are important."}