{"jobID": "2794941884", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.tailoredmanagement.com", "Headquarters": "Columbus, OH", "Size": "51 to 200 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "125000", "jobDescription": "Be a Data Scientist for one of the top global leaders in cancer treatments team! Two-thirds of this company's Research and Development projects are being developed with companion diagnostics.Our Client's culture is highly collaborative, offers an environment that encourages employees to expand their knowledge in order to make a profound impact on patients' lives. This could explain why their company has been recognized as one of the \"Top Twenty Employers \" in biotechnology and pharmaceuticals by Science Careers.Duties: Processing, QC and analysis of NGS data and other bioinformatics analyses to support neuroscience, immunology and infectious disease programs in research and clinical development. Skills Required:Experience in NGS data analysis (e.g. WGS, RNAseq) and familiarity with NGS technologies and platforms.High level of proficiency with R programming language and or other scripting languages (Python, perl, etc.).Unix/Linux proficiency, familiarity with version control system.Experience with Bioconductor packages for genomic bioinformatics.Additional Skills (not required but would be desirable):Experience using Rshiny, JavaScript, and D3 for interactive data visualization.Database design and query, in relational databases, or no-SQL databases such as MongoDB.Knowledge of Neuroscience, Immunology, Microbiology, genetics.Experience supporting bioinformatics efforts in the early development phase.Experience with scientific data interpretation and data mining.Education:PhD in computer science, bioinformatics, computational biology, or related field or Master's in computer science, bioinformatics, computational biology, or related field with 3 years relevant experience or Bachelor's in computer science, bioinformatics, computational biology, or related field with 5 years relevant experience"}