{"jobID": "2731210060", "jobLocation": "Murray_Hill_NJ", "jobTitle": "Bell Labs -Data Analytics and Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Nokia is a global leader in the technologies that connect people and things. With state of the art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increase and transform the way people and things communicate and connect.Bell Labs Research Scientist - Data Analytics and Machine LearningHelp change the way people connect with the world…Bell Labs, the Nobel Prize winning research organization, has an opening for a research scientist in the Data Science Research Group in Murray Hill, New Jersey.Bell Labs defines Nokia’s technological and architectural vision for the ICT industry, identifies the key challenges in this vision and invents solutions that are an order of magnitude (10X) better than existing solutions. It advises the industry on the economics of the vision​ and underlying technologies, and how best to transform to most efficiently achieve the goals. Driving thought leadership among customers and the industry strengthens Nokia’s role as a market leader and creator. ​​​​​​Discovering the possibilities that shape the human experience are at the heart of everything we do. Our researchers are continually massively scaling the capabilities of networks from the data center to the end device, to change the way we live and work, by inventing breakthrough technologies to make networks and systems faster, smarter and greener. The selected candidate will be actively involved in the research aspects of developing and applying advanced data analytics, machine learning, and AI techniques and algorithms to solve challenging problems with real-world impact. Past experience in analyzing large scale data sets is desirable. Excellent verbal and written communications skills are required, along with the ability to work effectively with internal and external customers and partners. Some of the focus areas for our open positions include, but not limited to:Deep LearningActive LearningAutoMLTransfer LearningSmall-data LearningReinforcement LearningPattern DiscoveryGraphical ModelsInteractive Machine LearningRequired Qualifications: (Education, Technical Skills/Knowledge)Ph.D. in Computer Science or Statistics (or a similar quantitative field) with a focus on Machine Learning, Data Mining, or Predictive Analytics Demonstrated capability to develop proof-of-concept prototypes for experimenting with novel algorithmsStrong algorithmic problem solving and software development skills (R, Python, or similar)Desired Qualifications: (Education, Technical Skills/Knowledge)Demonstrated experience and accomplishments in the use of data mining, machine learning, and predictive analytics to address real-life problems. Knowledge and experience in modern machine learning techniques such as Deep Learning, Transfer Learning, Reinforcement Learning, or similarPast experience in analyzing large scale data and distributed algorithmsWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class"}