{"jobID": "2546467100", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist - CosmiQ Works", "companyRating": null, "companyInfo": {"Website": "www.iqt.org", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview  CosmiQ Works is an IQT Lab dedicated to exploring how the U.S. Intelligence Community can leverage new and emerging commercial space capabilities to support its missions. The Lab is looking for a highly experienced data scientist to design, develop, test and evaluate unique machine learning algorithms for exploiting large raster and vector data sets. The data scientist will work closely with other CosmiQ and IQT Labs researchers to identify and structure cutting-edge research projects in the computer vision field. This person will be encouraged to present his/her research findings at leading machine learning conferences and, when appropriate, publish in relevant academic journals. The data scientist must be comfortable working in a dynamic environment that entails both independent work as well as support for small to medium sized teams. ResponsibilitiesDevelop scalable algorithms based on cutting-edge machine learning/deep learning approaches and frameworks (e.g., TensorFlow, Caffe) that can handle a wide variety of remote sensory data.Provide technical and thought leadership to the remote sensing community utilizing customized machine learning and neural network methodologiesPresent findings on CosmiQ’s blog, at relevant conferences, and at meetings with representatives from the U.S. Intelligence CommunityQualificationsPhD degree in computer science, mathematics, physics, or a related quantitative field with some relevant experience, or MS degree in computer science, mathematics, physics or related quantitative field with 3 to 5 years of relevant experience; or BS in related field with 5 to 10 years of experience.High-level of knowledge of machine learning and deep learning researchExtensive experience building algorithms based on machine learning and/or deep learning methodsExtensive experience developing and debugging in python. Additional experience with R, C/C++ and/or Java is preferredExperience with filesystems, server architectures, and distributed systemsCapable of analyzing complex problems and generating a concise summary of analysis, and presenting recommendations for both technical and non-technical audiences.Capable of analyzing complex problems including identifying root cause issues, generating a concise summary of analysis; and presenting recommendations for technical and non-technical audiences alike.Ability to obtain a TS/SCI Security Clearance"}