{"jobID": "2819731010", "jobLocation": "San_Diego_CA", "jobTitle": "Data Warehouse Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.suntrust.com", "Headquarters": "Atlanta, GA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (STI) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": "LightStream is the online consumer lending division of SunTrust Bank, specializing in providing consumer loans to borrowers with good credit via the web. Through its proprietary lending technology, LightStream offers a completely digital and paperless experience to our customers, highly competitive rates, and an exceptional customer experience.Our office is located in San Diego, surrounded by fantastic weather, positive people, and an open and creative environment.We're looking for a passionate professional to join our growing team and help improve and scale our data analytics.The Data Analyst is a highly trained professional who performs the analysis, running various mathematical calculations to determine how the data samples might best be applied to profit the business, identify trends and other opportunities They may also participate in evaluating risk; culling statistical information to determine whether a company is accidentally harming itself.Prepare reports, which may be in the form of visualizations such as graphs, charts and dashboards, detailing the significant results they deduced. Guard and protect the organization's data, making sure that the data repositories produce consistent, reusable data. In a technical and systematic way apply the standard formulas and methods that are common in the industry and relevant to the current data. For example, data analysts might perform basic statistics such as variations and averages. They also might predict yields or create and interpret histograms. They use standard methods in all stages including collection, analysis and reporting.Responsibilities:- Documents, gathers and maintains metadata as it pertains to data models of moderate size and complexity.- Coordinates activities of assigned projects to meet deadlines.- Serves as a communication conduit between the internal customers and developers by providing information regarding the data that is available, where it is and how to access it, along with definitions.- Gathers and analyzes data and business requirements and translates them into a relational data model.- Data analysts use their technical expertise to cull data through advanced computerized models- Extrapolate data patterns by leveraging technical and mathematics algorithms.Minimum Requirements:Bachelor’s degree and 2 years of experience in database design or analysis or an equivalent combination of education and work experience.Knowledge in information systems and ability to apply that knowledge in practice.Ability to manage competing priorities.Ability to solve problems in straightforward situations by analyzing possible solutions using experience, judgment and precedents.Experience participating in IT projects.Ability to communicate complex information in straightforward situations.Preferred Requirements:Bachelor's degree and 3 years of experience.Banking or financial services experience.Working knowledge and understanding of one or more of the following: Oracle, SQL, DB2-LUW"}