{"jobID": "2827944740", "jobLocation": "Chicago_IL", "jobTitle": "Arity-Data Scientist-Cons II", "companyRating": "3.5", "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": "104000", "jobDescription": " Arity is a technology company founded by The Allstate Corporation focused on making transportation safer, smarter and more useful for everyone. We collect and analyze massive amounts of data to help our partners better predict risk and understand how people move. The Arity Platform is built on billions of miles of historical driving data with more than one million active telematics connections and 10+ years of data directly from cars.Job Description  Title: Telematics Data Scientist X3 (MULTIPLE OPENINGS)  Duties: Build predictive models and develop new machine learning techniques. Develop statistical modeling and/or machine learning techniques on telematics data that would handle a wide range of problems ranging from (but not limited to) probabilistic inference on phone trajectories, data fusion between noisy sensors, and classification of driving behavior. Work on data analysis and predictive modeling of sensor data collected from vehicles and mobile phones (E.g. GPS, accelerometer, gyroscope, etc.). Identify KPI’s generated from telematics sensor data. Manage data and data requests to improve the accuracy of our data and decisions made from data analysis. Collaborate with the team to improve the effectiveness of business decisions through the use of data and machine learning/predictive modeling. Communicate findings to team and leadership to ensure models are well understood and incorporated into business processes, and work with leadership to understand priorities and product needs and translates those into data and modeling products. Work on end to end life cycle from problem definition, data acquisition, exploratory data analysis, model building, deploying, supporting, monitoring to revising models in a production setting. Lead and participate in peer reviews, code reviews and other department activities.  Job Qualifications  Education & Experience Requirements:  PhD (or foreign educational equivalent) in Statistics, Mathematics, Computer Science, Economics, or related field and one (1) year of experience using statistical modeling and/or machine learning techniques to process or build models on telematics or sensor data to drive a company’s business results.  or, alternatively, a Master’s degree in one of the enumerated fields and four (4) years of experience as stated above.  or, alternatively, a Bachelor’s degree in one of the enumerated fields and six (6) years of experience as stated above.  Special Skills:  • Demonstrated expertise with hands on software engineering, specifically statistical modelling or machine learning or artificial intelligence experience.  • Demonstrated expertise coding and developing prototypes in Matlab, R, Python, C++, and SQL.  • Demonstrated expertise managing and manipulating large labeled and unlabeled complex datasets having billions of data points and coming from varied sources, using technologies such as PySpark, Hadoop, Hive, and SQL.  • Demonstrated expertise in sensor data processing techniques (e.g. Savitzky – Golay filters, Kalman filters, and dimensionality reduction techniques).  • Demonstrated expertise in providing insights, building models from telematics and geo-spatial data (e.g. accelerometer data, gyroscope data, Gravitometer data, GPS data, and geo-spatial shape files).  • Demonstrated expertise working through end to end life cycle from problem definition, data acquisition, exploratory data analysis, model building, deploying, supporting, and monitoring to revising models in a production setting.The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen. Good Work. Good Life. Good Hands®. As a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video. Allstate generally does not sponsor individuals for employment-based visas for thisposition. Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.  For jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.  For jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.  It is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}