{"jobID": "2741342395", "jobLocation": "Dallas_TX", "jobTitle": "Sr Scientist Product Integrity", "companyRating": null, "companyInfo": {"Website": "www.marykay.com", "Headquarters": "Addison, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JOB PURPOSE  Provide a high level summary of the overall purpose, scope and objective(s) of the job that explains why the job exists.  Responsible for assessment of product integrity as it relates physical and chemical stability/compatibility of the formulation and package and for developing test methodology to assure the continued quality of Mary Kay products globally. Provides technically robust data to support project decisions. Technical supervisor to an Assistant Scientist, Sr. Laboratory Technician, Laboratory Technician, and/or Contractor. ESSENTIAL DUTIES AND RESPONSIBILITIES List duties and responsibilities that illustrate how the job is accomplished. Include for each the complexity/scope, independent judgment/ decision making and impact of errors. Include approximate percentage of work time spent on each item. Percentages must add up to 100&. Responsible for assessment of product integrity as it relates physical and chemical stability/compatibility of the formulation and package and for developing test methodology to assure the continued quality of Mary Kay products globally. Enables product development through technical mastery, with clear and concise communication. Provides technically robust data to support project decisions. Partners cross-functionally to identify and address problems. 50&Interacts routinely with various personnel in Global Manufacturing, Contract Manufacturing, Quality, and R&D; groups. Keeps management informed of stability concerns. Remains externally focused to identify and aid in the evaluation of new methodologies. Uses scientific principle and theory to guide or develop new or improved techniques and methods to improve or ensure regulatory compliance of procedures and quality of products. Incumbent to this position is understanding and communicating technical risks, balanced with Business Needs, to aid project delivery. 25&Ensures regulatory compliance through adherence to SOPs, good record keeping, and review of Stability test data for completeness and accuracy. 15>Trains, coaches, and facilitates performance evaluation for Assistant Scientist, Scientists, Sr. Laboratory Technician, or Laboratory Technician. Serves as an information resource regarding policies and procedures within the department 10& In addition to the above, incumbent is expected to meet the required competencies for this position as defined in the competency profile.  KNOWLEDGE, SKILLS AND ABILITIES  Indicate the required minimum level of education, experience and skills generally required to successfully perform the responsibilities of the position.  Education Bachelor’s degree in Chemistry, Biochemistry, or equivalent required. Master’s degree or PhD preferred.  Experience 5/3/2 (Bachelor’s/Master’s/PhD) years of experience required. Previous educational or work experience must include independent research and presentation of results, hands-on use of highly technical analytical instrumentation, and work with raw materials or finished products. Must possess a strong foundation in chemistry as applied to the stability of formulated products. Exposure to and an understanding of audit / inspection protocols, statistics, and FDA and GMP regulations is strongly preferred.Excellent oral and written communication skills are required to interface with various levels of personnel to achieve quality objectives and influence management decisions.Must be able to evaluate complex problems, and to work effectively both individually and with others to provide timely solutions that meet Business objectives.Prior experience leading and managing others preferred"}