{"jobID": "2795328409", "jobLocation": "Belmont_CA", "jobTitle": "Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.lakepharma.com", "Headquarters": "Belmont, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Aragen Biosciences, GENEWIZ, GenScript"}, "estimatedSalary": "65000", "jobDescription": " ApplyDescriptionLakePharma is a leading biologics company specializing in antibody and protein engineering, cell line development, and protein production. Our services can be fully integrated, creating a customized solution for all our customer’s molecular biology, cell line, and protein needs. We just raised $30 million in growth equity from Summit Partners & Ampersand Capital Partners for expansion purposes.  We are rapidly growing and seeking a talented individual to join our Analytical and Formulation Science team as a full-time Scientist/Sr. Scientist. The candidate will provide support to the Analytical and Formulation Science under Process Development. ResponsibilitiesDevelops LC-MS based analytical methods to support the development of monoclonal antibody or proteinsWork independently for designing experiments, drafting protocols, executing experiments, performing data analysis, documenting work in electronic notebooks, and generating study reportsWork closely with multi-functional Business UnitsIdentify opportunities to improve existing or developing innovative analytical methods (e.g. novel MS or LC-MS methods) to better support therapeutic protein characterization and drug developmentOther responsibilities may include but are not limited to performing other analytical characterization methods for therapeutic antibody developmentRequirementsPh.D. in chemistry/biochemistry or related field requiredExtensive experience in mass spectrometry data analysis requiredExtensive experience in mass spectrometer operation and maintenance requiredExperience in PK studies using mass spectrometry or experience in proteomics is preferredExperience in antibody purification and characterization will be a plusExcellent attention to detailsExcellent record keeping skillsStrong ability to work on multiple projectsStrong ability to manage work independently with minimal supervision The Scientist/Sr. Scientist of Analytical and Formulation Science position provides a unique opportunity for a person with aspirations of joining and contributing to a fast-paced team at a rapidly expanding company with a cutting-edge technology platform. This position offers ample opportunity to grow along with the company.  If you have the drive, passion, experience and are excited by this opportunity and ready to take your career to the next level then Apply Today!"}