{"jobID": "2802504714", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Product Management", "companyRating": null, "companyInfo": {"Website": "www.rothys.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Director of Product Management at Rothy’s San Francisco, CA | Growth Team | Reports to the VP of Growth  Looking for an opportunity to apply your product and ecommerce expertise at at a thoughtful, sustainable start-up? Rothy’s is looking for a product leader with the ability to drive the strategy, roadmap, experience and optimization of our site as we rapidly scale the business.  The Director of Product Management is responsible for the overall customer experience for our site visitors working with multiple teams across marketing, merchandising, and development. This person will lead efforts to create a high-performance site experience with a focus on improving engagement, conversion, AOV and overall revenue through testing and optimization. This person should have a strong understanding of how people shop online and how cross-channel and social platforms integrate with ecommerce websites. We’re looking for someone customer and data driven with a strong background improving site performance and usability for hyper-growth brands.  We believe in making women’s busy lives more seamless—and do one better for the planet while we’re at it. Come help us spread the gospel. If you’re eager to take on an array of responsibilities at a dynamic, fast-growing company, you just might be the perfect fit. Responsibilities:Responsible for the overall customer experience for our site visitors working with multiple teams across marketing, merchandising, and development.Manage strategic roadmap, working with outsourced dev team and platform as well as internal UX team to drive a high-performance site experience with a focus on optimizing engagement, conversion, AOV and overall revenue.Build and drive a testing culture. Bring a data-driven approach to site analysis and customer research, develop and prioritize test ideas, and synthesize insights for site optimization to improve user experience and lift KPIs.Create a seamless discovery, shopping and purchase experience across all digital platforms.Bring a mobile-first vision and drive significant wins on mobile optimization.Working with our nimble outside development team, drive scalable web production processes and workflows that achieve operational efficiency, productivity and effectiveness.Oversee the process and partner cross-functionally to ensure high quality and timely execution of marketing campaigns, site merchandising and overall content on the site.Lead and support projects including UI/UX, navigation, path to purchase, multi-channel capabilities, product recommendations and user-generated & social content opportunities to enhance the digital experience.Drive site personalization and segmentation strategy to create relevant, value-added, personal and engaging customer experience to increase engagement, conversion, lifetime value.Discover, evaluate, recommend and manage relationships with technology companies to ensure delivery of value and KPIs.Bring new ideas and innovative approaches to digital experiences to drive growth and conversion.Qualifications:Bachelor’s degree or equivalent combination of education, training and/or experience.8+ years of experience in online product management ideally within the ecommerce space.Subject matter expertise in web production, site operations, UI/UX, features and functionalities, site merchandising, testing & optimization, and mobile.Strong leadership, influencing and communication skills with ability to interact, influence and align with all levels of the organization, both internal and external.Ability to think end-to-end from both the customer and business perspective and position solutions with consideration for impact on all relevant business operations as a whole.Strong strategic and analytical thinker with exceptional execution and problem-solving capabilities.Strong project management skills with proven track record of delivering high quality work under tight timelines.Demonstrate sound decision-making and judgment with ability to react quickly under pressure.About Rothy’s: San Francisco-based Rothy’s sustainably creates stylish products that become an indispensable part of our customers’ everyday lives. Our shoes are seamlessly made from recycled bottles using a 3D knitting process that significantly reduces waste...because doing good should look good too!  Located in historic Jackson Square, our office is as unique as our backgrounds. We are an unlikely crew from all parts of the US, a handful of countries and a diverse set of professional backgrounds. We speak Mandarin, Spanish, English, and some occasional gibberish, depending upon the time of day. We are connected by our passion for the product, our customers and the excitement of creating something new in the world. And we have great snacks. Come join us."}