{"jobID": "2777927666", "jobLocation": "Monroe_MI", "jobTitle": "Driver", "companyRating": null, "companyInfo": {"Website": "www.sysco.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (SYY) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Performance Food Group, Meadowbrook Meat Company"}, "estimatedSalary": null, "jobDescription": " Company: SYGMA Detroit  Location: US-MI-Monroe  Zip Code: 48162  Minimum Level of Education: High School or Equivalent  Minimum Years of Experience: 1 Position Type: Travel Percentage: 0 POSITION SUMMARY: To serve our customers by safely and efficiently transporting product from the warehouse by driving a tractor trailer to various customers and properly delivering and unloading product according to customer invoices and company standards. ESSENTIAL FUNCTIONS/RESPONSIBILITIES:Safely transports product from the warehouse to the customer location and ensures product is delivered on a timely basis, according to assigned route.Unloads product from trailer, by hand or using hand cart down ramps, stairs, or docks, in all weather conditions and places in designated customer storage areas according to customer specifications and company standards (e.g. handling product according to preferred work methods, scanning product as it is delivered into the store).Picks up, loads and unloads damaged goods and customer returns, and transports products back to SYGMA warehouse.Ensures all paperwork is completed according to established company and governmental guidelines (e.g. DOT electronic or manual logs, inspections, company vehicle maintenance reports and pre and post-trip reports are completed accurately and submitted on a timely basis, ensures all invoices are accurate and turned in daily and all damages and shortages are reported promptly).Ensures all food safety protocols are met according to established guidelines (e.g. proper temperatures are maintained in the delivery vehicle, product is inspected for visible damages prior to delivery, product is delivered and stored to prevent cross contamination) and maintains sanitary conditions in tractor and trailer; assists with maintaining sanitary conditions in the warehouse and yard.Follows preferred work methods at all times, and immediately advises management team of any unsafe conditions.Maintains and safely operates all assigned equipment, including but not limited to hand cart, pallets, load bars, SLS unit, and personal protective equipment.Develops and establishes good relationships with customers by providing excellent and courteous service with clear communication.Communicates with management team regarding any deviations to route, trailer or loading issues and/or customer or product issues.Safely transports product picked up via backhauls and line hauls and ensures picked up product is correct and is delivered on a timely basis, according to established company standards.Works assigned schedule and works outside usual work schedule as needed to meet customer needs; exhibits regular and predictable attendance. Other duties as assigned by Management.REQUIRED MINIMUM EDUCATION/EXPERIENCEHigh school diploma/GED/equivalent degree, plus 1 year of tractor trailer driving experience preferred. Completion of a tractor trailer driving school will be accepted instead of, or in addition to a high school diploma.CERTIFICATIONS AND/OR TECHNICAL REQUIREMENTS:Valid Class A Commercial Drivers License. Must be insurable to operate a vehicle as a condition of initial and continued employment.KNOWLEDGE, SKILLS AND ABILITIES: Knowledge of: DOT regulations; Hazmat guidelines; Safe lifting and delivery practices.  Skill in: driving over long distances, over a variety of terrains and in varying weather conditions, communicating with customers; solving problems; delivering product.  Ability to: drive a tractor-trailer unit both in the day and at night in a variety of traffic and weather conditions and remain alert and aware of surroundings; meet or exceed minimum productivity levels established by the Company; handle hazardous materials and food and restaurant items that are frozen, dry and refrigerated; operate a 3 axle tractor, 45' - 48' trailer, straight truck, on board computer, key pad and a 2 wheel hand cart; read, write and communicate in English as it relates to the job and to the safety regulations;  perform basic math functions (e.g. add, subtract, multiply, divide); effectively plan and organize work activities independent of direct supervision; solve problems. PHYSICAL DEMANDS: The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. While performing the duties of this job, the associate is regularly required to sit, talk and hear. The associate is frequently required to lift, push, or move product that weighs up to up to 50 pounds by hand and push/pull up to 350 pounds of product with a 2-wheeled hand card down a ramp and into the customers storage areas; climb in and out of a tractor and trailer; reach to stack and unstack pallets and hand cart; bend and twist while loading and unloading product, and retrieving items from trailer. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.WORK ENVIRONMENT: The work environment characteristics described here are representative of those an associate encounters while performing the essential functions of the job. While performing the duties of this job, the associate is occasionally exposed to wet, hot, extreme cold and/or humid conditions; and moving mechanical parts and may be required to work in confined spaces. The associate usually works an overnight schedule, including weekends, holidays, overtime, on-call and starting at various times are required in order to successfully meet customers needs. The associate is occasionally exposed to high, precarious places. The associate is occasionally exposed to fumes or airborne particles. The noise level in the work environment is usually moderate. Overtime hours, working weekends and holidays, and starting at various start times are required in order to successfully meet customers needs. NOTICE: The above statements are intended to describe the general nature of the environment and level of work being performed by this job. This job description in no way states or implies that the duties and responsibilities listed are the only tasks to be performed by the associate in this job. The associate will be required to follow any other instructions  and to perform any other job related duties requested by his or her supervisor.  Reasonable accommodations will be made to enable individuals with disabilities to perform the essential functions.  This job description supersedes prior job descriptions. When duties and responsibilities change and develop, the job description will be reviewed and is subject to changes of business necessity.  EEO/AA Employer  Applicants must be currently authorized to work in the United States.  Sysco is proud to be an Equal Opportunity and Affirmative Action employer, and considers qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law.  This opportunity is available through Sysco Corporation, its subsidiaries and affiliates.Employment Type: Full Time"}