{"jobID": "2811580037", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst, Demand Planning", "companyRating": "3.0", "companyInfo": {"Website": "www.munchkin.com", "Headquarters": "Van Nuys, CA", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " About Us:Munchkin is a fast-growing, industry-leading infant and toddler consumer products-company with 7 global offices generating over $300 million in annual sales. We are passionate, creative, believe in only making the best products, and we’re looking for team members who think big, move fast, work smart, and have a desire to do things better. We pride ourselves in hiring great people with the talent it takes to keep up with our growth. We invite you to explore the “About” page on our Website and help us rid the world of all things mundane!Position Summary:The Data Analyst has direct responsibility of developing forecasts on a Customer/SKU level through a collaborative forecast process with Sales, Marketing, Finance and Operations. This is done through analysis of key data points, usage of forecasting software, active participation in cross functional meetings, and utilizing information from retailer vender databases.You'll Do:  Analyze and monitor all data points as related to sales and forecasts for Munchkin; including weekly POS, shipments, orders, current market trends, seasonal trends, new item performance and product version changes Develops global forecasts at the Customer/SKU level through a collaborative forecast processAssist in the development of new data-driven business processes and systems that will drive forecast accuracy, adding value to all downstream commercial and supply chain processesLiaise with E-Commerce, Planning, Sales, IT, Marketing and Customer Service departmentsUtilize key Retailer Vendor Managed Systems for data analysis and reportingDevise, generate, and maintain standard and exception reports as required for data validation, forecasting analysis, and meetingsDeliver training and provide Demand Planning systems support as required for the Sales, Marketing, and Supply Chain teams Monitor SKU count and recommend SKU rationalization initiatives in the futureOther duties may be assigned Bring It!  An outgoing and enthusiastic personality Detail oriented, organized and strong on follow through Ability to work in a team-oriented and very fast paced environment with little supervision Desire to advance and gain increased responsibility A problem solver who is comfortable taking initiative BS/BA in Economics, Statistics, Supply Chain/Operations or related field; and/or three to five years of consumer products forecasting/demand planning experience Expert level of knowledge in Microsoft Office, Excel and the aptitude to learn various Retailer Vendor Managed Systems (Amazon Vendor Central, Content Analytics, IRI) and forecasting software (Galt) Proficient level of supply chain understanding and CPFR activities such as forecasting, inventory control, etc. Experience with SQL (required), Python (preferred) Understanding of statistical principles To Apply:If you are interested in joining our team, please visit www.munchkin.com for more information and submit your resume to https://cw.na1.hgncloud.com/munchkin/loadJobPostingDetails.do.  We regularly hold social functions to foster a genuine camaraderie that enhances teamwork. At company-wide award functions, we take time to recognize the talent and dedication of the people who make Munchkin such a standout place. We also provide growth potential, competitive compensation and bonuses, excellent insurance options, and a generous 401(k) match to consistently improve the quality of life for all our employees. Check out our website at www.munchkin.com for more information and open positions in the career section.  Munchkin is an equal opportunity employer."}