{"jobID": "2827170123", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Web Master", "companyRating": null, "companyInfo": {"Website": "www.llamasoft.com", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Like Stats?  Yeah, us too!  Check these: 600+ enterprise customers in 60 countries50% of Fortune 100 companies are customers23 of the Gartner Top 25 Supply Chain are customers So, yes, were all about business. But were also all about sustainability, see our 2017 Green Award **  ICYMI: We were named to the 2017 Best and Brightest Company in the US of A and in Metro Detroits 2017 Best and Brightest Company list  Were well funded, fun and focused on building the very best in supply chain and we want YOU to help us build complex models that allow global companies to quickly, safely model supply chain impacts.  Dont believe us - read the Gartner Supply Chain Masters and youll learn that nearly all the Gartner Supply Chain Top 25 use our solutions to tackle the most complex supply chains issues the world has ever seen.  Smart, energetic and ready to make your mark in a best in class enterprise software company? Join our herd!  ** from Supply and Demand Chain Executive The Role: This is an amazing opportunity for someone with strong web master experience. As part of the marketing operations team, youll report to and work with the Marketing Operations Director. You will develop and manage the LLamasoft global website, ensure corporate branding guidelines are followed always, the website is optimized for mobile, maintained as appropriate with consistency across the globe. The Purpose of Your Role:Program websites using a variety of development platforms, including WordPress, Drupal, HTML5, and experience with JavaScript and PHP Responsible for website conversion strategy and visitor navigation paths.Manage and maintain customer portal and user conference website as well as all other ancillary landing pages.Work with internal stakeholders to design and/or develop web changes or additions and content updatesDevelop SEO strategies to maximize organic traffic for Relevant keywords and search terms, registers with search engines.Design graphical assets as requested and/or collaborate with design resource(s)Manage web development projects and work with outside agency for more complex development needsDevelop site content and graphics by coordinating with copywriters and graphic artists; designing images, icons, banners, audio enhancements, etc.Maintain and update site by updating content and graphics; monitoring performance and results; identifying and evaluating improvement options; introducing new technology; maintaining links.Protect site by designing and installing security precautions.Maintain site appearance by developing and enforcing content and display standards; editing submissions.Keep equipment operating by following operating instructions; troubleshooting breakdowns; maintaining supplies; performing preventive maintenance; calling for repairs.Accomplish information systems and organization mission by completing related results as needed.Qualifications:BSc/BA in Computer Science, Design or a related fieldProven experience as a Webmaster or Web DeveloperKnowledge of web analytics and SEOFamiliarity with web standardsWorking knowledge of website management toolsProficient in HTML/CSS, XML; knowledge of SQL and JavaScript is preferredExperience in WordPressStrong troubleshooting and analytical abilitiesExcellent communication and teamwork skillsAbility to generate creative ideasAttention to detail and outstanding organizational skillsAbout LLamasoft LLamasoft provides software and expertise to help companies design and improve their supply chain operations. We enable companies to model, optimize and simulate their supply chain operations, leading to major improvements in cost, service, sustainability, and risk mitigation. Supply Chain Guru®, LLamasofts flagship product, is the leading supply chain design and predictive analytics application available in the market today.  Since 1999, LLamasoft has helped hundreds of global organizations in over 30 countries leverage their unique blend of technology and deep domain expertise to drive competitive advantage and savings across their supply chain operations.  LLamasoft offers a stimulating small company atmosphere where your efforts will have a significant impact on global logistics and our companys success. We are a fun, results-driven company that centers on developing high-quality software, not work schedules and dress codes. We are driven by people who have a passion for technology and innovation. If you are excited about software development and looking for a fun and flexible environment in a growing company, please apply!  LLamasoft is an equal opportunity employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}