{"jobID": "2662715535", "jobLocation": "Hercules_CA", "jobTitle": "Marketing Data Analyst II", "companyRating": "3.2", "companyInfo": {"Website": "www.bio-rad.com", "Headquarters": "Hercules, CA", "Size": "5001 to 10000 employees", "Founded": " 1952", "Type": " Company - Public (BIO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Abbott Labs, bioMérieux"}, "estimatedSalary": "88000", "jobDescription": " This new role will support all marketing data analytics needs, from list creation to back-end analysis, for consolidated digitial marketing campaigns selling equipment and consumables to laboratories and hospitals worldwide. Responsible for transforming raw data into actionable insights that ensure cross-departmental marketing efforts are effectively driving incremental engagement and conversion. Master the marketing data analytics and tracking infrastructure used by Bio-Rad and proactively contribute to improved campaign perfromance through data analysis and reporting.Develop integrated data solutions and new insights from data sourced from CRM (Salesforce), Digital/Web Marketing (Webtrends) and Marketing Automation (Marketo).Support all list scoring algorithms, results reporting, and detailed back-end analysis for new global marketing campaigns.Work closely with marketing teams to define key metrics, identify trends and opportunities across channels, campaigns and customer segments, and provide solutions for their analytic and KPI requests.4-year degree or equivalent work experience (5+ years) in marketing data analytics.Candidates must be able to program in a Linux environment using SQL, R, or python and have data analysis experience in a business environment.Experience in creating clear and insightful visualizations using PowerBI (preferred), Tableau or a related package.Experience working with CRM, Digital Marketing and Marketing Automation data.Ability to translate business requirements into technical solutions.Excellent listening, interpersonal and verbal/written communication skills.About Bio-Rad: Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.  Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.  EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age Agency Non-Solicitation: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes."}