{"jobID": "2836366368", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist 1", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "85000", "jobDescription": "All About YouResponsibilities:• Initiate, direct and execute scientific research and development• Demonstrates technical proficiency, scientific creativity, collaboration with others and independent thought.• Represent Systems Integration function on Project Teams. Supervise one or more Research Associates on project activities.Collaborate with all functions within project teams (such as chemistry, software, engineering and manufacturing).Engage in the early design of products to represent Systems Integration knowledge.Develop verification and validation test plans; execute study protocols and generate reports.Analyze data and troubleshoot issues.Suggest creative solutions to system-level issues.Willingness to be hands-on.Requirements:• BSc/MS: 8+ years of experience or PhD: 0-2 years of experience in successful, product development environment required. Clinical development experience strongly preferred.• Experience developing products for regulated markets and working knowledge of design controls desired.Experience giving input to product design at an early stage of development.A broad scientific knowledge (instrumentation, optics, chemistry, molecular biology, software, etc.)Multidisciplinary approach to problem solving.Proven skills in analysis of large complex data sets helpful.Demonstrated ability to understand and successfully work across multiple disciplines such as engineering, software and manufacturing highly desired.Must be detail oriented and highly motivated.A desire to be a part of a fast paced, multidisciplinary and dynamic environment.Solid communication and writing skills required.Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}