{"jobID": "2837822354", "jobLocation": "Plainwell_MI", "jobTitle": "Junior Engineer / Geologist / Scientist", "companyRating": null, "companyInfo": {"Website": "www.ghd.com", "Headquarters": "Sydney, Australia", "Size": "5001 to 10000 employees", "Founded": " 1928", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " GHD is one of the worlds leading professional services companies operating in the global markets of water, energy and resources, environment, property and buildings, and transportation.  Privately owned by our people, GHD provides engineering, architecture, environmental and construction services to private and public sector clients across five continents. Focused on creating lasting community benefit, our connected global network of over 8500 people delivers projects with high standards of safety, quality and ethics.  Committed to sustainable development, GHD improves the physical, natural and social environments of the many communities in which we operate  GHD is growing, and is seeking a  Junior Engineer/Geologist/Scientist to join our team at our  Plainwell, MI office.  Typical responsibilities include: Supporting project teams both in the office and in the field on projects associated primarily with: environmental remediation, due diligence, and investigation; field project oversight; and potentially conceptual design projects involving environmental, civil and/or construction disciplines. Assisting with development of project health and safety documents, environmental reports, client proposals, vendor safety approvals, purchase orders, budget estimates, and invoicing. Develop and maintain client relationships. Field data collection and documentation for environmental site assessments. Coordinate and conduct field sampling programs. Qualifications: B.S. in Civil or Environmental Engineering, Geology, Environmental Science or comparable degree program 05 years of experience Strong technical writing skills Ability to effectively communicate with other technical professionals and subcontractors Must reside in Grand Rapids or Kalamazoo, Michigan area Willingness to travel as necessary Current OSHA 40hour HAZWOPER is a plus We offer an opportunity to be part of a growing and dynamic employee owned company, a professional working environment with career and personal growth potential, flexible hours and competitive salary packages based on qualifications, skills and experience in a privately held, quality driven and client focused company.  As a multicultural organization, we encourage individual achievement and recognize the strength of a diverse workforce. GHD is an equal opportunity employer. Upon request, GHD will provide reasonable accommodation for applicants with disabilities throughout the recruitment and selection process.  #LI-MH1"}