{"jobID": "2817520179", "jobLocation": "Chicago_IL", "jobTitle": "Software Engineer - Virtual Assistant Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Apply Now  Software Engineer - Virtual Assistant Data Analyst  Req #: 180031547  Location: Chicago, IL,US  Job Category: Technology Job Description: As an experienced Software Engineer, your mission is to help lead our team of innovators and technologists toward creating next-level solutions that improve the way our business is run. Your deep knowledge of design, analytics, development, coding, testing and application programming will help your team raise their game, meeting your standards, as well as satisfying both business and functional requirements. Your expertise in various technology domains will be counted on to set strategic direction and solve complex and mission critical problems, internally and externally. Your quest to embracing leading-edge technologies and methodologies inspires your team to follow suit. And best of all, you'll be able to harness massive amounts of brainpower through our global network of technologists from around the world.  This role requires a wide variety of strengths and capabilities, including: Expertise in application, data and infrastructure architecture disciplined Advanced knowledge of architecture, design and business processeseen understanding of financial control and budget managementAbility to work collaboratively in teams and develop meaningful relationships to achieve common goalsInterpret data, analyze results using statistical techniques and provide ongoing reportsDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and interpret trends or patterns in complex data setsFilter and \"clean\" data by reviewing computer reports, printouts, and performance indicators to locate and correct code problemsWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesProven working experience as a data analyst or business data analystTechnical Expertise regarding data models, database design development, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsBS in Mathematics, Economics, Computer Science, Information Management or Statistics Our Corporate&Investment; Bank relies on innovators like you to build and maintain the technology that helps us safely service the world's important corporations, governments and institutions. You'll develop solutions for a bank entrusted with holding $18 trillion of assets and $393 billion in deposits. CIB provides strategic advice, raises capital, manages risk, and extends liquidity in markets spanning over 100 countries around the world.  When you work at JPMorgan Chase&Co.;, you're not just working at a global financial institution. You're an integral part of one of the world's biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.  At JPMorgan Chase&Co.; we value the unique skills of every employee, and we're building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you're looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you."}