{"jobID": "2633457238", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Analyst (End User Monitoring (EUM) Management Analyst) - SECRET Clearance Required", "companyRating": "3.1", "companyInfo": {"Website": "www.akima.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " L3 Technologies, Chugach Alaska, Booz Allen Hamilton"}, "estimatedSalary": "91000", "jobDescription": " RiverTech is a small business serving Department of Defense and federal civilian agencies focused on space and maritime operations, C4IM, and C4ISR. RiverTech is dedicated to providing exceptional performance in strategically critical environments.Sr Data Analyst (EUM Management Analyst will:Conduct a review of all End Use Monitoring records and develop a system for recording data as a result of the review.Conduct an in-depth review of documentation and produce concrete deliverablesAudit all receiving/transfer documentsDevelop a naming and numbering system for easy retrieval of all official EUM documentationOrganized data on the INL shared drive in an efficient and effective mannerConfirm site locations of all defense articlesUse discretion and judgment in handling sensitive dataMINIMUM QUALIFICATIONS:Bachelor's Degree from an accredited institution in one of the following areas: Business Administration, Accounting, or Project Management, or related field, and five (5) years' professional work experience, of which three (3) years shall be directly related to performing functions in administration and/or auditing of large programs and ensuring compliance with established internal control procedures by examining records, reports, operating practices, and documentation. OR A minimum of ten (10) years' professional work experience, of which three (3) years shall be directly related to performing functions in data analysis, administration and/or auditing of large programs and ensuring compliance with established internal control procedures by examining records, reports, operating practices, and documentation.Data Analysis/Administration background with expertise inspecting and auditing large amounts of data from a variety of data sources.Experience developing and proofreading written reports.Current driver’s license.Proven ability to build and maintain key relationships in a culturally diverse environment and negotiate the resolution of conflicting views to enable the implementation of policies and programs.Must have excellent Microsoft Office Excel skills to include demonstrated experience in performing horizontal and vertical look-ups, pivot charts, and pivot tables.Interagency Language Roundtable (ILR) Level 3/3- Professional working language proficiency in Spanish. Preferred qualifications for this position are: Experience auditing property accountability.Overseas experience. Prospective employees will receive consideration without discrimination because of race, color, religion, creed, gender, national origin, age, disability, marital status, veteran status, sexual orientation, or any other legally protected status.  We are committed to Equal Employment Opportunity and providing reasonable accommodations to applicants with physical and/or mental disabilities. If you have a physical and/or mental disability and are interested in applying for employment and need special accommodations to use our website to apply for a position please contact, Recruiting Services at job-assist@akima.com or 571-353-7053. Reasonable accommodation requests are considered on a case-by-case basis.  The dedicated email and telephonic options above are reserved only for individuals with disabilities needing accessibility assistance to apply to an open position using our website.  Please do not use the dedicated email or phone number above to inquire on the status of your job application.  We wish to thank all applicants for their interest and effort in applying for the position; however, only candidates selected for interviews will be contacted.  In order for our company to stay compliant with government regulations, please apply on line. Please DO NOT email resumes or call in lieu of applying online unless you have a physical and/or mental disability and need assistance with the online application."}