{"jobID": "2767172237", "jobLocation": "Springfield_VA", "jobTitle": "Systems Analyst/Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.radiantsolutions.com", "Headquarters": "Herndon, VA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ResponsibilitiesGot a head for numbers? Like turning real world problems into mathematical representations and checking to see if you did it right? If you like that, you’ll love developing algorithms with us! Our customers have some of the most interesting needs and hardest challenges to resolve. Our solutions require integrated models based on large and varied datasets. Our simulations feed analytic applications so that we can extract patterns and behaviors obscured within the data. We need systems analysts/data scientists of all experience levels to staff positions supporting the defense and intelligence communities.  Radiant Solutions is currently staffing multiple projects with analysts who have diverse backgrounds and experiences from the open source, defense and intelligence communities, and commercial industry. Note: US citizenship and an active TS/SCI clearance is mandatory for this position and required for consideration.Why us? - We build advanced algorithms to gain analytic insights from imagery and geospatial data.- We enable machine learning systems, automate workflow, and design and develop custom applications for unique national-security missions- We provide training to expand your skills and challenges to develop them- Our client’s missions are vital to national security, so we’re mission-first always- Our work environment is relaxed business casual- Because at our core we believe and practice social responsibility.QualificationsYou have to have these: - US citizenship and an active TS/SCI clearance - if you have a current polygraph, even better- Bachelor's degree, or higher in Engineering, Math, Physics, Computer Science, or equivalent- Development experience in a Linux/Unix/Windows environment- Experience in at least one of these languages: R, VBA, Java, C++, SQL, Python- Experience developing and testing models- Capability to work effectively in a geographically distributed development team We’d really like it if you had:- Master’s degree, or higher in Engineering, Math, Physics, Computer Science, or equivalent- Graduate experience working with probabilistic and stochastic statistical analysis or computational intelligence - Experience conducting model feasibility research and algorithm development for machine learning- Experience with distributed datasets and experience analyzing both relational and NoSQL data structures- Leading and mentoring small teams from project inception through deployment- Experience working in an Agile environment, especially SAFe  #cjpostOverviewJoin our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.  We are a new organization but no company has such strong roots in geospatial with our level of scale and a strong commercial mindset. Our heritage companies, MDA Information Systems, RadiantBlue, DigitalGlobe Intelligence Solutions, and HumanGeo are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technology and our unique intellectual property to both national security and commercial problems.  We offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance. Radiant Solutions values diversity in the work place and is an Equal Opportunity Employer."}