{"jobID": "2767215835", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Product Manager, Growth", "companyRating": "3.2", "companyInfo": {"Website": "www.gsn.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Big Fish Games, DoubleDown Interactive, Zynga"}, "estimatedSalary": "123000", "jobDescription": "GSN Games, the leading developer in mobile and social games, is seeking a Senior Product Manager with a passion for optimizing user acquisition of world-class mobile games to join our casual games studio based in Palo Alto and San Francisco. About the GSN Casual Games Studio: Our studio consists of a talented group of game artists, designers, engineers, product people and marketers who craft industry-leading mobile games providing very high quality experiences. This studio is the home of Solitaire Tripeaks by GSN, the #1 revenue solitaire game on mobile that has quickly grown into one of the top grossing games on both iOS and Android. What You’ll Do: As a key member of our studio’s Performance Marketing team, your interest and success will be growth of our most valuable players, and all the ways we might acquire them - including traditional UA, but also platform feature opportunities, international, viral flows, ASO, and in-game improvements - whatever can be identified and prioritized as the best opportunities for growing our payer base.  You’ll drive analysis, modeling and strategies around new players for our studio’s games, and inform the strategy framework for our studio’s User Acquisition team to do their thing. You’ll also provide the focus, processes and market knowledge to ensure that our UA efforts have clear goals that are aligned with our early player experiences, clearly communicated throughout the studio and organization, and embody a culture of learning and improving. This is a unique opportunity to be the primary driver in evolving a multi-million dollar per month growth strategy for one of the fastest growing games at scale in the app store.  Our ideal candidate has intensive, hands-on experience doing user acquisition at volume, with experience at an agency - or even better, a high-performing game company - that spends millions of dollars a month per product, but now you’re looking to use your experience to have an impact on setting priorities, identifying the right goals and helping ensure both our UA and product teams are going the right direction. You know how to use your instincts to get to the best jumping-off point, but you’ve learned to embrace data that tells you what’s *really* effective. Responsibilities include:Propose, evaluate, lead and iterate growth and acquisition strategies.Review data and leverage analytics to find new opportunities outside and inside the game to maximize our player growth.Build plans and models that reconcile UA worldviews (ROI, CPP) with game ops worldviews (installs, ARPPU) through LTVIdentify important analytics ideas, opportunities & plans and then partner with Studio Analysts, GSN’s centralized Data & Analytics team and external contractors (where appropriate) to provide key data about adding value through segmenting and targetingDrive a continual process of reviewing and updating our modeling based on market trends in order to optimize our spending strategy and help set UA targets.Partner with UA team to monitor industry and market trends in order to ensure our growth & UA strategies are best of breed and adapted for our games, goals and strategies.About You:5+ years user acquisition experience at a top agency, in-house agency or similar1+ years managing the work of other ad buyersPersuasive and logical verbal & written communication skillsStrong Excel and conceptual modeling skillsPassion for inspiring and shepherding teams to do their best work.An ability to be flexible and thrive in a collaborative, agile environmentStrategic thinking and a willingness to embrace change and failure for learningStrong portfolio that demonstrates UA work across different channels, including:Facebook, Google and associated buyersAd Networks & DSPs, Playables, etc.Familiarity with data tools, such as Tableau, SQL or other ways to digest dataLike everyone on our small and efficient team, you can set direction and goals strategically, but like getting your hands dirty bringing plans to life.When work gets out of hand, you think first about how to improve the tool set, not expanding headcount.Bonus Points!Experience in UA for world-class social/casual games a huge plus.About Us: GSN Games delivers social casino and skill-based games designed to fuel every player’s inner winner. Founded in 1999, the company has evolved into one of the world’s top game publishers and creators. Its collection of social casino games includes GSN Casino and Bingo Bash, both top 10 grossing iPad apps, as well as Wheel of Fortune Slots: The Ultimate Collection, Solitaire TriPeaks, Mirrorball Slots, Fresh Deck Poker and more. GSN Games also features WorldWinner.com and the WorldWinner app, where players can compete for real money in skill-adapted versions of the biggest game franchises of all time. Owned by Sony Pictures Entertainment and AT&T; Entertainment Group, GSN Games operates eight locations worldwide across Boston, San Francisco, Palo Alto, Washington, D.C., London, Barcelona, Bengaluru and Zaporozhye, Ukraine. Connect with us on Twitter @insidegsngames, on Instagram @gsngames and on LinkedIn at https://www.linkedin.com/company/gsn."}