{"jobID": "2707948171", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analytics Consultant", "companyRating": "4.0", "companyInfo": {"Website": "www.catapultsystems.com", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Slalom, Hitachi Consulting, Avanade"}, "estimatedSalary": "82000", "jobDescription": " High performing team members. Challenging projects. A stable and profitable company. And a great place to work! This is what you can expect if you join the Catapult Systems team. Founded in 1993 and headquartered in Austin, Texas, Catapult is an award winning Microsoft National Solution Provider (NSP) and was recently named a 2017 Partner of the Year Finalist in Cloud Productivity and the 2016 Microsoft Partner of the Year (U.S.).  It is a very exciting time of growth for Catapult, and we are currently hiring a Data Analytics Consultant with experience using Power BI and Azure Data Services. This person will provide technical delivery of data analytics work products for our expanding team in our Gulf Coast regional business unit (Central/South Texas and Louisiana). The person in this position will work with highly experienced technical leaders and will have the opportunity to learn and grow.  What do we attribute our award-winning success to? The people we hire, of course! We provide you the tools and leadership that you need to be successful, and then let you do what you do best. We enable you to make the decisions that you feel are in the best interest of our clients, and we trust your judgment. This type of ownership and independence, and an ongoing commitment to solving real business problems through the innovative use of Microsoft technologies, has resulted in Catapult being voted one of the best places to work year after year!What will my role be? As an Analytics Consultant you will work with customers to identify opportunities and scenarios where Power BI and Azure Data Services can benefit their business. You will deliver short and long term Data Analytics projects utilizing strong business, technical and data modeling skills. Responsibilities include:  • Facilitating client meetings and strategy sessions Working with customers to analyze business requirements and defining functional specificationsBuilding dashboards and reports based on business needs using the Microsoft tool setSupporting sales by attending sales calls and creating demos for customersPreparing project timelines, milestones and deliverables for Data Analytics projectsWhats required? • First and foremost, you should enjoy what you do and have a great attitude! Ability to engage in customer settings and discern client business needsUnderstanding of and familiarity with Agile delivery methodologies; bonus: experience applying them to Data Analytics projects Desire to work in a team environment and ability to work across organization functional boundariesExcellent analysis and design skillsExcellent presentation, verbal and written communication, and time management skillsStrong working knowledge and track record of Business Intelligence consultingIdeal technical capabilities:"}