{"jobID": "2722307142", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead UX Designer, Marketing Domain", "companyRating": null, "companyInfo": {"Website": "www.vitamintalent.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Aquent's retail giant client is seeking a passionate, team-oriented Lead UX Designer, Marketing to join its Customer Experience organization to play a leading role in shaping the user experience design for Marketing. The Lead UX Designer, Marketing will play a leading role in defining the experience roadmap for features and functionalities, and realize strategic vision through the conceptualization and design of engaging user experiences.  Candidates should have a minimum of 7 years of experience designing across digital channels. Strong candidates will have a proven track record of leading and delivering elegant, world-class designs in a fast paced collaborative team environment, solving business goals and user needs, leading and influencing in a cross-functional context, and leveraging research and data driven decision making to inform the design of  the experience. In addition to being an individual contributor, the Lead UX Designer, Marketing will mentor Senior UX Designers, UX Designers, and Associate UX Designers, and guide their efforts to align with Macy’s strategic vision. This position reports to the Manager of User Experience Design, Marketing. What you will do!Designs current and future domain user experience that meets long term and near term business goals and user needs (e.g. KPI’s and user success metrics).Effectively collaborates with managers, product managers, engineers, and researchers to define, conceptualize, and design user-facing products.Partners with the UX leadership team to define the domain experience and to ensure deliverables are consistent with the user experience design vision.Designs across web, mobile apps, and in-store environments, ensuring a consistent user experience across different platforms.Works through Marketing design problems from beginning to end: conceptualizes new products and features, designs storyboards, workflows, interactions, wireframes, high fidelity mockups, and design standards based on business goals and user research.Champions user experience design throughout the organization and contributes to making it an essential process for improvement and innovation.Serves as a subject matter expert and thought leader on user experience design for Marketing.Mentors user experience designers across the department.What you have!Minimum 7 years UX/UI design experience across consumer mobile applications, websites, or retail stores.BA/BS in Design Required, preferably in UX related fields of HCI, Industrial Design, Product Design, Architecture or Graphic Design. Masters degree preferred.Advanced thought leadership and UX design vision skills, including advanced analytical, strategic, and conceptual design skills.Deep knowledge designing for mobile apps and responsive web experiences; well versed in user interface design processes and methodology, including user-centered design.Strong ability to identify business goals, and capable of designing user experiences that support business goals and user needs.Advanced ability to design high-fidelity mockups and prototypes, and iterate on user interface design and interaction flow of applications and experiences based on user feedback.Strong ability to leverage metrics, optimization, and qualitative and quantitative research to inform and validate design decisions.Strong verbal and written communicator with all levels of business leaders; ability to influence and cultivate strong relationships with key business stakeholders in the organization.Solid negotiation skills across a variety of audiences; can successfully advocate solutions among peers and to executive leadership.Ability to inspire, develop, and coach team members.Solid time management and prioritization skills; ability to manage multiple projects simultaneously, at various stages of their development.Must have a strong user experience design portfolio that clearly demonstrates consumer oriented user experience design solutions for complex problems.% Essential Functions60% - Development and execution of UX design vision and deliverables within your assigned channel 20% - Strategic thinking, developing POVs and UX design vision 10% - Collaboration & communication with all projects and initiatives to ensure consistency and clarity 5% - Monitor and evaluate UX deliverables of UX design team members, development of team members 5% - Personal development"}