{"jobID": "2674911985", "jobLocation": "Washington_DC", "jobTitle": "Electronics Engineer - active Top Secret clearance required", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Clearance Level Must Currently Possess:Top SecretClearance Level Must Be Able to Obtain:Top Secret SCISuitability:Yankee WhiteJob Family:Engineering & SciencesJob Description: CSRA is looking for a highly cleared Electronics Maintenance Professional who is skilled with audio visual components to join our team in Washington, DC.  Installs, troubleshoots, repairs, and performs preventive maintenance on audiovisual equipment (amplifiers, equalizers, teleprompters, lighting systems, video display devices, and sound reinforcement equipment) utilized in worldwide broadcast events, ensuring equipment is fully mission capable in a zero defect environment.  Responsible for the installation, troubleshooting, repair, and preventive maintenance of a broad range of audio and video equipment and services including automated control systems, video distribution systems, display technologies, sound amplification and distribution equipment, television and live event lighting equipment.  REQUIRED QUALIFICATION: CompTia Security+.  DESIRED QUALIFICATIONS: BS in an IT related field + 2 yrs related experience, or MS + 0 yrs experience.  OTHER QUALIFICATIONS:  Top Secret security clearance with SCI eligibility required with eligibility for Yankee White  #cjobs #dicepost #gdjobs # of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Telecommuting Not AllowedWork Location:USA DC Washington - Not Applicable (DCC076)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}