{"jobID": "2720740568", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.truecar.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (TRUE) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Edmunds.com, Autotrader, Cars.com"}, "estimatedSalary": "137000", "jobDescription": " Job Description:ALG has been the industry leader in forecasting residual values, the amount of retained value a vehicle will have at a future date, for over 50 years. Every automotive manufacturer and most of the top leasing institutions in North America utilize our forecasts. The data science team at ALG is responsible for building, maintaining and demystifying the prediction algorithms that power these residual value forecasts leveraged so heavily throughout the automotive industry.  Our team is accountable for every data point we output and strives to provide industry-leading analytics that are accurate and accessible. Right now, we’re looking for a Data Scientist who will have the freedom to utilize the latest technologies to solve challenging problems, create innovative machine learning processes from the ground up and develop the tools for monitoring them. We are a mature and tight-knit data science team looking to add another top-shelf team member ready to make a difference in the automotive industry. Join us! ABOUT THE JOB:Daily emersion in automotive industry dataBuild, maintain and iterate on production level machine learning algorithmsCollaborate closely with technology and engineering teams to improve existing processes and build out new onesWork with product team to research and develop the analytics that will power new productsCreate visual reports in Tableau for internal and external clients that summarize findingsTeam environment that encourages sharing of ideas to build the best predictive algorithmsAd-hoc data analysis and reportingWHAT YOU NEED:Enthusiasm for the automotive industryCuriosity and passion for solving problems with dataExperience building production algorithm monitoring systems and pipelinesAbility to communicate complex ideas to any audience, ranging from teammates to business executives1+ years of professional experience working with large datasets1+ years of professional experience with statistical programming software (Spark, R, Python preferred)1+ years of professional experience with database software (RedShift, Hive, SQL, MYSQL)Master’s Degree in Statistics, Data Science, Economics, or related fieldNICE TO HAVE:Experience with automotive market dataExperience building data pipelines in AWSSome shareable examples of data visualizations you have createdExperience deploying machine learning models into production with an APIPhD in Statistics, Data Science, Economics, or related field Location(s):Santa Monica Offices"}