{"jobID": "2721146082", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.eventbrite.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Ticketmaster, Live Nation Entertainment"}, "estimatedSalary": "106000", "jobDescription": "THE CHALLENGEThe Data Insights team works day-in and day-out to solve complex problems, build innovative models and support data-informed decision making and transparency at Eventbrite. We are committed to dedicating the same intensity to our organizers, helping them to drive their business forward with insightful data and analytics. As Eventbrite continues to grow, the types of questions we ask and the data we look at also grows, requiring us to work better and smarter. The successful candidate will be a creative self-starters who has no problem tackling unstructured problems with a lot of independence and can clearly articulate the insights to the business to drive impact.THE TEAMThe business decisions we make as our business grows and evolves are guided by careful analysis and compelling insights from our core analytics and data science team. We sit in a strategic role under the CFO organization, working to make sense of our structured and unstructured customer data with sophisticated models and data mining techniques, in-depth analyses that inform business strategy and help the company make data driven decisions, and analytics support for our organizers.THE ROLEWe are looking for a senior analyst to work with the many facets of business to help establish standards and best practices for analytics throughout the company. You will serve as a data expert to the finance organization, gather data from various sources, govern the organizations key performance indicators and metrics, and build automated reporting to democratize data across the company. You will provide insightful analyses to identify opportunities and explain trends, offer analytical frameworks for decision makers, maintain close partnerships with the leaders across the organization to provide them with pertinent insights. We are looking for someone who thrives in a high autonomy environment, provides mentorship to junior members of the team, and is eager to hone their analytical thinking while building an understanding of our business inside and out.THE SKILL SETBachelors degree in CS, Mathematics, Economics, Financial engineering, or any technical field2 - 4 years of industry experience in analytics and/or data miningSolid understanding of statistics and modeling techniquesAdvanced SQL querying skillsExperience doing data validation with large quantities of raw, disorganized dataExperience using R and/or Python for modeling and data manipulationExperience using Tableau and/or other BI tools for visualizationsAnalytical mindset -- you are critical, quantitative, inquisitive and insightfulBusiness sense -- you can identifying opportunities where we can apply analytics and data miningtechniques to solve difficult business problemsEntrepreneurial in nature -- you are detail-oriented, adaptable, and have an eye for optimizationCompelling communicator - you are able to get communicate to non-technical audiences, to persuade others to accept your ideas, and to collaborate with cross-functional teamsActive Eventbrite user with a passion for live eventsABOUT EVENTBRITEEventbrite is the worlds largest ticketing and event technology platform, powering millions of live experiences around the globe. We build technology that allows anyone to create, share, find and attend events of all kinds. Music festivals, marathons, conferences, hackathons, political rallies, fundraisers, gaming competitions you name it, we power it. Meet some of the team.IS THIS ROLE NOT AN EXACT FIT?Sign up to keep in touch and well let you know when we have new positions on our team.Eventbrite is a proud equal opportunity/affirmative action employer supporting workforce diversity. We do not discriminate based upon race, ethnicity, ancestry, citizenship status, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), marital status, registered domestic partner status, caregiver status, sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, genetic information, military or veteran status, mental or physical disability, political affiliation, status as a victim of domestic violence, assault or stalking, or other applicable legally protected characteristics.FLSA Status: ExemptPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction recordsApplicant Privacy Notice"}