{"jobID": "2835291182", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Java, PL/SQL, Unstructured Data Consultant", "companyRating": null, "companyInfo": {"Website": "www.etechnovision.com", "Headquarters": "Clark, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our direct client is looking for a Senior Java, PL/SQL, Unstructured Data Consultant for a Contract in Santa Monica, CA Job Description: The Lead Developer will work on tasks related to the design, development and implementation of our structured and unstructured data development tasks relative to the strategic projects in Client's Data Services related to our growth business in fixed income analytics content. We leverage the best-in-breed software tools and development practices. Skill Matrix:Applied work experience designing, developing and implementing various large scale data models in Oracle 12g PL/SQL as well as distributed data stores (e.g. Kafka, Cassandra, MongoDB, Hadoop, Exadata, etc. - Required - 7 YearsApplied work experience developing OO solutions using Java, with familiarity of Core Java 8, Collections, Multi-threading, ORM tools(e.g. Hibernate), REST, JSON, and XML - Required - 7 YearsApplied experience designing, developing and implementing relational data models, including data modeling tools, normalization strategies, optimization techniques, and data loading strategies - RequiredApplied experience designing, developing and implementing distributed data models, including data modeling tools, optimization techniques, and data loading strategies - RequiredExpertise in modern full software development lifecycle practices, including testing and build strategies frameworks using JUnit, Jenkins, or equivalent - RequiredExcellent communication skills - RequiredExperienced with SCM tools, e.g., Git, TFS - RequiredA team player who collaborates effectively with a distributed team of software engineers - RequiredSelf-starter, who is both disciplined and accountable for delivering accurate and timely results - RequiredThe successful candidate will be adaptable, results-focused and can work individually or as part of a team - RequiredTrack record of delivering quality and well-tested software - Must Have Location: Santa Monica, CA  Duration: 6 months + extensions  Please send your resumes to \"jobs at etechnovision dot com\" with A2708A in the subject for immediate consideration.- provided by Dice  Oracle 12g , PL/SQL, data stores, Hadoop, Core Java, JSON, TFS, SCM, JUnit, Jenkins"}