{"jobID": "2684585200", "jobLocation": "Emeryville_CA", "jobTitle": "Media Analytics Specialist", "companyRating": "4.3", "companyInfo": {"Website": "www.justmedia.com", "Headquarters": "Emeryville, CA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": " DescriptionJust Media is looking for those who are truly passionate about media and enjoy the challenge of learning a discipline that changes daily while working with great clients.  Just Media is more than just an agency. We’re friends and colleagues. That’s why people stay for years and even come back after working elsewhere. It’s why people look forward to our annual agency retreat and our annual holiday party, a legendary industry event and our way of giving thanks to our media partner community.  It’s also why we’d love to have you join us for some admittedly ridiculous extracurricular activities. So please bring your sense of the absurd, your palate and thirst for Friday Beer O’Clock, featuring Just Ale, the agency’s own Belgian Tripel brewed by resident Brew Master Patrick Fenton, your fastest trigger finger for Nerf Gun Wars, and other tomfoolery.  Just Media’s Emeryville, CA office is hiring an eager, self-motivated Media Analytics Specialist who enjoys multi-tasking, and has the ability to think laterally, quickly, and independently.  The Media Analytics Specialist role includes setting up digital advertising campaigns, working with clients to set up methods of performance tracking, and to pull reports and analyze data to derive insights and optimizations to improve performance. Essential Responsibilities include, but are not limited to: • Produce and analyze daily, weekly, monthly campaign reports measuring effectiveness of media partners. Heavy Excel use! Upload client creative materials to ad server platform and perform quality assurance testing.Create digital advertising campaign structures in ad server platform.Sending necessary campaign materials to third party partners or internal teamsAnalyzing reports to pull insights into campaign performance, and communicating recommendations for campaign optimization.Working with client web teams to implement necessary tracking for campaign performance. Need to Haves:BS/BA degree1+ years of experience in online advertising, specifically in ad operations.Demonstrated quantitative analytics skills. Ability to read numbers on a spreadsheet and understand what they mean.Excellent verbal and written communication skillsMost importantly: advanced proficiency in Excel. Excel is the lifeblood of the Analytics team. Please only consider this position if you are well-versed in Excel (including pivot tables and vlookups) and enjoy working with spreadsheets.Self-motivation and ability to thrive in a flexible, team-based environment. Ability to learn quicklyGoogle AdWords Certification (can be obtained after starting)Nice to Haves:Experience to site analytics platforms (Google Analytics, Adobe Analytics)Exposure to client-side technology platforms (Salesforce, Marketo, etc.)Any working knowledge of one or more of the following programming languages: Visual Basic, HTML, CSS, JavaScript, SQL, SAS, R. and Python Apply"}