{"jobID": "2829786667", "jobLocation": "Saint_Joseph_MI", "jobTitle": "Wealth Advisor", "companyRating": null, "companyInfo": {"Website": "www.rmbcap.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "RMB Capital Management, LLC is a rapidly growing Chicago-based investment advisory firm with over $9 billion in assets under management. We are seeking a Wealth Advisor to join our Wealth Management team in St. Joseph, Michigan. The Advisor will report to a Senior Wealth Manager and will have a solid understanding of wealth management practices and investment strategies. This is an exciting opportunity for a hard-working team player who wants to make an impact in a fast-paced, entrepreneurial environment.Key Functions:Provide comprehensive wealth management advice and customized planning strategies for high net worth clientsKnowledge on all aspects of RMB investment philosophy and strategyDiscuss investment performance, economic and market trendsDevelop, present, and implement client specific plansEvaluate and discuss client philanthropic goalsEstablish client investment objectives, risk tolerance and asset allocationDirect consultations with attorneys, accountants and other trusted advisors on insurance, tax and estate planningExecute client requests including cashiering, trading and custodial account documentationQualifications:Bachelor’s degreeCFP® designation5 years of experience servicing the needs of high net worth individuals and families with investable assets of at least $1 millionStrong personal computer skills including Microsoft Word and ExcelExcellent written and verbal communication skillsAttention to detail and strong organizational skillsStrong work ethic and able to prioritize multiple projectsAn entrepreneurial spirit and passion to serve clientsRMB Capital Management, LLC offers a competitive salary including incentive bonus, profit sharing, excellent benefits, and a dynamic work environment. Benefits include:Medical/Dental/Vision/Life/Disability Insurance401(k) and Profit Sharing PlanFlexible Spending AccountsSabbatical AwardsRMB Capital Management, LLC provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, RMB Capital Management, LLC complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, transfer, leaves of absence, compensation and training. "}