{"jobID": "2829706993", "jobLocation": "Plainsboro_NJ", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.canonrecruiting.com", "Headquarters": "Santa Clarita, CA", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Manage and Maintain customer RX Licenses daily.Perform research to determine adequate Rx licensure.  Efficient, accurate and timely recording of data in designated ERP applications.  Ensure all Audit and SOX rules are followed and adhered to.  Maintain/update process documentation and work instructions.  Provide feedback to department leadership as needed.  Perform other related duties as assigned by management.  The ability to act as an essential employee within the Customer Service Department. Education High school diploma / Associates Degree or higher Experience: Minimum 3 years of experience in Customer Service related role  Regulatory/Licensing experience preferred  Data Entry and Work Instruction creation experience  Previous experience in a manufacturing company and/or in the medical device and/or pharma industry preferred. Skills: Ability to speak, read and write English.  Outstanding communication skills, both verbal and written; ability to communicate effectively with customers, employees, management and cross-functionally for positive customer outcomes.  Demonstrated critical thinking, problem solving and analytical skills.  Sense of urgency and proven ability to work under pressure.  Attention to detail and strong organizational skills.  Must be able to give and welcome constructive feedback; contribute to building a positive team spirit and friendly and engaging work environment.  Ability to adapt to and embrace change.  Understanding of the Order to Cash process and related systems; Oracle, SalesForce.com, GHX, EDI, Movex. MS Office, MedPro experience desirable."}