{"jobID": "2555064790", "jobLocation": "San_Diego_CA", "jobTitle": "Machine Learning - Software Engineer / Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.braincorporation.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": " Brain Corp is a San Diego-based A.I. company that specializes in the development of self-driving technology. Our A.I. tech represents the next generation of artificial brains for robots - it enables machines to perceive, learn, and navigate complex environments, while avoiding people and obstacles. We partner with commercial equipment manufacturers, and global consumer electronics brands, to transform their products into self-driving robots.  We are looking for candidates with advanced knowledge in the fields of machine learning and adaptive data processing.  As a core member of our AI Division, you will work with our world-class team of engineers and scientists to build a platform for the next generation of intelligent machines. Your experience will be pivotal in advancing our mission: safe and reliable robots everywhere. Requirements: M.S. or Ph.D Degree in computer science, Software engineering or a related fieldStrong experience with classification and regression algorithmsStrong experience in machine learning techniques (unsupervised, supervised, reinforcement, demonstration) and optimization algorithmsStrong coding skills Python and C++ in Linux environmentExtensive experience converting publications to actual implementationsExtras that make the difference:2+ years experience (industry experience preferred)Experience in deep neural network packages (e.g. TensorFlow, Theano)Experience designing and developing robotic systems using a robotic middleware (such as ROS), and existing libraries and toolsTrack record of research excellence or/and experience converting publications to actual implementationsExperience with continuous integration, deployment and release management toolsExperience with Agile and Scrum methodologyProven system integration and software architecture skillsExperience launching products containing machine learning algorithms This position is located in our San Diego headquarters and reports to the VP of Engineering & AI"}