{"jobID": "2637261724", "jobLocation": "Washington_DC", "jobTitle": "Part-time Data Science Instructor", "companyRating": null, "companyInfo": {"Website": "www.datasociety.net", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Part Time Data Science Instructor : Join our team to create a revolutionary learning environment  Become a leader in the forefront of data science instruction as a dynamic educator and brand ambassador  The Company  Data Society is a rapidly growing, DC-based, EdTech startup. We are a dynamic, fast-paced team of data scientists and education experts who are shaking up the way data analytics is taught to professionals, and the way online education is delivered. We are a Forbes Top Ten EdTech Company to watch, Technical.ly DC Sciences Group of the Year, and have received awards for our work with the Commerce Data Academy.  The Position  The Data Science Instructor is the brand ambassador for our company and it is your responsibility not only to deliver dynamic lessons online and in person, but to also create an environment that is conducive to the success of every student. This includes delivering training while simultaneously helping compose the most intuitive and effective data science training experience on the web. Your position is key in communicating the students’ needs to leadership and instructional designers and maintaining a steady focus on opportunities to enhance the student experience. This is a part time position that requires a flexible schedule and ability to travel during the week.  Your responsibilities will include: Leading engaging and intuitive onsite and live-streaming trainings for a professional audienceSupporting students via email after trainingLearning of additional client needs through conversations with students and key client stakeholders Who We Are Looking For  You are a data scientist and are excited to pass on your knowledge and experience to a professional audience. You are passionate about STEM and believe in making high-quality, intuitive education accessible to all. You are passionate about helping students achieve their objectives, and want to have a part-time job where you interact with professionals and help them solve the challenges that they face. You are a dynamic speaker who is comfortable working in a professional environment, delivering trainings in front of senior staff in the federal government and Fortune 500 companies. You’re excited to be part of a hard working team and are willing to put in the extra effort to get the job done.  The Location  Data Society trainings are delivered onsite across the country or live-streaming from our offices in Chinatown, DC. Data Society covers travel expenses outside of the Washington, DC area or outside of the instructor’s homebase. Our home office is located in Chinatown, DC and is full of awesome perks like free food, coffee, beer, and a dog friendly environment.  Why You Should Apply  Highly competitive pay, dynamic environment, opportunity for growth and learning new skills. . As a growing business, we are seeking instructors who are excited to catalyze industries through empowering their workforce.  Ready to Join our Team?  Head over to our online application: datasociety.bamboohr.com/jobs/  Looking to join us as a full-time instructor? https://datasociety.bamboohr.com/jobs/view.php?id=21  At Data Society, we don’t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Data Society is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know.  To all recruitment agencies: Data Society does not accept agency resumes. Please do not forward resumes to our jobs alias, Data Society employees or any other company location. Data Society is not responsible for any fees related to unsolicited resumes."}