{"jobID": "2748893841", "jobLocation": "Washington_DC", "jobTitle": "Senior .Net Software Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "99000", "jobDescription": " Be part of something innovative and cutting edge. Join our team of more than a hundred software engineers, designers, project managers and software specialists that are smart, creative and excited by what they do. Some of our ground-breaking work includes: • advanced computer-adaptive algorithms (only one thats peer-approved in the country) • mobile support for the user interfaces • learning management systems with social media features • user interfaces that are universally accessible to people with or without disabilities • innovative, machine-scorable items The American Institutes for Research (AIR) is a leading professional services firm with a growing software engineering and product development team. We design and build things that are inspiring and make a real impact in the online testing industry.  The Senior Software Engineer (.NET) will be an integral part of the software engineering and product development team within AIR. This group of professionals provide custom software solutions for our clients as well as internal support systems. Much of the work we perform is new development, so the right candidate will have the skills needed to perform full life-cycle software development. This includes participation in requirements gathering, application and database design, system documentation, writing and unit-testing efficient code, and deployment.  REQUIRED QUALIFICATIONS: • B.S. and/or M.S. in Computer Science and 4 -10 years professional .NET software development experience • 4+ years experience utilizing C#, ASP.Net, Javascript and XML • SQL experience to include work with relational databases and writing SQL queries • Solid understanding of object oriented (OO) analysis and design principles and demonstrated proficiency/expert knowledge in OO design • Solid understanding of algorithms • Self-starting, independent thinker and worker • Excellent analytical skills • Highly detail-oriented • Good communication skills • Ability to work well on a team as well as independently PREFERRED QUALIFICATIONS: • M.S. in Computer Science • Training and experience in Artificial Intelligence • SQL Server 2008 and Transact-SQL • C++ • ASP • VB Script WP *LI-KS1  Position is located in Reston, VA"}