{"jobID": "2470177157", "jobLocation": "Universal_City_CA", "jobTitle": "23367 - Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.rgbsi.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Kelly Services, TEKsystems, Randstad US"}, "estimatedSalary": "57000", "jobDescription": " RGBSI, a leader in the staffing industry, is dedicated to provide highest quality of service to our clients and employees. We are proud to be the primary staffing partner to top companies in the automotive, aerospace, IT, media & entertainment, sports, energy, and finance industries. Because of our clients' continued growth, we are looking for an energetic professionals who enjoys working with people and to be a partner to leading US companies. Basic Qualifications:Minimum of 1 year data analysis experienceIntermediate experience with MS Excel and other MS Office productsDesired Characteristics:Bachelor's Degree Experience with SAPExperience with data reconciliation of big data setsAbility to create and modify MS Excel Pivots and FormulasDetail oriented Enthusiasm for solving problemsStrong analytical and quantitative skillsExcellent verbal and written communication skillsAbility to work with others and collaborate across the organization to achieve goalsFlexibility and an ability to work in a fast paced, deadline driven environmentJob Description:The Data Analysis Coordinator is responsible for data reconciliation of multiple data sources, managing the workflows between the global client operators and the billing team, and tracking the progress on all open credit items.Also responsible for data management and monthly billing reporting.Collaborate with Finance team, Billing team, 3rd party vendors and content operators to develop, execute and maintain updated billing workflows. We offer attractive, competitive compensation and benefits including, medical, dental, vision, paid time off, holidays, 401k, Short Term Disability, AD&D; and Tuition Reimbursement. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more."}