{"jobID": "2798180067", "jobLocation": "Washington_DC", "jobTitle": "Research Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.ncqa.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 1990", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " Research Scientist  Do you thrive in a fast-paced work environment? Do you have knowledge of healthcare quality? Would you like to be part of a dynamic team of individuals contributing to the improvement of healthcare? Then keep reading!  We Have: A top notch team of experts in the healthcare quality industryA competitive benefits packageAn open mind for new ideasCommitment to promoting from withinPart time telework after intro period You have: The drive to learn and perform at your best, the initiative to identify and solve problems A Doctoral degree in a field related to health care research, public health, epidemiology, biostatistics, or similar discipline, or equivalent training and experienceTwo years’ experience beyond your doctoral degree in research or quality improvement projectsAt least one publication in peer reviewed literature. Speaking/teaching experienceThe ability to operate in a collaborative environmentA problem-solving/solutions-oriented approachThe ability to multitask, work efficiently, supervise and prioritize, make decisions and function with modest supervisionWorking knowledge of statistical packages and Microsoft Office Suite You might also have: Five years of experience in research design, proposal preparation and management, and manuscript /report preparationAt least three publications in peer reviewed literature and/or independent fundingIn depth knowledge of quality measurement, health outcomes research, program evaluation, or quality improvement In this position you will: Lead and collaborate on the development of research grant and contract proposalsDirect the implementation of research grants, contracts and measure development projects, including working with the Institutional Review Board for all human subjects researchCollaborate with data scientists on methods and supervise analysts on quantitative and qualitative data collection and analysisManage project teamsDevelop and manage project budgets and timelinesPrepare scientific manuscripts and reports for broad stakeholder audiences If this sounds like YOU, apply now.  NCQA is a drug free workplace. NCQA recruits, hires, trains and promotes individuals, and administers any and all personnel actions, without regard to race, color, religion, national origin, age, sex, pregnancy, citizenship, familial status, disability status, veteran status, genetic information, or other protected statuses under applicable state and federal laws."}