{"jobID": "2635673298", "jobLocation": "Moffett_Field_CA", "jobTitle": "Pipeline Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.usra.edu", "Headquarters": "Columbia, MD", "Size": "501 to 1000 employees", "Founded": " 1969", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "133000", "jobDescription": " The Pipeline Scientist is responsible for processing and assessing the quality of the data obtained by facility science instruments on board the Stratospheric Observatory for Infrared Astronomy (SOFIA). After processing the data files, the Pipeline Scientist examines the data products generated by the pipelines to ensure that they are suitable for distribution to General Observers. The Pipeline Scientist documents the quality assurance assessment, derives calibration factors, applies the factors to the reduced data, ingests the calibrated data into the archive, and notifies observers that the data are available for downloading. Scientific research is an integral part of the Pipeline Scientist position and significant time will be made available for such work, preferably on topics relevant to SOFIA and its scientific mission. Essential Duties/Responsibilities:Inspect the product tree generated by automated pipelines, and run the data processing tools manually when necessary.Identify data/instrumental artifacts and carry out corrective measure to mitigate them (e.g., identify and exclude low-quality data from subsequent pipeline processing)Analyze products of the data processing from science observations to ensure the results are valid and not impacted by artifacts; document quality inspection results.Compare observations of calibration sources to model calculations to derive calibration factors; document quality of calibration; apply to the associated science observations.Verify the quality of calibration observations and the calibration productsGenerate documentation for each observation with disposition status and other relevant notes.Release files that are nominal / useable for the archive.Perform independent research in a field aligned with SOFIAEngage the scientific community in research work through research collaborations, visits, invited guests, workshops, conferences, etc. Additional Responsibilities: Ensure the protection of NASA and USRA intellectual property with respect to commercial and International Traffic in Arms Regulations (ITAR) and the Export Administration Regulations (EAR) concerns through disclosures, patent applications, and adherence to NASA’s scientific and technical information dissemination guidelines.Support efforts by USRA Management to ensure that USRA conducts its business operations in an effective, cost-competitive, and professional mannerComplete required trainings as scheduledRequired Qualifications:Must be qualified for a U.S. Government Public Trust clearance.Education:PhD in physics/astronomy, or a related fieldExperience:Minimum 4 years astronomical observational experienceExperience with Linux Operating System , IDL and python a plusLicenses, Certifications:n/aKnowledge, Skills & Abilities:Working knowledge in the application of software systems in the execution of scientific researchExcellent written and verbal communication in English is required, fluency in written and spoken German a plus.Teamwork and the ability to work effectively with co-workers, customers, and supervisor in a professional and courteous manner.Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals.Ability to write routine reports and correspondence, speak effectively before groups of customers or employees of organization.Ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume, ability to apply concepts of basic algebra and geometry.Ability to define problems, collect data, establish facts, and draw valid conclusions.Ability to interpret an extensive variety of technical instructions in and deal with several abstract and concrete variables.Working Conditions: This job primarily operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, etc. Extensive online usage. While performing the duties of this job, the employee is frequently required to stand; walk; sit, use hands. Keyboarding for large time spans each day will be a significant part of this position.  The job requires the ability to work onboard the SOFIA observatory, both on the ground and in flight. Some aspects of the job may require night-time work, away from the home base.  While performing the duties of this job, the employee may occasionally be exposed to fumes or airborne particles. The employee also may be exposed to moving equipment, vehicles and mechanical parts. The noise level in the work office environment is typically mild. The environment on the aircraft during flight operations may become noisy and tiring. The employee must be capable of performing all duties in a technical / scientific setting including offices, laboratories, shops, and aircraft maintenance facilities as well as on the aircraft / observatory, both while on the ground and during flights. The employee may need to lift and / or move up to 50 pounds."}