{"jobID": "2823271470", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist/Developer", "companyRating": "3.5", "companyInfo": {"Website": "www.abs-group.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1987", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "Data Scientist At ABS  Consulting, risk analysis is at our foundation. We are seeking an experienced  data scientist to help conceptualize and develop ground-breaking solutions for  internal and external clients bringing insight to data. ABS Consulting is a  global professional services company with 87 offices in 33 countries. Our  Global Government division, headquartered in Arlington, VA, deploys  cutting-edge technical expertise for federal agencies such as the Department of  Homeland Security, Department of Transportation, and Department of Interior. At  ABSC, you can transport the way agencies, quantify, analyze, and ultimately  reduce risk.  We are  looking for an experience data scientist to help develop ground-breaking  solutions for internal and external clients to translate data into insight.  The  successful candidate will have a demonstrated history of: Developing solutions to solve  complex business problemsConceptualizing linkages in data  and creating compelling visuals based on sound fundamentalsUsing data visualization  techniques to display and clearly communicate big data and technical  information in a manner that is clean, clear, understandable, and easily  communicated to non-technical audiences.Creative thinkingHelping drive business stakeholder  adoption of insight-driven decision making and business process innovationDemonstrated ability to analyze  and interpret complex problems or processes that span multiple-business areas,  identify and understand requirements, and develop solutionsMeeting deadlines in fast-paced,  goal-oriented environment Experience in one or more of the following areas is strongly  preferred: Coding in Python, MATLAB, R, SAS,  Ruby, STATA, PHPBusiness Intelligence Tools: Power  BI, Tableau, QlikFront end Development: C#, HTML,  CSS, JavaScript, and associated librariesDatabases: SQL Server, Oracle,  MySQL, PostgreSQL, MS AccessNoSQL databases: MEAN (including MongoDB),  ApacheCloud-based computing  environments: Amazon AWS, Microsoft AzureCoding innovative data  visualizations: D3.js, Google Charts, FusionCharts, etc.Machine Learning techniques and  algorithmsETL process for structured and  unstructured data Education & Experience Requirements: 2-5 years of relevant professional  experience in a highly analytical fieldBachelor’s degree in Computer  Science, Engineering, Applied Mathematics, Data Analytics, Statistics, or  related technical fieldMust be able to  obtain and maintain SECRET level clearance EOE  including disability/veteran.  - Company: ABS Group#LI-DNP"}