{"jobID": "2776634747", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ranker.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Ranker Story: Ranker is a new form of entertainment publisher with a unique crowd-sourced element. Our editors publish ranked lists on topics as broad as The Best Movies Of All Time to things as specific as the 10 Totally Weird Stranger Things Fan Theories That Could Explain Everything. Our readers vote, edit, and re-rank the stories as they see fit. Founded in 2009, the company made a number of breakthroughs in the last 18 months which has led to explosive growth, now reaching close to 50MM users worldwide spending on average 5 minutes per visit – making Ranker the 3rds largest Entertainment site. Our business is driven primarily by programmatic advertising and is profitable.  Ranker is headquartered in LA and 80+ employees strong and growing. Overview Ranker is looking for an experienced data scientist/analyst who can lead all strategic data initiatives and provide guidance on internal algorithms. Our ideal candidate will have a solid foundation in research methods and statistics along with an ability to apply those methods in a real-world setting where questions may not be neatly framed. Finally, you will be responsible for spearheading all critical research projects across several key business units. You will play a key role in designing, prototyping, developing, and deploying data-driven insights and analysis. Requirements and QualificationsPhD or MS in Statistics, Computer Science, Computational Research or similar quantitative discipline.5+ years experienceAn inherent passion for telling a story with data, and using visualization tools to help unlock meaningful insightsExperience with quantitative analysisA solid understanding of statisticsDemonstrable experience in research methodologySome programming and scripting skills (SQL, PHP, R, Python, etc.)Some understanding of modern machine learning techniques (regression, classification, clustering, etc.)A demonstrated ability to understand the statistical basis of crowdsourcingAbility to interpret and communicate complex concepts clearly to non-technical team membersBuild and maintain dashboards reports and metricsResponsibilitiesTranslate business requirements into research components and data requirements.Provide detailed analysis to develop new insights and identify new sales, marketing and growth opportunitiesTransform complex analyses into compelling and easy to understand case studies and user storiesMaintain and improve upon existing models and tools for internal marketing and sales teams."}