{"jobID": "2832047725", "jobLocation": "Newark_NJ", "jobTitle": "Data Analyst - Level 2", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Position Summary – The Data Analyst II will be a part of the New Jersey Innovation Institute (NJII) Information Technology department and work on assigned projects within NJII.  The Data Analyst is primary areas of expertise will be to work as an analyst for NJII's quality reporting programs; such as: the Practice Transformation Network (PTN), the NJII Qualified Clinical Data Registry (QCDR), and the Merit-Based Incentive Payment System Registry (MIPS). The Data Analyst II will be responsible for the implementation, maintenance and coordinating the activities of data management, software data aggregation, analysis and reporting process. The Data Analyst II will leverage database technologies to acquire and transform the company's data into consistent data formats to power dashboards and reports.  The Data Analyst II role is responsible for both client-facing communications and consulting work on assigned service lines, as well as assigned projects relating to internal operations and NJII products and services. Person Reports To – Director of IT Operations Supervises – May supervise Project Assistants Essential Functions –Obtains and analyzes raw data from multiple sources to perform core job duties and to answer questions posed by internal or external customersPull and integrate data from disparate sources (e.g. cost and claims or clinical data)Analyze, evaluate, and document NJII program requirements and revisit requirements as program changes are made;Produce meeting materials, by working with senior staff to obtain appropriate project guidanceIdentify additional requirements by establishing personal rapport with potential and actual clients and with other stakeholders in a position to understand service requirements;Ensure that assigned projects adhere to a standard process, if appropriate;Provide consulting, education, and technical support directly to clients;Compiles and analyzes research data, interprets trends, fluctuations, and other changesManage and design the reporting environment, including data sources, security, and metadataLead and participate in the development of relevant tools and processes related to assigned projects;Analyze and report on project performance measuresWork directly with technical teams periodically as necessary to communicate business requirements and oversee requirements approval processAdditional Functions –Ensures issues found through QA testing are identified, tracked, reported on and resolved in a timely mannerServe as a team leader in ad-hoc workgroups or taskforces, when needed, and with guidance from senior staff and supervising managers to complete thorough and accurate assignments;Maintain documentation on project deliverables and technical release schedules, and communicate updates to the project teamSupport and mentor new staff and interns in project-related areas;Participate in interdepartmental or cross departmental activities, including providing program-specific expertise when needed. ·  Draft and distribute meeting minutes to NJII key contacts and clients  ·  Perform other duties as assigned by management Prerequisite Qualifications –1.Education/Degree Required – IT related Bachelor’s Degree at an accredited College or University required 2.Years of Experience Required - Minimum three (3) years of experience in the healthcare industry or quality-related job function as a data analyst. 3.Essential Characteristics Required –  ·  Intermediate knowledge of Microsoft Excel  ·  Intermediate Knowledge of SQL Queries  ·  Intermediate Knowledge of Microsoft Office Suite  ·  Analytical Skills: Data analysts work with large amounts of data: facts, figures, and number crunching. You will need to see through the data and analyze it to find conclusions.  ·  Critical Thinking: Data analysts must look at the numbers, trends, and data and come to new conclusions based on the findings.  ·  Familiar with new healthcare quality reporting regulations (e.g MIPS, MU Stage 3, CPC+)  ·  Requires effective communication skills, both verbal and written  ·  Ability to work directly with customers and clients autonomously Preferred Qualifications – ·  Well organized, critical thinker with ability to excel on a team  ·  Experience with Health Information Management or demonstrated knowledge of analysis methodology  ·  Conducts oneself at all times in an ambassadorial, committed and personable manner demonstrating respect for the position, fellow colleagues, departmental integrity and the university's best interests  ·  Ability to succeed managing multiple projects and priorities with tight deadlines  ·  Ability to use independent judgement and critical thinking effectively and consistently  ·  Willingly cooperates and works collaboratively with all staff to accomplish goals.  ·  Able to communicate effectively with clients and cross-functional teams verbally and in writing"}