{"jobID": "2767280226", "jobLocation": "Springfield_VA", "jobTitle": "Software Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.ensco.com", "Headquarters": "Falls Church, VA", "Size": "501 to 1000 employees", "Founded": " 1969", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Division Description  The National Security Solutions (NSS) Division provides security solutions for the United States government. NSS employees offer a multi-disciplinary approach to solve some of the most challenging technical problems in complex operational environments. Our areas of expertise are in sensor development and integration; chemical, biological and geophysical phenomenology; software applications and modeling; and operational applications of technology. Key customers include the Department of Homeland Security, the Department of Defense, and the Intelligence Community.  External Job Title  Software Engineer  Internal Job Title  Software Engineer  Kenexa Req #  1222  Job Type  Regular Full-time  Clearance Required  Secret  Clearance able to obtain  Secret  Job Description ENSCO's National Security Solutions (NSS) is seeking a Software Engineer to assist in our development of web-based applications for chemical, biological, radiological, nuclear, and explosive (CBRNE) threat detection. If you’re looking for an exciting career solving real-world problems in national security, this is your job! The successful candidate will perform a variety of software design and implementation tasks including ingest and management of large data streams, modeling and simulation, data visualization, and web-based user interfaces. The candidate will provide software development and/or support to software integration and software maintenance and sustainment tasks, including development of technical documentation as required. For this position, the candidate will be given direction from an ENSCO Sr. Software Engineer. This is a great learning opportunity and career booster! Job Requirements •Bachelor's Degree or equivalent; minimum 3 years' relevant experience •BS in Computer Science, Mathematics, Engineering or relevant field; or equivalent •Minimum 3 years of related experience including at least 3 years of programming experience with C#, Java or C++ •Strong analytical and exceptional problem-solving abilities •Excellent oral and written communication skills •Ability to work well as part of a team and be comfortable in a multi-tasking environment •MUST HAVE AN ACTIVE SECRET SECURITY CLEARANCE FOR WHICH YOU MUST BE A U.S. CITIZEN. YOU WILL NOT BE CONSIDERED FOR THIS POSITION IF YOU DO NOT MEET THIS REQUIREMENT Desired Skills •Experience programming the .NET framework and C# •Experience programming single page applications using Angular •Strong knowledge of Object Oriented Programming (OOP), design patterns, debugging techniques. •Experience with Atlassian JIRA, Confluence and source version control tools such as SVN or Git •Experience with relational databases, such as Oracle or MS SQL Server •Work well independently, with strong self-direction and initiative, as well as within a team structure. •Active Top Secret Security Clearance Education/Years of Experience  Bachelor's Degree or equivalent; minimum 3 years' relevant experience  Location  Springfield, VA 22151 US (Primary) Export Control and Licensing  None  U.S. Citizenship Required  Yes  Background Check  7-year  Drug Screen  None  Category  Software  ENSCO, Inc. and its wholly owned U.S. subsidiaries are equal opportunity/affirmative action employers, committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or protected veteran status, or any other protected characteristic under state or local law."}