{"jobID": "2814098570", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist I", "companyRating": null, "companyInfo": {"Website": "www.piecestech.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Data Scientist is responsible for developing advanced analytics, business intelligence, and artificial intelligence applications that enable knowledge discovery in health care organizations. Our goal is to use these findings to improve patient care quality, outcomes, and clinical decision making. This role directly supports internal business partners by providing practical analytics solutions for emerging product development, delivery, and client engagement requests. The responsibilities include the following: Responsibilities:Derive business insights from data, answer clinical questions using data science techniques, respond to on-demand requests for general business reports, support data analysis for new product design and development.Implement basic business intelligence techniques to answer business questions, such as performance analysis on models and products.Support the development of end-to-end artificial intelligence solutions.Participates in project preparation, exploring the scope, depth, and challenges of new projects, and formulating strategies and action plans.Responsible for data scoping, exploration, identification, extraction, cleaning, applying logics or other manipulation process, verifying data elements and constructing the database that is relevant of individual project.Performs complex data analysis to identify patterns, correlations, trends and anomalies in order to obtain insights into historical and future performance.Responsible for efforts in dissecting, designing, analyzing, developing, summarizing, and presenting predictive modeling, machine learning, and other advanced analytics solutions to key stakeholders.Takes initiatives to conduct in-depth assessment and selection of most appropriate methodologies for the project given its complexity, scope, and data structure for statistical analysis, overall descriptive statistics, exploratory data analyses, including graphs, schematic summaries, and necessary transformations and confirmatory data analyses, including statistical tests and/or modeling.Responsible for tracking project-specific issues from initiation through release. Independently identifies & troubleshoots problems encountered during the process. Responsible for preparation of data files and statistical reports for project release. Identifies systematic problems with data and software.Participates in formulating data/analytics core-related strategies, action plans, steps and training/development plans.Identifies ways to improve work processes and improve customer satisfaction. Engages in continuous improvement for outcome, accuracy, and efficiency. Makes recommendations to supervisor, implements, and monitors results as appropriate in support of the overall goals in product development.Stays abreast of the latest developments, advancements, and trends in the field of data analysis by attending seminars/workshops, reading professional journals, and actively participating in professional organizations. Integrates knowledge gained into current work practices.Maintains knowledge of applicable rules, regulations, policies, laws and guidelines that impact the assigned department. Develops effective internal controls designed to promote adherence with applicable laws, accreditation agency requirements, and federal, state, and private health plans. Seeks advice and guidance as needed to ensure proper understanding.Required SkillsAbility to self-manage, work independently and meet deadlines.Knowledge of machine learning, deep learning, informatics, and statistical methods, concepts, practices, procedures and their applications.Critical thinking skills.Team-based work and communication tools (Google Doc, Sheet, Atlassian, etc).Proficient with Linux and MacOS operating system.Proficient with programming languages including Python and SQL in performing data query, cleaning, manipulation, processing management and analysis is required. Required ExperienceEducation:Bachelor's degree in computer science, data science, statistics, applied math, informatics, or related field.Prefer a Master’s or higher degree in the related fieldPrefer data science, mathematical, statistical, or artificial intelligence courseworks at the advanced level.Experience:Two years of experience in analysis of healthcare or business related data and information systems.Research and development experience in predictive modeling, data mining, or other advanced analytics.Prefer experience working with clinical data for healthcare delivery organizations and/or healthcare applications.Experience with database development and ETL is a plus.Experience with Natural Language Processing is a plus. Job Location  Dallas, US-TX "}