{"jobID": "2769151112", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.launchcg.com", "Headquarters": "Bellevue, WA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": "Data Scientist Be a part of our success story. Launch offers talented and motivated people the opportunity to do the best work of their lives in a dynamic and growing company. Through competitive salaries, outstanding benefits, internal advancement opportunities, and recognized community involvement, you'll have the chance to create a career you can be proud of. Your new trajectory starts here at Launch.  We’re seeking a Data Scientist to participate in analytics projects involving machine learning, predictive models, and more. This role will work closely with Data Engineers to design and optimize pipelines, work with unstructured data, and perform a variety of other advanced analytics tasks as assigned. The candidate must be an experienced in data science with the ability to work effectively with or without direct supervision. Responsibilities:Develop, prototype, release, support, and maintain advanced analytics projects that apply machine learning, predictive models, natural language processing, clustering analysis, model evaluation and operational deploymentPresent and explain model justifications in a transparent, confident, and credible way that is easily understood by non-technical business clientsApply data mining, exploratory analysis, feature engineering and visualizations to discover patterns and insights within dataWork with unstructured data such as text, speech, or images to build AI enhanced classification systemsWork with Data Engineers to design and optimize data pipeline for data wrangling, processing, cleaning, and transformationsPerform other advanced analytics tasks as requested, prioritized, and scheduledRequired Experience/Qualifications:3+ years of experience in a Data Science roleA degree in Computer Science, Statistics, Finance, Informatics, Information Systems or another quantitative fieldAble to work efficiently, effectively, and decisively with or without direct supervisionDetail oriented with and ability to self-manage their own workload and timelines and escalating to their manager as neededAble to deliver advanced analytics products that meet client requirements and provide predictive and prescriptive productsExperience programming data science solutions: R, Python, Scala, Java, Jupyter NotebooksExperience with cloud-based machine learning systems: Azure ML, TensorFlow, Google Cloud ML, AWS MLExperience with visualization, dashboarding, and presentation tools: Tableau, Power BI, PowerPoint, Slidify Shiny AppsExperience creating reports, dashboards, infographics, visuals or other analytics productsExperience deriving insights from data using a variety of advanced analytical techniques including regression, classification, clustering, visualization, simulation, machine learning, natural language processing, and artificial intelligenceStrong analytic skills related to working with unstructured datasetsSupport the design of processes for data transformation, data pre-processing, data integration, and feature engineering and assist Data Engineers in building big data pipelineA successful history of analyzing and discovering value from large and complex datasetsSQL knowledge and experience working with relational databases, query authoring (SQL), and familiarity with a variety of databasesStrong project management and organizational skillsExcellent written and verbal communications skillsExperience supporting and working with cross-functional teams in a dynamic environmentOpen to travelBusiness Athletes: Launch looks for the same attributes we admire in top athletes and applies them to the business world: MASTERYCOMMITMENTFOCUSDETERMINATIONINTEGRITYTEAMWORKPOSITIVITYGOAL-ORIENTEDHEALTHY COMPETITIONGOOD SPORTS We interview for these traits above and beyond the technical skill set required for a particular role. Surrounding ourselves with Business Athletes leads to a competitive, fun, winning environment.  Qualified applicants, please respond to inquire@launchcg.com with your full name, resume, and a brief description of how your skills match the requirements above.  Please refer to Job #1879 when responding to this posting.  *Launch Consulting is a veteran-owned company and equal opportunity employer. Veterans encouraged to apply."}