{"jobID": "2819623805", "jobLocation": "Compton_CA", "jobTitle": "Data/Systems Analyst", "companyRating": null, "companyInfo": {"Website": "www.smseafood.com", "Headquarters": "Rancho Dominguez, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Agriculture & Forestry", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data/Systems Analyst $70k to $90k base plus great benefits and work environment! We are looking for a passionate Data/System Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. You will analyze requirements from various departments and business units and assist with designing technical solutions with heavy focus on transforming and analyzing data. You will also perform standard testing to ensure high levels of performance, data consistency, and security. You will spearhead our EDI initiatives. You will be joining a team who is passionate about IT solutions that bring significant value to the business. If you are interested in discovering and implementing new ways to unlock efficiency and business value, we would like to meet you. If hired, you will be responsible for the following:Build/Modify/Enhance Business Intelligence, Reporting, and ETL systems that focus on increasing business efficiency, responsiveness, and insights into trendsAssisting business users to access, analyze, and interpret data, analyzing results using statistical techniques where feasible and provide ongoing reportsAcquiring data from primary or secondary data sources, transforming when necessary, and maintaining databases/data systemsLiaising with users to document requirements and features that enable users to work more efficiently and better understand data relevant to their business areaExamining and evaluating current & future data/reporting systemsServe as Subject Matter Expert and primary resource for Electronic Data Interchange (EDI) projectsFilter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct problemsWork with management to prioritize business projects and information needsAssist with creation and maintenance of documentation related to data, reporting, and systemsEnsure that data and system best practices are represented in support scripts and incident management activities for use by IT help desk teamAssist with End User System Training sessionsAll candidates must have the following skills and experiences AT A MINIMUM, to apply for this position:2+ years proven work experience as a data analyst or system analyst or closely related position3+ years experience with BI/reporting packages (PowerBI, Cognos, SSRS, SSIS), databases (MS SQL 2005/2008/2012), and/or programming (XML, Javascript, or ETL frameworks)Technical expertise regarding data models, database design development, data mining and segmentation techniquesKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsHands on experience with software development & data projects and documentationAbility to explain technical detailsA good problem-solving attitudeExperience working with external vendors/partners to customize software applications and reportsExperience organizing workflows to accomplish complex business challengesAbility to quickly produce ad hoc analysis utilizing Microsoft ExcelAdvanced knowledge of MS Word, Excel, Visio, PowerPointExcellent organizational, time management and interpersonal skills; must work effectively with team members and management.Excellent oral and written communication skills. Attention to detail is critical.The perfect candidate will also have these skills and experiences:3+ years of process improvement and business systems experience1+ years managing or overseeing developing solutions involving one of more of the following:Html, CSS, SQL, Javascript, JQuery, Power BI C#, ASP .Net MVCStrong understanding of concepts governing SDLC, relational database and data warehouse structures, reporting / query tools.Familiarity with programming languages like Visual Basic, C++ and Java - C#, JavaScript, jQuery, Kendo UI or other JQuery libraries, SQLWorking knowledge of modern ERP, WMS, logistics, CRM, POS, PIM, e-commerce, electronic forms, and other related business systemsStrong meeting facilitation skills.BS in Mathematics, Economics, Computer Science, Information Management or Statistics Santa Monica Seafood is located in the Rancho Dominguez Technologyl Center and offers its employees a collegial work environment, competitive salaries, comprehensive benefits, including medical, dental, vision, life, disabiliy, and a 401(k) with generous employer match. Employees also enjoy a generous discount at our retail market/cafe/oyster bars and wholesale pricing on seafood purchases.  We are an Equal Opportunity Employer- provided by Dice  Business intelligence, IBM Cognos, Microsoft SSRS, Microsoft SSIS, SQL, XML, JavaScript, ETL architecture, Excel, SPSS, SAS, Microsoft Visio, PowerPoint, jQuery, C#, ASP.NET MVC, SDLC, C++, Kendo UI, jQuery Mobile, ERP, WMS, CRM, POS, PIM"}