{"jobID": "2574452228", "jobLocation": "Arlington_VA", "jobTitle": "Account Executive", "companyRating": "4.0", "companyInfo": {"Website": "www.symplicity.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Education", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " GradLeaders, Hobsons, StarRez"}, "estimatedSalary": "105000", "jobDescription": "Symplicity is currently seeking multiple Account Executives to manage Higher-education accounts in our East Coast and West Coast territories. The Account Executive (“AE”) is a field sales role that will be responsible for growing business with targeted clients. The AE is responsible for developing a territory plan, sales call strategy, and growing new lines of business. The successful candidate will effectively communicate Symplicity’s value proposition, strategies, services, and products to clients while selling Symplicity’s full portfolio of higher-education products. The Account Executive will work with multiple higher-educational institutions to meet the needs of our clients. For Symplicity, client satisfaction is paramount, and the AE will need to lead resolution of issues when necessary. The Account Executives will report directly to the Regional Vice President of their territory.Responsibilities Responsible for growing business with existing Symplicity clientsDemonstrate leadership building and managing teams in support of client opportunitiesProactively position a positive business outcome to the clients’ current business problemDrive and execute market and account management activities, qualifying and developing sales opportunities, leveraging specialty resources and partnersDrive vertical expertise within the segment and facilitate feedback to the product group and business operations on client requirements.Engage strategic partners for resources, fulfillment, and account managementContinuously analyze sales forecasts and appropriately modify based on outcomesQualifications 3-5 years’ relevant software sales experienceProven track record of meeting/exceeding sales quotas, and revenue targets; experience selling to Higher-education clientsDemonstrated ability to deliver practical business solutions based on enterprise understanding of the clients’s operational capability and total asset/value portfolioExperience tracking activities in CRM systemExtensive experience managing higher-education relationships in major accounts at a senior levelStrong business acumen with network of existing clients, partners and business contactsSymplicity is proud to be an equal and diverse Employer. EEO/AAP/M/F/Disabled/Veteran."}