{"jobID": "2744150420", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.iem.com", "Headquarters": "Research Triangle Park, NC", "Size": "201 to 500 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Booz Allen Hamilton, SAIC, Witt O'Brien's"}, "estimatedSalary": "102000", "jobDescription": " IEM is a global security consulting firm dedicated to building a safe, secure and resilient world. Founded in 1985, IEM works with government agencies and private sector organizations around the world. We are currently seeking a full-time Data Scientist Position to be located in the Washington DC metropolitan area.  The Data Scientist will be responsible for extracting features from streaming heterogenous sensor data for identifying chemical and biological (CB) threats through a software-platform. The early detection, warning and enhanced situational awareness capabilities of the platform are designed to assist the Warfighters across the entire spectrum of military combat operations under CB threat environments: initial planning of combat; during the combat; and post combat analysis. The heterogenous sensor data and the associated and/or relevant sources of structured and unstructured data/information sources (social media; news media; and international sources of disease data etc.) are to be integrated, fused, and analyzed using embedded analytics of this platform; the output of this software-based data integration and analytics platform will be customized to facilitate CB threats related situational awareness across a wide variety of users, disciplines, and geographic locations with the ultimate goal of providing timely support to war fighting decision making process.  The following activities are typical efforts expected to be performed while working as an integral part of a diverse project team consisting of software programmers, engineers and CB SMEs from a team of contractors:The selected candidate will support IEMs effort for developing a chemical and biological information integration prototype (CBIP); this prototype will be leveraging existing technologies and tools that are created to demonstrate similar disparate biological defense related data streams integration under a DTRA funded program. The selected candidate will extract and integrate complex streams of data from chemical and biological sensors for ingesting, storing, and analysis to demonstrate CBIP capabilities for early CB threat warnings through systematic anomaly detection process.The selected candidate will assist and/or build machine learning systems that monitor data flows and assist-in building software to automate the data ingestion, integration, analysis, anomaly detection and the resulting CB threats reporting processes for timely decision support.The candidate will work closely with the lead programmer and the CB SMEs in the required software systems design, engineering and testing.Required Skills and Experience:Data Extract, Transform and Load (ETL) Experience (5+ years)Experience working with large data sets and distributed computing toolsExperience with the application of data science to the dynamic and static streams of CB data is a plus.Python or Similar Programming Background (5+ years)Experience in applying statistical and machine learning algorithms on real data-application on CB data is a plusDeep knowledge and Database Experience (SQL) with in-database analytics knowledge is a plusQualifications:Masters or PhD in Computer Science, applied math and/or Engineering with 5 to 10 years experience in Data Science with processing and analysis of large data sets including streaming dataStrong understanding of Machine Learning Techniques and Cognitive Systems.Good written and verbal communication skillsMeticulous attention to detail with both visual and written productsYou must be a U.S. Citizen and should be qualified to obtain a DoD Security Clearance. Our work environment offers a unique balance of challenging projects and a high level of responsibility with respect for family and personal commitments. For more information about our company, please visit www.iem.com. IEM IS AN EQUAL OPPORTUNITY EMPLOYER"}