{"jobID": "2817126638", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": "84000", "jobDescription": " The Air Force Education and Training Command is creating a new Chief Data Officer function to help manage the learning experience for over 70,000 learners, educators, and administrators. Be a part of a technical support team who would build and manage a new learning services ecosystem that will help bring the command’s learning environment into the digital age. This would include engaging with educators and vendors to learn about needs and existing solutions, creating a new technical backbone for the command, and helping develop a modern data strategy that ties it all together. Working on this project is an opportunity to get in on the ground floor of an exciting new program and function that will only grow into other parts of the Air Force the future. It will also give team members a broad set of skills, experience, and understanding of learning solution providers and their technical architecture. Roles and Responsibilities: Consistently perform analysis and translate business needs to create high-quality Business Requirements and Functional Specifications documentation within specified time frames to solve most complex problems (multiple interfaces with other systems across multiple business units) considering all impacted components from an end-to-end perspective. Ensures end-to-end traceability of requirements is complete. Apply specific functional and/or business expertise to perform assigned tasks and develop specific project deliverables. Conduct impact analysis of technology changes on business processes and existing technology. Competent to work at the highest technical capacity on most phases of the business systems analysis. Contribute to the review of Test Planning and Test Execution strategies. Create the appropriate User-Interface Model(s) to support projects. Develop business workflow diagrams. Assist in the development of data models and interface design specifications. Documents, tracks, and resolves issues related to data quality. Contribute to the design and mapping of data conversion strategies. Participate in collaborative system and data design sessions with the user community, technical architecture resources, and development resources. Complete project activities on time and within budget, and proactively identifies and communicates issues that may jeopardize milestones or project budget to the Project Manager. Versed in strategic policy guidance and is familiar with the higher headquarter offices who develop government policy that effects the configuration of the Learning Services Ecosystem.Minimum/General Experience: 5 years of industry experience. Minimum Education: Bachelor’s Degree in associated discipline area.  ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce.  ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity)  For a listing of other career opportunities at ICF, please visit our Career Center at www.icf.com/careers/Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf"}