{"jobID": "2610610653", "jobLocation": "San_Francisco_CA", "jobTitle": "DevOps Software Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.taranawireless.com", "Headquarters": "Berkeley, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " This position will challenge you! As a DevOps Software Engineer, you will work closely with software and firmware engineers, QA engineers, RF engineers, and other stakeholders in a fast paced, cutting edge RF and systems lab. This job will entail both engineering and operation of sophisticated emulation software, design and control of custom and off the shelf RF equipment, test-automation, build automation, hardware management software and reporting software.  We expect that your have only a subset of the skills required to perform this job, but that you have some experience with both programming and system administration. Experience with wireless equipment is a bonus. We will train you to work on our team. Experience with Agile methodologies and Test-Driven Development a plus.  Here are the main things our team does: Design and maintain software and hardware systems for test and build automationDesign and maintain reporting softwareDesign and deploy outdoor RF networks for testing and demonstrationDesign and maintain software development and build environmentWork with software/firmware engineers, system engineers, RF engineers to design and automate testsDesired Skills and ExperienceBS or higher in Computer Science or Electrical Engineering3+ years experience in software development or system administration, with some experience with bothKnowledge, Skills and AbilitiesStrong skills in scripting languages (python, make, bash) requiredObject oriented programming skills requiredStrong skills in system programming languages (go, C, C++) a plusStrong understanding of Linux system administrationAbility to work with diverse hardware, third party software and in house software to create solutions: you should be a hackerPassionate and excited about working in a fast moving startup with lots of exciting projects and opportunities for growth"}