{"jobID": "2828375574", "jobLocation": "Los_Angeles_CA", "jobTitle": "Laboratory Scientist, santa Fe Springs, Los Angeles, Usa, 40 Hours Per Week", "companyRating": null, "companyInfo": {"Website": "www.sourcebioscience.com", "Headquarters": "Nottingham, United Kingdom", "Size": "51 to 200 employees", "Founded": " 1903", "Type": " Company - Public (SBS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Full Job Description can be obtained from the link \"******************************************************************************************  The description below may contain some unreadable words or sentences, so you are advised to visit the job link for further details. =================================== PDF DESCRIPTION ==================================Job Title: Laboratory Scientist Reporting to: Laboratory Supervisor Location: Source BioScience Inc, Santa Fe Springs, Los Angeles, USA Salary: $27,000 per annum Working Hours: 40 hours per week, Monday Friday. Flexible between 9am and 9pm  Source BioScience is an international genetic analysis, diagnostics, analytical testing and stability storage  business serving the global research and healthcare markets. We pride ourselves on a maintaining a  friendly working culture that gives driven individuals the environment to succeed in an ever-evolving and  developing organisation.  Our employees are committed, dedicated and thrive on the day-to-day challenges that working in a fastpaced, corporate environment brings.  We are seeking a suitably qualified scientist who will have some laboratory experience in molecular  biology techniques, and an eye for detail. Successful candidates are likely to be a recent graduate or may  have acquired appropriate experience within a laboratory and will understand the priniciples of  confidentiality and data protection. You will be responsible for extracting DNA, processing DNA samples  for sequencing, cloning as well as other research projects. Primarily this role will cover the overnight  sequencing service, so will usually be expected to finish at 9.00 pm. Candidates will also be expected to  cover within other departments within the facility when required.  Applicants should possess good interpersonal skills, meticulous record keeping and be conscientious and  reliable in their approach to work. DNA sequencing, genotyping/gene expression and robotics experience  would be an advantage, as would any experience of working in a service orientated industry.  This role is available immediately, so we are looking to interview suitable candidates as soon as possible.  Please do not apply for this position, unless you are fully able to demonstrate, within your resume, the  essential criteria we are seeking for this position.  If you wish to apply for this post, please forward a copy of your CV, including an email address  and contact numbers plus your salary expectation to: ******************************** ================================= PDF DESCRIPTION ENDS ================================"}