{"jobID": "2746940172", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Engineer", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is seeking talented Data Science Engineers with strong data-analysis experience to work closely with researchers, simulation, and live traders to identify and optimize critical bottlenecks in research and production trading. Data is the foundation of our client’s investment strategy and the effective management of data in its various forms is critical to maintaining the expansion of the firm. ResponsibilitiesYou’re day to day will involve applying statistical modelling techniques to a variety of large data sets with a view to generating trading opportunities. This will include defining, building and developing models to optimize market-data used for research and real-time decision-making. You will develop load scripts and support acquisition of simpler/more basic data sets, and own the ingestion process from data receipt through storage and mapping.You will be required to proactively problem solve and identify areas of improvement to guide development of industry leading tools, and develop enhancements to assist Quantitative researchers.An ability to analyze complex business/technical problems and make sound technical decisions proactively and in a self-directed manner will be essential.Mandatory Skills/ExperienceExperience in statistical modelling and data analytics.Experience with C++, Python, or similar programming skills and experience using scientific/analytic libraries.Strong understanding of data structures, algorithms, and architecture paradigms.The ambition to solve open-ended problems using analytical methods.Strong critical reasoning skills.Detail-oriented approach to solving problems.Strong communication and interpersonal skills applicable to a dynamic trading environment.Beneficial Skills/ExperienceExperience with large-scale financial data.Professional experience with multi-threaded application and low latency design and development.An understanding of financial markets and instrument types.EducationA Bachelor’s degree in Computer Science, Engineering, Physics, Mathematics or a related discipline. Master’s Degree preferred.Ideal CandidateThe ideal candidate will have a graduate’s degree in Computer Science, Engineering, Physics, Mathematics or a related discipline, with 0-2 years of experience in data science, ideally within finance. Experience with C++ and python is essential, as is a strong academic background.SalaryA market leading compensation package will be offered."}