{"jobID": "2616856196", "jobLocation": "Fremont_CA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.menswearhouse.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (MW) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "Business Title Data Scientist Job Category Information Technology (IT) Work Address Fremont, CA 94538 Job Status Full-Time Position Summary & Key Accountabilities  Tailored Brands, Inc.’s purpose is to help our customers love how they look. We accomplish this by providing a personal, convenient, one-of-a-kind shopping experience with compelling products and world-class service. We help fulfill this mission by providing our employees with an engaging and inclusive workplace focused on teamwork, growth and respect.  We are seeking a highly motivated and experienced Data Scientist to join our Business Insights team in our headquarters in Fremont, CA. Key Responsibilities:Research and develop methods for measuring and analyzing marketing spend effectivenessResearch new ways for modeling customer behaviorWork with Senior Data Scientist to design experiments to answer targeted questionsFormulate a roadmap of project activity that leads to measurable improvement in business performance metrics/key performance indicators over time.Conduct end-to-end analysis that includes data gathering and requirements specification, analysis, ongoing scaled deliverables and presentations.Work with Senior Data Scientist to architect, develop and automate analytics solutionsHelp formulate business recommendations (cost-benefit, invest-divest, forecasting, impact analysis) with effective presentations of findings at multiple levels of stakeholders through displays of quantitative informationDevelop comprehensive understanding of Tailored Brands data structures and metrics, advocating for changes where needed for both products and sales activityCreatively explore how to use data to continually add value and translate ad hoc questions into flexible methodologies that scale to answer broad problems across the organization Skills, Abilities, Experience & Qualifications"}