{"jobID": "2832365469", "jobLocation": "Parsippany_NJ", "jobTitle": "Data Scientist Co-Op with GAF", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with New Jersey Interviews but with GAF  Come Build Your Career Under OUR Roof Job Description:SUMMARY The data science coop will help GAF develop greater insights around customer behavior  and market conditions for all facets of its business. The coop will work with the data  scientist to develop predictive models and visualizations that inform GAF's go to market  programs and direct marketing campaigns. The position will also work across functional  departments to understand the various data sources and data structures in the course of  performing her duties. The position will also recommend improvements to methods of  using data and analytics techniques for measuring marketing campaigns productivity and  results. The Data Science Coop will assist in the investment review of new platforms,  apps, and solutions with a particular eye on the data structures and the integration of new  technologies into existing platforms. ESSENTIAL DUTIES Develop Data Science Solutions to Optimize Marketing Campaigns  Co-engineer and be responsible for advanced segmentation models (i.e., clustering, classification, other) that improve targeting of marketing campaigns.  Work in an administrative role with IT to integrate advanced segmentation models as solutions in platform systems (i.e., Marketing Automation and CRM).  Co-engineer and be responsible for digital and social media analytics using multi-variate models and Google Analytics.  Work in an administrative role with IT to facilitate a leads management program with integration between Marketing Automation and CRM platforms.  Co-engineer and be responsible for email suppression models to Minimize subscriber opt-outs (i.e., predict opt-out).  Work in an administrative role with IT to integrate email suppression models as a solution in Marketing Automation platform.  Co-develop campaign/customer trends and insight visualizations using Tableau.  Market Data  Co-engineer data acquisition strategies to meet aforementioned modeling requirements.  Help develop map of marketing and sales data sources and assure that these sources are optimized to work together.  Work in an administrative role with IT to warehouse targeted data feeds (i.e., public and proprietary databases, social, and web).  Work in an administrative role with IT to integrate 3rd Party data from existing marketing vendors, apps and others and include data in appropriate reporting.  Co-engineer and be responsible for industry forecasting models.  Corporate program Support  Work with the BI team and other departments to optimize and enhance GAF data structures related to marketing data science.  Work in an administrative role with IT to ensure that market data is always available, reliable and clean.  Perform ad-hoc duties as may be assigned. LEVEL BASED COMPETENCIES: Building Strategic Working Relationships  Business Acumen associated with Value Chains  Excellent written and verbal communication skills  Data Science and Analytics Domain Knowledge  Able to multi-task and has ability to work cross-functionally  Technical skills  ITIL Foundation Study (Certification preferred)  Basic knowledge of MuleSoft  Basic knowledge of Microsoft Dynamics  Basic knowledge of Oracle Eloqua and Compendium  Basic knowledge of SQL  Basic knowledge of Microsoft Project and Visio  Basic knowledge of Digital Asset Management and Content Management  Basic experience with large data sets and databases  Intermediate proficiency with Statistics  General knowledge/skills  Basic ability to present complex information in simple terms  Basic ability to draft queries of databases  Entry market knowledge of residential and commercial construction industry  Entry financial statement analysis  Intermediate project management skills  Education/Experience  Working towards Bachelors of Science in Data Analytics or Computer Science or StatisticsWe believe our employees are our greatest resource. We offer competitive salary, benefits, 401k, and vacation packages for all full time permanent positions. We are proud to be an equal opportunity workplace and GAF, SGI, and Siplast are proud to be affirmative action employers. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need that requires accommodation, please let us know. If applying for positions in the U.S., must be eligible to work in the U.S. without need for employer sponsored visa (work permit).  Associated topics: data administrator, data architect, data engineer, data integrity, data management, data warehousing, database administrator, etl, hbase, sybase  Apply"}