{"jobID": "2787476264", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.newrelic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (NEWR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AppDynamics, Datadog, Dynatrace"}, "estimatedSalary": "131000", "jobDescription": "New RelicSenior Data AnalystSan Francisco, CA Are you passionate about data and analytics and love addressing real business problems? Do you write SQL queries in your sleep? Can you think across various sources of data to produce reports and meaningful information using a variety of tools and platforms? If you answered yes, yes, and yes! ... we want to meet you!  We're looking for someone to join our Go-to-Market Operations team as a Senior Data Analyst. Your data insights will have broad visibility, impact, and will help engineer decisions that lead to business results. In addition to the production of regular reporting and ad hoc analyses, this role will have a seat at the data strategy table collaborating with other organizations to support a long-term data structure and governance initiative. Primary Responsibilities:Perform advanced analysis activities, including defining, measuring and communicating core operational metricsGathering business requirements and working cross-functionally with the IT team to ensure the data we need is being tracked and accurateProduce and automate weekly, monthly and quarterly reportingWork with leadership to prioritize business and information needsRecognize the common challenges with data collection and know how to addressBe the source of truth for reportingProvide training and documentation support on our data and reports/dashboardsSkills/Experience:3-5 years experience as a data analystExpert in SQL as well as having a strong technical acumen with data and database schemasExperience with business intelligence tools like Tableau as well as ExcelAbility to prioritize tasks efficiently and solve problems independentlyExcellent communication (written/verbal), presentation, and facilitation skillsEnergetic, personable, and comfortable working under tight deadlinesKnowledge of Salesforce.com terminology and reporting a plusBachelor Degree with quantitative focus or equivalent practical experiencePlease note, this position is not eligible for visa sponsorship. At New Relic, we hire people who are eager to contribute to our culture, and we empower them to do just that. We take pride in thinking beyond our day-to-day job descriptions and encourage you to actively seek out opportunities to create the type of work environment that you want to be a part of. What does this look like in action? You should be ready to be a “culture add” to New Relic and spend ~5% of your time finding meaningful ways to make this an even better place to work.  A little about us: New Relic provides the real-time insights that software-driven businesses need to innovate faster. New Relic’s cloud platform makes every aspect of modern software and infrastructure observable, so companies can find and fix problems faster, build high-performing DevOps teams, and speed up transformation projects. Learn why more than 50% of the Fortune 100 trust New Relic at newrelic.com.  New Relic is a San Francisco Best Places to Work award winner, an Oregon “Top Workplace” award winner, named a leader in the Gartner’s 2012, 2013, 2014, 2015 & 2016 “Magic Quadrant” for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) – the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high-quality teammates, a standard-setting product, and a company on the move.  Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up.  New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law.  Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.  #LI-BD1"}