{"jobID": "2487329157", "jobLocation": "Dallas_TX", "jobTitle": "Senior SQL Server – Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.halogroup.us", "Headquarters": "Detroit, MI", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior SQL Server – Data Analyst  Location: Dallas, Texas  The Senior SQL Server – Data Analyst will collaborate with business, reporting and other teams to understand business requirements and perform data analysis. Work with back-end data architects/systems engineers to construct data objects necessary for supporting these business requirements. Participate in data warehouse design, creation and monitoring to ensure that data is clean, accurate, available and complete. Analyze and create complex SQL and SSIS as needed to support new and evolving data integration projects and data extracts. Serve as subject matter expert within the team. Work under general supervision and report to Manager, Director or VP of department. Adhere to general work requirements.Serve as subject matter expert within the team and apply specialized knowledge to support the organization’s vision and directionDesign and support database and table structures for new and evolving sources of data being brought into the organizationCoordinate development of ETL/data warehouse best practices needed to support new and evolving sources of data used in reporting, transaction processing and analyticsPerform extensive and detailed data analysis necessary to ensure strict adherence to data quality guidelinesCreate and analyze complex SQL and SSIS as needed to support new and evolving data integration projects and data extractsParticipate in production support and code deployment after regular business hoursTake on end-to-end ownership and perform different roles as per the phase/requirement of tickets/projects assigned: Analysis phase – Requirements gathering, data analysis, documentation, source-to-target mapping, data/process flow diagramsDevelopment phase – Coding/development, unit testing. peer code reviews, code performance aspects, impact analysisSet/manage expectations with clients, provide proactive communication and status updates, prioritize deliverables with client/requestor, and follow and implement Change Control and release management processesRequired QualificationsBachelor’s degree in a related field5+ years of experience with SQL Server 2005/2008/2012 T-SQL coding2+ years of experience with SSIS5+ years of experience as a data analyst and/or SQL/SSIS developer3-4 years of experience working in the mortgage industryGood understanding of database modeling concepts, preferably in the context of mortgage industry (originations and/or servicing). Example – MISMO specificationsExperience using data warehouse with underlying SQL databases and/or analytical tools for business purposesKnowledge of key data warehousing and database processesGood verbal and written communication skillsAbility to provide outstanding customer service in fast-paced environmentsProficient working knowledge of computerized applications such as word processing, spreadsheet,database, presentation software, email and specialized business applications softwarePresentation skills necessary to effectively communicate, update, persuade and/or facilitatediscussions with all levels of managementInterpersonal skills necessary to establish and maintain effective working relationships with coworkers, other business areas and government agencies as requiredPlanning and organizational skills necessary to coordinate workload around multiple assignmentsAbility to read and interpret complex reports and documentsAbility toAssimilate and interpret various sources of data and provide and make decisions on recommendations to executive management to solve highly complex problems from start to finishThose authorized to work in the U.S. encouraged to apply. Unable to sponsor at this time."}