{"jobID": "2735207672", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Compliance Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.squareup.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Public (SQ) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Company DescriptionWe believe everyone should be able to participate and thrive in the economy. So we’re building tools that make commerce easier and more accessible to all. We started with a little white credit card reader but haven’t stopped there. Our new reader helps our sellers accept chip cards and NFC payments, and our Cash app lets people pay each other back instantly. We’re empowering the independent electrician to send invoices, setting up the favorite food truck with a delivery option, helping the ice cream shop pay its employees, and giving the burgeoning coffee chain capital for a second, third, and fourth location. Let’s shorten the distance between having an idea and making a living from it. We’re here to help sellers of all sizes start, run, and grow their business—and helping them grow their business is good business for everyone.Job DescriptionThe Compliance team at Square is looking for an extraordinary individual to join our team as a Senior Data Analyst. As part of the Compliance Product and Strategy Team, you will be responsible for driving the analysis for key decisions and insight across the compliance organization. You will build and automate actionable reporting for key Compliance processes, improving Compliance infrastructure and platforms.  You will: Build and automate actionable metrics reporting for key Compliance processesWork with engineering teams to understand the intricacies of legacy dataFacilitate internal Compliance data requests (build transaction monitoring signals, assure quality and data integrity for internal and external audits, provide analysis on operational metrics, etc.)Understand and maintain current infrastructure and seek improvements, where necessaryAssess and assist in planning short and long-term goals, policies, and initiatives for the Compliance Analytics Team QualificationsYou have: At least 2 years experience in an analytics role or equivalentExtensive experience with SQL (experience with Vertica a plus)B.A. or B.S. in quantitative field (i.e. Mathematics, Statistics, Economics, Computer Science, Engineering Sciences)Excellent oral and written communication skillsExperience working cross-functionally across all areas in a companyComfortable working with large data setsExceptional problem-solving skills Bonus: Experience in Looker, Airflow, Python, GitCompliance Experience a plusConsumer Financial Product/Payments/Fintech Experience a plusMachine learning, statistical modeling or data mining expertise Additional InformationAt Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance.I'm interested"}