{"jobID": "2834891057", "jobLocation": "San_Bruno_CA", "jobTitle": "Business Analyst, Data & Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.nielsen.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NLSN) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "Business Analyst, Data & Analytics - San Bruno, CA - 23272 Analytics - USA San Bruno, California  Have you ever walked down an aisle in your local Walmart and wondered why your favorite beverage or food product moved? At Nielsen, we work with retailers to help them understand their consumers, and to optimize their business down every aisle. On the Nielsen Retail Team you will work face-to- face with major retail players and use Nielsen solutions to help answer questions such as finding the right assortment and guiding pricing strategies. Every day brings a new challenge when working in the fast paced retail environment.  Be curious. Be collaborative. Be forward thinking. Join the Retail Team and work with our clients as a problem solver and the voice of Nielsen at our clients. When you join the Nielsen team, you’re signing up for an experience that requires flexibility, curiosity, and passion. As a Business Analyst you will:Work closely with Nielsen’s Walmart client service team to define information objectives and design appropriate analytic model solutionEnsure pro-active insights and action oriented solutions are delivered to clients on time and without errorsOwn the design, development, and maintenance of ongoing metrics analyses, dashboards, etc.Surface insights though polished visualizations to help guide critical business decision-makingMaintain an organized workflow and actively contribute to team knowledge baseEnsure data quality throughout all stages of acquisition and processing, including data collection, cleansing, normalization and transformationBackground and Technical SkillsProficiency in at least one scripting/statistical language (R or Python preferred)Experience building tools and automated processes to extract, clean, and distill dataComfortable writing Linux OS shell scriptsAdvanced SQL knowledge (iterative functions, using WITH statements, performance tuning, etc.)Familiarity with Jupyter Notebooks a plusGeneral SkillsStrong logic, deductive reasoning, problem solving and critical thinking skillsExperience tackling vague problems, transforming unframed problems into algorithmic solutions.Scrappiness and independent troubleshooting abilityDemonstrated mastery in data analysis & application to client business issuesStrong project management skillsAble to work collaboratively with internal and external teamsStrong sense of urgency and accountability to drive client outcomes2+ years of professional experienceThis role is located in the San Francisco Bay area in San Bruno, CA#LI-USAbout Nielsen: Nielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.  By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P; 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location: San Bruno,California Secondary Locations: , , , Travel: Yes, 5% of the Time"}