{"jobID": "2830473226", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ctstruenorth.com", "Headquarters": "Alexandria, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist  Do you want to be part of a highly specialized, dynamic team?  CTS is looking for a fully cleared Data Scientist. Responsibilities include, but not limited to Independently compile data to address simple-complex issues or problems for senior customers. Engage with customers to determine the nature of analytic problems, evaluate options, and offer recommendations for resolution. Identify and network with appropriate internal and external sources to gather and/or exchange data on specialized matters. Build and exploit databases and files. Advise customers on the methods and data needed and/or available to evaluate the problem. Collaborate with analysts to identify and close gaps on complex problems; devise creative data collection and analysis strategies to fill gaps. With minimal supervision, conceive, prepare, and communicate a wide range of strategic, highly complex graphics, computational models/tools, or written/oral assessments to internal and external customers and sponsors partners. Conceive and prepare thorough, well-argued and authoritative tactical and strategic analytic products summarizing the methods and results of data analyses. Play a key role in outreach efforts by collaborating with colleagues to develop customer-tailored products. Provide sophisticated briefings that clearly and concisely convey highly technical analytic projects. Prioritize and plan research and other projects; establish project goals. With minimal supervision, provide accurate, timely, complex and sophisticated data analysis in support of key mission priorities. Determine and employ the most appropriate research design for data collection and analysis. Process and refine large or complex data sets from various sources; utilizing computer programming, where necessary. Analyze, evaluate, and assess quantitative data (using statistical software, computer models, geospatial models, software languages, mathematical models) to contribute to or develop software tools, analytic models, or reports. Conduct statistical, mathematical, geospatial modeling or data-mining analysis in partnership with other Data Scientist or Analyst colleagues. Anticipate and project a wide range of possible outcomes using scenario/alternative analyses, agent based modeling, or other advanced analytic techniques. Identify, use, and/or develop methodologies and analytic tools to address existing or potential problems and collection strategies.  Location: Washington Metropolitan Area CLEARANCE REQUIREMENTS: Qualified candidates must have a current and active TS/SCI with polygraph clearance to be considered for this position. KNOWLEDGE, SKILLS, AND ABILITIES:Qualifications:Bachelors degree in a quantitative or technical field of study (e.g., Statistics, Mathematics, Computer Science, Physical Science, Quantitative Social Science).Demonstrated experience of appropriate analytic methods and methodological tools in the following areas Applied mathematics (e.g., probability and statistics, formal modeling, computational social sciences) Computer programming in one or more of the following languages SQL, C/C++, JAVA, Python, Perl One or more of the following Statistical Tools SAS, R, SPSS, Matlab, Mahout/MADlib, Stata One or more of the following Data Management Tools Hadoop tools, MapReduce, Pig, Hive, NoSQL, Tableau, Hbase.Demonstrated experience translating complex, technical findings into an easily understood narrative (i.e., tell a story with the data) in graphical, verbal, or written form.Desired Qualifications:Demonstrated experience or knowledge of Visualization (e.g., GIS/geospatial analysis, telemetry analysis).Demonstrated experience multitasking and changing focus quickly as demands change.Demonstrated experience working collaboratively and effectively in a team environment.Demonstrated experience establishing and maintaining internal and external professional networks/corporate reach back necessary to carry out tasks or projects. About Counter Threat Solutions (CTS): CTS is a Woman-Owned Service Disabled Veteran Owned Small Business (SDVOSB) consultancy to the Federal government with a focus on the Intelligence and Defense communities. We provide mission-savvy subject matter experts and deliver innovative solutions to our clients. As such, we seek people passionate about their career specialty and reward our team members with competitive pay and a comprehensive benefits package that includes 100% paid medical, dental and vision care premiums; a retirement plan with company match and immediate vesting; a generous annual training/tuition allowance; 6 weeks total paid time off; and performance-based merit increases and incentives. Our philosophy is simple: treat employees right, maximize job satisfaction, share the success. If you share our values, we invite you to join our dynamic, growing team. CTS is an Equal Opportunity Employer."}