{"jobID": "2796086167", "jobLocation": "Washington_DC", "jobTitle": ".Net Software Developer", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "72000", "jobDescription": "Job Description As an emerging authority, formulates and defines system scope and objectives for assigned projects. Establishes procedures to solve complex problems regarding system equipment capacity and limitations, operating time and output. Performs at an advanced technical level and has complete understanding of all phases of applications systems analysis and programming activities. As a team lead, directs, provides guidance, and monitors the performance of less experienced analyst/programmers. Responsible for quality assurance review of assigned projects.  Duties and Responsibilities: Responsible for program design, coding, testing, debugging and documentation and for all phases of applications systems analysis and programming.Formulates and defines system scope and objectives for assigned projects.Will be involved in System Upgrades - so a solid understanding of .NET framework is required.Prepares detailed specifications for programs.As a team lead, instructs, directs and checks the work of other Developers and programming personnel.Interfaces regularly with Government Management to Report Status, as well as to discuss and prioritize ProjectsAnalyzes and documents existing application systems to determine processing requirements.Identifies and designs applications system alternatives to achieve the needs of the customer's environment.Recommends application system design approaches and revisions to streamline programming and operation of the system.Identifies problem areas and recommends solutions and standards.Provides tier 3 Help Desk Support for supported applications.Able to assist other technical teams to recognize, diagnose, and resolve complex problems or potential conflicts between technologies within the HR IT environmentHas a good understanding of Accessibility (508 compliance) standards for Web Development.Has a thorough understanding of C#.NET, Ajax, JQuery.Has knowledge of JavaScript,XML, and WebServices.Knowledge of SQL Server 2008 and Oracle 11g Databases is a plus.Experience with code versioning tools such as MKS, Subversion, or Visual Source Safe. Required Qualifications: Typically requires bachelor's degree or equivalent, and seven to nine years of related experience. Clearance: SECRET Required Experience: 7+ years developing in C#.NET7+ years developing with JQuery, JavaScript and AJAX Certifications: MCTS Microsoft .NET Framework Certification Preferred Experience: 2+ years with SQL Server 2008 Database2+ years with Oracle 11g DatabaseCold Fusion version 10 or aboveJob Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}