{"jobID": "2629647688", "jobLocation": "Redding_CA", "jobTitle": "FNP/Nurse Practitioner- Primary Care", "companyRating": null, "companyInfo": {"Website": "www.npnow.com", "Headquarters": "Charleston, SC", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Growing healthcare group seeks a Family Nurse Practitioner/FNP to work in Family Medicine setting near Redding, CA area! Student Loan Repayment!Come work in a beautiful part of California!Group highly values NPs and gives them the full ability to deliver quality care over quantity. They have a high focus on patient outcomes and time spent with patients. Group experiences very low turnover with all their providersCompany: • Medical Center offering excellent patient centered health care by “physician-led” care teams. • For over 30 years, we have been committed to providing quality primary and preventive care, behavioral health care, and community outreach services to the residents and visitors of the area.  • We have established universal values by which to guide our activities, promising to hold these guidelines close and to guard and apply them in every aspect of our interaction with community, patients and each other. • Committed to promoting a positive, respectful attitude. • We are diligent to continue learning new, better and more efficient ways to provide healthcare. • Our goal is to excel in all areas of performance, including healthcare, fiscal management, operations and governance. Benefits and Features: • $105-115,000 a year in salary. Depending on years of experience • Excellent PTO and CME. • Paid medical, dental, vision, life insurance. • NHSC Loan RepaymentYour Role with the Company: • Mon-Friday. Can choose to work 4 or 5 days a week. • No weekend, call, holidays, or evenings • Will be seeing all ages. Provider must be comfortable see children • Will be seeing between 15-18 patients a day.Community Information: • In the northern part of the state, welcome to Redding, CA your outdoor adventure headquarters. With mountains all around, miles of hiking and biking trails, a river running through it, and national parks nearby, Redding is an outdoor paradise for young and old alike.  • Cradled by Mount Shasta and Mount Lassen, it offers 300 or more sunny days per year. A great place to escape the chill of spring and the gray days of winter. Let the good times flow with a visit to Whiskeytown National Recreation Area to kayak, sail, paddle board, or just float on your back.  • Redding is also home to the famous Sundial Bridge, world=class fishing.  • Head out on a day-trip to see the bubbling mud pots and boiling lakes in Lassen Volcanic National Park, or get refreshed by the waterfall at McArthur-Burney Falls Memorial State Park. This 129-foot gusher is considered one of the most beautiful in the state. Background Profile: • APRN (Advanced Practice) / ARNP / FNP/ Family Nurse Practitioner  • Ideal candidate has a Primary Care or Urgent Care background • CA licensed"}