{"jobID": "2622649529", "jobLocation": "Chicago_IL", "jobTitle": "Bioinformatics Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.tempus.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Passionate about making a difference in the world of cancer genomics?  With the advent of genomic sequencing, we can finally decode and process our genetic makeup. We now have more data than ever before but providers don't have the infrastructure or expertise to make sense of this data. We're on a mission to connect an entire ecosystem to redefine how genomic data is used in clinical settings.  We are seeking a highly motivated and capable bioinformatics scientist with extensive experience and interest in translational cancer research and genomics algorithm development. This position requires experience with scientific programming, relational data systems, algorithms development, and statistical modeling. Top candidates will also have experience deploying bioinformatics code within a clinical setting.  Duties and Responsibilities: Design and conduct analysis to improve variant calling, classification and analysis systems.Translate insight from model systems into predictors and classifiers of therapeutic response and prognosis in clinical cancer care.Collaborate with scientists, and clinicians to design and perform analyses on cancer clinical sequencing data in order to improve quality of care.Work in interdisciplinary groups of scientists, engineers, and product developers to translate research into clinically actionable insights for our clients.Develop algorithms used to gain insight into cancer variation through analysis of next generation sequencing dataProduce high quality and detailed documentation for all projects. Required Experience: Must have completed a Ph.D. in Cancer Biology or Molecular Biology related to cancer.Computational skills using R, Bioconductor, and/or Python. Ideal candidates will possess: Experience in cancer genetics, immunology, or molecular biologyExperience working with next-generation sequencing dataSelf-driven and works well in interdisciplinary teamsExperience with communicating insights and presenting concepts to a diverse audienceDemonstrated programming abilityBackground in predictive or prognostic algorithm developmentStrong background in the development of statistical models"}