{"jobID": "2687572754", "jobLocation": "Washington_DC", "jobTitle": "Data Center Optimization Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Responsible to provide expert level support in optimizing the infrastructure of the Core Enterprise Data Centers of the department, to achieve desired outcomes. Leveraging implemented Data Center Infrastructure Management (DCIM) Software tools for reporting and coordination with the Data Centers. Performs assessments, defines approach and supporting plans, and takes implementation of key processes and tools from original concept through final implementation. Coordinate and collaborate with customer leaders, both on-site and at the senior leadership level.  Position Requirements Act as a primary interface for providing research, recommendation, presentation and implementation of data center support systems solutionsEvaluate existing Data Center operating protocols and procedures, and recommend implementation strategies for optimal implementation of new toolsEstablish process to automate reporting using a combination of SW tools, and documented proceduresAutomate the measurement and evaluation of key data center activities, including but not limited to: Asset Management, Capacity Planning, Configuration Management, CMDB Integration, and ReportingOversee SW tool installation and configuration and submit/approve change management requestsCollaboration at all levels of support personnel, IT staff, contractors, department/agency representatives, leadershipSupport agency component organizations in facilitating transformation, optimization, and/or consolidation of their IT infrastructure and data center servicesPerform Project Management for enhancement implementations, and establish and maintain relevant documentation, as required Qualifications and Education/Certification Requirements Understanding of all aspects of Data Center operations, and the tools and protocols for managingWorking knowledge of monitoring the systems that support the Data Center environment and facilities -- ie: HVAC, electrical power, UPS, cabling, equipment enclosures (i.e. racks, closets, etc), security, server utilizationExperience in Information Technology, including IT metrics and KPI reportingProven Data Center analytical skills, monitoring and event managementEffective leadership skills to resolve conflicts and retain high morale across teams, including contractor teamsAbility to work both independently and in a collaborative client environment across matrixed teamsBachelor’s Degree in Computer Engineering, Computer Science, Management Information Systems, Business Administration, or the equivalent in experience Required Skills Experience with DCIM Software (i.e. Nlyte, Schneider Electric, Emerson, Modius, Rackwise, other)Microsoft Office ApplicationsProject Management Software (i.e. MS Project, Jira, Asana, other)Ability to obtain US Federal Government clearance; US citizenship/equivalent Desired Skills Nlyte DCIM Software experienceExperience with US Federal Government Mandates and Clients including knowledge of FDCCI, FITARA, FITARA/DCOI mandates for data center optimization and energy metrics, and OCIO Leadership functionsExperience as a Project Manager performing Data Center migrations and cross-organizational projects(s)Experience with vendor management, managing installation teams and familiar with industry standardsExperience with ITIL v3 and Agile methodologies, dashboards and audience relevant technical presentations"}