{"jobID": "2824665465", "jobLocation": "Foster_City_CA", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.quinstreet.com", "Headquarters": "Foster City, CA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Public (QNST) ", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Company Overview: Founded in 1999, QuinStreet, Inc. (QNST) is the leader in vertical media and marketing online, consistently delivering the right leads at the right volume to thousands of industry-leading clients and business brands. The company’s full-service approach combines direct marketing expertise, vast search and media reach, and industry-leading technologies to deliver dramatically improved results for clients. QuinStreet is headquartered in Foster City, CA, with satellite offices worldwide. Job Description: We are looking for an incredibly smart, dynamic and strategic Data Analyst to develop data-driven insights that enable QuinStreet’s Marketing and Media teams maximize profitability while improving customer relationships. This role will be concentrating on advancing the growth of a premium product which has already had significant success. You will use statistical methods to extract valuable insights from our data that further growth for the product and ROI for clients. This is a highly visible role within the company, which will come with direct interaction with our CTO and an opportunity to create a strong impact to the business. Responsibilities:Data diagnostics – extracting, scrubbing and patching very large sets of data together from a variety of internal and external sourcesReporting – summarizing data and automating reports around campaign performance, which will be utilized frequently in client interactionsForecasting – generating estimates for new and existing clients relating to site traffic, conversion and pricingCampaign Optimization – creating hypothesis tests and regression models to continuously calibrate campaign attributes to achieve maximum client spend and ROIEffectively communicating your insights and findings to other members of our Marketing and Media teams, as well as clientsQualifications:Bachelor's degree in quantitative major like Statistics, Mathematics, Operations Research, Physics, Computer Science or related2-4 years of experience in an analytical role, applying statistical methodsGood understanding of statistical methodsExperience with techniques and tools: hands-on experience with quantitative analysis tools like R or Python, proficient in SQL, experience with spreadsheet modelingGood communication skills: experience presenting and communicating effectively findings to colleagues and/or clientsOutstanding problem solving skills: you’re not just repeating a playbook, you’re looking at every problem with fresh eyes, and digging deep for insights and solutionsEqual Opportunity Employer: QuinStreet is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, national origin, pregnancy status, sex, age, marital status, disability, sexual orientation, gender identity, or any other characteristics protected by law."}