{"jobID": "2754543733", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst - Capital Markets", "companyRating": "3.5", "companyInfo": {"Website": "www.avisonyoung.com", "Headquarters": "Toronto, Canada", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Avison Young, a Canadian-based, global real estate solutions firm, is searching for a data analyst for the US Capital Markets Group. The group provides investment brokerage, advisory and investment banking services to private local, regional and national investors, corporations, institutions, fund managers, financial institutions and property developers. This person will be responsible for managing, researching, acquiring, manipulating and analyzing contact data to provide support to the Capital Markets team.Duties include: Acquire and process data by assuring that all data requested is received and accurateAnalyze data files as well as summarizing the content and uploading for processingAttend meetings regarding data gathering processes/procedures as necessaryWork with external data vendors to manage projects for on-time completionWork with Capital Markets team to train and assist them with all list building and contact data needsOther duties and special projects as required or assignedQualifications:Bachelor’s degreeAdvanced proficiency in Microsoft Office Suite (Word, Outlook, Excel & PowerPoint) and web navigationMust be detailed oriented, precise and thorough Must be team oriented, motivated and quality-drivenExcellent verbal and written communication skillsMust be familiar with complex databases and comfortable using technology to gather information for reports and packagesRegular attendance and a consistent work schedule is an essential function of this jobPreferred:Working knowledge of Microsoft SQL ServerCertificate of proficiency in Microsoft Office SuiteExperience in researching companies in real estate capital markets and associated databasesPossess a working knowledge of Salesforce or a similar CRM Competitive salary and benefits available. If you meet the qualifications and are interested in this opportunity, please submit your resume and cover letter stating salary expectations to washingtondcresumes@avisonyoung.com. We would like to thank all applicants for their interest, however, only those candidates selected for an interview will be contacted."}