{"jobID": "2726627856", "jobLocation": "Coppell_TX", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Senior Data Analyst - ETL, SQL, ExcelSummary: The role requires the ability to translate business needs into the development of analytical work products using a number of market leading software packages including those used for building reports, dashboards/scorecards and other guided analysis applications, extract-transform-load (ETL) programs, and associated metadata and training material. Proficiency is expected for relational, in-memory, and multi-dimensional databases. Competence with facets of emerging technology is also expected, such as Big Data, Interactive Visualization, Predictive Analytics, and Search-Based Data Discovery. The role requires working closely with others, frequently in a matrixed environment, and with little to moderate levels of supervision. The successful candidate must be an out-of-the box thinker who can learn, implement and execute repeatable and effective processes and deploy solutions in the most time efficient manner with the highest level of quality at the lowest cost. The culture of our organization places an emphasis on teamwork, so social and interpersonal skills are as equally important as technical capability.  The key responsibilities of this position include but are not limited to the following: Working collaboratively with a Financial Analyst to understand needs for information delivery and financial capabilityTranslating these requirements into actionable and effective work products using a variety of commercial software productsDriving successful deployment, training/education, and ongoing support of analytical work productsEnsuring that all work products meet operational as well as functional requirements, including performance, availability, reliability, latency, etc.Lead development projects involving multiple departmentsResponsible for analyzing business requirements, design and developing financial reporting applicationsCreate documentation, including source-to-target mappings and business-driven transformation rulesBuild strong relationships within the department and with IT&S.;Conduct research on emerging application development software products, languages, and standards in support of procurement and development efforts in concert with IT&S;Development of new functionality or enhancements to existing reporting applications to support business objectivesGenerate statistics, prepare and write reports for management and/or team members on the status of the programming processManage multiple projects simultaneouslyEstablish and meet target datesQualifications: Preferred QualificationsPossess the intellectual curiosity to investigate and understand the \"\"why\"\" behind the numbersFamiliarity with Microsoft PowerBI or similar data visualization tools.Working knowledge of statistical modeling techniquesAbility to interpret data and identify insights from large and disparate data setsExcellent verbal and written communication skills; ability to tailor information to everyone from junior teammates to Executive team to external clientsExtremely committed, hardworking, and thoughtful with the ability to work both independently and in a collaborative team environmentIdeal certification:Microsoft Certified Solution Associate (MCSA) on SQL 2012 or higher or able to obtain MCSA within 90 daysExceptional certification:Microsoft Certified Solution Expert (MCSA) on SQL 2012 or higher EDUCATION:Bachelors Degree required Company Description:At its founding in 1968, Nashville-based HCA was one of the nation's first hospital companies. Today, we are the nation's leading provider of healthcare services, a company comprised of locally managed facilities that includes about 165 hospitals and 115 freestanding surgery centers in 20 states and England and employing approximately 204,000 people. Approximately four to five percent of all inpatient care delivered in the country today is provided by HCA facilities. Milton Johnson serves as Chairman and Chief Executive Officer of HCA."}