{"jobID": "2791637963", "jobLocation": "Tustin_CA", "jobTitle": "Marketing Agent (Burbank)", "companyRating": null, "companyInfo": {"Website": "www.welkresorts.com", "Headquarters": "San Marcos, CA", "Size": "1001 to 5000 employees", "Founded": " 1964", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JOB DETAILSJob Title:Marketing Agent (Burbank)Requisition Number:req1622Location:TustinEmployment Type:RegularNumber of Openings:7Job Description:As an Event Marketing Agent (for Burbank, CA)you will confidently approach potential clients at events, effectively engage in conversation, rapidly build rapport, pre-qualify using Welk guidelines, and book tours to our beautiful resort in San Diego, CA. Our alliances allow us to place you in high traffic venues such as at sports events, amusement parks, concerts, fairs and many other fun environments in the Los Angeles area. Purpose: By adhering to the i-Serve standards, the AMS marketing agents will be the direct contact with the general public. Agents are responsible for booking guest tours for timeshare presentations. Essential Duties and Responsibilities (other duties may be assigned):Responsible for marketing presentations to guests at various events.Knowledge of Welk Resorts and its various properties.Book qualified tours for timeshare sales presentations.Agents must maintain required appearance standards.Attend and participate in monthly AMS meetings.Assist with the setup or breakdown of events as needed.Maybe required to work nights, weekends, and in extreme weather conditions. Department:AMS Department markets to the general public at onsite/field marketing venues Minimum Qualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements following this paragraph are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Education and/or Experience: High school diploma or equivalent, and one year of experience in the same or similar role is preferred. Language Skills: Ability to read and interpret documents such as safety rules, operation and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before  groups of customers or associates of the organization. Excellent communication skills required. Must be able to speak, understand, read and write English. Must have excellent English grammar skills, including  punctuation, spelling, style, etc. Reasoning Ability: Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized  situations. Ability to make decisions that are in the best interests of the company. Ability to be flexible and easily adapt to change. Ability to establish and maintain effective working relationships with co-workers, field personnel and sub-contractors/vendors. Physical Demands: The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform essential functions.  While performing the duties of this job, the associate is regularly required to stand; use hands to finger, handle or feel; and talk and hear. The associate is frequently required to walk and reach with hands and arms. The associate is occasionally required to sit; climb or balance; and stoop, kneel, crouch or crawl. The associate must regularlylift and/or move up to 50+ pounds. Work Environment: AMS onsite associate will be in vehicles, onsite: indoor and or outside under weather conditions during job duties. May endure a wide variety of elements related to the work environment."}