{"jobID": "2819769261", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.myticas.com", "Headquarters": "Ottawa, Canada", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The recruitment division at Myticas Consulting is looking to bring aboard an experienced SAP Ariba Analyst within the Buffalo Grove, IL region.  The position needs someone to develop and maintain the data architecture.  This work will enable worker productivity, improve customer experience and business decision making with accurate, timely and consistent information.  The role works with many internal and external service providers to ensure that the new capabilities they help create comply with the data architecture and meet the company’s data needs.  Particularly we need someone who has experience in the development of logical data models and physical data base designs that have been applied across multiple computing environments.  The company is interested in finding new business intelligence solutions and designing and implementing processes to meet those objectives, experience here is critical from the ideal candidate.  Skills and experiences: Need competency in information systems design, information visualization, of usability design and data warehousing techniquesProficiency in cloud data warehouse technologies, such as AWS RedShift and / or Google BigQueryExperienced in MySQL and PostgreSQL databasesWorking knowledge of data warehouse querying tools: SQL, AWS QuickSight, and Google Data StudioGood knowledge of business intelligence tools: Jaspersoft and / or TableauExperience with ETL and frameworks, Matillion and / or Talend preferredKnowledge of how to integrate data from multiple data sourcesExperience in integration of machine learning toolkits into data infrastructureExperience with Big Data technologies to support future growthExpertise in data transformation and analysis with SQL, R, and Python Candidates looking to apply for the role are to send us an updated version of their resume. Our recruitment team will review everything and follow up accordingly after the review phase."}