{"jobID": "2776350945", "jobLocation": "San_Francisco_CA", "jobTitle": "Growth Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.goforward.com", "Headquarters": "San Francisco, CA", "Size": "Unknown", "Founded": " 2016", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Forward is redesigning the way we deliver healthcare using all the technologies healthcare has neglected. As an early member of our world class growth team, youll have a key role in rebuilding our countrys most important and most broken industry from first principles.We were founded in January 2016 by former executives and engineering leaders from Google and Uber. We are funded by some of the world's best investors and entrepreneurs including Founder's Fund, Khosla Ventures, First Round Capital, Eric Schmidt (Google/Alphabet Chairman), Marc Benioff (Salesforce Founder), Joe Lonsdale (Palantir Founder), Joshua Kushner (Oscar co-Founder) and Garrett Camp (Uber co-Founder).You can read our story here and some recent press in The New Yorker, Forbes & TechCrunch.WHAT YOU'LL BE DOING: Work alongside our Head of Growth as a key member of our growth teamWork alongside our Head of Expansion to decide which cities and locations Forward should launch nextDesign, build, execute, and own all of our growth and expansion measurement and analyticsPartner with company leadership to drive key decisions around growth and expansion strategy and executionBuild and scale our processes and tools to drive rapid expansion while continuously improving efficiency and speed of executionWHO YOU ARE:Impact-Driven - Youre deeply mission-driven, and you think theres more to life than software that enables puppy ears to be superimposed in photos. (Although we concede those are cute.)Crazy Analytical - You have a deep understanding of how to break down and solve complex, ambiguous problems with a demonstrated track record of high performanceA Problem Solver - You love breaking down ambiguous problems to their easily explainable building blocks.Entrepreneurial - Youre a self-starter who loves to own things end-to-end. You dont ask for permission - youre too busy making things happen.YOUR EXPERIENCE:2+ years experience with a background in consulting, investment banking, or related fieldBA/BS required, MBA a plus but not requiredGrowth / marketing and startup experience a plus but not requiredWhy Join Forward?We dont want to just move dollars around the healthcare industry - we want to rebuild it and fix it. All of it. Youd be a major part of the story behind one of the most ambitious startup attempts of the past decade and youd work with a team of people who want to use their talents for good."}