{"jobID": "2815002956", "jobLocation": "Franklin_Lakes_NJ", "jobTitle": "Junior Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.brooksource.com", "Headquarters": "Indianapolis, IN", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Junior Business Data AnalystFranklin Lakes, NJ6-month CTH$20/hr DOE $65,000+ Conversion Salary As the Junior Business Data Analyst, you will be responsible for time-sensitive analytical support of the Data Analytics Organization for a Fortune 500 healthcare technology company. You will be responsible for pulling, analyzing and visualizing time-sensitive clinical and financial data for clients. You will write SQL scripts to pull, manipulate and rationalize data and build custom data models. You will also utilize Tableau to create interactive visualized data. You will be responsible for constant communication with the account teams as well as direct communication with clients. You will support modeling and reporting of programs through Saas software delivery. You will also participate in client presentations. This is a great opportunity to be mentored and trained on new technologies. This is a long-term position.  If you feel that this describes you, keep reading and apply!  Minimum Qualifications: Bachelor's degree in Management Information Systems, Business, Computer Science or related fieldSolid understanding and hands on experience with SQLSolid understanding and hands on experience with Microsoft ExcelSaas experience is a big plusDevelopment experience with PythonDevelopment experience with R is a big plus-moving towards object-oriented programmingStrong communication and presentation skillsInitiative to learn new technologiesTableau experience is a big plus Responsibilities: Write SQL scripts to extract and manipulate dataCommunicate directly with clients/ account teams to create custom data reportsVisualize data using Microsoft Excel and TableauWork in Saas software distribution model (software as a service)You will be paired with senior technology leaders to learn the environment and be trained on new technologies What's In It For You? You will be exposed to new technologies in an enterprise environmentYou will be trained and mentored by senior technologistsYou will go through a program aimed around professional developmentYou will attend networking events with senior leadershipWeekly paychecksOnsite cafeteria Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws."}