{"jobID": "2793087160", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.cision.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1892", "Type": " Company - Public (CISN) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Meltwater, Nasdaq, Hootsuite"}, "estimatedSalary": "44000", "jobDescription": "Data Analyst We are a leader in the professional communications software space. By investing in our brand and technologies, we are driving change in how communications pros distribute, monitor and evaluate their content. We invest in our people through training and management and empower them to drive their careers. Responsibilities The primary responsibility of the Data Analyst is to deliver complete, accurate and timely data to the project team for use as the foundation for in-depth, customized client reporting. This requires ongoing monitoring, review and assignment of media content, regular process and quality checks, and communication with internal and external teams to ensure efficient workflow. Ongoing monitoring, review and assignment of media content, regular process and quality checks, and communication with internal and external teams to ensure efficient workflow.Database managementData preparation and generationData quality assuranceReport writingOther tasks as directed and assignedQualificationsBackground in research (media, marketing, demographic, social science, etc.) desirable but not essentialBachelor’s degree or comparable education/experienceDemonstrated analytical abilityAptitude for learning computer systems and databasesExperience using Microsoft Office suite, especially Excel and PowerPointExcellent communication skillsSuperior organizational skills, with the ability to easily identify changing prioritiesAbility to take and give constructive direction and feedbackAbility to work independently with general direction, or as part of a teamGeneral interest in the effect of media on industryCompany Insights:State-of-the-art officeMedical, dental, visionFSA (Health & dependent care)Life & disability insurance401(k)Flexible PTO and work arrangementsCasual work environmentGym on siteTuition reimbursement & professional trainingAbout Cision: Cision Ltd. (NYSE: CISN) is a leading global provider of software and services to public relations and marketing communications professionals. Cision's software allows users to identify key influencers, craft and distribute strategic content, and measure meaningful impact. Cision has over 3,000 employees with offices in 15 countries throughout the Americas, EMEA, and APAC. For more information about its award-winning products and services, including the Cision Communications Cloud®, visit www.cision.com and follow Cision on Twitter @Cision. EEO/AA employer M/F/D/V, 41 CFR 60–1.4"}