{"jobID": "2770709128", "jobLocation": "Washington_DC", "jobTitle": "Chief Data Architect / Lead Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.atsid.com", "Headquarters": "Silverdale, WA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are seeking a Chief Data Architect/Lead Data Scientist to join us in supporting an agile development project at US Citizenship and Immigration Services (USCIS) in Washington DC. The Chief Data Architect will support an agile development project to provide data analytics and development, security and operations (DevSecOpsOps) to USCIS systems hosted in any of the USCIS datacenters or cloud environment. The data analytics team’s will establish big data reporting and an enterprise analytics platform for large data sets, identify and correct data quality issues and establish a data governance framework to enforce data standards and improve accuracy, and develop highly optimized, scalable automatics case matching logic on container technology. The analysis will then be used to develop machine learning algorithms and natural language processes to improve fraud prediction. # of Hires Needed 1 Hiring Manager Guidry, Jon (Applied Technical Systems) Job RequirementsShall have at least ten (10) years of experience in enterprise data architecture Shall have at least eight (8) years of experience in Conceptual/Logical/Physical data modeling Shall have experience in modeling solutions in AWS Shall have at least ten (10) years of proven expertise in Relational and 9 Dimensional Data Modeling o Must have a strong understanding of cloud architecture, specifically AWS, as it relates to data processing (i.e., EC2, S3, Redshift, etc.) Must be able to define & maintain BI/Data Warehouse methodologies, standards, and industry best practices Shall have experience leading and architecting enterprise wide initiatives, specifically system integration, data warehouse build, data mart build, data lakes, etc. for a large enterprise Shall have experience briefing the benefits and constraints of technology solutions to technology partners, stakeholders, team members, and senior levels of management o Shall have, at a minimum, a Bachelor’s degree in data science, engineering, statistics, or other comparable degree or experience.Experience working on these systems at USCIS is preferable."}