{"jobID": "2806206311", "jobLocation": "Bay_City_MI", "jobTitle": "Multimedia Specialist", "companyRating": "2.6", "companyInfo": {"Website": "www.mlivemediagroup.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": " MLive.com seeks an innovative and versatile multi-media specialist for its Bay City/Saginaw hubs. The right candidate is highly skilled in photography and videography with a passion for taking visual storytelling to the next level. The candidate should have strong collaboration and coordination skills, assisting interns and reporters in developing strong digital content, and taking the lead on the visual strategy for the Bay City and Saginaw region. Some writing skills are necessary, too. MLive is an innovative, digital news organization where experimentation, flexibility and audience focus are musts. We are paving the way for the future of digital news, yet we are grounded in the ethics of solid journalism. Required Education, Experience and Skills:Bachelor’s degree in Visual Communication, Journalism, Graphic Design, Multimedia Design, Art Graphic Design, Web Design, or a related field requiredMinimum of 3 years of recent experience in multimedia development requiredExperience in posting to the web and meta-data taggingStrong web, video, and multimedia authoring skills and emerging technologiesProficiency in Adobe Creative Suite including Photoshop, Illustrator, Flash, Dreamweaver, Bridge, Acrobat, and audio and video editing softwareExcellent interpersonal, organizational and communication skillsKnowledge of press and other forms of print mediaDemonstrated ability to manage and meet production timelinesUnderstanding imperatives of multiple platforms – print, mobile, Internet, etc.Mastery of social media and digital interactionEssential Duties and Responsibilities:Make photos, videos and other image-based content for use in all news platforms, existing and future, that is: Journalistically and ethically sound in all respectsVisually compellingMeets professional standards for composition, focus, lighting and other technical standardsPerform fundamental editing functions to facilitate production demands, including cropping, toning, color-correcting, etc.Work seamlessly across all topics and, when necessary, all departments in the news organization.Work independently and remotely, while maintaining operational communication with editor and, when applicable, production center.Working knowledge and use of the hardware, software and cloud-based equipment and systems for direct-to-web production and engagement, including but not limited to: Uploading photographs, photo galleries and video to any internal production systemsPosting photographs, photo galleries and video directly to the webUse of laptops and smart phones for remote web reportingInteract on social media platforms, with story shares, objective commentary, promotion of your topic and news organization’s content initiatives.Understand our news organization’s audience traffic tracking systems and analytical reportsWorking Conditions and Physical Requirements: Extensive computer use required. Some travel required. Ability to work flexible work schedules, including nights, weekends and holidays, as needed.  MLive Media Group is an audience-first, digitally focused media company encompassing all content, sales and marketing operations for: MLive.com, The Grand Rapids Press, The Muskegon Chronicle, Kalamazoo Gazette, The Jackson Citizen Patriot, The Ann Arbor News, The Flint Journal, The Saginaw News, The Bay City Times and the Advance Weeklies in Grand Rapids, as well as several related entities. In addition to being Michigan's #1 news and information provider, MLive Media Group is Michigan's largest local media advertising network, allowing advertisers to reach local audiences in communities across the state.  MLive Media Group is a part of Advance Local, one of the largest media groups in the U.S. reaching more than 40 million consumers through its 12 local news and information websites that rank #1 among local media in their respective markets, and more than 30 newspapers. Our affiliated websites and newspapers are well known for their award-winning journalism. Advance Local is part of Advance Publications, along with Condé Nast and American City Business Journals.  MLive Media Group is an Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, gender, national origin, age, physical or mental impairment, sexual orientation or any other category protected under federal, state or local law. "}