{"jobID": "2834335825", "jobLocation": "Kenilworth_NJ", "jobTitle": "CAD-Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": "64000", "jobDescription": " The position functionally reports into Global Facilities Information Management Lead supporting client Global Real Estate Services.  This role involves the collection and maintenance of facility data for all owned and leased client sites (currently estimated at 700+ locations), including but not limited to cost, capacity and occupancy data.  All data will be entered into and maintained in Manhattan CenterStone - the client's Integrated Workplace Management System (IWMS), by this role or by related team roles using predefined templates.  Maintains Master floor plans and as-built furniture plans using CAD to capture post-move space reconfigurations.  Through use of IWMS and CAD provide site support for identified functions and Drawing Management including the polylining of floor plans. Responsibilities: Communicate and/or interface with JLL and client's leadership at sites around the world (North America, Latin America, Asia Pacific and EMEA regions).  There could be some non-typical work hours involved (e.g., communication by phone with Asia Pacific region may have to occur outside of EST working hours)  Collect data in an efficient manner and accurately record it in the predefined collection templates.  Diligently follow up with the required contacts to ensure that the data is collected on time. Escalate any issues in a timely manner so that senior leadership can help clear roadblocks  Enter data into Manhattan CenterStone via system bulk uploads and/or by editing individual records or coordinate with other team members doing the same.  Manage drawings in and out of Clients CenterStone IWMS platform thru check-out/in.  Convert new drawings to standardized format and simplified CAD layering configuration.  Maintain Master building floor plans and as-built furniture plans using CAD, often based off mark-up/redline.  Completes polylining for area measurements based on the BOMA Standard Method for Measuring Floor Area in Office Buildings.  Proactively meet established critical timelines and targets in a cost effective manner  Produce relevant Excel reports and distribute to all interested parties.  Periodically review database data, note and resolve anomalies through consultation with site contact, and input necessary corrections  Demonstrate proficiency in the use of all related technology systems, as required for assigned projects. Qualifications: Proficient computer and Advanced MS Office skills, including MS Word, Excel, and Outlook.  Ability to quickly learn and effectively utilize various facility management and database software tools  Experience in collecting and manipulating data in a corporate real estate environment is a plus as well as experience in IWMS tools and specifically Manhattan CenterStone.  Proficient skills in AutoCAD 2013 or more recent version.  Associates or technical certificate a plus but not required with three to five years relevant experience.  Demonstrated collaboration, organizational, and communications skills including fluency in both verbal and written English language skills. Secondary written and verbal language skills a plus.  Self-starter, able to work independently, and within virtual team environment in particular within webex teleconferences.  Easily able to manage multiple client and team interactions simultaneously, exhibiting strong customer service orientation  High level of attention to detail and able to interact comfortably with a full range of decision makers from direct supervisors to senior management.  #LI JLL Is an Equal Opportunity Employer JLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veterans status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.  For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf.  If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at [Click Here to Email Your Resumé]"}