{"jobID": "2606211334", "jobLocation": "Rockville_MD", "jobTitle": "Construction Superintendent", "companyRating": null, "companyInfo": {}, "estimatedSalary": "90000", "jobDescription": " Our commercial construction company specializes in build-out construction for Hospitals and Medical offices as well as other commercial buildings. We make offices and clinics habitable and attractive so that our clients can succeed in their businesses, and we’re looking for a Construction Superintendent to oversee, manage and direct all aspects of a project from beginning to end. The ideal candidate will have excellent leadership qualities that allow him or her to take control of a project and produce results.  Visit our website for more information on what our company is all about. www.cmsi-biz.com Duties:Manages sub-contractors by locating, evaluating, and selecting sub-contractors; monitoring and controlling performance.Meets operational standards by contributing construction information to strategic plans and reviews; implementing production, productivity, quality, and customer-service standards; resolving problems; identifying construction management system improvements.Meets construction budget by monitoring project expenditures; identifying variances; implementing corrective actions; providing non-project annual operating and capital budget information.Accomplishes construction project results by defining project purpose and scope; calculating resources required; establishing standards and protocols; allocating resources; scheduling and coordinating staff and sub-contractors; evaluating milestone assumptions and conclusions; resolving design problems; evaluating and implementing change orders.Approves construction projects by conducting inspections at critical phases; obtaining approvals from buyers.Prevents fines and interruptions by complying with, and enforcing, codes.Maintains safe, secure, and healthy work environment by following and enforcing standards and procedures; complying with legal regulations.Updates job knowledge by tracking and understanding emerging construction practices and standards; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations.Enhances organization reputation by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments."}