{"jobID": "2739623151", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Tech Transfer Scientist", "companyRating": null, "companyInfo": {"Website": "www.freenome.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "What is Freenome? Freenome is a health technology company bringing accurate, accessible and non-invasive disease screenings to you and your doctor to proactively treat cancer and other diseases at their most manageable stages. Freenome is a place where you can do your best, most meaningful work, and contribute to a whole new way of thinking about curing cancer. Its a data-driven, diverse company at the intersection of biology, technology, and medicine. Freenome is an AI genomics company on a mission to empower everyone with the tools they need to detect, treat, and ultimately prevent their diseases. By applying advanced machine learning techniques to recent breakthroughs in genomic science, Freenome is developing noninvasive blood tests to detect early-stage cancer and make treatments more effective. The company has raised $78 million from investors such as Andreessen Horowitz, Google Ventures, Polaris Partners, and Founders Fund. Freenomers are technical and creative, visionary and grounded, empathetic and passionate. We build teams around divergent expertise, which allows us to solve problems and uncover opportunities in unique ways. Freenomers are some of the most talented experts in their fields. Together we advance healthcare one breakthrough at a time.Our Mission Equip you and your family with knowledge and tools to maintain a healthier life and prevent disease. By using artificial intelligence to recognize disease-associated patterns in a new class of circulating, cell-free biomarkers, Freenome is developing simple, accurate, and noninvasive blood tests for early cancer detection, and related tests to guide oncologists with insights into the most effective course of treatment.About the Role We are looking for a motivated, self-starter who will lead the technology transfer of assays from R&D; to the Production Laboratory. In this role you will design and implement the process in coordination with the R&D;, Production Laboratory, Automation, and Quality departments. You will evaluate, perform optimization experiments, and validate assays prior to release for use in the production laboratory. You will also work closely with the Quality Department to provide SOPs and supporting controlled documents.Responsibilities Design, Implement, and Lead Assay Transfer from R&D; to the Production Laboratory Design experiments to improve assay performance/efficiency Develop standardized processes with controlled documents (SOPs, Work Instructions, Forms, etc.) Identify appropriate controls and/or standards and establish acceptance criteria ranges Lead and participate in cross-functional teams (R&D;, Production Laboratory, Automation, LIMS, Computational Bio, and QA) Write, execute and report validation documents Provide training to laboratory staff Follow-up monitoring of newly released assays to ensure performance expectations are met Investigate and implement root cause resolutionsWhat We're Looking For M.S. or PhD in life sciences or similar area 2-5 years of industry experience in regulated Life Sciences (Molecular Biology and NGS) Experience with technology assessment and optimizationNice to Haves Excellent communication and teamwork skills - team leadership experience a plus Exceptional analytical and strategic problem solving skills Attention to detail and organization Demonstrated history of assay development and successful launch Experience working in cross-functional teams, especially with software engineers and/or scientistsFreenomes Culture Our culture is simple. We value empathy, integrity and trust in one another. We feel from the perspectives of each other, patients and the communities we serve. We give each other the benefit of the doubt and believe were all working as a team towards our goals. We conduct ourselves with integrity, empowering others to grow in a collaborative environment. Freenome explicitly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status.What does a successful person look like at Freenome? You can prioritize, manage and execute your goals and align them with the mission of Freenome. Youre a steward of the culture and hold yourself and the team accountable. You believe hiring and mentorship are fundamental to building the organization. You bring ownership to your role, focus on your process and find the gaps to help Freenome reach its full potential. You welcome feedback and criticism knowing its value is to build people up and support each other, rather than tearing each other down."}