{"jobID": "2832799690", "jobLocation": "Chicago_IL", "jobTitle": "Data Integration Architect", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " *Permanent Full time role*  Prestigious Fortune 500 Company is currently seeking a Data Integration Architect with Metadata tools experience. Candidate will help provide data architecture to support business objectives. Responsibilities: Design API and Service Layer interfaces.  Apply standards, and develop and document data architectural solutions.  Collaborate strategies with product managers and lead engineers.  Lead meetings with domain architects, engineering teams, application developers, data-scientists on solutions.  Identify gaps within existing data architecture and recommend alternative solutions.  Participate in the definition of technical standards and guidelines that pertain to data and information-use, security, access and governance. Qualifications: Strong logical/physical Datamodelling across many different data management platforms.  Require at least 3 years of Avro/JSON/XML schema design;  2+ years of experience designing REST API Interfaces;  2+ years of experience with Real Time integration tools such as Apache Flink, Apache Kafka/Schema Registry;  Experience with Hortonworks DataFlow (NifI, Kafka, Storm, Atlas) and Hortonworks DataPlatform (Yarn HDFS) is preferred;  Proficient with GeoJSON  1+ year of experience leveraging Cloud Services (IaaS, PaaS).  Data integration issues and integration patterns.  Ability to lead multiple high priorities initiative with aggressive timelines leveraging an agile framework.  Ability to concentrate on a wide range of loosely defined complex situations, which require creativity and originality, where guidance and counsel may be unavailable.  Must be able to communicate technical information clearly, able to translate' between diverse groups of technical and non-technical individuals.  Ability to synthesize large amounts of complex data into meaningful conclusions and present recommendations to a vast array of individuals.  Partner with business units in order to improve the effectiveness of business decisions.  Ability to structure documents to effectively communicate with senior leadership and drive alignment and decision making.  Strong problem solving skills with the ability to offer why one technical solutions is more preferable than another.  Bachelor's Degree required, Master's Degree Preferred. Read moreSee All"}