{"jobID": "2791839253", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Quality Analyst, Business Intelligence", "companyRating": "3.8", "companyInfo": {"Website": "www.twilio.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (TWLO) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Because you belong at TwilioThe Who, What, Where and WhyWho? Twilio is seeking a Data Quality Analyst for BI team with an industry experience and a deep understanding of data usage and lifecycles across a SaaS-based organization. We are looking for someone to build the data quality framework used to identity, compare and resolve data quality problems across various data models managed by BI team. This role will be responsible for the design and implementation of the data quality processes, metrics, alerting and monitoring of critical data sets, dashboards & reports providing insights into data quality using BI/reporting tools. The individual will work closely with data engineers and analysts in the Business Intelligence team, as well as the analysts from various business teams, to ensure the solutions that are developed and implemented are tightly aligned to enterprise business standards and principles. The individual will act as a subject matter expert for the data quality and metrics for critical data sets used by various business users at Twilio. Bachelor's degree in a computer science related field is a minimum requirement. What? An engaging day for you would include evaluating large dataset for quality and accuracy by running complex SQL against various data warehouse and analytical systems. You will determine business impact level for data quality issues, root cause for data quality errors and make recommendations for solutions. You will develop process improvements to enhance overall data quality and execute data cleanup measures. You will maintain a record of original data and corrected data. You will define data quality standards and ensure adherence to those standards. You will resolve all internal data exceptions in timely and accurate manner. In this role, you will work closely with data engineers to correct data quality errors and help build automated monitoring and alerting mechanisms for internal data quality measures and processes that ensures the accuracy of data models, reports and dashboards used across Twilio Why? Twilios Business Intelligence team provides actionable insights to business units and enables fact based decision making. We are a critical and strategic partner to the business and product teams to build true data driven culture at Twilio. Providing accurate and timely insights to our business and product leaders that enables data driven decision making will be essential to this role and to the success of the broader company.  Twilio is a company that is empowering the worlds developers with modern communication in order to build better applications. The Talent Acquisition team plays an integral role in building small, impactful teams that work closely with our developer community to meet their communication needs.  Twilio is truly unique; we are a company committed to your growth, your learning, your development and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion and innovation and we want you and your ideas to thrive at Twilio. Come join us. Where? This position will be located in our beautiful office at 375 Beale Street in San Francisco. You will enjoy our incredible perks: catered meals, snacks, game room, ergonomic desks, massages, Wednesday Night dinners, bi-weekly All Hands and more. What you will also get to experience is a company that believes in small teams for maximum impact; that strives to balance work and home life, that understands that this is a marathon, not a sprint; that continuously and purposefully builds an inclusive culture where everyone is able to do and be the best version of themselves. We seek people who naturally demonstrate our values, who are challenged by problems, empower others to thrive, people who can draw the owl and not be beholden to one playbook."}