{"jobID": "2779049313", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist III", "companyRating": "3.2", "companyInfo": {"Website": "www.generaldynamics.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1952", "Type": " Company - Public (GD) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": " Job Description  ***ONLY applicants who possess an Active Top Secret Clearance need apply*** General Dynamics Information Technology (GDIT), a leading provider of systems engineering, integration, IT service operations and support solutions, is seeking talented professionals to deliver valuable services and solutions to our customers.  GDIT has a great team consisting of experienced and knowledgeable managers who lead and support the career development objectives of our employees. Our employees consider the company to be a solid partner in their career, with an abundance of opportunities for advancement.  We are seeking a Data Scientist III with focus on Development Operations (DevOps) technologies and services to support our Justice Programs team in Washington, DC/Metro Area. In this position, you will support the FBI’s Information Technology Applications and Data Division’s (ITADD) operation and enhancement of over 80 existing IT applications. ITADD oversees activities in information systems operations, information systems development and modernization, and IT security.  Responsibility: Works on high-visibility or mission critical aspects of a given program and performs all functional duties independentlyOversee the efforts of less senior staff and/or be responsible for the efforts of all staff assigned to a specific jobResponsible for utilizing bigdata technologies such as: Apache HiveApache PigApache SparkMapReduceHadoopMongoDBKnowledge of data science models to analyze large amounts of data and create valuable insights for supporting the missionDuties include finding and designing new approaches to handling, analyzing and using large volumes of law enforcement, intelligence, investigative, and business data setsExploring fundamental issues with data handling, search, and retentionSolving complex data and storage issuesDesigning new software coding to improve data search processesDesigning, testing and validating the quality of the data and data processesAnalyzing and reporting results with actionable recommendations Minimum Experience: Six (6) years of work experience with bigdata technologies such as:Apache HiveApache PigApache SparkMapReduceHadoopMongoDB EducationEducation: Bachelor’s/Master’s degree in Computer Science or other related field (Preferred) QualificationsFor more than 50 years, General Dynamics Information Technology has served as a trusted provider of information technology, systems engineering, training and professional services to customers across federal, state, and local governments, and in the commercial sector. Over 40,000 GDIT professionals deliver enterprise solutions, manage mission-critical IT programs and provide mission support services worldwide. GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class."}