{"jobID": "2783301582", "jobLocation": "Allegan_MI", "jobTitle": "Senior Principal Scientist / Manager I - Analytical Method Development", "companyRating": null, "companyInfo": {"Website": "www.perrigo.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (PRGO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Watson Pharmaceuticals, Dr. Reddy's"}, "estimatedSalary": null, "jobDescription": " The Allegan Michigan based Analytical Research and Development department, specializing in solid and liquid oral dosage form Over-the-Counter (OTC) product development, is looking to add a talented and highly motivated leader to the New Product Development team that supports materials characterization and development. This team operates with a Quality By Design platform performing risk-based assessments of available supplier (DMF) and other relevant technical information, physicochemical testing of various materials (APIs, raw materials, and intermediates), developing and validating analytical test methods, contributing to clinical and regulatory filings, and authoring technical documents in support of new and reformulated drug products.  The position requires subject matter expertise and hands-on working knowledge for a variety of analytical techniques used for materials characterization (e.g. particle size techniques, HPLC, GC, FTIR, XRPD, microscopy). This role will be responsible for the management and development of a highly engaged team of Analytical R&D; personnel to support Consumer Healthcare R&D; goals and objectives.  This is a great career move for someone who wants to be involved in the entire drug product lifecycle, participating from initial concept to commercial production, with opportunities to contribute to a successful global pharmaceutical business focused on Quality Affordable Healthcare Products. Major Duties and Responsibilities to include:Lead the creation and validation of API, raw material and intermediate specifications and analytical procedures in a manner that is compliant with FDA and company regulatory standards.Design and supervise or perform quality scientific experimentation leveraging Quality by Design principles to develop robust processes in support of Product Development activities.Generate accurate, reliable data by following established procedures and practices to support analytical development. Provide critical review of technical documents, including but not limited to: SOPs, drug master files, technical packages, vendor qualification, raw material and release and stability specifications, stability summaries, test methods, and certificates of analysis which conform to company standards.Serve as an internal/external Subject Matter Expert (SME) for material analytical procedures, formulation and process related technical issues.Perform effective problem solving, resolution, and implementation of process improvements in designated day-to-day operations and participate in large scope product/process development and improvement projectsSupervise or mentor team of junior and senior level scientists and technicians in the design and execution of analytical development activities.Lead or mentor team by establishing and providing clear goals, direction, motivation, clarity, and support needed for self and others to excel in a continuous improvement culture.Required Experience:Demonstrated proficiency with a variety of analytical instruments for physical and chemical analyses including but not limited to analytical balances, pH meters, GC, laser diffraction PSD, FTIR, HPLC, XPRD, microscopy, wet chemistry techniques, and water content determination.Empower software experience highly desired.Familiarity with a variety of compendial references including the United States and European Pharmacopeia and relevant FDA Guidances and ICH Guidelines related to analytical methods validation and drug product development.Experience with statistical analyses of data and design of experiment concepts.The ability to clearly document and precisely execute analyses and experiments of moderate to high complexity which includes maintenance of high quality documentation, analysis and proper interpretation of data, and preparation of reports, presentations, or other technical communications as necessary.Ability to contribute to reviewing and authoring relevant CMC sections of NDA / ANDA / PAS filings and be a major contributor to providing scientifically sound responses to FDA communications.Must be able to work independently as well as provide leadership on multiple concurrent projects and significantly contribute to process and material knowledge.Excellent communication and presentation skills to lead and influence within direct Analytical team, on focused technical and non-technical teams, and with cross-functional groups.Demonstrated ability to lead and operate effectively and solve complex problems in a team oriented culture focused on a sense of shared scientific inquiry, collaborative engagement, innovation, and the pursuit of scientific excellence.Qualfied Candidates will:The skills required for this role are normally acquired through completion of degree in Chemistry or Pharmaceutical Sciences combined with: a minimum of 11 years professional experience in a cGMP or cGLP laboratory with a Bachelor’s Degree OR9 years with a Master’s Degree OR7 years with a PhD.Two or more years of team leadership and/or supervisory experience is required for consideration against this role."}