{"jobID": "2814679374", "jobLocation": "Washington_DC", "jobTitle": "Outpatient Behavioral Health Therapist", "companyRating": "2.6", "companyInfo": {"Website": "www.diamondhealth.com", "Headquarters": "Richmond, VA", "Size": "501 to 1000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Universal Health Services, Acadia Healthcare, HCA Healthcare"}, "estimatedSalary": "52000", "jobDescription": " Come work with a great team! Diamond Healthcare, the manager of behavioral health services for MedStar Washington Hospital Center, has an opening for an Outpatient Therapist to provide psychotherapy to adult (18 years old and over) patients and their families as part of a multidisciplinary team. Essential FunctionsProvide individual, group and family therapy under the supervision of the Clinical Manager and Medical DirectorParticipate in interdisciplinary treatment planningProvide crisis intervention/consultation as neededParticipate in agency-wide training programs and in-servicesParticipate in the clinical therapist peer-review processProvide quality and timely clinical documentation, per Joint Commission and other regulatory agencies’ requirementsProficiency and experience in multiple therapeutic modalities, including but not limited to: CBT, Insight-oriented Therapy, Motivational Interviewing, DBT Skills, family, and group therapyProficiency in interpersonal communication and interdisciplinary teamworkExperience and skill in treating patients with various types and presentations of psychiatric/behavioral health disordersProficiency in conducting psychosocial assessmentsProficiency in developing interdisciplinary treatment plans Candidates should have a minimum of 2 years experience in assessing, diagnosing and developing treatment plans for patients with psychiatric/behavioral health disorders. Experience facilitating patients' access to community resources and conducting therapeutic groups is required. Must be flexible to adjust to the needs of a fast-paced environment, demonstrate effective problem solving skills, and display excellent oral/written communication skills. Previous adult behavioral health and substance use treatment experience is preferred. Candidates must have active District of Columbia LICSW or Psychologist license or be eligible for endorsement.  EOE"}