{"jobID": "2792487647", "jobLocation": "Southfield_MI", "jobTitle": "Environmental Scientist / MDEQ Regulatory Reporting Specialist", "companyRating": "3.2", "companyInfo": {"Website": "www.aecom.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ACM) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bechtel, ABB, Louis Berger"}, "estimatedSalary": "51000", "jobDescription": "*Business Line** Environment*Position Title** Environmental Scientist / MDEQ Regulatory Reporting Specialist United States of America - Michigan  Southfield *Job Summary** AECOM is actively seeking a creative, highly talented Environmental Scientist with broad knowledge and experience with MDEQ Regulations for immediate employment for the Southfield, MI office. AECOM is proud to provide our employees with exciting, challenging projects.  Possible specific duties and responsibilities of this position include:  + Drafting of regulatory reports required under Part 201 and 213, including exposure pathway analysis  + Data reduction, review and interpretation  + Drafting of figures using AutoCAD  + Review of junior level reports and field notes to ensure compliance with Quality Management Systems  + Development of site specific SHE Safety Plans  + Completion of Safety, Health and Environment (SHE) paperwork and observations  + Sampling of various media including soil, groundwater, surface water and soil gas  + Installation of groundwater monitoring wells and vapor monitoring points  + Oversight of subcontractors performing various tasks  + Interaction with the public as a representative of AECOM  + Calibration of field instrumentation and documentation  + Completion of lithologic descriptions of soils from drilling activities  + Field preservation of samples in preparation for laboratory analysis *Minimum Requirements** + Bachelor's Degree in Geology, Environmental Sciences, Biology, Chemistry, Environmental Planning, Engineering or equivalent.  + 4+ years of relevant environmental consulting experience.  + Good understanding of Part 213 (LUST regulations)  + Experience drafting regulatory reports required under Part 213  + Proficient in the use of Microsoft Office (Word, Excel, etc.) required.  + Excellent oral and written communication skills required.  + Multi-tasker and problem-solver  + Attention to detail and desire to complete quality work products  + Ability to work well with others in a Team environment and able to comprehend instruction quickly *Preferred Qualifications** + 5-7 years' experience preferred  + Experience using AutoCAD.  + 40-hr OSHA HAZWOPER training and annual updates required.  + Michigan Drivers License in good standing *What We Offer** AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.  At AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&E; is a part of our company culture and participation is required for all employees.  _NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM._ *_Job Category_** _Sciences_*_Business Group_** _Design and Consulting Services Group (DCS)_*_Country_** _United States of America_*_Position Status_** _Full-Time_*_Requisition/Vacancy No._** _188159BR_ _Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._"}