{"jobID": "2824843385", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.avant.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Springleaf Finance, OneMain Financial, World Acceptance"}, "estimatedSalary": "88000", "jobDescription": "Avant is revolutionizing the world of lending by lowering the costs and barriers of borrowing for everyday people. At our core, we are a technology company that builds advanced platforms and uses custom analytics. Today, we help underserved consumers, the majority of whom get fast funding on our online platform without having to talk anyone. Tomorrow we plan to use our world class technology and underwriting capabilities to launch new products and bank partnerships that improve peoples financial lives.Job DescriptionLets get to business. Avant is looking for a new Data Scientistto join the team in Chicago.We are revolutionizing access to credit by innovative mathematical models. As part of our data science team, you will leverage our fast growing structured and unstructured dataset to improve default prediction, marketing analytics and operations. Your models will have a direct impact on our customers by helping us provide them with financing options at fair cost.Minimum Qualifications: Bachelor's Degree in statistics, machine learning, computer science, econometrics, or other quantitative fieldPrior experience in statistics and machine learning modeling techniques through coursework or professional experienceExpertise in at least one statistical programming language such as R or PythonProfessional experience with relational databases such as Oracle, PostgresSQL, SQL ServerPreferred Qualifications:Masters Degree or PhD in statistics, machine learning, computer science, econometrics, or other quantitative fieldProven ability to communicate findings clearly to both technical and non-technical audiencesExpertise in machine learning theories and practices, including regression models, GLM, SVM and tree based models (e.g. Boosting, Random Forest)Familiar with Object-Oriented Design (OOD) concept and functional programmingPrior experience in risk, marketing, or loss forecasting modelingWhy Avant is a fit for you:At Avant, we believe our values make a difference:We value, support, and help each other growWe are committed to active inclusion and diversityWe are transparent and believe the best idea winsWe succeed when our customers succeedWe get sh!t done responsiblyAnd we keep it fun!We believe that ideas are more important than titles, everything is more fun together, everyone drives change, and everyone is an owner. While we believe the perks and benefits that we offer are terrific, nothing excites us more than having the ability to collaborate with intelligent, highly-motivated and talented people on challenging problems as we work to change the face of online lending."}