{"jobID": "2831942686", "jobLocation": "Cerritos_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.iconma.com", "Headquarters": "Troy, MI", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Modis International, Experis"}, "estimatedSalary": null, "jobDescription": " Location: Cerritos, CA  Duration: 6 months Description:Must have an Economics or Statistics degree. Needs to know SQL at the intermediate level and has used SQL Server Management Studio. Other tools our team uses is SQL Server Reporting Services (SSRS), Tableau and/or Micro strategy.Healthcare background is preferred, and familiar with cost utilization, unit cost per claim, calculations such as PMPM, PTMPY, ALOS and cost trend analysis.HR Description: Responsible for identifying opportunities to improve health care affordability through analysis of data. Ability to translate data to provide answers and stories from the data for client consultation for improving health care affordability to professional clients. Primary duties may include, but are not limited to: Collaborates with the data warehouse analysts in the establishment and adherence to business rules. Provides business knowledge regarding the appropriate use of data elements and cooperates with reporting personnel from other areas to establish and maintain these common business rules. Tracks and prioritizes projects through coordination and negotiation with client to improve the efficiency of information/project plan generation. Evaluates and triages potential projects and studies based on the value, cost benefit analysis and the urgency of the request. Performs strategic data analysis (data mining) and research as appropriate to support business needs (e.g., disease management, provider profiling, etc.). Develops good understanding of relevant business processes, goals and strategy in order to provide analysis and interpretation. Collaborates with business user to define media, frequency and audience for distribution of information. Develops action plans to address areas for improvement identified through data analysis and business expertise and communicates action plans to client. May assist in the planning of initiatives to address areas for improvement. Requires a BS/BA degree; at least 3 years related experience in analysis and reporting. Knowledge and understanding of data warehouse data structures and data flows and standard Business Information tools and programming/query languages. Excellent communication skills.  Nithin Nandamuri  Phone: (248)-275-5360  Email: nithin@iconma.com"}