{"jobID": "2830916950", "jobLocation": "Santa_Clara_CA", "jobTitle": "iPhone Operations Sr. Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "115000", "jobDescription": "iPhone Operations Sr. Data Analyst Job Number: 113921156Santa Clara Valley, California, United StatesPosted: Jun. 28, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.  It takes deeply dedicated, intelligent and hard-working individuals to maintain and exceed the high expectations for the exciting iPhone brand at Apple. The iPhone Operations team is seeking a Data Analyst to take on the responsibility of improving superior quality and manufacturing goals through statistics, analytics, modeling, and business intelligence tools.Key Qualifications Excellent analytical skills, advanced level of statistics with the ability to identify and predict trends and anomalies.Experience in data mining very large data sets, high proficiency in SQL (Teradata, Oracle, or MySQL or other RDBMS).Experience in Hadoop, Hive, HDFS, Spark, AWS Redshift, Presto, and other distributed processing systems preferred.You will have superb software development skills with proficiency in Python, R and libraries such as scikit-learn, scipy, R, NetworkX, Spacy, and NLTKData visualization experience with tools such as: Tableau, JMP, R creating dashboards and presenting data through reports.Proven ability to handle various tasks concurrently and in a timely manner, including large, complex projects.Effective presentation skills and be able to explain complex data and charts in a concise manner to large audiences. Superb communication skills, both verbal and written.Prior experience in Manufacturing, Test, and Consumer Electronics is a plus DescriptionThe Data Analyst utilizes data, infrastructure and intelligence tools to improve product quality and manufacturing efficiencies by understanding the variables impacting yield. You will drive strategic initiatives for better data collection and reporting, ensure data integrity across multiple data sources, and reduce analysis time through automation and creative solutions. You should have expertise required to understand complex data sets: product testing, parametric big data, manufacturing, robotics and capital equipment. Select and configure appropriate technologies and programming languages required to ensure successful business impact.  This position will work closely with Operations, Test Engineering, Quality, Engineering, Product Development, Customer Service, Supplier Quality, Global Supply Managers, Suppliers, Contract Manufacturers, Repair, Fraud Detection, Business Intelligence and IT teams. You will take data from different sources, apply statistical modeling, analyze, interpret its specific meaning, and clearly convey the significance of the assessment, tailored to individual teams, as well as the business as a whole.  The position requires a software programming skill set, utilization of statistical techniques, experience understanding data integrity, and implementing automated solutions. You will need to have a grasp of relational database management systems, design, and structured query language.  The role includes the following main duties: Employ statistical techniques with big data initiatives and tools to drive major operational business decisions.Answer complex questions through data, analysis, and clearly communicate findings to multi-functional teams for direction.Influence repair processes and fraud detection improvements by scripting analysis on very high volumes of data at a commodity and parametric level.Seek opportunities to improve data collection, reporting and consumption based on business needs.Regularly collaborate with internal and external information technology teams on resolving data issues, as well as mitigation plans to avoid errors in the future.Participate in strategic capital systems planning.EducationMaster’s or PhD degree in Computer Science, Statistics, Business Analytics, Machine Learning, Engineering, or equivalent experience. Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}