{"jobID": "2822015856", "jobLocation": "Southfield_MI", "jobTitle": "IT Senior Data Warehousing Analyst Solutions Architect", "companyRating": "3.7", "companyInfo": {"Website": "www.henryfordhealth.org", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1915", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "GENERAL SUMMARY:Under the general direction of the Project Manager, Manager, or the Director, develops and enhances a data warehouse environment which includes data design, database architecture, metadata and repository creation. Provides direction and guidance to less experienced team members. Reviews data loaded into the data warehouse for accuracy. Responsible for the development, maintenance, and support of an enterprise data warehouse system and corresponding data marts. Troubleshoots and tunes existing data warehouse applications. Conducts research into new data warehouse applications and determines viability for adoption. Assists in establishing development standards. Evaluates existing subject areas stored in the data warehouse. Incorporates existing subject areas into an enterprise model. Creates new or enhanced components of the data warehouse.The responsibilities also include troubleshooting application issues and/or data issues when they arise. The Senior Data Warehousing Analyst is a leader in an IT team that is accountable for production support (including on-call duties in a 24x7 environment) as well as new projects.The ideal candidate will have significant experience using analytical skills to seek out, research and evaluate a variety of options to provide clients with high quality solutions that promote efficiency and enterprise-wide standardization. Must demonstrate the ability to mediate and bridge the relationship between technical and business stakeholders without compromising the needs of the solution users and the strategic goals of the organization.PRINCIPAL DUTIES AND RESPONSIBILITIES:Subject matter expert (SME) in one or more applications’ capabilities and features for users, owners, and administrators of solutions.Keeps abreast of new Tools & Technology and functionalities across the application(s).Assists with developing the methods and procedures required to identify whether current business goals and objectives meet organizational needs.Facilitates meetings with clients to gather and document requirements and explore potential solutions.Analyzes and documents client's business requirements and processes and communicates these requirements by constructing conceptual data and process models, including data dictionaries and volume estimates from organization.Collaborates with work teams, departments, system leadership, staff, other IT groups, and technology vendors to define needs and facilitate solutions.Provides input into developing and modifying systems to meet client needs and develops business specifications to support these modifications.Creates test scenarios and develops test plans to be used in testing the business applications in order to verify that client requirements are incorporated in to the system design.Assists in analyzing testing results throughout the project.Participates in technical reviews and inspections to verify 'intent of change' is carried out through the entire project.Assists in coordinating business analyst tasks on information technology projects, problem tickets and provide support to other team members.Provides support, escalation response to production problem issues/errors. Performs root cause analysis and application resolution.Provides on call second-level escalation response for client issues and problem ticketsAssists in providing time estimates for project related tasks.Lead and conduct conference room pilots and demonstrations.Demonstrate solutions to client in a workshop setting.Promotes teamwork and leads by example.Assignment of work and development of less experienced team members.Ensure proper documentation and on-time delivery of all functional artifacts and deliverables.EDUCATION AND EXPERIENCE REQUIRED:Bachelor’s degree required; Advanced degree preferred.7 years of applicable work experience required; 5 years applicable experience in a Healthcare setting preferred. Preferred technical experience includes strong knowledge of state-of-the-art data warehouse methodologies in design, build, test, debugging problems, and ongoing technical support, and ability to articulate examples of workflows and processes associated with that experience.Deep expertise with various DBMS including Oracle, DB2, SQL server. Experience with the build of data warehouses, data marts with thorough analysis, design and documentation. Experience with Unix operating systems and Oracle database is preferred. Good understanding of HIPAA data Privacy and Security requirements. Previous supervisory experience preferred.Ability to be flexible and work analytically in a problem-solving environment. Good organizational, multi-tasking, and time-management skills. Excellent communication (written and oral) and interpersonal skills. Proven ability to work independently and as a team member. Experience with the System Development Life Cycle (SDLC). Healthcare experience includes knowledge of EDI transactions; knowledge of Medicare, Medicaid, commercial products; understanding of ACA.Experience with FACETS, IKA, PEGA and Windows and UNIX operating systems is preferred.Good understanding of HIPAA data Privacy and Security requirements. Experience in data warehousing, Data Mart environments.Deep expertise with Oracle database including SQL/ PL SQL, indexing, partitioning, views, materialized views, performance tuning and optimization.Understands Star Schema, Snow flake, Data Warehouse methodologies like Bill Inmon and Ralph KimballExperience with UNIX operating systems and Oracle database is preferred."}