{"jobID": "2822570376", "jobLocation": "Northville_MI", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Data Scientist Northville  Position Summary: As a Data Scientist, you will be actively contributing to ZF's digitalization strategy by challenging, experimenting and adopting bleeding edge Artificial Intelligence and Data Science methods and technologies, fostering and transferring knowledge and experience within ZF to explore potentials and create value for our business partners. You will run cost-effective data dive-ins on complex high volume data from a variety of sources and develop data solutions in close cooperation with business departments to get the maximum value out of data to uncover new business potentials across our entire value chain.  Position Responsibilities:  * Design, consult and implement data science, data analytics and data visualization use cases Team up with other data scientists and data engineers to develop data solutionsActively participate as a team member in innovation casesBuild up data and analytics capabilities and actively drive data science and artificial intelligence within ZF (incubator role)Establish data science related routines, develop data and analytics standards and guidelines, create, live & share a \"ZF data mindset\"Ensure a sustainable incorporation of data science skills and knowledge within ZF (e.g. by building up necessary qualifications)Engage in ideation workshops to identify relevant use cases within ZF, actively advise internal customers and pass on gained know-how at the different ZF locations for all data science and big data analytics related questions and requestsEngage in national/international data, tech & research communities and support ZF to become an active player and central hub in those network  Essential Skills and Experience:  * Bachelor's degree in Mathematics, Physics or Computer Sciences (or equivalent) with fundamental knowledge of data science and (big data) analytics technologies, processes and procedure models3+ years of experience in data science, (big data) analytics, statistics, artificial intelligence, application development and other related disciplines within a consultative or corporate environmentVery good knowledge of advanced analytics, machine learning and other related statistical and/or artificial intelligence methods (e.g. Deep Learning, NVIDIA, NLP)Profound knowledge of programming languages such as Python or R including associated data & analytics frameworks/libraries plus preferably additional programming languagesBasic knowledge of Advanced Big Data tools and technology (e.g. platforms like Microsoft Azure, NoSQL, Hadoop framework, Microsoft Power BI, Tableau,) and the overall data analytics lifecycle (from ingestion to visualization)Thorough knowledge of agile software development and agile methods such as scrumIndependent, systematic working methods and analytic skillsOutstanding ability to communicate, personal commitment, organizational skills, flexibility, creativity, teamworkPassion for data, always striving to learn new things and at the same time applying your skills and new technology to bring value to our business partnersData mindset and thinking always hungry for knowledge and looking for ways to improve and challenge the status quoHighly motivated and open personality with interpersonal skillsVery good knowledge of written and spoken EnglishProficient with oral and written English  Preferred Skills and experience:  * Experience in the Automotive industryGerman and/or Spanish language skillsProven ability to formulate strategic plans and implement programs on a regional and/or global basis  ZF North America, Inc. provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. ZF North America, Inc. complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. ZF North America, Inc. expressly prohibits any form of unlawful employee harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of ZF North America, Inc. employees to perform their expected job duties is absolutely not tolerated."}