{"jobID": "2746200940", "jobLocation": "Santa_Monica_CA", "jobTitle": "Deep Learning Research Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "nuTonomy aims to be the first company in the world to launch an autonomous taxi system, and we are building up an awesome team to make this goal a reality. We are developing the first-of-its-kind complete solution for providing point-to-point mobility via large fleets of autonomous vehicles. This includes software for autonomous vehicles, smartphone-based ride hailing, fleet management, and teleoperation. The company's software has been tested extensively on public roads in the U.S. and Singapore. We offer a unique opportunity to work closely with experts from a wide array of backgrounds, to create ground-breaking technology with potential for huge impact. As a member of a fast-growing start-up, you will be able to make a large contribution to the final product. For more information about nuTonomy, visit: www.nutonomy.comWe are looking for Deep Learning Research Scientists that will focus on architecting, training and analyzing deep neural networks to extract rich semantic information from multiple sensor modalities, with the goal of using the learned models in real-time for a variety of tasks, including object detection, scene segmentation, tracking & fusion, sensorimotor learning for calibration and fault detection, and behavior prediction. We are looking for experts with either (or both) academic or industry backgrounds.In this role you would work closely with other deep learning, computer vision, and robot perception experts to build a fully-integrated perception stack. nuTonomys approach consists in tightly coupled perception and planning, so you will interact with experts in planning and control to close the loop on actual robots. nuTonomys goal is to create provably safe and efficient vehicles, so we particularly value a rigorous statistical background and expertise regarding providing rigorous bounds for the performance of neural networks.To support your work, you will be able to use a state-of-the-art scalable computing, simulation, and testing environment, as well as a vast database of well annotated data from nuTonomys fleet of autonomous vehicles.You will join an awesome group of motivated colleagues, both industry professionals as well as leading researchers from academia, who like to approach problems with both creativity and rigor, to push beyond the state of the art.Thing you'll get to work on: Ph.D in Machine Learning, Applied Mathematics, Statistics, Computer Science or related field.Experience of architecting, training and analyzing CNNs for at least one of the following applications: Object detection, Image segmentation, Sensor fusion, Temporal fusion (tracking)Experience with Caffe, TensorFlow, MxNet, Keras, Theno or other deep learning frameworks.Excellent analytical, communication, and writing skills.Experience developing software as part of a team.Fluency in C++ or Python.Bonus points (but not required):Software development experience from industry.Experience in automotive or other real-time and embedded systems.GPU/CUDA programming skills.Proven track record of publications in relevant conferences (CVPR, ICML, NIPS, ICCV, ICLR)Familiarity with CUDA, Git, CMake, continuous integration tools and the agile development process."}