{"jobID": "2789062081", "jobLocation": "Brea_CA", "jobTitle": "Operational Analytics Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.newcenturyhealth.com", "Headquarters": "Brea, CA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " UnitedHealth Group, eviCore healthcare, Flatiron Health"}, "estimatedSalary": "117000", "jobDescription": "New Century Health is leading transformative change in specialty care management. By combining medical management expertise with a deep understanding of healthcare informatics, physician management and healthcare technology systems development, we generate insights that drive leading edge and effective innovation. What does this mean to you? It means that when you join us, you will be a key contributor to one the fastest growing healthcare services in the National Oncology and Cardiology care management space today. With your knowledge, skills and abilities, you will impact the delivery of care and directly contribute to our ability to positively impact and meet the critical unmet needs of patients suffering from all types of cancer.We support our employees with an outstanding benefit package that features programs like employee paid medical benefits, 100% match on your 401k contribution up to 4% of your base salary, generous tuition reimbursement, as well as above average paid time off. If you are interested in working with some of the most dedicated, passionate and smartest people on the planet, express your interest in speaking with us and we will respond immediately.SUMMARY:The person in this position will be responsible for the operational, compliance and audit reporting functions at New Century Health (NCH). The person in this position will manage a team of business intelligence developers and healthcare analysts that build reports for internal and external customers. System-wide data visualizations and reports are build with input from internal and external business stakeholders. The person in this position will work with stakeholders and cross-functional teams to determine the appropriate data sources, develop metrics, and implement automated reports. The position currently reports to the VP of Analytics. The person in this position must be a strong leader as well as bring solid analytical, critical thinking, and problem-solving skills to effectively meet organization and team goals.ESSENTIAL DUTIES AND RESPONSIBILITIES: Manages and mentors a team responsible for the design and development of business intelligence and data visualization applications Automates and manages the delivery of NCH’s operational, regulatory, compliance, and audit reporting for external clients. Ensures accurate and timely reporting to all stakeholders to meet or exceed SLAs.Lead projects to implement new application solutions using SSRS and Tableau.Execute business intelligence strategies to continually improve the organizations reporting and analytic capabilities. Foster a culture of innovation and initiate new processes which makes existing reporting more efficient and accurate. Collaborates with data warehouse and medical economics teams to develop a series of dashboards, encompassing key metrics that can be tracked across the organization on a daily/weekly/monthly basis. Develops project objectives, create project plans, communicates project strategies, and manages project timelines.Serves as a resource for training and consultation to deliver best-in-class business intelligence solutions. This includes performing presentations to internal and external customers to support the organization.Perform and manage queue of ad-hoc data requests/analyses. Collaborate with internal and external customer to provide key strategic insights/direction. Acts with honor and integrity, serving as a role model for company. Respects and maintains HIPAA confidentiality guidelines.Performs other duties as assigned.QUALIFICATION REQUIREMENTS:EDUCATION AND/OR EXPERIENCE:BA/BS in Business, Engineering, Statistics, Computer Science, Mathematics or related field is required. Master’s Degree is preferred.5+ years of experience in Business Intelligence, Data Warehousing, Data Modeling, including 2+ years in a supervisory or managerial role covering BI Reporting3+ years of healthcare experience.Complete lifecycle experience (data acquisition, data modeling, report building).Programming ability (ability to write and performance tune complex SQL queries, ability to maintain company-wide data models).Problem solving ability (creativity, technical rigor).Ability to ensure business needs is translated to proper BI requirements and translates the results into actionable deliverables to technical and non-technical business owners.Demonstrated proficiency in Microsoft Tools, SSIS, SSRS, SQL, and Tableau. Experience and proficiency with SAS is also preferred.OTHER SKILLS and ABILITIES:Practice and payer experience.Ability to work successfully in a dynamic environment.Ability to develop new ideas and creative solutions.Ability to set vision and establish goals for team.Leads by example, motivates others through her/his efforts.Ability to manage complex people and management situations. "}