{"jobID": "2775757771", "jobLocation": "Chicago_IL", "jobTitle": "HR Business Analyst - Data and Decision Support, Full-Time, Days", "companyRating": "3.8", "companyInfo": {"Website": "www.nmh.org", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1965", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Rush University Medical Center, Advocate Health Care, University of Chicago Hospital"}, "estimatedSalary": "71000", "jobDescription": " Northwestern Medicine is an integrated healthcare system that brings together physicians and researchers from award-winning facilities in the Chicago area. Each of the Northwestern Medicine hospitals has a unique story, but the system shares the same vision. We are committed to superior quality, academic excellence, scientific discovery and patient safety.  The Human Resource Information Management Team is looking for a HRMS Business Analyst to join their growing team.  How will I impact the business?  As the Business Analyst you will provide functional support across our HR Management Systems. You will assist in the creation and development of ad-hoc reports, tools, processes, and insights to support our internal customers. Working directly with the program manager, you will gain hands on experience with HR data across a large matrixed environment and work with some of the brightest talent in data management in the Greater Chicagoland area. You will collaborate with senior leaders to determine how we manage our content and leverage technologies to communicate data, insights, and information to our internal customersYou will monitor, report on, and promote data quality across multiple systems and Medias which include databases, cloud services, websites content, and surveys.You will help to develop standard methodologies for governing tools, data quality, content, and insightsYou actively assist in the research, development, and deployment of insights, tools, and improved processesYou track, administer, and provide feedback on HR content and data quality to ensure we uphold a high standard of data excellenceYou will solve problems and maintain the PeopleSoft HCM systemYou can effectively communicate with the business users to gather functional requirements for system processing, screen and/or interface designsYou build functional specifications to communicate business requirements with IT developers and/or third party vendorsYou will motivate users to embrace systems and process changes implemented during projectsYou will create queries or reports in support of data requests. What skills are meaningful to be successful in this role? We appreciate tech-savvy professionals who have a real passion for finding meaningful insights from dataWe value curious and analytic thinkers who are not afraid to ask questions to more deeply understand the businessYou are highly organized and have the ability to prioritize under multiple deadlines.We love professionals who insert positive energy into our businessWe appreciate your analytical approach and ability to \"paint the picture\" of HR trends and insights Do I have what it takes to be considered? Experience with Data Visualization Tools such as Tableau, Oracle Analytics, PowerBI, MicrostrategyBeginner to intermediate knowledge of creating reports, writing SQL, and relational databasesAbility to use and explain statistical techniques (Regression, cluster analysis, A/B Testing, Neural Networks)Experience with statistical tools (R, Python, SPSS, MiniTab, etc.)Strong collaborative natureExceptional communication and presentation skillsAA/ EEORequired:1 year experience in a Business Analyst role.Desired:Bachelors Degree in Business, Information Services, or Mathematics BackgroundSDL2017"}