{"jobID": "2761539129", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Engineering Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.servicenow.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (NOW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " BMC Software, CA Technologies, Salesforce"}, "estimatedSalary": "138000", "jobDescription": " ServiceNow is changing the way people work. With a service-orientation toward the activities, tasks and processes that make up day-to-day work life, we help the modern enterprise operate faster and be more scalable than ever before.  If you thought you knew about ServiceNow and what we do, take a look again!  Our products lines are diverse and robust. The Enterprise Cloud is dynamic, scalable to billions of transactions weekly, and global in scope and size.  As a part of the core Platform as a Service offering, the Intelligent Automation Development team is building the core machine learning/AI/predictive analytics technology that will power revenue generating business use-cases using customer data to predict desired outcomes automatically; hence delivering a manifold increase in productivity of business processes of ServiceNow customers. The team focuses on operationalizing machine learning and predictive analytics use cases for all ServiceNow business applications.  We employ only the brightest and most forward-thinking predictive analytics developers on the planet. We have offices in Chicago, San Diego, San Francisco and Santa Clara and work as a distributed team. Come join the Intelligent Automation team and make your mark in the most challenging problem area - helping customer derive the insights from their own data on ServiceNow platform for enterprise applications, each customer at a time! What you get to do in this role: Machine Learning team in ServiceNow is looking for a new leader for enhancing its automation capabilities and providing new offerings to help take us to the next level in enabling people to automate processes. This is a very strategic position for our company. As a Manager in ServiceNows machine learning group you will be in a position to hire the best team possible, influence product direction, define architecture and ensure quality of product that eventually makes it to our customers. The right person for this role should be ready to scale out a high performing team of software developers.  The candidate is expected to be very hands-on, not just getting deep into the technical details but truly leading efforts and knowing directionally where the team needs to go. Success will require becoming fluent in the ins and outs of the ServiceNow Machine Learning platform, handling multiple competing priorities in a fast-paced environment and strong leadership skills. The candidate should to be able to plan and coordinate complex discussions across teams; working with technical and non-technical users to ensure our goal of becoming the industry standard platform for no-code/low-code development.  Best of all, you get to help define and staff our new Chicago office for Machine Learning team. In order to be successful in this role, we need someone who has:Ability to create high performance, scalable systemsStrong problem-solving, debugging skills and an aptitude for learning new technologiesA working knowledge of machine learning and natural language processing is critical for success. Knowledge of java machine learning libraries (weka, dl4j, etc.) is a definite plus.A strong track record of project delivery for large, cross-functional, projects.Very strong technical skills with a proven record of strong architecture & design experience.Experience with Cloud Application Development PlatformsExperience with ServiceNow PlatformExperience working with a continuous integration continuous deployment environmentAdvanced Degree in Computer Science/Engineering or equivalent is a must.Management SkillsAbility to lead by example (see technical skills)Ability to identify, recruit, cultivate and retain high performing software developersAbility to handle multiple competing priorities in a fast-paced environment.Excellent written and verbal communication skills with the ability to present complex technical information in a clear and concise manner to a variety of audiences. We provide competitive compensation, generous benefits and a professional atmosphere. This is a very collaborative and inclusive work environment where individuals strong on aptitude and attitude will have an opportunity to grow their professional careers through working with some of the most advanced technology and talented developers in the business.  This position is based in Chicago, IL with occasional travel to ServiceNow offices around the world."}