{"jobID": "2833073930", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher", "companyRating": null, "companyInfo": {"Website": "www.ginkgo-llc.com", "Headquarters": "Incline Village, NV", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Qualifications Education: Ph.D. in Computer Science, Physics, Applied Sciences, Mathematics, and Engineering from a top university 3.5 GPA Minimum Experience with at least four (4) or more of the following: Proficiency in C++ and object-oriented programming Proficiency in Python Experience with machine learning Deep Learning Neural Networks Probability/statistics Experience with graphical user interfaces Familiarity with digital signal processing Experience dealing with exchange connectivity Working knowledge of LINUX environment Experience with time-series analysis Familiar with automated/algorithmic trading Regression analysis Raw analytic ability Our group thrives on teamwork and collaboration, so strong communication is an absolute necessity. Relocation to Lake Tahoe is required BENEFITS Competitive compensation structure Opportunity to join a rapidly expanding firm at an early stage and make a substantial and meaningful impact Lunch is provided daily along with snacks and drinks Health, dental, and vision insurance plans with 100% covered premiums for all employees and their legal dependents Relocation assistance with one month sponsored housing is provided for employees moving to the area No state income tax in Nevada WHY LAKE TAHOE? We stand out among our peers by embodying a true work-hard, play-hard culture that includes hiking, skiing, golfing, various water sports, and much more. Our office is a 10-minute walk to a semi-private beach on beautiful Lake Tahoe You can see a ski resort from our office and we are centrally located to over five major ski resorts Known as the jewel of the Sierras , Lake Tahoe is conveniently located east of San Francisco, Napa Valley, and other Bay Area attractions Our close proximity to Silicon Valley allows us to stay connected to the technology hub We are an expanding, technology-driven proprietary trading firm based in beautiful Lake Tahoe! Relocation to Reno/Lake Tahoe area is required. We are seeking highly motivated and talented individuals to work on the most challenging engineering problems in high-performance computing, big-data analysis, and hardware-software codesign.  Associated topics: c, c++, c c++, electronic engineering, informatic, linux, processor, python, schematic, software engineer"}