{"jobID": "2791264265", "jobLocation": "Princeton_NJ", "jobTitle": "Process Development Scientist 3 (Analytical Development)", "companyRating": null, "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": null, "jobDescription": " Job DescriptionWhen youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals. Location: Princeton, NJ How will you make an impact? This is a scientist level 3 position in the Analytical Development group working on proteins, monoclonal antibodies, and other biologics. The responsibilities include method establishment, development, transfer, and qualification, and routine sample analysis to support process development and pilot production. The analytical methods routinely used include cGE and cIEF etc. What will you do?Establish, develop, qualify, and transfer analytical methods. Work with Quality Control and other Operations groups to trouble-shoot and improve existing analytical methods.Design experimental plans based on the defined deliverables, planning the activities to meet the project timelines by working closely with project managers.Routine sample analysis to support process development. Work with Process Development and Manufacture groups to trouble-shoot process challenges.Record results in notebook accurately, clearly and regularly.Prepare protocols and reports and test methods as needed.Present and discuss data at project and department meetings.Maintains laboratory equipment and suppliesMaintains and ensures safe laboratory environment and work practices.  How will you get here? Education Bachelors degree in a relevant scientific or engineering field. ExperienceHands-on experience with cGE and/or cIEF is requiredProven ability to design and execute the studies based on the deliverables.Excellent writing, communication and presentation skills requiredWorking knowledge of GMP/ GLP regulations in cGMP/ cGLP manufacturing environment is preferred.Routine use of MS Excel, MS PowerPoint and MS Word is essential.Ability to work in a fast paced environmentExcellent organization and planning skillsThermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}