{"jobID": "2828838316", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.motorolasolutions.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1928", "Type": " Company - Public (MSI) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Cisco Systems, Huawei Technologies, IBM"}, "estimatedSalary": "133000", "jobDescription": "Title Data Scientist  27-Jun-2018 City Chicago,USA Job Description***To be considered for the role, please submit a cover letter with a description of the most interesting data analysis you’ve done, key findings and its impact. Also include a link or attachment of code you’ve written related to data analysis. Motorola Solutions’ innovations, products and services play essential roles in people’s lives. Our end-to-end suite of software solutions help our customers answer thousands of emergency calls and text messages, and process video, disparate evidence and records. Making sense of all this data and providing insights that potentially help save lives could be your job. With all this data, we’re looking for talented data scientists to join the Data Science team to help us better understand our users and build better products. If you are data curious, excited about deriving insights from data, and motivated by having an impact on the business, we want to hear from you.  The candidate will join a team of data scientists and engineers in 28Labs at Motorola Solutions. You will collaborate with a multi-disciplinary team of scientists, engineers and product stakeholders on a wide range of problems. This position will bring analytical rigor and statistical methods to the challenges of measuring quality, improving our products, and understanding the behavior of end-users to help them succeed in moments that matter. We look for the most advanced problems solvers - like you - to help us create technologies that rise to the challenges of our customers.  You Will: Work closely with product and business teams to identify important questions and answer them with dataDesign core metrics that serve as the North Stars for team efforts and model trade offs across product areasApply statistics, modeling, and ML to improve the efficiency of systems and relevance algorithms across our suite of solutions for public safety and commercial customersDevelop, and improve algorithms that help our systems make recommendations based on predictive models under given constraints while optimizing key performance indicatorsCommunicate proposals and results in a clear manner backed by data and coupled with actionable conclusions to drive business decisions The candidate will be a part of our Data Science & AI team in 28Labs at Motorola solutions in the role of a hands-on data scientist responsible for the entire end to end process of data exploration, development, implementation, and maintenance of business-changing models and algorithms. Unlike similar roles in the industry, the result of your work has the potential to impact the entire lifecycle of the public safety workflow impacting people's lives in moments that matter.  Required Skills: 2+ years experience working with and analyzing large data sets to solve problemsA MS or PhD in a quantitative field (e.g., Economics, Statistics, Sciences, Engineering, CS)Expert knowledge of a scientific computing language (Preferably Python or R) and SQLStrong knowledge of statistics and experimental designStrong written and oral communication skills Desired Skills: Prior experience with data-distributed tools (Spark, Hadoop etc)Experience with machine learning on large datasets (deep learning and experience with Tensorflow, Keras etc. would be a plus)Experience with a variety of NLP methods for information extraction, topic modeling, parsing, and relationship extraction would be a plusExperience with Tableau or similar visual analysis tool, developing visually compelling interactive dashboardsActivity in the Open Source community is a strong plusJob ID7250BRCountry United States Basic Requirements2+ years experience working with and analyzing large data sets to solve problemsA MS or PhD in a quantitative field (e.g., Economics, Statistics, Sciences, Engineering, CS)Expert knowledge of a scientific computing language (Preferably Python or R) and SQLRelocation Provided None Position Type New Grad Job Category Engineering and Sciences Department Description28Labs is the Chief Technology Office and innovation engine for Motorola Solutions. We are user-focused and outcome-driven, identifying problems and creating solutions based on research and engagement with our customers.  Considering our customers' unique \"jobs to be done\" is a foundational principle of 28Labs. Based on their needs, we create solutions by applying our experience in user experience and design, advanced wireless communications and solutions, cloud & mobile application architecture, cybersecurity, user & human factors research, imaging, analytics, and artificial intelligence (AI).  Software and hardware technology and platform solutions developed by 28Labs form the basis of many products and solutions offered by Motorola Solutions. We also manage the Motorola Solutions Venture Capital investments and intellectual property across the company.  This candidate will work as part of the Data Science & AI Team in 28Labs (CTO).Travel Percentage Under 10% Company Overview On any given day, every moment matters to someone, somewhere. And every moment, Motorola Solutions’ innovations, products and services play essential roles in people’s lives. We help firefighters see around buildings and police officers see around street corners. We keep utility workers connected and visible to each other with real-time voice and data communication across the smart grid. And we provide the situational awareness first responders need when a moment brings catastrophe. We help people be their best in their moments that matter. State/Region/Province Illinois EEO Statement Motorola Solutions is an Equal Opportunity Employer committed to no discrimination because of race, color, creed, marital status, age, religion, sex, national origin, citizenship, sexual orientation, gender identity or expression, genetic information, disability, protected veteran, or any other legally protected characteristic. "}