{"jobID": "2815127558", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.tala.co", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " At Tala, we are connecting millions of people to the financial services they deserve. The Data Analytics team operates in a nimble working style, flexing between a variety of business questions and data needs at the company. We are asked to investigate and solve big questions other companies have yet to find solutions for such as digital identity management and understanding customers fully based on their mobile data. You will be part of an innovative and fast growing team that pushes to provide access, choice, and control to millions of customers.  As a Data Analyst, your goal is to deeply understand internal client needs and to build out data products that provide the company with real-time and in-depth insights about our diverse customer base.  This role will be based out of our Santa Monica, CA office. In this role you will:Be a key resource: become an expert on Tala's data infrastructure, analytics tools, and best practices in data-driven research for the companyBe curious: investigate new data sets, identify strategic opportunities for improving servicing for our customers, and share your findings with our partner teamsBe a multiplier: build out new data flows as our product changes, and produce high-value, timely analytics based the unique aspects of each of our marketsWhat we're looking for:BA/BS in a quantitative fieldExpert in at least one analytics language (ex. Python, R)Proficient in SQL, GitHub, bash commandsExperience interning or working in a data-intensive role (or equivalent experience)Perfect candidates would have:Experience with multiple types of messy data in a business environmentExperience in emerging markets (either personally or in professional scope)Modeling and machine learning expertise outside of school or KaggleAbility to juggle multiple projects effectively in a fast-paced environmentAbout Tala: Tala is a mobile technology and data science company that is working to deliver financial access, choice and control to underserved people around the world. Tala's smartphone app instantly evaluates customers for credit using only the data on their devices and delivers customized loans in minutes.  Tala, formerly known as InVenture, is backed by IVP, Ribbit Capital, Lowercase Capital, Data Collective, Collaborative Fund and other leading venture and impact investors. In 2016, Fast Company ranked Tala, formerly known as InVenture, as one of its top 10 companies in Money, and Forbes named Tala as one of the top 50 FinTech companies in the world. Additionally, Tala's work has been highlighted by the New York Times, the Financial Times, the Wall Street Journal, TED, and Wired, among others.SDL2017"}