{"jobID": "2835223747", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Marketing Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.freedomdebtrelief.com", "Headquarters": "Tempe, AZ", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "WHO WE ARE:  Freedom Financial Network is a family of companies that takes a people-first approach to financial services, using technology to empower consumers to overcome debt and create a brighter financial future. The company was founded in 2002 by Brad Stroh and Andrew Housser on the belief that by staying committed to helping people, you can ensure better financial outcomes for both the customer and the business. This Heart/$ philosophy still guides the vision of our growing company, which has helped millions of people find solutions for their financial needs.  What began with 2 people in a spare bedroom has now rapidly expanded to a vibrant business that employs over 1700 employees (known internally as The Freedom Family) in two locations: San Mateo, CA and Tempe, AZ. When you visit either of our offices, you’ll understand why our employees have voted us the Best Place to Work for the last several years. It’s a place where the Heart/$ philosophy continues to thrive, where we believe that success is only achieved by doing what’s right for our customers, our employees, and our communities.  In order to create brighter futures for our clients, employees, and businesses, Freedom Financial Network holds itself to four core values that have grown out of our Heart + $ philosophy: to care for everyone around us, act with integrity every time, collaborate with everybody we work with, and get better at what we do every day.  THE OPPORTUNITY:  Freedom Financial is looking for a Senior Marketing Data Analyst to join the Enterprise Analytics team and drive value for our Marketing and Partnership Development groups. The company is growing extremely fast and is looking for an experienced professional to help facilitate that growth by delivering world class reporting, analytics and insights. You will align with our Freedom Debt Relief or FreedomPlus lending division, both of which are growing rapidly from solid foundations.  You will work directly with executive leadership, management and marketing channel managers who will depend on you to help them see trends and identify opportunities. Your work will be critical to support data-informed decision making at the highest levels of our company.  THE ROLE: Perform deep data research and analytical work in order to provide data-driven insights and reports to our Marketing and Partnership Development teamsProduce actionable results that business can leverage to set strategic direction and make day to day decisionsCreate descriptive, diagnostic and predictive analytics & reporting solutionsEffectively present complex analysis and insights to various stakeholdersBring critical data to life through visualization and storytellingHelp build scalable solutions for analytical projectsCommunicate actively and effectively with analytical peers, business partners, and company leadership REQUIREMENTS/CHARACTERISTICS: Bachelor's degree in Marketing, Business, Statistics, Computer Science, Mathematics or related field4+ years of professional experience analyzing marketing or customer acquisition data and providing valuable, data-centric insights and solutions using advanced Excel and SQLExperience developing and maintaining analytical reports using TableauExperience analyzing A/B and multivariate results for campaign and form testsPrior execution of digital and offline channel attribution analysis preferredComfort with tracking and analytics tools such as Facebook Pixel, Facebook Atlas, Google Tag Manager, Google Analytics, and Optimizely preferredStrong analytical, organizational and interpersonal skillsEffective communication skills required to present information to a diverse audienceAbility to adapt to a rapidly changing environment and execute many complex tasks simultaneouslyHighly motivated self-starter with the ability to work efficiently with minimal supervisionKnowledge of and curiosity to stay current on industry analytical trendsExperience analyzing financial services products and businesses preferred WHY JOIN THE FREEDOM FAMILY? Fast, continued growth – there’s a lot of opportunity for advancementVoted a Best Place to Work multiple times by our employees, most recently #1 in Phoenix!Benefits start within 30 days401k with employer match3 weeks’ paid vacation (increased with tenure)9 paid holidays & 5 sick daysPaid time off for volunteer work and on your birthdayCULTURAL FIT (Our Core Values):Care (for everyone): We show compassion and contribute to the well-being and growth of those around us. We only pursue products that improve the financial lives of our clients.Act with Integrity (every time): We take the right action even when it is hard and even when no one is watching. We treat our employees, clients, and communities the way they wish to be treated.Get Better (every day): We innovate, iterate, and improve each day. We are creative, take thoughtful risks, and ultimately learn and recover from failures.COLLABORATE (with everybody): We strive to work together toward a common purpose by proactively sharing information and inviting participation. We recognize the perspective of various groups and embrace healthy, constructive debate. This is your opportunity to be part of a growing company where dedicated professionals strive to help customers and each other succeed every day. If that sounds exciting to you, we want to talk to you. Apply today!  Attention Agencies & Search Firms: We do not accept unsolicited candidate resumes or profiles. Please do not reach out to anyone within Freedom Financial Network (FFN) to market your services or candidates. All inquiries should be directed to Talent Acquisition only. We reserve the right to hire any candidates sent unsolicited and will not pay any fees without a contract signed by FFN’s Talent Acquisition leader. Thank you for your consideration.  #FFN"}