{"jobID": "2826690429", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Machine Learning Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "178000", "jobDescription": "Sr. Machine Learning Data Scientist Job Number: 114001466Santa Clara Valley, California, United StatesPosted: Jun. 25, 2018Weekly Hours: 40.00 Job SummaryWould you like to be part of a team that impacts millions of users every single day? Does finding patterns in data and building highly scalable data-driven systems to tackle real-world problems excite you? Do you loose sleep pondering about the algorithm that accurately predicted your recommendation? If so, we'd love to hear from you.  The Apple Analytic Insight team is looking for an extraordinary data scientist who is passionate about designing, developing, and fielding data mining solutions that have direct and measurable impact to Apple. You will work with various business leaders and executives to help identify viable data mining opportunities and then implement end to end analytical solutions. You have a broad knowledge of existing data mining algorithms and the creativity to invent and customize when necessary.Key Qualifications Familiarity with database modeling and data warehousing principles with a working knowledge of SQL.Creativity to go beyond current tools to deliver the best solution to the problemStrong programming skills in Python, Java, C++, or similar languageExceptional interpersonal and communication skillsProven ability to work independently and make key decisions on projectsSavvy at extracting knowledge from data DescriptionApple has a tremendous amount of data, and we have just scratched the surface in pattern detection, anomaly detection, predictive modeling, and optimization. There are many exciting problems to be discovered and solved and many business owners eager to leverage data mining. We encourage our scientists to stay abreast of data science research by attending conferences and working with academic faculty and students. We support a collaborative work environment, but allow solution autonomy on projects. Responsibilities:Conceive and design end to end data science solutions to support Apple's business units and initiatives.Work with business owners to map business requirements into technical solutions.Develop and implement solutions to fit business problems, which may include applying algorithms from a standard tool or custom algorithm development.Work closely with data warehouse architects and software developers to generate flawless business intelligence solutions for end users.Support production analytic solutions.Perform ad-hoc statistical and data science analyses.Present results of analyses to business units.EducationPh.D. in Data Science, Machine Learning, Statistics, Operations Research or related field; Or M.S. in related field with 5+ years of experience applying data science techniques to real business problems."}