{"jobID": "2831323153", "jobLocation": "Austin_TX", "jobTitle": "Geo Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.cubic.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1951", "Type": " Company - Public (CUB) ", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Northrop Grumman, Xerox"}, "estimatedSalary": "63000", "jobDescription": "Business Unit:Cubic Transportation SystemsCompany Details:Business Unit: Cubic Transportation SystemsCubic offers an opportunity to provide innovative technology for government and commercial customers around the globe, helping to solve their future problems today. We're the leading integrator of payment and information technology and services for intelligent travel solutions worldwide, and the leading provider of realistic combat training systems, secure communications and networking and highly specialized support services for military and security forces of the U.S. and allied nations.  At Cubic Transportation System (CTS)/Nextbus, we are building the next generation of transit solutions and we believe that Transit Management as a Service (TMaaS) will enable the next generation of transit environments and provides Intelligent Transportation System (ITS) capabilities for managing transit systems. We will achieve our vision by: Empowering travelers with richer information in more places. Proactively managing on-time performance for better customer satisfaction and Fully integrating transit information, operations and payments.  If you have an entrepreneurial spirit and thrive in an innovative environment, we want to talk to you about your next role at NextBus! We are seeking employees inspired by technology, and motivated by the rewards of hard work, commitment, teamwork, quality, integrity, and respect. We invite you to explore opportunities with Cubic.Job Details:  Job Summary: The Geo Data Analyst plays an integral part in the analysis, processing, and integration of various transit data into the data model. The Analyst uses various software tools to verify and visualize transit data, execute configuration workflows, and monitor the performance of real time passenger information systems. Works closely with team members to service client accounts by executing a wide range of data processing tasks directly affecting and used in evaluating daily system performance. This position typically works under supervision of the Senior Geo Data Configuration Manager, in daily collaboration with both Project Management and Engineering teams to fulfill customer satisfaction needs Essential Job Duties and Responsibilities:Evaluates route schedules and associated configuration data from transit agencies to meet quality standards. Familiarization with GTFS is highly desirable.Analyzes and processes transit configuration data using numerous internal processing tools.Edits and/or corrects transit configuration data as part of schedule and route updates.Works with tools to convert transit configuration data to appropriate formats for further automated processing.Uses effective time management practices to ensure deadlines are met consistently.Availability for off-hours, remote support as required.Minimum Job Requirements: Four-year college degree in Geography, Math, GIS or Computer/Data Science, plus two years of directly related professional experience. A working knowledge of both MS Windows and Unix operating systems, as well as SQL syntax. Experience with office software packages (Microsoft Office, etc). Demonstrated experience in manipulating large data sets with a high level of attention to detail. Ability to create and modify scripts using Python, Bash, etc. Experience with using and/or developing software tools to work with GTFS data , and converting to other data formats for visualization, processing and analysis. Self-motivated team player with a positive attitude of cooperation, and the ability to accept constructive criticism. Good interpersonal and communication skills in interacting with professional technical and non-technical persons. A quick learner who can easily adapt to a fast changing environment. Works in a measured, organized, and logical manner. Experience in using mass transit, with a strong interest in improving public transportation. Availability for off-hours, remote support as required.  The description provided above is not intended to be an exhaustive list of all job duties, responsibilities and requirements. Duties, responsibilities and requirements may change over time and according to business need. Worker Type: EmployeeSDL2017"}