{"jobID": "2759505006", "jobLocation": "Detroit_MI", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.meridiantsi.com", "Headquarters": "Frederick, MD", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who we are: Meridian Health Plan is a family-owned, family-operated company of passionate leaders, achievers, and innovators dedicated to making a difference in the lives of our members, our providers and in the healthcare industry.  We provide government-based health plans (Medicare, Medicaid, and the Health Insurance Marketplace) in five different states (Michigan, Illinois, Indiana, Kentucky, and Ohio).  Our employees work hard, play hard, and give back. Meridian employees enjoy: Happy hours, special events, company sports teams, potlucks, Bagel Fridays, weekly Executive Lunches, and volunteer opportunities. A Day in the Life of a Sr. Data Analyst: Reporting to the Department Director, the Senior IT Data Analyst becomes the organizational expert with all things data related, including sources of data, sources of truth, file and table content, field names and definitions, data standards, data governance, and meta data. This position is responsible for understanding departmental data needs for reporting and analysis, and will be a key player in the “Data as a Service” function within the department. This position also, provides general operational support and guidance to OLTP systems as it pertains to data issues or requirements. The Senior IT Data Analyst provides analytical and reporting support to help the organization make well-informed business decisions consistent with current trends in the healthcare industry. Leads data analysis efforts at many levels: 1) ad-hoc on demand to sleuth immediate issues, 2) preparing data for descriptive reports in support of operations and/or other requests, 3) creating visual analytical presentations.Leads and mentors junior data analysts.Guides end-users with selection and usage of data. Acts as a data subject matter expert to assist departmental consumers on proper data selection and usage.Performs data quality assessments on proposed data feeds or on existing repositories, utilizing manual query methods, visual observation, and/or data profiling tools.Leads the investigation of data issues due to any reason, including poor quality, improper content, over loaded fields, missing data, missing referential integrity, etc.Champions and contributes to data glossary terms and definitions; ensures crystal clear definitions of data elements.Leads the creation of and teaches the data usage training sessions.Helps to lead database content decisions, i.e. field naming, data type selection, domain value ranges, etc.Represents the department in interactions with IT and business unit subject matter experts to gain better understanding of how data supports business processes.Participates in project planning and attends project-status meetings while assisting with the management of various project timeline and/or implementationsLeads the creation of Data Policies & Procedures (“P&P;’s”) utilizing various mediums, including but not limited to flow-chart mapping and written narrativesWhat you can bring to Meridian:Bachelor’s degree or Fellow Designation from the Academy of Healthcare Management (“AHM”) is requiredThorough understanding of SQL and relational databases is required.Experience with data reporting tools such as Tableau, Qlik, Oracle Answers, Cognos, Business Objects, Crystal Reports, SAS, or similar tools.Experience in a data management program with knowledge of data governance is desired.Experience with healthcare data or related health care industry experience desired.Experience in a data intensive environment with many data subject areas, and the ability to understand the relationships amongst the various healthcare data subject areas.Teamwork experience is requiredDemonstrated adaptability and flexibility to changes and response to new ideas and approaches is requiredKnowledge of data architecture, relational database design and dimensional design.Knowledge of managed care and government programs is preferredKnowledge of the health insurance industry is preferredKnowledge of National Committee for Quality Assurance (NCQA), URAC and/or general accreditation standards is preferredSuperior verbal and written communication skillsSuperior analytical and problem solving skillsSuperior computer skillsAdvanced SQL capabilityDemonstrated willingness to work in a fast-paced, team-oriented environment while maintaining a constant focus on quality-improvement and opportunities to enhance member satisfactionAbility to demonstrate patience, courtesy and professionalism during every engagement with all internal and external stakeholdersAbility to learn new skills and acquire knowledge in both the independent and team settingsAbility to think critically, identify issues with current processes and propose solutions to identified issuesWhat Meridian can offer you:Our healthcare benefits include a variety of PPO plans that are effective on the first day of employment for our new full-time team members.Opportunity to work with the industry’s leading technologies and participate in unique projects, demonstrations, conferences, and exclusive learning opportunities.Meridian offers 401k matching that is above the national average.Full-time MHP employees are eligible for tuition reimbursement towards Bachelor’s or Master’s degrees.Meridian Health Plan was named Detroit's #1 Fastest Growing Company by Crain's Magazine, so it is a great time to get involved with Meridian. EQUAL OPPORTUNITY EMPLOYER  #MNSTR"}