{"jobID": "2831588001", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.wimmersolutions.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Xtreme Consulting, Slalom, Revel Consulting"}, "estimatedSalary": null, "jobDescription": "DATA ANALYST Our Client is looking for a Data Analyst to join their growing team in California. The ideal candidate is someone with strong data migration experience and is highly proficient doing ETL work in an AWS environment. You will do everything from migration to review with the chance to help dictate and improve internal processes. If this sounds like the next step for your career, let’s talk! RESPONSIBILITIESMigrate, optimize, organize and streamline many different data intensive initiatives used to support Research effortsReview the existing data to build efficient, automated solutions to make current processes more efficientDesign new solutions to expand and refine the current data setREQUIREMENTSBachelor's Degree5+ years’ work experience as a Data Engineer or Data AnalystData Migration and AWS experienceAbility to organize and manage large data setsIn-depth understanding of database structure principlesCoding knowledge and experience with several languages: C, C++, Java, JavaScript, Python, SQL and related data gathering and analysis tools as well as Sqoop (SQL to Hadoop)Proficient in enhancing data collection procedures to include information that is relevant for building analytic systemsStrong skills in processing, cleansing, and verifying the integrity of data used for analysisCapable of doing ad-hoc analysis and presenting results in a clear mannerExperiencing managing end to end data systems and processesExperience with data visualization toolsExperience with Unix Shell scriptingPREFERRED QUALIFICATIONSKnowledge of MPP PlatformMore about Wimmer Solutions At Wimmer Solutions, we’ve built a reputation for results-driven, innovative, business and technology solutions that help companies execute on their strategic initiatives. We custom tailor our services to fit our clients’ needs from consulting and technology process outsourcing to interim technical talent resourcing.  We’re all about people and community. Since 2002, we have offered technology staffing and managed services for the great Seattle area. We focus on getting to know our clients and candidates to create lasting partnerships and ensure success. Not only do we provide a wide variety of benefits like medical and dental, but we are also committed to inspiring and creating positive change in the world with our community outreach programs. You will join a large team of professionals who are passionate about their careers as well as their community. For more career opportunities or to refer a friend, please visit http://wimmersolutions.com/careers."}