{"jobID": "2784046017", "jobLocation": "Princeton_NJ", "jobTitle": "Center For Observational Research & Data Sciences - Scientist Lead", "companyRating": null, "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Center for Observational Research & Data Sciences (CORDS) - Scientist Lead (D7) is an individual contributor responsible for performing non-interventional research projects in support of key customer groups including HEOR, PV&E;, local HEOR teams, Medical and others. Project work includes support of protocol development, identification of appropriate data sources, execution of protocol-related programming, analysis and summary of data and collaboration with customer on presentation of results. In addition, this role will supply methodological expertise on non-interventional research methods to the CORDS team and the broader BMS outcomes research community, serve as a knowledge resource for the data development team, work with the Director, Research, to coordinate therapeutic area support and communication, and mentor Manager, Research staff. Responsibilities: Conduct non-interventional research projects using retrospective data resources in support of CORDS customer needs  Communicate project status and results effectively to all stakeholders  Engage with customer teams on protocol development, statistical analysis, interpretation and presentation of results and strategic direction of messaging and research needs.  Provide scientific leadership and guidance related to health and economic outcomes research using non-interventional methods  With guidance from team Lead, assist staff with execution of research projects across customer teams  Mentor staff in development of functional and behavioral skills related to job performance.  Engage key CORDS customers in research and market access needs assessment in order to plan and execute value-focused research projects  Assess information environment and analytical tool set to ensure current needs are met and future needs are communicated for assessment by CORDS Data Development team  Complete other duties as assigned by CORDS Lead Requirements Masters in biostatistics, epidemiology or related quantitative research field; PhD preferred  5-7 years experience in pharmaceutical outcomes research, pharmaco-epidemiology, health services research or related field  4+ years experience using large retrospective data sets in the conduct of epidemiologic and economic research  4+ years experience with statistical programming using SAS  Experience with protocol development and execution for health and economic outcomes research projects  Proven strong writing and oral presentation skills  3+ years project leadership experience preferred  An ideal candidate will have some experience with the following tools and data analysis methods:  Software: SAS, SQL, R, Java, Matlab, C++, Python  Data analysis methods: predictive modeling, decision tree analysis, clustering, data mining, data processing, genetic algorithms, machine learning, active machine learning (optimal experimental design), Bayesian optimization"}