{"jobID": "2796495826", "jobLocation": "McLean_VA", "jobTitle": "Senior Data Scientist/Architect", "companyRating": null, "companyInfo": {"Website": "www.csg-llcusa.com", "Headquarters": "Kissimmee, FL", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Government", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Consulting Services Group, LLC (www.csg-llcusa.com)  Consulting Services Group (CSG) is a niche provider of intelligence related support services. Clearance Requirement: Active TS/SCI clearance with poly is required. Benefits: Salary We offer competitive compensation packages with plenty of opportunity for advancement.  Health Insurance CSG will pay 100% of the employee’s health insurance premium. Family insurance options are available through payroll deduction.  Dental Insurance CSG will pay 100% of the employee’s insurance premium. Family insurance options are available.  PTO (Paid Time Off) CSG grants a total of 160 PTO hours per year. We recognize 10 federal holidays (4 floating).  Senior Data Scientist/Architect - McLean, VA GENERAL PURPOSE:ESSENTIAL DUTIES/RESPONSIBILITIES:Experience using machine learning algorithmsExperience analyzing customer needs, including participating in strategic planning, and ensuring solutions adopted are appropriate to meet objectivesPrior experience with model and algorithm development and optimizationExperience working with software engineers to implement and produce models and algorithmsUnderstanding of cybersecurity operations and best practicesTechnical expertise/capabilities to perform database management (including evaluation, system analysis, and the design of complex applications)Strong knowledge of software engineering best practices and computer scienceQualifications Required: Education: Bachelor's degree in related discipline and 8+ years' experience, or master's degree in fields such as mathematics, engineering, social sciences and 5+ years' experience. Other:No OCONUS travel is requiredMinimal local travel in the DC metro area required15% Shift Differential is paid to those personnel assigned to the night shift"}