{"jobID": "2788657114", "jobLocation": "Sacramento_CA", "jobTitle": "Environmental Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.cardno.com", "Headquarters": "Brisbane, Australia", "Size": "10000+ employees", "Founded": " 1945", "Type": " Company - Public (CDD) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " AECOM, Stantec, CH2M"}, "estimatedSalary": "48000", "jobDescription": " Requisition Number 18-0281 Title Environmental Scientist Status Regular FT City Sacramento State CA Description Cardno is seeking an Environmental Scientist in our Sacramento, CA office.  Responsibilities include but are not limited to:  > Conducting research and compiling/summarizing data and information under direction of project managers and/or technical specialists  > Entering and managing technical data and preparing graphs and tables, as needed  > Assisting with preparation of technical reports, plans, and permit applications  > Preconstruction resource surveys and construction monitoring activities to ensure consistency with permit requirements  > Assisting technical specialists in the field with surveys and monitoring efforts Requirements Minimum Qualifications:  > Bachelor’s degree in environmental studies, natural resource management, planning or related field  > Excellent oral and written communication skills  > Strong proficiency in Microsoft Word and Microsoft Office Excel  > Willing and able to travel to field sites and other Cardno office locations  > Ability to work well independently and with a diverse, multi-disciplinary team in a fast-paced, team  oriented work environment  > Strong time management and follow-through skills, with the ability to simultaneously work on multiple tasks/projects and meet project deadlines  > Self-motivated with strong initiative Please Note that selected candidates will be required to pass a drug, background and reference screening. Cardno is a professional infrastructure and environmental services company, with expertise in the development and improvement of physical and social infrastructure for communities around the world.  We are an equal opportunity and affirmative action employer. EEO/AA/M/F/V/D  If you need assistance applying, please leave a message with jobs@cardno.com. General inquiries and submissions of resumes will not be reviewed or routed internally. Not ready to Apply yet? Join our Talent Network Receive alerts of new job opportunities that match you interestStay up to date with the latest news on CardnoShare opportunities with family and friends through Social Media Please note that by clicking this link you are NOT applying. To apply you must click the \"Apply Online\" link belowEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities.Please view Equal Employment Opportunity Posters provided by OFCCP  here.The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access  to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure  is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41  CFR 60-1.35(c)"}