{"jobID": "2789010878", "jobLocation": "Washington_DC", "jobTitle": "Front Desk Support Specialist", "companyRating": "3.1", "companyInfo": {"Website": "www.corvias.com", "Headquarters": "East Greenwich, RI", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Who We Are At Corvias we’re experts at developing solutions through partnership. Our partners share our values and commitment to creating a positive, lasting impact. From state initiatives to municipal programs to military housing efforts, we partner with government organizations to celebrate and reinforce the best parts of their communities. And we help educational institutions develop and improve on existing assets so they can focus on providing a world-class education. Our three core principles—be the best provider of service; be the best place to work; and, generously give back to the communities where we live and serve—are the driving force behind everything we do. How You’ll Contribute to the Team The Front Desk Support Specialist is responsible for the organization and management of reception desk operations. This team member must have a high degree of integrity and display continuous commitment toward customer service as you work to: Greet students, staff and guestsAct as resource person to students, staff and guestsAnswer telephones promptly and maintain accurate messagesAssist with emergency proceduresAssist with a variety of administrative tasksAssist with the enforcement of community policies/student code of conductAttend all training sessions and staff meetingsRole specific requirements include:Prior experience in sales or customer interactionExperience in the property management industry or experience in student housing at a college or university is desirable.Basic computer skills and experience in Microsoft Excel, Publisher and Word is required.Self-motivation, positive attitude, team player mentality, assertive sales and customer service orientation.Excellent clerical, organizational and communication skills.Experience with conflict resolution and problem-solving.Ability to work in a fast-paced environment and meet challenges head-on is essential.A minimum of a high school diploma and at least two (2) years of full-time administrative support experience and one (1) year of full-time sales or customer interaction is required.Corvias Group, LLC (the\"Company\") does not discriminate in employment or applications for employment based on an applicant's sex, race, color, religion, sexual orientation, national origin, ancestry, service in the armed forces of the United States, disability, or any other protected classification as outlined by Federal, State or local laws.Learn more aboutCorvias’ External Recruiting Policy."}