{"jobID": "2738747085", "jobLocation": "Austin_TX", "jobTitle": "Provider Data Management Analyst II", "companyRating": "2.8", "companyInfo": {"Website": "www.livehealthier.com", "Headquarters": "Bethesda, MD", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "35000", "jobDescription": " Position Purpose: Perform provider data management related activities based on plan and contract specifications and standard business rules – includes data analysis and entry, review of data via internet sites and other systems, usage of multiple systems and applications to validate data is complete and accurate, and investigation and resolution of data issues.  Set up and perform facility (hospitals and clinics) enrollment in the provider data management system Enroll providers and practitioners in the provider data management system Update facilities, providers, and practitioners with claims payment information Research, review and make updates within the provider data management system per provider requests Perform quality service checks on systemic data, inclusive of claims processing and provider directory information Perform research and resolve problems as necessary Train and mentor Provider Data Management Analyst I Education/Experience: Bachelor’s degree in a related field, or Associate’s degree in related field or equivalent experience and 2 years of provider data management, credentialing or healthcare operations (i.e. claims processing, billing, provider relations or contracting) experience, preferably in a managed care, insurance, or medical office environment. Experience performing data analysis in Excel or similar tools strongly preferred.  Centene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law."}