{"jobID": "2836045848", "jobLocation": "West_Bloomfield_MI", "jobTitle": "Concierge", "companyRating": "4.3", "companyInfo": {"Website": "www.beztak.com", "Headquarters": "Farmington Hills, MI", "Size": "501 to 1000 employees", "Founded": " 1940", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Paragon Properties, Broder & Sachse Real Estate, Brookdale Senior Living"}, "estimatedSalary": "15", "jobDescription": " The Concierge is responsible for courteous, prompt and efficient service. The concierge will recognize all residents and guests with verbal recognition and eye contact. The position is often referred to as the face of the community. In accordance, actions and appearances must reflect the brand. The position is responsible for creating the first impression of the community. ESSENTIAL FUNCTIONS:Provides excellent, effective and ethical communication to all residents and guests.An entrance and exit log must be accurately maintained at the concierge desk.Maintains knowledge of the Risk Management BinderDevelops a strong knowledge of the community and services of the building.Able to provide residents, families and guests with accurate information regarding the surrounding area.Answers all incoming calls by the second ring.Directs incoming calls to the appropriate department or person.Processing mail for the community as well as residents when needed.Assists with coordinating resident transportation.Handles complaints with tact and solves resident concerns to the degree possible.Communicates with Executive Director and/or Assistant Executive Director all resident noteworthy situations.Communicates with other departments to provide services such as valet parking and room service.Capable of giving directions to the community.Maintains consistent presence at work station.Maintains the lobby and/or entrance area in an orderly and clean manner.PERSONAL QUALITIES:Flexible, innovative and demonstrates the ability to problem solve.High integrity, positive attitude, mission driven and self-directed.Passion, dedication and commitment for providing seniors an engaging, enlivening and captivating living environment.Ability to identify issues before they occur.Ability to effectively multi-taskAble to handle problems as they arise in relation to the operation of the community and collect data, establish facts, draw valid conclusion and make changes to prevent the problem from occurring again.QUALIFICATIONS AND EDUCATION:At least 1 year of experience in the industry or a related field preferred.Working knowledge of the industry.Excellent verbal, written and listening skills.Proficient computer skills including but not limited to Microsoft Word, Excel, PowerPoint and Outlook.PHYSICAL DEMANDS AND WORK ENVIRONMENT:The position is required to regularly sit for long periods of time, walk, and communicate with residents, staff, family members and the public."}