{"jobID": "2836743121", "jobLocation": "Dallas_TX", "jobTitle": "Workforce Intelligence and People Analytics Manager", "companyRating": "4.0", "companyInfo": {"Website": "www.ti.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1930", "Type": " Company - Public (TXN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Broadcom, Intel Corporation, Freescale Semiconductor"}, "estimatedSalary": "134000", "jobDescription": "Job ID 23534BR  Job Posting Title Workforce Intelligence and People Analytics Manager  Job Description As a global semiconductor company operating in 35 countries, Texas Instruments (TI) is first and foremost a reflection of its people. From the TIer who unveiled the first working integrated circuit in 1958 to the more than 30,000 TIers around the world today who design, manufacture and sell analog and embedded processing chips, we are problem-solvers collaborating to change the world through technology. Put your talent to work with us – change the world, love your job! We are looking for someone to build our new workforce intelligence and people analytics team, a hands-on visionary who gets excited about using data insights to enable people-related business decisions. As the first role in HR dedicated to people analytics, you will serve as an active partner with HR and leaders to perform research and analyses on a broad spectrum of people issues including workforce planning, employee attraction and selection, performance, growth, engagement, learning, compensation, diversity, and retention. You’ll also partner with the Information Technology team to build systems infrastructure required to collect and analyze HR data, evaluate tools and service products, and to define the roadmap for our HR reporting needs. The ideal candidate will have strong people management, quantitative, consulting and communication skills, with experience working across a variety of domains and multiple levels within an organization. You must thrive in a fast-paced, dynamic environment and enjoy handling multiple projects simultaneously. Responsibilities •Build our workforce intelligence and people analytics function and serve as our internal thought leader •Apply expertise in people research, quantitative and qualitative analysis, data science, and data visualization to help us optimize the complete cycle of talent from workforce planning through retention •Evaluate effectiveness of HR initiatives (e.g., training, performance management, retention programs) •Partner with HR and leaders on prioritized people-research projects, leading the process to crystalize the business need, gather and analyze data, interpret the information, and action plan •Develop models and predictive tools that enable better people decision-making processes •Own key elements of our people data strategy, including internal employee research (e.g., surveys, focus groups), 3rd party assessment data, and outside data or research (e.g., social media, benchmarks, market availability, etc); collaborate with other data owners to ensure a robust overall data strategy that meets HR needs •Support our legal and compliance teams on required or requested analyses •Partner closely with IT to establish system infrastructure required to collect, analyze and present data •Provide coaching and training on interpretation of data in order to help increase the capability of our HR team •Manage small team of analysts Minimum Requirements •Bachelor’s or Master’s degree in a field emphasizing people research in organizations (e.g., I/O Psychology, Organizational Behavior, Economics, Management, Applied Math, etc.) or related field. Master’s degree preferred. •5+ years of experience applying analytical and statistical analysis (e.g., multivariate statistical methods, hierarchical linear modeling, clustering, predictive models) to research problems in organizations •Experience with analytics (R, Spark, Python, STATA or similar) and visualization (Tableau, Spotfire or similar) tools •Proven experience in defining the strategy and roadmap for a team or function •Demonstrated ability to conduct quantitative and qualitative research using primary and secondary data •Proven track record of driving for results and successfully leading complex projects •Prior people management experience Texas Instruments is an equal opportunity employer and supports a diverse, inclusive work environment. All qualified applicants will receive consideration for employment without regard to protected characteristics, including race, color, religion, sex, national origin, disability, veteran status, sexual orientation, gender identity or age.  Job Opening Type Experienced Professional  Minimum Education Level Bachelor's Level Degree  Related Field(s) of Study Applied ScienceBusiness AdministrationData AnalyticsEconomicsHuman Resource ManagementManagementMathematics Minimum Years of Experience 5  Regular / Temporary Regular  Full-time / Part-time Full-Time  Country United States  Job Location(s) USA-Texas-Dallas Metroplex  Virtual / Telecommute No "}