{"jobID": "2831584866", "jobLocation": "Chicago_IL", "jobTitle": "Senior Scientist, Mechanisms of Cellular Perturbation", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": "AbbVie (NYSE:ABBV) is a global, research-based biopharmaceutical company formed in 2013 following separation from Abbott. AbbVie combines the focus and passion of a leading-edge biotech with the expertise and capabilities of a long-established pharmaceutical leader to develop and market advanced therapies that address some of the world’s most complex and serious diseases. AbbVie is committed to the discovery and development of new medicines that make a remarkable impact on the lives of patients.Abbvie is making a significant push into Genomics and Genetics for drug discovery and development. In the past 2 years, we’ve made multiple investments in internal capabilities and external partnerships with leading academic groups and technology companies. In 2016 we created an internal research group, The Abbvie Genomics Research Center (GRC) within The Target Enabling Science and Technology (TEST) Department. The GRC is a single organization that drives genomics and genetics research across Abbvie R&D.; The GRC has core capabilities and research efforts in Genomic Technologies, Functional Genomics, Computational Genomics, Human Disease Genetics, Pharmacogenetics, Mechanisms of Cellular Perturbation, and has dedicated support for IT infrastructure. The core mission of the group is to apply genomics and genetics research to target discovery, target validation, translational research, and design and analysis of clinical trials. Job description:The GRC Mechanisms of Cellular Perturbation Team supports Abbvie preclinical research teams by developing and applying genomic and proteomic profiling technologies with the goal of improving the success rates for drug discovery and development. The GRC is seeking to hire an interdisciplinary scientist with domain expertise in genomic and/or proteomic technologies to enable ‘omic data integration and to help drive innovative approaches to elucidating new therapeutic targets. The successful candidate will be a versatile and skilled cellular and molecular biologist who will use a combination of genomic, proteomic and pharmacological approaches to establish the connections between genetic variation and gene product function.Responsibilities:Serve as a critical point-of-contact for implementing strategies to leverage evolving human genetic data for new target discovery Collaborate with Disease Biology scientists to advise them on study design utilizing integrated technology solutions (e.g., genomic and proteomic profiling) to solve complex biological questionsPerform and coordinate ‘omic profiling analysis with the highest standards of scientific rigor. Deliver high quality data and results under agreed upon timelines.Effectively communicate with stakeholders, especially around trouble-shooting and responding to changes in priorities and adjusting timelines.Prepare written summaries of experimental results and verbally present in team meetings.Work with external CROs and technology providers as needed to complement internal capabilities.Qualifications:BS, MS, Ph.D and 10+(BS), 8+(MS), or 0+ (Ph.D) years of experience in molecular biology, genome sciences or a related fieldDemonstrated record of hands-on experience and deep technical knowledge of genomic/proteomic profiling technologies with emphasis on translating complex data into actionable hypothesesTrack record of peer-reviewed scientific publications required.Industry experience is desired but willing to consider individuals with equivalent years of experience in academic or non-industry research settings.High attention to detail, strong written and verbal communication skills, ability to work independently and as part of teams.Ability to work in fast-paced, dynamic environment and to independently drive multiple projects in parallel. Key Leadership Competencies:Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performance.Learns fast, grasps the \"essence\" and can change course quickly where indicated.Raises the bar and is never satisfied with the status quo.Creates a learning environment, open to suggestions and experimentation for improvement.Embraces the ideas of others, nurtures innovation an manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}