{"jobID": "2756758224", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Science - Marketplace Optimization & Forecast", "companyRating": null, "companyInfo": {"Website": "www.honk.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " HONK is a fast growing technology company disrupting the roadside assistance space. We are a group of out of the box thinkers and doers, driven by an immense passion to challenge the old ways by working together to bring innovative change that impacts the lives of others. We work in a creative environment where everyday is rewarding knowing were assisting people in their true moment of need, stuck on side of roads, helping them get back to conquering their day. In the age of want it, click it, buy it, get it, on-demand and on-call, HONK is the only way to get from broken down to I barely even noticed Id stopped. We are looking for a Data Scientist with an insatiable curiosity for the evolving way customers interact with businesses. This person should be extremely comfortable with ambiguity and abstract problems and be excited about the idea of solving innovative problems that will impact HONKs business direction. The ideal person is someone who thrives on making the invisible visible, someone who probably creates detailed models to make decisions in their own life. If the idea of working with an agile and entrepreneurial team to modernize a massive/outdated industry excites you, then we want to hear from you!YOU WILL: Develop algorithms for forecasting nationwide supply and demand. Analyze real-time data streams and develop, test and evaluate the effectiveness of different approaches. Work closely with multiple teams to help improve provider and customer experiences through data and forecasting. Help remove our blinders and bring a fresh perspective of data analysis to help identify where HONK can improve and and do better with data. Be laser focused and comfortable working in a self-guided manner. Develop methods to help users understand and use the data you help bring to life. Geek out on large datasets and generate insights from which business value can be ascertained.YOU ARE: A proven Data Scientist or Engineer with hands on practical experience; years of experience do not matter as much as quality of experience. An MS or PhD (preferred) with a quantitative background. Familiar with technical tools used for advanced analysis - SQL, R, Python, etc. You might have been an Engineer or have broad knowledge of machine learning, algorithm design or advanced statistics. Adept at diagramming and visually representing challenges and outcomes. A Researcher, you have experience bringing an idea from experimentation to implementation. Driven by creative intuition and able to do whatever it takes to get the job done. You follow through, and youre not afraid to make yourself heard."}