{"jobID": "2828421761", "jobLocation": "Lawrenceville_NJ", "jobTitle": "Research Scientist - Immuno-Oncology", "companyRating": "3.9", "companyInfo": {"Website": "www.alphaconsulting.com", "Headquarters": "East Brunswick, NJ", "Size": "201 to 500 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " The Judge Group, Randstad, Kforce"}, "estimatedSalary": "69000", "jobDescription": "RESEARCH SCIENTIST IMMUNO-ONCOLOGYLAWRENCEVILLE, NJ Project Description: The qualified candidate is a highly motivated, interactive, and creative individual that possesses the ability to work across a highly matrixed environment to advance preclinical drug development programs from target identification/validation through IND enabling activities.  The candidate will be expected to effectively collaborate with colleagues in the oncology, immunology, immuno-oncology, protein engineering/antibody development and medicinal chemistry groups.  The successful candidate will demonstrate clear and professional verbal and written communication, capable of presenting scientific results to multidisciplinary teams and key stakeholders.  Required Skills: Basic knowledge of the drug discovery process and independence in experimental/assay design, data analysis and problem solving.  Working knowledge and experience with a wide range of technical skills relevant to the specific biology field.  Experience meeting project goals and timelines.  Good analytical and communication skills are essential to document and interpret experimental data and write reports.  Experience working in a collaborative team environment is also desirable.  BS or MS Degree in Biology, Biochemistry, Pharmacology or related field. BS with 5+ years' experience or MS with 0-2 years' experience required.  B.S. with clearly demonstrated skill set in oncology, immuno-oncology, or immunology is required.  Attention to detail with excellent organizational and record keeping skills is a requirement.  Excellent interpersonal skills with the ability to interact effectively with people, internally and externally is required.  Expertise in isolation, characterization and functional assay development using primary immune cells of rodent and/or human origin is desired.  An expert knowledge in the design, validation and execution of in vitro and ex vivo flow cytometry- and/or mass cytometry-based phenotypic and functional characterization of immune cell populations is desired.  Tissue culture expertise is a must. Experience with ex vivo pharmacology, including common procedures including tissue processing is desired.  Experience with a wide range of in-vitro cellular and biochemical assays, including cell culture, isolation of leukocyte subpopulations and experience with T cell and NK cell functional assays, western blotting, immunoprecipitation, ELISAs (MSD), reporter assays, siRNA/shRNA knockdown, and the ability to incorporate state-of-the-art techniques to enhance productivity would be highly desired especially as these skills apply to pharmacology-derived samples.  Proficiency in utilizing scientific software such as Prism, GraphPad, Excel, etc. for data analysis and figure generation is required.  This position is located in Lawrenceville, NJ.  There will be less than 10% travel.  This 4+ month position starts ASAP.  Please E-MAIL your resume (attachment to email) with rate and availability to Larry: larry@alphaconsulting.com ALPHA'S REQUIREMENT #18-00891MUST BE ELIGIBLE TO WORK IN THE U.S. AS AN HOURLY W2 EMPLOYEE"}