{"jobID": "2813161627", "jobLocation": "San_Jose_CA", "jobTitle": "Tableau Developer with Data Science", "companyRating": "3.7", "companyInfo": {"Website": "www.trianz.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "Tableau Developer with Data Science  San Jose, CAOnly Local Candidates  About Trianz Trianz is a global consulting & technology services firm committed to enabling leaders to develop and execute operational strategies, leverage new business and technology paradigms, and achieve results expected by senior management in their organizations- predictably. What We Stand For Our clients are transforming their businesses, competitive strategies, product and service portfolios, customer-partner-employee interactions and their ecosystem as a whole. The cost of misses is not financial alone but a lost window of opportunity. So getting things right the first time is absolutely critical.  As a result, Trianz is focusing on three important themes in our engagement model with clients.  Crystallize business impact from a top management point of view  Help Clients achieve results from strategy-by making execution predictable through innovative execution techniques  Create a positive, enriching partnership experience in everything we do Industries, Clients & Practices Trianz works with clients across High Technology, Banking, Insurance, Manufacturing, Retail, Telecom, e-businesses and Public Services. Most clients are Fortune 1000 organizations and our relationships are sponsored by senior leaders in Enterprise Analytics Sales, Finance, Marketing, Human Resources, Operations and Information Technology. We partner with our clients to address the following key service areas: Cloud & InfrastructureAnalytics & Information ManagementBusiness DigitizationInformation SecurityAbout this RoleTitle - Tableau Developer/ReportingContract duration – 6 – 12 MonthsLocation – San Jose, CA (Need Locals) Experience Range - Minimum of two (2) years of demonstrated success in reporting analyst role.Job Description: Advanced Tableau Development including Tableau mobile reportingPulls data from various sources in order to develop and maintain reports for various sales subjects. For example, bookings and pipeline trending against predetermined goals.Performs ad hoc reports and analysis as requestedMandated skill sets required for this role: Advanced Tableau skills. Prefer candidate with strong UI design background, including mobileAdvanced Excel skills – VLOOKUP’s, Pivots, etc.Strong analytical skillsStrong focus on teamwork and ability to manage relationships across multiple departmentsRelentless focus on accuracy and getting things done.Excellent written and verbal communication skillsProven ability to balance the need of the customer while maintaining corporate objectivesCreative thinker with the ability to identify and solve problemsWe are Growing Rapidly: 2015-16 Highlights Trianz is growing above the average of the professional services industry. Here are some highlights. Voted significantly above other services firms by 90% + of clients for business impact, execution predictability and organizational commitment in the recent Trianz wide client satisfaction survey.Won the “Customer Obsession Award” from Amazon Web Services for our innovation and execution record in Cloud Infrastructure and Business Applications strategy and services.Won UNICOM awards for the #1 Digitization and #1 Analytics project over a wide array of competition.Featured by IDC in their Spotlight series under the theme of “Operationalizing Strategies through Execution Excellence: A New Paradigms in Technology Delivery”.Achieved 50%+ revenue and employee growth compared to prior year’s exit showing an increasing acceptance of our models and success from our differentiated methodologies in strategic execution.Talk to us, Join us & Develop into Leaders Come join a dynamic global start-up. We are an open, non-bureaucratic and no-nonsense culture. We believe in a culture of innovation, encouraging our people to create. We believe training and development of all our associates is the most important thing we can provide to our talent. We are investing heavily- in classroom, online and on the job training. Seeing our talent develop into leaders- is what’s fundamental for everyone at Trianz.  We are hiring at all levels of Trianz. And we are hiring globally. So- if you have a passion for execution and would like to develop into a leader capable of taking on anything, or are already a leader, talk to us! Equal OpportunityEmployer :Trianz does not discriminate on the basis of race, color, creed, national or ethnic origin, gender, religion, disability, age, political affiliation or belief, disabled veteran, veteran of the Vietnam Era, or citizenship status (except in those special circumstances permitted or mandated by law)"}