{"jobID": "2815217376", "jobLocation": "Sterling_Heights_MI", "jobTitle": "Human Resources- Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.advantageresourcing.com", "Headquarters": "Cincinnati, OH", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Human Resources- Data Analyst - Sterling Heights, MI Job Description:Human Resources- Data Analyst Sterling Heights Michigan  Under the direction of the Manager of HRIS and Human Capital Analytics, the HR Data Analyst will be responsible for cross-functional mining of data to be used to create a data analytics scorecard and dashboard. This data will be used to provide analysis, metrics, executive reporting, and predictive analysis for Human Resources. He/she will help respond to the business requirements for People Analytics and help to create an appropriate dashboard to provide on demand reporting on same. This position is responsible for data validation, as well as creating the technology to support dashboards and reports. A minimum of six years of related experience preferred. Experience working requirements with report writing tools for complex databases required. Human Resources background preferred. Financial or business analyst required. Degree Required! Skills:  •Experience with web services and web reporting (PHP or ASP) required. Experience creating and transmitting interfaces required.  •Advanced proficiency with reporting and analysis applications.  •Excellent proficiency in data analysis and reporting using BI tools with databases and data warehouses directly.  •Must be able to work with databases and large data sets and ensure accuracy.  •Able to look at the big picture, speculate and conceptualize outcomes used to help identify trends.  •Must be able to complete assigned tasks effectively, efficiently, accurately, with high quality and on time.  •Strong verbal and written communication/documentation skills. Proficient at developing highly informative and visual presentations for senior leaders.  •Proficient with other Microsoft Office products (Word, Access, PowerPoint, Excel).  •Highly detail-oriented, analytic, energetic and self-motivated individual. Additional Details:Job ID:328196Dept ID:10547Location: Sterling Heights, MI  United States of America Industry: Information Technology / IT - Database Job Type: Temp Position Folder Group ID 29 Posted Date:6/12/2018 Domain:arna  Contact: [Click Here to Email Your Resumé]"}