{"jobID": "2769891082", "jobLocation": "Itasca_IL", "jobTitle": "Data Scientist - Claims Analytics", "companyRating": "3.7", "companyInfo": {"Website": "www.hanover.com", "Headquarters": "Worcester, MA", "Size": "5001 to 10000 employees", "Founded": " 1852", "Type": " Company - Public (THG) ", "Industry": " Insurance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "Job DescriptionThe Hanover is seeking a Data Scientist to join our growing Claims Analytics team at our office in Itasca (Chicago), IL.Position summary: This position leverages an advanced knowledge of predictive modeling analytics to develop, test and validate models for various functions within the company. Contributes to a more innovative approach to financial models and builds knowledge of the business environment. Demonstrates advanced statistical analysis, data mining and research techniques and has an intermediate understanding of Machine Learning techniques.  This is a Fulltime/Exempt Position. Responsibilities/Essential Functions:Drive ongoing innovation of Claims Analytics processes to increase productivity for Claims and Business: Advance the development of key predictive models contributing to a productive performance management process that links clearly defined metrics and future development.Focused on building analytics methodologies that translate data (trends/observations) into compelling and actionable insights, delivering continued process automation to further improve operational efficiency.Under limited supervision, ascertains and executes plans to build, implement and maintain predictive models using available tools and programming languages. Monitors and provides feedback on model performance and recalibrates model as necessary.Works with and streamlines established data warehouses, initiates new development of databases, production data, and available tools to build strategic datasets in support of key initiatives. Establishes and systematically performs processes to assess and validate data accuracy.Determines and performs appropriate exploratory analysis such as data mining, empirical data analysis, univariate analysis, partitioning analysis, etc.Independently gathers requirements from appropriate business partners for project, including necessary data for analysis to be performed. Develops project plans, executes on deliverables within agreed upon timeframes, manages deadlines, communicates progress and makes recommendations to address issues Position RequirementsPosition Requirements:Contributes to creating vision and buy-in; applies predictive modeling concepts creatively in support of business goalsDegree in Applied Mathematics, Statistics, Computer Science (or related fields)Experience in programming languages for large scale data and predictive analysis (predictive modeling, machine learning or data mining)Solid understanding of database principles; experience in data manipulation and cleaning; experience in identification and resolution of data issuesExperience with SQL, R, Watson and relational databasesAdvanced Excel skills including the ability to develop and automate processesTakes initiative, executes independently, and demonstrates accountabilityShould have conceptual understanding of emerging technologies and data science platforms, e.g., Hadoop, WatsonEEO statement: “The Hanover values diversity in the workplace and among our customers. The company provides equal opportunity for employment and promotion to all qualified employees and applicants on the basis of experience, training, education, and ability to do the available work without regard to race, religion, color, age, sex/gender, sexual orientation, national origin, gender identity, disability, marital status, veteran status, genetic information, ancestry or any other status protected by law.  Furthermore, The Hanover Insurance Group is committed to providing an equal opportunity workplace that is free of discrimination and harassment based on national origin, race, color, religion, gender, ancestry, age, sexual orientation, gender identity, disability, marital status, veteran status, genetic information or any other status protected by law.”  As an equal opportunity employer, Hanover does not discriminate against qualified individuals with disabilities. If you require a reasonable accommodation, as a candidate for employment, please inform The Hanover Talent Acquisition office. The Hanover Insurance Group does not accept unsolicited Agency resumes. The Hanover Insurance Group will not pay fees to any third party agency or firm that does not have a signed \"Employment Agency Agreement\" already on file with Human Resources - The Office of Talent Management."}