{"jobID": "2685404457", "jobLocation": "San_Francisco_CA", "jobTitle": "Reporting Software Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.earnest.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " SoFi, CommonBond"}, "estimatedSalary": "153000", "jobDescription": "Want to revolutionize finance? Earnest is a financial technology company changing consumer lending. We are a team of math nerds, designers, computer geeks, and innovators going after a huge market by creating a company built on flawless design, powerful software, advanced data science, and an incredible client experience. We believe that if we fundamentally re-engineer the experience of borrowing money, it will look and feel completely different to how it does today.  As the Reporting Engineer, you will report to the Director of Platform Engineering and lead efforts to: Work closely with Product Owners, Architects, System Analysts, and Software Developers to design, implement, and maintain the reporting platform to support current and future needsDevelop reporting standards for the rest of Earnest to follow and implement. Ensure lessons learned are incorporated into standard operating proceduresProvide guidance and execution related to the usage of new reporting featuresWork cross-functionally to ensure the Earnest data dictionary is well defined, documented and understoodIdentify gaps in reporting and work with appropriate teams to fill them. This could be transitioning ad hoc reporting requirements to standard reports, or introducing new fields into the Earnest data dictionary and implementing them in existing reports.Qualifications:A Bachelors or advanced degree in CS or related discipline, or relevant work experienceCapacity to work with various data storage technologies including relational databases such as PostgreSQL and column stores such as RedshiftExpert in developing reports, dashboards and ETLsAn interest in finance and basic understanding of fixed income securities is a plusEarnest Perks & Benefits:Health, Dental, & Vision benefits plus savings plansAnnual company and performance-based bonus401(k) plan to allow you to save for retirement plus a company matchTuition reimbursement program$1000 flight on each Earnie-versary to anywhere in the world and a self-serve vacation planEarnest provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.Qualified applicants with criminal histories will be considered for the position in a manner consistent with the Fair Chance Ordinance."}