{"jobID": "2675316864", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst - Business Intelligence", "companyRating": null, "companyInfo": {"Website": "www.bravotech.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Analyst - Business Intelligence BravoTECH, a leader in IT staffing and staff augmentation services, seeks a BI - Data Analyst for our preferred client in their Plano location. Responsibilities for this Position Include:In depth knowledge about data warehousing (data acquisition, data management and data consumption) ETL Design on assigned projectsGather requirements, conducting Business Analysis, and writing technical design specificationsEvaluate and design Conceptual / Logical and Physical Data Models; define logical views and physical data security structuresETL performance tunings, optimization, code quality and standardsValidate and review the Test Plans and Test Scenarios, Test Cases; verify Test ResultsPerform problem determination (root cause analysis), document the source of problems and their resolutionRecognize and analyze trends in errors to identify and install long term solutions to problemsEnsure compatibility, scalability, and integration with other data platformsProvide creative solutions around visual representation of data for optimum usability charts, graphs, dashboard design Recognize and adopt best practices in reporting and analysis: data integrity, test design, analysis, validation, and documentationWork across Clients-BI teams to engage the right resources at the right time to ensure objectives/requirements are delivered on scheduleWork with business to identify areas requiring decisions/clarity to define project scope and objectives/requirementsIdentify and assess risks due to changes in scope (business decisions/changes), resources, or timelineWork closely with SOX PMO team for designing/refining SOX controls, and Audit work with external auditorsAlign architecture diagrams and process flows to project plan to identify and remediate gapsInteract with BI, SOX PMORequired Skills:Technical AcumenExperience modeling budget scenarios and statusBusiness Intelligence experience8+ years of relevant work experience (in similar field and/or industry)Compensation is commensurate with years of experience:***Please note: All applicants may be subject to a criminal history check and drug screen. About BravoTECH: BravoTECH is an Equal Opportunity Employer. Headquartered in Dallas, Texas, BravoTECH has provided technology staffing and consulting services to clients throughout the country since 1996. BravoTECH’s client-centric business model, driven by quality metrics, ensures consistent, predictable service results. As a result, the firm has realized steady growth and maintained many long-term relationships with its clients. In addition, our Recruiter Specialization Model -- in which recruiters devote 100 percent of their time to developing relationships within one or two technical skill set areas – allows us to quickly locate and secure the highly-skilled technical resources our clients demand. BravoTECH is a WBE and HUB certified company and an Equal Opportunity Employer."}