{"jobID": "2828372646", "jobLocation": "Somerville_NJ", "jobTitle": "Staff Scientist (Surgical Site Infection PD)", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": " Ethicon, Inc. is a surgical care company within the Medical Devices sector of Johnson & Johnson family of companies. We are recruiting for a creative, hands-on Staff Scientist to design and develop new medical devices and products focused on addressing surgical site infections. The Staff Scientist SSI (Surgical Site Infection) PD will be a member of the Wound Closure Repair R&D; team and be based in Somerville, NJ  The Ethicon business offers a broad range of products, platforms and technologies-including sutures, hemostasis products, surgical staplers, trocars, energy devices and synthetic mesh devices-that are used in a wide variety of open and minimally invasive surgical procedures. Specialties include support for treatment of colorectal and thoracic conditions, women's health conditions, hernias, cancer and obesity. The Ethicon business combines products and services of two market leading legacy companies, both with long histories of medical innovation. Ethicon, Inc. based in Somerville, New Jersey, was founded more than 80 years ago as a pioneer in suture development and manufacturing, helping to transform the safety and effectiveness of surgery.  Ethicon has a long history in both absorbable and non-absorbable polymers and leverages this expertise in designing clinically relevant medical devices, including sutures and meshes and films.  As the Staff Scientist - SSI PD, you will: Conduct research to build new capabilities toward new product development or existing product improvement.Provide R&D; support for existing medical device products.Contribute inventions, new design or techniques to solve technical problems or improve existing products or processes.Lead and function as a contributing member of cross-functional / multidisciplinary project teams in the design, development, and manufacturing of surgical sutures and products.Identify new solutions for addressing surgical site infection using end-to-end/system thinkingDevelop new capabilities by working across the innovation spectrum and multiple functional disciplines to build new models for accelerated innovationDesign and execute scientific experiments, compile and analyze data to identify relationships/root causes to draw conclusions and communicate learnings to the broader organizationContribute in identifying strategies and opportunities to address risk factors related to surgical site infections.Contribute inventions, new designs, new processes and techniques to solve technical problems based on customer needs. Effectively applies state-of-the-art scientific/technical knowledge to projects; demonstrates expertise in own field.Implement new processes to incorporate manufacturability considerations into new product development and interact with manufacturing to scale up R&D; prototype equipment to manufacturing capacity.Interact with customers (surgeons) to identify unmet needs and validate designs.Provide technical support for marketed medical device products to other business functions, including Regulatory compliance activities.Follow design control procedures (responsible for good documentation practices, protocol and report generation, reports, design verification/validation)QualificationsThe following combination of education and work experience is a min. requirement: A Bachelors Degree in Chemistry, Biology, Microbiology, Chemical Engineering or related field with a minimum of 7 years industrial experience as a technical contributorA Masters Degree in similar field with a minimum of 5 years industrial experienceA Ph.D. in similar field with a minimum of 2 years industrial experienceStrong background in experimental designs, statistics, and data analysis is requiredExperience handling multiple projects/tasks at the same time is requiredExperience in medical devices product/process development is preferredAdept, hands-on experimentalist with knowledge in chemistry, biochemistry, microbiology or related and demonstrated understanding of material property characterization is preferredKnowledge of medical devices regulations is preferredHistorical experience of leading project teams or sub teams is preferredAbility to foster a productive team-oriented environment, to handle multiple assignments, and display the flexibility required excelling in an environment with rapidly shifting priorities.Historical experience in problem-solving is requiredAbility to conduct hands-on materials development and characterization is preferredAbility to incorporate manufacturability into the new product development is preferredAbility to work in a team-oriented environment that embraces change, risk, and flexibilityGood interpersonal relationship and people skillsHave passion and enthusiasm for innovationKnowledge of Design/Process Excellence (Six Sigma) is preferredPrimary Location United States-New Jersey-Somerville Organization Ethicon Inc. (6045) Job FunctionR&D;Requisition ID2850180604"}