{"jobID": "2590895394", "jobLocation": "Ann_Arbor_MI", "jobTitle": ".NET Developer", "companyRating": "2.9", "companyInfo": {"Website": "www.logicsolutions.com", "Headquarters": "Ann Arbor, MI", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " Logic Solutions is a full-service development firm headquartered in Ann Arbor, MI with 4 additional offices around the world. Founded in 1995, Logic offers website design and programming, eCommerce solutions, customized web and mobile applications, and application integration services that span the entire software development lifecycle.  Logic is seeking an experienced .NET Developer to be based in Ann Arbor for its growing technical team. The .NET Developer is a versatile team member who has excellent skills in C#, .NET, and ASP.NET. In addition, this person must have experience in and expertise with SQL Server, including database design; this individual should have an in-depth understanding of web application development, including best security practices. Finally, an applicant must possess expertise to develop and execute test plans and work within a test and release cycle for software deployment.  The .NET Developer must also possess strong communication skills necessary for interactions with the development team as well as with internal and external clients. Requirements:Bachelor’s degree in computer science or related technical field, or equivalent practical experienceMinimum of 5 years of experience in C# .NET and ASP.NETMinimum of 5 years of SQL queries, specifically Microsoft SQLExperience in Enterprise Application both web and desktopWorking knowledge of critical software sub-systems such as security, messaging and database interoperationExperience developing and executing test plans and working within a test and release cycle for software deploymentGreat at communicating to people within our organizationDesired Experience:Experience with Microsoft SQL server administration and database configurationExperience with IISExperience with AJAX and JQueryExperience with CSS, XHTML, XML, JSON This is a full-time position reporting to the Chief Technology Officer. This is a salaried position with compensation based on experience and skill level. Benefits include medical, insurance, 401(k), paid time off (vacation, holidays, and sick days) and a professional work environment. Logic offers equal opportunities to all people. We would like to thank all applicants for expressing interest; however, only those selected for interviews will be contacted. Reference checks may be conducted with your permission."}