{"jobID": "2829035401", "jobLocation": "Santa_Clara_CA", "jobTitle": "Motion Scientist", "companyRating": null, "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": null, "jobDescription": "Motion Scientist Job Number: 113484806Santa Clara Valley, California, United StatesPosted: Jun. 27, 2018Weekly Hours: 40.00 Job SummaryThe CoreMotion team has created innovative ways for users to interact with their devices through motion. When you play games by simply moving your devices, or use the compass to find your way, it’s the work of engineers and scientists on this team. Join CoreMotion and work with the people who have created the sensor fusion technologies and motion gestures that power games, augmented reality and numerous other features on Apple’s devices.Key Qualifications Strong technical knowledge of signal processing, motion estimation and system modelingStrong expertise with algorithm design, validation and in-system performance characterizationIndustrial or graduate level experience with inertial navigation, SLAM or computer visionStrong Matlab and C++ skillsExperience with implementation on embedded or real-time systemsExcellent technical communication skills DescriptionWe are looking to hire a Motion Scientist to join our team in pushing the state-of-the-art in motion estimation using inertial sensors for navigation, gaming and augmented reality. As a member of this multi-disciplinary team, you will be responsible for data analysis, algorithm design, validation and implementation as well as close coordination with other teams across the company. Most importantly, you will help ship interactive features that impact millions of users on a daily basis.EducationMS/PhD in Mechanical Engineering, Electrical Engineering, Computer Science or related field with relevant domain knowledge  Coursework in signal processing, controls, statistics and programming"}