{"jobID": "2808253594", "jobLocation": "Vienna_VA", "jobTitle": "Software QA Engineer, ArcSight - Vienna, VA", "companyRating": "2.9", "companyInfo": {"Website": "www.microfocus.com", "Headquarters": "Newbury, United Kingdom", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (MCRO) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SAP, EMC, Oracle"}, "estimatedSalary": "82000", "jobDescription": " At Micro Focus, everything we do is based on a simple idea: The fastest way to get results is to build on what you have. Our software solutions enable organizations to do just that. Secure and scalable, with analytics built in, they bridge the gap between existing and emerging ITfast-tracking digital transformations across DevOps, Hybrid IT, Security, and Predictive Analytics. In the race to innovate, Micro Focus customers have the clear advantage.  Our portfolio spans the following areas:  DevOps | IT Operations| Cloud | Security | Info Governance | Big Data, Machine Learning, & Analytics About Micro Focus Security Group: As a unified business group, Micro Focus Security is one of the largest and fastest growing security Organizations on the planet! Security, compliance, and risk management is a high growth market, and that market is accelerating. Based on market leading products from ArcSight, Sentinel, Fortify, and ZENWorks, the Micro Focus Security group uniquely delivers the advanced correlation, application protection, and network defense technology to protect today's applications and IT infrastructures from sophisticated cyber threats. About ArcSight: Micro Focus, ArcSight division, is a leading global provider of Compliance and Security Management solutions that protect enterprises, education and governmental agencies. ArcSight helps customers comply with corporate and regulatory policy, safeguard their assets and processes and control risk. The ArcSight platform collects and correlates user activity and event data across the enterprise so that businesses can rapidly identify, prioritize and respond to compliance violations, policy breaches, cyber security attacks, and insider threats.  ArcSight is a leader in security and compliance management solutions that intelligently identify and mitigate business risk for enterprises. ArcSight provides the industry's only vendor-neutral solution for real time intelligent identification, prioritization and network response to external security attacks, insider threats and compliance breaches. Responsibilities:Primary responsibility will be centered on testing Micro Focus ArcSight's products. This includes, but is not limited to, developing, enhancing, maintaining, and executing automated test cases which utilize shared libraries, tools, and scripts in an Object Oriented environment.Working closely with QA to develop automated test plans, and contributing to making products more easily testable.Additional responsibilities include working closely with development to reproduce problem reports and customer issues, setting up and maintaining test environments, and completing technical reviews of product documentation.Analyzes design and determines test cases with steps for automationCollaborates and communicates with management, internal and outsourced development partners regarding test status,Project progress, and issue resolution.Represents the software quality assurance team for all phases of larger and complex projects.Excellent team player and focus on collaboration activities. Ability to take up other duties as assigned.Qualifications:3+ years of software quality assurance with enterprise-class software or relatedWith 1+ years Java development experience in structured, object-oriented languages.Experience with Java, Selenium, TestNG, Jenkins, Gradle,P4, Protractor, QC/ALMSolid understanding of networking protocols and principalsExperience with shell scripting and windows scriptingTesting experience on Unix/Linux operating systemsManual Testing experience with log or storage managementExperience with Agile, Scrum, Waterfall, Continuous Integration, TTD.Experience with web services REST/SOAP API test automationExperience with source code management tools like Perforce or GitExperience with testing applications developed in AJAX GUIs, AngularJS and Node.jsStrong automated Web UI testing experience using Selenium and Web DriverStrong ability to develop system, API, and component test plans, automated tests, and supporting librariesTesting experience with relational and/or nosql databasesStrong written and verbal communication skillsSelf-driven quick learner with attention to detail and qualityExceptional troubleshooting skills required for the automation test casesExperience with Groovy , QF-Test is a plusPerformance tuning, monitoring and debugging is a plusEducation:Bachelors or Master's degree in Computer Science, Information Systems, or equivalent.Effective verbal and written communication skillsComfortable with technical and business English usage of document reading, emails and conference calls #LI-SK1"}