{"jobID": "2835594050", "jobLocation": "Mc_Lean_VA", "jobTitle": "Analyst - Data Science", "companyRating": null, "companyInfo": {"Website": "www.jdpower.com", "Headquarters": "Costa Mesa, CA", "Size": "501 to 1000 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Nielsen, TNS Global"}, "estimatedSalary": null, "jobDescription": "Title: Analyst- Data Scientist Location: McLean, Virginia Reports to: Director Analytics The Role: Oversee, develop and execute research based material to support forecasting and explanatory models integral to JD Powers core vehicle valuation products. Work with an experience team of data scientists to develop analytic projects and models to support consultative products providing analytic support for decisions related to vehicle pricing, brand strength and strategic decisions related to automotive sales. Manage internal analytical projects and consulting engagements to insure results are delivered on time and in line with customer expectations. The Impact: Work with analytical team to leverage J.D. Powers proprietary automotive data and analytics to evaluate and analyze the automotive marketplace to identify and report on risks and opportunities for clients. Develop and provide analytical and industry material to support senior management in business development and sales endeavors related to core valuation products and ad hoc consulting opportunities. Responsibilities:Help to develop and improve an industry leading predictive model of used vehicle pricingExplore new ways of using all available analytical models to provide insight to the automotive industryWorking in conjunction with the management team to develop and execute external communications and assist in developing consulting solutions to increase company revenueWork with other data scientists to develop models and analytic processes to support a variety of internal and external projectsAnalyze automotive market data and economic information to create provocative insight and customer solutions based on a variety of micro-economic topicsConnect the dots by joining internal data and data from disparate sources to create meaningful analysesEstablish new ways to promote and increase demand for J.D. Powers residual values and used vehicle value productsQualification:Bachelors degree in a relevant field required; advanced degree preferred3+ years of experience with data science, analytics and/or statisticsStrong team building skillsStrong understanding of statistical and analytical processes and capabilities with the ability to interpret results into actionable insights and summarized reports.Outstanding communication skills (written and oral) with the ability to clearly communicate the meaning of analytical concepts, analyses and results in a concise mannerKnowledge in analytical tools and data management systems (R, Python, SQL or other analytical tools and programming languages)The Career Opportunity: The role provides an opportunity to use critical thinking and analytical expertise to work directly with an experienced analysis team that supports the automotive industry. JD Power recently introduced a forecast model that has created new opportunities for all different types of predictive and prescriptive modeling to assist in business decisions across the value chain for automotive manufacturers. We encourage the use of cutting edge machine learning modeling and other techniques to provide insight and value to all facets of the automotive industry. The Team / The Business: You will work closely with a group of automotive experts with expertise in a variety of different fields. The team in McLean has a strong reputation in the industry as a thought leader in price forecasting and understanding drivers of vehicle prices. Our Hiring Manager says: \"We are looking for an individual who is excited about using data science to bring insight to the automobile industry. This person will work with a strong team of experienced data scientists and economists and will be challenged to think critically, problem solve, and to continually expand their knowledge.\" J.D. Power is a global leader in consumer insights, data, analytics, and advisory services that helps clients drive growth and profitability. The companys industry benchmarks and reputation for independence and integrity have established it as one of the worlds most well-known and trusted brands. Our Experience J.D. Power has been capturing and analyzing the Voice of the Customer across more than a dozen industries globally for 50 years. We know measuring customer experience is not easy, but thats where we come in. Through our proprietary index model, we identify the many drivers of customer experience, accurately measure and link their impact to business results, and uncover insights to drive results for our clients. Our Data, Analytics, and Resources Across 18 offices globally, our team of more than 800 professional analysts, statisticians, economists, consultants, and experts in demographics and consumer behavior focus on delivering insights clients can act on immediately. We serve an increasing number of countries and regions around the world, including Brazil, India, Japan, Taiwan, China, Philippines, Indonesia, Singapore, Thailand, Malaysia, Vietnam, South Korea, Canada, Mexico, Europe, Australia, Germany, and the UK. Beyond Measure We understand that the customer experience is vital and that simply measuring it is not enough. Our analysts focus on driving results that will improve customer loyalty and advocacy and our success is driven by how much we help improve your customer experience. But data is only as powerful as the analysis and insights tied to itand we are putting that power in your hands through our interactive VoX reporting platform. The data, analytics, insights, best practices, and action plans you need are available whenever and wherever you need them, to help you make data-driven decisions that will improve your customer experience and drive positive financial results."}