{"jobID": "2820485150", "jobLocation": "Arlington_VA", "jobTitle": "Data Disclosure Analyst", "companyRating": null, "companyInfo": {"Website": "www.eagletechva.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": "Project Title: Behavioral Health Services Information System (BHSIS) Eagle Technology Inc., has been awarded a multi-year contract to provide services under the auspices of Substance Abuse and Mental Health Services Administration/Center for Behavioral Health Statistics and Quality to operate the BHSIS. These services include collecting, managing, and analyzing the data that comprise five (5) BHSIS components and to improve the quality of BHSIS data. BHSIS consists of five (5) inter-related components: (1) the Inventory of Behavioral Health Services (I-BHS); (2) the substance abuse treatment facility survey called the National Survey of Substance Abuse Treatment Services (N-SSATS); (3) the mental health treatment facility survey called the National Mental Health Services Survey (N-MHSS); (4) the Treatment Episode Data Set (TEDS), a collection of substance abuse treatment admissions and discharges to state-funded substance abuse treatment facilities, and (5) the Mental Health-Treatment Episode Data Set (MH-TEDS) and the Mental Health-Client Level Data (MH-CLD), collections of mental health client level data from state-funded mental health treatment service facilities, as well as the Uniform Reporting System (URS) Tables required for Mental Health Block Grant application procedures. Job Title: Data Disclosure Analyst/Data AnalystPosition Description: This individual will be responsible for designing and implementing a process to de-identify large substance abuse and mental health raw data to ensure researchers and those analyzing data sets are unable to associate an individual with a substance abuse or mental health facility or otherwise able to identify an individual based on the information/variables in census survey data set. The individual will be responsible to ensure the data is presented/published in such a manner that they are useful for statistical research and to provide sufficient protection for the individuals or businesses to whom the data refer. In addition to the data disclosure analysis, this position will require the analysis of and reporting on large substance abuse and mental health data sets. The successful candidate should have a strong background in SPSS or SAS statistical software packages with experience in designing and developing data research products for presentation. The successful candidate should also have a background in statistical methodology, survey research, and data analysis, preferably in Public Health to include substance abuse and/or mental health. Candidate must have strong writing skills, and able to effectively present data to be viewed by various consumers to include Health and Human Services, Academia, and the general public. The position will require the production of analytic/public use files and data reports as well as fulfil ad hoc data requests. Responsibilities:Work with clients on solving data issuesWhen requested, plan and direct research studiesUse SAS or other statistical software to produce excel tables and respond to ad hoc data requestsRequirements:Master’s/PhD degree in statistics, demography, epidemiology, survey research, Sociology, Public HealthExperience with SAS base and Advanced SAS programming or other statistical softwareExtensive Excel experienceExtensive experience in coding and recoding large data setsPreferred: Experience with R programmingProven experience in de-identifying data sets to be used in public use files to ensure individuals or businesses are not identifiedSolid understanding and experience in statistical models and proceduresAttention to detailDeductive/analytic reasoningAbility to manage multiple assignments at onceAbility to create data products for presentationAbility to work well within a team environmentAbility to clearly express ideas and procedures in writing"}