{"jobID": "2830445843", "jobLocation": "Austin_TX", "jobTitle": "Part Time Data Science Instructor", "companyRating": null, "companyInfo": {"Website": "www.generalassemb.ly", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Since 2011, General Assembly has transformed tens of thousands of careers through pioneering, experiential education in today's most in-demand skills. As featured in The Economist, Wired, and The New York Times, GA offers training in web development, data, design, business, and more, both online and at campuses around the world. Our global professional community boasts 40,000 full- and part-time alumni and counting.  In addition to fostering career growth for individuals, GA helps employers cultivate top tech talent and spur innovation by transforming their teams through strategic learning. More than 21,000 employees at elite companies worldwide have honed their digital fluency with our corporate training programs. GA has also been recognized as one of Deloitte's Technology Fast 500, and Fast Company has dubbed us leaders in World-Changing Ideas and the #1 Most Innovative Company in Education. ESSENTIAL RESPONSIBILITIES AND DUTIESTeach two 3-hour classes per week, for 11 weeksInstructors will need to commit a few hours per week preparing lessons and materials, leveraging existing GA curriculum content.Work alongside GA staff and teaching team to best meet the needs and learning styles of your students.Guide students through development of a stellar final project that will showcase their abilities to hiring managers.Facilitate a dynamic and collaborative classroom community.Inspire students to persevere through the challenges of learning a new suite of skillsSKILLS AND QUALIFICATIONSYou are eager to shape the skills, minds, and trajectories of the newest generation of data scientists.You are the person that your colleagues naturally gravitate to when they are trying to figure something out.You have at least 2 years of industry experience with data science (prior teaching experience a plus)You have fluency in most of the following topics: Probability, Statistics; Python (other scripting languages such as R a plus); AWS, EMR, MapReduce and/or Hadoop; Manipulation of large data sets; Data visualization techniques; Databases; Algorithms; Machine learning Since 2011, General Assembly has transformed tens of thousands of careers through pioneering, experiential education in today's most in-demand skills. As featured in The Economist, Wired, and The New York Times, GA offers training in web development, data, design, business, and more, both online and at campuses around the world. Our global professional community boasts 40,000 full- and part-time alumni and counting.  In addition to fostering career growth for individuals, GA helps employers cultivate top tech talent and spur innovation by transforming their teams through strategic learning. More than 21,000 employees at elite companies worldwide have honed their digital fluency with our corporate training programs. GA has also been recognized as one of Deloitte's Technology Fast 500, and Fast Company has dubbed us leaders in World-Changing Ideas and the #1 Most Innovative Company in Education.  In this 10-week part-time course, students learn and practice turning messy real-world datasets into actionable, data-driven insights they can communicate. We will be using Excel, SQL and Tableau as the primary tools for analysis. We are looking for an instructor to lead this part-time Analytics course (see course page). Though we provide a core curriculum along with instructor resources, you will have the opportunity to implement your ideas by adapting our materials as one of the course's first instructors. SKILLS AND QUALIFICATIONSYou have strong experience using the following tools: Excel, SQL and Tableau.You are eager to shape the skills, minds, and trajectories of eager General Assembly students.You are the person that your colleagues naturally gravitate to when they are trying to figure something out.You have at least 5 years of work experience in a role where you've been responsible for cleaning messy data, analyzing the data and presenting your data based insights.ESSENTIAL RESPONSIBILITIES AND DUTIESTeach 2 hours per evening, 2 days a week, for 10 weeks.Instructors will need to commit a few hours per week preparing lessons and materials, leveraging existing GA curriculum content.Work alongside GA staff and teaching team to best meet the needs and learning styles of your students.Guide students through development of a stellar final project that will showcase their abilities to hiring managers.Facilitate a dynamic and collaborative classroom community.Inspire students to persevere through the challenges of learning a new suite of skills General Assembly is a licensed school in all states that we operate in, and some states require instructors to be licensed to teach. If hired, you will be required to submit and be approved as an instructor in relevant states. Directions for becoming licensed will be shared with you during onboarding. Licensure requirements vary by state, but you may be required to provide academic transcripts and to answer questions pertaining to moral character, professional conduct, education, and work history. General Assembly will pay for all licensing fees."}