{"jobID": "2819846151", "jobLocation": "San_Ramon_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.24hourfitness.com", "Headquarters": "San Ramon, CA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " Unknown / Non-Applicable", "Competitors": " LA Fitness, Crunch Fitness, Life Time Fitness"}, "estimatedSalary": "155000", "jobDescription": "LOCATION 12647 Alcosta Blvd San Ramon CA 94583Reporting to the VP of Strategy and Business Analytics, the data scientist identifies solutions or opportunities within the company key strategic initiatives delivering actionable insights and accurate predictions. Across multiple department projects (marketing, real estate, finance, operations, human resources, etc.) this position is responsible to 1) learn and identify key metrics based on consumer and company data to bring strategic changes to the organization; 2) statistical analysis and model building for key business objectives; 3) reporting of on-going research results and efforts, interpreting key trends and consumer behaviors to inform strategic marketing decisions and tactics.ESSENTIAL DUTIES & RESPONSIBILTIES Estimated % of Time SpentAdvanced Analytics Platform DevelopmentPioneer data science efforts for the organizationResponsible for the design, development, integration and consolidation of the analytical platform and toolsAugment the data from internal (BI data warehouse, transactional database, survey data, etc) and external (web, text analytics, competitors data, etc.) sources to support models and analysisEducate stakeholders and key partners by communicating the benefits of advanced analytics and machine learning for the fitness industryProvide guidance on the use of existing analytical tools and service for colleagues, challenge our vendor solutions and be the key point of contact representing our company 30%Models and Statistical AnalysisPractice exploratory data analysis (EDA), not just as a method of systematically going through the data, but as a mindset that is about your relationship with data in order to gain intuition and connect your understanding of the process that generated the data to the data itself.Leverage advanced analytical and modeling techniques (machine learning, clustering, classification, regression, logistic regression, etc.) to build and support accurate predictive models for key business opportunities across multiple departments (marketing, operations, real estate, category management, finance, etc.)Build and refine models that encompass financial metrics, economic inputs, consumer behavior and feedback, as well as club and market conditions to help drive overall profitability for the companyExecute your research with reliability and reproducibility * Prepare presentations summarizing your findings with charts, spreadsheets and recommendationsManage the volume of requests by prioritizing projects based on their impact to the company revenue or profitability. 40%Reporting and Ad-Hoc requestsProduce reports related to your projects or ad-hoc requests and communicate results to business stakeholders and senior leadership team.Execute root cause analysis on special events impacting the company performance, communicate findings and provide recommendations as applicable. 20%InnovationResearch new technologies or scientific methodologies in behavioral science, cognitive learning and data typesIdentify new projects impacting the company's profitability 10% Total 100%ORGANIZATION RELATIONSHIPSThis position reports to the VP of Strategy and Business Analytics and will be an integral part of the team working to build innovative solutions and intelligence capabilities for 24 Hour Fitness. This position will also have regular interactions with key executives and other senior leaders of the organization. This position will provide critical information to the Marketing department and its business partners and will be required to interact with all functions within the company, up to and including senior executives. This position will not have any direct reports.REQUIRED QUALIFICATIONSKnowledge, Skills & AbilitiesExperience with a variety of Data Science algorithms including but not limited to, tree based models, SVMs, collaborative filtering, genetic algorithms, and agglomerative and non-agglomerative clusteringExperience with statistical modeling techniques such as generalized linear models, probability theory, experimental design.Strong mathematical understanding such as variance, hypothesis testing and distributions.Strong understanding of the ML process including training and validation, regularization, variance-bias tradeoff, dimensionality reduction, hyper-parameter optimization.Familiarity with deep learning techniques such as RNNs, CNNs and LSTM Networks, along with an understanding of the implications of various tuning parameters preferred.Prototyping data engineering skills including SQL and ability to manipulate large structure or unstructured datasets for analyses, streaming, data visualization.Ability to drive a project from start to finish: create the framework, assemble the data, run an analysis, recommend a solution, develop a plan and then execute the planAbility to work independently and complete tasks. Willingness to work through difficult / complex situationsStrong verbal & written communication abilities. Ability to communicate well with all levels of within the organization including individuals who don't have the same familiarity with dataEagerness to collaborate with both technical and non-technical colleagues.Good leadership and teamwork qualities. Ability to engage and help, but willingness to stand ground when necessary.Minimum Educational Level/CertificationsMaster's degree or equivalent experience in statistics, operations research, applied mathematics, computer science, economics or related field. Minimum Work Experience and Qualifications4+ years of experience in computer science, statistics, applied mathematics or other quantitative/computational discipline.4+ years of experience with open source machine learning tools built in Python or R.4+ years of experience with scripting languages (e.g., Python, Java, Ruby, Scala, Bash)4+ years of experience of data engineering including SQL, database design, manipulating large structure and non-structured datasets for analysis (Hadoop, BDM, AWS, Azure, ALDS, Streaming).4+ years extracting and analyzing data from various sources, interpreting data to 'tell the story' and turning results into meaningful action steps for the company.FUNCTIONAL GROUP Corporate OperationsFULL-TIME Full-time"}