{"jobID": "2762060472", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Software Engineer", "companyRating": "4.2", "companyInfo": {"Website": "www.llamasoft.com", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " Like Stats?  Yeah, us too!  Check these:  600+ enterprise customers in 60 countries  50% of Fortune 100 companies are customers  23 of the Gartner Top 25 Supply Chain are customers  So, yes, were all about business. But were also all about sustainability, see our 2017 Green Award **  ICYMI: We were named to the 2017 Best and Brightest Company in the US of A and in Metro Detroits 2017 Best and Brightest Company list  Were well funded, fun and focused on building the very best in supply chain and we want YOU to help us build complex models that allow global companies to quickly, safely model supply chain impacts.  Dont believe us - read the Gartner Supply Chain Masters and youll learn that nearly all of the Gartner Supply Chain Top 25 use our solutions to tackle the most complex supply chains issues the world has ever seen.  Smart, energetic and ready to make your mark in a best in class enterprise software company? Join our herd! ** from Supply and Demand Chain Executive . The Role: As a software engineer, you will work with a cross-functional team to design, implement, and maintain a world class supply chain design application. You will be creating user interfaces, data access components, and integrating APIs and services to provide users with an incredible experience. Responsibilities:Build and maintain a modern, modular desktop applicationCode full-stack, across all concerns of the application, as-neededWork side by side with designers and supply chain experts to deliver intuitive user experiencesConduct and participate in design and code reviewsTake ownership of tasks, driving them forward and providing visibility to the teamQualifications:Bachelors degree in computer science or 2+ years relevant work experienceProficient in C# and .NETFamiliar with object-oriented design patterns, data structures, and development methodologiesStrong written and verbal communication skills with both technical and non-technical audiencesAptitude for learning and integrating new technologies and componentsEffective problem-solving and bug fixing skillsCustomer and quality focused with excellent attention to detailDesired Additional Skills:Demonstrated ability to turn UI designs into accurate, maintainable user interfacesExperience working in an agile software development environmentFamiliarity with WPF and/or XAML presentation technologiesProficient in SQL and designing data structures in one or more database systemsKnowledge of supply chain management or logistics industryAbout LLamasoft LLamasoft provides software and expertise to help companies design and improve their supply chain operations. We enable companies to model, optimize and simulate their supply chain operations, leading to major improvements in cost, service, sustainability, and risk mitigation. Supply Chain Guru®, LLamasofts flagship product, is the leading supply chain design and predictive analytics application available in the market today. LLamasoft is expanding its product offering into multiple design platforms as well as enterprise solutions.  Since 1999, LLamasoft has helped hundreds of global organizations in over 30 countries leverage their unique blend of technology and deep domain expertise to drive competitive advantage and savings across their supply chain operations.  LLamasoft offers a stimulating small company atmosphere where your efforts will have a significant impact on global logistics and our companys success. We are a fun, results-driven company that centers on developing high quality software, not work schedules and dress codes. We are driven by people who have a passion for technology and innovation. If you are excited about software development and looking for a fun and flexible environment in a growing company, please apply!  LLamasoft is an equal opportunity employer, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}