{"jobID": "2461715440", "jobLocation": "Livonia_MI", "jobTitle": "Clinical Data Analyst II", "companyRating": "3.4", "companyInfo": {"Website": "www.trinity-health.org", "Headquarters": "Livonia, MI", "Size": "10000+ employees", "Founded": " 1976", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " HCA Healthcare, Vanguard Health Systems"}, "estimatedSalary": "87000", "jobDescription": "Department:IN301_64704 UCO - Clinical Operation ImproExpected Weekly Hours:40Shift:Day ShiftPosition Purpose:POSITION PURPOSEProvides operational support for the measurement and improvement of clinical quality, cost, and the experience in care.Job Description Details:POSITION PURPOSEProvides operational support for the measurement and improvement of clinical quality, cost, and the experience in care.ESSENTIAL FUNCTIONSKnows, understands, incorporates and demonstrates the Trinity Health Mission, Vision, and Values in behaviors, practices and decisions.Responsible for multiple projects or clinical areas. These projects will be moderately complex in nature, with potential overlap between multiple clinical areas. Proficient in the use of SAS software to create datasets for analysis from multiple sources. Write SQL queries for data manipulation, sorting, summarizing, and reporting.Responsibilities include, but are not limited to developing, implementing, and utilizing databases and reporting tools to extract data, generate reports, perform moderate to complex data analysis and draft system/process improvement recommendations. Assignments may require interfacing with, gathering information from and making presentations to various levels of management and internal and external stakeholders. Will serve as a subject matter expert by providing guidance and by problem solving issues for internal colleagues on matters impacting projects or service area assignments.Performance Measurement and AnalysisPrepares the quantitative measurement and analysis of clinical quality, cost, and experience in care measures for assigned projects or clinical areas.Supports the establishment of quantitative measurement and targets based on environmental scans of national quality measurement organizations, clinical societies/associations, payers or regulatory programs. Monitors changes to definitions and works with stakeholders to establish new measures or to refine existing ones.Regularly monitors performance and highlights trends and opportunities for improvements to leaders and stakeholders.Supports the design, collection and analysis of data describing structure, process, or outcomes in care settings across the continuum. Information SharingSupports the preparation and dissemination of knowledge via presentations, publications, website postings, and applications as requested by stakeholders in the organization. Clinical Database Development and SupportProvides support to and design of clinical databases and vendor systems housing clinical content used for quantitative research and analyses.Interfaces with Information Services and software vendors to maintain and update databases, tools and other clinical software.Provides support and training to users on software and analytical tools.Maintains a working knowledge of applicable Federal, State and local laws and regulations, Trinity Health Organizational Integrity Program, Standards of, as well as other policies and procedures in order to ensure adherence in a manner that reflects honest, ethical and professional behavior.Minimum QualificationsMust possess a Master's degree with a preferred background in statistics, epidemiology, and/ or advanced analytic area of focus. Three (3) to Five (5) years of relevant technical, healthcare, or clinical experience is desired.Must possess excellent oral and written communication and presentation skills.Must be well organized and possess the ability to work with minimal supervision, which includes setting one’s own priorities and actively seeking direction in case of conflict.Must be able to make decisions based on logical thinking and ethical principles.Demonstrated success in the development, analysis, interpretation, and management of a variety of complex data sources to include all facets of decision support/financial reporting, clinical disease state outcome tracking, and clinical data, and health plan related profiling/reporting.Possess a working knowledge of quality improvement principles, theory, study design and statistical modeling. Experience with statistical software systems such as SAS, SPSS, MiniTab, etc., and the ability to apply a working knowledge of Structural Query Language (SQL) and/or relational databases.Excellent interpersonal skills to foster collaborative partnerships using a team approach to span traditional boundaries within a health care setting.Must be comfortable in a collaborative, shared leadership environment.A personal presence which is characterized by a sense of honesty, integrity and caring with the ability to inspire and motivate others to promote the philosophy, mission, vision, goals and values of Trinity Health. Physical and Mental Requirements and Working ConditionsMust be able to set and organize one’s own work priorities and adapt them when needed.Must be able to travel to various sites, if required.Proficient in the use of SAS, R, and/or SQL to create and analyze data from multiple and complex sources. Trinity Health's Commitment to Diversity and InclusionTrinity Health employs more than 120,000 colleagues at dozens of hospitals and hundreds of health centers in 21 states. Because we serve diverse populations, our colleagues are trained to recognize the cultural beliefs, values, traditions, language preferences, and health practices of the communities that we serve and to apply that knowledge to produce positive health outcomes. We also recognize that each of us has a different way of thinking and perceiving our world and that these differences often lead to innovative solutions.Trinity Health's dedication to diversity includes a unified workforce (through training and education, recruitment, retention and development), commitment and accountability, communication, community partnerships, and supplier diversity."}