{"jobID": "2805043585", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.sentel.com", "Headquarters": "Alexandria, VA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " SENTEL Corporation is a rapidly growing, industry leader, providing professional services support to both the government and the private sector. Our core competencies include engineering, logistics, IT and mission critical support services. We provide solutions to a broad range of customers including the DoD, DHS, IRS, FAA and the Intelligence Community. Job Summary: Senior Data Scientist provides Scientific, Engineering, and Technical Assistance (SETA) support to the government Program Manager (PM). This support involves applying knowledge of machine learning techniques and concepts, including the design and implementation of advanced artificial intelligence, computational algorithms, and data science techniques. Additional Senior Data Scientist responsibilities are as follows, to include but not limited to: Developing applications using Python and C++ or JavaApplying machine learning and algorithm knowledge to client problems independently.Participating e in and lead the running of experiments and documentation of results in technical or research whitepapersAssimilating and integrating technical inputs from performers, and analyze performers' technical deliverables and reports.Developing and documenting testing methodologies and protocols, ensuring they align with program technology components.Conducting technical writing for the development and refinement of briefing materials and other program documentation.Conducting independent reviews and summaries of related technical literature and emerging technologies, and participate in conferences and workshops related to program technical areas.Attending and participating in conferences and workshops related to program technical areas.Developing and documenting testing methodology and protocols, ensuring they align with program technology components while assessing performer results against program metrics.Coordinating, aligning, and scheduling technology development tasks across multiple performers and performer continuous analysis of technical progress in comparison to planned cost and scheduleBeing adaptable and flexible to perform a range of tasks and work with many different offices and organizations across the Intelligence Community.Producing deliverables in formats as required by staff leadership; formats may include standard Microsoft documents (Excel, Word, and PowerPoint), electronic/soft copy matrices and/or web-enabled formats.Working with senior officials, to build and sustain professional networks in a diverse, fast-paced, multi-task environment, and to manage competing priorities.Providing subject matter expertise in Government sponsor related technical area of concern.Developing, offering, and communicating innovative ideas proactively and effectively to Government sponsors.SDL2017"}