{"jobID": "2829241368", "jobLocation": "Rahway_NJ", "jobTitle": "Clinical Scientist", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck?s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world?s premier, most research-intensive biopharmaceutical company. Today, we?re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck?s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  This position is a coordinator/support role for the scientific conduct of a protocol. Assists the Program Lead and study team with the scientific conduct of clinical studies. May have specific task assignments for a single study or across multiple studies, e.g, adjudication support, medical monitoring, data management deliverables, preparation of meeting materials, safety and medical monitoring. May interact with internal and external stakeholders (study sites, committees, etc) in support of clinical study objectives. Education Minimum Requirement: Degree in the Life Sciences.  Bachelor?s degree with 4 years?; or MS with 3 years? relevant career experience.  Pharmaceutical and/or clinical drug development experience.  Demonstrated oral and written communication and computer/database management skills. Required Experience and Skills: Pharmaceutical and/or clinical drug development experience.  Demonstrated oral and written communication and computer/database management skills.  Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we?re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we?re inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com . *Search Firm Representatives Please Read Carefully:** Merck & Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  For more information about personal rights under Equal Employment Opportunity, visit:  EEOC Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf  EEOC GINA Supplement? at http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf  Merck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations. *Job** _Clinical Research (Non-M.D.)_ Merck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations. *Other Locations:** _NA-US-PA-Upper Gwynedd_*_Title:_** _Clinical Scientist_*_Primary Location:_** _NA-US-NJ-Rahway_*_Requisition ID:_** _CLI007535_"}