{"jobID": "2815176261", "jobLocation": "Falls_Church_VA", "jobTitle": "Data Scientist / Analyst", "companyRating": null, "companyInfo": {"Website": "www.ucs-inc.com", "Headquarters": "Fairfax, VA", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Title Data Scientist / Analyst EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law. About the Organization Universal Consulting Services, Inc. (UCS) is a rapidly growing Government contractor known for our expertise in health and IT solutions. Our driven, passionate professionals are catalysts for improving performance across all levels of Government. We have been recognized as one of Washington Technology's FAST 50 for our tremendous success as a woman-owned business, in addition to inclusion on Inc. Magazine's 5000 list of the fastest-growing companies in America for 2008. Our clients include, but are not limited to, the Department of Defense, Department of Justice, and Department of Treasury. DescriptionUniversal Consulting Services, Inc. is currently seeking a Data Scientist / Analyst to support a federal customer in Falls Church, VA. This position is contingent upon award.Qualifications required: Bachelor’s Degree in healthcare or Business Administration, Economics, Accounting, Mathematics, Applied Statistics, or Operational Research.10+ years of relevant experience.Demonstrated ability conducting thorough and comprehensive system-wide currency, business case and return on investment analysis for healthcare operations within the MHS, Veterans Administration (VA) or private sector. Experience in communicating in writing complex concepts and their effects/impacts on the target environment, such that a lay audience is capable of understanding.Proven ability to identify and implement solutions to improve clinical and business data quality.Experience working in a leadership role within Resource Management, Group Practice Management, or TRICARE Operations is desired.Demonstrated knowledge of the CHCS/AHLTA and/or M2 file and table structures or Military Data Repository (MDR).Demonstrated knowledge of medical coding practices and processes – International Classification of Diseases (ICD)-9/10 and Current Procedural Terminology (CPT)/Healthcare Common Procedure Coding System (HCPCS).Demonstrated knowledge of healthcare business processes. Prepare briefing papers on various financial, administrative, and business process matters. Prepare technical writing and information papers. Provide technical, administrative, editorial and graphics support for the purpose of preparing special reports, studies and analyses. Familiar with current and/or available business intelligence software/applications and data visualization tools.5+ years of experience with integration of performance planning goals to meet the objectives of the MHS, VA and/or AFMS is desired.5+ years of experience to include significant knowledge of MHS Medical Expense Personnel Reporting System (MEPRS) Defense Medical Human Resources System Internet (DMHRSi), Manpower, Program Objective Memorandum (POM) processes, Finance, and Referral Management/Access to Care.Ability to gain access to some of the following MHS information systems: the Military Health System Management and Reporting Tool (M2), Composite Health Care System (CHCS), Armed Forces Health Longitudinal Technology Application (AHLTA), Essentris, Pharmacy Data Transaction Service (PDTS), Theater Medical Data Store (TMDS), MEPRS/DMHRSi, Expense Assignment System Version IV (EAS IV), Air Force Corporate Health Information Processing Service (AFCHIPS), MDR, Health Services Data Warehouse (HSDW), MHS Genesis, Medical Readiness Decision Support System (MRDSS) and other applicable systems as developed.Secret clearance required. Position Requirements Location Falls Church, VA Full-Time/Part-Time Full-Time Exempt/Non-Exempt ExemptThis position is currently accepting applications.Apply Now"}