{"jobID": "2783025099", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Software Engineer, Continuous Delivery", "companyRating": "3.8", "companyInfo": {"Website": "www.lookout.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FireEye, Palo Alto Networks, Symantec"}, "estimatedSalary": "175000", "jobDescription": " Lookout is a cybersecurity company that makes it possible for individuals and enterprises to be both mobile and secure. With 150 million mobile sensors fueling a dataset of virtually all the mobile code in the world, the Lookout Security Cloud can identify connections that would otherwise go unseen -- predicting and stopping mobile attacks before they do harm. Headquartered in San Francisco, Lookout has offices in Amsterdam, Boston, London, Sydney, Tokyo, Toronto and Washington, D.C. To learn more, visit www.lookout.com.  With a massive mobile security dataset and over 100 granted patents, Lookouts security platform, the Lookout Security Cloud, supports a wide range of Lookout products and services and forms the backbone of Lookouts value and competitive advantages in the mobile security market. Now is a great time to be joining Lookout as we are right at the center of all of the exciting mobile security market trends. Lookouts Continuous Delivery team is transforming how Lookout Engineering teams build and deliver products. The team's vision is to enable innovation and delight our fellow engineers and customers by providing a low friction, high quality continuous delivery platform.  As a Senior Engineer working on continuous delivery, you will play a pivotal role enabling Lookout engineering teams to rapidly build, deliver and run global products and services at scale. You will work with a nimble team to build, deploy and document the components that comprise the continuous delivery pipeline in AWS. We strive to constantly expand our internal engineering teams ability to quickly release new services and features for our customers. Our core tool chain includes a variety of OSS projects (Spinnaker, Docker, Chef, Jenkins, Terraform, Consul) which broadens the languages we use (Python, Java, Ruby, Groovy, Go).  As we continue to grow and scale, we need a rock solid engineer who loves the challenge of helping fellow engineers deliver existing and new products to customers faster and with greater quality. Responsibilities: For this position, we are looking for a candidate with strong background in cloud services, ci/cd and distributed systems. Develop new services and features for CD platformEvaluate new technologies and methodologies for integration into CD platformFully participate in the ownership of your services and components, including on-call dutiesImplement comprehensive functional and system test automationCreate documentation to enable self serviceInternal customer outreach, advocacy, and supportMinimum Qualifications:Strong software engineer with excellent object-oriented development skillsExperience designing, building and operating large-scale distributed systems in AWSProficient in Python, Java, Ruby or GoProficient in infrastructure configuration automation and orchestrationProficient in CI/CD tool chains and test driven developmentExcellent communication and collaboration skillsBS/MS in Computer Science or related field/degree, and/or equivalent work experiencePreferred QualificationsAWS VPC networking experienceContainer orchestration"}