{"jobID": "2837426679", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist- NEMT Support", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "102000", "jobDescription": " Job Description & Qualifications Position Overview/Description: Ford Global Data Insight and Analytics (GDI&A;) is a growing team that is looking for a Data Scientist to join the Smart Mobility Analytics team. We are looking for a high-potential data scientist to assist in all phases of analysis. This is an exciting role that will interface with a wide variety of teams both within GDI&A; and across the enterprise. This role with offer a broad spectrum of opportunities and will require a successful candidate to have strengths in both strategy and analytics. Responsibilities:Strategic Thinking: Able to influence the strategic direction of the company by identifying opportunities in large, rich data sets and creating and implementing data driven strategies that fuel growth including cost savings, revenue and profitModeling: Experience with creating ETL processes to source and link data, design and select features, develop and implement statistical / predictive models using edge algorithms on diverse sources of data and testing and validation of models.Analytics: Utilize analytical applications like R, Python, SAS, Alteryx, to identify trends and relationships between different pieces of data, draw appropriate conclusions and translate analytical findings into business strategies.Visualization: Create visualizations to connect disparate data, find patterns and tell engaging stories. This includes both scientific and geospatial visualizations using applications such as Tableau, Qlik and ArcGIS.Deployment: Be able to deploy statistical/machine learning models into a platform or applicationCommunications and Project Management: Capable of turning dry analysis into an exciting story that influences the direction of the business and communicating with diverse teams to take a project from start to finish. Collaborate with product teams to develop and support our internal data platform and to support ongoing analyses.Engage in exciting and constantly evolving projects that will help to form the future of Ford Motor Company.Job Requirements:Basic Qualifications:Bachelor's Degree in a science-based program and/or quantitative discipline with an emphasis on data analysis1+ years of experience with R, Alteryx, Python, SAS, MatLab, Java, ArcGIS or other analytic / development platforms.Preferred Qualifications:MBA or M.S. in a science-based program and/or quantitative discipline with an emphasis on data analysis3+ years of experience with R, Python, SAS, MatLab, Java, or other analytic / development platforms.1+ year experience with Hive, Spark, Scala, JavaScript, SQL, Html, CSS, RShiny, or D3Previous experience working with mobility, transportation, and urban planning problems is a plusFamiliarity with big data and machine learning tools and platforms.Project management experience and strong leadership skillsComfortable working in a dynamic environment where problems are not always well-definedInquisitive, proactive, and interested in learning new tools and techniquesStrong oral, written and interpersonal communication skills The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities you'd expect from a diverse global leader. You'll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always to go further.  Visa sponsorship may be available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status.SDL2017"}