{"jobID": "2834331137", "jobLocation": "Arlington_VA", "jobTitle": "Deputy Chief Scientist", "companyRating": null, "companyInfo": {"Website": "www.touchstoneenergy.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DescriptionEngineering  Posted on: Tue, 17 Apr 2018 Job Description The National Rural Electric Cooperative Association (NRECA), with offices in Arlington, VA and Lincoln, NE is the trade association for over 900 consumer-owned electric cooperatives serving more than 42 million people. NRECA is committed to harnessing the strength of Americas electric cooperatives into a single powerful voice. NRECA has won the following awards over the past few years: Top Workplace by the Washington Post100 Best Places to Work - ComputerWorld Magazine50 Best Places to Work - The WashingtonianCARE Award Recipient - Recognizing organizations that promote a positive work-life balance50 Greatest places to Work - AARPBest Place to Work Award Recipient - Lincoln, NEGold Well Workplace - Wellness Councils of AmericaState of NE Governor's Wellness Award - Grower Level At NRECA, we work with people who are leaders in their fields. They are down-to-earth, hardworking professionals committed to helping our members serve their communities. Our work is interesting, constantly evolving, and requires new skills to meet the evolving needs of a dynamic industry. In this collegial, inclusive work environment, united around the compelling purpose and history of electric cooperatives, we thrive. And topping it off, NRECA cares about each persons overall well-being, encouraging health, financial security, and a sustainable work/life balance. EEO/AA- M/F/Disability/Protected Veteran Status/Genetic Data  Summary  Deputy Chief Scientist  Support the Chief Scientist with serving as the Research, Engineering, and Technical Services (RETS) technical liaison; assist with building and advancing strong, winning research and funding relationships which generate funding for programs from federal agencies, industry, and national laboratories; produce successful technical proposals for multi-million dollar grants; and manage large, technically-complex projects.  Purpose and Mission In coordination with the Chief Scientist:Assist with leading and managing technologically-complex research projects, which provide bottom-line and operational effectiveness impact to cooperatives in such areas as distribution, transmission, generation, renewable and distributed energy, energy efficiency and demand response, and smarter grid technologies.Support building and advancing strong, winning relationships with federal agencies, large industry, and the network of national laboratories. Forecast and inspire/incubate funding opportunities and support for NRECA projects; and generate innovative partnerships with federal agencies in order to secure funding.Identify compelling, unique project ideas with high-win potential grant applications. Support building strong project teams including subject matter experts; rally large teams for proposals; and oversee, produce technical portions, and structure components of large, multi-million dollar grant proposals.Conduct primary research and produce while analyzing and communicating technical barriers, enlisting member and partner endorsements, and deliver results at high-level briefings to national laboratories and federal government agency executives, senior advisors, and project managers with funding authority.Serve as one of the technical resources for the CRN and Energy and Power divisions and lead the development of intellectual property to expand NRECAs technical capabilities and demonstrate national technical leadership.Attract and recruit stakeholders and build necessary coalitions to raise grant matching funds, and negotiate financial obligations for participation in joint research opportunities.Monitor Department of Energy (DOE) current engagements to maintain an understanding of their research portfolio, and forecast and develop new NRECA research opportunities, which align with future DOE programs.Shape opportunities for NRECA to participate in technical briefings and presentations to federal agencies, large industry, national laboratories, academia, and research institutions.Support the development and maintenance of a comprehensive vision of the future of the grid. Requirements and Qualifications  Ability to manage competing deadlines and multiple projects at various stages of development using effective organization skills and attention to detail as demonstrated by prior work experience.  Ability to work with a wide variety of people to foster cooperation in sharing information and materials as demonstrated by prior work experience.  Ability to lead people and foster collaborative skills and consensus building while operating in a fast-moving environment as demonstrated by prior work experience.  Ability to build consortia and syndication of industry partners around research objectives as demonstrated by prior work experience.  Ability to structure grant proposals with a successful win record as demonstrated by prior work experience.  Ability to successfully function in the Federal grant and contract process as demonstrated by prior work experience.  Ability to deliver academic-level technical research analysis, writings and patents as demonstrated by prior work experience.  Ability to operate independently with a high level of visibility and to shift priorities in a rapidly-changing environment as demonstrated by prior work experience.  Ability to travel from 15-30%, fluctuating as needed to foster effective relationships as demonstrated by prior work experience.  Ability to recruit, organize, lead, and manage technical teams in the execution of grants, contracts, and internally funded product as demonstrated by prior work experience.  Ability to explain complex technical subjects clearly to non-specialists, in presentations and in writing as demonstrated by prior work experience.  Ability to use Microsoft Office tools (Excel, Word, Outlook, Power Point) in the day-to-day essential duties of the job as demonstrated by prior work experience  Disclaimer Statement: The preceding job description has been written to reflect managements assignment of essential functions. It does not prescribe or restrict the tasks that may be assigned. LI-KC1 Job Information Location: Arlington, Virginia, United StatesJob ID: 42065721Posted: June 29, 2018Position Title:Deputy Chief ScientistCompany Name:NRECAJob Function:OtherSDL2017"}