{"jobID": "2815558489", "jobLocation": "Springfield_VA", "jobTitle": "Training Lead/Consultant", "companyRating": null, "companyInfo": {"Website": "www.alteristic.org", "Headquarters": "Springfield, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Alteristic seeks a seasoned, dynamic and charismatic public speaker with demonstrated leadership skills to join our training team. We are a high-growth, mission-driven organization dedicated to the dramatic reduction of power-based personal violence. The Training Lead/Consultant will provide high level consultation and training on research-informed, data driven prevention strategies for government departments, agencies, affiliated entities, corporations, and other organizations. The ideal candidate will have exemplary interpersonal and public speaking skills, initiative, and will be highly collaborative. This job requires up to 50% travel. This position may have the option to work remotely from anywhere in the US, depending on individual job responsibilities.We offer a competitive salary commensurate with education and experience, and our benefits package includes health, dental and vision insurance, life insurance, generous leave, and retirement. Job Duties:Provide trainings and consultations to government departments, agencies, affiliated entities, corporations, and other organizations on evidence based violence prevention strategies.Lead in training and adaptation of content for diverse departments, agencies and organizations.Work with a team to develop effective prevention recommendations and trainings.Present recommendations and conduct trainings to government departments, agencies, other entities, corporations, and organizations.Provide training and technical assistance in the domains of power-based personal violence prevention (sexual assault, intimate partner violence, stalking, bullying, child abuse, and elder abuse) and effective community mobilization including but not limited to the Green Dot Violence Prevention strategy.Serve as a point of contact for technical assistance related to prevention strategies. This includes providing face to face, telephone, and web-based consultations regarding effective prevention and supporting clients through the process of implementing prevention strategies.Contribute as a team member to prevention program curriculum development for government departments, agencies, affiliated entities, and other organizations.Master new and existing training programs and stay abreast of key developments in the field.Other duties as assignedEmployment Requirements:Master’s degree requiredMust have 5-7 years experience providing high level training and consultation to government agencies or other organizationsMust have some degree of experience with power-based personal violence prevention in the area of intimate partner violence, sexual assault, stalking, child abuse, elder abuse, and/or bullyingMust be a dynamic and persuasive trainerMust be an excellent communicatorMust be self-directedExperience with program and content development preferredExperience working with diverse populations and proficiency in languages other than English is preferredExperience and/or training in adult education is highly desirableHow To Apply:Interested candidates should submit a resume, letter of interest, a writing sample (for example, academic writing, curricular writing or similar) and a 5-minute video demonstrating candidate’s public speaking style (does not need to be specific to this topic) to: applicants@alteristic.org. Please put \"Training Lead/Consultant\" in email subject line. Apply as soon as possible as resumes/tapes are evaluated and interviews scheduled as applications are received."}