{"jobID": "2737424028", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.q1tech.com", "Headquarters": "Aurora, IL", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Q1 Technologies, Inc. is looking to hire a  Data Scientist to join our rapidly growing information technology company.  At Q1 Technology Inc., our business is to assist our client in utilizing information technology to gain a competitive advantage. From system integration to contingent workforce solutions, we have enabled our client to exceed their business objectives. Job Title: Data Scientist Contract Type: W2 Employee Work Location: Chicago, IL Duration: 6 months + Job Description: Participate in project discussion and make technical contributions in the discussion Perform Exploratory Data Analysis on existing Customer Model Identify opportunities for enhancement of the Customer Model Perform statistical association between the fields based on data Derive new clustering algorithms, new metrics better reflective of customer interests, algorithmically handling large numbers of user’s affinities Design improvement criteria metrics / statistical correlation metrics and improvement assessment models Deploy refreshed model into UAT environment Work with various teams to deploy into production environment Ability to \"translate\" complex mathematical and statistical concepts for non-technical audiencesEssential Skills: 4-6 years experience in End to end Analytics & Modelling Experience Demonstrable knowledge of modelling (e.g. cluster analysis, decision trees, regression, propensity modelling, Bayesian) & Collaborative Filtering techniques Extremely strong hands on experiences with Churn Analytics, customer segmentation, Clustering, Multi-channel and cross channel Analytics, Bundling offer Analysis, Trend Analytics Basic understanding of Media & Information Services Business Well familiar with new concepts like Internet of thing, Machine Learning, Big Data Experience of working on big data problems, whether in industry or academia Very Good Knowledge on one and more Statistical Tool like R/Python Hands on experience with Data extraction from Apache SPARK, SCALA, HIVE Solid hands-on experiences with Hadoop technology components such as HDFS, HBase, Cassandra, Kafa especially with Spark and Spark Streaming Familiar with programming concepts with C/C++ and Java. Very Good Knowledge on working with MS Office especially PowerPoint, Excel"}