{"jobID": "2817383011", "jobLocation": "Palo_Alto_CA", "jobTitle": "Machine Learning Scientist", "companyRating": null, "companyInfo": {"Website": "www.luminartech.com", "Headquarters": "Orlando, FL", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our vision is to power every autonomous vehicle with the first LiDAR capable of making them both safe and scalable. Its easy to get an autonomous vehicle to work 99% of the time, but its the last 1% thats preventing them from becoming a reality. Thats where we come in. Weve built a breakthrough LiDAR from the chip level up, delivering 50x better resolution and 10x longer range than the most advanced LiDARs available today. Luminar is not just a sensor, but the core of a platform that can enable the industry to have safe autonomous vehicles on the road.We are a diverse team of passionate and driven individuals, making us a powerhouse of innovation, design, engineering, and manufacturing. We are hiring the best and the brightest to accelerate the industry, and bring forward the next transportation revolution.You will develop detection, multi-target tracking algorithms and perception modules required for control of an autonomous vehicle.Responsibilities:Develop multi-target multi-hypothesis tracking algorithms for dynamic objects such as vehicles, pedestrians and distinguishing them from clutter and obstacles.Architect, build, test, and maintain systems for data association and state estimation by processing and fusing raw sensor measurements.Research and develop tracking and fusion algorithms for extended bodies.Skills and Abilities:· Academic or research and development experience with theory and design of multi-target multi-sensor algorithms for object tracking and prediction· Familiarity with Bayesian or Machine Learning frameworks for detection and tracking· Ability to implement algorithms as high-quality real-time software in C++· Experience with Multiple Hypothesis Tracking from target-oriented point of view is a plus.· PhD preferred.Luminar is an equal opportunity employer. All applicants will be considered for employment without regard to race, color, ancestry, national origin, sex, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing, service in the military, or any other characteristic protected by applicable federal, state or local laws. We will make a reasonable accommodation for any qualified applicant with a disability, provided that the individual is otherwise qualified to safely perform the essential functions of the job with or without accommodation and that the accommodation would not impose an undue hardship on the operation of our business. Please let us know if you believe you require reasonable accommodation, or if you would like assistance to complete an application or to participate in an interview at the company.Luminar offers competitive compensation and a generous benefits package."}