{"jobID": "2628608062", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Programmatic Media Manager", "companyRating": "4.5", "companyInfo": {"Website": "www.jellyfish.net", "Headquarters": "REIGATE, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " OverviewJellyfish delivers digital marketing solutions across the world for a host of impressive brands from their offices in the US, Europe, and South Africa. The agency’s award-winning combination of technology and talent help it to deliver paid media, UX, SEO, social media, analytics, optimization, creative and development solutions.  We are looking for a motivated Senior Programmatic Media Manager who can utilize their existing Real-Time Bidding (RTB) ad operations and marketing skills and be involved in developing major client accounts. This area of the business will undergo remarkable investment and growth this year, and the ideal individual will have the opportunity to make an immediate impact on our success.  The core responsibilities for the Senior Programmatic Media Managerare to execute accurate and efficient RTB campaigns for key clients.Responsibilities Optimize campaign performance across RTB platforms, striving to consistently refine tactics and produce exceptional results for our advertisersDevelop client insights, reporting, and analysis to inform our client’s strategiesPartner with Business Development to develop innovative strategies for prospective clientsCollaborate across internal teams to create holistic advertiser solutions which span all areas of the digital spectrumInterpretation of attribution modelling and 3rd party analytics dataManage deal economics, media allocation, and advertiser investment decisionsMentor and educate more junior staff as the RTB business expandsQualificationsBachelor’s degree, preferably in Business, Economics, Finance or quantitative field3-5 years of experience, preferably in an agency environmentDemonstrable knowledge of display advertising, specifically real-time bidding, ad networks, DSP platforms, attribution models, and associated technologiesA strong passion for problem solving and innovationStrong aptitude for numerical detail and analysisAdvanced Excel skills are essential, Macros & SQL capabilities are a plusStrong business writing and interpersonal comunication skillsDemonstrate a structured and methodical way of working, with the ability to cope with competing demands and effectively prioritize tasks Jellyfish is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, gender, religion, age, disability, veteran’s status, or any other classification as required by applicable law."}