{"jobID": "2631370513", "jobLocation": "Fairfax_VA", "jobTitle": "Data Scientist/Analytic Lead/SME", "companyRating": "3.8", "companyInfo": {"Website": "www.sbd.com", "Headquarters": "Vienna, VA", "Size": "1 to 50 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " SBD is seeking a motivated Data Scientist/Analytic Lead/SME to join an exciting modernization project for our client working in a fast-paced and forward-thinking agile environment. The project team will be responsible for developing and supporting a custom developed web-enabled system. This includes the user story development, architectural design, coding, testing, implementation, and maintenance of new functionalities as well as enhancements to existing ones. Data Analytics support is a critical function of the system and will provide users the ability to analyze and use the health insurance and related information. This includes a data repository and analytics solution to act as a cloud-based data platform for capturing, sharing, aggregating, and analyzing health insurance and related information to support improved decision making, improved business practices and improved services to states and federal agencies. Responsibilities:Determine the most appropriate research projects, data collection and methodologies.Identify, retrieve, manipulate, relate and/or exploit multiple structured and unstructured data sets from various sources, including building or generating new data sets as appropriate.Interpret and evaluate the results of data science community's methods models and/or algorithms, understanding the meaning, limitations and scope of the results, translating into insightful output for data science and/or mission and identifying other applications for use.Initiate the efficient implementation of methods, tools, algorithms, including preliminary data exploration, data visualization and preparation, model calibration, specification or estimation: and algorithm validation and verification using a comprehensive range of technologies (e.g. software packages, programming languages, computational environments).Educate managers, senior internal officers and the IC through mediums such as presentations, documentation and discussions.Lead work unit proactively addressing and responding to the most difficult data science-related challenges in a timely manner while effectively balancing competing priorities. Coordinate sub tasks for successful project task integration.To be considered for this role, candidates must have:8+ years relevant experienceExperience designing a range of research projects, data collection and methodologies.Experience identify, retrieving, manipulating, relating and/or exploiting multiple structured data sets from various sources.Identify problems to which data science can be applied and initiate appropriate solutions.Identify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems; recognizing the capabilities and limitations of methodsDemonstrated strong writing and briefing skills consistent with national-level performance.Proven history of successful interaction in a client-facing environment.Understand basic fundamentals of iterative developmentUnderstand basic fundamentals of software development processes and proceduresUnderstand incremental delivery and the value of metricsExperience and familiarity with common Agile practices, service-oriented environments, and better development practices in a Microservices environment.Must be able to pass background investigationMust be forward thinking and passionate problem solver able to work in a group environment that contributes to global client and company mission and cultureAble to take on new challenges and professionally communicate and collaborate with peers and executive client and corporate leadershipSolutions By Design II, LLC (SBD) is committed to the development of a creative, diverse and inclusive work environment. In order to provide equal employment and advancement opportunities to all individuals, employment decisions at SBD will be based on merit, qualifications, and abilities. SBD does not discriminate against any person because of race, color, creed, religion, sex, national origin, disability, age, IWDs, Veteran Status or any other characteristic protected by law (referred to as \"protected status\")."}