{"jobID": "2828154283", "jobLocation": "Boise_ID", "jobTitle": "IT Data Engineer (PERM)", "companyRating": "3.6", "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": "81000", "jobDescription": " Req Id: 120800   As an IT Data Engineer at Micron Technology Inc., you will be a key member of a cross-functional team responsible for developing and growing Micron’s methods and systems for extracting new insight for our expanding data streams. You will be collaborating with Data Scientists, Engineers, Technicians and Data Mining teams to design and implement systems to extract data from Micron’s business systems, transforming it into an actionable format, and as needed, creating dynamic presentation layers for use by high-level engineers and managers throughout the company. You will be creating new solutions, as well as, supporting, configuring, and enhancing existing solutions. You will be a key member of a DevOps team responsible for bridging gaps and bringing efficiencies to both solutions and operations space. In this position, you will utilize excellent oral, written, and technical communication skills and a solid command of the English language and must be self-motivated and team oriented.  Responsibilities:  Maintain an intimate understanding of company and department strategy  Translate analysis requirements into data requirements  Identify and understand the data sources that are relevant to the business problem  Develop conceptual models that capture the relationships within the data  Define the data-quality objectives for the solution  Be a subject matter expert in data sources and reporting options  Leverage understanding of the business problem and the nature of the data to select appropriate data management system (Big Data, OLTP, OLAP, etc.)  Design and implement optimum data structures in the appropriate data management system (Hadoop, Teradata, SQL Server, etc.) to satisfy the data requirements  Plan methods for archiving/deletion of information  Identify and select the optimum methods of access for each data source (real-time/streaming, delayed, static)  Determine transformation requirements and develop processes to bring structured and unstructured data from the source to a new physical data model  Develop processes to efficiently load the transform data into the data management system  Work with the Data Scientist to implement strategies for cleaning and preparing data for analysis (e.g., outliers, missing data, etc.)  Develop and code data extracts  Follow best practices to ensure data quality and data integrity  Ensure that the data is fit to use for data science applications  Act as a liaison between multiple Development and Operations team  Participate directly in Solution Development Teams to plan and develop new product deployments, advocate solutions for systems architecture and proactively detect areas for improvement  Accelerate existing projects and contribute to the planning and executing of future projects related to solution development and operations  Identify opportunities and contribute ideas for automation and work closely with enablement teams on how to continuously improve speed and quality of solutions  Identify, define and document structured work. Close gaps on training for the operations support teams  Lead and perform reviews to ensure the solutions are robust and resilient  Enable quality assurance and ensure the planned solutions are meeting CLM/AI requirements  Explore and rapidly adopt new technologies in the CLM/AI space  Minimum Qualifications:  Knowledge or experience with SQL and PL/SQL  Knowledge or experience with data warehouse and business intelligence concepts and solutions.  Knowledge or experience with business intelligence data modeling  Knowledge or experience building ETI solutions using ETL tools such as Microsoft SSIS or Informatica.  Knowledge or experience with Shell, Hive and pig scripting.  Knowledge or experience in building reports and dashboards with SSRS and Tableau.  Knowledge or experience with continuous integration tools (such as Jenkins and Subversion).  Knowledge or experience with testing methodologies and automation of testing.  Ability to travel 7 – 14 days a year.  All job offers will be contingent upon a successful drug screening and background check.  Work Location: 8000 S. Federal Way, Boise, ID 83716  Hours of work: Usually 8 a.m. to 5 p.m., Monday through Friday- also must be willing to work nights and weekends  when necessary  Degree Required: BS or equivalent foreign education  Academic Discipline(s): Computer Science, Software Engineering, Electrical Engineering, Applied Mathematics  Experience Required: 2 years of progressive post baccalaureate experience We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices. Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters. To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748). Keywords: Boise || Idaho (US-ID) || United States (US) || Technology Development || Experienced || Regular || Engineering || Not Applicable ||"}