{"jobID": "2793623250", "jobLocation": "Southlake_TX", "jobTitle": "Contributor Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.sabre.com", "Headquarters": "Southlake, TX", "Size": "5001 to 10000 employees", "Founded": " 1960", "Type": " Company - Public (SABR) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Amadeus, Travelport"}, "estimatedSalary": "86000", "jobDescription": "Req ID: 36680 Job Family: Information Technology/Software Development  Sabre is the global leader in innovative technology that leads the travel industry. We are always looking for bright and driven people who have a penchant for technology and want to hone their skills. If you are interested in challenging work, being part of a global team, and solving complex problems through technology, business intelligence and analytics, and Agile practices - then Sabre is right for you! It is our people who develop and deliver powerful solutions that meet the current and future needs for our airline, hotel, and travel agency customers.Job Description Under general supervision, identifies and solves business problems using data which leads to innovative products that financially benefits the organization. May produces prototypes for end product and evaluate travel products. Possesses the ability to identify and prioritize potential ideas and communicate them effectively. Supports team members and internal customers with various business decisions for products and services utilizing available data. Demonstrates full requirements of the functional area, exercises judgment within defined practices to determine appropriate action.Applies fundamental skills, concepts, practices and procedures to complete moderate to difficult assignments, refers more complex issues to higher levels.Works under general supervision with few direct instructions, decisions are frequently reviewed.Decisions and actions have impact on success of team or department.Job Requirements EDUCATION: Bachelor's degree or equivalent.  EXPERIENCE: Minimum 3 years related experience. Good written and verbal communication skills; ability to handle multiple projects simultaneously. a img { outline:none; padding:0; margin:0;}img { outline:none;}Reasonable Accommodation Sabre is committed to working with and providing reasonable accommodation to applicants with disabilities. Applicants applying for a Sabre position with a disability who require a reasonable accommodation for any part of the application or hiring process may contact Sabre&apos;s Employee Relations Department at employee.relations@sabre.com Affirmative Action Sabre is an equal employment opportunity/affirmative action employer and is committed to providing equal employment opportunities to minorities, females, veterans, and disabled individuals. EEO IS THE LAW Stay connected with Sabre Careers"}