{"jobID": "2836640405", "jobLocation": "Chicago_IL", "jobTitle": "Senior Scientist, Data III", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "153000", "jobDescription": "The Enterprise Architecture group is looking to add a leader to establish a data scientist community of practice across AbbVie, to shape strategy and to experiment with new, innovative data driven solutions that move AbbVie business forward. This position will generate new proposals and lead those efforts. He or she will investigate, identify, develop, and optimize new methods, algorithms, and technologies to derive novel, competitive insights from disparate data sources and drive productivity and efficiency gains throughout multiple business areas. The candidate will collaborate with other data scientists and developers to identify, design, build and maintain tools, analytical workflows and applications to streamline and strengthen scientific, marketing and manufacturing areas. A successful candidate will be someone who enjoys applying new and emerging analytical methods and visualization technologies on real world data for the purposes of building solutions that serve both technical and scientific audiences. Key Responsibilities Include:Demonstrates mastery across a wide range of data science technologies, including big data, data integration, data visualization and analysis, software development, statistics, natural language processing and machine learning.Demonstrates knowledge of the pharmaceutical and healthcare business and utilize this knowledge in the rapid advancement of agile, impactful and cost-effective solutions.Highly autonomous and productive in performing activities, requiring only minimal direction from or interaction with supervisor.Being equally comfortable working independently and within a team depending on project needCollaborating with business-facing data scientists to identify and understand their analytical and business needs and translate these into solutions.Conceiving, designing and implementing business technology solutions that solve significant scientific or business problems through the integration, visualization, and analysis of large and complex data. Routinely demonstrating initiative and creativity in developing technology solutions.Act as an expert in AI/ML. Explore future directions of machine intelligence and keep abreast of the latest developments. Produce high-quality analyses and codebases that extend the capabilities and impact of the team.Demonstrating creative 'out of the box' thinking to solve difficult problems and champion new technologies to achieve project goals.May initiate new areas of investigation that are meaningful, reliable and can be incorporated directly into a scientific or business activity.Directly mentoring others.Understanding and adhering to corporate standards regarding applicable corporate and divisional Policies, including code of conduct, safety, GxP compliance, and data security.Communicating and collaborating effectively with colleagues in varied scientific and technical roles.Basic:Bachelor’s Degree or equivalent education and typically 10 years of experience; Master’s Degree or equivalent education and typically 8 years of experience; PhD and no experience necessary. Background in life sciences or work experience in the pharmaceutical industry preferred.Proficiency in R and Python for both data analysis and software engineering.Experience with relational (SQL) and document (NoSQL) database design, data modelling and big data would be preferred.Possess thorough theoretical and practical understanding of own discipline.Proven implementation of creative technology solutions that advanced the business.Excellent written and oral English communication skills.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}