{"jobID": "2828806669", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Scientist II- Ecommerce", "companyRating": "4.1", "companyInfo": {"Website": "www.heb.com", "Headquarters": "San Antonio, TX", "Size": "10000+ employees", "Founded": " 1905", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " H-E-B's Corporate Planning and Analysis Team develops and maintains budgets and financial systems while providing current, reliable financial data, analysis, and technical information.  As a Data Scientist II, you will work with more senior team members on assigned data science projects, combining predictive analytics, machine learning, data modeling, and a developing business sense to assist in decision-making for moderately-complex business problems. You won't just report the data, you'll also build it, its attributes, and its parameters, while tailoring People-friendly solutions to emerging business challenges.  Once you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that makes H-E-B The Greatest Retailing Company. Do you have a: HEART FOR PEOPLE... ability to share with and influence different audiences?  HEAD FOR BUSINESS... skills to convert Management's questions into problems, then solutions?  PASSION FOR RESULTS... ability to generate business-valued questions and data-driven solutions? We are looking for:experience in a retail-related data / decision science roleability to work comfortably with imperfect / incomplete datasomeone with a curious and inquisitive nature What is the work? Analytics / Design & Development:As part of the broader Team, explores, develops, and delivers solutions to meet business needsApplies technical knowledge to help create Customer-centric solutions to moderately-complex business problems, across multiple business areasIndependently converts business management questions into analyzable problems and provide solutionsDevelops / applies algorithms, and mines and analyzes complex unstructured data sets to recommend solutionsResearches, analyzes, models, and reports on organizational data in support of Team projectsAdvising:Collaborates closely / follows through with business owners to answer management questions and recommend actionsPresents findings to senior management in non-technical terms What is your background? Bachelor's degree in statistics, mathematics, engineering, computer science, or a related quantitative field and4 - 6 years of professional experience in a data / decision science role ORGraduate degree (a plus) and2 - 4 years of experience in retail or other consumer-facing industriesExpertise / in-depth knowledge of business domain Do you have what it takes to be a Data Scientist at H-E-B? Knowledge of- typical data science techniques, such as classification, regression, and optimization statistical programming languages, such as R, SAS, SPSS, etc.- MS Office- one or more of the following scripting languages: Python, Perl, Java, or Ruby- relational databases, such as Teradata (preferred) or Oracle, and SQL- BI tools, such as MicroStrategyFamiliarity with- machine learning packages like KNIME, RapidMiner- Hadoop, distributed file systems, and Big Data ecosystemsStrong research / analytical skillsCritical and lateral thinking skillsStrong written / verbal communication and presentation skillsStrong project management, time management, organization skills; attention to detailPersonal leadership skillsAbility to work comfortably with imperfect / incomplete dataAbility to work comfortably in a fast-paced retail environment with frequently shifting prioritiesAbility to influence different audiencesCreativity, persistence, initiative; willingness to take risks Can you... Function in a fast-paced, retail, office environmentTravel by car or airplane with overnight staysSit for an extended period of timeWork extended hoursDATASCI3232"}