{"jobID": "2789318174", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Analyst, Payments", "companyRating": "3.9", "companyInfo": {"Website": "www.udacity.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "133000", "jobDescription": "Udacity's mission is to democratize education. We're an online learning platform offering groundbreaking education in fields such as artificial intelligence, machine learning, robotics, virtual reality, and more. Focused on self-empowerment through learning, Udacity is making innovative technologies such as self-driving cars available to a global community of aspiring technologists, while also enabling learners at all levels to skill up with essentials like programming, web and app development. Udacity is looking for people to join our Data team. If you love a challenge, and truly want to make a difference in the world, read on.In this role, you will be providing rigorous data analysis to the payments team and finding key insights to improve our conversions and growth.Roles & Responsibilities: Build dashboards and tools that provide insight around key metrics for various payment platforms.Ad hoc analysis and data modeling to understand and predict behavior trends, in order to optimize growth and engagementProvide organizational support to ensure data integrity, consistent data definitions, and efficient data storage.Collaborate with cross-functional team members including product managers, and other software engineers to deliver compelling products/servicesWere Looking for Someone Who Has:Background in applied math, computer science, statistics, finance or related technical field, and 4+ years of industry experienceExperience with at least one scripting language (e.g. Python)Extensive experience with relational databases and SQLPrior experience with data cleaning and modelingPrior experience with financial data preferredWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}