{"jobID": "2825022498", "jobLocation": "Calabasas_CA", "jobTitle": "Business Intelligence Analyst- F2P", "companyRating": null, "companyInfo": {"Website": "www.505games.com", "Headquarters": "Milan, Italy", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " You will be responsible for all thing Business Intelligence for one or more titles at 505 Games. You will be looked at to drive insights and recommendations based on data to the product, marketing, design and production teams for you game(s). The function spans across many different verticals within the video game space, including tradition retail, connected console, smartphone/tablet, digital PC, and social networks – there will be opportunity and exposure for all. The titles also cover a broad range of business models, including F2P and Premium.  You will be accountable for all aspects of metrics tracking and analysis per each title, from the conceptualisation of data models necessary to track the various business KPIs, deep diving into these data sets to provide insights across the various business units, to predictive modelling and forecasting of future performance. This is a critical role for the Free-to-Play team as 505 is committed to being a data-driven organization. Key Responsibilities:Manage and prioritise request backlog for your specific titlesWork closely with Product and Production to ensure the team has the proper information to make the right product and business decisionsLiaise with publishing teams to capture their individual reporting & analytic requirements, from pre-launch through to Live ServiceWork closely with development teams (both internal & external) early in the development cycle to determine, advise and document the specification & requirements for event tracking on a per product basisDesign product specific event tracking data models from the collated specification & requirements documentation, and project manage the implementation of the designed data models with the development teamsWork with our standardized reporting template and visualization across all titles improvements based on feedback of your fellow team membersAdapt and extend existing data models to take into account of new features/content that are released on live service titlesReview existing and competing analytics services to ensure best ROIMonitor commercial KPIs for the mobile games portfolio across, and produce regular reports to be distributed across the wider business unitPerform ad hoc analysis on all areas of a games performance, feeding insights and recommendations back to business-area specialists to drive product performance. Areas of focus include:Improvement of player engagement & retentionUser acquisition effectivenessOptimisation of game economiesDrive monetisation (through new revenue streams & promotional strategies)Data-mine product player bases to provide both qualitative & quantitative context to issues identified by Customer Support, Quality Assurance & Community Management functionsSkills Required (essential):2+ years experience in a BI/analysis role, with a proven track record of delivering high profile, business focussed analytics solutions in a fast-paced environmentA passion for gaming and personal gaming experience, preferably FTPBe able to capture requirements from business stakeholders; interpret and articulate their requirements to development teamsSkills to perform technical data analysis (SQL, querying tools, etc)Strong data insight presentation skills, with mastery of Excel functions (to include: VLOOKUP, COUNTIFS, INDIRECT, INDEX/OFFSET, etc), knowledge/experience with Tableau,Working knowledge of implementing forecasted trend lines (linear, logarithmic, moving average, etc) in the tools mentioned aboveStrong business acumen, and a keen understanding of the KPI drivers for the differing business models now common place in the video games marketExcellent written/verbal communication & facilitation skillsAbility to work effectively and professionally with cross-functional teams worldwideMeticulous attention to detail, and have the ability to make good, timely decisionsAbility to multitask and context switch between low level detail and the ‘bigger picture’Motivated, organised self-starter with a flair for problem-solvingSkills Required (desirable):Knowledge of BI and data technologies including Tableau, Amazon Web Services, Redshift, Postgres, MySQL, etcRecognised business analysis qualificationExperience delivering complex business intelligence solutionsExperience working in an environment where flexibility and adaptability as an individual are critical"}