{"jobID": "2729703072", "jobLocation": "Mountain_View_CA", "jobTitle": "Machine Learning Scientist", "companyRating": null, "companyInfo": {"Website": "www.h2o.ai", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About H2O.ai H2O.ai is the company behind H2O, the premier open-source machine learning platform that is transforming how enterprise AI applications are built. H2O is a distributed machine learning platform designed for big data with APIs are available in R, Python, Scala, Java and REST/JSON. With H2O, data scientists can take sophisticated models all the way to production using the same user-friendly platform that they use for modeling. Our customers have built mission critical applications across all industries including healthcare, insurance, finance, telecommunications and retail. The H2O.ai team is a mix of software, machine learning, and data science experts working together with the open source community to build H2O.  Founded in 2012, H2O.ai was one of the first companies to create an enterprise machine learning platform and continues to lead in this space. H2O.ai has grown sustainably and steadily since it's inception and in 2018, was named a leader in the Gartner Magic Quadrant for Data Science and Machine Learning platforms. Job Description The primary focus of this role will be to assist in the research and development of H2O.ai's open source Automatic Machine Learning (AutoML) capabilities within the H2O and H2O4GPU projects. As a Machine Learning Scientist on H2O.ai's AutoML team, you will be responsible for keeping up to date on the latest research in the field of automatic machine learning, and help guide the development of the H2O AutoML algorithm & software. Much of the AutoML R&D; involves prototyping new methods in Python or R in conjunction with comprehensive benchmarking to measure the effect of various strategies. Responsibilities As a Machine Learning Scientist, you will work closely with H2O.ai Chief Machine Learning Scientist and the AutoML team to: Review existing and develop new methods in automated machine learning.Prototype AutoML techniques in R or Python and run extensive benchmarks.Contribute code in Python/R/Java to H2O or Python/R to H2O4GPU.Co-author papers, blog posts and tutorials about H2O AutoML.Education and ExperienceBachelor's degree in mathematics, statistics, engineering, computer science or related field. Graduate degree (MS/PhD) is a plus, but not required.3+ years experience with machine learning and data science. Experience with automatic machine learning, stacked ensembles, genetic and evolutionary algorithms and/or bayesian hyperparamter optimization a plus.Familiarity with H2O (have you installed H2O and played around?).3+ years experience using R or Python for data science. Experience with Java or Scala is a plus, but not required.Written blog posts/papers or given talks about about machine learning a plus (send us links!).Maker mindset & self-directed.Passion for open source. Work location: Mountain View, CA (part-time work from home ok)  H2O.ai is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, sexual orientation, gender identity, disability or veteran status.  H2O.ai perks:  Modern office in Mountain View, CA with floor-to-ceiling windows & natural light.  Lunch and dinner catered every day.  Flexible work hours and unlimited time off.  Get paid to work on open source software!"}