{"jobID": "2542281267", "jobLocation": "Santa_Barbara_CA", "jobTitle": "Customer Service Representative", "companyRating": "3.3", "companyInfo": {"Website": "www.stillwaterinsurance.com", "Headquarters": "Jacksonville, FL", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "17", "jobDescription": "~ Customer Service Representatives ~Stillwater Insurance Group currently has openings for Customer Service Representatives. Join our hardworking, collaborative team where your contributions will be celebrated and valued.  Why Stillwater? We’re a national insurance provider that offers a full suite of insurance products and services. We strive to be the most respected insurance provider in the United States and that respect starts with our employees.We are seeking individuals with strong verbal and written communication skills who will provide excellent customer service to our Property and Casualty insurance policyholders, agents and lenders via in-bound telephone calls and electronic communications.The ideal candidate will hold an active Personal Lines P & C agent license, however, we can provide license preparation for an otherwise qualified candidate.Spanish/Bi-lingual skills, a plus.Prior customer service and or P & C insurance experience, preferred.Minimum Qualifications: Ability to interpret verbal and written communication and make appropriate decisions. Commitment to excellent customer service. Strong attention to detail. Strong PC knowledge and key boarding skills, with a minimum of 35 wpm at 90% accuracy. Works 9:00 a.m. to 6:00 p.m., including Saturdays. Will be granted a day off in the work week to accommodate for Saturday hours.Stillwater offers: Business casual work environment – wear your jeans to work. Medical, dental, vision and life insurance benefits to keep you and your family protected. 401(k)Plan to help you plan for your retirement. Gym/Fitness Center and/or reimbursement to support your commitment to staying healthy. Generous Paid Time Off (PTO) program to help you maintain your work/life balance. Apply today to start your journey of being celebrated and valued with Stillwater Insurance Group.Offer for employment contingent upon the acceptable responses from both a background investigation and a pre-employment drug screen.  Stillwater Insurance Group is an equal opportunity employer and a drug free workplace."}