{"jobID": "2640073716", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.arubanetworks.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public (ARUN) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Cisco Systems, Motorola Solutions"}, "estimatedSalary": "150000", "jobDescription": " Apply  Data Scientist Date posted 12/02/2017 Location Santa Clara, CaliforniaAruba, a Hewlett Packard Enterprise Company, is a leading provider of next-generation networking solutions for the mobile enterprise: http://www.arubanetworks.com/company/about-us.  The company designs and delivers Mobility-Defined Networks that empower IT departments and #GenMobile, a new generation of tech-savvy users who rely on their mobile devices for every aspect of work and personal communication. To create a mobility experience that #GenMobile and IT can rely upon, Aruba Mobility-Defined Networks™ automate infrastructure-wide performance optimization and trigger security actions that used to require manual IT intervention. The results are dramatically improved productivity and lower operational costs.  Looking for a Data Scientist who can provide insights into data and help us build a better product! What You'll Do:Use state of the art data mining and machine learning techniquesBuilding and optimizing classifiersWork closely with the Analytics team in developing new modelsOur Minimum Requirements for This Role Are: 6+ years Python or R development experienceExcellent understanding of machine learning algorithmsExperience with data science toolkits NumPy, SciPy, scikit-learnExperience working with large data setsGood scripting and programming skillsBonus Points!:Experience working with Map Reduce or Spark systemSecurity backgroundBenefits you’ll enjoy At Aruba, a Hewlett Packard Enterprise Company, we offer an exciting and fun work culture, driving innovation, collaboration, and growth. We place our customers first, deliver some of the most innovative technologies to the market, and have fun doing it all! Come join our team and be part of an exciting organization poised for success!  Thanks for taking the time to review our job, if you think it is a match to your experience and interests please apply today — we are eager to learn more about you! We have dozens of openings, so encourage your friends to apply as well!  #ArubaNetworks #GenMobile #ArubaNetworksJobs #HPE #HewlettPackardEnterprise  Please note the above statements describe the general nature and level of work only. They are not a complete list of all required responsibilities, duties and skills. Other duties may be added, or this description amended at any time.Apply"}