{"jobID": "2831927360", "jobLocation": "Detroit_MI", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.quickenloans.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Citi, Bank of America, Wells Fargo"}, "estimatedSalary": "73000", "jobDescription": "Senior Data Analyst Company Amrock Inc.  Location US-MI-Detroit  Who We Are  We're Amrock, the nation's largest fintech provider of title insurance, valuations and closing services. We're a preferred provider to nine of the top 10 mortgage lenders, delivering innovative solutions to streamline the real estate and mortgage financing experience for lenders, property owners and real estate professionals nationwide. Our headquarters are in Detroit, and our team members span across the U.S., with offices in California, Ohio, Pennsylvania and Texas.  What You'll Do/Need  A Senior Business Intelligence Engineer uses strong SQL skills and reporting tools to create self-serve reports and analytic dashboards leveraging our enterprise data warehouse. If you're the type of person that keeps your skills sharp, is constantly reading about new technology and participates in online communities for BI practitioners then you're the type of person we are looking for. Our senior engineers are rock stars who understand and utilize BI best practices, have deep knowledge of SQL including query plans and performance tuning, have led architecture and design discussions, are passionate about BI and every aspect of the development lifecycle and it shows! ResponsibilitiesCreate reports using SQL Server Reporting ServicesWrite, test and debug SQL code for use in reportsWrite ad hoc SQL queries to answer business questionsParticipate in design and code reviewsCollaborate with business analysts and clients to understand business needsDesign and create solutions with an emphasis on usability and performanceParticipate in an on-call rotationParticipate in production code pushes after business hoursRequirementsStrong understanding of Data Warehousing conceptsExperience writing SQL queries with SQL Server, Oracle or similarExperience testing data setsGathering requirements for software development or report development projectsExperience in general software development methodologiesAbility to complete responsibilities effectively and efficiently with minimal directionAbility to seek out new challenges, feedback and growth opportunitiesPossess exceptional communication skills What'll Make You Special Bachelor's Degree in Computer Science or related fieldExperience in SQL Server development, Oracle development or similarExperience in SQL Server Reporting Services, Cognos, MicroStrategy or similarExperience in general software development methodologiesExperience leading small project teamsExperience mentoring others What You'll Get Excellent benefits package that includes a 401(k) match, medical/dental/vision insurance and much moreOpportunities to participate in professional and personal development programs, including personal empowerment coaching, leadership training and ongoing personal growth trainingOther incentives, contests and rewards, including trips, event tickets, cash prizes and more We're not your typical corporate workplace. At Amrock, we offer a unique, collaborative environment that inspires creativity and encourages teamwork. Our team members make positive client experiences a priority, so we make our team members' workplace experiences a priority. We take pride in making Amrock a diverse, inclusive place to work for those who share our passion for helping make the real estate process faster and easier for everyone."}