{"jobID": "2776079065", "jobLocation": "Chantilly_VA", "jobTitle": "SI Expert – Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.varentech.com", "Headquarters": "Columbia, MD", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": " SI Expert – Data ScientistSystem Integration TechnicianChantillyPosted 9 hours ago​  This is a position will support new transformational support in the areas of Strategic Workforce Planning, Learning, Leadership and Employee Development, Diversity and Inclusion, Performance Management and Workforce Analytics. Responsibilities include, but are not limited to the following: Provide workforce analytics support to the SponsorAnalyze workforce data to provide insights and identify trendsDevelop and refine workforce model(s) and accompanying data structures where needed to capture and report on the workforce composition in a consistent manner over time.Create data models to support informed executive-level decision making, scenario  planning, and workforce strategy development. Example areas of focus may include, but are not limited to: onboard personnel aligned with the new workforce construct, hiring/attrition projections and patterns, skills and learning assessments/needs, demand/capacity modeling, workforce engagement, and workforce alignment with mission priorities, digital technologies, and/or industry trends.Work collaboratively with individuals in other work units to develop integrated models  that integrate workforce data with other types of data to show linkages and patternsUse an array of data analytics techniques to analyze and present workforce dataRespond to workforce data inquiries with creative visual data presentationsIndependently conceive, prepare and communicate workforce analytics through complex graphics, computational models and tools, and written/oral assessments.Continually interface with executive level management requiring the planning, presentation and briefing of information. Job Features Mandatory Skills Extensive knowledge of workforce analytics Proven experience in conducting advanced modeling and data analysis, applying varied mathematical and data analytics techniques and developing-models in support of organizational strategy and management. Computer programming skills (languages, packages) as needed to support the management of data and application of tools/models. Demonstrated success in developing strategic goals and leading complex programs and well as meaningful change. Proven experience in designing, developing and delivering executive level communications on organization transformation and business process changes. Ability to prepare presentations and to present information to senior managers. Experience with project development lifecyc1e and systems operations. Proven experience leading and actively participating in project teams. Proven ability to interact with customers, senior leadership and program managers in a highly matrixed environment. Ability to translate complex findings into an easily understood narrative (i.e., tell a story with the data) in graphical, verbal, and written form. Demonstrated excellent communication and customer support skills. The candidate will be supporting a high profile program that will require coordination across the organization and with front office/executive level management. Demonstrated experience providing requirements gathering and analysis, configuration management, performance measurement and metrics. Demonstrates excellent writing skills and ability to craft clear concise request for funding and responses to tasking. Demonstrates excellent oral communication skills to brief management on resource issues. Proven ability to interact with customers, senior leadership and program managers in a highly matrixed environment. Active FSP clearance A Bachelor's degree (or equivalent experience (3 years for Bachelors) in Information Systems, or a scientific discipline. Minimum of 10 Years' relevant experience, 3 years in Intelligence Community Clearance Level TS/SCI w/ poly Required Education A Bachelor's degree (or equivalent experience (3 years for Bachelors) in Information Systems, or a scientific discipline. Req Number 201820071Please follow the link below to complete your online application: Online Application"}