{"jobID": "2835304272", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist, Assay Development", "companyRating": null, "companyInfo": {"Website": "www.wondfousa.com", "Headquarters": "Willowbrook, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Wondfo USA is currently seeking an R&D; Scientist to fill the position currently available in our expanding Research & Development branch. This individual must have extensive hands-on experience in molecular diagnostic product development in an industrial setting and will mentor junior associates from conceptual stage of assay development to supporting FDA/FDA clearance and successful product launch. Versatility and the ability to design and implement novel experiments, protocols, and technologies is required, in addition to mastery in data analysis. Strong written and verbal communication skills is a must, as this individual will also interact closely with cross-disciplinary teams, including other scientists, chemists, and engineers. Required ExperienceDemonstrated experience in assay design, execution, and data analysis (including various statistical analyses) of experiments to support the product developmentwith the ability to keep organized and comprehensive experimental lab notebooksExperience in conducting experiments with live pathogens, and with human clinical samples in a biosafety level I or II (BSL-I or BSL-II) laboratoryExpertise in nucleic acid extraction from difficult clinical sample matrices and nucleic acid based molecular biology technologies such as PCR, RT-PCR, qPCR chemistriesAbility to work collaboratively fostering professional, constructive relationships as part of a team while also working independently to produce data and meet set timelines and goalsMentoring Research Associates in daily experiments and troubleshooting issues that arise using scientific experience and knowledgeDemonstrated ability to communicate effectively both orally and in writing with colleagues throughout all levels of the organizationOther Requirements/Qualifications:S./Ph.D. in biology, molecular biology, biochemistry, or a related field with a minimum 3-5years (M.S.) or 1-3years (Ph.D.) product development experience in an industrial setting.Ability to work in a fast-paced and collaborative multidisciplinary setting, while contributing to a supportive and positive work environment.Ability to mentor junior research associates and team members and maintain a professional and constructive working relationship with colleagues.Bilingual in English and Mandarin is a plus. Wondfo strives to improve quality of life and human health by developing and improving upon point of care in vitro diagnostic tests. At Wondfo USA's new R&D; site, you will assist in designing and creating potentially life-saving devices for the healthcare market. As a crucial part of a dynamic team, you will be involved in developing research ideas, executing experiments, and strategizing, and developing these concepts into viable products.0 Job Posted by ApplicantPro"}