{"jobID": "2834826795", "jobLocation": "San_Antonio_TX", "jobTitle": "Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.ollusa.edu", "Headquarters": "San Antonio, TX", "Size": "501 to 1000 employees", "Founded": " 1957", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Senior Data Analyst Category: Staff Full Time Department: Institutional Research Locations: San Antonio, TX Posted: Jun 06, '18 Type: ExemptShareAbout Our Lady of the Lake University: On the foundation of faith, wisdom and trust in Providence, Our Lady of the Lake University (OLLU) prepares graduates to transform their communities, families and professions.  OLLU, founded in 1895 by the Congregation of Divine Providence, is a coeducational comprehensive institution with an enrollment of more than 3,100 students. With its main residential campus in San Antonio and non-traditional programs in San Antonio, Houston (The Woodlands), the Rio Grande Valley (La Feria), and online, OLLU has a presence in two of the largest cities in Texas, the border region, and literally around the world.  The University offers more than 30 undergraduate majors and minors, 14 master's programs and two doctoral programs through its College of Arts and Sciences, School of Business and Leadership, School of Professional Studies and the Worden School of Social Service. OLLU offers classes in daytime, evening, weekend and online formats.  Job Description:Job Summary: The Senior Data Analyst will be responsible for internal research projects and external surveys, including official university responses to IPEDS, U.S. News, Peterson's, College Board, and other agencies that collect university data for public relations, grants, and other purposes. The Senior Data Analyst will collaborate with the Director of Institutional Research and Analytics to conduct a wide variety of quantitative and qualitative analyses to guide institutional decision-making, inform and shape policy, and evaluate processes. The Senior Data Analyst will develop and maintain the IR electronic archive and will develop and maintain an IR data warehouse. Essential Functions: 1.Using a programming language (e.g. SAS, R, SQL) to do the following: Completion of state and federal reports, including IPEDS and Texas Higher Education Coordinating Board reports (20%)Preparing annual responses to the Common Data Set (5%)Responding to external surveys, including U.S. News, Peterson's, and College Board (10%)Developing and maintaining an SQL-based IR electronic archive/data warehouse (10%)Developing and maintaining Tableau dashboards (20%)Completing repeating and ad hoc requests for members of the university community and other stakeholders (20%)Providing course data files for faculty course evaluations (5%)Requesting data files from the National Student Clearinghouse (5%)Assisting with the continuous improvement of data quality and related audit processes for the university Colleague system through data quality audits (5%) 2.Maintaining excellent communication with management on all tasks and projects Additional Responsibilities:Performs all other duties as assigned. Requirements:Knowledge, Skills, and Abilities:Commitment to accuracy and an eye for detailMust be able to perform statistical modeling and manipulate databasesMust have the ability to set deadlines, prioritize responsibilities, and coordinate numerous projects simultaneouslyExcellent technical computer skills with proficiency in working with large datasets and spreadsheetsMust have a strong work ethic with the ability to work independently or as part of a teamMust have strong oral and written communication skills, as well as sound interpersonal skillsMust have the ability to work collaboratively and to share skills with team membersEducation and Experience:Have intermediate to advanced knowledge of programming (e.g., R, SAS, SQL database queries, SPSS syntax, STATA syntax)Have intermediate to advance knowledge of Tableau or B.I. Software.Have experience performing statistical analysesHave expertise with information technology, along with the ability to communicate about those subjects to those with less or no expertiseHave the ability to work effectively and collaboratively with people at all levels of the UniversityMaster's degree or higher in information management, information sciences, social sciences, or related field is strongly preferred Additional Information: Employment with Our Lady of the Lake University is contingent upon the applicant undergoing a background investigation.  OLLU seeks to attract, develop and retain the highest quality faculty, staff and administrators. The University is committed to diversity and strongly encourages applications from women and minorities. EOE  Our Lady of the Lake University uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, please visit www.dhs.gov/E-Verify.  Application Instructions: Please complete the On-Line Staff Application"}