{"jobID": "2694481418", "jobLocation": "Davis_CA", "jobTitle": "RESEARCH SCIENTIST - FORMULATIONS", "companyRating": "2.7", "companyInfo": {"Website": "www.marronebioinnovations.com", "Headquarters": "Davis, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public (MBII) ", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "\">We are looking for a full-time RESEARCH SCIENTIST to join our energetic team in our Davis laboratory. The individual will be part of a Formulation Development group that is highly focused on the rapid development of new agriculture products and supporting process development and scale up activities for commercialization. We look for highly energetic individuals who have deep technical knowledge in one of the biotech manufacturing process development areas: analytical development, formulation development, process development, and downstream processing. This position requires individual to be capable of working in cross-functional teams and/or other technology development teams to achieve departmental and corporate goalsRESPONSIBILITIES AND DUTIES:Design, prepare and develop microbial formulation processes at lab scale, pilot scale and participate in technology transfer for manufacturing.Lead and conduct stability studies and product testing procedures. Key evaluations include in house efficacy, microbial, physico-chemical testing (pH/conductivity, density, viscosity, dispersion, particle size, emulsion/suspension, etc.), compatibility testing (container, tank mix, etc.), as well as ASTM and CIPAC methods.Lead to investigate, develop, optimize, and implement new formulation or process technologies.Participate in technical transfer of formulation processes to contract and in house manufacturing facilities, as well as collaborators, including site visits.Support technical field development and sales team efforts by providing formulated samples and materials.Knowledge and experience in biologics formulation development is essential.The ideal candidate should also possess the ability to learn quickly, solve complex problems and have excellent data analysis/interpretation skill as well as excellent in verbal and written communication and presentation skills.The candidate has ability to successfully interface with multidisciplinary teams, engage and collaborate with external partners in process development and manufacturing.Interface with microbiology, bioassay, and chemistry groups by supplying test formulations, and aid in processing data.Present formulation updates to team members at regular project meetings.Prepare and maintain laboratory notebooks, technical reports, summaries, protocols, and methods for the development of company’s biopesticide products, according to Company’s policies. Adhere to the Company’s IP guidelines.Maintain a clean, organized, and safe working environment.Other duties as assigned.QUALIFICATIONSM.S degree in Chemistry, Chemical Engineering, Food Chemistry, Biotechnology or related field with up to 2-5 years of relevant industrial work experience or a PhD. degree with limited or no experience.R&D; work experience (up to 3 years) in formulation or processing of biological products desired.Knowledge of various formulation types typical in the agriculture industry.Knowledge of crop protection products and field application practices.Knowledge of experimental design and statistical methods.Energetic and self-motivated individual able to work in a fast-paced environment.Self-directed and creative, and must be able to work effectively in a flexible and multi-disciplinary team environment.Interpersonal skills required to communicate, advise, negotiate or influence others, as well as, build productive working relationships in various settings.Analytical skills required to interpret and summarize (scientific data) and information.Planning skills required to organize, prioritize, schedule and coordinate work activities for multiple projects.ESSENTIAL MENTAL AND PHYSICAL FUNCTIONS:Physical Requirements:ESSENTIAL MENTAL AND PHYSICAL ABILITIES:Mechanical aptitude with ability to lift 40 lbs.Be able to work on repetitive tasks in a multi-functional lab.Must be able to sit and/or stand for long periods of time (2-4 hours).Ability to sit at a desk for extended periods. Utilizing extensive use of computer, keyboard, mouse and monitor.Ability to drive a vehicle for extended period of times to different locations.Ability to lift at least 40 pounds.May also be required to work in a venue such as a hotel or other organization’s meeting room, conference, or convention space with the possible inclusion of weekends.Overnight travel to annual meetings/conferences (up to 7 consecutive days) required; overnight travel to other meetings (typically 1-5 consecutive days); inclusion of weekends may be involved.Mental Requirements:Ability to work with frequent interruptions and changes in workload priorities, ability to prioritize tasks, ability to maintain strict confidentiality.Travel:Ability to travel domestically under special circumstances, conference meetings or manufacturing site visit, by various modes of both private and commercial transportation.COMPENSATIONThe salary range is competitive. MBI offers a comprehensive benefits package including stock options, a 401(k) plan with employer match, and a health plan including medical and dental coverage, life insurance coverage, long term disability, and a flexible spending account for dependent care and/or medical expenses.The above is a list of essential duties and responsibilities for this position. This list is not all-inclusive. This job description may be modified as needed.MBI is an equal-opportunity employer. A pre-employment drug screen will be required."}