{"jobID": "2835582146", "jobLocation": "San_Antonio_TX", "jobTitle": "Senior Master Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.andeavor.com", "Headquarters": "San Antonio, TX", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (ANDV) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " ConocoPhillips, Valero Energy, Marathon Petroleum"}, "estimatedSalary": "79000", "jobDescription": "Requisition ID: 74305SR. Master Data Analyst POSITION SUMMARY: Performs data analysis and problem resolution on issues related to complex and/or highly specialized master data elements. Ensures master data is accurate and supports business requirements.Provides master data support for assigned projects requiring assistance with data elements. KEY RESPONSIBILITIES: Analyzes business requirements, translates to technical needs, and determines the appropriate master data needed to facilitate transactions. Creates and maintains master data elements in SAP and other applicable software systems. Researches and troubleshoots data across multiple sources using knowledge of data flow and their impact on business processes. Develops processes and procedures related to master data and acts as a resource to transfer appropriate knowledge to team members and internal customers. Identifies efficiencies and recommends ways to improve and automate processes and procedures. Provides leadership and subject matter expertise regarding functionality of master data for assigned projects and/or processes. Generates complex ad hoc reports using Microsoft Excel, Access, Business Intelligence (BI) and/or SAP. Serves as a liaison between Information Technology and business requestor to develop new master data elements. Acts as a resource for less experienced Analysts and my review the work of others.EDUCATION AND EXPERIENCE: Bachelor’s degree in Accounting, Business or related field is required. Minimum 4 years of related experience required. Experience with complex databases and database queries.SKILLS: Thorough technical knowledge of SAP In-depth understanding of various business functions Advanced Microsoft Excel skills Strong oral and written communication skills Project management skills Strong problem-solving skills with the ability to recommend effective solutions Ability to lead projects and cross-functional discussions Andeavor, formerly Tesoro, is a premier refining, marketing and logistics company in the western United States. Our Company operates 10 refineries with a combined capacity of approximately 1.2 million barrels per day, an extensive logistics network, and a retail-marketing system that includes approximately 3,000 retail stations marketed under multiple well-known fuel brands. We employ more than 13,000 talented people.  Our strength lies in our investment in employees and in their future. We measure success not only by the products we bring to our customers, or the financial results we deliver to our shareholders, but also by remaining true to our core values of safety and environmental stewardship, respect and integrity.  Discover your strengths and invest in your future by applying today.  Employees must be able to perform the essential functions of the job with or without reasonable accommodation.  Equal Opportunity Employer: Vet / Disability  Posting Notes: || San Antonio || Texas || United States (US) || None || |Accounting & Finance || 78259 ||"}