{"jobID": "2837707594", "jobLocation": "Rahway_NJ", "jobTitle": "Senior Scientist, Statistical Programming", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Responsibilities:  This position provides high quality statistical programming analysis and reporting deliverables for global stakeholders in Early Development Statistics. The senior statistical programmer will gather and interpret user requirements for analysis and programming requests in close collaboration with statistical and clinical colleagues, retrieve the required data, and then transform the data into analysis datasets for further statistical analysis and reporting needs. The senior programmer will partner with statisticians to solve problems; reduce the amount of programming task being completed by statisticians to facilitate an increase in efficiency and compliance for statistical analyses. The senior programmer will also write programs to analyze data with statistical methods which are not currently available through commercial software packages.  Primary Activities:  Pre - process, filter, and manipulate complex data for the analyses of molecular biomarker data, imaging data, and external data other than traditional laboratory data  Provide technical consultation and analytical support to early development statisticians for exploratory and unplanned statistical analyses  Prepare compliant programming code for regulatory submissions including analysis datasets, tables, listings, figures and associated documentation  Support the development of programming standards to enable efficient and high quality production of programming deliverables  Create specifications for ADaM (analysis) datasets  Review study deliverables to ensure that they are in compliant with company standards and SOPs  Create electronic submission ready deliverables  Qualifications  Education Minimum Requirement:  B.A. / B.S. in Computer Science, Statistics, Applied Mathematics, Life Sciences, Engineering or related field plus 5 - 9 years SAS / R programming experience in a clinical trial environment  M.S. in Computer Science, Statistics, Applied Mathematics, Life Sciences, Engineering or related field plus 3 - 7 years SAS / R programming experience in a clinical trial environment  Required Experience and Skills:  Excellent interpersonal skills and ability to negotiate and collaborate effectively  Excellent written, oral, and presentation skills  Effective knowledge and experience in developing analysis and reporting deliverables for research and development projects (data, analyses, tables, graphics, listings)  A project leader; completes tasks independently at a project level; ability to collaborate with key stakeholders  Significant expertise in SAS and clinical trial programming including data steps, procedures, SAS / MACRO, SAS / GRAPH  Designs and develops complex programming algorithms  Experience in CDISC SDTM and ADaM standards  Ability to comprehend analysis plans which may describe methodology to be programmed; understanding of statistical terminology and concepts; Implements statistical methods not currently available through commercial software packages.  Thrives in an exploratory environment, handling non - standard data in a variety of formats with minimal requirements; knowledge of pharmaceutical development processes  Demonstrated ability to work in an exploratory environment, handling non-standard data in a variety of formats with minimal requirements; knowledge of pharmaceutical development processes  Efficiently manipulates very large databases including complex data preprocessing, filtering, and manipulation  Preferred Experience and Skills:  Familiarity with clinical pharmacology concepts  Oncology programming experience  Good working knowledge of reporting processes (SOPs) and software development life - cycle (SDLC)  Utilizes and contributes to the development of standard departmental SAS macros  Ability and interest to work across cultures and geographies  Ability to complete statistical programming deliverables through the use of global outsource partner programming staff  Active in professional societies"}