{"jobID": "2628257148", "jobLocation": "San_Jose_CA", "jobTitle": "Research Scientist/Engineer - Localization and Mapping", "companyRating": "4.3", "companyInfo": {"Website": "www.baidu.com", "Headquarters": "Beijing, China", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (BIDU) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": " Baidu IDG, located in Silicon Valley CA, is looking for world-class engineers or researchers to join its mapping and localization team a.k.a Autonomous Driving Business Unit. The IDG mapping and localization team is aiming to develop advanced autonomous driving technologies which will let us transform mobility and improve the lives of billions of people. As a Research Scientist/Engineer at Baidu IDG, you will be uniquely positioned to design and build many technologies to make autonomous driving a reality. Heres what you will do:Work on a diverse set of data including GPS/IMU, LiDAR, and high-resolution imagery to create high-precision maps or develop novel algorithms for accurate vehicle localization.Track and apply the latest algorithm improvements from industry and the research community.Work with a world-class, talented group of software engineers and scientists to design and implement cutting edge autonomous driving technologies.Design, develop, test, deploy, maintain, and improve critical software.Manage individual project priorities, deadlines, and deliverables.You will receive guidance from a team of world-renowned leaders in software engineering, robotics, and AI. Heres what wed like to see in you:M.S. with at least 3 years of prior experience or Ph.D. in Computer Science, Electrical Engineering, or similar technical field.Strong in coding - ability to write high quality code in C/C++. Python programming is a plus.Experience in one of the following areas is required: robotics, computer vision, or machine learning.Expertise in structure from motion, multi-view geometry, 3D reconstruction, large-scale optimization, object detection/recognition is desired.Proven system integration and software architecture skills.Publication record in top venues (ICRA/RSS/ICCV/CVPR, etc) is a strong plus. Experience in autonomous driving is a strong plus.Culture fit:Mission alignment: If you want to be part of Baidu IDG to accomplish this great mission, we will provide you with the best possible platform to do that.Self­-directed: We work best with people that are driven, motivated, and aspire to greatness. Are you the sort of person that, if you had time on your hands, will independently find interesting and useful things to do?Hungry to learn: We are eager to see you learn new skills and grow. But learning is hard work and this is something we hope you want to do.Team orientation: We work in small, fast­-moving teams. We don't believe in lone wolves. We watch out for each other and go after big goals together as a team."}