{"jobID": "2831192318", "jobLocation": "San_Jose_CA", "jobTitle": "Neural Processor Research Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.samsung.com/global/business/semiconductor", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": "JOB TITLE: Neural Processor Research Scientist OVERVIEW: Samsung Semiconductor Inc. is looking for a Software Engineer/Research Scientist in our Advanced Systems Lab (ASL).  ASL is a small research group focused on development of hardware and software IP for acceleration of a variety of neural network applications including speech and vision-related applications like ADAS. The IP developed by the group goes into various Samsung products including mobile handsets and tablets, as well as some new product categories. In addition to development of cost and power-optimized IP, the group develops neural networks for different near and longer term Samsung products and researches novel implementations and varieties of neural networks, as well as future applications of potential interest for next generation Samsung products. JOB RESPONSIBILITIES:To develop tools to optimize networks and implement optimal mapping of various neural networks to hardware,Help identify and prototype useful hardware architect features and optimizationsREQUIRED SKILLS:Masters, PhD, or equivalent experienceStrong C++ and Python coding skills,Experience with using and modifying Caffe code and/or other neural network development frameworks,Familiarity with neural networks and machine learning concepts, processor architectures, hardware architecture conceptsDesirable knowledge of signal processing, linear algebra, Halide, OpenVX, GPU OpenCL/Cuda programming, image processing, and compression techniques Samsung Semiconductor Inc (SSI), an equal opportunity employer, is a world leader in Memory, System LSI, and LCD technologies. Headquartered in San Jose, California, SSI is a wholly-owned U.S. subsidiary of Samsung Electronics Co., Ltd.- the second largest semiconductor manufacturer in the world and the industry's volume and technology leader in DRAM, NAND Flash, SSDs, mobile DRAM and graphics memory. It is one of the largest providers of system logic, imaging and LED lighting solutions, as well as providing advanced process design and manufacturing for fabless companies. Samsung Semiconductor, Inc. also has a research and innovation center with numerous labs providing product design and research in: logic, memory, image sensors, displays and mobile technologies. In addition, the company supports Samsung Display Company, the largest producer of LCD and OLED displays. ****************************************************************************************************************A day in the life Samsung Video: http://bit.ly/1saHOGu  Click here to visit our Samsung Semiconductor Career Page "}