{"jobID": "2794756576", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Director-Healthcare", "companyRating": "4.2", "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": "134000", "jobDescription": " Project Director-Healthcare Location  CA-San Francisco Department  190-No CA Construction (Core & Shell) Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance.What You’ll Do: People don’t want bureaucratic processes slowing or preventing them from building innovative structures. At Webcor, we get things done and make projects happen.  As a Project Director, you have overall supervision of projects and will lead teams of construction professionals, from pre-construction and project close out. You will: Serve as primary Owner/Contractor interface.Monitor processes, progress and results of financial goals, schedule, quality, safety, team effectiveness, employee development and client satisfaction.Formulate strategies to enhance project delivery. Effectively leads in problem prevention strategies to limit reactionary practices.Provide team leadership and mentoringFocus on continuous improvement and innovation in all you doWhat You Need to Succeed:A Bachelor’s degree (preferably in Construction Management, Civil or Mechanical Engineering, or Architecture) or equivalent experience.Minimum ten years managing construction projects, to include five years as a Sr. Project Manager or Senior Superintendent.Experience in Healthcare, Labs highly preferred.LEED AP is preferred but not requiredStrong leadership and mentoring abilitiesExcellent communication skills, both oral and written Webcor is AN EQUAL OPPORTUNITY EMPLOYER."}