{"jobID": "2746928699", "jobLocation": "Chicago_IL", "jobTitle": "Experienced Quantitative Researcher - High Frequency Equities Group", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is a technologically sophisticated hedgefund and specialises in predicting various equity and financial markets with uncanny accuracy. The firm employs research scientists with backgrounds in advanced artificial intelligence, machine learning and probability to mine vast quantities of data (structured/unstructured). The neural network and probabilistic strategies are trained and tested to identify short term signals based on a range of factors defined by the portfolio engineers and research scientists. The portfolio optimization system assigns weights to each signal based on the latest breakthroughs in portfolio theory and the smart execution system slices and dices orders and reduces the market impact, implementation short fall and execution trading costs. The entire process from end to end is computerised. The entire system from end to end is coded in C++ with latency critical components embedded into hardware. Responsibilities:As a researcher within the systematic equities department, your task will involve designing trading strategies and teaching the system to autonomously design trading strategies.This includes designing and backtesting strategies leveraging machine learning and probabilistic techniques.The ideal researcher will have the following experience and background:PhD in Computer Science, Applied MathematicsPrior experience working for a hedgefund or financial trading companyPrior experience in strategy research for financial futuresAn interest researching daily signals as the firm does not hold risk overnight. The majority of signals will concentrate on the tick-by tick section of the market.A strong background in at least 3 of the following: Statistical Machine Learning, Convolutional Neural Networks, Linear Estimators, Natural Language Processing, Random ForestA strong background in advanced probability theory including betting strategies, Kelly criterion, least-Squares Estimation And Related Techniques, Linear Methods, Statistical Inference, Co-integration,Markov Decision Processes, Kalman filter, Classification and Regression Trees, High-Dimensional Model-Based Clustering, Learning algorithms and hyperparameter tuning, Maximum-Likelihood Estimation, Multivariate Adaptive Regression Splines, Prediction-error metrics and model selection, Reinforcement Learning, Markovitz portfolio optimization.A research oriented disposition with a passion for learningAn interest in collaboration within the teamTrustworthy, reliable and confidentialStrong programming skills in a mathematical language with a good understanding of the machine learning libraries available. If you would like to be considered for the position of Quantitative Researcher, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team"}