{"jobID": "2826572311", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist - Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.ey.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deloitte, KPMG, PwC"}, "estimatedSalary": "147000", "jobDescription": " Analytics is revolutionizing many areas of business and the management of people is no exception. EY’s People Advisory Services (PAS) Analytics leverages the most advanced modeling tools to help our clients identify the drivers of key workforce processes. Specific examples of work include: predicting which potential employees are most likely to succeed, identifying the most effective interventions to retain high performers, ensuring pay equity for all demographics, and developing custom analytic solutions for unique client challenges.  Your key responsibilities  You will have the opportunity to apply and develop your most advanced skills every day and play an important role in helping us to develop new services and reinvent existing services with embedded analytics. You will also have the opportunity to influence business strategy and interact with senior executives, both internally and externally.  Skills and attributes for success  Ability to develop new analytic tools to transform workforce management practices and sharpen existing consulting tools with advanced analytic techniques  Have a passion for data analysis and a willingness to learn and share knowledge  Ensure our analytic work is rigorous, accurate, and serves our clients well  Work independently, show a willingness to take the initiative, and be comfortable sharing your knowledge with the team  Have an entrepreneurial spirit, a strong work ethic, and a passion for data.  To qualify for the role you must have  A Master’s degree in analytics, economics, statistics, operations research, computer science, or related field and around six to ten years of experience.  Strong quantitative and qualitative skills and analytical expertise  Ability to work in a fast-paced, dynamic environment  A passion for communicating analytical insights graphically  The ability to quickly learn new technical tools, and share your knowledge  Proficiency with at least one of the following: R, Stata, Python, Tableau, SQL/SSIS  Experience with the following is a plus Analysis of unstructured text data, Social network analysis, GIS analysis"}