{"jobID": "2807499533", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Analytics, Strategy and Innovation", "companyRating": "3.9", "companyInfo": {"Website": "www.hyatt.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1957", "Type": " Company - Public (H) ", "Industry": " Travel & Tourism", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Marriott International, Hilton, Starwood Hotels & Resorts"}, "estimatedSalary": "58000", "jobDescription": "*Description:** The Data Analyst will join a team that is on an upward trajectory to enhance Hyatt's competitive advantage through analytics. This position will contribute to our strategic vision of developing advanced analytics capabilities in support of developing and executing business strategy.  He/She will be a data ?polyglot?, will fit into multiple roles and teams to help customers make data driven decisions. He/She will develop skills to take any data and organize it for building a model or also create descriptive/exploratory models.  A candidate capable of driving projects to their successful outcomes with effective communication and interpersonal skills will do well.  This position reports to the Manager, Analytics  Collaborate with Project Managers and business stakeholders to execute Analytics projects. This includes outlining specific deliverables, provide input to project plans and milestones.  ? Analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses  Perform machine learning, natural language, and statistical analysis methods, such as classification, collaborative filtering, association rules, sentiment analysis, topic modeling, time-series analysis, regression, statistical inference, and validation methods  ? Leverage data management processes and available infrastructure / Relation data soruces/API tools to develop POC capabilities/solutions  ? Work alongside ETL engineers to establish an analytics platform to be used across the business  ? Use good Data Engineering process ? Preperation, Exploration, Blending, Validation and Quality Control  ? Demonstrate a commitment to Hyatt core values  ? The position responsibilities outlined above are in no way to be construed as all encompassing. Other duities, responsibilities, and qualifications may be required and/or assigned as necessary *Qualifications:** At least 3 years of professional experience as a Data Analyst  ? Experience with Data Manipulation/wrangling techniques?Preparation, Exploration and Blending.  ? Experience in supporting analytics projects in the following areas-- Consumer Insights, Brand Management, Customer Segmentation, Campaign Development, Web Analytics and Media/Message Mix Modeling  ? Knowledge in a professional or academic setting on a range of analytical techniques (e.g. Supervised and Un-supervised machine learning techniques, graph data based analytics, statistical analysis, time series, geospatial, nlp, sentiment analysis, pattern detection to name a few)  ? Good understanding of data manipulation/wrangling techniques  ? Experience with command-line scripting, data structures and algorithms and ability to work in a Linux/Windows environment, processing large amounts of data in an on-premise and/or cloud environment  ? Strong work ethic and personal integrity; self-directed and self-motivated with a highly developed curiosity and willingness to learn.  ? Excellent verbal and written communication skills as well as interpersonal and influencing skills; ability to define and capture business needs along with articulating strategic implications of analytic results with clarity and persuasiveness in an audience appropriate manner.  ? Masters in a quantitative field: computer science, econometrics, mathematics, statistics, analytics, or other related field  ? One or more years programming in SQL, R and/or Python.  ? Experience with R and/or Python is strongly desired  ? Experience with Spark is desired  ? Experience with Alteryx is preferred  ? Experience with Tableau or other data visualization tools is desired  ? Expert in Microsoft Office suite, especially Word, Excel and Powerpoint  ? Familiarity with data warehousing concept  ? Expert in Microsoft Office suite, especially Word, Excel and Powerpoint  ? Familiarity with IBM DB2 and SQL Server (SSRS, SSIS, SSAS) databases.  ? Familiarity with IBM SPSS and SAS tools for data exploration and mining is a plus *Primary Location:** US-IL-Chicago*Organization:** Hyatt Corporate Office*Pay Basis:** Yearly*Job Level:** Full-time*Job:** Technology*Req ID:** CHI008998"}