{"jobID": "2778418246", "jobLocation": "San_Jose_CA", "jobTitle": "Sr Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.signifyd.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " About You  You are passionate about Signifyd’s mission to fight make commerce safer for online retailers and have a background in a quantitative or technical field. You are driven and very proactive, always thinking for ways to improve and grow the business. You thrive in a high-paced environment. You love working on puzzles, investigating suspicious behavior, and digging through large data, all while using your keen eyes for details to connect the dots.  You enjoy interacting with people, listening to their needs and influencing them. If this is you, then Signifyd is the place for you.  About Us  At Signifyd, we’re very good at proving that people are who they say they are. We build software systems that catch bad guys. Using all available payment, user, and machine data, we separate legitimate credit card transactions from fraudulent ones in under 400ms. That means building large-scale systems which reduce the complexity of human purchasing behaviors into simple and quick decisions.  You’ll join a new team and work cross-functionally with several organizations at Signifyd (including Data Science, Modeling, Engineering, Customer Success and Sales), with the primary objective of enabling leadership to make effective, analytically driven, and strategic operating decisions. This is a high-impact role that offers tremendous opportunities for growth, learning and leadership.  Job Description: Use data to inform, influence and support business strategy and product short and long-term roadmapsDevelop in-depth analyses and build automated and scalable reporting tools (dashboards, reporting packs, etc.) to regularly assess the performance of the business, tell the story behind the numbers, and provide actionable insights to leadershipLead ad hoc “consulting-style” projects to improve metrics, data quality, and reporting processes that will support Risk initiatives. This often involves starting with a fairly open-ended problem, identifying trends and issues, synthesizing and reporting the results, proposing and developing a solution, and driving implementation.Collaborate with other teams as well as end users/customers, to define business vision, goals and strategies & execution plansApply data driven analysis evaluations and processes to help manage and minimize lossesReview high-volume data to identify issues with data quality and strengthen model performanceBe a subject matter expert/a go-to person for knowledge-based data and measures essential to hitting to our company KPIs Desired Skills & Experience Excellent SQL skills (5+ years experience), with strong experience in building complex, custom SQL queries, using large data setsFluency with data analysis and visualization tools (Tableau is extra credit)(highly desired) Familiarity with scriptingOutstanding written and presentation skills. Experience presenting technical content to audiencesDemonstrated problem solving experience, providing data-driven business insights and recommendationsWillingness to adapt to a constantly changing, customer-driven work environmentAbility to work on routine tasks both independently and with the teamBackground on payments, fraud space, data science is a big plus"}