{"jobID": "2829692057", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Manager, Clinical Market Development", "companyRating": "4.1", "companyInfo": {"Website": "www.helix.com", "Headquarters": "San Carlos, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "182000", "jobDescription": " We believe that everyone benefits from their biological information. It is our mission to empower every person to improve their life through DNA. With our high-quality, trusted partners and state-of-the-art lab, we have created the first platform of personalized products and services powered by genetics. From inherited cancer screening to custom fitness and nutrition plans, the world of DNA learning is becoming more accessible and more valuable than ever.  So far we have raised over $300 million from investors like Illumina (the worlds leader in genetic sequencing equipment), Warburg Pincus, Sutter Hill Ventures, Kleiner Perkins Caufield & Byers and Draper Fisher Jurvetson Growth. Our app store and marketplace include partners such as National Geographic, Admera Health, Vinome and many others, with whom we have partnered to develop applications which interpret your genome.  Our big vision comes with big responsibility. Thats why were building a team of experts in the field of genetics, engineering, design, business development, and beyond to help bring actionable insights to our customers. Were looking for the best and brightest minds who are passionate about our mission and are excited to work with a truly diverse team.  As a member of the Clinical Affairs team, you will focus on expanding the development of clinical partnership opportunities. This is a predominately externally-facing role with the expectation to identify new business opportunities, work with clinical partners to ensure the development of high quality, responsible products, and create education and awareness opportunities to bridge the gap between consumers and healthcare professionals. The position is highly cross-functional, working closely with the business development and partnerships teams plus additional collaboration with the marketing, policy, and product teams. As Senior Manager, Clinical Market Development, you will:Help drive Helixs mission to empower every person to improve their lives through DNA, with a focus on sequencing millions of healthy people for preventative health and screening.Work closely with Business Development to identify and win partners in several categories, including: (1) partners building health apps; (2) partners looking to sequence millions of people in their communities; and (3) partners providing pre- and post-testing clinical support services. You will provide clinical support to nurture, develop, and launch those initiatives.Work with the Partnerships team and Helixs clinical partners to successfully and efficiently launch their products (typically with clinically relevant insights). You will help build a scalable, replicable model for launching health products on the Helix Marketplace.Drive leadership in setting standards and best practices for digital execution of clinically relevant products, including return of results, genetic counseling integration, and ongoing engagement.Identify, create, and participate in strategic education collaborations.Build bridges to the medical community, including: (1) relationship development; (2) opportunities to partner on provider education initiatives; and (3) identification of tools and resources to help people use the clinically relevant results they receive through Helix partners into their healthcare.Contribute to developing requirements and policies for Partner Research infrastructure (clinical, psychosocial, novel discovery).Required background:Extensive experience counseling or otherwise clinically consulting individuals regarding genetic risk, contribution to disease, or other clinical impacts of genomic informationCurrent knowledge of the benefits, risks, and limitations of genetic insightsDeep understanding of the psychosocial impact of genetic/genomic informationKnowledge of the challenges in implementing genomic insights in broader, healthy populationsExperience working with genetics and non-genetics medical professionals, health systems, laboratories, and researchersDeep knowledge of the scientific and clinical literatureAble to travel domestically on average once a monthExpertise across a broad spectrum of disease categories is a bonusThe ideal candidate will have:5-10 years clinical genetics experience3+ years industry experienceExcellent presentation skillsNatural educator - internal and externalSelf-motivated, team playerPassionate about innovative methods to communicate genomic information to consumersPassionate about expanding access to genomicsWhat Helix has to offer you Aside from working alongside brilliant, dedicated, passionate, down-to-earth, curious, warm, and thoughtful people, we also provide great benefits: Competitive compensation, including meaningful equityHealth insurance, including medical, dental, and vision12 weeks of Maternity or Paternity leave4 weeks of paid Pregnancy Disability401(k) with employer matchingOn-premise nursing roomCorporate fitness rateCommuter benefitsCatered mealsFlexible PTO Helix is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws."}