{"jobID": "2826787762", "jobLocation": "Bethesda_MD", "jobTitle": "Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.afponline.org", "Headquarters": "Bethesda, MD", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "Who we are: Awarded with the Society for Human Resource Management’s (SHRM) When Work Works award, AFP offers a flexible and business casual work environment with competitive base salary and generous incentive compensation plan. Plus, our substantial benefit package includes vacation, sick, personal, holiday and volunteer leave, medical, dental and vision health insurance, 401K plan with employer match and flexible work schedules.  AFP core values are focused on fostering successful, growth-oriented people. That’s why we value critical thinking and deliberative discussion conducted in a respectful manner and cross-functional collaboration to achieve AFP goals. With over 70% of our employees promoted to their current position, there is ample opportunity for upward mobility within the organization. Data ScientistA Typical Week May Look Like This…Work with Strategy and Marketing teams on marketing campaigns to set strategic hypothesis, analyze customer responses, identify and incorporate best practices to optimize direct marketing efforts, and produce analytical reports in a variety of formats.Manage AFP’s business intelligence data lake and Tableau server, and incorporate additional data feeds into the data lake.Perform data mining using SQL and Python from AFP databases, such as netFORUM, data warehouse/data lake, and Salesforce database.Conduct AFP predictive modeling using R, and communicate predictive modeling results in a clear and concise format to senior staff.Work with the Strategy and Analytics team to ensure on-going maintenance and development of the AFP Google Analytics account, and produces Google Analytics cross-device reports and dashboards.Consult the Director of Technology on key technology projects.Is This You?You have strong analytical skills, and are able to assist with strategic hypothesis to optimize direct marketing campaigns.You are confident using SQL, Python, and other databases to extract data and create clear visualizations with Tableau.You have served as a project manager in the past, and have the organization and leadership skills necessary to keep a project running on time, and in budget.You have a talent for translating tech-speak to your non-IT colleagues, so everyone is on the same page.You thrive on collaboration and building strong relationships with team members and clients.You provide creative ideas and look for new and better ways to enhance the organization.You are a proven problem solver and analytical thinker with the ability to approach problems logically and systematically.This is Us!We are a collaborative team of individuals who are hardworking and entrepreneurial.We take ownership in how our specific role drives the organization.We are intellectually curious and have a strong ability to adapt to change seamlessly.We work autonomously and in cross functional teams and are dedicated to demonstrating extraordinary results at a fast pace.Other Requirements:Bachelor's Degree preferred.4-7 years' experience in data analysis.Knowledge of SQL and its supporting packages (SSRS, etc.)Proficiency in developing Tableau dashboards.Knowledge of Microsoft Office Suite.AFP offers:A collegial, casual work environment.Competitive base salary.Great career growth.Superb benefits plan, including a generous vacation/sick/holiday leave policy, medical, dental and vision health insurance, 401K plan with employer match and flexible schedules.\"When Work Works\" award by the Society for Human Resource Management for our flexible workplace.We look for candidates who embody our AFP Core Values:We take ownership for the success of AFP and provide value to members.We expect results based on measurable and clearly stated goals that support AFP’s mission.We value critical thinking and deliberative discussion conducted in a respectful manner.We work together across functions to achieve AFP goals and objectives.We take personal responsibility for their own growth and behavior to further the goals and success of AFP.We provide coaching and regular, fair, and honest feedback to foster successful, growth-oriented people."}