{"jobID": "2827947489", "jobLocation": "Sugar_Land_TX", "jobTitle": "Senior Water Clarification Scientist (Chemicals) Houston", "companyRating": null, "companyInfo": {"Website": "www.bakerhughes.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (BHI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: Baker Hughes, a GE company (NYSE:BHGE) is the world's first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain.  BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company leverages minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own.  With operations in over 120 countries, the company's global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.  Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com. Role Summary: Baker Hughes is seeking a Senior Scientist / Engineer to work in the Operations Technical Support group. The candidate will need to be comfortable working around production chemicals and routine lab equipment. Additionally, the candidate needs to be able to handle multiple tasks/projects, and work well with other team members. The pace and volume of the work can be quite high at times, and the position demands the candidate to be able to adapt to changing project requirements and deadlines. A majority of the time in the position will be working directly in the field with customers and operations personnel. Essential Responsibilities:May participate in customer interface as a team leaderProvide technical product support and service including product selection and developmentAnalyze data and communicate results through presentation and documentation to various groupsTravel to field to implement recommendations made as a result of testingHelp develop and test new products with senior scientists.Handle special projects as assignedQualifications/Requirements:Minimum BS degree in a Scientific Discipline or Chemical Engineering with 6 or Master's Degree and 4-6yrs experience. Ph.D and 2-4 yrs experience more year experience in the oilfield industryExperience with Production ChemicalsTeam playerMotivated, self-starterAbility to multi-task to work on multiple projectsWork independently at times, as well as be a function part of a team to complete large projects.Ability to travel up to 80% globallyDesired Characteristics:Preferable to have prior work experience with multiple production chemicals or with water clarifiers in other fieldsPrefer 10 years' experience in water clarificationLocations: Sugarland, Texas  Baker Hughes, a GE company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Learn more"}