{"jobID": "2685227259", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist II", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": "Description:Leidos's Military & Veterans Health Solutions Group has a contingent opening for a Research Scientist II to support the Naval Medical Research Unit in San Antonio, TX. This position is contingent upon contract award. Develops, leads, and conducts protocol-driven scientific research addressing various aspects of military medicine, including, but not limited to: hemorrhage and resuscitation, immunomodulation, biomedical systems, bioassay development craniofacial, infectious diseases and directed energy bioeffects.Provides support in writing protocol-driven research proposals, animal use protocols, human use protocols, technical reports, final reports, and peer-reviewed manuscripts.Evaluates data sets (provided by the government and collected by the contractor).Develops presentation materials, research Standard Operating Procedures, and present findings at technical and professional meetings.Prepares experimental subjects, set up experimental equipment, and aid in training and development of experimental subjects for experimental procedures in accordance with approved animal or human use protocols.Provides support in development of establishment of in vivo and in vitro model systems, data acquisition, and data analysis.Oversees personnel associated with the projects and manage data. Perform surgical procedures on animal models for both survival and non-survival.Qualifications:Education requirements are a PhD in related filed plus two years Post-Doctoral. US Citizenship required. Must be able to obtain and maintain a government security clearance  NHWLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}