{"jobID": "2790663327", "jobLocation": "Washington_DC", "jobTitle": "Senior Certified Oncology Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.medstarhealth.org", "Headquarters": "Columbia, MD", "Size": "10000+ employees", "Founded": " 1985", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "General Summary of Position: Reporting in a matrix environment to the Executive Director Cancer Institute and Operations Director, the Lead Billing Services Coordinator is the highest level staff position in the series responsible for leading various aspects of the professional and facility revenue cycle of multiple departments in the Cancer Institute, to include providing direction to staff regarding coding and documentation, ad hoc chart audits, working through billing edits and denial processes, and generating regular reporting on denial trends across departments. Ensures that updated Managed Care information is disseminated to all departments. Works with the billing team to respond to billing inquiries from PUBS, Hospital Finance and Patient Financial Services.Education: Associate’s degree required but can be substituted with 8 or more years of medical billing experience working in a hospital and/or physician office and/or other relevant revenue cycle experience. Bachelor’s degree is preferred.Experience: Approximately 6 or more years of medical billing experience working in a hospital or physician office and/or other relevant revenue cycle experience. Knowledge of spreadsheet and/or database programs such as Microsoft Excel. Knowledge of ICD-10, CPT and HCPCS coding. Knowledge of registrations, charge posting, billing, claims and statements.Certification/Registration/Licensure: Certified Professional Coder (CPC) Certification required.About MedStar Health MedStar Health is dedicated to providing the highest quality care for people in Maryland and the Washington, D.C., region, while advancing the practice of medicine through education, innovation and research. Our 30,000 associates and 5,400 affiliated physicians work in a variety of settings across our health system, including 10 hospitals and more than 300 community-based locations, the largest visiting nurse association in the region, and highly respected institutes dedicated to research and innovation. As the medical education and clinical partner of Georgetown University for more than 20 years, MedStar is dedicated not only to teaching the next generation of doctors, but also to the continuing education and professional development of our whole team. MedStar Health offers diverse opportunities for career advancement and personal fulfillment."}