{"jobID": "2791836818", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.lookout.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FireEye, Palo Alto Networks, Symantec"}, "estimatedSalary": "157000", "jobDescription": " Lookout is a cybersecurity company that makes it possible for individuals and enterprises to be both mobile and secure. With 100 million mobile sensors fueling a dataset of virtually all the mobile code in the world, the Lookout Security Cloud can identify connections that would otherwise go unseen -- predicting and stopping mobile attacks before they do harm. The worlds leading mobile network operators, including AT&T;, Deutsche Telekom, EE, KDDI, Orange, Sprint, T-Mobile and Telstra, have selected Lookout as its preferred mobile security solution. Lookout is also partnered with such enterprise leaders as AirWatch, Ingram Micro and MobileIron. Headquartered in San Francisco, Lookout has offices in Amsterdam, Boston, London, Sydney, Tokyo, Toronto and Washington, D.C. To learn more, visit www.lookout.com  Our Data Engineering team is transforming how we build products using Lookouts unique data sets about mobile devices, applications and threats. As we continue to grow and scale, we need rock solid engineers who love the challenge of designing and building high performance, scalable data solutions that help Lookout protect millions of mobile users. Youll design, develop, and test robust, scalable data platform components. Youll work with a variety of teams and individuals, including Product Engineers to understand their data pipeline needs and come up with innovative solutions. By collaborating with our talented team of Engineers, Product Managers and Designers, youll be a driving force in defining new data products and features. We are looking for someone with a strong software engineering, distributed data systems and ETL background. Responsibilities:Design and development of the next generation of our data platform including data streaming, batch and replay capabilitiesWorking with Engineering, Data Science, Business Intelligence and Product Management teams to build and manage a wide variety of data setsIdentify gaps and build tools to increase the speed of analysisDesign, build and launch new data models and business critical ETL pipelinesFully participate in the ownership of your services and components, including on-call dutiesRequirements:BS/MS in Computer Science or related field/degree, and/or equivalent work experience8+ years overall software development experience with at least 3+ years of experience with data engineeringExperience with Spark (Batch and/or Streaming), Hive and HadoopExperience with Kinesis, Kafka or equivalent messaging systems at scaleExperience with streaming data pipelines using Spark streamingProficient in designing efficient and robust ETL workflowsExperience in optimizing Spark/Hive ETLsHands on experience with AWS and/or cloud-based computing such as EC2, EMR, Kinesis and RedshiftExcellent communication and collaboration skillsProficient in Scala and PythonBonus Points:You have built a data pipeline and the infrastructure required to deploy machine learning algorithms and real-time analytics in low latency environmentsUnderstanding of CI/CD automation and willingness to learn new CD platform."}