{"jobID": "2610710918", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Solution Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.saucelabs.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "185000", "jobDescription": " The Sr. Solution Engineer is the technical representative to our customers, and is an expert in evangelizing, positioning, and selling the technical, architectural, and business value of the Sauce Labs testing cloud. They will work closely with Sr. Account Executives to co-own the sales and technical consultative strategy to become the trusted advisors for our customers and win their business.  The Sr. Solution Engineer will meet with our most strategic clients, virtually and in-person, interpreting their needs, developing, prototyping and delivering solutions to provide the best possible Sauce experience for the customer. The candidate is a seasoned professional with exceptional communication skills and a high level of technical expertise, adept at speaking with C-level executives and technical business owners while also conversant with the technology to connect with and guide individual contributor level influencers. Job Duties and Responsibilities:Work closely with the sales team to develop a strategy to win net new customers and drive expansion in our base to meet or exceed quarterly revenue targets.Using repeatable processes and tools, establish technical credibility with customers.Prescriptively map customer business and technical challenges to Sauce solutions.Deliver high impact product demonstrations based on the customers environment and testing needs.Ability to manage detailed and complicated Proofs of Value with prospects and customers.Support Marketing activities by working trade shows, reviewing documentation for technical accuracy and hosting introductory webinars as requested.Work well in a distributed team atmosphere.Establish confidence in Sauces recommendations via industry and product expertise, technical whiteboarding, RFP/RFI responses, and product roadmap discussions.Expect moderate travel.Knowledge, Skills and Abilities:Excellent communication and presentation skills with a demonstrated ability to read and own a room.Minimum of 5 years of sales engineering experience working for a technology vendor selling enterprise solutions to both technical and commercial audiences.A track record of success selling to Enterprise accounts.Self starter, not afraid to get your hands dirty.Familiarity with Selenium and/or appium is a plus.Grasp of programming concepts in various languages including but not limited to Python, Ruby, Java, PHP and .NET.Solid understanding of Agile development methodologies including CI.Familiarity with proxy servers, network troubleshooting and firewall configurations.Familiarity with open source testing frameworks, methodology and principles. Familiarity with SaaS solutions, concepts and business models.Bachelor's degree in Computer Science, Mathematics, or Engineering preferred."}