{"jobID": "2755951073", "jobLocation": "Austin_TX", "jobTitle": "Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.teza.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "About Us Teza is a quantitative asset management firm that strives to develop innovative, high-Sharpe investment products for its clients. Originally founded in 2009 as a science and technology-driven global quantitative trading business, Teza derives its unique edge in asset management from its high-frequency trading past and science-based investment approaches. Under the leadership of CEO Misha Malyshev, Tezas innovative approaches to quantitative research and platform engineering distinguish us from other quant trading firms. We have successfully attracted and assembled a group of top talent, including widely recognized experts in quantitative trading. Teza has over 50 professionals worldwide with offices in Austin, Berkeley, Chicago, London, New York, and Shanghai. About the Role Teza Technologies is looking for a data engineer to join our core services technology team in our New York City office. Data is at the core of our business and is currently driven from hundreds of real-time and daily sources. Teza data engineers are content and technology experts. They are constantly learning on the job, innovating, communicating with our researchers and working directly with external vendors.Responsibilities: Import data from the vendors, clean and store the dataBuild tools that will help automate the cleaning process of the dataAnswer company wide questions about the nature, completeness and correctness of the data, using judgement and primary sources to determine whether on-the-fly updates are warranted.On-board new data sources and maintain external relationships.Work to integrate new data sets into the existing database structure. Plan upload protocol and sanity checks to ensure data integrity.It's critical that the candidate will bring a CS view to the process of data management and a strong experience in systems design is desired Reference Data Analysts are precise, patient and they are good communicators. The right sort of person can thrive without any prior finance experience. Preference for Python, Java is a plus."}