{"jobID": "2726146838", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.coupa.com", "Headquarters": "San Mateo, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Public (COUP) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " SAP Ariba, SAP Concur, Oracle"}, "estimatedSalary": "147000", "jobDescription": " Coupa Software (NASDAQ: COUP), a leader in business spend management (BSM), has been certified as a Great Place to Work by the Great Place to Work organization. We deliver Value as a Service by helping our customers maximize their spend under management, achieve significant cost savings and drive profitability. Coupa provides a unified, cloud-based spend management platform that connects hundreds of organizations representing the Americas, EMEA, and APAC with millions of suppliers globally. The Coupa platform provides greater visibility into and control over how companies spend money. Customers small, medium and large have used the Coupa platform to bring billions of dollars in cumulative spend under management. Learn more at www.coupa.com. Read more on the Coupa Blog or follow @Coupa on Twitter.  Do you want to work for Coupa Software, the world's leading provider of cloud-based spend management solutions? Were a company that had a successful IPO in October 2016 (NASDAQ: COUP) to fuel our innovation and growth. At Coupa, were building a great company that is laser focused on three core values: Ensure Customer Success Obsessive and unwavering commitment to making customers successful.Focus On Results Relentless focus on delivering results through innovation and a bias for action.Strive For Excellence Commitment to a collaborative environment infused with professionalism, integrity, passion, and accountability.Responsibilities:Build reporting & analytical applications, enabling our customers to optimize their spend and maximize savings.Automate data loading processes and build monitoring tools around them.Enhance and automate data ingestion, transformation, cleansing, and loading processes.Work closely with product managers and user experience designers to build meaningful dashboards and reports.Requirements:Bachelors degree in Computer Science & Engineering, with 5+ years experience building data applications.Programming experience with Ruby, Python or similar scripting languages.Strong analytical SQL skills.Excellent communication skills.Familiarity with agile development processes. At Coupa, we have a strong and innovative team dedicated to improving the spend management processes of todays dynamic businesses. Its our people who make it happen, and we strive to attract and retain the best in every discipline.  We take care of our employees every way we can, with competitive compensation packages, as well as restricted stock units, an Employee Stock Purchase Program (ESPP), comprehensive health benefits for employees and their families, a 401(k) match, a flexible work environment, no limit vacations, catered lunchesAnd much more!  As part of our dedication to the diversity of our workforce, Coupa is committed to Equal Employment Opportunity without regard for race, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity or religion. Please be advised, inquiries or resumes from recruiters will not be accepted."}