{"jobID": "2587258553", "jobLocation": "Mountain_View_CA", "jobTitle": "Health Economist/ Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.livongo.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Clinical Research and Analytics at Livongo:The mission of the Livongo Clinical Research & Analytics team is to use data analytics and machine learning to improve the care for our members with diabetes and other chronic diseases and demonstrate outcomes to our clients, partners and the academic community. What You'll Do: Analyze member and client data including biometric labs, medical and pharmacy claims and health benefit eligibility data to help clients understand Livongo value proposition and return on investment for their organizationParticipate in development of relevant meta-analysis, systematic review, or other outcomes research studySupport clinical trial planning, data collection and analysis across the Livongo populationContribute data and figures to abstracts and manuscripts for submission to scientific conferences and peer-review journalsProvide consultation and analysis for product feature development related to outcomes generatedWork collaboratively with members of the product, clinical, data science and engineering teams to optimize data ingestion pipelines and build data products that help people live better lives.Have a central role in data infrastructure technology for analyticsQualifications:MS or Ph.D in Computer Science, Economics, Outcomes Research, Health Services Research required2-4 years of experience in healthcare analytics and/or outcomes researchExpertise in working with medical and pharmacy claims dataExperience in developing and implementing strategies to generate evidence to support product valueIn-depth knowledge of the healthcare industry, including the pharmaceutical industry (product development and commercialization), managed care organizations, pharmaceutical benefit management organizations, government systems, hospital systems, and integrated systems of care.Highly motivated self-starter who is able to work independently, deal with complex issues, and relate to multiple internal and external stakeholders.Ability to work in a dynamic team environment with an emphasis on collaboration and maintaining positive relationship with colleagues and external collaborators to achieve goals.Excellent process and project management skills, including the ability to manage multiple projects and exercise good triage and judgment skills.Excellent verbal and written communication skills.Diabetes or Cardiovascular therapeutic experience a plus.Technical interest and experience with data visualization a plus.Requirements:You care about people:You have fundamental respect for all peopleYou are in awe of the ability to use data to make people's lives betterYou care deeply about protecting peoples privacy and improving their healthYou are great at:Analyzing data using R, SQL, Python and/or statistical software packages, e.g. SAS, STATATransforming complicated problems into simpler, tractable onesMaking those around you betterWe are committed to an inclusive and diverse Livongo. We are not looking to hire in the traditional Silicon Valley way. We actively want people from all backgrounds to apply. We know that hiring traditionally underrepresented groups in tech will give us the talent and diverse perspectives needed to achieve our mission."}