{"jobID": "2831156613", "jobLocation": "Irvine_CA", "jobTitle": "Inside Sales Associate", "companyRating": null, "companyInfo": {"Website": "www.tradingacademy.com", "Headquarters": "Irvine, CA", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Hiring for two shifts: Monday through Friday 12 pm – 8 pmMonday through Friday 6 am – 2 pm Online Trading Academy is an entrepreneurial, innovative organization with an exceptional company culture.Mission: Transforming lives worldwide through exceptional trading and investing education.Values: Passion -- Respect -- Trust -- Collaboration -- Love -- InnovationThe ideal Sales Associate candidate can connect with a wide variety of people. You may be talking to someone in Manhattan in the morning - Seattle in the afternoon, and our successful Sales Associates at Online Trading Academy are able to engage and build trust quickly with everyone. This team conducts outbound/inbound phone sales for our nationwide network of financial education centers.Skills, Knowledge and Experience:Experience: Work-related experience required in the areas of sales and customer serviceCommunication Skills: Adept at providing accurate, professional, friendly, patient, composed and polite service when speaking with prospectsLanguage Skills: Excellent oral and written communication skills required:Ability to be concise without being offensiveAbility to offer support without being verboseOther Skills: Solid organizational skills. Must be very detail-oriented, able to handle multiple tasks simultaneously and able to adapt to shifting priorities.Reasoning Ability: Ability to solve problems quickly and effectively.Essential Job Functions:40 hours per week.Maintain or exceed minimum performance standards.Attend all meetings and training sessions as required.Must be trustworthy at the highest company level. Ability to work in a fast-paced, multi-tasked, team environment. Ability to adapt quickly and think creatively to meet needs of our students, franchisees and fellow employees. A quick learner with a sense of urgency. Must have a positive, supportive approach to customer service and offer patient support within a demanding workload. Must be an energetic team player.Must be comfortable in a high volume call environment; taking 120 plus calls a day.Working and Environmental Conditions & Physical Demands:Personal Environment: Typically requires sitting receiving phone calls for extended periods of time. Requires periods of time in front of a computer terminal. Must be able to work flexible shifts, including weekends, as needed to meet team goals. Company environment: Cubical and open office environment with breakfast and lunch catered daily. Here’s What You’ll Get:World-class learning and development opportunities in financial education. Colleagues who are intellectually curious, hard-working, and collaborative.Nice extras:Financial contribution and discount incentive for gym membership.Breakfast and Lunch catered daily for all staff.Monthly Hand Car Wash ProgramOngoing professional development education.Private health insurance, dental and vision.A competitive benefits package."}