{"jobID": "2776977414", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Manager - Advanced Analytics - Role based in San Francisco, California, relocation assistance provided", "companyRating": null, "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next.  We're looking for an experienced data science leader to lead and scale a team addressing some of the hardest data problems on one or more of our products.  Your team of data scientists will be partnering with Product and Engineering to advance actionable data insights and solutions from Uber's large datasets. We work on every aspect of the product - whether it's exploratory research to understand user behavior for riders and drivers, or running experiments to optimize untapped areas of growth, or developing machine learning models to mitigate fraud on our platform. For the data science leader who wants to have a fundamental impact on the trajectory of a hyper-growth company, this is the opportunity of a lifetime.  #LI-POST What you'll needAt least 4 years of experience in quantitative analysis, and a deep educational background in an engineering or technical field.Prior management and team-building experience. You'll be managing several direct reports initially and will have the opportunity to scale, build and develop a team of experienced professionals.Self-starter and collaborative leader. Everywhere you go, you can't help but mobilize people, build things, resolve problems, get into the details, go above and beyond, and draw out the best in people. You are a doer and motivator of others.Excellent execution and organization. This team will be working with engineers and product leads at the forefront of the development cycle. To excel in this role, you should be comfortable executing with little oversight and be able to adapt to problems quickly.Strategic mindset - you're comfortable thinking a few steps ahead of where the team is at now.Experience with common analysis tools - SQL, R, and Python. Demonstrable familiarity with code and programming concepts."}