{"jobID": "2836931035", "jobLocation": "Austin_TX", "jobTitle": "Retail Operations - Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.wholefoodsmarket.com", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (WFM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, Safeway, Trader Joe's"}, "estimatedSalary": null, "jobDescription": " Job DescriptionThis role reports to the Global Executive Coordinator of Retail Operations. The Retail Operations Data Science Analyst is an experienced analyst that has proven abilities to develop new and previously untried analytical methods to extract insights from operational data sets within Whole Foods Market stores. Performs a wide range of research, analysis, development, and interpretation functions to help the company understand and derive meaning from large and complex data sets. This role also engages with Data Science colleagues to design and execute appropriate analytical and modeling projects that will enable other operational team leaders to clearly see opportunities for continuous improvement. This role is based in Austin, TX. Responsibilities:Develops and ensures consistent collection, measurement, analysis, reporting and presentation of actionable insights for all aspects of retail operations to include current operations performance, initiative driven projects and global/regional/store level performance reporting.Translates business issues into analytical questions and determines methods for collecting and analyzing appropriate data while ensuring data quality through all stages of acquisition and processing.Ensures all reporting is seen as a relevant and useful resource through development of reporting hierarchy/access and efficient production, communication and distribution of business intelligence, as well as periodic reviews with key members of various business functions.Performs data mining, statistical research, profiling and modeling to provide solutions to business needs and to support long-term operational strategies.Understand how to translate customer requests into data requirements and technical specifications.Researches and evaluates large volumes of data from disparate sources to identify statistical patterns and generate actionable insights for application at the store and regional level.Assesses suitability of existing data sources to address requests, fill information gaps and provide suitable forward-looking information.Perform hypotheses testing and analysis to understand the impact of program policies and procedures to determine their effect.Team with peers in Global Retail Operations to enable regional leaders, store leadership and store team members to more effectively execute their business plans through insights provided.Skills:Understands and applies data science concepts, principles and practices. Able to perform routine to moderately complex data analyses. Understands and applies statistics to data mining and analysis. Understands and able to use industry standard programming languages and platforms.Leads efforts to interrogate data and data sets in a manner that logically addresses identified business issues. Applies analytical skills to evaluate and interpret multi-faceted and complex store, purchasing, procurement, contract, delivery, quality, pricing and other issues.Ability to find correlations in performance across vast, disparate data sets and provide analysis in a fast paced, changing environment and anticipate future needs.Able to apply statically tools and methodologies such as: descriptive analytics, normal vs. non-normal data techniques, correlation and regression analysis, hypothesis testing for means, variances and proportions, gap analysis and control charting techniques.Ability to travel up to 30%.Strong emphasis on servant leadership and listening skills, energetic, flexible, collaborative, and proactive; a team leader who can positively and productively impact strategic and tactical initiatives.BA/BS degree and 2-4 years' relevant experience OR equivalent combination of education and relevant experience.Ability to physically perform general office requirements.Must be able to perform essential responsibilities with or without reasonable accommodations. At Whole Foods Market we provide a fair and equal employment opportunity for all team members and candidates regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status, or disability. Whole Foods Market hires and promotes individuals solely on the basis of their qualifications for the position to be filled."}