{"jobID": "2819935599", "jobLocation": "Menlo_Park_CA", "jobTitle": "Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Description: Pharmaceutical Development  BiopharmX, located in the San Francisco Bay Area, is seeking a scientist with exceptional scientific curiosity, critical thinking, and self-motivation to join its Pharmaceutical Development team.  The position's primary focus is to provide technical know-how in the design and planning of pharmaceutical activities to support formulation development activities. The position is expected to lead the generation of new protocols. The candidate must be experienced with the applications of technical principles, ability to draft scientific reports, and knowledgeable in the use of lab instruments and equipment. The candidate will occasionally work with contract organizations.  Essential duties and responsibilities include, but are not limited to, the following: Execute the development and screening of early formulations, develop needed HPLC methods, and prepare formulation for nonclinical dermal studiesExperience in pharmaceutical formulation development, analytical chemistry and CMC experienceKnowledge and experience in the development and validation of small molecule analytical methodsScreening and evaluating drug product candidatesGood laboratory and hands-on laboratory skillsWork closely with other R&D; teams, actively supporting testing of new drug formulation and new projects at various stages of development, and meeting project timelines and goals.Knowledgeable in recent advances of formulation and delivery technologies.Application of biopharmaceutics principles and clinical PK data towards formulation development and optimizationProvide internal expertise to understand and optimize the predictive value of developing new formulationsUnderstanding and applying GLP regulationsDeveloping, validating, and writing SOPsOrganizing data, maintaining records, and communicating resultsRequirementsPh.D. pharmaceutics, chemistry, pharmaceutical chemistry, or related disciplineMinimum 2-5 years of experience in academics or industry Full name  Email address  Message  Upload CV (optional)  Upload your CV/resume or any other relevant file. Max. file size: 50 MB.  Current  Past Education EmailCover letter (optional)To whom it may concern,I am very interested in the Scientist position at . I believe my skills and work experience make me an ideal candidate for this role. I look forward to speaking with you soon about this position. Thank you for your consideration.Best regards,  Clicking submit will submit your full profile to ."}