{"jobID": "2835301097", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, Business Development - San Francisco", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Role The Business Development team is looking for a self-starter who wants to identify and solve highly analytical problems related to Uber’s Business Development and Partnership efforts.  You will work cross-functionally with the Data Science, Engineering, Product, and Finance teams to conduct analysis and build tools to support Uber’s strategic partnership activities.  Ideal candidates will have strong analytical and communication skills and an outstanding ability to translate data into actionable business strategies. What You’ll DoProvide deep insight and discover opportunities that drive our business.Continually improve and automate our methods for parsing data and incorporating it into models, analyses, and actions.Perform large-scale data analysis and develop effective statistical models for partner segmentation, classification, optimization, etc.Effectively communicate data methodology and results to a diverse set of stakeholders. Translate numbers into actionable business strategy.What You’ll NeedBachelor’s and/or Master’s Degree in Economics, Math, Computer Science, Statistics, Management Science or other quantitative field.At least 2 years of experience in a quantitative or analytical roleStrong SQL skills and experience utilizing common open source tools – such as Python and R – to work efficiently at scale.Effective communication skills and ability to summarize and present large amounts of data.Excellent multitasking skills to manage multiple projects across various teams and topics.Willingness and desire to learn and adopt new skills – both technical and non-technical – in order to craft and deliver the best solutions.Ability to collaborate with individuals from varying backgrounds and skill setsA preference for quality over quantity- you get the math right and aspire to build the right solution."}