{"jobID": "2721898913", "jobLocation": "Chicago_IL", "jobTitle": "Consultant, Data Engineering", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "76000", "jobDescription": " As part of a Big Data and Analytics project team, the Big Data Engineering Consultant focuses on building big data solutions using Azure cloud services to support data visualization and advanced analytics needs for Avanade clients. This role helps with the design and development big data solutions using Azure PaaS Services. Participate in trainings to gain proficiency with design and development of modern big data and analytics solutions using Azure PaaS Services.Gather and document data requirements as part of the big data and advanced analytics team.Understand business objectives of analyses and document the sameUndertake data analysis and collaborate with analytics team to shape data to meet data visualization needsAnalyze, design and build Modern data solutions using Azure PaaS service to support visualization of data, including but not limited toExtract, Transform and Load data from Sources Systems to Azure Data Storage services using a combination of Azure Data Factory, T-SQL and U-SQL [Azure Data Lake Analytics]Data Ingestion to one or more Azure Services (Azure Data Lake, Azure Storage, Azure SQL, Azure DW)Profile data and identify data quality issues. Collaborate with project team to identify options to address data quality and make appropriate recommendationsWork with our Solution Architects to design big data architecture, develop data models, data shaping logic and validate with tools such as Excel and Power BI. About you  You are an experienced technology professional with a passion for emerging technologies and a desire to innovate. You can work with cross-functional teams and diverse clients. You have knowledge in the common skills of database development including data models and SQL, report development and business intelligence terminology.  Your background and skills likely include: Demonstrable experience working with database, storage, collection and aggregation models, techniques and technologies, with the ability to apply such methods to solve business problems.Have a basic understanding of modeling and transforming data for reporting & data visualization needs using structured query language (SQL) and .Net programming languages such as VB, C# etc.Experience in structured problem-solving assignments.You enjoy tinkering, solving problems and building creative solutions. You likely have a Bachelor's Degree in Computer Science, Software Engineering, and/or Information Systems  Qualifications"}