{"jobID": "2789410541", "jobLocation": "Cedar_Park_TX", "jobTitle": "Data Support Analyst (Pricing Team) Insurance (P&C;) Cedar Park, TX", "companyRating": "3.5", "companyInfo": {"Website": "www.genpact.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (G) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Accenture, IBM, Capgemini"}, "estimatedSalary": "46000", "jobDescription": "Data Support Analyst (Pricing Team) Insurance (P&C;) Cedar Park, TXGenpact National VendorFunction: Operations Genpact is a global professional services firm that makes business transformation real. We drive digital-led innovation and digitally-enabled intelligent operations for our clients, guided by our experience running thousands of processes for hundreds of Global Fortune 500 companies.  From New York to New Delhi and more than 20 countries in between, Genpact has the end-to-end expertise to connect every dot, reimagine every process, and reinvent companies ways of working.  Our focus is to make sure we have the right set of people delivering what we promise. People who think with design, dream in digital, and solve problems with data and analytics. People who obsess over operations, focus on the details, and lead change by being curious, incisive and courageous in everything they doon a foundation of unyielding integrity. National Vendor, a Genpact company is the insurance industrys most complete contents solution with a reputation for world-class customer service and cutting edge technology. National Vendor is a leading provider of integrated claims solutions to the U.S. property and casualty (P&C;) insurance market. We specialize in property claims management for both structural and contents losses.  We are Genpact. Transformation happens here. Come, be a part of our exciting journey! Inviting applications for the role of Data Analyst (Pricing Team)Job Summary The Pricing Analyst will act as an account manager for an insurance adjuster. They will coordinate incoming claims, oversee the inventory pricing and monitor accuracy. They will be responsible for performing quality assurance (QA) on the files before sending back to the adjuster. They will be the point of contact (via phone or email) with the adjuster as well as the pricing representatives. ResponsibilitiesEnsure claims are returned within service levels to carriers with correct information in accordance with SOPsHandling any questions, concerns and revisions while working with adjustersCoordinating pricing assignments to Pricing TeamPerforming QA on returned pricing assignmentsResponsible for returning pricing to adjustersResearch and determine Like Kind Quality replacementsInput pricing into National Vendor evaluation form/XactContentsCommunicate via email or phone with the adjuster or insured throughoutKeeping up-to-date technically and applying new knowledge to your jobEntering claim costs and generating invoices for billingKeep up-to-date with mandatory trainings in iLearn.QualificationsPreferred SkillsExperience with Data EntryMS Office Experience (Excel, Word & PowerPoint)Intermediate Computer Skills (Typing, Internet Research, Computer Navigation)Effective communication skills, with co-workers and supervisorsThe ability to complete assignments correctly and to meet a deadline.Knowledge of administrative and clerical procedures and systems in managing files and records as well as other office procedures and terminology.Keeping up-to-date technically and applying new knowledge to your job.The ability to read and understand information and ideas presented in writing.The ability to use relevant information and individual judgment to determine the best possible solution to any situation.Exercising excellent customer service skills at all times. This information can be exchanged in person, in writing, or by telephone or email.The ability to stay organized and prioritize workPhysical Requirements of the JobThe ability to sit still for long periods of time while looking at a computer screen(s)Required qualificationsHigh School Diploma or equivalentMin. 1 year experience working in an office environmentBenefits All Employee Benefits start on the first day of employment: Health Insurance including Dental & VisionHealth Reimbursement Account (HRA)Flexible Spending Accounts (FSA)Life & Disability InsuranceWellness Program15 PTO Days a year & 11 Paid Holidays401(k) with company match (100% Vested with first deduction)Employee Stock Purchase Program (Employee Discounts)6 Weeks of Paid Parental Leave12 Weeks of Maternity LeaveAdoption Assistance ProgramWork from Home Opportunity post successful completion of trainingGenpact is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. Genpact is committed to creating a dynamic work environment that values diversity and inclusion, respect and integrity, customer focus, and innovation."}