{"jobID": "2802775338", "jobLocation": "Dallas_TX", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.trin.net", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1933", "Type": " Company - Public (TRN) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " GATX, BNSF Railway"}, "estimatedSalary": "66000", "jobDescription": "DescriptionTrinityRail is searching for a Senior Data Analyst. The successful candidate will turn data into information, information into insight and insight into business decisions. The candidate will also be responsible for a $100mm maintenance expense budget, strategic plan and forecast, utilizing statistical models to forecast expenses up to 5 years out. The candidate will provide insights on cost reduction opportunities to the fleet maintenance group. The analyst should have experience in data mining and transformation, creating visualizations, and statistical analysis. Presentation skills are required to review variance explanations, explain models, and lead expense conversations with the leadership team.What you'll be doing:Build and refine statistical models to gain better insight into future maintenance expense (primarily R Studio)Assist in generating hypothesis that drives strategic questions about the leasing businessBuild visualizations utilizing systems, like Qliksense, and drive analytical insights to proactively support cost reduction targetsPrepare, analyze and make recommendations for a multi-million dollar maintenance forecast. Work cross functionally with FP&A; and Fleet Maintenance effectively communicating deadlines regarding actuals, forecast, strategic plan and budgetLead weekly cost discussion with fleet maintenanceBuild labor hour based forecast model and design model to leverage new system capabilitiesPrepare 5 year Strategic Plan (Due August)Prepare annual Budget (Due September and November)QualificationsWhat you'll need:Bachelors Degree in Mathematics, Economics, Computer Science, Information Management, Statistics, Finance or Accounting, Masters preferred5+ years relevant experienceAdvanced skills in SQL, Microsoft Excel, PowerPoint, and at a minimum intermediate experience in all other Microsoft Office ProductsTechnical expertise regarding data models, database design/Development, data mining and other segmentation techniquesInterpret data, analyze results using statistical techniques and provide ongoing reportsMust possess effective communication skills, both verbal and writtenStrong organizational, time management and multi-tasking skillsExperience with data conversion, interface and report developmentAdept at queries, report writing and presenting findingsProcess improvement and automation a plusWork with management to prioritize business and information needs"}