{"jobID": "2796937735", "jobLocation": "Houston_TX", "jobTitle": "Institute Research Scientist - In-Vitro Pharmacology", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " The Institute Research Scientist participates in cross-functional research to identify and validate novel oncology targets, and translate these finding into novel oncology therapeutic agents to benefit patients.  The mission of The University of Texas M. D. Anderson Cancer Center is to eliminate cancer in Texas, the nation, and the world through outstanding programs that integrate patient care, research and prevention, and through education for undergraduate and graduate students, trainees, professionals, employees and the public.  MD Anderson is known for providing cancer patients with exceptional care, which includes early access to innovative new treatments through clinical trials. The Institute for Applied Cancer Science (IACS) is a new hybrid model that uniquely combines the drug discovery capabilities of the biopharmaceutical industry and the extensive knowledge of biology found in academia with the expertise of MD Anderson's top clinicians. IACS has the singular goal of rapidly developing novel, effective and safe therapeutics that improve patient health. IACS executes programs with the highest probability of clinical success in a rigorous, goal-oriented, data-driven manner. We are seeking a highly motivated and team-oriented individual to join our in vitro Pharmacology group to support our fast-paced drug discovery programs.  Salary range: Min $98,000 - Mid $122,500 - Max $147,000  KEY FUNCTIONS  1.Responsible for the development, optimization, validation, implementation, and execution of cellular, biochemical, and biophysical assays for medium and high-throughput screening to support target validation, hit identification and confirmation, and lead optimization in small molecule drug discovery projects.  2.Implement novel in vitro screening strategies; plan and execute screening and counter screening funnels for drug discovery programs.  3.Fully characterize mechanism of action and kinetics of lead molecules using biochemical and biophysical techniques.  4.Monitor assay quality and troubleshoot issues with assay performance.  5.Contribute to project teams through lab-based activities.  6.Interact closely with other biologists and medicinal chemists on discovery-based project teams.  7.Transfer assays to collaborators as appropriate.  8.Work closely with research teams to identify and recommend opportunities leading to scientific discovery and clinical therapeutic drug development.  9.Interact across cross-functional groups.  10.Employ safe lab practices  11.Maintain research records and laboratory notes.Education Required: Bachelor's degree in Biology, Biochemistry, molecular biology, cell biology, enzymology, pharmacology, chemistry or related field. Preferred: PhD in enzymology, pharmacology, chemistry or related field. Experience Required: Ten years of relevant research laboratory experience. With Master's degree, eight years of required experience and with PhD, two years of required experience. Preferred: At least two years of relevant industrial experience within the pharmaceutical industry. Cellular assay experience in a drug discovery setting required.Ideal Candidate will possess the following:A demonstrated track record in the development and implementation of cellular assays for compound screening using a variety of detection formats, especially high content imaging"}