{"jobID": "2837169800", "jobLocation": "Summit_NJ", "jobTitle": "Principal Scientist, Analytical Development", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture. Analytical Development Analytical Development is a science-driven organization dedicated to building in-depth and comprehensive knowledge of our products and their processes through well-designed analytical studies. We work in all phases of pharmaceutical development to oversee the analytical processes for drug substance and drug product development both internally and with external contract service providers. Our goal is to enable the establishment of specifications and robust analytical procedures that allow control of our drug substance and drug product processes to provide safe, efficacious and high quality products to the patients we serve. Responsibilities for a Principal Scientist will include, but are not limited to, the following: The Principal Scientist is responsible for the development and validation of analytical methodology for the characterization of our products and processes, the creation of fundamental product and process understanding, and the advancement of innovative approaches to drug development. Support for drug candidates across all stages of development and, as needed, within our commercial product portfolio will be required.  The Principal Scientist works with minimal supervision to carry out laboratory based de novo analytical methods development, chemical characterization studies and chemical stability characterization evaluations. Where required, activities will be performed in accordance with cGLP/cGMP regulations, established business processes and protocols, and applicable standard operating procedures.  The Principal Scientist will have organizational and interdepartmental responsibilities with regards to leading workgroups, cross-functional teams, strategy development/implementation/execution, and cultural initiatives. Support drug substance process development including characterization of starting materials, intermediates, and final API.Support drug product formulation and process development including characterization of the process and finished product.Develop, optimize and validate analytical methods.Support drug substance and drug product impurity characterization and identification.Qualify/transfer analytical methodology to quality control and contract laboratories.Provide leadership and supervision to scientific staff.Develop, coach and mentor others.Serve on and lead departmental, interdepartmental and project teams.Report and discuss analytical results and conclusions both orally and in writing.Write formal reports for inclusion in regulatory filings and support the generation of appropriate responses to questions from regulatory authorities.Represent the company in discussions with regulatory authorities and alliance partnersReview analytical data for completeness and correctness.Complies with Environmental Health and Safety Requirements.Ensure that all facilities, equipment and personnel are and remain in compliance with cGLP / cGMP, FDA and EMA requirements, appropriate SOPs and corporate policies.Contributes to the ownership and advancement of lab instrumentation, work processes, and procedures.Experience Required: Ph.D. with 10 years experience in Chemistry; MS with 12 years experience; and, BS with 14 years experience (or relevant discipline) with pharmaceutical experience Skills/Knowledge in the following areas are required:BS/MS/PhD in Chemistry (or relevant discipline) with required years of experienceFluency in synthetic chemistry, drug substance processing, formulation development, pharmaceutical processing with a deep understanding of pharmaceutical sciences related to drug product developmentMastery of chemistry with extensive expertise in measurement science.Experience in the development and performance of analytical tests for a variety of drug substances and products (including solid oral dosage forms and injectables).Knowledge of dissolution method development and testing, biopharmaceutical classification system, and IVIVC / IVIVR.Strong statistical knowledge and capabilities.Understands drug development and works to build CMC dossier for regulatory submissions as an author/reviewer.Advanced skills in DOE, Lean and/or Six Sigma.Familiar with modern laboratory equipment and automation.Understands and applies Quality by Design principles when requiredAdvanced skills in PAT and chemometrics.Expectations of the Principal Scientist include:Exceptional verbal and written communication skills and interpersonal skills as a team member/leader in an environment where individual initiative, collaboration and accountability are valued.A demonstrated record of scientific accomplishment, laboratory experimentation, publication and presentation.Beginning to impact not just AD but multiple departments. This impact is achieved through leading groups and contributing to cross-functional teams.An expert related to cGLP/cGMP and applicable FDA, EMA and ICH guidance.Mastery of USP and other compendia and how they guide drug development decisions.Strong problem-solving and troubleshooting skills.Strong capabilities in experimental design and execution.Works independently and is a leader in the department.Ability to provide scientific guidance, leadership, and training to others within the department.Ability to supervise others directly and is a scientific leader/mentor within department and in wider organization.An absolute commitment to and demonstrated proficiency in employee development.External visibility and connection with outside scientific, regulatory, and trade organizations relevant to Employer operating model. May present and publish to influence policy outside of Employer. #LI-POSTEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}