{"jobID": "2826056340", "jobLocation": "San_Jose_CA", "jobTitle": "Big Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.e-walkwater.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Key Qualifications4+ years of industry experience in developing jobs in the MapReduce/Hadoop ecosystem, especially with Spark/Scala.Experience with job scheduling tools such as Airflow or Oozie.Experience with object-oriented design, software engineering, and testing in Java and/or Scala.Working knowledge of the fundamentals of probability and basic statistics. This role will work in close collaboration with analysts and statisticians.Familiarity with A/B testing best practice, or a desire to learn and grow.Strong communication skills and experience working on cross-functional projects.Experience with SQL and basic database knowledge for modifying queries and tables.Experience with Linux, Gradle, build automation.An obsession with quality.Description We are a growing team that builds data pipelines that compute metrics for the purpose of Online Evaluation. We are at the center of the effort to make modern AI smarter and more responsive to users. Help us build new insight that impacts the direction of our entire organization. You will be responsible for building Spark/Scala pipelines, metrics, and perform related analysis to determine whether your metrics are valid for intended function. You will work with partners to understand their specific evaluation needs. Propose solutions and present prototypes, analysis, and supporting documentation to ensure that metrics are understood by partner teams and therefore actionable. You will implement solutions in maintainable code and continuously work to improve, learn, and teach others through pair programming and pull request reviews. You will create design patterns to ensure your metrics can be easily understood and reused in different contexts. You will also contribute to the design of our full system architecture. Create unit and functional tests to prove that your code continues to work in a fast-paced environment and you will provide technical expertise to other teams, advising best practices and highlighting risks. Education Bachelor’s Degree or foreign equivalent in Computer Science, or related field, or equivalent experience.- provided by Dice  Map Reduce /Hadoop, Spark/Scala , Oozie and Airflow , testing Java and/or Scala"}