{"jobID": "2835669370", "jobLocation": "Santa_Clara_CA", "jobTitle": "Siri - Machine Learning Engineer/Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Siri - Machine Learning Engineer/Scientist Job Number: 113665155Santa Clara Valley, California, United StatesPosted: May. 17, 2018Weekly Hours: 40.00 Job SummaryPlay a part in the next revolution in human-computer interaction. Supply to a product that is redefining mobile computing. Create groundbreaking technology for large-scale systems, spoken language, big data, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri Speech team at Apple. The Siri team is looking for exceptionally skilled and creative Engineers/Scientists eager to get Involved in hands-on work improving the Siri experience by applying deep machine learning.Key Qualifications Good knowledge in machine learning technologies related to speech and image processingGood coding skills in one of the following languages, e.g. Python, C/C++ and/or Java.Experience in deep machine learning and related toolkits, e.g. Tensorflow, PyTorch etc. a big plusExperience in speaker recognition and related technologies is a plusCurious about new technologies and passionate about exploring new use cases DescriptionYou will be a part of a team that’s responsible for research and development activities related to natural voice interaction. Your focus will be on investigating new approaches; and fine-tuning deep learning models. You will be part of speaker recognition and multi-modal team. You will take care of large quantities of data; apply the state-of-the-art methods in deep learning to tackle real world problems; and build the production quality models, at scale. You should therefore be passionate about building phenomenal products that are used by millions of people. You’re expected to be a standout colleague that thrives in a fast paced environment with rapidly changing priorities.EducationM.S. or PhD in Computer Science or related field"}