{"jobID": "2834905369", "jobLocation": "San_Francisco_CA", "jobTitle": "Accounting Associate -- Mobile Game Co. in S.F.", "companyRating": "5.0", "companyInfo": {"Website": "www.superluckycasino.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " PLAYSTUDIOS, Big Fish Games, Caesars Entertainment"}, "estimatedSalary": "50000", "jobDescription": "Are you a super-organized and detailed person? Do you have at least some experience with excel and Quickbooks Online (QBO)? Do you want to be part of a 7+ year old, profitable, fun startup?If so, this is the opportunity for you!PLEASE SEE “APPLY” SECTION BELOW FOR SUBMISSION INSTRUCTIONSPrimary Job (Responsibilities)Work with senior accounting team to manage payables and receivables and ensure that invoices and payments are processed accurately and on timeDaily entry of key business statistics into management-viewed reportsMaintain online data storage “room” for audit-ready reviewAd hoc reporting and other assignments as assignedYour (Skills and Experience)MUST: have relevant experience (1-2 year preferred) accounting/invoicing/bill-pay experience.MUST: some familiarity with QBO.MUST: be very comfortable manipulating information in Excel.MUST: be well organized with strong attention to detail.MUST: be entrepreneurial in spirit and a team player! No egos allowed. This is a late-stage startup and we live in a world of rapid-change.PREFERABLE: some experience with web or mobile gamesAbout Us (Company and Culture)Super Lucky Casino is one of the largest independent developers of mobile games in the world. We’re profitable and growing quickly. We produce some of the most fun and successful games on iTunes, Google Play, Facebook, and Amazon!We work as a team. Everyone helps everyone. Everyone is a teacher. Everyone is a student. Overall, our goal is to make our team better at what we do.This position is full-time with some schedule flexibility. We offer market-competitive compensation, full benefits, 401K, and PTO. We encourage personal growth and provide everyone an opportunity to grow in whichever direction they are most interested!To apply please visit our Accounting Associate job posting on our website at www.superluckycasino.com"}