{"jobID": "2809343664", "jobLocation": "Palo_Alto_CA", "jobTitle": "Master Data Management Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.stanfordhealthcarecareers.com", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sutter Health, UCSF Medical Center and UCSF Benioff Children’s Hospitals, Kaiser Permanente"}, "estimatedSalary": "76000", "jobDescription": " Master Data Management Analyst (45649)  Job Type: Full Time  FTE/Bi-Weekly Hours: 1.0/80  Shift: Days  Hours in Shift: 8  Location: Palo Alto, CA  Req: 45649 Job Description The Master Data Management Analyst supports Supply Chain Logistics & Sourcing through a comprehensive understanding of Master Data Management, Logistics and Sourcing operational and business needs. This position requires a thorough understanding of MDM concepts, industry data standards and supply chain operations. The Master Data Management Analyst collaborates with ITS, Operational Managers and external vendors to ensure consistent data management and accurate information flow to support core enterprise functions, including Supply Chain Automation, inventory management, vendor and recall management, and Non-Labor Spend Savings initiatives. This individual will work under the direction of the Data Manager within Supply Chain - Sourcing.  Essential Functions  The essential functions listed are typical examples of work performed by positions in this job classification. They are not designed to contain or be interpreted as a comprehensive inventory of all duties, tasks, and responsibilities. Employees may also perform other duties as assigned.  Employees must abide by all Joint Commission Requirements including but not limited to sensitivity to cultural diversity, patient care, patient's rights and ethical treatment, safety and security of physical environments, emergency management, teamwork, respect for others, participation in ongoing education and training, communication and adherence to safety and quality programs, sustaining compliance with National Patient Safety Goals, and licensure and health screenings.  Employee must perform all duties and responsibilities in accordance with the C-I-CARE Standards of the Hospital. C-I-CARE is the foundation of Stanford's patient-experience and represents a framework for patient-centered interactions.  Under the direction of the Master Data Manager, day-to-day activities and priorities are based on collaboration with the Supply Chain leaders. These include: Function as the primary point of contact related to the day-to-day execution of MDM related tasks. They will work to answer questions, resolve data issues and provide analysis.Assists in developing and maintaining requirements/specifications for new or enhanced functionality to department operational reports.Collaborates with ITS in managing the resolution of problems and implementation of changes to the department's information systems.Perform master data additions, changes and deletions in accordance with procedures and business rules.Ensure requests for master data maintenance are properly authorized and approved by working with appropriate Data Managers and Data Owners.Educate users on master data processes and business rules.Evaluates business and program application systems' functionality to identify gaps, measuring the solution impact to business operations. The MDMA serves as a liaison between the business managers and ITS to improve productivity and developing and delivering improved data quality and analytics.Maintains system applications for key stakeholders under general direction of the Data Manager and with guidance from Lawson team.Filter and cleanse data, review reports and performance indicators to location and correct data and processes where needed.Runs ad hoc and scheduled reports and collects feedback from customers on creating new reports.Maintains accurate and up to date price file management in accordance with current contracts.Performs proactive and ad hoc price performance benchmarking.Supports vendor and recall management by ensuring data accuracy and adherence to industry and/or regulatory standards.Supports Non-Labor expense reduction initiatives through comprehensive Item Master and PAR data management, and directed reports to Logistics Managers.Under direction of the Purchasing manager, designs and maintains organized system for Pricing Agreements and ensures the accuracy of prices in item file and on POs. Partners with Accounts Payable to ensure accuracy of vendor file.Conducts quality control activities and recommends and/or implements additions/changes to Master Data Management policies and procedures.Monitors key performance indicators to ensure data accuracy and data management policies are working as expected.Develop and design improvements to the processes, procedures, tools, rules and metrics to ensure data integrity of master data domains. Performs other related and incidental duties as needed or assigned.  Equal Opportunity Employer Stanford Health Care (SHC) strongly values diversity and is committed to equal opportunity and non-discrimination in all of its policies and practices, including the area of employment. Accordingly, SHC does not discriminate against any person on the basis of race, color, sex, sexual orientation or gender identity and/or expression, religion, age, national or ethnic origin, political beliefs, marital status, medical condition, genetic information, veteran status, or disability, or the perception of any of the above. People of all genders, members of all racial and ethnic groups, people with disabilities, and veterans are encouraged to apply. Qualified applicants with criminal convictions will be considered after an individualized assessment of the conviction and the job requirements.  National recognition in 13 specialties. Watch our stories  \"We have a culture of patient care first here, one that speaks to our mission and our values: to care, to educate, and to discover.\"Brian L.Unit EducatorBSN, CMS RNDid you know? 196 Stanford Health Care uses 196 solar panels, powering 17% of the hospital's electricity. 17 In 2015, we had 17 dogs in our Pet Assisted Wellness (PAWS) Program. 8 We're proud to work with 8 All-time Stanford Medicine Nobel Laureates. 1,592 Stanford Health Care exhibits more than 1,592 original art pieces. QualificationsFour (4) years of progressively responsible and directly related work experience, preferably in a hospital environment.Demonstrated ability to cleanse, analyze and connect data from multiple sources.Understanding of Master Data Management principles and practices in an enterprise environment.Demonstrated experience with Infor Lawson Supply Chain Management. License/Certification: None required.  Any combination of education and experience that would likely provide the required knowledge, skills and abilities as well as possession of any required licenses or certifications is qualifying.  Knowledge, Skills, and Abilities  These are the observable and measurable attributes and skills required to perform successfully the essential functions of the job and are generally demonstrated through qualifying experience, education, or licensure/certification.  Ability to be sensitive to the needs of customers through the practice of quality service principles  Ability to communicate effectively, both orally and in writing, to persuade internal and external stakeholders  Ability to develop long-range business plans and strategies  Ability to manage complex relationships with critical vendor partners  Ability to strategize, plan and implement change  Ability to understand, draft and negotiate Contractual Agreements and Pricing Agreements  Ability to work effectively both as a team player and leader  Knowledge and understanding of financial and statistical activity reports  Knowledge of automated materials management functions  Knowledge of basic legal principles  Knowledge of project management processes and systems"}