{"jobID": "2837558992", "jobLocation": "Garden_Grove_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.voxxanalytics.com", "Headquarters": "Garden Grove, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analyst & Cataloger, Digital Content Specialist  Part-Time Document Data Analyst/Cataloger to catalog physical and digital documents in English and Foreign Languages  Key Areas of Responsibility: Review, analyze, and catalog a variety of pharmaceutical communications including videos, pdfs and foreign language documents. Able to process 7-8 documents an hour, including time to prepare documents for processingEnsure non-subjective cataloged fields and quality of documents is maintained at 95% accuracy ratioTrack output using Excel, exporting completed files and folders within 2 days of receiving from GoogleDrive or OfficeResearch drug and company data as needed. Maintain database quality control. Work with a team of catalogers to ensure highest priority documents are worked on firstWork closely with Quality Control Team Supervisor to continuously improve overall accuracy, speed,and expand the types of content catalogedReport to manager for additional guidance in decision making and internal supportJob Requirements:Comprehensive knowledge of Windows 10, Microsoft Office SuiteCapable of using services on the cloud: One Drive, Google DriveUse proprietary database management site to catalog documentsRequired to research medical terms and match results with internal naming criteriaOpen communication with management and peers to resolve potential issues in pipelineMust respond to all emails requesting a response within the first two hours of resuming workMust be available via email during work hours, and maintain consistent hoursAbility to work with documents in foreign languages (Italian, French, Spanish, German) a plus Hours, Compensation, location of work:Part-time (20-32 hrs per week)$13 an hourFlexible hours in officeJob Type: Part-time  Salary: $13.00 to $14.00 /hour"}