{"jobID": "2608591024", "jobLocation": "Santa_Clara_CA", "jobTitle": "Supply Chain Data Scientist/Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "94000", "jobDescription": "Supply Chain Data Scientist/Analyst Job Number: 113316195Santa Clara Valley, California, United StatesPosted: Jun. 7, 2018Weekly Hours: 40.00 Job SummaryWe are looking for a dynamic and motivated candidate for our AppleCare Demand Forecasting and Operations Research Team. In this role, you will be able to utilize your technical, analytical, and project management skills to deliver solid statistical forecasts, develop planning tools, improve data visibility and provide insightful analysis.  You will be equally comfortable working with cross-functional teams and using analytics to improve forecasting methods. You will also be required to analyze large amounts of data, identify significant trends, and adjust to meet an ever-evolving demand landscape. In addition, you are a creative problem solver is who is passionate about building, maintaining, and driving innovative solutions to deliver extraordinary customer service.Key Qualifications Knowledge of SQL, VBA, SAS, and Python requiredExperience building and maintaining reports in Tableau preferredExperience in developing SQL database UI and database management a plusSAP APO and/or Demantra experience a plusKnowledge of the principles of statistics and experience performing statistical analysis in a business environmentEffectively communicate data analysis and forecast impacts to a broad audience of AppleCare internal customersExtensive experience in analyzing large data sets and conducting ad hoc analysisAdept at merging data from a variety of sources in order to generate conclusions through analysisAptitude for blending quantitative and qualitative dataExperience in forecasting, supply chain planning, logistics and service operations a plusAbility to track and lead new and ongoing project activitiesAble to work efficiently under time constraints and effectively prioritize workComfortable with making decisions in an ambiguous environmentProven process improvement skills with a natural curiosity and desire to understand how things workExcellent communication skills - both verbal & writtenIndependent self-starter who can manage multiple priorities in a rapidly changing environment Description- Understand service supply chain to develop, maintain and improve demand forecasting tools developed from VBA/SAS/Python/MySQL, that can perform in an ever-changing business landscape Maintain statistical forecasts in supply chain planning tools, such as SAP APO and DemantraWork very closely with Demand Planners with the purpose of sharing insights and making decisions on how to best to adjust forecastsSupport Channel Service Planning Supply Planners by providing short term part/ship to level forecasts for distribution of inventoryWork with Apple Logistics teams to develop forecasts that support the transport of service parts around the worldMaintain and develop new Tableau reports to drive metrics and forecast visibilityEffectively and promptly communicate changes to model inputs and outputs that have significant relevance to business operationsPerform ad-hoc statistical analysis to investigate forecast variances and propose forecasting solutionsConduct requirements development and user acceptance testing for enhancements to enterprise tools/modelsServe as point-of-contact between business and IT for reporting and data systems issuesDevelop and maintain process and technical documentationPlay a leadership role in the standardization of deliverables; ensure adherence to commitmentsEducationRequires BS degree, 3-5 years in a service, manufacturing or logistics operation or equivalent. MS/MBA or PhD in Supply Chain or Operations is a plus"}