{"jobID": "2781053384", "jobLocation": "Palo_Alto_CA", "jobTitle": "Sr. Data Scientist / Machine Learning, Statistics, Coding", "companyRating": null, "companyInfo": {"Website": "www.mindstronghealth.com", "Headquarters": "Palo Alto, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Who is Mindstrong?  We are a passionate and entrepreneurial team of people with unrivaled experience and background in science, technology and healthcare.  Our mission is to transform brain health through measurement science.  Brain health is fundamental to our mental health and overall health. Mindstrong has developed and validated the first ever passive, continuous measures of brain function using patterns generated from touchscreen interactions like swipes and taps on your smartphone. These data reflect the way your brain processes and responds to the world around you. Mindstrongs technology does not rely on any content, such as what's typed, voice calls, locations, passwords, or other personal information.  While weight, blood glucose or blood pressure are familiar objective measures of diabetes and heart disease, progress in mental health has been limited by the lack of similar objective and ecological measures. Mindstrongs scientifically validated digital biomarkers of brain function are objective, ecological and proving essential in detecting and managing mental illness early when interventions are most effective and in achieving long-term good mental health.  We are looking for people who are passionate about our mission, committed to excellence and excited to build a company that will address one of the greatest health challenges of our time.  What you'll be doing: Become an expert in building healthcare critical deep-learning applications that re-map brain circuits from human-computer interaction patternsCreate highly scalable and adaptive online/streaming learning algorithms that impact the lives of millions of people dailyWork with a high-performance engineering team to deploy these applications in a highly scalable and distributed infrastructureAnd you will feel good about your work knowing that what you do will affect the lives of millions of people around the world Who you are: You feel good about your work knowing that what you do will affect the lives of millions of people around the worldEntrepreneurial and eager to thrive in a startup environmentStrong communicator (oral and written)A good person, highly ethical and accepting of others Your background and skills: An amazing developer; technical challenges of all types excite youInterested in contributing your opinions and perspective to help the team solve the challenges that our users facePossess extensive end-to-end project experience using machine learning or deep learning to solve complex real-world problems. This includes feature selection, dimensionality reduction, algorithm development, cross-validationHave a proven track record of delivering concrete implementations on tight schedulesHave extensive experience using Python/R, TensorFlow & Keras/Torch, Spark and the AWS stack (S3, SQL, Mongo, Redshift)PhD (preferred) or MS in statistics, computer science or related mathematical disciplines with an emphasis on both theoretical analysis and algorithmic implementationMinimum 5 years of experience developing both statistical and machine learning models with at least 3 years in the industry, i.e. shipping product! Join us us in our journey to transform the future of brain health! "}