{"jobID": "2698496946", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Quality and Governance Analyst", "companyRating": null, "companyInfo": {"Website": "www.sword-insurance.com", "Headquarters": "Boston, MA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Title : Data Quality and Governance Analyst  Location : Los Angeles, CA  Duration : 12-18+ Months Contract  Looking for a Data Quality and Governance Analyst to help in all areas of data integrity and proper data management. This role acts to analyze, identify, and coordinate correction of data quality issues and facilitate the creation of and monitor adherence to data quality and data governance standards  Youll be the human face of data quality and governance making a daily difference in the confidence of business decisions and elevating the customer experience. This position is part of the Data Quality and Governance Team and the ideal candidate will have a proven passion for data quality and driving continuous improvement. Key Responsibilities:Develop excellent working relationship across data science, analytics, development and business stakeholders to build data governance and resolve data questions / issuesEstablish processes and standards to improve data governance and data quality across the organizationProactively identify potential data issues and downstream impact of system changesTrack all data governance and data quality issues, resolutions, and consistently publish their status to stakeholdersBuild top of the funnel data checks to prevent data firesDefine and report data quality metricsPerform data quality audits to find inconsistent data, incomplete data, rule violationsPerform data profiling using visualization and SQL to validate dataDrive continuous improvement efforts to streamline all data processesMust Have:Informatica or Collibra experienceExperience with Master Data and Reference DataExperience with Data Governance"}