{"jobID": "2616537075", "jobLocation": "El_Segundo_CA", "jobTitle": "Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.beyondmeat.com", "Headquarters": "El Segundo, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Scientist Los Angeles, California Company Description At Beyond Meat, we  started with two simple questions: why do you need an animal to create meat and  why can't you build meat directly from plants? It turns out you can...so we  did! We make plant based meats that allow families to eat more, not less, of  the traditional dishes they love, while feeling great about the health,  sustainability, and animal welfare benefits of plant protein. Our goal is to  bring exciting change to the plate and BEYOND! Position Description This is a full-time  position reporting to the Director of Research and Development. The Research Scientist  will use scientific principles and expertise, and a broad range of advanced  technologies and industrial tools for achieving company goals. This successful,  self-motivated, creative, team-oriented, resourceful, adaptable, and  results-oriented individual will lead in their area of expertise to create and  characterize macromolecular interactions with a specific emphasis on the chemistry,  protein interactions, and solvation properties of plant yeast, bacterial and  algal components. The Scientist will have a keen understanding and extensive  hands-on experience with the ability to think beyond standard methods,  independently lead and reach conclusions, and clearly deliver results within a  matrixed organization. Key Responsibilities Support R&D; team in attaining short-term and long-term development  goals. Adapt to evolving scientific  priorities.  Leverage internal and external technology  capabilities to develop products that match or exceed consumer needs and  provide significant competitive advantage.  Utilize core research capabilities and know-how to develop new products and  improve existing products  Develop product prototypes on the bench, conduct pilot and commercial scale  trials, establish data and make technical case for product feasibility  Actively support the innovation stage gate process: brain storming and ideation  sessions, concept development, concept screening, feasibility and  commercialization  Build cross-functional support when appropriate and develop project plans to  drive development and implementation  Continuously search for and vet advanced technologies that complement areas of  strategic focus  Advise company officers in areas of scientific and process development  expertise.  Provide written and verbal reports of research activities. Participate in  R&D; and larger company meetings.  Preserve all forms of intellectual and material property generated from  the above activities, including: writing patents, writing protocols for novel  processes.  Coordinate with vendors and CMOs for supply of plant and microbial ingredients.  Oversee or conduct product formulations and analyses, reagent preparations,  cell fractionation, gel electrophoresis, homogenization, sonication,  dehydration, etc.  Provide general laboratory support, purchase equipment and supplies, and  share in kitchen and laboratory maintenance.  Maintain a safe working environment. Qualifications Ph.D. degree in  Chemistry, Organic Chemistry, Biochemistry, Protein Chemistry, Polymer  Chemistry, Biophysics or Molecular Biology.  Minimum 5-year experience in academic or industrial research. Experience in food company ingredient and  product development desirable but not required.  Prior  experience with analytical chemistry, physical chemistry, protein chemistry, organic  chemistry and/or reaction chemistry preferred.  Understanding  of food product chemistry, analytical testing, formulation and processes used  in food manufacturing desirable but not required.  Proven ability to combine  scientific insight with strong technical skills and business acumen  Experience working in a matrix and highly collaborative team orientated  environment  Excellent oral and written communication skills. Fluent in English, both written and spoken.  Ability to manage multiple projects and priorities  Excellent analytical, organizational and multi-tasking skills, as well as the  ability to interact and collaborate successfully with all levels and functional  areas Physical Demands: Frequent sitting at a desk, communication-using  computer and phone. Work Environment: Laboratory, office and kitchen environments with some  travel (10%).  Bottom of Form  Bottom of Form"}