{"jobID": "2781010638", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Instrument Cluster Software Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.gogtech.com", "Headquarters": "Dearborn, MI", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Contract", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Strategic Staffing Solutions, Aerotek, KellyMitchell Group"}, "estimatedSalary": null, "jobDescription": "The Instrument Cluster Software Modeling Engineer is responsible for building model application software with behavior functionality in Statemate /Stateflow and Altia.These feature models will of consist of regular customer behavior functionality and the subsystem interface.The Engineer will design and develop models by understanding the system, Human Machine Interface (HMI), and graphical requirements.Work as part of the modeling team and independently to design feature steering wheel controls, which support a variety of platforms.Work very closely with requirement engineering, component engineering and validation engineering to meet software release time-lines and project milestones.Bachelor of Science in Electrical Engineering, Mechanical Engineering or equivalent from an ABET accredited university.MathWorks experience (Simulink/Stateflow)Experience in Statemate/Stateflow. Experience in C, C++ and MS Visual StudioEE systems knowledge.Two years of experience with Statemate/Stateflow or embedded software engineering.Five Years of experience in automotive and modeling embedded software engineering.Good written and oral communicationPreferred QualificationsAltia and HMI design experience.Experience in Autosar. Strong technical problem solving skills.CMMI /Autospice experience. Multiple language skills. Software in Loop (SIL)/ Model in Loop (MIL) experienceTravelWILL be required to drive a company car. Valid Driver's license and clear driving record.MUST be required to travel, domestically and internationally (0-20%). G-TECH Services, Inc. is a leading certified recruitment and placement firm that specializes in providing highly skilled staff in technical fields such as engineering, IT, procurement, finance and accounting. We have well-established relationships with some of the most respected companies in the country and know our clients’ job requirements and corporate cultures. Once we understand your experience and career aspirations, we aim to connect you with the right opportunity.  At G-TECH, we embrace a personalized approach to professional staffing, recognizing the important link between employee and employer satisfaction. We work tirelessly to connect qualified job seekers with positions that align with their career goals, skillsets and personalities. Upon placement, we support our employees throughout the duration of their assignments, providing them with a direct point of contact who serves as a dedicated advocate and sounding board. As our employees can attest, this approach is consistently effective in bettering the contract employment experience.  At G-TECH, our mission is simple: we are dedicated to connecting great people with great places to work."}