{"jobID": "2837709319", "jobLocation": "Rahway_NJ", "jobTitle": "Principal Scientist/Health - Mathematical Modeling - Infectious Disease", "companyRating": "3.7", "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "260000", "jobDescription": " We are seeking Research Scientists in Infectious Disease Modeling to join our growing team of vaccine modelers and health economists at Merck. Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Responsibilities:  Principal Scientist provides strategic development and use of cutting-edge mathematical and economic models to enhance understanding of vaccines and infectious diseases, to quantify, and to communicate the value of Merck’s vaccines to patients, providers, payers, and policy makers. The scientist provides strategic and technical leadership using model-based scientific and business insights across all phases of drug and vaccine development. In addition, she/he serves as the Economic & Data Sciences (EDS) lead for one or more value evidence teams responsible for generation of evidence, including development of health economic, disease, and other mathematical models to enable business and scientific insights for the product.  Qualifications  Education Minimum Requirement:  Masters in a quantitatively-oriented discipline such as mathematical epidemiology or applied mathematics  PhD (preferred)  Required Experience and Skills**:  Experience in the design and analysis of mathematical models of infectious diseases and vaccination, including developing and analyzing stochastic and deterministic models, programming simulations and numerical analysis and analyzing data.  Experience in the design and development of modeling approaches to enable internal and external decisions.  Excellent organizational and communication skills (oral and written)  Ability to work independently and effectively interact with a broad group of stakeholders  Ability to balance multiple priorities, meet deadlines, and work under pressure  Strong record of research publications in peer-reviewed journals  Preferred Experience and Skills:  Economic evaluation and cost-effectiveness analysis.  Extensive experience in scientific computing and programming with software such as Matlab, Mathematica, C++, or Python."}