{"jobID": "2804412397", "jobLocation": "Jackson_MI", "jobTitle": "Customer Service Representative", "companyRating": "3.6", "companyInfo": {"Website": "www.chemetallamericas.com", "Headquarters": "New Providence, NJ", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Henkel, DuBois Chemicals, Fuchs Lubricants"}, "estimatedSalary": "17", "jobDescription": " Customer Service Representative Location  Jackson, MIApply NowDescription  A chemical structure is only as strong as the bonds between the molecules. At Chemetall, the strength of the bonds lies not just in the chemicals but is also mirrored in the links forged between the global companies and employees of the Chemetall world.  We are a company with highly qualified talent, who give their contribution each and every day across the different sectors to make the Chemetall difference. We demonstrate uncompromising ethics and appreciation for our employees, as well as respect for the environment. Chemetall is a leading specialty chemical company whose quality, innovation, and service exceed the expectations of our customers.  Where the Chemistry Happens…  The Customer Service Representative ensures that we meet or exceed Chemetall's commitments to our customers through efficient order management, effective and pro-active communication of information, and the prompt resolution of customer issues. By providing these services, Customer Service supports the businesses, and help them to attain their goals.  Formula for success: You will… Daily Activities Receive new orders by email and record them on SAPConfirm inventory availability / safety stocksInvoicing on SAP & Government invoiceTake calls from Customers and Sales Rep.Re-invoicing (when needed)Follow up back-ordersConstant communication with Production / Purchasing / LogisticsOthers Create / Update new CustomersCreate / Update Prices by Customer & MaterialGenerate Credit / Debit notes – both on SAP and Government documentsHandle returns of materialsMonthly Activities Monthly Closure: Make sure that every shipped order is invoiced on SAP & Government invoice Ingredients for success: What we look for in you… Basic Accounting (Sales Process),Microsoft Office (Excel) – IntermediateSAP – Preferred but not necessary,Experience at Customer Service or similar positionWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, age, citizenship, color, religion, sex, marital status, national origin, disability status, gender identity or expression, protected veteran status, or any other characteristic protected by law."}