{"jobID": "2824915152", "jobLocation": "Emeryville_CA", "jobTitle": "Maintenance Technician", "companyRating": null, "companyInfo": {"Website": "www.aveliving.com", "Headquarters": "Plymouth Meeting, PA", "Size": "201 to 500 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a team player that is a hands-on technician and thrives on a fast-paced and diversified operation.  Job DescriptionAVE is experiencing rapid growth with acquisitions and new constructions in Northern New Jersey, the Greater Philadelphia Area and the East Bay Area of California. We are looking for A+ players who want to grow with us.  An AVE community is not your typical rental community. We specialize in flexible-stay accommodations that offer a unique lifestyle for business travelers, chic renters, and those whose life is in transition. We offer fully furnished corporate suites and unfurnished rental residences with unparalleled business and resort amenities and Resident Services.  AVE by Korman Communities is currently seeking an experienced Maintenance Technician for our flexible-stay community.  We are looking for a team player that is a hands-on technician and thrives on a fast-paced and diversified operation. This important team member must approach the property and business on a daily basis with a professional and positive attitude at all times.  AVE is owned and operated by Korman Communities. The Korman family has been breaking barriers in the apartment industry since it pioneered the furnished apartment in the United States at The Plaza in Philadelphia in the 1960s. Our brand has a solid reputation of creativity, integrity, market savvy and proven performance in the real estate and investment arenas.Job Requirements 2-3 years of maintenance, construction, or related experienceGeneral Maintenance Skills: plumbing, electric, carpentry, and appliance repairsStrong ability to take direction and be a team playerHigh level of self-motivationStrong ability to prioritize and multitaskHVAC Certified is a plus The required schedule for this full-time role is Monday - Friday 8:00am to 4:30pm with an on-call rotation and snow removal assistance when needed during the winter months. We offer competitive compensation, plus bonus, a full benefits package, and a 401k plan.Company CultureAVE is a division of Korman Communities. For more than 100 years, our fourth-generation, family-owned-and-operated company has been providing seamless living, exceptional service, and unparalleled amenities at our sophisticated communities. We recognize our most important asset is our team members.  We recognize our most important asset is our team members. We provide the opportunity to achieve success and excel within our continuously expanding company. We commit to team members who embrace our values and promote our reputation for excellence.The Perks Competitive compensation plus incentive packageA fun, positive work environmentGrowth opportunities. We're growing and you'll grow with us, if you prove to be a valuable member of our team."}