{"jobID": "2648481930", "jobLocation": "Fort_Meade_MD", "jobTitle": "Computer Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.threatconnect.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": "Company Description ThreatConnect® arms organizations with a powerful defense against cyber threats and the confidence to make strategic business decisions. Founded in 2011, ThreatConnect (then called CyberSquared) started servicing government agencies on specialized cybersecurity contracts while building its platform. Officially launched in 2013, the ThreatConnect Platform has grown to more than 20,000 users worldwide. Today, ThreatConnect provides a suite of products designed to meet the threat intelligence aggregation, analysis and automation needs of security teams at any maturity level - built on the industry's only intelligence-driven, extensible security platform. Whether you want to work on building a world-class security platform or as a member of the services team, you will enjoy a career that truly makes an impact. For more information on the benefits of working at ThreatConnect, visit www.threatconnect.com/careers Job Description ThreatConnect is looking for highly motivated and experienced analysts with currently active U.S. Government Top Secret security clearances to fill positions on government contracts within the DC/NoVA/MD region. If you are sought after as an expert in your field and looking for a company that will both value and reward your expertise, take a look at what ThreatConnect has to offer. Requirements This position requires knowledge and skills in CNO, network analysis, vulnerability assessment, DNI tools and target discovery, and experience working in Windows and UNIX environments. Applicant should be able to provide mentoring on SIGDEV processes and access development to clients. Applicant should have the ability to analyze network system capabilities and identify vulnerabilities.  The candidate should have a solid background in several of the following: Network applicationsStrong writing and verbal skillsNetworking protocolsWorking knowledge of TCP/IP networksLog and packet-level tool experienceNetwork attack techniquesOperating system platforms (e.g. UNIX, Linux, Microsoft Windows)Network intrusion analysis and incident response  Clearance required: TS/SCI with favorable polygraph Benefits We work hard to reward our employees for their hard work. We offer a competitive benefits package with comprehensive insurance coverage, paid time off, and unique perks designed to help you meet your financial and personal goals.  We are committed to offering an employment experience and benefits package that enables you and your family to grow with us and to share in our success. We love to recognize our employees who have gone above and beyond, and offer incentives like quarterly awards, an employee bonus and referral program, and team-building outings. MEDICAL Full-time employees are eligible for health coverage effective from the first of the next month hired. The premiums are at no cost to the employee. We pay your premiums for individuals and families!  - Medical coverage  - Prescription drug coverage  - Dental coverage  - Vision coverage  - Company-paid short-term and long-term disability  - Company-paid life insurance and AD&D; coverage FINANCIAL 401K retirement savings plan with company matching program of up to 6%.  Cell phone reimbursement WORK-LIFE BALANCE - 10 Paid Federal Holidays  - Accrued Paid Time Off (PTO) for vacation/sick time and holidays. 15 days (3 weeks) for new employees with the ability to accrue up to 25 days (5 weeks)  - Birthday day off  - Employee recognition program with quarterly awards  - Employee referral program of up to $5,000 per full-time hired referral  - Education Reimbursement program up to $5,250 for job-related college courses and professional training  - Company-provided refreshments at our Headquarters  - Quarterly events with your geographic team  - Annual company party"}