{"jobID": "2822780988", "jobLocation": "McLean_VA", "jobTitle": "Data Visualization Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "115000", "jobDescription": " McLean 1 (19050), United States of America, McLean, Virginia  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Data Visualization Data Scientist  At Capital One, data is at the center of everything we do. When we were a small startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and relational databases -- cutting edge technology in 1988! Fast-forward a few years, and that little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.  On the Enterprise Modeling Risk Team, youll be part of a group applying existing techniques to new challenges related to using machine learning in an enterprise environment. Our small team has an outsized impact because we focus not just on solving tough customer-facing issues or machine learning challenges, but on building reusable components, like shared software libraries, training modules, and enabling tools and platforms.  As a Data Visualization Data Scientist on our team, youll have an opportunity to leverage the latest visualization frameworks, libraries, tools and techniques to bring new levels of insights to our Model Developers, Executives and 2nd and 3rd lines of defense. On any given day youll be:Developing a meaningful, extensible design language that succinctly communicates complex interactions and experiencesBuilding static, dynamic, or interactive visualizations and data-driven products that communicate the patterns of machine learning dependenciesBuilding a working knowledge of a domain and abstracting the relevant tasks, and encoding information in appropriate visual formsBuilding visual representations that help people carry out analytic and decision-making tasks more effectivelyExploring and evaluating the next generation of tools and techniques that help us move faster, tell richer stories, and make complex things a bit simplerLeading our analysts into the new wave of visualization technologies by sharing and building inspirational examplesSharing demos of your latest work with executives, peers, and curious onlookers inside and outside Capital One Twenty-five years after Capital One was started its still led by its founder. Be ready to join a community of the smartest folks youve ever met, who see the customer first, show utmost respect toward one another, and want to use their data skills to make a difference. Ideal Qualifications:Curious. You ask why, you explore, you're not afraid to blurt out your crazy idea. You probably have an incredible list of credentials and an impressive GPA, or perhaps you dropped out of college, taught yourself and are an open source contributor.Wrangler. You know how to move data around, from a database or an API, parsing and cleaning it as needed, and have a suite of techniques you could use to render it in a useful, visual way. You probably know Python, Java, and Processing, or think every problem can be solved in Javascript.Experimenter. You have a bias toward action, you try things, and sometimes you fail. Expect to tell us what youve shipped and whats flopped.Fearless. Big, undefined problems and petabytes don't frighten you. You can work at a tiny crack until you've broken open the whole nut.Basic Qualifications:PhDAt least 1 year of experience with Python, JavaScript or C++At least 1 year of experience contributing to statistical visualization librariesAt least 1 year of experience working with data streamsPreferred Qualifications: 2+ years experience in open source programming languages appropriate for large scale visualization of numerical and textual data2+ years experience contributing to statistical visualization libraries2+ years experience working with data streams Capital One will consider sponsoring a new qualified applicant for employment authorization for this position.  TBLI"}