{"jobID": "2798622505", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst II - Projects", "companyRating": "3.3", "companyInfo": {"Website": "www.capmetro.org", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Government", "Industry": " Travel & Tourism", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Job Details Posting Date 06/01/2018Closing DateOpen Until Filled YesJob Title Data Analyst II - ProjectsType of Job Budgeted or Approved AdditionWork Hours Day ShiftJob SummaryThe Data Analyst reports directly to the Manager, Service Analysis and will also work directly with the scheduling and service planning areas of the Planning department. This position is responsible for the technical database management and maintenance functions in support of the collection and compilation of data used to support strategic planning functions including synthesizing and analyzing data from multiple sources. Assist in performing analytical service planning, development tasks, and projects. Develop macros, modules and/or queries in support of the data analysis functions. This role also develops and maintains critical spreadsheets and data sets. The Data Analyst will be an inquisitive, self-starter who will engage staff across the agency to identify potential problems and propose solutions.Primary Responsibilities• Perform database management functions including the maintenance of departmental relational databases for ridership data, service data, and field collection data. Perform statistical and trend analyses. Isolates, determines, and reports operational and performance problems and concerns based upon these analyses; recommends changes as appropriate.Develop macros and modules as directed.Create, automate and generate database and management reports from fare box, Intelligent Transportation System (ITS) and other departmental and agency-wide databases.Analyze data for accuracy and integrity. Determine where inaccuracies or exceptions require rejection and/or re-collection of data, and reschedule collections as needed.Analyze data exception reports and identify discrepancies and implement corrective actions.Perform data extraction and run scripts as needed.Monitor data feeds.Assist in developing and designing departmental databases.Evaluate departmental data and generate reports, graphs, forecasts, and trend analysis to assist in planning endeavors.Provide critical information to support regular evaluation of Capital Metro services, including data collection, data retrieval, data analysis, and preparation of reports.Provide administrative and technical support to the Strategic Planning department.Review data collection/input procedures, identify validity issues, and recommend solutions to ensure integrity of data. Confer with persons originating, handling, entering, or receiving data to identify problems and resolve issues and/or errors prior to advancing information to various departments.Develop reporting tools as requests for new reporting requirements are implemented.Respond to ad-hoc requests for relevant planning or service data as needed for internal and external customers.Respond to requests for relevant planning or service data as needed for internal and external customers, including user interviews, assessment of needs, and recommendation of solutions.Assist in developing new advanced data collection technologies such as fare boxes and Data Integration.Assist in various project management functions.Perform related duties as required and/or assigned.Minimum Qualifications-Education and Experience• Bachelor’s degree in Business, Economics, Statistics or a similar field. Related experience may substitute on a year-for-year basis."}