{"jobID": "2783105599", "jobLocation": "Washington_DC", "jobTitle": "Data Operations Analyst 2/3", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Northrop Grumman Technology Services sector is seeking highly skilled XML Data Management Analyst 2/3 to join our team of qualified, diverse individuals in defining the future.  This job will be located at a client site in Washington, DC. The site is near Dupont Circle, Foggy Bottom and Georgetown and will be supporting mission-critical systems to meet important new regulatory requirements.  The ideal candidates will have a working knowledge of XML, XSD, and XML schemas, as well as knowledge of data modeling, standards conformity assessment, standards development organizations, scripting languages, and Microsoft Excel. Job Responsibilities include one or more of the following:Verify and validate data loadsRequest data from reporting entitiesand process submissions as required and validate and enter the data into thecustomer environmentConduct data quality reviews for Public ReportsEstablish and maintain data access for usersConduct reporting entity audits on reporting, data quality and standardsRespond to electronic requests for assistance with data reporting requirements and submission errors. Manage supported electronic mailboxesand portalsand respond to requests for assistanceParticipate in UAT of various data loading and management console related effortsManage reference dataensuring that diverse data sets can be collected, transmitted and stored in a secure manner, integrated/processed, labelled/stored, and retrieved for use by staff This requisition may be filled at a higher grade based on qualifications listed below This requisition may be filled at either a level 2 or a level 3Basic Qualifications for a level 2 are:Knowledge of and experience with XML and XML SchemasBachelor's Degree and 3 years of related experience OR Master's Degree and 1 year of related experience, an additional 4 years of related experience can be substituted in lieu of degreeAbility to obtain a Position of Public Trust Designation security clearance, U.S. Citizenship or Permanent Resident Status requiredBasic Qualifications for a level 3 are:Knowledge of and experience with XML and XML SchemasBachelor's Degree and 6 years of related experience OR Master's Degree and 4 years of related experience, an additional 4 years of related experience can be substituted in lieu of degreeAbility to obtain a Position of Public Trust Designation security clearance, U.S. Citizenship or Permanent Resident Status requiredPreferred Qualifications:Knowledge of and job experience with:data modeling, standards conformity assessment, standards development organizations, scripting languages, and Microsoft Excel Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}