{"jobID": "2656437804", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lifeenergy.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " LifeEnergy is a distributed energy company that provides retail electricity, natural gas, and solar to residential homeowners and commercial businesses in the United States. LifeEnergy is part of LS Power, one of the leading independent owners and developers of power plants and transmission infrastructure in the U.S. At LifeEnergy we are rapidly growing into a national branded, full-services energy company. To support our continued growth plan, we are looking for a skilled data analyst to join our team and drive sales strategy and execution excellence. Title Data AnalystCity HoustonState TexasPosition Description The Data Analyst will support internal stakeholders with actionable, efficient and timely reporting and analysis to drive performance goals. The individual will provide feedback, insight, and direction to support marketing and sales personnel. Primary responsibilities include researching, documenting, analyzing, designing, and implementing analytics and reporting solutions; business intelligence systems administration; market research and supporting the pricing and product process. The Data Analyst needs to have the utmost integrity, with the ability to work independently and as a team. Reporting Relationship The individual will report to the Director, Marketing and Digital Sales. Responsibilities to include:Work with quantitative data to create business and performance reporting, both routine and ad-hoc, to provide insight and actionable recommendations to managementCompile information from large and multiple data sets and perform analysis to provide timely and accurate business, market, and customer information to supports business development and decision making via narratives, graphics, charts, tables, and statistical/analytical reports.Gather data and research as required in support of sales and marketing initiativesBe responsible for all competitive intelligence and market trend data gathering and reporting. Track competitor activities and trends reporting significant activity to management.Continuously develop more efficient, effective, and automated processes.Present findings and recommendations clearly and conciselyBe customer-centric, providing Voice-Of- The-Customer information to the marketing team to assist in developing products and communications that better speak to the customer.Establish and maintain cross function relationships with internal departments (IT, HR, Operations, etc.).Keep Business leaders updated on the status of possible risks, identified issues, and analyses being worked.Assist in pricing/product creation and updates, including research, executing on strategy, and ensuring pricing is up-to-date and relevant to all partnersQualifications RequiredBachelor’s Degree in in Marketing, Advertising, Statistics, Mathematics, Data and Analytics, or similar field.3-5 years’ experience in Data Analysis.Experience marketing analytics, statistics, paid search, and data analysisMust have experience with web analytics platforms, especially Google Analytics.Experienced in using A/B and multivariate testing strategiesDeep understanding of digital performance metrics, both organic and paidExpert level knowledge of using excel for vlookups, graphs, formulas, pivot tables, etcStrong analytical, research and market analysis skillsStrong data-driven marketing mindsetExperience with SEM/Paid Search, Social Media, Display/Digital Media1-3 years’ experience within the deregulated retailer energy industry is preferred.Some understanding of pricing, product benefits, customer insight, marketing analysis, and regulatory requirements is desirable.Must be a US Citizen, or hold a valid work visa that does not require sponsorship to work full-time in the United States legally.Excellent organizational and time management skills with a sense of personal initiative and the ability to work independently and with a deadline.Excellent verbal and written communication skills and strong knowledge of Microsoft Office tools in a Windows environment.Excellent problem-solving, communications, and analytical skills.Advanced Computer Skills including: Excel (e.g., formulas, pivot tables, graphing, data connections, and automation using macros)PowerPointWordSharePointFamiliarity with the following or related technologies: Microsoft BI, Power BI, and TableauFamiliarity with SQL is a plusGeneral Requirements:Committed to ethics, confidentiality and LifeEnergy core values.Ability to travel 5-10%.Ability to lift 15 pounds.Work in Houston, Texas.Personal Attributes High self-confidence without ego, an individual who can perform in an environment where there are clear accountability and specific metrics, and adapt successfully to a developing culture. Competencies RequiredStrong drive to sell and execute.Motivated by performance.Strong desire to interact with and motivate people.Very strong customer focus.Highly analytical and strong computer aptitude If you are interested in this position, please send your resume to jobs@lifeEnergy.com. No phone, fax or email inquiries from external recruiters or other interested parties, please.  LifeEnergy offers a competitive salary and benefits package. For more information about our products, please visit our website at www.LifeEnergy.com.  LifeEnergy is an Equal Opportunity Employer."}