{"jobID": "2822877548", "jobLocation": "Palo_Alto_CA", "jobTitle": "Organizational Behavior Scientist", "companyRating": null, "companyInfo": {"Website": "www.humanyze.com", "Headquarters": "Boston, MA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Humanyze helps companies make more informed people decisions. Born out of the MIT Media Lab, Humanyze uncovers the hidden patterns of digital and face-to-face communication to quantify the people factor in the workplace. Humanyze is committed to helping teams work better together and has the data and science to prove it.  Humanyze’s world-leading People Analytics Platform delivers advanced insights and is used by top Fortune 500 companies to answer specific business questions around diversity and inclusion, collaboration and delivery, space planning, workload, teamwork and engagement, and regulatory and compliance risk.  We’re looking for an Organizational Behavior Scientist to join our Analytics R&D; Team to work along with data scientists, network theorists, statistical analysts, and computational social scientists. This position will be responsible for doing organizational behavior research to better understand how team communication and space enable performance by combining rich organizational behavior data (mostly collected by Humanyze Badge and Digital Platforms) with demographic and performance data. The researcher will communicate his or her findings not only with the analytics team to inform algorithm design but will also publish them as scientific papers and blog posts.  This is a full-time role based in Palo Alto, CA. Responsibilities:Design and lead research projects to understand organizational behaviors (OB)Conduct experiments and statistical analyses in collaboration with the R&D; teamDiscuss the quantitative findings in light of OB theories in scientific writingsInform analytics and product teams by delivering key findings and reportsPrepare and build clear presentations and visualsJob Requirements:MS or PhD degree in Organizational Behavior, Industrial-Organizational Psychology, or a related fieldScientific publications in management, organization science, HR management, or related fields3+ years of experience in analyzing, displaying, and reporting on quantitative people analytics dataAbility to conduct statistical analysis (e.g. t-tests, ANOVA, regression)Organized and detail orientedStrong team-player: You work well in a multi-disciplinary teamStrong communicator, written and verbal; can effectively synthesize, visualize, and communicate insightsAbility to thrive in a fast-paced startup environmentDesired Skills:Have used social network analysis in past research projectsExperience engaging with enterprise-level customers and stakeholdersFamiliar with advanced quantitative and computational methods such structural equation modeling and agent-based modelingExperience with big data platforms and data analysis softwareWe Offer:Competitive salary and bonusFlexible work environmentFully paid medical, dental and long-term disability insuranceSIMPLE IRA matching3 Weeks of vacation, a holiday week, and 11 other company holidays"}