{"jobID": "2828807057", "jobLocation": "San_Francisco_CA", "jobTitle": "Director Data Sciences Group", "companyRating": "3.2", "companyInfo": {"Website": "www.esurance.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " GEICO, Progressive Insurance, Nationwide"}, "estimatedSalary": "175000", "jobDescription": " Esurance is looking for a Director Data Sciences Group to join a dynamic and award-winning team of individuals who are committed to making insurance smarter, easier, and dare we say- cooler. As part of a growing company that is focused on providing an outstanding customer experience, you’ll have the opportunity to expand your skills and discover your potential.  If you’re looking for a career at a socially conscious company that offers great benefits — including matching 401k and tuition reimbursement — then you may have just found your new home.  Esurance combines the spunk of a startup company with the backing of Allstate (the largest publicly held personal lines insurer in the U.S.) to create a unique, energized, and exciting place to work.  The Data Science Group is a centralized team that is responsible for helping business units make objective decisions using science. The group delivers cutting-edge ML capabilities and in-depth consultative analyses to develop tangible and actionable recommendations that are then implemented in real-time to improve business operations. The Director Data Sciences Group leads and manages the data science group (currently consists of 15 Data Scientists several of them with PhDs & Post Docs). She/he is also the face of the data science team for internal clients and works with key business partners to identify collaboration opportunities, ideates with the business group to develop a point of view on how advanced analytics / Machine Learning can improve status quo and working with the data science team to develop an execution plan. The Director is also responsible for ensuring that we hire the best in class data science team and for fostering an intellectual and collaborative environment. Job Responsibilities:Operates as the internal client’s thought partner Provides in-depth consultative analyses to senior business leadersProvides data mining, pattern and root cause analyses to help business units understand areas of untapped opportunityDevelops business cases and recommendations for innovations to address business opportunitiesProduces ROI models and delivers build vs. buy recommendationsPresents design, analysis, modeling choices and recommendations to CXO level audiences Develop a roadmap to best support business initiatives Collaborate closely with internal business partners and identify opportunities where machine learning can add valueOwns R&D; and maintenance of real-time decision systems maximizing conversion, LTV and alternate revenue streamsFormulates an analytic data-driven approach to address business questionsDesigns technical solutions for decision systems and the development of modeling algorithms to be deployed to productionManages, mentors, and develops the overall team of Data Scientists Challenge the internal data science team on advance analytical conceptsHires, trains, retains and challenges a best-in-class data science and analytics professionalsResponsible for the employment, promotion, associate performance evaluation, training, motivation, counseling/mentoring, and discipline of assigned associatesManages other managers of data science and/or principle data scientistsProven success managing teams of data scientists and leading Machine Learning projectsAbility to foster a team of data scientists who create analytic solutions.Exceptional business acumen, with abilities to develop strategic and tactical recommendations across multiple areas of the business through research and collaboration.Advanced knowledge of data science concepts and experience working with diverse large dataExcellent internal client (including Executive level) and external vendor management skills.Excellent communication skills both oral and written with strong analytical and presentation skills including advanced fluency with Microsoft business applications (Word, Excel).Strong negotiation skills and ability to direct cross functional team members.Strong PowerPoint skillsExperience / Education:Master’s Degree in Statistics, Business Administration, a related field or equivalent education requiredPhD preferred and / or strong consulting background preferred10+ years relevant quantitative and qualitative research and analytics experience.Benefits At Esurance, being committed to our employees is not just something we say, it’s something we do. Our benefits package is designed to help our associates stay healthy, meet their long-term financial goals, and balance the demands of work and personal life. Esurance rewards hard work, dedication, and creativity with competitive salaries and a generous bonus system. We are committed to our employees and we are dedicated to creating a diverse, positive, innovative and team-oriented work environment.  Health & wellness Medical, vision, and dental insuranceLife insurance (company-paid and supplemental)Accidental death and dismemberment coverageWellness coaching and incentivesGroup critical illness coverageAccident indemnity and hospital indemnity plansGroup legal Savings 401(k) plan with annual matching contributionReferral bonusesPerformance-rewarding bonus systemTuition assistance program (up to $5,250 per year)Health savings and flexible spending accountsCommuter benefits Family & Community Adoption assistanceMaternity leaveBuckle Up Baby programPet insurance discountCharitable gift matchingGive Time, Get Time volunteer programEmployee Assistance Program Time off Short-term disabilityLong-term disability (employee-paid option)Paid time off (holidays, vacation, personal choice days)"}