{"jobID": "2837241092", "jobLocation": "San_Diego_CA", "jobTitle": "Sr. Scientist, Translational Cancer Biology", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture. Employer Research and Development Research and Early Development at Employer is organized into 4 key thematic centers, each focused to certain areas of biology. Within each these areas, discovery research, translational research, and early clinical development are integrated into a single team. These thematic centers comprise Protein Homeostasis, Epigenetics, Immuno-Oncology, and Immunology and Inflammatory Disease. Summary/Scope The Translational Development Group in the Protein Homeostasis Thematic Center of Excellence (PH TCoE) is seeking a motivated translational biologist with clinical trial experience and a broad understanding of oncology research and early development. The successful candidate will have a strong foundation in cancer disease biology and a desire to inform early development strategy. The position will require an individual with excellent communication and organizational skills and exceptional scientific acumen to drive translational research in support of early clinical development of novel and innovative agents. As a member of an integrated discovery research and early development team, the successful candidate will work collaboratively with discovery biology and chemistry researchers, computational biologist, and clinicians. Protein Homeostasis at Employer The PH TCoE at Employer is one of the fundamental research and early development engines delivering therapeutics to patients. The group integrates discovery research through translational and early clinical development and focuses on numerous aspects of protein homeostasis including the ubiquitin-proteasome system, protein translation, and RNA processing and stability. This thematic focus allows the group to capitalize on the cutting edge science that underpins the action of the companys most advanced drugs. Our groups commitment to leverage this insight to bring forward new agents in oncology and other disease areas creates a very dynamic, exciting and creative environment that exploits excellent science in biology, biochemistry, structural biology, computational biology and translational development. Responsibilities will include, but are not limited to, the following:Serve as a key contributor to translational science in the context of early-phase clinical trialsParticipate in clinical study teams and provide translational data and interpretation to guide decisionsManage relationships and critically review data from contract labs and academic collaboratorsEvaluate and advise on clinical trial biomarker/exploratory endpoint strategies, collect and analyze patient data to inform clinical developmentDevelop and implement clinically robust biomarker assaysCollaborate with discovery biologists, computational biologists, and clinicians to translate understanding of in vivo drug mechanisms and disease biology into efficient clinical trialsDefine testable hypotheses and recommendations on dose and schedule, combinations, and subsets to optimize efficacy and patient outcomesDesign experiments to test hypotheses from clinical observations in preclinical model systemsAuthor and oversee writing of study reports, patents, assay protocols, and peer-reviewed publications. Presentation of methods, results and conclusions to publishable standardsWork across geographies and scientific domainsDefine data that will increase understanding of drug action and strategies to acquire it Interact with project teams, academic collaborators and contract laboratories to design in vitro and in vivo studies to evaluate drug candidatesPresent work at group meetings, internal forums and scientific conferencesPrerequisites: Ph.D. in Cell Biology, Molecular Biology, Biochemistry or related scientific discipline with at least 6 years of pharmaceutical industry experience. Skills/Knowledge Required:Strong base of biology and drug development knowledge and experienceReal-world clinical trial translational experience and understanding of key challenges and decisions in clinical developmentA strong laboratory cell biology background and skillset including, but not limited to, quantitative PCR, immunofluorescence, omics and manipulation of gene/message/protein via RNAi and/or CRISPR methods is essential.Experience in mammalian cell culture models including primary cell culture required.Ability to interpret and summarize scientific data in an accurate, critical and concise mannerExperience developing clinical-grade assays using flow cytometry, histology, ELISA, and DNA/ RNA methods is a plus.Flexible and adaptable to changing prioritiesExperienced in the integration of preclinical research through to clinical drug developmentHighly effective teamwork and interpersonal skillsExceptional written and verbal communications skills. #LI-POST  BIO-USEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}