{"jobID": "2816308060", "jobLocation": "Midland_TX", "jobTitle": "Senior Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.concho.com", "Headquarters": "Midland, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": " Title  Senior Data Scientist  Location  Midland, TX  Job Summary  Concho is currently seeking a Senior Data Scientist to address challenging scientific & engineering problems across enterprise using machine-learning and data analytics methods. The qualified candidate should have a solid understanding of various modern machine-learning methods and with good experience in clustering, neural networks, reinforcement learning, semi-supervised learning, and signal processing.  The successful candidate will be an accomplished Data Analytics Professional able to collaborate with all business functions to design and implement efficient and robust Data Analytics business solutions. Key focus includes:Identifying technical and business performance gaps, opportunities, and solutions through data, statistics, and technology.Coordinating and providing technical guidance within Business Intelligence and Analytics team to generate best solutions with near/mid/long term goals in mind.Developing robust and statistically sound methods for internal and external benchmarking metrics. Job Role Responsibilities Work with business stakeholders to understand business challenges and identify opportunities for leveraging company data to drive business solutions.Develop Machine Learning algorithms and models to deliver business insights and automate workflowsScripting functions and code to manipulate, transform, or visualize informationEmbedding machine learning algorithms in new and existing processesGuiding appropriate handling of high frequency sensor dataVisualization of complex information for consumption across the business Education/Experience Required Bachelor's degree with strong academic experience relevant to Data Analytics and Data SciencePrefer five or more years of professional experience with a track record of successful solution generation in Data Science, Data Architecture & AnalyticsDomain knowledge of Oil and Gas PreferredAdvanced critical thinking skills, detail oriented, self-starter with a positive attitudeFlexible and able to prioritize assignments associated with multiple technical disciplinesAbility to start or engage in existing initiatives while quickly delivering high quality resultsMust be an adept problem solver with strong organizational and multi-tasking skillsStrong skills in computer science and/or statisticsFamiliarity with data sources (SQL, Oracle, NoSQL, Hadoop, GIS, Web Services, WITSML, etc.)Proficiency of at least one coding language: Python, or RBasic skills associated with HTML, CSS, JavaScript, .Net, and Visual StudioExperience with data visualization platforms (Spotfire preferred)Design and analysis of experimentsAbility to implement regression, multivariate, and time series modelsFamiliarity with ML frameworks such as Tensorflow, Theano, MXNet, etc.Experience with big-data technologies such as Cloudera, Hadoop/Spark a plus.Experience in application of advanced and predictive analytics through machine learning (Bayes Classifier, K Means Clustering, k-Nearest Neighbors, Random Forest, TensorFlow, etc.)Hypothesis testing through regression, binary classification, or other methodsConcho's annual review and application of the Fair Labor Standards Act has determined that this position is an exempt positionMust be able to work in the United States indefinitely COG Operating LLC (\"Concho\") uses e-Verify to confirm eligibility to work in the United States. Concho is proud to be an Equal Opportunity/Affirmative Action (EEO/AA) employer. Concho's policies are intended to ensure qualified applicants and employees are treated fairly and have equal opportunities in all aspects of employment, regardless of personal characteristics or status. We maintain a drug-free workplace and perform pre-employment substance abuse testing. NOTICE TO THIRD PARTY AGENCIES Please note that COG Operating LLC (\"Concho\") does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, COG Operating LLC (\"Concho\") will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, COG Operating LLC (\"Concho\") explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of COG Operating LLC (\"Concho\").SDL2017"}