{"jobID": "2665683780", "jobLocation": "San_Diego_CA", "jobTitle": "Data Science Intern — Summer", "companyRating": null, "companyInfo": {"Website": "www.idanalytics.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ID Analytics is a leader in credit and fraud risk solutions with patented analytics, proven expertise and up-to-the-minute insight into consumer behavior. Founded in 2002, with a vision to think differently about how institutions solve the problem of verifying consumers’ identities, we now solve a full range of identity challenges, including assessing credit risk and improving online customer experience. Our tools help our clients protect themselves and their customers from identity risk and fraud. Our solutions are all powered by analytics, but it’s our access to data unseen by other bureaus that differentiates our solutions. ID Analytics is a Symantec company.Responsibilities: The Data Scientist Intern’s duties will include, but not be limited to: A research project tailored to their strengths, spanning the domains of machine learning, search, consensus algorithms, graph analytics, process automation etc.Assist the team with the analysis, design, development, testing, and documentation of predictive models, tools, visualizations and algorithms.Building statistical models: after participating in the model design, the intern will work with an experienced modeler in the preparation of data, development of candidate models, evaluation and selection of final models.Completing written documentation and reports of results. This will take the form of business reports, internal technology summaries and statistical analysis.Delivery and presentation of accurate and actionable business and technical analyses to support sales, customer retention, and technology improvement efforts.Desired Qualifications:Prefer candidates working towards Master’s degree or PhD in Computer Science, Statistics, Mathematics, or a related technical field. Consideration will be given to exceptional Bachelor level candidates as well.Prior statistical modeling and/or machine learning experience are desirable.Experience with large data sets, data mining, natural language processing, deep learning and distributed algorithms is highly desirable.Strong coding and scripting skills are required. Working knowledge of Python and/or UNIX scripting tools is preferred, but deep knowledge of any language is valued.Must be able to understand and creatively solve problems that span statistics, technology, and business.Strong interpersonal and communication skills (both written and oral):Ability to communicate complex technical or statistical concepts to a non-technical audience.Work as part of a team and collaborate with colleagues while maintaining highest levels of respect and positive team spirit.Establish and maintain cooperative working relationships with colleagues at all times.Apply NowID Analytics is a Symantec company located in San Diego, California, USA. Symantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.  Relentlessly protect the world’s information. Make a difference at Symantec. Across the globe, we are an ‘essential’ partner to both consumers and businesses of all sizes. We combine our talents, our brains, and our creative energy to reinforce our place as a world-class technical community.  Our most critical asset at Symantec is the talent we hire - you! We look for people who have a desire to excel and reflect our values: Innovation, Action, Customer-Driven, and Trust. We recognize that every opening in our company is a chance to increase Symantec's competitive advantage, and we are willing to invest in you in order to win.  Symantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.  Symantec will respond to requests for reasonable accommodations to assist you in applying for positions at Symantec, or to submit a resume. If you need to request an accommodation, please contact HR Service Exchange at https://symantec.service-now.com/hrp/ .  EEO is the Law. Applicants and employees of Symantec Corporation are protected under Federal law from discrimination. Click here at http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf to find out more. A Successful Candidate  Our ideal candidates enjoy a team environment, have a penchant for technology and welcome a challenge. Successful candidates will be passionate about their area of expertise, driven to positively impact the company, and a desire to do meaningful work for our clients. If this sounds like you, then bring your drive to learn, grow and achieve, and see if ID Analytics is the company you’ve been looking for.  Finding Talented, Diverse People  ID Analytics is committed to equal employment opportunity and does not discriminate with regard to the terms or conditions of employment on race, color, sex, sexual orientation, gender identity, gender expression, age, religion, national origin, military service, or disability (provided employee is physically/mentally able to perform the regular duties of his/her job).  If you are covered by the Americans with Disabilities Act and would like to request assistance with our website or application process, please contact us at recruiting@idanalytics.com. ID Analytics will not accept resumes at this email address."}