{"jobID": "2804237548", "jobLocation": "Encino_CA", "jobTitle": "VP Data Science and Insights", "companyRating": null, "companyInfo": {"Website": "www.answerfinancial.com", "Headquarters": "Encino, CA", "Size": "Unknown", "Founded": " 1997", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a highly motivated leader to develop and drive Answers data science and insight capabilities in support of Answers overall business strategy and be the evangelist for data science and insights at Answer Financial. As the VP, Data Science and Insights, you are a proven leader with expertise in advanced analytics, machine learning and predictive modeling.  Answer Financial is one of the largest auto & home insurance agencies in the U.S., with over 3.4 million vehicles and homes insured. Insurance shoppers in all 50 states can compare insurance prices from some of the more than 20 top-rated insurers that Answer Financial represents. Products offered through Answer Financial include: auto insurance, homeowners insurance, condo insurance, renters insurance, motorcycle insurance, RV insurance & boat insurance. In addition to buying insurance online, customers can buy over the phone with assistance from one of their licensed insurance professionals. Answer Financial is part of The Allstate Corporation (NYSE: ALL), the nation's largest publicly held personal lines insurer. Responsibilities:Leverage data driven insights to optimize customer acquisition, marketing initiatives, and insurance distribution in support of near term performance goals and long-term strategic initiatives.Provide analysis to inform strategic direction on business issues and opportunities.Create and execute analytic solutions to improve and optimize business performance and minimize risk.Collaborate with other business leaders to drive decisions based on data, facts and analytical findings.Develop highly functional teams through coaching, goal setting, and a commitment to employee growth and development.Knowledge, Skills and Abilities:Able to define the correct data, analysis and interpretation to influence customer acquisition, marketing initiatives and insurance distribution.Capable of guiding and inspiring your team and your colleagues to drive the best possible practices.Uncanny business acumen to help illuminate how analytics and insights could be used to create new opportunities and drive exceptional performance.Proven technical ability with a variety of tools and methodologies used to support data engineering, modeling, and visualization, including SQL, Python and R.Commanding knowledge of statistics and/or machine learning techniques.Knowledge of advanced statistical techniques suitable for analysis of highly skewed populations.Proven experience in predictive analytics, segmentation, experimental design and related areas.Ability to communicate complex statistical analysis in plain English and help your team develop clear and unambiguous visual reporting systems.Experience designing, deploying and maintaining secure cloud based analytics and insights technology stacks.Familiarity with the design and implementation of data telemetry systems.Required Experience:Experience leading a department critical to driving business value where failure to achieve business results will have serious, long-term impacts to the business, and may place the overall long-term success of the organization at risk.7 or more years of experience in data science and data engineering. Experience with online sales and distribution optimization preferred.Experience leading a company to understand the power of data science and insights to drive value in pursuit of its business objectives and helping to foster a data-centric culture.Experience in and understanding of a wide variety of analytical processes (governance, measurement, etc.)Experience working within an agile software development environment.Up-to-date on key Data Science trends and methodologies.Proven ability to combine business acumen with applied data science principles to drive measurable value in achieving a companys overall business objectives.Experience managing cross-department Data Science projects and teams.Masters degree in statistics, mathematics, computer science or related fields.We offer a competitive salary, a comprehensive benefit package which includes day one health benefits, matched 401(k), and paid time off.Answer Financial is an equal opportunity employer."}