{"jobID": "2778475176", "jobLocation": "Culver_City_CA", "jobTitle": "Digital Sales Analytics Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.nfl.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1920", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " Unknown / Non-Applicable", "Competitors": " Major League Baseball, NBA, NHL"}, "estimatedSalary": "79000", "jobDescription": "Requisition Number:2839Job Title: Digital Sales Analytics Manager Location: Los Angeles-LA Position Type: Full-Time Regular  Experience & Education Requirements:The ideal candidate must be motivated, disciplined and able to effectively work with autonomy in a fast-paced, cyclical and often highly fluctuating work environment. He/she must possess a high level of intellectual curiosity, focus on generating results, and exhibit the highest personal and professional standards of integrity and ethics. 5+ years of experience in digital analytics, business intelligence, or related quantitative fieldExpert in MS Excel & PowerPoint; working knowledge of statistics and analysis packagesDeep understanding of enterprise analytics and competitive intelligence tools, specifically Adobe Analytics and comScoreFoundational knowledge of data architecture, database design, ETL, and data visualization as it pertains to developing a self-service analytics modelStrong and proactive communicator that can effectively translate complex analysis and detail for non-technical personnelExperience managing and prioritizing requests from multiple stakeholdersProven ability to manage multiple projects at once and work in fast-paced, high-pressure situationsExcellent problem-solving and analytical skills, with strong business acumenPrevious experience directly managing and training others Preferred Education and Experience: BA/BS degree in Economics, Statistics, Mathematics, or quantitative field Job Description:The NFL Digital Media Intelligence team helps business leaders make thoughtful, evidence-based decisions to support NFL Media's long-term value. The Manager, Digital Sales Analytics will be a data strategy thought leader within the NFL's Media Intelligence Group and serve as the key business partner for the Media Sales and Business Development organizations.  This role, reporting into the Director of Digital Analytics, will be responsible for developing an ongoing support model for Media Sales & Biz Dev that provides media consumption trends across NFL's owned & operated sites/apps and social properties, as well demographic insights and competitive intelligence. This person should perform well under pressure, be well versed in approaches to report automation, have experience with multiple digital analytics data tools (e.g. Adobe Analytics, comScore, Spreadfast), and possess the ability to communicate insights and stories from data. This individual will directly manage two entry-level analysts to help support Sales, Biz Dev, and other manual ad-hoc reporting initiatives.  Essential Functions: Primary business partner and point of contact for NFL Media Sales, Sponsorship, Business Development, and League MarketingDevelop an ongoing support model for Media Sales, across digital and social, that includesAccurate and on-demand data that can be leveraged by Sales team for prospective clientsCommunication of key insights and storylines related to NFL digital media consumption and audience that can be used by Sales team for RFPsCreation & distribution of in-season client sales reportsImprove ongoing reporting efficiency through automation and more rigorous prioritization processManage distribution of in-season executive weekly report that contains information around ratings and key NFL Media initiativesDefine requirements for and oversee reporting around league \"tentpole\" events such as Super Bowl and DraftDefine requirements for and oversee digital live game reporting, aggregating data across NFL owned and operated platforms, broadcast partners, and digital partnersManage, prioritize and delegate ad-hoc reporting requests from key stakeholdersManage vendor relationships, including comScore and Adobe AnalyticsManage and train a team of two junior analysts that will execute ongoing reporting and ad-hoc requests Supervisory Responsibility: Will manage 1-2 entry-level analysts"}