{"jobID": "2835292129", "jobLocation": "Union_NJ", "jobTitle": "Data Scientist Forecasting", "companyRating": "3.4", "companyInfo": {"Website": "www.cardinalts.com", "Headquarters": "Monmouth Junction, NJ", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Title: Data Scientist – ForecastingDuration: FulltimeLocation: Union, NJJOB DESCRIPTION: Client is looking for a Data Scientist with a strong background in Forecasting. The role is responsible for modeling complex planning problems and identifying forecasting opportunities through the use of statistical, algorithmic, machine learning, mining and visualization techniques. In addition to advanced analytic skills, the role requires proficiency in working with complex, large and varied data sets.  Data scientists will partner with cross functional teams from Ecommerce, Merchandising, Marketing, Supply chain, Operations, Finance and other IT teams to drive the business. They need to be creative - propose innovative ways to look at problems, validate their findings using an experimental and iterative approach.  Data Scientists will possess strong programming knowledge to be able to quickly model using analytical tools, and present their findings in a clear and structured manner. They would have strong written and oral communication skills.  Responsibilities:  · Develop and manage predictive analytics and statistical forecasting models to improve forecast accuracy and bias reduction  · Design and build KPI reports to support the model performance and business requirements  · Mine and translate data into meaningful insights and recommendations for the operational and strategic business units  · Process, cleanse, and verify the integrity of data used for analysis  · Drive the collection of new data sources and the refinement of existing data sources  · Analyze, interpret & clearly communicate the results of experiments to business  · Work with cross-functional teams on the day-to-day execution of data & analytics projects and initiatives  · Keep up to date with latest technology trends  · Strong background in statistical concepts including regression analysis, factoring, clustering, decision trees, random forests, neural networks  · Knowledge of Advance Machine Learning (Deep learning) and Artificial Intelligence (AI) techniques and applications  · Experience with various data types (e.g. Relational, unstructured, Hierarchical, etc)  · The ability to communicate complex quantitative analysis in a clear, precise and actionable manner  · Possess excellent verbal and written communication skills, attention to details, and the ability to multi-task  · Work independently with minimal supervision  · Be detail-oriented and comfortable with a fast-paced, structured, retail environment  Required Knowledge and Experience:  · 3+ years professional experience in forecasting and data analysis  · Expert knowledge of statistical methods and analytical techniques  · Broad knowledge of current statistical forecasting and data mining techniques.  · Expert knowledge of R open source statistical language  · Practical experience with SAS, ETL, SQL, data processing, database programming and data analytics  · Excellent pattern recognition, predictive modeling and Natural Language Processing (NLP) skills  · Experience with common data science toolkits, such as Python, R, SAS & MatLab  · Knowledge of data visualization tools, such as SAS Visual Analytics, Tableau, Qlik-View etc.  · Experience with advanced planning systems a plus  Education/Certification:  · A minimum Master's degree in Statistics, Applied Mathematics, Operations Research, Computer Science, Engineering, Economics or a related field ContactPuneet TiwariCardinal Technology SolutionWork: 732-821-7400 x 308Email:Puneet.tiwari@cardinaltsinc.com- provided by Dice FORECAST, REPORT"}