{"jobID": "2829543136", "jobLocation": "Walker_MI", "jobTitle": "Advanced Quality Engineer", "companyRating": null, "companyInfo": {"Website": "www.challenge-mfg.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Advanced Quality Engineer is responsible for conducting ongoing analysis of the production process inputs and output to ensure that customer (internal and external) quality requirements are being achieved. RESPONSIBILITIES AND RESULTS: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Safe Launch\" participant to constructively accept a detailed hand-off of product requirements from APQP QE.The \"Safe Launch\" hand-off process links the APQP QE and Current Production QE when the first MRD parts are being run. These QEs work together to obtain and complete the necessary quality system documentation, dimensional data, GP-12 support, and PTR/MRD packaging and labeling for shipment.Supporting the \"Safe Launch\" process also includes providing the plant communication linkage for a formal tooling buy-off process, including Run at Rate support and associated documentation to declare die/welder readiness for production. This is then followed by the preparation of all PPAP documentation for submission.Responsible for all plant level quality concerns for assigned product.Serve as direct point of contact for customer complaints.Manage Quality System for all changes after launch.Obtain \"Master Samples\" from 300 piece initial production run for Program archiving of Part Quality at start of production.Update Control Plans & FMEA as Issues Arise from the Floor or Customer.Issue Product Quality Check Deviations following direction from management.Provide timely acknowledgement responses to customer complaints.Provide formal documentation PRR/HTR, responses to the customer.Be a presence at the assembly plants to provide face-to-face interaction and ensure customer satisfaction while developing relationships.Understand how each part is utilized in the vehicle build, and become the \"expert\" with regard to what the customer expects from us as the supplier of this part.Provide the plant management with the \"voice of the customer\" and explain what key part attributes are important to manage on each part and why.Train plant level quality auditors and production team leaders on part to part concerns regarding acceptability, inspection methodology, and customer expectations.Direct Quality Technicians to provide supporting product quality documentation (Part Picture Visuals, Packaging Instructions, Gage Instructions, Quality Alerts, etc.), and floor support as necessary.Provide plant with priorities for part improvement to ensure the most important attributes are addressed first, and stress continuous improvement.Address plant floor quality concerns as they arise, provide timely opinions for acceptability, and be able to provide the proper decision criteria for management to direct the part disposition.Champion problem control meetings for customer complaints, and attendees need to be accountable for their problem control responsibilities by area managers.The QE should be involved in monitoring daily part quality, and spend time on the floor checking parts and auditing product and process to verify that customer requirements are met.Participate in the layered process audits.Implement new methods of inspection and control when required. (i.e.: enhanced containment techniques and documentation, SPC data, scheduled CMM runs or Roamer scans, etc.)The QE is responsible for supporting all QSB+ and TS requirements associated with his/her assigned part responsibilities.SKILLS AND KNOWLEDGE:Advanced GD&T; trainingUnderstanding of the Specific Customer RequirementsUnderstanding the PPAP ProcessUnderstanding of the APQP ProcessUnderstanding of dimensional data and the ability to analyze and make decisionUnderstand problem solving and all the involved core toolsCommunication written and verbalPlexusMicrosoft OfficeBEHAVIORAL REQUIREMENTS:Has high standards of performance for self.Takes responsibility for actions, results, and mistakes.Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress.Maintains positive relationships by constructively resolving conflicts.Uses feedback from others to continuously improve performance and work relationships.Moves within own and/or other work areas (flexes) to support plant flow.Works with sense of urgency to meet needs of customers.Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities.Maintains knowledge and skills to perform job effectively.Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.Looks for good in others; works collaboratively with others; shares information and knowledge.Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.WORK ENVIRONMENT / PHYSICAL DEMANDS:The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this Job, the employee is regularly exposed to moving mechanical parts. The noise level in the work environment is usually very loud.The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.While performing the duties of this Job, the employee is frequently required to walk, talk or hear. The employee is occasionally required to stand, sit, use hands to finger, handle, or feel objects, use tools, or controls; reach with hands and arms, climb or balance and stoop, kneel, crouch or crawl.The employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to focus.REQUIRED EDUCATION AND EXPERIENCE:Associate Degree requiredMinimum of five years related work experience and/or training as a Quality Engineer requiredBachelor's Degree from a four-year college or university preferredOther Duties: Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}