{"jobID": "2837603784", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Scientist, Systems Validation (Flow Cytometrist)", "companyRating": null, "companyInfo": {"Website": "www.dbhealthcare.com", "Headquarters": "Andover, MA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " About DB Healthcare IT DB Healthcare IT, focused solely on healthcare, life sciences and IT domain, partners with Providers, Payers, life sciennces and established healthcare consulting practices to provide them with qualified consulting resources. We have been very successful in providing project directors, program managers, analysts, interface engineers, training and go live consultants for EPIC, Meditech, Eclipsys, Allscripts, Cerner, Siemens and McKesson EMRs and Business Intelligence, ICD-10, HIPPA 5010, EDI, Revenue Cycle and HIM and Data Warehouse experienced resources. More jobs available at http://www.dbhealthcare.com. Title: Sr. Scientist, Systems Validation (Flow Cytometrist) CA Location:2350 Qume DrSan Jose, CA 95131 Type:Contract Duration: 07/02/2018 to 12/31/2018 Start Date: 07/02/2018 Role Type:Local candidates strongly preferredW2 only; no visa holders or candidates through C2C vendorsBenefits1. Payroll weekly direct-deposit Corporate AMEX card for Air, Hotel and Rental Car expenses ($0 up front expense)24x7 consultant customer serviceHealth and 401k benefits (optional)Please send us the following information as soon as possible:  1. Updated/Current resume in MS Word  2. Availability to start next consulting engagement  3. Expected Hourly Rate (W-2 Only)  4. Best time to speak to you either today or tomorrow 5 years experience in general flow cytometry2 years experience in sorting flow cytometryHands-on experience operating and troubleshooting flow cytometersExperience with sample prep and experiment design for multi-parameter flow cytometry applications"}