{"jobID": "2738417040", "jobLocation": "Chicago_IL", "jobTitle": "Commercial Credit Analytics Consultant - remote", "companyRating": null, "companyInfo": {"Website": "www.jobjuncture.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION OVERVIEW: Our client is looking for a Commercial Credit Analytics Consultant to be a Pre-Sales consultant in the financial industry. The right candidate will examine industry trends and business challenges and provide valuable insight to clients. This is a Direct Hire position, not C2C, not contract, with no visa sponsorships available of any kind, and we do not work with any third party consulting firms. You must currently live in the United States to be considered for this role. Please do not apply if you are looking for a contract position. This is not a remote position, and relocation is not available for this role, please consider that before applying. RESPONSIBILITIES:Execute high quality and timely deliverables through projectsSet analysis parameters and performance indicators through client collaborationSupport client objectives through the interpretation of results, trends and issuesUncover additional sales opportunities for clientsREQUIREMENTS:Senior to expert level experience in commercial lending strategy in the financial industry (preferably in risk management)Senior expert level experience with full credit life cycle for commercial and consumerSenior to expert level FCRA experienceSenior to expert level experience with decision strategies and analytical projectsExpert level experience with analytical rules and decisioning softwareExpert level experience with commercial lending in financial institutionsNICE TO HAVE SKILLS:Data cleansing experienceDatamining experience This is a direct hire position with no visa sponsorships available, and we do not work with any-third party consulting firms.  Local candidates are preferred for this role because this company does not offer a relocation package, nor do they reimburse for travel expenses to the interview. Please consider that before applying."}