{"jobID": "2834891021", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.nielsen.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NLSN) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "Sr. Data Analyst - 23277 Gracenote - USA Los Angeles, California We are presently looking for a Senior Data Analyst to work with our LA-based team on our portfolio of entertainment data services. The ideal candidate should demonstrate an excellent blend of technical analysis and business leadership.We’re looking for someone who can understand our datasets and how they can combine with other datasets across Gracenote and Nielsen to drive value for our clients. On a day-to-day basis, here are some things you might do:Come up with new ideas for data products we can offer based on your unique understanding of our dataWrite queries and generate reports to help judge our data quality and completenessMerge multiple datasets together for client research projectsCreate a benchmark to drive insights to the entire media industry, and present your findings to clients#LI-GNResponsibilities:Lead complex analysis projects from beginning to end -- plan the project, build the analysis scripts, query and combine multiple datasets, etc.Take ownership of business analytics through ad-hoc queries, analysis and reportingSummarize, document, and communicate analysis findings to senior level executives, both internal and externalDevelop product and industry expertise, and help create new commercial products based on our unique and proprietary datasetsWork in close collaboration with senior stakeholdersQualifications:5+ years experience as an analyst or data scientist - media experience a plusStrong statistical and analytical skillsProficient in SQL and Python or RProficient with data visualization tools/packagesProficient in Excel / PowerPointExcellent written and verbal communication skills, comfortable presenting internally and in front of clientsProactive self-starter who can operate independentlyAbout Nielsen: Nielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.  By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P; 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location: Los Angeles,California Secondary Locations: , , , Travel: No"}