{"jobID": "2829026674", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst - Finance Department", "companyRating": "3.8", "companyInfo": {"Website": "www.chicagofed.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1914", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "We are seeking a highly motivated, Business Intelligence Analyst to join our Finance Team. The Business Intelligence Analyst will partner and consult with a broad range of business units across the organization working closely with department leadership and internal clients at all levels. This individual is responsible for leading moderate to complex data analysis projects across large, disparate datasets to discover business insights and develop predictive reporting. In addition to the background and experience described below, we are in search of a candidate with leadership capabilities, strong communication, strategic-minded, and an innovative thought process with experience in Management Information Systems, Finance, and Accounting. Individuals with equivalent experience should also apply.Job Summary:Drives business decisions by providing quantitative and qualitative data analysis and reporting of patterns, insights, and trends to decision makers. Under the direction of the Manager, collects, aggregates, and analyzes data from multiple internal sources to drive insights into business performance. The level of work is intermediate and operates under general supervision. This job does not have direct reports.Principal Duties and Responsibilities:Produces actionable reports that show key performance indicators, identifies areas of improvement for current operations, and displays root cause analysis of problemsUses analytics and metrics to improve processes and provide data-driven forecasts of potential costs, risks, and benefits of new business initiatives and strategiesCommunicates findings and insights to stakeholders and provides business strategy recommendations for optimizing business performanceProvides reporting solutions and responds to ad-hoc report requests across multiple business areasEnsures compliance with deliverable reporting requirements by performing quality data audits and analysisMaintains/updates business intelligence methods, databases, dashboards, tools or systemsMay participate in the design and development of business intelligence reporting toolsEducation and Experience:Bachelor's degree in IT, Computer Science, Mathematics or Business preferred or equivalent experience1-3 years of experience in data analytics preferredKnowledge and Skills:Excellent verbal and written communication skillsStrong analytical and problem solving skillsStrong organizational skills, with the ability to prioritize and manage projects and timeAbility to work independently and on a teamThis document indicates the general nature and level of work performed by employees within this position. It is not a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. An employee's responsibilities, tasks, and duties might differ from those outlined in the job description, and other duties, as assigned, are a part of the job. The Federal Reserve Bank of Chicago reserves the right to modify the elements of this job description, as business needs require."}