{"jobID": "2825316463", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.verizonwireless.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "What you’ll be doing... The Human Resources Strategy & Analytics team is responsible for designing the workforce analytics strategy and leveraging advanced reporting, analytics, applied statistics, and research to shape the Wireless Operations HR strategy, and provide insightful workforce intelligence for the business. We are focused on delivering value-added insights to support overarching company priorities, day-to-day operations, and transformational initiatives.  As an Analyst on our team, you will be part of a small team accountable for delivering big results for a broad set of stakeholders. You will provide operational, technical, and analytical support to our team and the leaders we support to drive the HR team’s strategic and operational priorities. Success is measured by the quality, timeliness, and effectiveness of information and insights generated to support decision making and drive action. You will be responsible for working cross-functionally with other teams across HR, Sales, Customer Service, IT, and Finance on projects that impact Verizon Wireless Operations. Delivering routine and ad-hoc reports andscorecards to track and evaluatingeffectiveness and efficiency of HR processes in driving organizational priorities.Integratingdata from multiple sources to perform analyses around improving key talent retention, workforce performance, leadership effectiveness, and resource utilization.Researching and analyzingbusiness drivers, competitive environment, opportunities, trends and operating metrics to deliver synthesized findings and recommendations for leadership decision making.Participatingin development of national reporting and analytics solutions (systems, tools, dashboards, etc.) to enhance end-users experience and self-sufficiency.Partnering cross-functionally to enhance data integrity and standardize/document internal metric definitions and reporting processes.Servingas a national level data and analytics resource for the HR team; research and stay up-to-date on the latest trends and best practices in workforce analytics.Supporting special projects to drive national operations and enterprise strategies.What we’re looking for... You’ll need to have: Bachelor’s degree and/or 1 or more years of experience.Two or more years of experience in reporting anddata analytics. Even better if you have: A Bachelor's degree in Business, Computer Science, Human Resources, or Industrial Organization, preferred.Familiarity with SQL and basic programmingExperience with COGNOS or other database reporting tools and PeopleSoft or similar HRISExperience with SPSS, SAS, R or other statistical packagesExcellent problem solving and analytical skillsHigh professional standards for customer service, confidentiality, integrity, and quality of workDemonstrated ability to deliver timely accurate information and quality work in a fast-paced dynamic environmentAbility to work independently without close supervision and effectively manage priorities and deadlinesAbility to communicate data-based information effectively and concisely to non-technical stakeholders, including senior leadersAdvanced proficiency in Excel, PowerPoint and other MS Office applicationsWhen you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}