{"jobID": "2753289065", "jobLocation": "San_Jose_CA", "jobTitle": "Data Specialist - Administrative Analyst/Specialist Exempt II (T", "companyRating": "4.0", "companyInfo": {"Website": "www.calstate.edu", "Headquarters": "Long Beach, CA", "Size": "10000+ employees", "Founded": " 1962", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "CSU Job Listing Details Printable version E-Mail this listing Campus: East BayJob ID: 5271Job Title: Data Specialist - Administrative Analyst/Specialist Exempt II (TAppointment Type: TemporaryTime Base: Full-Time Date Posted: April 30, 2018Closing Date: Open until filledLink to Apply Online: http://www.csueastbay.edu/jobsCampus Employment Homepage: http://www.csueastbay.edu/jobsDescription: SALARY AND BENEFITS:Salary Range: The starting salary will be between $4,693.00/month to $5,600.00/month.CSUEB offers a broad range of benefits that includes medical, dental, vision, retirement (CalPERS), 401k, 457, 403(b), dependent and health care reimbursement accounts, life insurance, vacation and sick, 13 paid holidays, one personal holiday and tuition fee waiver.For more information on the benefits program, please visit http://www.csueastbay.edu/af/departments/hr/benefits/index.htmlABOUT CSU EAST BAY:California State University, East Bay's beautiful main campus is located in the Hayward hills with panoramic views of the San Francisco Bay shoreline. Situated above the city of Hayward, the campus offers an ideal setting for teaching and learning and yet easy access to the many cities along the bay. The University has a satellite campus in Concord, a professional development center in Oakland and a significant presence online. Founded in 1957, California State University, East Bay is one of 23 universities of the California State University system (CSU). With an enrollment over 15,800 students, California State University, East Bay is recognized as a regionally engaged and globally oriented university with a strong commitment to academic innovation, student success, engaged and service learning, diversity, and sustainability.DEPARTMENT STATEMENT:The Promise Neighborhoods Initiative is a U.S. Department of Education initiative launched in April 2010 focused on breaking the cycle of inter-generational poverty by significantly improving the educational and developmental outcomes and overall life prospects of children and youth in our most distressed communities. The core idea behind the initiative is that providing both effective schools and strong systems of support to children and youth in poverty and, thus, meeting their health, social services, and educational needs, will offer them the best hope for a better life. CSUEB is the lead agency for the Hayward Promise Neighborhood and the South Hayward Promise Neighborhood and is thus charged with the responsibility of managing all fiscal aspects of the Promise Neighborhood grant(s).ABOUT THE POSITION:The primary purpose of the Hayward Promise Neighborhood (HPN) Data Specialist is to coordinate activities and administer database systems and tools for the collaborative in collecting, analyzing, and using data to inform the development and/or implementation and/or continuous improvement of the cradle to career pathways and targeting interventions and solutions effectively.This position will: Work independently as the principal coordinator of data and information systems, including but not limited to Salesforce Nonprofit Success Pack and Clear Impact Results Scorecard; Manage entry of all data into separate data systems, ensuring quality of data as well as compliance with all necessary confidentiality regulations and oversee HPN partners' data for accuracy and appropriateness; Develop partnerships with HPN funded agencies, to collect individual, program and population-level data; Analyze data and create reports to align with funding requirements; Develop and maintains all protocols and training manuals related to database systems and tools; (6) Provide technical assistance to partners who may need trouble-shooting support in Salesforce and Scorecard database usage.This is a temporary, full-time position through December 31, 2018, with the possibility of reappointment.RESPONSIBILITIES:Coordinate with Cal State East Bay Information Technology Services with the guidance of the HPN Data, Evaluation, and Alignment Lead to structure, implement and maintain Salesforce, Scorecard, and other data and information systems to optimize data access and security. Coordinate with the Data, Evaluation, and Alignment Team and data personnel at HPN partner agencies to support the continuous improvement of Salesforce, Scorecard, and other data systems to ensure data accuracy.Monitor implementation of security policies and identify risk areas. Manage user accounts, privacy, and security in database. Work with user community to understand data access and integration needs. Ensure integration of systems through the database structure. Coordinate with the Data, Evaluation, and Alignment Team and data personnel at HPN partner agencies to ensure gathering of large data sets from a variety of sources with capacity to organize and analyze, while ensuring quality, timeliness and compliance.Leads data management and collection activities for Data, Evaluation and Alignment Team. Manage and coordinate the gathering of large data sets from a variety of sources with capacity to organize and analyze, while ensuring quality, timeliness and compliance. Gather data in a timely and efficient manner and synthesize for reporting, programming, quality assurance, and continuous improvement purposes.Develop processes, procedures and best practices for data gathering and analysis processes in alignment with federal guidelines and programmatic needs. Develop and maintain expertise in various data sets and systems including: Salesforce Nonprofit Success Pack, Clear Impact Results Scorecard. Develop and update all protocols, training manuals, and data dictionary related to database systems and tools. Provide training and technical assistance to partners who may need trouble-shooting support.MINIMUM QUALIFICATIONS:Requires general knowledge and skills in the applicable administrative and/or program field with a foundational knowledge of public administration principles, practices, and methods. This foundation would normally be obtained through a bachelor's degree and/or equivalent training and administrative work experience involving study, analysis, and/or evaluation leading to the development or improvement of administrative policies, procedures, practices, or programs.PREFERRED SKILLS AND KNOWLEDGE:Master of Science (MS) or concurrent enrollment in a Master's Program with equivalent work experience.Attention to detail while prioritizing in a multi-task, high-paced environment. Ability to step back to see the bigger picture and systems-levels processes and outcomes. Excellent communication and professional engagement with various and diverse stakeholders including academics, software technicians, community based agencies, school administrators, funders, parents, and community advisory board members. Comfortable in startup atmosphere where various levels of performance and ambiguity are the norm. Mission driven and believes that systems and individuals are resilient, adaptable and can understand the importance of using data to support systems change. Knowledge of the needs of low-income families; place-based approach interventions and how systemic change takes place. Knowledge of Salesforce, Scorecard, and Tableau.Project Management: ability to manage large number of projects with various components and stakeholders in effective and time-constrained contexts. Required to assess, formulate, and evaluate the impact of recommended or implemented policies from a strategic and/or operational perspective. Demonstrate attention to detail while prioritizing in a multi-task, high-paced environment.Database Administration: Knowledge of data administration principles and data model concepts. Working knowledge of Salesforce and Scorecard or similar data and information systems; commitment and experience of working to reform systems and coordinate data resources and information in pursuit of common goals. Ability to use data resource and productivity tools applicable to the database management system.Data Analysis: Ability to interpret, explain, showcase data in succinct ways to a variety of stakeholders. Administration and support: Ability to maintain the database by acquiring and installing data set and documentation; assisting in data transfers or sharing of files.Quality Assurance/Continuous Quality Improvement Framework: Ability to develop processes in an iterative way that improves upon the quality of the data being collected, implementation activities. Ability to work and communicate with users to define and meet database needs and requirements. Work requires regular participation in planning and development activities and independent judgment of methods to meet project goals.Diplomacy: Ability to manage relationships with a variety of stakeholders including community partners, residents, elected officials so that data is integrated into the culture of the initiative. Must demonstrate capacity to conceive of new approaches and solutions to address complex problems. Ability to work with representatives from public and private entities and handle potentially sensitive situations. Demonstrate consultative skills in working with internal and external partners.Presentation Skills: Ability to effectively present ideas and concepts in written or presentation format, and use facilitation skills to build consensus.HOW TO APPLY:In addition to the standard CSUEB application, please submit a:1. Cover letter 2. Resume 3. List of three (3) or more professional references Resumes alone will not be accepted in lieu of a completed online application.To apply on-line, please go to www.csueastbay.edu/jobs. If you are a first time user, you must register, create a user ID and password, fill in your basic information, save and click on the position you are interested in, click on the \"Apply Now\" button to begin the online application.This position will remain open until filled and may close without further notice.Applicants will receive a confirmation of receipt via automatic email reply regarding their application materials. In addition, all applicants who were not selected will receive email notification at the conclusion of the recruitment process. Please be patient as this process may take several weeks.CONDITION(S) OF EMPLOYMENT:California State University, East Bay conducts pre-employment screening that may include, but is not limited to: criminal background check, verification of academic credentials, licenses, certificates, credit history, professional references and/or verification of work history. Candidates must submit to a background check before being offered a position with CSUEB. Unsatisfactory results of the background check may affect the application status of applicants or continued employment of current CSUEB employees who apply for the position.OTHER INFORMATION:All California State University campuses, including CSUEB, are smoke and tobacco-free. For more information, please visit our website at http://www.csueastbay.edu/smokeandtobaccofree/In compliance with state and federal crime awareness and campus security legislation, including The Jeanne Clery Disclosure of Campus Security Policy and Crime Statistics Act, the California State University East Bay Annual Campus Security Report is available at: http://www20.csueastbay.edu/af/departments/upd/campus-security-report.htmlMANDATED REPORTER:All California State University, East Bay employees are considered mandated reporters under the California Child Abuse and Neglect Reporting Act and are required to comply with requirements set forth in the CSU Executive Order 1083 as a condition of employment.SPONSORSHIP:CSUEB is not a sponsoring agency for Staff or Management positions.EEO STATEMENT:As an Equal Opportunity Employer, CSUEB does not discriminate on the basis of any protected categories: age, ancestry, citizenship, color, disability, gender, immigration status, marital status, national origin, race, religion, sexual orientation, or veteran's status. The University is committed to the principles of diversity in employment and to creating a stimulating learning environment for its diverse student body."}