{"jobID": "2756768801", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Information Security Architect", "companyRating": "3.6", "companyInfo": {"Website": "www.mantech.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (MANT) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "164000", "jobDescription": "Req ID 97871BR Business Title Lead Information Security Architect Group MCIS Location USA CALIFORNIA San Francisco Clearance Level Needed Public Trust Category Cyber Job Duties and Responsibilities Become an integral part of a diverse team that leads the world within our Federal Security Solutions group. At ManTech International Corporation, you will help protect our national security while working on innovative projects that offer opportunities for advancement.  ManTech is looking for a Lead Information Security Architect to join our team.In this role, you will serve as the “deputy” and 2nd in command for theSecurity Architecture team at our customer location in San Francisco.  As part of the security architecture team you will participate insecurity-related activities including planning, design, development,implementation, and testing for all security controls required.  You will also coordinate and review security architecture and engineeringresults from the National IT teams, other District partners, and externalservice providers for technologies located outside the San Francisco District.  You will partner with the IT teams and System Owners to conduct threatmodelling, identify critical security gaps, review existing security controlrequirements, and oversee testing and security assurance activities.  You will own the tools and technologies used by the security teams, thesecurity architecture frameworks including Application Security, the securitydata strategy and big-data environments, and the Security Orchestration andAutomation & Response (SOAR) platforms used by our client. KeyResponsibilities:You will drive andcoordinate:Interactions with stakeholders to effectively shape and drive security strategyand security capabilities including participation in strategic initiatives andworkgroupsSecurity briefing for business and technology partners on securityvulnerabilities and operational risks to help foster accountability with thebusiness and technology ownersCompliance and improvement of policies, standards, controls, guidelines andoperating procedures for networks, telecom, cloud technologies and sitesecurityOversight of secure configurations and platform hardening for hardware,software and cloud environmentsOversight of the secure software development life cycleOversight of security reports related to security outages showinguptime/downtime, mean-time-to-resolve system outages, impact from outages, andlessons learned from root-cause analysisManage the teams workloads, new demands, work backlog, resource estimation,delivery projections, and service level agreements (SLAs) Qualifications Requires Bachelor's degree or equivalent and ten to twelve years of related experience. Minimum of seven years experience in technology/tools specific to the target platforms. Additional Qualifications Working knowledge of network architecture, VLANs, firewalls, routers, switches, bridges, hubs, load-balancers, wireless access points, web-application firewalls, and software-defined networks  Hands-on experience with technical architecture, infrastructure designs, servers, workstations, virtual machines, cloud-based environments and hardening procedures  Knowledge of application security, secure SDLC, Appsec testing  Knowledge of data security concepts, principles and application  Familiarity with network protocols, MAC address spoofing, DNS poisoning, DoS attacks, IP spoofing, SYN attacks, and Network Access Control (NAC)  Highly proficient, concise and articulate verbal and written communication skills to a wide range of audiences including business executive, end-users, and technical partners  Effective customer service and interpersonal skills, including the ability to work in a team environment; motivate and work with others to accomplish tasks; and deal honestly and directly with others  Ability to independently manage overall team workload with little or no oversight  Strong critical thinking, analytic and problem-solving skills  Bachelor’s degree in Computer Science or Electrical Engineering or equivalent years of work experience  Ability to independently manage overall team workload with little or no oversight  Strong critical thinking, analytic and problem-solving skills  Participate in on-call rotation, support during off-shift hours and occasional travel to branch locations Degrees See Qualifications Years of Experience See Qualifications Position Type Full-Time Shift Day Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies."}