{"jobID": "2814951296", "jobLocation": "Standish_MI", "jobTitle": "Clinical Laboratory Scientist", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job ID: 252555  Clinical Laboratory Scientist  Standish, Michigan  Regular  /  Rotating Additional Job InformationTitle: Clinical Laboratory Scientist City, State: Standish,MI Location: St Mary's of Michigan-Standish Department: General Lab Anc 001 Additional Job Details: PRN Rotating  Flexible to cover either 12 hour shift. About UsBased in Saginaw, St. Marys of Michigan is a regional health system offering high quality care in cardiovascular, neurosciences, orthopedics, emergency and trauma, cancer, bariatrics, imaging diagnostics, and primary care. A part of Ascension since 1999, we offer 268 beds and over 20 specialty centers to provide access and care for people from over 70 counties.Job DescriptionJob Summary: The Clinical Laboratory Scientist performs laboratory testing of patient specimens in one or more sections of the laboratory. Responsibilities:Performs diagnostic/analytic testing of specimens. Interprets, documents and reports test results.Performs quality control testing, instrument maintenance and troubleshooting.Verifies analytic accuracy, precision, sensitivity and references ranges for test methods.Serves as a resource to staff as needed.Collects blood specimens using age-appropriate techniques.Maintains technical competency as established by the Laboratory Medical DirectorMaintains equipment and adequate stock of supplies. Performs clerical duties including answering phones, data entry, and filing.Supports goals and processes for Regulatory Compliance and QAPIQualificationsLicenses/Certifications/Registration: Required Credential(s):Certified Clinical Laboratory Scientist specializing in Cytotechnology credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) obtained prior to hire date or job transfer date.One or more of the following:Certified Clinical Laboratory Technician obtained prior to hire date or job transfer date.Certified Clinical Laboratory Scientist credentialed from the American Society for Clinical Pathology Board of Certification (ASCP-BOC) obtained prior to hire date or job transfer date."}