{"jobID": "2628147903", "jobLocation": "Santa_Clara_CA", "jobTitle": "Staff Operation Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Operations Research (OR) Scientists embed with JDs various marketplace-related service and engineering initiatives to help them solve advanced OR problems in real-world scenarios. These fascinating and challenging problems include: building JDs dynamic pricing engine; improving the effectiveness and efficiency of the inventory system; optimizing the assignment process of matching/dispatching trucks to riders; developing open OR platform tailored for supply chain operations and management; and matching users to developers for the service and algorithms on our platform. Operations Research Scientists have the opportunity to take on some of JDs most innovative and impactful problems relating to the OR decisions of the business. With great opportunity comes great expectations, we are looking for people with advanced OR degrees who are comfortable enough with research methodologies that they can pursue abstract business and engineering problems with acute precision, and who have the enthusiasm and initiative necessary to deliver those answers at JDs breakneck pace. You should have demonstrable OR background and be comfortable with the engineering development process.  Responsibilities:  Design, develop and deliver models for operational problems using modeling tools. Apply mathematical programming knowledges to design and provide decision support tools and software. Apply advanced data mining and optimization techniques to solve complex business problems including pricing, inventory, logistics, supply chain management, scheduling, etc. Utilizing code (Python, R, Java, C++ or another object oriented language) for modeling (optimization, simulation, statistical) and developing proof-of-concepts. Perform quantitative, economic, and numerical analysis of the performance of these systems under uncertainty using statistical and optimization tools such as Python and R to find both exact and heuristic solution strategies for optimization problems. Closely collaborate with other departments, integrate optimization algorithms with other deliverables into larger business solutions. Explain complex models and analysis using simplified terms, report and present to decision makers. Qualifications:  Ph.D. degree in Operations Research, Applied Mathematics, Industrial Engineering, Decision Science, Theoretical Computer Science, or other related scientific disciplines. 5+ years of industrial experience in applying operations research techniques to solve real-world problem. Research expertise in at least one of the following: optimization theories, planning, revenue management, inventory control, logistics. Experience implementing models through modelling languages. Professional experience in both academic and industrial settings is a plus. Experience applying optimization models for strategic and tactical business decisions is a plus. Demonstrated software development skills in a collaborative team environment, experience with programming in Python, R, Java, C/C++, or a similar language a plus. Exposure to scripting languages, relational databases and Linux. Experience with manipulating complex data sources and very large-scale data, Familiarity with technical tools for analysis - Python (with Pandas, etc.), R, SQL. Python skills and previous software engineering background a plus. Good communication skills with both technical and business people. Ability to speak at a level appropriate for the audience.About JD-Y team JD Y Division (JD-Y) focuses on building a smart supply chain and using AI to drive retail reform. The Y division applies AI algorithm and use data-driven approaches in product selection, inventory management, pricing and promotion. It also leverage big data technologies in smart retail to lower the costs of distribution. The Y division is working with leaders in industry and academia to design and build the next generation supply chain management system. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}