{"jobID": "2833944220", "jobLocation": "Zeeland_MI", "jobTitle": "Installation Technician", "companyRating": null, "companyInfo": {"Website": "www.odl.com", "Headquarters": "Zeeland, MI", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " It’s fun to work in a company where people truly BELIEVE in what they are doing! We’re committed to bringing passion and customer focus to the business. Position Overview: Sales and installation of retractable screens, decorative and clear door glass into existing doors, storm doors, and door hardware. Ensures display and POP material at the assigned home centers are neat and in presentable condition. Provides each customer with an exceptional customer experience. Manages time and territory in a professional manner; resulting in volumes that satisfy projected market growth goals. Participates in Home and Garden shows and predetermined home center functions. Educates and excites home center employees about Zabitat products and services. Essential Job Functions:Safely and efficiently perform remodel services including the installation of door glass, retractable screens, door hardware, and storm doors in residential homes. In addition, informs customers about and sells additional value-add products in order to achieve monthly and annual targets.Educate and build relationships with home center staff to increase their confidence in our products and services, which will in turn increase sales.Maintains home center displays, making certain that POP materials are available to consumers and displays are clean and function properly.Maintains company provided vehicle and tools in good working condition.Supports local and regional home shows. Provides ongoing field input regarding evaluation of existing products, recommended revisions, improvements, competitive activity and new products to assure that Zabitat remains a leader within the industry.This position is autonomous. The candidate must schedule and organize time in a manner that supports our customer’s needs, uphold all company policies and procedures, and demonstrate workplace flexibility.Typical work schedule will be Tuesday thru Saturday.Candidate Requirements:High school diploma.Minimum of two years’ general carpentry experience preferred with working knowledge of hand and power tools.Ability to work out of the home and travel daily. A valid driver’s license and clean driving record required. Will be provided a company vehicle.Strong verbal and written communication skills. Must be able to effectively communicate with Inho customers, homeowners, and peers.Excellent time management and organization skills. Ability to establish operating schedules and travel patterns that maximize productive time with customers and cost efficiencies.Ability to function independently, while being an enthusiastic team player.Strong computer skills.As a representative of the Zabitat organization, an affiliate of ODL Inc., you must present yourself in a professional manner, have an excellent attitude and a strong work ethic. Be outgoing and fun!As a growing organization, this position will evolve. The candidate must be flexible and open to change and also contribute their ideas and suggestions.Ability to lift up to 75 lbs. inHouz Technician.docinHouz Technician.doc"}