{"jobID": "2816480934", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Software Engineer - Big Data", "companyRating": "3.5", "companyInfo": {"Website": "www.placeiq.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "172000", "jobDescription": " PlaceIQ is a powerful, location-based audience and insights platform that organizes a wide variety of consumer activity data around a precise location base map at massive scale. PlaceIQ uses its detailed understanding of location and consumer activity to reach a targeted audience, and also to derive powerful insights about consumer behavior to inform market and business strategies for national brands. The company is headquartered in New York City and has offices in San Jose and Chicago. Summary: Having already assembled an exceptionally skilled, diverse and passionate team of developers and data scientists, we are looking for world-class engineers that can (or are willing to learn how to…) do it all. From web front ends to regression models/classification algorithms, complex data visualizations to geospatial clustering, a full stack enterprise targeting platform to big data analytics, PlaceIQ software engineers live for huge challenges and know how to deliver in a fast paced, agile environment. Our unique culture breeds excellence and embraces creativity as we look to innovate and drive our business forward. If you have a passion for imagining and building technology solutions that will make an immediate impact in an untapped space, we want to talk to you! The Role: As a senior member of our Engineering team, you will own the design, development and integration of the next generation Location Analytics Platform. Along with the technical chops necessary to build and deploy robust, high-performance, always available services that will scale to our clients’ needs, the ideal candidate will bring the “right” mix of creativity and development discipline to expand the standards of excellence that our Engineers and Data Scientists have already set.  We work in an agile environment focused on delivering high quality software through quick iterations. We don’t always stick to a particular programming language or adapt our requirements to fit within a particular technology stack. Software development, for us, focuses on the simple yet elegant solutions to complex problems. We rely on the most basic fundamentals of computer science every day while drawing from the latest and greatest breakthroughs in mobile/web/big data paradigms to build the absolute best in class platform for our clients.  At PlaceIQ, we empower our team members to extend beyond traditional functional boundaries so that we can build game-changing products. This means that our Engineers will need to put on their Product Manager hats to deeply understand the mobile ecosystem with an eye towards developing a major disruption. Our Engineers will also have to become Social Anthropologists/Analysts to uncover the hidden truths and behavioral patterns from petabytes of geospatial data. Minimum Requirements:BA/BS in Computer Science/Engineering or related technical fieldMinimum 3-5 years of industry experience with Java, Scala, Hadoop, HDFS, or SparkSolid database skills using RDBMS, SQL, and NoSQL frameworksFull lifecycle development experience building high performance/low latency data processing pipelinesExperience in UNIX/Linux environments with Bash/Python/Ruby scriptingSolid foundation in computer science fundamentals from data structures and algorithms to high-level design patternsDemonstrated ability to independently produce relevant technical designs from complex business requirementsPreferred Qualifications:Previous experience in big data or analytics spaceMastery of a Web Services Stack (any language)Previous experience managing teams of developersStrong knowledge of performance testing and processing optimization techniquesStrong experience developing complicated algorithmsExperience with functional languages (Scala, Clojure, Haskell)Experience working in an Agile development teamExperience in data design, data integration, and ETL"}