{"jobID": "2818797708", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sinai Library Digitization Project Data and Metadata Coordinator (SLDP-DMC)", "companyRating": null, "companyInfo": {"Website": "www.universityofcalifornia.edu", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number: 28148 Job Title: MUSEUM SCIENTIST, PRINCIPAL Working Title: Sinai Library Digitization Project Data and Metadata Coordinator (SLDP-DMC) Salary: $4,842 - $9,591 monthly Job Type: Contract Department Name: 5400-GENERAL LIBRARY Department Website URL: http://www.library.ucla.edu/about/jobs-ucla-library Job Summary Statement: Reporting to the Librarian for Digital Collections and Scholarship, the Sinai Library Digitization Project Data and Metadata Coordinator (SLDP-DMC) assists with the design and implementation of workflows for arrangement and description of Syriac and Arabic manuscripts digitized as part of the Sinai Library Digitization Project (SLDP). The Sinai Library Digitization Project Data and Metadata Coordinator works with colleagues in the UCLA Digital Library and with international partners to test and refine project workflows; coordinates and conducts SLDP data acquisition, data management, and day-to-day workflows within the UCLA Digital Library and with SLDP project partners; helps define and maintain project standards, workflows, and processes to ensure quality control (QC); and performs and oversees routine and continuous QC for data, metadata, and website functionality. As new manuscript descriptions are created, the SLDP-DMC works with the project team to ensure these descriptions adhere to project standards and prepares templates, guidelines, and provides other support for partners/stakeholders as needed; contributes to manuscript metadata by identifying and integrating existing sources of scholarly descriptions for Sinai Library Arabic and Syriac manuscripts; actively participates in outreach and planning related to the SLDP website and future Sinai Library Scholars Portal.  The Sinai Library Digitization Project (SLDP) is an international, collaborative effort to digitize and make available online the Syriac and Arabic manuscripts from St. Catherine's Monastery in Sinai, Egypt. This initiative will create the first comprehensive, interoperable digital library of manuscripts from the Monastery through the creation of a website of the digitized materials.  The UCLA Digital Library Program (DLP) serves as the catalyst for the creation, management, and delivery of digital content in support of the UCLA Library mission and goals. The Program provides for the storage and dissemination of digital objects, including text, images, audio, and video in their various digital manifestations and combinations. The UCLA Library provides a web presence for digital collections, and provides storage, backup and digital preservation support for all digital content accepted into, or developed by, the Library. Percentage of Time: 100 Shift Start: 8:00 am Shift End: 5:00 pm Qualifications for Position  13 Records Qualifications Required/Preferred Advanced degree in related field (Library/Information Science, Arabic or Syriac Studies, Manuscript Studies, or other relevant humanities field) or equivalent level of education and experience. Required Experience working with early manuscripts (description, digitization, research, etc.) Required Functional expertise, such as data management, command line tasks, scripting skills, quality assurance, quality control Required Excellent communication/collaboration skills. Excellent oral and written communication, specifically to communicate effectively with individuals from diverse backgrounds, to effectively present information in group settings and through project documentation and reports. Required Ability to explain technical concepts and teach project workflows. Required Demonstrated sound judgment and ability to work independently, set priorities and maintain them, and follow through on assignments. Ability to adjust priorities and procedures as directed by changing goals and objectives. Required Ability to initiate and maintain cooperative working relationships with co-workers, supervisors, and managers. Ability to work harmoniously and as a team player, thrive in a team-based environment, and skill in fostering teamwork among others. Required Ability to follow directions from supervisors (and to provide clear directions to staff and student employees). Required Ability to get to work reliably and on time and to be present in the workplace during normal working hours. Required Knowledge of standards, ontologies, and vocabularies for describing rare books and manuscripts. Preferred Bibliographic/reading knowledge of Arabic or Syriac. Preferred Familiarity with International Image Interoperability Framework (IIIF) standards/manifests. Preferred Experience working in a team setting on digital or technology-focused projects Preferred Additional Posting InformationBargaining Unit: 99-Policy Covered Application Deadline: 07-06-2018 External Posting Date: Quicklink To Posting: hr.mycareer.ucla.edu/applicants/Central?quickFind=73440 Special Instructions: This is a 2 1/2 year contract position. Contact information: Number of Positions: Special EmploymentDesignations/Requirements Per UC PolicyConflict of Interest: N/A Critical: Continued employment contingent upon completion of satisfactory background investigation. Driving Record: N/A E-Verify Check:  Certain positions funded by federal contracts/subcontracts requires UCLA to notify job applicants that an E-Verify check will be conducted and the successful candidate must pass the E-Verify check.  More Information This position does not require E-Verify check. CANRA:  Is this position designated as a mandatory reporter under CANRA? No Other Special Employment Requirements: Position is subject to performance standards and other requirements of the University wide Police Policies and Administrative Procedures.  Return to Search Results"}