{"jobID": "2800386857", "jobLocation": "Alsip_IL", "jobTitle": "Supply Chain Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.kikcorp.com", "Headquarters": "Elkhart, IN", "Size": "1001 to 5000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "COMPANY OVERVIEW: As one of North America’s largest independent manufacturers of consumer packaged goods (“CPG”), KIK helps a large portfolio of brands and retailers bring their products to life. With leading positions in the multibillion dollar household and personal care (“HPC”), over-the-counter (“OTC”), pool additives and automotive aftermarket categories, we serve over 100 CPG companies and several major North American HPC and automotive aftermarket retailers, including many of the leading players in their respective categories. We have full-service capabilities covering end-to-end contract manufacturing, including project management, innovation and R&D;, sourcing and procurement, blending and compounding, filling and packaging, supply chain and distribution, and quality control. Our manufacturing model is highly flexible and we consistently add value to our customers by leveraging our range of services and expertise. KIK has over 5,000 employees and operates 29 manufacturing facilities strategically located throughout North America. KIK Consumer Brands – Automotive Division Our Automotive business is comprised of the Prestone® and Holts® businesses. We develop, manufacture and market antifreeze/coolant and other automotive functional fluids and car appearance products in North America and key international markets. Prestone® is the number one branded consumer choice for antifreeze/coolant in North America. Other brands in our Automotive Care business include Holts®, Redex® and Simoniz® (outside North America). POSITION SUMMARY The Supply Chain Data Analyst assists in implementation of supply chain improvements to drive better reporting across the organization. Responsibilities include providing various business and functional leaders with strategic guidance by establishing reporting, analyzing metrics and gathering and analyzing data from multiple systems. By managing and developing various KPIs and metrics and providing reporting to all levels of the business, the individual in this role can make a significant impact in Prestone’s Supply Chain. Interact with key team members and functional leaders to determine reporting needs for KPIs.Design reports for customer service metrics which present the data in the most meaningful way, taking into account level of detail, scope of data, presentation and audiences for whom the metrics are targeted.Enhance forecast accuracy reporting. Including, creating efficient and effective reports, analyzing month end results and sending out monthly reports to appropriate parties.Develop best business practice methods for extracting data for reporting, including methods to consolidate data from various systems and files.Publish metric reports according to needs of the business and functional groups.Create and publish ad-hoc reports as needed.Analyze data to help uncover trends and improve granularity of data.Maintain AIS rules in the E1 system including reviewing and updating obsolete items.Assist Customer Service with order changes/questions as needed.Bachelor’s degree in business or related field (Supply Chain preferred)3-5 years Supply Chain or data analyst experience (Manufacturing preferred)Experience with creation of queries, reports and data extraction from ERP systems – JDE preferred.Experience with S&OP; processesStrong sense of self-motivation and ability to work both independently and in a team setting. Must also be able to multitask and prioritize efficiently.10% - 15% travel required.Ability to take initiative to solve problems and create reporting from an infancy stageProficiency with MS Office applications (Word, Excel, Power Point and Access)Advanced Excel skills. Ability to write advanced formulas and macros (VBA a plus)Excellent verbal and written communication skillsA Career with KIK Offers: KIK offers very competitive salary and comprehensive benefits including health, wellness, dental, vision, life, and disability insurance. You can plan for your future with KIK's retirement savings options including employer match. KIK also recognizes the importance of continuing education and offers Education Assistance to our employees to encourage continued personal development and growth.  Thank you for your interest and consideration of a position with KIK Custom Products.  KIK is an Equal Employment Opportunity / Affirmative Action employer. Qualified applicants will receive consideration for employment without regards to race, color, age, religion, sex, or national origin."}