{"jobID": "2819531647", "jobLocation": "East_Hanover_NJ", "jobTitle": "Associate Scientist I", "companyRating": "3.3", "companyInfo": {"Website": "www.mondelezinternational.com", "Headquarters": "Deerfield, IL", "Size": "10000+ employees", "Founded": " 2012", "Type": " Company - Public (MDLZ) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " PepsiCo, Mars, Nestlé"}, "estimatedSalary": "60000", "jobDescription": " With our portfolio of global Power Brands such as Oreo and belVita biscuits, Cadbury Dairy Milk and Milka chocolate and Trident gum, we're the world's #1 in biscuits and candy, and #2 in chocolate and gum. We're Mondel?z International, a snacking powerhouse with operations in more than 80 countries, with approximately 90,000 employees globally and our brands are marketed in around 165 countries.  Our purpose and vision is to create more MOMENTS OF JOY by building the BEST SNACKING COMPANY IN THE WORLD.  Research, Development, Quality&Innovation;  In Research, Development, Quality&Innovation; (RDQI), your skills can be the special ingredient that brings our brands to life. As part of a fantastic team of scientists, engineers and nutritionists, you'll work tirelessly on product design or development, process development, quality, nutrition, sensory and food safety aspects to ensure we deliver a consistent, delightful consumer experience. RD&Q; is where you'll turn great ideas into brilliant brands.  The Global Consumer Inspired Quality (CIQ) Associate Scientist I will support gum and candy product development initiatives by participating in development activities required to ensure superior product quality, from scoping through bench top, pilot plant, and production startup. Experience in food ingredient functionality, formulation, and/or commercialization is preferred. The candidate will take an active role in supporting work required to evaluate and develop solutions that deliver great gum and candy products with technical excellence.  The individual should be capable of working collaboratively with cross-functional teams, applying technical expertise to solve complex problems, and developing and sharing best practices with the global technical community. They should be capable of identifying and utilizing necessary resources to achieve timely delivery of project objectives, planning and executing work plans with some supervision. Personal drive, organization, problem solving skills, and excellent communication skills will be keys to success in this role.  Primary responsibilities and % of time Develop gum formulations by defining and executing experiments based on project objectives with some supervision. This includes experimental design and execution of bench top, pilot plant and plant trials at required facilities. Individual will be responsible for planning out testing procedures, ordering materials, and ensuring equipment is available to complete work in anticipation of needs in order to provide the required data and results for project. Travel is required for project work (20%). 60%Coordinate formal and informal sensory and analytical testing as necessary per project with cross functional partners. Design and conduct stability studies to ensure global product readiness. Anticipate potential problems and determine next steps in order to address technical issues across regional markets. 10%Synthesize technical information by collecting data, preparing reports, revising results, and drawing conclusions that will be utilized by cross functional teams to decide proper steps for implementation. Data should be recorded via Mondelez specifications and documentation systems. 10%With some supervision, take ownership of smaller projects or work tracks that support wider programs to drive gum and candy product quality initiatives forward. 10%Develop strong cross functional relationships within RDQI groups in order to create a strong technical network in order to understand technical challenges with gum and ingredient interactions. Awareness of projects/ technical tools to help expedite information transfer across regional teams. 5%Participate in team meetings and provide timely and thorough updates. Confirm all work is in compliance with Mondelez standards, including safety, specifications, and documentation. 5% Education Level  Bachelor's Degree (4 Yr) - Required  Master's Degree - Prefered  Experience Bachelor's Degree - General Work Experience or Relevant InternshipMaster's Degree - Functional Work Experience Competencies/Abilities Bachelor degree in Food Science, Food Engineering, Chemistry, or Chemical Engineering with 1 or more years of working or intern experience in product development or related R&D; field or Master's degree in Food Science with intern experience in product development or related R&D; field.Ability to synthesize data from a variety of sources to solve problems. Demonstrated strong ability in executing experiments. Working knowledge of chemistry and an ability to leverage it to resolve technical issues.Ability to be self-directed, forward thinking, and make decisions that drive projects.Excellent oral and written skills. Ability to communicate to all levels within the organization and to build effective relationships with team.Strong project planning and management skills. Organized and able to communicate work status at any point throughout the project. Mondel?z Global LLC is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, gender, national origin, disability, protected Veteran status, uniform service, sexual orientation, gender identity, gender expression, genetic information, or any other characteristic protected by law. Applicants who require accommodation to participate in the job application process may contact 847-943-5460 for assistance.  Applicants must complete all required steps in the application process, including providing a Resume/CV, in order to be considered for this position."}