{"jobID": "2786922644", "jobLocation": "San_Francisco_CA", "jobTitle": "Velocity Account Executive", "companyRating": null, "companyInfo": {"Website": "www.zendesk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZEN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Freshdesk, RightNow Technologies"}, "estimatedSalary": null, "jobDescription": "Were looking for a motivated self-starter who has a consultative sales approach, provides an outstanding customer experience and offers polished presentation skills. You'll be single-handedly managing an inbound pipeline of sales opportunities and expansion on existing customer accounts across a very large customer base. Qualified candidates will bring a proven track record in sales achievement, Software/SaaS a plus.Responsibilities Exceed activity, pipeline, and revenue goals on a monthly basisBecome an expert on Zendesks products and conduct discovery calls, presentations, and demos with prospects and customersRespond to a high volume of inbound leads and existing customersContinue to build pipeline of new business, upsell, and cross-sell opportunitiesDevelop and manage relationships with accounts in your book of businessBe the voice of the customer; understand their needs and make them heroesTrack all opportunity and customer details including use case, purchase time frames, next steps, and forecasting in Salesforce Required Bachelors degreeExcellent verbal and written communications skills2+ years of full cycle sales experience; software/SaaS experience preferredPassion for technology and quick ability to learn tools and processesExceptional organizational skills, with the ability to multi-task a high volume of opportunities at all timesAbility to thrive in a face paced environment; you move quickly, think strategically and are superb at tactical executionZendesk builds software for better customer relationships. It empowers organizations to improve customer engagement and better understand their customers. Zendesk products are easy to use and implement. They give organizations the flexibility to move quickly, focus on innovation, and scale with their growth. Based in San Francisco, Zendesk has operations in the United States, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.The best customer experiences are built with Zendesk. Zendesks powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesks use of your personal information."}