{"jobID": "2812308605", "jobLocation": "Chicago_IL", "jobTitle": "Senior Environmental Engineer / Geologist / Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.aecom.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1990", "Type": " Company - Public (ACM) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Bechtel, ABB, Louis Berger"}, "estimatedSalary": "89000", "jobDescription": "*Business Line** Environment*Position Title** Senior Environmental Engineer / Geologist / Scientist United States of America - Illinois  Chicago *Job Summary** AECOM is seeking a Professional Engineer or Professional Geologist to join our Remediation Practice based in Chicago, IL. We are seeking candidates who will be able to take on leadership roles on projects and within the department. The demonstration of successful past experience and leadership will be key attributes that can be supported by technical qualifications in remediation engineering or geology/hydrogeology. We desire a candidate who can be the technical lead for their discipline, and have the skills to create a broader technical team to fulfill project needs and objectives.  The responsibilities of this position include, but are not limited to:  + Assist business line managers to develop new business, including marketing to potential and existing clients and be integral in process of securing and managing clients and contracts.  + Proactively identify opportunities to increase project efficiencies, improve technical methodologies and add value to client service offerings  + Assist with development of junior staff through ongoing mentoring.  + Work collaboratively with other members and teams within the department, and other professionals within other AECOM internal business lines.  + Acting as Project Manager on large, complex projects in fiscal management, client liaison, reporting requirements, and coordination with project team members.  + Full technical and project management responsibility for soil, groundwater, and vapor investigation and remediation projects, including planning, scheduling, and coordination.  + Coordination and preparation of written reports, work plans, and technical memorandums and analysis of data and development of supported conclusions.  + Undertake technical work in accordance with the contracted scope of work, budget, schedule and legislative standards  + OSHA 40-hour HAZWOPER certification and Supervisor certification *Minimum Requirements** + Bachelor's degree in chemical, civil, or environmental engineering or geology  + 10+ years of experience in an environmental engineering consulting company  + Professional Engineering or Professional Geology license in Illinois  + Seller-doer with business development and client management experience  + Experience as a project manager and technical lead on investigations, feasibility studies, remedial design, and/or remedial action oversight  + Successful experience of project management, organization of field programs, and their involvement in business development and marketing initiatives  + Strong understanding of remediation system design, cost estimating, construction, and OM&M;  + Project experience working with state and federal agencies, and state and local, and private sector clients  + Ability to work independently, make sound decisions  + Strong, effective writing and speaking skills  + Strong leadership skills, including staff development and mentoring  + Due to the nature of the work, US Citizenship is required *Preferred Qualifications** + Masters Degree in Engineering or Geology  + 15+ years' experience preferred  + Professional Registration in State of Indiana  + Demonstration of development and adherence to robust safety standards and procedures  + Experience with the Illinois Site Remediation Program is preferred  + Experience with VI investigations and mitigation in Illinois *What We Offer** AECOM is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes AECOM a great place to work and grow. AECOM is an Equal Opportunity Employer.  At AECOM, employee's safety and security are our top Safeguarding core value. All employees are expected to set the highest level of safety expectation in their work, display the highest level of safe behavior, and actively participate in AECOM's Safety For Life Program. SH&E; is a part of our company culture and participation is required for all employees.  _NOTICE TO THIRD PARTY AGENCIES: Please note that AECOM does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, AECOM will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, AECOM explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of AECOM._ *_Job Category_** _Sciences_*_Business Group_** _Design and Consulting Services Group (DCS)_*_Country_** _United States of America_*_Position Status_** _Full-Time_*_Requisition/Vacancy No._** _189159BR_ _Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status._"}