{"jobID": "2622982047", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate", "companyRating": "4.5", "companyInfo": {"Website": "www.marxokubo.com", "Headquarters": "Denver, CO", "Size": "51 to 200 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " An Associate is a licensed Architect, Engineer, or Construction Manager, and is responsible for understanding all aspects of the project being reviewed relative to its scope and client requirements. Act as technical team member and small project lead.Collaborate with the client, internal team, consultants, and site contact, and is responsible for an overall understanding of their project.Review and analyze building construction and condition.Review and analyze contract documents including drawings, specifications, contracts, and budgets.Perform construction monitoring and property condition assessments.Preparation of formal reports. Our work covers most commercial building types, including office, retail, industrial, hotel/hospitality, and multi-family. Desired Skills and ExperienceBachelor degree in architecture, civil engineering, construction management or related field is required.Minimum 5 years of industry related experience at an architecture, engineering, or construction company.Technical level of understanding of most building types in order to perform services of the organization with limited supervision.Good understanding of Construction processes and activities. Construction administration experience.Good understanding of building materials and methods.Ability to work under deadlines in a fast-paced environment.Good understanding of the technical aspects of building enclosures, structures, and systems.Knowledge of construction contract types and forms.Proficient in Microsoft Office, particularly Word and Excel.Proficient in AutoCAD; Bluebeam, Plan Grid, and BOX.Strong organizational skills.Strong verbal and written communication skills. Compensation will be commensurate with qualifications and experience. The ability to travel out of town is a requirement for the position.  To apply, please submit a resume to sanfranresumes@marxokubo.com."}