{"jobID": "2803055019", "jobLocation": "N_o_n_e", "jobTitle": "Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.maximus.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MMS) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " MAXIMUS is looking for a Data Scientist to make sense of our operational data using advanced analysis to identify meaningful and actionable insights - advancing operational performance and promoting a culture of data-driven decision making. In this role you will support government service operations and create data-driven products that help our customers improve their program performance and have measurable impacts on the lives of the beneficiaries we service. This role will work with a team to produce leading analytic practices and solutions that will become part of our core product capabilities. You will research, design, and implement analytical findings to optimize program performance and improve operational processes. In addition, the role will help in applying analysis and data science to related fields and support analyst peers. The position is expected to travel up to 25% of their time. International travel is possible. Apply advanced methods to analyze operational data and derive meaningful, actionable insights for stakeholders and business development partnersServe as subject matter expert (SME) in the area of data and analytical product usage for peer analysts and operational stakeholders - particularly in the appropriate uses and limitations of statistical and analytical applicationsAttain a high degree of knowledge about MAXIMUS data infrastructureDesign and develop data queries, cubes, etc. using data warehouse, business intelligence, and analytical products to fulfill ad-hoc data requestsAnalyze extracted data, review for accuracy and look for trendsProvide insights and analyses around operations and project dataParticipate in the data science product development review process, in particular implementing code review, testing, and data profiling of newly developed productsDevelop and implement metrics, functions, and scripts as KPIs and in existing BI/Dashboards as neededInform operational partners on product performance as well as product usage trendsConsult with analytical leaders to understand current and future business goals and strategies, and ensure that methods and work products are alignedBalance accuracy of analysis with needs for rapid responseDevelop partnerships with technical peers and business partnersPerform other duties as assignedBS in a quantitative field such as Statistics, Mathematics, Operations Research, Economics, Computer Science, Machine Learning (or similar)3-5 years of experience performing quantitative data analysisAbility to present data in a simple, clean, concise visual and written mannerExposure to machine learning techniques and algorithmsExperience with common data science toolkits, such as R, Weka, Python/NumPy, MatLab, etcStatistical experience and understanding of distributions, statistical testing, regression, etc.Proficiency in using query languages such as SQL and use of relational databases and SQLExperience quantifying and prioritizing projects that require heavy data analysisExperience working directly with business users and requirements documentationA strong passion for empirical research and for answering complex questions with dataExperience with government sponsored health care programs and operations desirable Active military service members, their spouses, and veteran candidates often embody the core competencies MAXIMUS deems essential, and bring a resiliency and dependability that greatly enhances our workforce. We recognize your unique skills and experiences, and want to provide you with a career path that allows you to continue making a difference for our country. Were proud of our connections to organizations dedicated to serving veterans and their families. If you are transitioning from military to civilian life, have prior service, are a retired veteran or a member of the National Guard or Reserves, or a spouse of an active military service member, we have challenging and rewarding career opportunities available for you.  A committed and diverse workforce is our most important resource.  MAXIMUS is an Affirmative Action/Equal Opportunity Employer.  MAXIMUS provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disabled status. "}