{"jobID": "2836560815", "jobLocation": "Richardson_TX", "jobTitle": "Manager Analytics Consulting", "companyRating": "3.2", "companyInfo": {"Website": "www.hcsc.com/careers/index.html", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " UnitedHealth Group, Aetna, Humana"}, "estimatedSalary": "128000", "jobDescription": " Description: BASIC FUNCTION:This position is responsible for the timely and accurate collection, flow and processing of data for risk adjustment, including Medicare and retail. The Manager will establish, monitor, and maintain the processes, systems and services that collect and process the data from claims, encounters, electronic medical records, medical record coding, Health Evaluation Program Assessments, and in home assessments for the purpose of risk adjustment and revenue optimization. Reporting and maintaining compliance is also a responsibility of this position. The Manager will work collaboratively with other departments. JOB REQUIREMENTS:*Bachelor Degree in Math, Actuarial Science, Business Statistics, Accounting or Finance OR 4 years experience.*5 years experience interfacing with external clients, large employers, brokers, or consultants OR 5 years experience in presenting analytic results to both internal and external audiences.*5 years experience in requiring data analysis and information reporting related to healthcare data.*2 years leadership experience. *Negotiation, decision-making, organizational, and analytical skills.*Verbal and written communication skills, including presentation skills.*PC proficiency to include Access, Excel, Word, and PowerPoint.PREFERRED JOB REQUIREMENTS:* 3 years experience working in Risk Adjustment in a healthcare environment.* Proficiency with risk adjustment methodologies* Knowledge of coding, HCCs, risk adjustments concepts, medical record review project management, encounter data management, compliance audit concepts.* 1 year management experienceThis position is based in Richardson, TX.Sponsorship will not be provided for this position.*CB  *CA*  Location: TX - Richardson  Activation Date: Tuesday, June 19, 2018  Expiration Date: Saturday, July 14, 2018 "}