{"jobID": "2826014207", "jobLocation": "Houston_TX", "jobTitle": "Junior Environmental Scientist/Geologist/Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.ghd.com", "Headquarters": "Sydney, Australia", "Size": "5001 to 10000 employees", "Founded": " 1928", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " With more than 8500 people across five continents and the Pacific region, GHD is one of the worlds leading engineering, environmental and construction services companies. Committed to the success of our clients and the communities in which we operate, we have an ongoing requirement for high caliber professionals to join our connected global network.  We have an opportunity in our Houston, TX office for a Geologist/Environmental Scientist/Environmental Engineer, who aspires to become an active employee in a vibrant, well-established company. The successful candidate will be responsible for:Providing field support for environmental services projects to include field data collection and documentation for environmental site assessments (Phase I and Phase II) and remediation Preparation of technical correspondence, project proposals, technical reports, work plans, and project specifications including cost estimates and budgets Data compilation, reduction, interpretation, evaluation/comparison to environmental regulatory standards Interpretation and implementation of environmental regulations, including RCRA and CERCLA Knowledge of TCEQ TRRP a plus Coordination of small to mid-size projects including maintenance of project schedules and budgets and coordination of project staff Fully participate in the GHD Behavioral Based Safety ProgramSkills, Competencies, Qualifications:BS or MS in Environmental or Civil Engineering, Geology, or Environmental Science with an interest in site investigation and remediation 3-5 years of experience Experience in site investigations and remediation preferred Strong problem solving abilities and aptitude Ability to present technical information, both written and orally, in a concise and professional manner Must have strong technical writing skills Ability to effectively communicate with other technical professionals and clients Positive attitude, very strong interpersonal skills Willingness to travel (40% office, 60% field) Self-starter, flexible team player, willing/able to work on a wide variety of tasks OHSA 40-hour HAZWOPER training considered an asset Must reside in Houston or surrounding area As a multicultural organization, we encourage individual achievement and recognize the strength of a diverse workforce. GHD is an equal opportunity employer. We provide equal employment opportunities to all qualified employees and applicants without regard to race, creed, religion, national origin, citizenship, color, sex, sexual orientation, gender identity, age, disability, marital status or veteran status.  To apply please attach your resume and covering letter via the link below. This position does not offer visa sponsorship.  #LI-DW1"}