{"jobID": "2818973013", "jobLocation": "Los_Angeles_CA", "jobTitle": "Client Service Associate, Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.firstpacad.com", "Headquarters": "Los Angeles, CA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "20", "jobDescription": " For consideration, please submit your resume to ...@fpa.com The primary responsibilities of the Client Service Associate, Data Analyst include the following: Calculate monthly and quarterly characteristics, performance and statistics across multiple firm products by utilizing Bloomberg, Cap IQ, Morningstar and FactSet. Compile data for Due Diligence Questionnaires (DDQs), Request for Proposals (RFPs), and consultant databases. Assist private fund team with processing and tracking subscriptions/redemptions/transfers of private fund clients. Process private fund onboarding documents while closely interacting with the funds administrator. Distribute marketing materials through the Client Relationship Management System (CRM) including distribution of monthly fact sheets, quarterly transparency reports and commentaries. Update and maintain marketing materials master data spreadsheets. Maintain and update the client databases in internal CRM system and administrator s portal. Maintain and update the data on the private funds website Coordinate and work closely across groups and departments including performance, portfolio accounting, and marketing. Qualifications: Strong analytical and problem solving skills with acute attention to detail, accuracy and quality of work. Familiarity with investments and accounting concepts as well as high degree of technical knowledge including ability to quickly learn new software applications/systems. Proficiency in Microsoft Office applications including intermediate to advanced Excel skills Experience with industry specific analytical tools including FactSet and Bloomberg preferred Excellent verbal and written communication skills Adept at working in a team environment with varying functional levels bearing common interests and respect for fellow team members. Highly motivated with demonstrated initiative, independence and adaptability. Bachelor s degree in finance, accounting, economics or related field 1-3 years related experience with relevant data analysis experience preferred First Pacific Advisors (FPA) is a Los Angeles-based institutional money management firm, employing a disciplined approach to value investing, prudently seeking superior long-term returns while maintaining a focus on capital preservation. FPA manages approximately 31 billion across multiple strategies and has about 87 employees. FPA is an Equal Opportunity Employer FPA s Client Service department provides support to prospects and clients, portfolio managers, sales staff and relationship managers by performing operational and administrative functions for our strategies, funds, and/or managed accounts. We are looking for a Client Service Associate, Data Analyst who has a strong technical acumen with a team-oriented approach. The Client Service Data Analyst will be primarily focused on calculating, compiling, updating and maintaining data from multiple sources across varying product types across the firm. The data will be used for marketing materials, client reporting and consultant databases."}