{"jobID": "2582272118", "jobLocation": "Zeeland_MI", "jobTitle": "Project Manager / Project Engineer", "companyRating": null, "companyInfo": {"Website": "www.plascore.com", "Headquarters": "Zeeland, MI", "Size": "201 to 500 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Plascore Incorporated, is seeking a technical professional to join our team as a Project Manager / Project Engineer servicing our Cleanroom Architectural product lines. As one of the leading modular Ceiling, Wall and Door supplier for both the Semiconductor and Pharmaceutical industries Plascore has established itself through product innovation, quality and customer service. Responsibilities for this position include; Customer contact, inside sales, design review, estimating, preparing detailed quotations, contract review, project coordination, as well as assisting in the implementing and managing product design solutions.  This position is an opportunity for a designer to further his/her experience in the following: In addition to working with customers this position also works closely with our engineering, purchasing, scheduling, shipping and manufacturing teams. This Project Manager / Project Engineer will be responsible for all aspects of the project from beginning to end. The position offers a fast pace environment with a cross between Project Coordination and CAD Design within the field construction allowing for an individual to develop and utilize multiple skill sets within the same position. Receiving incoming project/product inquiriesWork with sales and customers to gather the customers' scope of work and other information needed to quote projectsCoordinate new and existing customer projectsTracking lead informationSpecification reviewCompletion of project take offsQuotation preparationQuotation follow upContract reviewGeneration of construction drawings from customer sketches, drawings or electronic imagesCoordination of project schedulesContinuous improvement activitiesInternal coordination of work between Purchasing, scheduling and manufacturingCoordination of shipments between the customer and the shipping departmentExperience: The preferred candidate will have an Associates or Bachelor Degree in construction management, architecture, or an engineering field and proven experience and proficiency with the following skills: Ability to read and interpret drawings,Extensive experience with AutoCAD or SolidworksCreating and maintaining Excel spreadsheetsOutstanding organizational and time management skillsAdditional Requirements:Must be eligible to work on programs subject to ITAR Regulations. Therefore, candidates must be a U.S. Citizen or a U.S. Permanent Resident ('Green Card'). Interested candidates with varying technical qualifications and experience will be considered.  Plascore, Inc. has established itself in the Cleanroom Architectural Products, Aerospace, Automotive and Marine industries as a global manufacturer of honeycomb core and light-weight panels.  We offer a competitive compensation and benefits package. For more information about our company, please visit our website at www.plascore.com .  We are an EEO employer dedicated to workforce diversity.Job Posted by ApplicantPro"}