{"jobID": "2707731369", "jobLocation": "San_Francisco_CA", "jobTitle": "Talent Analytics Consultant", "companyRating": "4.6", "companyInfo": {"Website": "www.lever.co", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Greenhouse Software, SmartRecruiters, Jobvite"}, "estimatedSalary": "138000", "jobDescription": "Lever, at its core, is a customer-driven company. Our customers inspire us to iterate, implement feedback, and drive forward to make Lever the best it can be. Having recently raised $40MM in our Series C, we’re growing our Customer Success organization and looking for a Talent Analytics Consultant to add to our Enterprise Solutions team. The Enterprise Solutions team works with some of our largest customers to help them make meaningful and sustainable change to their Talent Acquisition efforts with proven methodology, domain expertise, and global adoption. The Talent Analytics Consultant is a specialist, with deep expertise in data analytics, and an important member of a customer’s implementation team. The Talent Analytics Consultant helps customers elevate problem-solving and decision making by unlocking insights through custom data visualizations they build on top of the talent analytics available in Lever.Our Talent Analytics Consultant will own building out custom data visualizations using Lever Talent Intelligence, consulting with customers on how to build out their own analytics repositories via the Lever Data API, and assist customers in building out custom reports using data available via the Lever Hire. This is a unique opportunity to start from the ground up; this person will help define and shape the role and how a Talent Analytics Consultant will participate in our customer implementations and contribute to our methodology. This is a highly cross-functional role that will work closely with our Solutions Architecture, Service and Support and our Implementation teams.Our Talent Analytics Consultant has strong analytical skills with a proven track record of developing impactful data visualizations, surfacing key insights and engaging customers with analysis leading to data-informed decisions. They thrive working with the building blocks of data, data relationships and data aggregations and enjoy building out data analytics and business intelligence solutions in data visualization tools such as Tableau and / or Looker. Our Talent Analytics Consultants work closely with senior talent and recruiting operations leaders along with leadership from other functional areas such as Sales in the Customers they serve. With such a rapidly growing customer base and so much growth ahead of us, there’s a lot of complexity and opportunity to make sure each and every customer is as successful as possible, and we’re looking for someone who is excited by this challenge!WITHIN 1 MONTH YOU'LL... Attend Ramp Camp, Lever’s week-long version of on-boarding. You’ll learn about all aspects of the business with a cross-functional group of new Leveroos. You’ll also get a chance during this week to kick off your first Lever project.Shadow five (5) Implementation Specialist calls and/or training sessions across medium and large customers to build understanding of customer implementation steps, key milestones, systems, processes, and the differing reporting needs by company size.Review tickets for the last sixty (60) days related to Lever Talent Intelligence, Lever Data API and Lever Reporting with Technical Support to build your understanding of the type of questions being asked, product feedback, issues, and the underlying data relationships.WITHIN 3 MONTHS YOU'LL... Get Product Certified for Lever Hire, Lever Reporting and Lever Talent Intelligence after learning the product and demonstrating proficiency through immersive hands-on sessions with product certified Implementation Specialists.Orient yourself around the mission, goals, norms, strengths, and saboteurs for the Solutions Enterprise team and develop your own Individual Impact Plan in partnership with your manager.Complete your first full lifecycle customer engagements with new and existing customers including discovery, design, development and deployment of custom talent analytics dashboards along with training for those dashboards.WITHIN 6 MONTHS YOU'LL... Engage customers in the outcomes of your custom dashboard projects, coaching them to explore the reports, explain the results and highlight the good, and suggest ways a customer can adapt their use of Lever to improve performance reflected in the dashboard.Contribute to the Lever implementation methodology by defining the milestones, activities, discovery questions, design specification templates, and training materials for custom dashboard development with Lever Talent Intelligence.Improve Customer understanding of the most important talent acquisition metrics, the related recruiting activities which impact those metrics, the Lever application workflows related to the recruiting activities, and underlying data captured along the way.Establish and start contributing to a knowledge base of common data visualization templates based on customer engagements.Engage and advise Customer IT teams on how to leverage data available from Lever’s Data API to build out Talent Analytics metrics in their data warehouse.Capture, synthesize and share customer feedback with Lever’s Product team to help inform and shape Lever’s Talent Analytics roadmap.WITHIN 12 MONTHS YOU'LL... Partner with the VP of Solutions and Senior Implementation Specialists to develop and introduce a new service offering to help customers identify and eliminate data hygiene and improve workflow adherence problems which impact the quality and accuracy of Lever talent analytics.Partner with the VP of Solutions to develop an on-boarding program for new Talent Analytics Consultants.Collaborate with Lever’s enablement team to maintain and evolve Lever’s Product Certification program for Lever Talent Intelligence.Partner with Research and Development and Solution Architecture to stay abreast of the Lever analytics product roadmap and the release of new features.IS THIS ROLE NOT AN EXACT FIT?Sign up to stay in touch, we’ll let you know when we have new positions on the team.THE LEVER STORYLever builds modern recruiting software for teams to source, interview, and hire top talent. Our team strives to set a new bar for enterprise software with modern, well-designed, real-time apps. We participated in Y Combinator in summer 2012, and since then have raised $73 million. As the applicant tracking system of choice for Netflix, Eventbrite, ClearSlide, change.org, and thousands more leading companies, Lever means you hire the best by hiring together.We are proud to be an equal opportunity workplace committed to building a team culture that celebrates diversity and inclusion. Take an inside look into life at Lever."}