{"jobID": "2791843573", "jobLocation": "Hoboken_NJ", "jobTitle": "Sportsbook Operations Analytics Manager", "companyRating": "4.1", "companyInfo": {"Website": "www.draftkings.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " FanDuel"}, "estimatedSalary": "98000", "jobDescription": " DraftKings, the worlds leading Daily Fantasy Sports provider with over 10 million users, is preparing to build upon our leading US sports brand by launching a new Sportsbook product! We are looking for an All-star caliber experienced hire to join our Sportsbook Operations Analytics team. As the Manager, Sportsbook Operations Analytics, you will lead a team responsible for analyzing various areas within our Sportsbook Operation, including Betting Market Demand, Player Behavior and Profiling, Risk Management and Trading Performance, building best in class business analysis and insight tools and models. Your analysis will drive superior understanding and improvement of the performance of the Sportsbook Operations, in our effort to deliver customers the leading Sportsbook experience in the US.  The Sportsbook Operations Analytics Manager is a key role within the DraftKings Sportsbook organization, championing and reinforcing the data-driven culture of the organization. The right candidate will be exceptional in the areas of both Business Consulting and Data Analysis. You will play a key role in modeling and forecasting the performance of our Sportsbook business. You will oversee and drive the performance of our Sportsbook Operations as we operate our platform day to day. Through regular performance reporting, you will measure and report out on results in various areas, including Revenue Management, Risk Management and Trading performance, with exposure all the way up to Senior Executive leaders. Your Sportsbook Operations analysis roadmap will be focusing on finding key insights that dramatically improve our Sportsbook Operations. You will influence to drive strategic direction and change. Your work will improve the Sportsbook experience for a platform that will engage millions of American sports fans. We will be #1 in the US this new and exciting market, and we want the best talent in from day one, on the ground floor to help us win. Key responsibilitiesBuild a group within the Sportsbook Operations Analytics team with All-star analysts, analyzing various areas of Operational performance and developing the teamSet up and own analytics tools and reporting capabilities for the Sportsbook Operations team, focusing on Revenue Management, Market Demand, Player Behavior and Profiling, Risk Management and Trading performance on the platformOversee the development of new technology, models and capabilities to solve Operational problems and drive data-driven business decision makingOversee Operations performance measurements including betting demand and profitably performance by Sport, Bet type, and MarketMeasure and report on offers and promotions, including free bets, deposit bonuses, and seasonal promotions to drive KPIs like active pay players and average betting handleUnderstand various player profiles in the Sportsbook customer base, based on behaviors, including understanding key LTV drivers and behaviors that will unlock higher customer LTVProvide opportunity size and other analysis into major promotional events to help the Sportsbook team capitalize on major sporting events in the US, including Super Bowl, Masters, and moreSupport the team with other ad-hoc analysis as neededQualificationsBachelors Degree in a STEM / quantitative field3-5+ years in ecommerce, gaming, or digital operations and or marketing analytics, including at least 1 year in a role managing 1+ analystsSportsbook or real-money gaming experience strongly preferredLive the value of analytical cultureAbility to competently manage and develop 1+ AnalystsExperience building infrastructure, models and frameworks to measure performanceStrong communication and influence skillsPassion for many different sports and a reasonably strong insight into the customer"}