{"jobID": "2815733035", "jobLocation": "Fort_Worth_TX", "jobTitle": "E2173:Data Warehouse Analyst Sr", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "76000", "jobDescription": " E2173:Data Warehouse Analyst Sr  14-Jun-2018 Req ID437671BRLMCareers Business UnitESS6500 RMSWork Schedule FLEX-Non-Standard 40 hour week Security Clearance Secret Shift First Direct/Indirect Direct Business Area Rotary and Mission Systems Department 70056:Logistics Relocation/Housing Stipend Available Possible Job Code/Title E2173:Data Warehouse Analyst Sr Job Class Logistics Job Category Experienced Professional Program F-35 Sustainment Industry Job Title Data Warehouse Analyst Sr Req Type Full-Time Job Description At Lockheed Martin Mission Systems and Training, we are driven by innovation and integrity. We believe that by applying the highest standards of business ethics and visionary thinking, everything is within our reach – and yours as a Lockheed Martin employee. Lockheed Martin values your skills, training and education. Come and experience your future!  The selected candidate will be responsible for providing technical Engineering knowledge and skills supporting F-35 Program Sustainment Data Product Integration & Delivery (SDP I&D;) and Sustainment Support activities within the Data Quality & Integration Management (DQIM) Team's LDM & Supplier Integration group. The candidate will perform Sustainment Data Product (SDP) integration, research/analysis, processing, and handling data exchanges between Program Stakeholders and Systems, Suppliers, Teammates, Propulsion System Contractors, Internal Data Authors and Operational Sites.  Specific tasks include, but as a minimum: Support coordination with assigned users, application teams, and Suppliers, to understand issues and needs; prioritizing, determining solutions, and implementation of Electronic Equipment Logbook (EEL) resolution.Support reviews, processing, and pursue approval for delivery of F-35 SDP to support aircraft or equipment deliveries and site operations or JSF site standup. to include, but not limited to:Perform data modeling/mapping/mining and Extraction, Transformation and Loading(ETL) activitiesApply data quality forensics and participate in assessments of SDP and/or Supplier data submissionsSupport coordination with assigned users, application teams, and Suppliers, to understand issues and needs; prioritizing, determining solutions, and implementation of Action Requests (AR) resolutionSupport the logical and systematic conversion of customer or product requirements into total systems solutions that acknowledge technical, schedule, and cost constraints**Must be a US Citizen or legally authorized to work in US as a permanent resident. This position is located at a facility that requires special access.***Basic Qualifications Understand Basic Systems Engineering Principles as it applies to systems and data integration Outstanding interpersonal and problem solving skills with the ability to handle multiple tasks simultaneouslyPerforming data quality audits/verificationApplication of Data Modeling, Profiling or Analysis techniques to establish patterns and trendsPerforming Configuration Management of data (Post-Delivery MODs/TCTD)Hands-on and proficient knowledge and use of core Microsoft Office applications to include MS Excel/MS Project/MS Power Point/MS Word/MS Access Proven ability to work effectively within a multi-function and diverse team environment to integrate and deliver data.Strong communication skills, written, verbal, and presentation both internally and externally, with customerFlexible work hours – May requiring weekend and Off-shift availability.Must be able to obtain a US Government security clearance (need for travel to Support Sites)Desired skillsExperience in one or more of the following:Sustainment Data Build (SDB) – including As-Delivered BOMSustainment Parts Information Record (SPIR)Joint Technical Data (JTD)Logistics Reference DataHands-on experience using ALGS Data Quality & Integration Management methodologies such as the Electronic Equipment Logbook (EEL)Reference & Initialization DataWorking experience using F-35 ALIS applications (i.e. CMMS and CRM)Experience with LM Enterprise Logistics Systems TeamCenter (PDM/LDM) to review and verify Design and Logistics DataFirst-hand experience using F-35 ATLAS application to extract and verify logistics dataDevelopment of Aircraft/Aviation System Bills-of-Material (BOM)/StructuresReading, Writing, and Applying Structured Query Language (SQL) to extract, process and manipulate dataAbility to read, interpret, and write eXtensible Markup Language (XML)Hands-on knowledge with TeamCenter e-Cubed report builderHands-on experience with Shop Floor Manager (SFM) SystemHands-on experience with Quality Assurance Documentation System (QADS)Production Planning and/or Shop Floor Operations related to data or systems integration Relevant US military aviation operational experience with understanding of US and Foreign Military applications of Integrated Logistics Support.State Texas Virtual no City Fort Worth Zip76108EEOLockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, or disability status.* As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  Join us at Lockheed Martin, where we’re engineering a better tomorrow. "}