{"jobID": "2776885999", "jobLocation": "San_Francisco_CA", "jobTitle": "Weight and Balance Agent (Load Controller)", "companyRating": null, "companyInfo": {"Website": "www.pacificaviation.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Hallmark Aviation Services, Matrix Aviation Services"}, "estimatedSalary": null, "jobDescription": " Weight and Balance Agent (Load Controller), San Francisco General InformationJob Title:Weight and Balance Agent (Load Controller)Location:100 Upper International LoopRoom I-3M-46San Francisco, CA, 94128United StatesJob Category:OperationsIndustry:AirlineJob DescriptionOBJECTIVES and/or ESSENTIAL DUTIES Perform Load Controller tasks for all types of aircrafts as defined by IATA. Possess an acceptable level of qualification and professionalism in line with international standards in order to ensure flight safety. MAIN TASKS: Prepare all Weight & Balance relevant documentation for the flight.  Order required number of baggage containers for ULD aircraft.  Function as central communication hub between dispatch, ground handler, baggage room, catering, fueling, ticket counter, boarding gate, cargo and other service providers.  Transmit Estimated Zero fuel weight (EZFW) to flight dispatch.  Prepare the Loading Instructions for arrival and departure.  Communicate with Cargo department for final cargo weight and DG loading information.  Brief the Loading Supervisor for the proper loading of baggage and cargo as per load plan.  Complete the Notoc (loading positions) prepared by cargo handling agent.  Add special load information to Notoc or separate sheet according to the Airlines procedures.  Receive final passengers breakdown from the ticket counter and gate after the flight has been finalized.  Receive Final fuel order from the Cockpit or Ramp agent.RequirementsEXPERIENCE: Minimum of six months as Aviation Customer service position or prior experience or preapproved by the COO.  PA mandatory Training: Passenger and baggage handling training Initial Load control training Safety training for Frontline Staff Security training (SSI) Dangerous goods (Cat 10) Airline Training: DCS, and Airline specific requirements for Load Control Relevant Training: General Instructions/Information for ERP Knowledge of the following aspects: Baggage make up, ramp coordination and ramp driverCompany methods and general procedures"}