{"jobID": "2735401161", "jobLocation": "Gaithersburg_MD", "jobTitle": "Real World Evidence Senior Data Scientist/Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.astrazeneca.com", "Headquarters": "Cambridge, United Kingdom", "Size": "10000+ employees", "Founded": " 1913", "Type": " Company - Public (AZN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Roche, GlaxoSmithKline, Novartis"}, "estimatedSalary": "164000", "jobDescription": " At AstraZeneca we work together across global boundaries to make an impact and find answers to challenges. We do this with the upmost integrity even in the most difficult situations because we are committed to doing the right thing. We continuously forge partnerships that help pursue world-class medicines in new ways, combining our people’s exceptional skills with those of people from all over the globe. As a Real World Evidence Senior Data Scientist/Data Scientist in Gaithersburg, MD or Cambridge, UK, you’ll play a pivotal role in channeling our scientific capabilities to make a positive impact on changing patients’ lives.  The Real World Evidence Center of Excellence is a new group being formed within AstraZeneca. AstraZeneca has a pedigree of experience in Real World Evidence. Having developed a coherent strategy to develop and internalize rich data assets the group is now amplifying those investments through a Real World Evidence Data Science capability. Data Scientists that are successful in this role will become part of a growing Real World Evidence Center of Excellence within the Global Medical Affairs organization working on challenging problems data Science can solve to accelerate evidence generation through to insights that could enable AstraZeneca to develop innovative medicines.  He/she will assist with due diligence on new data providers/vendors to advance AstraZeneca’s Real World Evidence data maturity, help shape the right analytics strategy for a range of Therapeutic Areas and provide informatics support for data acquisitions.  The ideal candidate for this role will bring a proven track record of delivering value through the leverage of routinely collected data from healthcare settings to provide health analytics and insights in both Public Health, Pharmaceutical Research and Development and Commercial context.  The role provides coaching, task management and support to Programmers/Statistics/Information Scientists, promoting best practice across multiple domains, and/or stakeholder groups.  Main Duties and Responsibilities: Provide scientific guidance on the application of Real World Evidence and observational research data to support pharmaceutical development problemsSupport Pharmacovigilance teams and Epidemiologists extract value from large observational research dataSupport technical teams provide access to analytical tools and develop visual analytics to enable self-serving applications for end customersProvide clear technical input, options, and direction to strategic decisions on Real World Evidence platform and capability buildProvide strategic decisions on AstraZeneca Medical Evidence and Observational Research external collaborations in the US and other marketsProvide technical input, options and directions to strategic decisions made by AstraZeneca observational study teams on study design, data partner selection and best practices in Real World Evidence data utilizationAssist in building a capability that becomes a source of sustained competitive advantage for AstraZeneca/MedImmune in identifying, acquiring, integrating and mining diverse Real World Evidence data from multiple geographic and healthcare system sources to support evidence generation and real-world studiesAssist in the delivery of analytics and the build of analytics pieces as part of an Real World Evidence strategyEvaluate and assess strengths and weaknesses of external Real World Evidence data sources via interrogation, and potential partners for advancing the data strategy for a given therapeutic areaMaintain a strong insight into the capabilities of potential external partners in Real World Evidence, especially for US and emerging markets Essential Requirements: Bachelor's degree in data science, Medical Informatics or related fieldExpertise in Electronic Medical Records/Health IT, disease registries, and insurance claims databasesExpertise in clinical data standards, medical terminologies and controlled vocabularies used in healthcare data and ontologiesExpertise in data mining approaches within healthcare settings generating insight from routinely collected healthcare dataExpertise in methods development and application using statistical languages such as R/Matlab/SAS/SQL/Hadoop/PythonExperience in advanced visualisation and visual analytics of routinely collected healthcare dataExperience in real-world evidence and familiarity with health economics/epidemiology, and quantitative science such as health outcome modellingStrong track record in delivering leading edge informatics solutions in pharmaceutical R&D; and commercial environments Desirable Requirements: PhD in data science or other advanced degree in life sciences with post-doctoral or other training/work in Medical Informatics or related fieldExperience in supporting pharmacoepidemiology studies with proven track record of advancing approaches with data scienceA history of patient care or equivalent background of working at a patient care setting that allows the candidate to bring medical perspective into real-world evidence generation and observational studiesDemonstrated ability to build long-term relationships with stakeholders at senior levels, understand relevant scientific/business challenges at a deep level and translate into a programme of informatics activities to deliver defined valueAbility to lead and manage multi-disciplinary health informatics projectsStrong track record of delivering large, cross functional projectsExperience working in a global organization and delivering global solutions Next Steps – Apply today!  To be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.  AstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law. AstraZeneca only employs individuals with the right to work in the country/ies where the role is advertised. Date Posted28-Aug-2017Closing Date28-Dec-2017"}