{"jobID": "2697950058", "jobLocation": "Cypress_CA", "jobTitle": "Dx Scientist - Cypress, California, United States - USA 2018", "companyRating": null, "companyInfo": {"Website": "www.diasorin.com", "Headquarters": "Saluggia, Italy", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public (DIA) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Johnson & Johnson, Siemens, Roche"}, "estimatedSalary": null, "jobDescription": "View all the open vacanciesJob TitleDx ScientistJob FactsLegal EntityDiaSorin Molecular LLCCypress, CAUnited StatesOrganizational AreaUSA and CanadaCountry / StateUnited StatesPlace of workCypress, CaliforniaHome/Office basedOffice basedProfessional Family:OperationsReporting ToSenior Manager, Technical OperationsKind of contractFull Time / Part TimeFull TimePermanent / TemporaryPermanentJob IDUSA 2018-012Job ScopeYour MissionResponsible for initiating, directing, and executing scientific research and/or development strategies for the company. Investigates the feasibility of applying scientific principles and concepts to potential inventions, products, laboratory services, and problems. Plans and executes laboratory research. Maintain broad knowledge of state-of-the-art principles and theories. Serves as an in-house consultant and advises management on scientific decisions.Main ResponsibilitiesYour ContributionsInvestigates the feasibility of applying scientific principles and concepts to potential inventions, products, laboratory services, and problems.Plans and executes laboratory research. Interprets scientific data and makes independent decisions on the accuracy and applicability of the results.Maintain broad knowledge of state-of-the-art principles.May act as in-house consultant and advise management on scientific decisions.Interfaces with various departments. Uses professional concepts and relationships to contribute to the development and completion of company goals and objectives in creative and effective ways.Interacts with R&D; scientist to facilitate technology transfer into Diagnostics. May serve as a technical representative, core team or extended team member during the product development process.Independently design, write and perform validations and transfer process modifications to Manufacturing.Maintains a laboratory notebook and writes technical reports.Modifies Manufacturing Specifications as appropriate.Qualifications Experience Personal Strengths MobilityYouEducationBachelor's, Master's or PhDSpecializationTechnology Transfer and Molecular BiologyExperienceRequires a Bachelor’s, Master’s or Ph.D. in a scientific discipline or equivalent with a minimum of 5 years experience for a Bachelor’s level, 3 years experience at the Master’s level, and 0 years experience at the Ph.D. level in a research, technical support, and/or development environment.Technical CompetenciesWorks on complex problems where analysis of situations or data requires an in-depth evaluation of various factors. Exercises judgment across multiple disciplines in selecting  methods, techniques and evaluation criteria for obtaining results. Demonstrates success in technical proficiency, scientific creativity, collaboration with others and independent thought. Expert knowledge of scientific principles and concepts. Demonstrates sustained performance and accomplishment. May determine methods and procedures on new assignments and may provide guidance to other personnel.SkillsAbility to read, analyze, and interpret pertinent scientific and technical journals, financial reports, and legal documents.Ability to respond to common and scientific inquiries or complaints from customers, regulatory agencies, or members of the business community.Ability to write speeches and articles for publication that conform to prescribed style and format.Ability to prepare presentations and manuscripts effectively to present information to top management, public groups, and/or boards of directors.Ability to work with mathematical concepts such as probability and statistical inference. Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.Ability to use Microsoft Word, Excel, PowerPoint, and Outlook. Equipment operating systems as needed.Ability to apply principles of logical or scientific thinking to a wide range of intellectual and practical problems.Ability to deal with nonverbal symbolism (formulas, scientific equations, graphs, musical notes, etc.) in its most difficult phases.Ability to deal with a variety of abstract and concrete variables.LanguagesFluent spoken and written EnglishTravel AvailabilityN/ARelocation AvailabilityDomestic USA candidates only eligible to work in the U.S.Training RequiredN/ABenefitsWe Offer YouAs per local and Company requirements for DiaSorin Inc.Others Information as per Local Legal RequirementsJOB POSTING REQUIREMENT for USA VACANCIES for DiaSorin Inc. and DiaSorin Molecular LLC  Must be 18 years of age, legally authorized to work in the US; and not require sponsorship for employment visa status (e.g, TN, H1B status) now or in the near future. It is the policy of DiaSorin to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, DiaSorin will provide reasonable accommodations for qualified individuals with disabilities. Our company uses E-verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, please visit https://www.uscis.gov/e-verify EEO is the law. https://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf  https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Suppleme... (2018)"}