{"jobID": "2746937262", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Analyst - Exchange Traded Options", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is one of the world’s most active proprietary trading firms and a key market maker in various products listed on exchanges throughout the world. The firm, made up of two different divisions with trading operations that operate independently of one another including a securities trading division and an asset management department. The Group is a market maker active in over 100 trading venues throughout the world and offers liquidity to over 200,000 through their securities division. The securities department makes markets in the major exchange traded instruments including equities, bonds, commodities and currencies. The Role Our Client is looking for a quantitative analyst to join the automated option market making team. This group trades listed options covering fixed income, currency and commodity products as well as equity index options across a range of markets. The options trading team operates strategies that trade across bond options, stock index options, options on futures contracts and callable bull and bear contracts. The role will focus on designing and optimizing the firms pricing models which are used for market making and principle trading. Skills and QualificationsPhD in applied mathematics, financial mathematics or similarStrong understanding of option pricing for exchange traded optionsDeep understanding of SABR, Implied Volatility Surface Interpolation with Splines, Volatility Curve Pricing etcAn expert in option pricingAbility to implement in a language such as Java or C++Most interested in a candidate with experience modeling listed products rather than structured or exotics If you would like to be considered for the position of Quantitative Analyst, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team."}