{"jobID": "2831525497", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist High - Performance Computing", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": " Research Scientist High - Performance ComputingJob Description  Intel Labs is seeking motivated researchers in the area of parallel and distributed computing research applied towards high performance computing and machine learning. This is a full-time position with the Parallel Computing Lab. The Parallel Computing Lab researches new algorithms, architectures, and approaches to address the most challenging compute- and data-intensive applications. We are focused on delivering new Intel software and hardware technologies that will transform the enterprise and technical computing experience. We work in close collaboration with leading academic and industry partners to accomplish our mission.  In this position, you will be responsible for conceiving, researching, and prototyping new parallel and distributed computing algorithms and frameworks, with special emphasis on machine learning, and you will develop relevant software and hardware technologies with the goal of converting these into products and fueling Intel's growth. You will use your strong knowledge of scientific principles to identify and research promising technologies typically 2+ years prior to product development. This requires a good understanding of state-of-the-art techniques in parallel computing, machine learning, distributed computing, optimization of algorithms, and benchmarking, along with a strong understanding of computer architecture. You must also possess strong verbal and written communication skills and the demonstrated ability to work in a demanding team-oriented environment. You are expected to maintain substantial knowledge of state-of-the-art principles and theories, and contribute regularly to scientific literature and the research community at-large. You may also participate in the development of intellectual property.  Business Group Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units. Qualifications You must possess the below minimum qualifications to be initially considered for this position. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences. Minimum Qualifications:The ideal candidate must have a PhD in Computer Science, Electrical/Computer Engineering, or a relevant engineering discipline2+ years of experience in the development of parallel and distributed computing algorithms and/or frameworks2+ years of experience in parallel programmingPreferred Qualifications:1+ year of experience in research related to high-performance sparse computations e.g., graphs, matrices, or tensors1+ year of experience in research related to machine learning, optimization, or a related topic Inside this Business Group  Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.  Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}