{"jobID": "2824703147", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.p2energysolutions.com", "Headquarters": "Denver, CO", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Are you interested in a career opportunity with a growing software company? P2 Energy Solutions is dedicated to providing a positive culture where the ability to learn, collaborate, and make a difference is rewarded. We have a fast-paced, innovative culture where employees are empowered to provide a superior experience for internal and external customers.  Upstream oil and gas professionals who are focused on solving tough challenges rely on P2 software, data and analytics solutions to optimize their business performance. We are currently developing our solutions on mobile and in the cloud! More than 1,600 companies from around the world use P2 solutions every day to manage their land assets, measure and process financial information, optimize production, and manage their reserves. With more than 80 years of experience in data and 30 years in software, P2 has offices around the world, and employs approximately 600 people. Essential Duties and Responsibilities: Individual draws business and quality insights from data through analysis, mining, and visualization. Leverages technical skills and creative thinking to solve problems and make quantitative recomendations to leadership and project team(s). Individual is responsible for the accuracy, efficiency, quality, and retrieval of processed data and develops understanding of complete product portfolio. Individual constructs detailed data analytic visualizations to demonstrate potential operational insight for customers. Serves as a research focal point, evaluating new data sourcing avenues, analyzing data from third party resources for quality, feasibility, and other logistics, and evaluates/facilitates potential new data products.  (1) Collaborate with operational teams to understand data needs and priorities, identify opportunities for analytics services while operationalizing resulting analytics tools or reports, and discovery of any data product gaps or quality challenges  (2) Educate staff on how to utilize data to inform strategy and business decisions  (3) Maintain the highest standards for data ethics, accuracy, collection, and transparency in data collection and analysis methodologies  (4) Interacts with departmental and other staff on matters affecting data and publications flow and makes recommendations for improvement or enhancement to workflow processes to ensure standards in data entry, collection, processing, and delivery  (5) Develop knowledge of key concepts, terminology, and processes of assigned discipline  (6) Provide auditing of data in alignment with P2 Tobin quality model and recommend remedies for deficiencies Qualifications Include: (1) Bachelor or Associate degree, preferred in research/data science-based disciplines (statistics, mathematics, economics, information systems/technology, business)  (2) 0-3 years experience  (3) Ability to gain working knowledge of business operations, decision and intelligence systems concepts, database structures, and/or geographic information systems  (4) Excellent verbal and written interpersonal, business, and technical communication skills; strong collaboration.  (5) Well organized and efficient with keen judgment, problem-solving and decision-making skills  (6) Ability to develop excellent analytical skills and integrate information from multiple sources to execute effectively and efficiently in a dynamic environment Always be learningWhen in doubt, talk it out.Show up and follow up.Create positiveThink beyond…Please note: Assessment testing may be required for this position. We offer a casual work environment, comprehensive benefits plan, generous PTO, and a competitive compensation structure. We have a positive culture designed around the philosophy of mutual respect and the challenge of contributing to the continued success of our organization. P2 is dedicated to individual and corporate growth opportunities, and we would love to talk to you further!  P2 Energy Solutions and its affiliated companies is an Equal Employment Opportunity employer. We also participate in the E-Verify program, a service of DHS and SSA."}