{"jobID": "2756260040", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Reporting Analyst", "companyRating": null, "companyInfo": {"Website": "www.lonestaragcredit.com", "Headquarters": "Fort Worth, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Under minimal supervision, responsible for Association level reporting from multiple platforms and databases based on the needs of end users. Ensures validity and accuracy of reports produced. Responsible for elements of database administration, data consolidation, data analysis and management reporting.  Knowledgeable of source and structure of data used in loan origination and analysis processes. Develops and provides, for Association-wide or customized use, reports measuring across all operational areas to include credit, accounting, finance, appraisal, collections, marketing, and internal review. DUTIES:Ensures the accuracy and value of association data, location of the data and how to present information correctly using charts, graphs, aggregates, statistical computations, etc.Utilizes appropriate data mining techniques and methodologies across the reporting environment.Works closely with senior management and department heads to provide requested reports.Accesses, imports, extracts or consolidates data across different data sources.Monitors and optimizes database reporting performance at the direction of the Senior Credit Risk and Business Analyst.Works closely with Senior Credit Risk and Business Analyst in performing qualitative and quantitative research on economic, industry, and market conditions for utilization in ACA's risk management and Stress Testing processes.Performs various data needs/requests for administrative staff and branch personnel.Assist Credit and Loan Operations departments with monthly repricing process.Assist the Senior Credit Risk and Business Analyst with Association's Allowance process.Assist in evaluation of new technology for possible Association implementation.QUALIFICATIONS: Bachelor's degree in Business, Computer Science, Management Information Systems or related field or equivalent experience and three (3) to four (4) years of experience in an Information Technology environment. Experience must include platform independent report writing, in-depth understanding of the source, structure, and correlation of the Association's data.  Specialized knowledge of Microsoft Office applications, utilizing SQL database reporting tools, business systems software applications. Specialized knowledge of data mining methodology, with strong emphasis in SQL Programming. Demonstrated skill in problem-solving including problem identification, fact- finding, research, analysis and solution development. Ability to understand and interpret data sources to ensure integrity and accuracy to users. Ability to mentor and lead entry level data analyst employees, and ability to collaborate with FCBT staff to solve data analysis needs.  Ability to sit for long periods of time. Ability to stand for limited periods of time. Frequent finger/hand manipulation (e.g. keyboard, office equipment, small hand tools, etc.). occasional lifting, carrying, pushing, and/or pulling while exerting up to 50 pounds of force.  At the discretion of Lone Star Ag Credit, position may be offered at alternate titles and other business experience may be considered relevant.  AA/EOE/M/F/D/V  Position will be posted until filled, until sufficient candidates are reviewed to ensure a qualified selection can be made, or until closed at the discretion of the Association."}