{"jobID": "2756695802", "jobLocation": "Houston_TX", "jobTitle": "Sr Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.bhge.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (BHGE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: GE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.  GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Role Summary: The Data Engineering team helps solve our customers' toughest challenges; making flights safer, power cheaper, and oil & gas production safer for people and the environment by leveraging data and analytics. The Lead Data Engineer will work with the team to create state-of-the-art data and analytics driven solutions, working across GE to drive business analytics to a new level of predictive analytics while leveraging big data tools and technologies. Essential Responsibilities: As a Sr Data Engineer, you will be part of a data engineering team supporting the maintenance and evolution of the data integration & indexing modules of an innovative (patent pending), in-house built, product serving 1000+ users from the BHGE company. These teams typically include statisticians, computer scientists, software developers, engineers, product managers, and end users, working in concert with partners in GE business units. Potential application areas include remote monitoring and diagnostics across infrastructure and industrial sectors, financial portfolio risk assessment, and operations optimization. In this role you will:Work with business stakeholders in defining new data models and driving the end-to-end implementation. Connect and configure new data sources to the existing application. Lead the monitoring and support of the current data integration & indexing solution. Integrate domain data knowledge into development of data requirements. Look across multiple systems, understands the purpose of each system and defines data requirements by systems. Identify downstream implications of data loads/migration (e.g., data quality, regulatory, etc.). Qualifications/Requirements:Basic Qualifications:"}