{"jobID": "2775947841", "jobLocation": "Princeton_NJ", "jobTitle": "Staff Clinical Biomarker Scientist Director - Oncology", "companyRating": null, "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Clinical Biomarker Scientist is responsible for developing and executing on translational strategies for the Oncology pipeline. This scientist works on various projects across all stages of drug development and will act as a key interface with the Translational Medicine group.  The successful candidate will be responsible for integrating translational research and clinical development, developing a biomarker strategy in alignment with clinical development objectives, leading efforts for data generation, interpretation and communication to the development teams. The candidate will also be responsible for understanding the external research environment, partnering with discovery biology and other functions both internally and with external partners to coordinate the execution of deliverables. Independently engages with development teams and technical/scientific experts to define, revise and progress translational/biomarker plans.Responsible for the delivery of high quality biomarker strategies for target engagement, pharmacodynamic endpoints and patient selection (where appropriate)Proactively provides insight into novel ways to incorporate biomarkers into clinical designs to enable early understanding of emerging drug profiles.Collaborates and strategizes across the entire Oncology organization to improve efficiency and accelerate the product pipeline forward.Effectively interfaces with the Translational Medicine group to obtain appropriate resources to deliver on biomarker goals.As appropriate, provides biomarker expertise to progress validated biomarkers into development of pharmacodiagnostic tools. This position is based in Lawrenceville, New Jersey Qualifications:MD or PhD, or equivalent advanced biology degreeExperienced scientist with 9+ years' experience in the drug development process.Documented experience in hematology-oncology (Lymphoid and Myeloid leukemias, Hodgkin and non-Hodgkin Lymphomas, and/or Multiple Myeloma) is highly preferred but not indispensable.Deep understanding of the role of translational research/medicine and clinical biomarkers in drug developmentComfortable working in a fast-paced environment where speed is paramountWilling to work as a topic expert, outside of a traditional functional environment, in a team unified around serving the assetsAbility to recognize, articulate, and accept calculated risks to make informed decisionsWillingness and ability to effectively cooperate and partner with external providers and others within BMSDemonstrated experience in the appropriate application of various scientific technologies into translational research strategiesWorking knowledge of all functional areas of drug development, including, biology, toxicology, clinical development, diagnostic development, etc.Demonstrated scientific acumen and mechanistic understanding of disease biologySDL2017"}