{"jobID": "2834909600", "jobLocation": "Los_Angeles_CA", "jobTitle": "Programmer Analyst, Data Science", "companyRating": "4.7", "companyInfo": {"Website": "www.softwareresources.com", "Headquarters": "Lake Mary, FL", "Size": "51 to 200 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Software Resources has an immediate job opportunity for a Programmer Analyst, Data Science in Los Angeles, CA.  6+ month contract to hire  Job Description: Programmer Analyst, Data Science  Job Summary  We are looking for a Programmer Analyst with heavy experience in Data Science to support our bankers, group heads, and leadership teams with insights gained from analyzing company data. The ideal candidate is adept at using large data sets to find opportunities for leads and service offerings. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating data visualizations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.  Primary Responsibilities: Build, optimize and quickly decipher patterns within large data sets and to reference key characteristics using visualization techniques.Build and optimize predictive models using machine learning and other algorithms.Identify and track the metrics to measure the success of the operation and overall business.Work with big data, crunching samples for data mining, recommendation, or search relevance solution.Perform Data Hygiene responsibilities working with external vendors, internal resources and end users. Create algorithms to identify, report, and improve Data Hygiene functions.Conduct research on Industries, potential partners, and deals.Provide on-going performance monitoring of decision system and statistical models.Work with the varied business departments in conjunction with IT Department in mapping broader business goals into detailed functional requirements.Collaborate with different teams to understand their problems from a business perspective and come up with a solution based on the data.Candidate should take the complete ownership of the analytics initiative and work with business executives; data owners; and internal implementation team. Qualification: Advanced Degree in Math, Physics, Computer Science, Statistics, Economics or any quantitative fields.Expert SQL experience required.Proficiency with business intelligence tools like Tableau, Alteryx, Cognos, Crystal Reports or similarExperience with scripting languages: R, Python, Perl or programming languages.SalesForce knowledge is a big plusKnowledge and past experience in Finance, Accounting, Project Management.Experience with in-depth data analysis, data profiling and modelingExperience developing and designing aggregates used for modeling and analysisStrong understanding of statistics, descriptive data analysis and Data analysis techniques.A proven resource in developing systems requirements, designing and prototyping, testing, training, defining support procedures, and implementing practical business solutions under multiple deadlines. Don't delay. Join the Software Resources team today!  Software Resources specializes in connecting talented IT professionals with challenging job opportunities that transform jobs into careers.  To meet our clients hiring needs, we continuously source talented IT Professionals with all levels of expertise and in all disciplines. We offer world class major medical, dental and vision benefits, 401(k) with match, short term disability, Life Insurance and AD&D.; You, our future employees, can make a tremendous difference to our company and our clients. Please apply to this job and experience the Software Resources difference. You can view all of our jobs at http://www.softwareresources.com/it-careers/it-job-search/  Company Overview  Software Resources specializes in IT talent recruitment services and workforce staffing solutions. Founded in 1992 as an IT staffing services firm, we are a privately held women-owned business enterprise (WBE), celebrating our 25th year in business. We are headquartered in Lake Mary, Florida, just outside of Orlando. With branches and sales professionals throughout the U.S., Software Resources is the staffing agency of choice for clients and consultants.  We specialize in IT. It's what we do and what we know, every day. We provide contract, contract to hire and direct hire placement IT staffing solutions for Energy, Entertainment/Gaming/New Media, Financial Services, Government, Healthcare, Hospitality, Professional Services, and Security."}