{"jobID": "2694647791", "jobLocation": "Ridgefield_NJ", "jobTitle": "Quality Control Scientist II", "companyRating": null, "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": null, "jobDescription": " Genzyme has pioneered the development and delivery of transformative therapies for patients affected by rare and debilitating diseases for over 30 years. We accomplish our goals through world-class research, collaboration with the global patient community, and with the compassion and commitment of our employees. With a focus on rare diseases and multiple sclerosis, we are dedicated to making a positive impact on the lives of the patients and families we serve. Genzyme's portfolio of transformative therapies, which are marketed in countries around the world, represent groundbreaking and life-saving advances in medicine. As a Sanofi company, Genzyme benefits from the reach and resources of one of the world's largest pharmaceutical companies, with a shared commitment to improving the lives of patients.  Sanofi, an integrated global healthcare leader, discovers, develops and distributes therapeutic solutions focused on patients needs. Sanofi has core strengths in the field of healthcare with seven growth platforms: diabetes solutions, human vaccines, innovative drugs, consumer healthcare, emerging markets, animal health and the new Genzyme.  Genzyme Corporation (a Sanofi company) and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status, or any other characteristics protected by applicable law. QC Scientist IIHOURS: Monday - Friday from 6:00 am to 2:30pm and as needed. Some flex in the start and end times may be allowed, weekend work as required. The candidate will include review and authoring SOPS, Change Controls, out of specification investigations, run the gowning program, maintaining the stock cultures and report writing will perform validation testing, writing protocols, data review, Additional duties will include Environmental Monitoring of Grade A, B and D clean room environments, Bioburden, Endotoxin, Sterility testing, as well as plate reading, sample release, paperwork, and data input into computerized systems.  Development into duties beyond those described is possible for more qualified candidates based on the business needs and candidates background. The candidate must be able to accommodate a flexible work schedule. Standard work week will be Monday through Friday with overtime and occasional weekends.  Physical Requirements include the capacity to lift and carry up to 20 pounds, kneel, reach and stretch, and to stand for at least 4 hours.  Basic Qualifications: BA/BS in Microbiology/Biology with 6-10 year experience is required.Aseptic technique, clean room environmental monitoring and clean room experience. Must be able to be certified in gowning to Grade A to perform this job.Practical experience in general microbiology laboratory techniques working with bacteria, yeast and mold.Prior experience with validation testing, writing protocols, data review, authoring SOPS, Change Controls, out of specification investigations and report writing. Preferred Qualifications: Preference will be given to candidates with prior experience in Sterility Testing, Isolators, Endotoxin Testing, Identification Systems.Excellent written and verbal communication skills.Preference will be given to candidates with validation testing, writing protocols, data review, authoring SOPS, Change Controls, out of specification investigations and report writing. Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions.  With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe.  Sanofi, Empowering Life"}