{"jobID": "2776850576", "jobLocation": "San_Diego_CA", "jobTitle": "Biomarker Development Scientist", "companyRating": null, "companyInfo": {"Website": "www.poseida.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Poseida Therapeutics, Inc. is seeking a talented Clinical Scientist to join our team in San Diego, CA. This position offers an excellent opportunity for a highly motivated individual to help support and contribute to a growing biotech developing new gene editing and gene therapy products in an exciting and dynamic environment focused on cutting-edge gene editing technology. Primarily, the role will be responsible for supporting the clinical team in the development of biomarker strategy and assay development.  Primary Responsibilities: Serve as Translational lead on cross-functional clinical development team(s) to define and execute biomarker strategy in support of clinical trialsIdentify, negotiate agreements with, and manage work at contract research organizationsSupport the preparation and framing of data packages for publication, presentation and/or submission to regulatory agenciesWork with Clinical Data Management and Biostatistics to confirm data acquisition and aid in interpretation of analysesOversee development, qualification, and execution of innovative assays for clinical biospecimen monitoringSupport the transfer of novel methods to contract-testing labsWrite, review, and edit technical documents (including SOPs, development/qualification of protocols) as well as drafting of reports and literature reviewsContribute to company-wide and external scientific discussions and engagement with key opinion leaders in the fieldOther duties as applicable Poseida Therapeutics is translating best-in-class gene engineering technologies into lifesaving cell therapies. The company is developing CAR T-cell immunotherapies for multiple myeloma, prostate and other cancer types, as well as gene therapies for orphan diseases. P-BCMA-101 is Poseida’s lead CAR-T therapy currently in Phase 1 clinical development for the treatment of multiple myeloma. Poseida has assembled a suite of industry-leading gene engineering technologies, including the piggyBac™ DNA Modification System, TAL-CLOVER™ and Cas-CLOVER™ site-specific nucleases, and Footprint-Free™ Gene Editing (FFGE). For more information, visit www.poseida.com.  Requirements: PhD or Master’s Degree in immunology, cancer biology or a closely-related field and at least 4 years of industry experience.Familiarity in the areas of cellular based therapy, molecular biology, immunology, immuno-oncology and cancer biologyPrevious experience in the setting of translational biology for clinical trialsExperience with relevant diagnostic technologies with an emphasis on flow cytometry, immunoassays (ELISA, Luminex, and MSD), polymerase chain reaction, and immunohistochemistryExperience in molecular biology techniques including DNA/RNA isolation and PCR (ddPCR and qPCR) at a minimum; familiarity with next-gen sequencing methods and analysis is desirableUnderstanding of basic CAR-T cell biology desirableMicrosoft office (Word, Excel, and PowerPoint) skills are requiredKnowledge of scientific applications such as GraphPad Prism, FlowJo, BD FACSDiva, and ImageJ are desirableExperience with clinical sample testing, assay development and qualification preferredStrong organizational and record-keeping skillsHands-on expertise with sterile technique and culturing cell lines/primary cells (co-cultures of human T cells and/or PBMCs) highly desirableExcellent interpersonal, verbal and written communication skills are essential in this collaborative work environmentComfortable in a fast-paced environment and able to adapt to changing prioritiesSelf-motivated and ambitious candidate with a strong work ethic"}