{"jobID": "2774868091", "jobLocation": "Austin_TX", "jobTitle": "Quantitative Business Analyst - Strategic Data Solutions", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "77000", "jobDescription": "Quantitative Business Analyst - Strategic Data Solutions Job Number: 113558200Austin, Texas, United StatesPosted: Jun. 11, 2018Weekly Hours: 40.00 Job SummaryApple’s Strategic Data Solutions (SDS) team leads efforts to optimize various business processes and improve the customer journey across Apple. We apply data science and machine learning to drive strategic impact across multiple lines of business at Apple. We are looking for an excellent analyst who is passionate about working closely with partner teams; understanding their processes and analytic needs; and developing technical solutions along the way.  You will sit side-by-side with our data scientists and analyze complex business problems, have access to internal and external data sources, and be expected to communicate meaningful insights to senior leadership and key decision-makers. You should work well in team driven environments with minimal formal structure and at ease in uncertain environments with opposing priorities. You should possess extraordinary business sense, a strong quantitative / technical background, natural curiosity, and the ability to effectively shift between communications styles based on the audience (technical peer review through leadership update).Key Qualifications Experience applying analytical techniques to provide solutions to real business problemsExperience with SQL and big data systems and toolsProgramming skills in Python or similar languageExperience eliciting business requirements and executive metricsExperience building business cases and project plansGood social skills with ability to connect and develop positive partnershipsStrong verbal / written communication skills(Desired) Background in payments or financial auditingCreativity to go beyond current tools to deliver the best solution to the problemInquisitiveness and a real passion for continued self-improvement and development of new skillsAble to work independently and make key decisions on projectsAbility to provide relevant insights with dataAbility to operate appropriately and effectively in a dynamic, highly matrix and fast-paced environment. Description- Support discovery of business problems Perform data discovery and build proof of conceptsPerform ad-hoc and reoccurring statistical analysesWork with data warehouse architects and software developers to generate precise business intelligence solutions for business partnersPresent results of analysis to business units Every single day, people do amazing things at Apple. What will you do?EducationBS / MS in technical field (math, statistics, engineering, computer science, analytics, or similar)  Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}