{"jobID": "2831006614", "jobLocation": "Washington_DC", "jobTitle": "Sr. Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.highpointglobal.com", "Headquarters": "Indianapolis, IN", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": "This requirement is in task order stage of the process and each candidate considered will be fully screened by our recruiter and technical team lead and if so chosen to proceed in consideration, provisioned an Offer Letter of Intent (LOI). This LOI will need to be reviewed, signed and returned to HighPoint given us full approval to submit the aligned candidates resume to our customer for consideration of this task order. Senior Data ScientistWe are looking for a Senior Data Scientist and certified Scrum Master who will assist a major Federal client with insights gained from analyzing agency data. The ideal candidate is adept at using large data sets to find opportunities for service and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive results with their data-based insights and Agile expertise. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to achieve agency mission.EDUCATION AND YEARS OF EXPERIENCE REQUIREMENTS:We’re looking for someone with 5-7 years of experience manipulating data sets and building statistical modelsMaster’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field.Leading Agile effortsKNOWLEDGE AND SKILLS REQUIREMENTSCertified Scrim MasterCoding knowledge and experience with several languages: C, C++, Java, JavaScript, etc.Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.Experience querying databases and using statistical computer languages: R, Python, SLQ, etc.Experience using web services: Redshift, S3, Spark, DigitalOcean, etc.Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.Experience analyzing data from 3rd party providers: Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc.Work with stakeholders throughout to identify opportunities for leveraging data to drive agency efforts toward mission accomplishmentMine and analyze data from agency databases to drive optimization and improvement of solution development, improved procedures and techniquesAssess the effectiveness and accuracy of new data sources and data gathering techniques.Develop custom data models and algorithms to apply to data setsUse predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomesCoordinate with different functional teams to implement models and monitor outcomesManage the development of processes and tools utilizing Agile methodology to monitor and analyze model performance and data accuracyPHYSICAL REQUIREMENTS:Regularly required to sit for extended periods up to 80% of the time; frequently required to move about to access file cabinets and use office equipment such as PC, copier, fax, telephone, cell phone, etc.Occasionally required to reach overhead, bend, and lift objects of up to 10 lbs.Specific vision abilities required by this job include use of computer monitor screens up to 80% of timeWORK ENVIRONMENT:Individual’s primary workstation is located in an office areaThe noise level in this environment is low to moderateAt HighPoint, our focus is on delivering results that matter. We support and modernize our federal customer’s mission critical systems and functions. Agility is at our core: it is the mantra that drives us to succeed. We work quickly, analytically and deliver on agency priorities.HighPoint is a growth-oriented firm that provides a unique, differentiated employee culture relative to our Federal market peers. We leverage this growth-oriented and employee-focused culture to attract and retain a higher grade of talent than our peers to be an employer of choice.Please no Corp-to-Corp or 1099 candidates; this position is W-2 onlyWe are unable to sponsor H1B applicants for this roleUS citizenship required as per potential clearance requirementsRelocation will not be offeredSelected applicant will be subject to a background investigationIf you encounter any problems while applying for a position, please submit your resume to recruiting@highpointglobal.comABOUT HIGHPOINT:HighPoint helps government agencies elevate the citizen experience (CX) by improving the touchpoints through which citizens interact with government. We were founded in 2006 by Ben Lanius with the spirit of transforming how agencies connect with and empower citizens to deliver on mission-critical objectives. HighPoint is privately held with 350 passionate employees across offices and locations in Indianapolis, Indiana; Baltimore, Maryland; and Reston and Herndon, Virginia.#CJ#DIHighPoint, is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}