{"jobID": "2803629004", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Java Software Engineer, Jobs IO", "companyRating": "4.1", "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": "136000", "jobDescription": " Our mission is to help people everywhere find a job and company they love. We are disrupting an industry by changing how people search for jobs and how companies recruit top talent. Responsibilities As a Senior Software Engineer, you will play a central role in the design and development of the Glassdoor Jobs Platform. The ideal candidate will have a passion for development and a strong background in building dynamic, high-volume back-end systems with Java using an Agile development methodology. You should be able to apply the best engineering practices to build a job application experience to easily integrate across multiple partners.  In this role you work with a nimble, fast-growing, rapidly innovative and collaborative team of engineers, product managers, and designers based out of downtown San Francisco so excellent interpersonal and communication skills are also a must. And most importantly we look for people that can prioritize, multitask, and deliver because its a lot more fun to get things done. Skills and Requirements5+ years of Java software development experience on large scale, high-volume systemsPassion in creating best-in-class software and following best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operationsStrong understanding of Java multithreading, concurrency and memory managementProficient with open source Java technologies such as Spring, Hibernate, and StrutsProficient working with relational databases as well as NoSQL technologies such as Redis and RiakExperience building service-oriented solutions and RESTful microservicesBonus: Familiarity with front-end technologies such as JSP, JSTL, HTML, CSS and Javascript.Extra Bonus Points: youre fun to be around!Why Glassdoor?Work with purpose join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage, with 80% dependent coverageEquity in a late stage startup backed by top-tier VCsConveniently located office in the heart of downtown San Francisco (Embarcadero)Fully-stocked break rooms with complimentary food and drinksPaid holidays and flexible paid time offYour choice between Mac or PC Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}