{"jobID": "2811163636", "jobLocation": "Houston_TX", "jobTitle": "IT Technical Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.apachecorp.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1954", "Type": " Company - Public (APA) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Newfield Exploration, Noble Energy"}, "estimatedSalary": "78000", "jobDescription": " Company OverviewApache Corporation is one of the world's leading independent oil and gas producers. The company has a six-decade record of profitable growth, and is differentiated by its #1 position around the world, entrepreneurial culture and deep operational focus.Key Duties/ResponsibilitiesJob Summary: The Technical Data Analyst provides analytical services independently or jointly with other resources to internal departments or departments in the business units. The Analyst develops statistical and analytical applications and presentations for consulting sessions using knowledge of analytical methods and related to either the SAS analytical products being utilized at Apache or related statistical/data manipulation/data visualization functionality found in open source environments such as Python and R. Responsibilities:Provide assistance to internal customers for statistics-related consulting sessions.Support acquisition, validation, and management of data from various sources.Proficient in the use of Python and R libraries to transform, join, and enhance datasets to produce data visualizations needed to support customer analysis needs.Become proficient in the use of SAS Advanced Analytics products with focus on Enterprise Guide, Enterprise Miner, Text Miner and Forecasting. Provide SAS Visual Analytics (VA) support as required.Provide assistance to other members of the group and internal customers in the cleaning and preparation of data for data mining and analysis.Support the iterative structured method of Sample, Explore, Modify, Model and Access to deliver analytical results to the customer. Job QualificationsExperience:Masters degree is preferred. Minimum Bachelor’s Degree in statistics, engineering, business or closely related technical field.3-5 years experience working with Python and R libraries.Fundamental knowledge of operating system(s), file/data storage options, and database systems.Experience analyzing data and business problems.Qualities:Must have strong oral and written communication skills, with the ability to communicate with people with various technical backgrounds, write and edit technical material, and relate statistical concepts and applications to non-technical SAS/Python/R users.Works on complex problems of diverse scope where analysis of data requires evaluation of identifiable factors that inform the questions posed of the data.Demonstrates good judgment in selecting methods and techniques of evaluation and analysis.Capable of taking innovative approaches to problem solving."}