{"jobID": "2679580199", "jobLocation": "Chicago_IL", "jobTitle": "Tumor Organoid Scientist", "companyRating": null, "companyInfo": {"Website": "www.tempus.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " With the advent of genomic sequencing, we can finally decode and process our genetic makeup. We now have more data than ever before but providers don't have the infrastructure or expertise to make sense of said data. Here at Tempus, we believe the greatest promise for the detection and treatment of cancer lies in the deep understanding of molecular activity for disease initiation, progression, and efficacious treatment based on the discovery of unique biomarkers.  We're on a mission to connect an entire ecosystem to redefine how genomic data is used in clinical settings. We're looking to build a laboratory operations team who are passionate and focused on developing state of the art techniques to processing and creating and interpreting vast amounts of genomic and molecular data from patients and from biological models. While developing, screening, and analyzing data from organoid models directly from patient tumor samples, scientists will collaborate with product, research, and business development teams to develop the most advanced sequencing platform in cancer care. What you will do:Work with a cutting-edge biological modeling and organoid screening workflow to provide high-quality cellular analyses and drug screening dataCollect and analyze data to present results from tumor organoid drug screening assaysInterpret tumor organoid drug screening results in order to design new assaysPrepare tumor organoid TNA for NGS sequencing and interpret NGS dataPerform statistical analysis on drug screening and NGS data setsCritically evaluate literature related to 3D tumor organoids to translate recent developments into laboratory use.Develop high quality, robust, reproducible SOPs and documentation for all projects.Maintain best practices and SOPs to ensure reproducibility and reliability of all research results.Work in interdisciplinary groups of scientists, engineers and product developers to translate research from our models into actionable insights.Qualifications:  Must have:M.S. in biological sciences with 6+ years, or PhD with 3+ years of experience in Cancer Biology or biological sciences related to cancer.Demonstrated experience working with tumor organoid-based drug screening platformsDeep knowledge of tumor organoid models biology and challengesDemonstrated experience working with live-cell analysis systemsProficient in statistical data analysisExperience working with next-generation sequencing dataAbility to work with others to plan and carry out scientific programsDemonstrated ability to conceive, implement and evaluate research projects for complex biological problemsSelf-driven and works well in an interdisciplinary team with minimal directionExcellent communication skillsThrives in a fast-paced environmentHighly desirable:Computer programming skills"}