{"jobID": "2817168481", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Insights and Growth", "companyRating": "4.5", "companyInfo": {"Website": "www.oculus.com", "Headquarters": "Menlo Park, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "152000", "jobDescription": " Data Scientist, Insights and GrowthData&Analytics; | Menlo Park, CA  The Oculus team at Facebook builds the VR hardware and platform to let you experience anything, anywhere, with anyone. Additionally, Facebook has teams dedicated to building social experiences in VR that make it easier to spend time with your friends, wherever they are. Virtual reality's potential to connect the world is immenseand we're just getting started.  Oculus is a world leader in the design of virtual and augmented reality systems. Come work alongside expert software engineers and research scientists to help us to create the technology that makes VR and AR pervasive and universal. Join the adventure of a lifetime as we make science fiction real and change the world.  As a Data Scientist on the Oculus Insights&Growth; team, you'll help us bring VR to the masses. This is an exciting opportunity to help develop the next big computing platform. You'll work closely with engineers, designers, product managers and marketers to help us to track and understand user engagement with our platform and to build products for the rapidly expanding VR community. The ideal candidate enjoys working with cross-functional teams, is highly analytical and enjoys building consumer products. ResponsibilitiesInterpret data, analyze results using statistical techniques and provide ongoing reports.Identify, analyze, and interpret trends or patterns in complex data sets.Apply statistical techniques to understand users and their engagement with the platform.Make recommendations to business partners based on data trends and analysis.Work with business partners to ensure collection and logging of data needed to provide insights on user engagement and help drive business decisions.Minimum QualificationsDegree in Statistics, Mathematics, Computer Science or equivalent experience in a related technical field.Analytical experience in collecting, organizing, analyzing, and disseminating information.4+ years experience in performing quantitative analysis.Experience in SQL or other programming languages. Preferred Qualifications Experience in at least one scientific computing language such as Python, R, etc."}