{"jobID": "2724413381", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.stockpile.com", "Headquarters": "Palo Alto, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT STOCKPILEStockpile is the easy and affordable way to buy stock. With Stockpile, you can buy fractional shares of stock in publicly-traded companies. Rather than buying an entire share of stock, you can get just the amount you want. This means you can buy $25 of Amazon stock even though 1 share costs about $1000.We have also invented the world’s first gift card for stock! For the first time ever, you can buy $25, $50, and $100 Stockpile gift cards off the gift card rack at stores like OfficeMax, K-Mart, Safeway, and ToysRUs, or send e-gifts from our website (stockpile.com) or mobile app.Stockpile’s mission is to democratize stock investing. 86% of the population has never had a chance to own stock because it’s intimidating and expensive, but it doesn’t have to be that way! We’ve broken down the barriers to stock ownership by building our own fractional shares platform and partnering with Fortune 500 companies to bring the stock market to you, whether you’re grocery shopping or doing your mobile banking.Based in Palo Alto, Stockpile is venture-backed, and our team comes from companies like Facebook, PayPal, and E*Trade. We’ve been featured in the Wall Street Journal, CNBC, Consumer Reports, and many others. We’re building a team of exceptionally talented people to join us on our mission, and would love to talk to you!WHAT YOU WILL DO Work closely with product and business teams to identify important questions and answer them with dataApply statistical and econometric models on large datasets to: i) measure results and outcomes, ii) identify causal impact and attribution, iii) predict future performance of users or productsDesign, analyze, and interpret the results of experimentsDrive the collection of new data and the refinement of existing data sourcesWrite SQL queries to create business analytics and KPI reportsMaintain and improve instrumentation for conversion funnel tracking for major flows.Build and enhance data warehouse and data visualization pipeline for key product areasWHAT WE LOOK FOR 3+ years experience working with and analyzing large data sets to solve problemsA PhD or MS in a quantitative field (e.g., Economics, Statistics, Sciences, Engineering, Computer Science)Expert knowledge of a scientific computing language (such as R or Python) and SQLStrong knowledge of statistics and experimental designThe ability to communicate results clearly and a focus on driving impactBefore You Apply Our team members are avid users of our product. If you don't see yourself using the product, you won't be as passionate about making it better for our users, right?To encourage this, we’re offering $5 of free stock to go through our end-to-end onboarding experience. Choose from Amazon, Facebook, Tesla, or 1000+ other stocks and ETFs.Take the $5 freebie and open an investment account for you or your kids. (Yep, even kids and teens can invest at Stockpile!)In your application, tell us what you liked the most and the least about your experience. If you had a magic wand, what would you change? Don’t hold back — we want your candid feedback!Feel free to contact us at hiring@stockpile.com if you have any questions about your application!"}