{"jobID": "1154247750", "jobLocation": "Melo_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lat36.com", "Headquarters": "Franklin, TN", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TEKsystems, Collabera"}, "estimatedSalary": null, "jobDescription": " Data AnalystJob  code: 11059Job Category: Data AnalystCity: Melo ParkJob Description: Data Analyst - Menlo Park, CA - 7 MonthsJob Description: This company is the venture capital investment arm of global financial services firm Financial Group (NASDAQ: SIVB). The company family of funds has $2B under management and includes funds of funds and direct investment funds invested on behalf of institutional investors.  The company's fund of funds invests in venture capital funds focusing on the information technology and life sciences industries. The company's direct funds invest in early stage companies in the information technology industry. The company's Financial Group’s relationships with hundreds of venture capital firms and thousands of venture-backed companies provide the company with unparalleled data and information on venture capital firms and their portfolio companies as well as privileged access to leading venture capital firms.  JOB LEVEL: Works closely with senior staff to support data analytics that will influence investment and business decisions. Contributes to the management and maintenance processes in place to aggregate and store proprietary client metrics into a relational database. This includes monitoring data integrity through the institution of quality controls both process and artificial intelligence oriented. It also includes project management and supervision of outsourcing partner to implement quarterly data entry of 50+ fields for 4,000+ entities on a tight deadline. Responsible for coordinating deliverables in a deadline driven environment and managing quality of off-shore data entry and research teams, project workflow and reviews. Will also provide general support in fielding internal business requests through data extraction and formulation based off given requirements in a client service like manner. Creativity, independent thinking, and ability to improve existing processes will contribute greatly to success. Skills & Requirements: JOB COMPLEXITY: Responsible for approaching all tasks in an intensely detail oriented manner to ensure accuracy while still operating efficiently in order to adhere to set deadlines and flawlessly execute on project expectations. Needs to be a highly self-motivated individual whom can excel in a dynamic fast pace environment with a positive attitude while exercising sound judgment.  In order to be an effective contributor to the team, a candidate needs the right combination of skills - including data management, programming, statistics, financial modeling/analysis, market research, venture capital, corporate finance, and sector-specific knowledge.  Further, must learn to be highly adept in MS Office, especially Excel, as well as proficient at the use of various software, database tools, and programming languages such as SQL and VBA.  SUPERVISION: All client related deliverables will be reviewed by senior staff before being distributed.  EXPERIENCE: 0-3+ years of related experience in either a quantitative research or data management type role preferably at a financial services firm.Experience in client service roles, project management and collaborating with an off-shore staff is a plus. Excellent oral and written communication skills. EDUCATION: Bachelor's degree in information services, computer science, statistics, mathematics or in another quantitative field. Manoj Kumar | Latitude 36 Inc | Jr. Recruiter Email: akumar@lat36.com | Desk: 510-398-4083 | Web: www.Lat36.com |  LinkedIn : www.linkedin.com/pub/manoj-kumar/89/ba0/5b Connect with us on: Like us on Facebook  Follow us on Linked In  Tweet us on Twitter About us: Latitude 36 is a full-service staffing services firm, specializing in recruiting for Information Technology and Healthcare positions. Founded in 2000, Latitude 36 is a WBENC certified woman-owned company. Our clients include Fortune 1000, large (500MM+) privately-held companies and non-profit corporations. Latitude 36’s core service is staffing. Through time-tested recruiting programs, we offer our customers the highest-caliber, pre-screened resources to ensure our customers meet business and project objectives."}