{"jobID": "2806999515", "jobLocation": "Franklin_Lakes_NJ", "jobTitle": "Healthcare Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.express-scripts.com/corporate", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (ESRX) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " CVS Health, Catamaran, UnitedHealth Group"}, "estimatedSalary": "72000", "jobDescription": "POSITION SUMMARY The Prospect Analytics Health Care Analyst will be responsible for developing and maintaining analytical applications and capabilities including the design and build of visual dashboards that monitor integrated medical coordination, clinical efficacy, key trends, program tracking, and financial performance.  The role entails skillful use of database extraction tools resulting in the manipulation and analysis of data specifically related to the healthcare industry. This role will work with data from a variety of unstructured sources that may originate on disparate platforms including pharmacy/medical claims, patient records, hospital systems, laboratory results, drug manufacturing data, and other relevant areas.  The Analyst must be able to evaluate and identify trends and patterns in healthcare cost and quality performance for emerging issues that impact products developed in support of the overall health and wellness of patients sponsored by ESI clients.  The analyst will actively partner with cross-functional financial, clinical and sales teams along with executive leadership, and client representatives to deliver insights and tools to support a market leading analytics and reporting. ESSENTIAL FUNCTIONS Ability to identify, analyze, and interpret trends or patterns in complex data sets  Communicate complex data concepts through the development of graphs, reports, and presentations  Develop and maintain reporting capabilities that help manage, track, and control the overall medical cost and clinical quality of a given population set.  Assume lead role in presenting key findings within data analysis necessary to support RFP responses and new business growth.  Identify and implement new capabilities and assist information delivery with teams that are focused on sales support. QUALIFICATIONS 5+ years of experience working with healthcare data, specifically pharmacy and paid medical claims.  Bachelor's degree (masters preferred) in Information Management, Finance, Healthcare Information, Computer Science, Mathematics, Statistics, Economics or related fields  Advanced Experience using SQL, Tableau, R, Python, SAS, Excel, Access and/or other statistical packages.  Exceptionally strong analytic abilities, with a proven track record of driving insightful findings from quantitative and qualitative data  Strong familiarity with pharmacy and health care drivers of payer and provider relationships (government program familiarity a plus).  Ability to develop contextually rich and visually compelling presentations to communicate complex concepts ABOUT THE DEPARTMENT Do you enjoy thinking strategically about the full life cycle of a technical product? Are you a techy type with the people skills to go with it? If so you may find a fit within technical product management, the team that manages our technology product portfolio and roadmap – creating, executing and helping to deploy scalable solutions used by our clients and members every day. If we’ve peaked your interest, let’s strike up a conversation. ABOUT EXPRESS SCRIPTS Advance your career with the company that makes it easier for people to choose better health.  Express Scripts is a leading healthcare company serving tens of millions of consumers. We are looking for individuals who are passionate, creative and committed to creating systems and service solutions that promote better health outcomes. Join the company that Fortune magazine ranked as one of the \\\"Most Admired Companies\\\" in the pharmacy category. Then, use your intelligence, creativity, integrity and hard work to help us enhance our products and services. We offer a highly competitive base salary and a comprehensive benefits program, including medical, prescription drug, dental, vision, 401(k) with company match, life insurance, paid time off, tuition assistance and an employee stock purchase plan.  Express Scripts is committed to hiring and retaining a diverse workforce. We are an Equal Opportunity Employer, making decisions without regard to race, color, religion, sex, national origin, age, veteran status, disability, or any other protected class. Applicants must be able to pass a drug test and background investigation. Express Scripts is a VEVRAA Federal Contractor.  *LI-PS1"}