{"jobID": "2737992030", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.tsico.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "TSI, is a leading supplier of specialized business process outsourcing (BPO) services that are delivered in our call centers through a diverse workforce across North America supporting clients in multiple vertical markets comprised of banks, energy and utility companies, health care providers, universities, and government organizations. We support the entire customer lifecycle that includes customer acquisition, full loan servicing, delinquency management, and collections utilizing a combination of voice, chat, email, SMS, and interactive voice messaging channels. As a result, employees enjoy the opportunity to grow, develop and build long-term careers in exciting industries, supporting the best brands in business, all while earning tenure with a specialty BPO leader. TSI represents a new company name, but one with over 40 years of experience and success serving these markets. About The Role TSI has a open position on its analytics team to better leverage our vast sets of first party and third party data to improve the efficiency and effectiveness of our global operations teams. This will be a key role with significant visibility to senior leadership and potential for positive impact on the business. Responsibilities:Build and execute dynamic models to estimate liquidations on prospective portfoliosWork with senior leadership to create explanatory material showcasing TSI’s modelsReview and assess existing collections strategies including account prioritization, contact strategies, performance/productivityBuild new scoring and segmentation models that predict the likelihood of a consumer to pay an outstanding balanceCustomize treatment approaches by asset type and industry vertical: what accounts to call when and with what intensity, cure vs. payment planEvaluate ways to optimize overall spend with third party data vendorsDevelop and maintain machine learning infrastructure that powers our scoring and segmentation models and contact strategiesQualifications:Strong analysis and modeling with SAS and SAS JMP. Must be able to write production quality code. Knowledge of Bayesian probability. Previous experience with, or research in, experimental designStrong SQL experience. Data will be sourced from our Data Warehouse using MS SQL Server. Must be able to handle complex joins and subqueries to quickly analyze and export datasetsAbility to clearly communicate insights and learnings to the business. Experience with presenting to groups and senior leadership is a plusRecord of delivering high quality products on timePractical self-starter; motivated to learn and improveAbility and willingness to roll up your sleeves and get things doneWork Environment:Office environment.Ability to lift and/or move 20 pounds with or without accommodation. We provide Equal Employment Opportunity for all individuals regardless of race, color, religion, gender, age, national origin, marital status, sexual orientation, status as a protected veteran, genetic information, status as a qualified individual with a disability and any other basis protected by federal, state or local laws."}