{"jobID": "2762073172", "jobLocation": "San_Francisco_CA", "jobTitle": "Email Marketing Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.earnest.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " SoFi, CommonBond"}, "estimatedSalary": "106000", "jobDescription": "Want to revolutionize finance? Earnest is a financial technology company changing consumer lending. We are a team of math nerds, designers, computer geeks and innovators going after a huge market by creating a company built on flawless design, powerful software, advanced data science and an incredible client experience. We believe that if we fundamentally re-engineered the experience of borrowing money, it would look and feel completely different to how it does today.  We are looking for an experienced marketing manager with proven success, from concept to delivery, of sophisticated email and direct mail programs for a data-driven multi-product company.  This role will lead the development and execution of all email, both triggered and campaign-based, and direct mail efforts across the Earnest customer lifecycle. This includes all email programs for the Earnest Student Loan Refinancing, Personal Loan, and Home Loan products, defining the correct touchpoints and offers to both acquire clients in the short-term and retain them over the long-term.  As an Email Marketing Manager, you will report to the Head of Growth, and: Manage strategy and tactics of email marketing and direct mail, leveraging best practices as well as creative solutions to maximize engagement and conversion rates in support of business opportunities and goalsAnalyze conversion funnels, identifying and optimizing key messaging opportunities to help attract and retain Earnest clientsCollaborate with internal partners to develop cohesive email campaigns and programs that are targeted, relevant, and on the brandManage external teams and vendors to successfully execute on direct mail initiativesContinually research and test new ways to engage clients using Earnest dataMonitor daily automation and sends to ensure proper execution of all initiativesOwn and report on the effectiveness of campaigns and programs, analyzing KPIs and other signals to develop insights, telling compelling stories and move the programs forwardQualifications:5+ years of direct/database marketing experience, including extensive experience with advanced customer segmentation to drive hyper-personalization and relevancyUnderstanding of email marketing operations and technology, including workflows, triggered events, and list management for a multi-product companySpecific experience with CRM platforms and top-tier email service providers a plus (especially Salesforce Marketing Cloud / ExactTarget)Outstanding problem solving, skills and the ability to digest large amounts of data and identify actionable trends, insights, and questions to answerStrong Excel skills required, MySQL proficiency preferredAt least intermediate HTML/CSS markup skillsHighly effective working cross-functionally with internal teams and external agencies, including technical teams.Demonstrated success articulating and advancing product/project requirementsEducation and/or equivalent experience in a quantitative or analytical disciplineEarnest Perks & Benefits:Health, Dental, & Vision benefits plus savings plansEmployee Stock Purchase Plan401(k) plan to allow you to save for retirement plus a company matchTuition reimbursement program$1000 flight on each Earnie-versary to anywhere in the world and a self-serve vacation planEarnest provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.Qualified applicants with criminal histories will be considered for the position in a manner consistent with the Fair Chance Ordinance."}