{"jobID": "2805777829", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Researcher - Quantitative Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.huxley.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Chicago based firm is currently looking to add an expert machine learning quant researcher to their team to develop machine learning techniques and applying them to seek patterns in large complex data sets. The resulting will be at the forefront of machine learning and pushing its boundaries into new and exciting areas. You will have the opportunity to create software to apply to machine learning techniques and where applicable, develop those techniques into new areas.  Individuals working at the firm can expect a collegiate environment where everyone is working towards a common goal. You will see the results of your research and work and be rewarded greatly in your bonus. Work life balance is something that you can expect to be a huge plus in this firm, as they respect their employee's family/personal lives. You can expect catered lunches and monthly company-wide events, as employee appreciation is very important for the firm. The environment is highly centralized around new model development and you will enjoy much autonomy in allocating your time to this practice, along with researching new ideas. Your models will be implemented in real time, which makes this environment extremely rewarding.  Requirements: PhD/MS in Mathematics/Physics/Statistics/Finance/Economics/Computer Science/EngineeringIn depth knowledge of Machine learning demonstrated in PhD in ML, conferences/publications, or work experience is requiredHands-on ability to apply mathematical concepts to real world financial problems, to implement theoretical insights as working code, and the ability to work independently in a research environment are all essential Preferred Skills/Abilities PhD having worked with/researched the latest areas of Machine Learning and strong interest in finance preferredStrong technical abilities - hands on work in C++/PythonExperience of working with large data sets to come up with innovative trading ideas for a high frequency environmentExperience in an object oriented language is very desirable If you are looking to get highly compensated for your quant research and the implementation of your machine learning expertise please submit your resume or contact me at Huxley Associates at 312-453-9099 with questions. If this position is not for you, I recommend sending me your resume, as we have additional roles we are looking to fill in the Global Market place here at Huxley.  Sthree US is acting as an Employment Agency in relation to this vacancy."}