{"jobID": "2820663012", "jobLocation": "Stanford_CA", "jobTitle": "Academic Affairs Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.stanford.edu", "Headquarters": "Stanford, CA", "Size": "10000+ employees", "Founded": " 1891", "Type": " College / University", "Industry": " Education", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "79448***This is a  12-month fixed term position at 75% FTE***Job: Data Analyst Location: Stanford  Graduate School of Business Schedule: 75% FTEJob Code: 4744 Job Grade: G Job Purpose: The  Office of Academic Administration at the Stanford Graduate School of Business,  which manages faculty affairs, faculty development, and faculty-related human  resource functions for the GSB, seeks an Academic Affairs Data Analyst to join  our team. This position will manage course evaluations,  reporting out of various Salesforce applications and other Academic  Administration online systems, building dashboards in Tableau, and assist with  developing robust reporting tools for the department. In addition, the Academic  Affairs Data Analyst will be responsible for the Academic Administration  website and related online resource guide for faculty.  The  Academic Affairs Data Analyst will be the point of contact and interacting with  multiple GSB departments and academic deans regarding optimizing data solutions  on behalf of Academic Administration, in close collaboration with the Assistant  Dean for Academic Administration and the Director for Academic Affairs, as well  as the full Academic Administration team. Core Duties:Assess  and produce relevant, standard, or custom information (reports, charts, graphs  and tables) from structured data sources by querying data repositories and  generating the associated information. Distribute and disseminate reports to  applicable agencies, researchers, management and other internal end-users.Develop  and produce dashboards, key performance indicators, and other recognized  metrics used to monitor and report organizational performance.Develop and implement  data analyses, data collection systems and other strategies that optimize  statistical efficiency and qualityCollect, manage and  clean datasets related to the report generation.Research and reconcile  data discrepancies occurring among various information systems and reports.Participate in the  implementation of data standards and common data elements for data collection.Identify new sources of  data and methods to improve data collection, analysis and reporting.Interpret data,  analyzing results using statistical techniques and provide ongoing as well as  ad hoc reports to support the Senior Associate Deans and the Academic  Administration Office goals.Independently  implement, administer, report, and analyze the course evaluation process,  working with the University Registrar’s Office, Digital Solutions, and the GSB  Academic Operations office in collecting evaluation data and producing all the  reports required for the deans, the faculty, and the students at the end of  each course. Manage the collection of customizations from  faculty for their course evaluations in a Salesforce environment. Familiarity  with XML is required. Oversee the collection of course evaluations and  communications with both faculty and students during the evaluation  terms.Evaluate programs,  policies and procedures related to course evaluations. Identify issues and  develop alternative solutions which may include changes to programs, policies  and procedures.Update and maintain the  internal online Faculty Resource Guide which supports and guides the faculty  constituent at the GSB. This includes generating and revising web pages in  Drupal, liaising with internal clients and departments, analyzing site traffic,  maintaining the site and ensuring all information is accurate.Other duties and  projects as assigned.Minimum  Education and Experience Required: Bachelor’s degree or a combination of education  and relevant experience. Experience in a quantitative discipline such as  economics, finance, statistics or engineering Knowledge, Skills and Abilities:Basic knowledge and demonstrated  experience using and applying analytical software, database management  system software, database reporting software, database user interface and  query software, and data mining software.Ability to collect data using a variety of  methods, such as data mining and hardcopy or electronic documentation  study, to improve or expand databases.Strong listening, verbal and written  communication skills.Ability to manage multiple activities in a  deadline-oriented environment; highly organized, flexible and rigorous  attention to detail.Ability to use logic to calculate data;  efficiently construct a database or scrutinize the form of a question.Ability to work with data of varying  levels of quality and validity.Demonstrated ability to produce data in a  clear and understandable manner meeting user requirements.Ability to work effectively with multiple  internal and external customers.Certifications and Licenses: None PHYSICAL REQUIREMENTS*:Constantly perform desk-based computer  tasks.Frequently sit, sort, file paperwork or  parts, grasp lightly, and use fine manipulation, lift, carry, push and  pull objects that weigh 10 pounds or less.Occasionally write by hand, twist, bend,  stoop and squat.Rarely stand, walk, reach or work above  shoulders and use a telephone. * - Consistent with its obligations under the  law, the University will provide reasonable accommodation to any employee with  a disability who requires accommodation to perform the essential functions of  the job. WORKING CONDITIONS:May work extended hours during peak  business cycles.WORK STANDARDS:Interpersonal Skills: Demonstrates the  ability to work well with Stanford colleagues and clients and with  external organizations.Promote Culture of Safety: Demonstrates  commitment to personal responsibility and value for safety; communicates  safety concerns; uses and promotes safe behaviors based on training and lessons  learned.Subject to and expected to comply with all  applicable University policies and procedures, including but not limited  to the personnel policies and other policies found in the University’s  Administrative Guide, http://adminguide.stanford.edu."}