{"jobID": "2833944222", "jobLocation": "Zeeland_MI", "jobTitle": "Manufacturing Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.odl.com", "Headquarters": "Zeeland, MI", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " It’s fun to work in a company where people truly BELIEVE in what they are doing! We’re committed to bringing passion and customer focus to the business. Responsibilities:Designs and develops lean manufacturing processes to optimize one-piece production flow, ergonomic and error-free assembly methods and reliable production equipment.Prepares and maintains accurate layouts of building, production lines and equipment.Provides leadership to the manufacturing launch of new and revised products to insure quality and volume targets are achieved and projects are completed on time and within budget. Works with outside suppliers to develop and purchase reliable equipment, fixtures and tools.Analyzes and improves processes for cost reduction, quality improvement, and improved efficiency.Establishes and documents process standards. Establishes standardized work, work breakdown instructions, quality standards and work methods. Trains operators, coordinators and team leaders to those standards.Establishes and maintains process capability standards and process monitoring procedures to insure process capability and quality is maintained.Troubleshoots production and quality problems to limit the negative financial and customer impact. Analyzes root causes of problems to prevent recurrence. Leads teams through 5D and 8D process to root cause of problems. Use Corrective Action Database for problems that require read-across solutions.Supports the ODL quality system through the application, evaluation, revision and addition of policies and procedures.Work cross-functionally to determine supplier performance requirements through PPAP and audits in order to achieve cost, quality and delivery targets."}