{"jobID": "2667655403", "jobLocation": "Scotts_Valley_CA", "jobTitle": "Machine Operator I", "companyRating": null, "companyInfo": {"Website": "www.thresholdenterprises.com", "Headquarters": "Scotts Valley, CA", "Size": "201 to 500 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DetailsLevel ExperiencedJob Location Scotts Valley Headquarters - Scotts Valley, CAPosition Type Full TimeEducation Level NoneSalary Range UndisclosedTravel Percentage NoneJob Shift DayJob Category ManufacturingDescriptionSummary of Job Duties:  The Machine Operator Level 1 operating various equipment in the manufacturing process including mixing, roller compacting. panning and milling while adhering to all food safety and food quality guidelines . Also expected to assist Machine Operator Level 2 in tablet & capsule formation. Operate and monitor equipment and replenish materials as needed. - Visually inspect production run and document results. - Determine and report malfunctions to appropriate parties. - Maintain cleanliness of equipment and assigned area. Specific Job Duties:Assist with plant sanitation, includes sweeping, washing, emptying waste containers, including shutdown clean upMeet all safety expectations including wearing the required personnel protective equipment and follow all safe practicesAble to work outside normal scheduled hours and OT to perform required maintenanceWork in a team environment and flow to the work and assist othersBatch, grind, and coat herbal and dietary supplemental products utilizing: Fitz-MillFitzpatrick Roller CompactorCoating panContinuously monitor product for appearance, hardness, weight and densityMaintain good housekeeping with sanitation as a constant and critical issueCross-training will occur throughout the facility in all aspects of high speed manufacturing.Ensuring Documentation in relation to Processor Operation are fully completed, signed and in compliance with Company Standard and Regulatory Requirements.Ensure full compliance with Companies Policies, Procedures, GMP’s, Code of Safe Practices and SOP’s at all times.Maximize Blending and Processing Uptime while ensuring consistent plant operation performance to quality, productivity, cost and safety requirements.Performs process control and quality checks.Cleans all equipment using current sanitation practices.Ensure equipment is running to efficiency standards while producing a high quality product in a safe, sanitary, cost-effective, and efficient manner that meets company food safety and quality standards..Check weights of each raw product to be blended, prepare ingredients accurately as specified by recipe.Report to the Operator/Production Supervisor any possible mis-blended material or mis-weighed product done on the shift or on previous shiftsIdentified batch containers accurately and weigh as required.Communicate and interact with others in a manner consistent with the company's \"I Can Make a Difference\" philosophies.Takes direction from the Machine Operator Level 2 and Team Lead.Supports Machine Operator Level 2 with responsibility for set up and changeoversPerforms all other duties as assigned by immediate supervisorQualificationsMinimum Qualifications Required:Self-motivated and ability to take initiative and use sound judgment in day-to-day decision makingPunctual and reliable in work attendanceAbility to lift up to 50 lbsWorking Conditions: Loud environment with exposure to powder and heavy equipment in a manufacturing atmosphere18 years of age or olderAbility to read and write legibly in EnglishAbility to work multiple shifts and/or schedules.Skills and/or Training Desired:Knowledge in Good Manufacturing Practices.Decision making.Time management and organization.Ensure collaborative relationships inside and outside the department.Communicate effectively verbally and in written documents.Lead ‘best in class’ behaviors with focus on safety, quality, and policy focus.Willing to work occasional off shifts and weekends."}