{"jobID": "2831743041", "jobLocation": "Spring_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.adecco.co.uk", "Headquarters": "GLATTBRUGG, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (ADEN) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Adecco is currently assisting a local client in their search to fill an exciting Data Analyst role in Spring, TX! Apply now if you meet the qualifications listed below! Responsibilities, Qualifications, & Details: Job Title: Data Analyst  Shift: Monday-Friday 8:00am-5:00pm  Location: Spring, TX  Pay Rate: NA  Description POSITION SUMMARY: This position, requires detailed knowledge across a wide variety of skills including the following: SAP (multiple environments), purchasing payroll, Data Warehouse, Excel, SharePoint, OneNote and several other applications. Our group is the resource group for EMRE Engineering and FPO and we need someone that has the knowledge and background of ExxonMobil that can step in and start answering questions and working immediately. Responsible for importing, cleansing, validating and analyzing data with the purpose of understanding or drawing conclusions from the data.May consolidate and/or present data in charts, graphs, or tables. Focused on improving data quality.Works with moderate work direction and is skilled and knowledgeable to the position.This position would typically include senior Data Analyst with extensive prior experience.Generally has ability to work with other departments and management to determine organizational goals, pinpoint trends, correlations and patterns in complicated data sets.Able to provide supervision, training and mentoring to junior analysts within the department.SKILLS AND QUALIFICATIONS:Strong analytical, verbal and written communication skills.Report generation and data analysis. Proficient in MS Office.SAP, SharePoint Knowledge is REQUIREDREQUIREMENTS:BS / BA required with 2+ years of relevant years of experience; or HS Diploma or Equivalent with 3+ years applicable experience How to Apply: Click on \"\"Apply Now\"\" to be considered for this position or any other opportunities with Adecco.  IMPORTANT: This position is being recruited for by Adecco's National Recruitment Center, not your local Adecco Branch Office. To be considered for this position, you must use the \"\"apply now\"\" button to submit your resume. If you have questions about the position, you may contact the recruiter recruiting for this position listed above. For other opportunities available at Adecco go to company website.  If you have any questions surrounding the application process, please feel free to reach out to: Your First & Last name; your phone number; & your email.  The Adecco Group is a global leader in HR services. Our group connects over 700,000 associates with our business clients each day through our 6,600 offices in over 70 countries and territories around the world. We offer employment opportunities at any stage in your professional career. Contact us today to discuss available contract and direct hire positions. Adecco Group provides one of the most comprehensive benefits packages in the industry to contract workers to include Holiday, 401(k), Insurance Benefit Plans and Service/Anniversary Bonus opportunities.  Equal Opportunity Employer Minorities/Women/Veterans/Disabled  More Information  Company Description:Adecco is the world’s largest provider of staffing solutions. But it’s not our size that makes us different, it’s our unwavering commitment to the businesses, job seekers and communities we serve.  Every day, we propel job seekers forward in their career and help America’s top employers attract, develop and manage the very best talent. Job seekers rely on us for exciting temporary, temp-to-perm and permanent opportunities, as well as career resources and advice. Businesses throughout the country and across all industries count on us for access to more than 9 million qualified candidates and an ability to deliver proactive and actionable insight into the economy and the job market. We also sponsor community and nationwide community service events to ensure opportunities for all.  We are proud of the fact that we connect more people with more jobs than anyone else, and know how important what we do is - not only to the economy and job market, but also to the lives and communities we touch"}