{"jobID": "2831958059", "jobLocation": "San_Antonio_TX", "jobTitle": "Auto Loans Analytic Consultant 4 - C2C COE", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.  Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Wells Fargos Chief Administrative Office (CAO) consists of enterprise functions that work together to promote and protect the Wells Fargo culture and brand, and support our team members. Groups within CAO work to protect our reputation, tell our story, bolster team member engagement, connect with our customers, and bring new and innovative solutions to life. CAO functions include Commitment to Customer, Corporate Responsibility & Community Relations, Data Management & Insights, Human Resources, Marketing, Stakeholder Relations, and the CAO Integration and Planning Office.  With the centralization of Commitment to Customer (\"C2C\") Remediation functions into the Center of Excellence (\"COE\"), we have an immediate need for a highly skilled Auto Loans Analytic Consultant 4 - C2C COE. This Analytic Consultant will play the critical role of leveraging deep business systems and database knowledge to perform advanced data validation of commitment to customer remediation populations of customers who were harmed.  ***We are targeting a resource who understands auto loans servicing and collections.***  KEY RESPONSIBILITIES INCLUDE: Analysis of C2C issues to understand customer harm for auto loansQuerying databases via SQL to identify populations of harmed customer for auto loansUtilizing auto loans business systems to research transactions on loan accountsDelivering data populations and required documentation to remediation leadsWorking with data validation teams to ensure accuracy of data populationsCreating business language illustrations of loans in scope for each remediationProfiling data to identify outliers, quality issues, and inaccurate dataLeading remediation projectsMentoring other team members who have less experience Who We Are: Learn more about Wells Fargo#C2CRequired Qualifications6+ years of experience in one or a combination of the following: reporting, analytics, or modeling; or a Masters degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 4+ years of experience in one or a combination of the following: reporting, analytics, or modeling1+ year of auto finance industry experience including 1 or a combination of the following: collections, operations, sales, and/or credit1+ year of data analysis experienceDesired QualificationsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyExcellent verbal, written, and interpersonal communication skillsAbility to prioritize work, meet deadlines, achieve goals, and work under pressure in a dynamic and complex environmentAbility to work effectively in virtual environment where key team members and partners are in various time zones and locationsOther Desired Qualifications5+ years of combined experience in using some or all of the following systems: AFS, Brickyard, CARS, Credit Revue System, ECAR, EXS, Dealer Services Data Warehouse, and SHAW East to query and review Dealer Services and/or Direct Auto loans and loan transactions, especially loan servicing and collections informationKnowledge of Dealer Services and/or Direct Auto policies and procedures, especially how loans are serviced, how collections are pursued for delinquent customers, how payments are posted, and how and when other charges are added to balances (i.e., late charges, non-sufficient funds charges, etc.)2+ years of experience querying databases using Microsoft SQL Server Management Studio, SAS Enterprise Guide, Toad for Oracle, or a similar data querying toolKnowledge and familiarity with the Wells Fargo Commitment to Customer (C2C) policy and the process of remediating harmed customers in accordance with the C2C policyStreet AddressCA-Irvine: 2030 Main St - Irvine, CA TX-San Antonio: 4101 Wiseman Blvd - San Antonio, TX IA-Des Moines: 6200 Park Ave - Des Moines, IA AZ-Chandler: 2600 S Price Rd - Chandler, AZDisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}