{"jobID": "2786922705", "jobLocation": "San_Francisco_CA", "jobTitle": "VP of Sales: Digital Transformation Platform & Solutions", "companyRating": null, "companyInfo": {"Website": "www.rakuteninteractive.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2017", "Type": " Company - Public ( RKUNF ) ", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " McKinsey & Company, Accenture, Deloitte"}, "estimatedSalary": null, "jobDescription": "We are pursuing a proven VP of Sales to build net-new revenue for our digital transformation solutions and consulting group, Rakuten Interactive. Our ideal candidate will build and manage a successful solutions sales team, achieve quick-wins and new logos, land expand our transformation platform, and build the beginnings of a strong channel program. The rally cry is obtain logos and X amount of revenue. The challenge is quickly create an entirely new business along the way. With a strong technology and consulting background, our VP of Sales candidate will focus on 3 levers:1. Sell digital transformation platform & solutions: We have a brand new platform to help organizations cost-cut, lift revenue, and increase customer engagement. Named \"Rakuten Interactive Transformation,\" we cover 5 pillars of digital transformation, lifted by proprietary data, our O&O; (owned and operated) sister companies, and a strong partnerships team that builds new products from fast-moving startups. The mandate is to bring point-solutions into large transformation projects to book direct and contributed revenue. Scaling revenue with annuities and partnerships, negotiating optimal contracts, and doing so quickly are key.2. Sell digital consulting: Our sales leader takes on the eponymous Partner role from a Digital McKinsey/Accenture Digital, focused on selling projects and strategy (cost-cutting, digital transformation, C-suite strategy), while leveraging Rakutens proprietary data and black-box solutions. Approach each sale in a consultative way -- supported by our consulting team. 3. Build platform and channel sales: Were looking for our candidate to recreate the Oracle Accelerated Buying Experience, a 1-click purchasing portal to sell exact software needs and and complimentary solutions, without dozens of contracts or months for deployment. We also want our Director / VP of sales to work closely with our partnerships team to manage and monetize a growing portfolio of new startups, their technologies, and ecosystem alliances (Vendors, SIs, Consultancies)to create a high growth channel market.Ideal requirements: hunter-gatherer in his/her past life, evangelized software with enthusiasm and simplicity, produced $MM revenue, and exceeded OTE earnings. He or she can naturally value blue/red ocean opportunities, leverage cross-disciplinary assets, and reduce the average sell-cycle exponentially. Finally, our candidate will have the patience, enthusiasm, and dare to teach and coach a world-class sales team.• Rapidly hire, develop a team of senior sales managers and SDRs• Drive business planning, goal attainment, measurement/improvement and comp design to maximize team value• Manage high-quality, qualified leads to Mid-Market and enterprise sales teams• Build 1-click enterprise sales platform in the channel and create channel strategy• Put in the infrastructure and be an expert / enforcer of Salesforce and lead qualificationResponsibilities:• Sell to the top: CMO, CIO, CXO, Head of Digital, Head of Innovation• Consultative, data-driven solutions to consumer-driven customers• Managed solutions for paid search/social ad budget optimization• Marketing, performance, affiliate space driven platforms • BPO, cost-cutting automation to F500• Achieve $MM sales and revenue target within CPG and/or Financials sector, working closely with Channel Directors to drive origination and lay pipeline• Achieve and exceed revenue targets and overall sales through key accounts • Hire, train, manage team of SDRs and corporate account executives • Manage P&L; responsibility for Consulting group• Use Salesforce religiously to manage sales process, pipeline, performance• Sell at tradeshows, industry events, and vendor conferences• Optimize pipeline and channel GTMs when necessary• Develop inbound marketing for demand generation: workshops, sales materials, PoCs, videos, customer-ready credentialing• Work with client account team members to define pursuits, shape solutions, support RFPs, and customized solution development• Initial sales enablement to educate and equip sales force to retain, grow, and secure net-new customersExperience:• 10-20+ years in direct sales and business development at mid to growth stage SaaS startup, blue-chip technology company, global digital or management consultancy, or eCommerce company• Strong solution selling experience particularly in B2B vertical, with mixed pipeline • Existing relationships, books of business, and proven track record of sales Team Fit:• Hungry, positively aggressive, curious, and creative• Able to set and make KPIs in rapidly changing industry• Right kind of ambition: growing people, revenue, and products with no bureaucracy or politics• Not a 11am-3pm Mountainview job: legwork, persistence, and travel requiredEducation:• Bachelors degree, no restriction on concentration• MBA a plus, but not overly necessaryNotes: (1) Do not apply if you have not been both a consultant and a proven software sales executive. This role is extremely quota-driven and not on a best efforts basis. (2) Do apply if you are confident in selling strategy and culture along with $MM projects and tangible MRR/ARR to reach an agreed end-of-year revenue goal.This is an accelerated and thoroughly vetted process for qualified candidates. No external agencies please. Compensation commensurate with experience. Proud EOE/M/F/D/V/SO.Only apply from this original link if referred from elsewhere: https://jobs.lever.co/rakuteninteractive/0f41714c-3b29-4ab4-9858-d2ff06896707Rakuten Interactive is the digital transformation platform and professional services group within the world's leading innovation company, Rakuten, Inc. We build enduring digital businesses for the mid-market and F1000 with data-driven insights, customer acquisition, personalized advertising, and solutions-led business strategy. Rakuten, Inc. (TSE: 4755) is a global leader in internet services that empower individuals, communities, businesses and society. Founded in Tokyo in 1997 as an online marketplace, Rakuten has expanded to offer services in e-commerce, fintech, digital content and communications to more than 1 billion members around the world. Since 2012, Rakuten has ranked in the top 30 of Forbes Magazine's annual \"World's Most Innovative Companies\" list. The Rakuten Group has over 14,000 employees, and operations in 29 countries and regions. For more information visit http://global.rakuten.com/corp/. Rakuten is the Main Global Partner of FC Barcelona, one of the world's most valuable sports teams, and the official sponsor of 2016-2017 NBA Champions, the Golden State Warriors."}