{"jobID": "2830939564", "jobLocation": "Houston_TX", "jobTitle": "Senior Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.kbrwyle.jobs", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " Senior Scientist  Description  This position will provide scientific and technical support to the Cardiovascular and Vision Laboratory (CVL). The CVL is a component of the Biomedical Research and Environmental Sciences Division, which implements the science objectives of the life sciences research laboratories at the Johnson Space Center. The successful candidate will be responsible for participating in the design and implementation of research directed toward development of countermeasures against deconditioning due to space flight. The primary function of the incumbent will be to collect, analyze, manage, and report research and medical data in support of research activities conducted in the CVL. We are particularly interested in individuals whose expertise will complement the existing CVL research portfolio, and planned research experiments to enable NASA to safely send humans on exploration class missions. Essential Duties & Responsibilities:Responsible for compliance with Safety, Health, and Environmental plan; must be committed to a high standard of safety and be willing and able to comply with all safety laws and all of the Company's safety policies and rules and must be willing to report safety violations and potential safety violations to appropriate supervisory or management personnelResponsible for compliance with the Quality Assurance Plan, policies and proceduresMust maintain regular and acceptable attendance level as determined by CompanyResponsible for completing all assigned trainingAssist in experiment protocol development and implementationLead human subject research data collection, analysis, reduction, and interpretationAbility to follow detailed research study protocols and data management proceduresMaintain organized and secure approach to retrieval and analysis of archived dataWillingness to undertake domestic and foreign travel, as required, to support space flight, bed rest, and ground-based experimentsMust be comfortable in simultaneously coordinating multiple projects and managing individual responsibilitiesApproach tasks with flexibility and willingness to re-direct efforts in the event of changing laboratory prioritiesParticipate in scientific conferences to present recent experimental results and interact with extramural scientists to remain abreast with current researchAnalyze and organize technical data and reports for management reviewAssist in development of grant proposals, and prepare reports and manuscripts.Qualifications Education/Experience  Required: This position requires a Ph.D. degree in vision science or a closely allied field with 0-2 years experience, or a Master's degree with 4 years experience. The incumbent's abilities and areas of technical skills will include the following: experience in ocular physiology research, preferably vision science, ophthalmology, and/or ocular biomedical imaging; leading development, design, and implementation of human research protocols; provide evidence of scientific productivity in the past 5 years; preparation and publication of scientific manuscripts; ability to integrate and synthesize raw data for reporting; ability to deliver oral and written communication of scientific data; ability to work independently and to manage multiple projects/timelines and analysis of physiological data.  Incumbent must have the ability to work effectively both in small teams and independently; and work effectively in a multidisciplinary setting and where there are frequently divergent or competing goals for the project implementation and outcome, as well as excellent interpersonal skills and highly developed organizational skills. Demonstrated ability to coordinate technical and/or scientific requirements is also required. The incumbent must have the ability to travel independently (domestic and international).  Desired: Technical skills associated with image analysis, including ocular ultrasound, ocular MRI, and/or optical coherence tomography are desired. Evidence of successful grant funding history.  Skills/Training  Required: Superior written and oral communication skills are required as is the ability to work independently and as a team. The candidate must have the ability to work effectively with intramural and extramural teams, including international partners, to conduct complex flight and ground-based research projects. The employee will need to be familiar with basic statistical techniques and principles of experimental design. The incumbent must have a thorough knowledge of policies and procedures governing the use of human test subjects. The incumbent must be computer literate and must be able to master the use of spreadsheets and other software packages used for data collection, reduction and analysis. In particular, the incumbent should be proficient with Microsoft Office products (Word, Excel and Power Point). The incumbent must have knowledge of vision science/ophthalmology research methodology and remain current in this area through the study of pertinent literature.  Desired: Experience with Matlab programming, database management, and various biostatistical tests and approaches.  KBR is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity or expression, age, national origin, veteran status, genetic information, union status and/or beliefs, or any other characteristic protected by federal, state, or local law.  Job: Science  Primary Location: US-US-TX-Houston  Req ID: 1062723SDL2017"}