{"jobID": "2754779455", "jobLocation": "Skillman_NJ", "jobTitle": "Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.smithhanley.com", "Headquarters": "New York, 061", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kforce, PageGroup, Robert Half"}, "estimatedSalary": null, "jobDescription": " Title: Analytics ManagerLocation: Skillman, NJSalary: $110,000 - 130,000Contact: Paul Chatlos, pchatlos@smithhanley.com#GDOur client is currently recruiting for a Manager of Advanced Analytics. This position will be based in Skillman, NJ or Fort Washington, PA with 10% Domestic Travel. The Manager of Advanced Analytics reports to the Associate Director of Advanced Analytics (Global Strategic Insights and Analytics). This individual will be responsible for building and adapting transformational digital analytics capabilities for personalized marketing and making 'Analytics driven decision making' an organizational must. The Manager will drive improvement in data-driven consumer-focused digital ecosystem performance, boosting effectiveness across Paid Digital Media, eRetail Media, Website / CRM, Social, Mobile, Influencers, Search, Precision Targeting, and Programmatic in North America. This individual should have a direct impact on digital ROI, executing more efficient campaigns and effective use of digital assets by implementing best in class audience segmentations, measurement, tracking and reporting within North America. This leader will be responsible for working with I.T. on the data lake, technical professionals, and other specialists to drive the organization's consumer level data and advanced analytical technologies and capabilities to optimize digital media investments. The individual must build strong collaborative partnerships across the organization such as business leaders and marketing teams, Total Brand Experience, Marketing Accelerator, IT, Global Analytics, GSIA squad leads, as well as various agencies, publishers and vendors. Responsibilities: -Drives digital analytics capabilities within a business unit to enhance the organization's proficiency in this space and maximize business impact-Improves project designs and implements new technologies to enable agile marketing and fit for future capability-building through thought leadership-Uses strong knowledge of personalized marketing, programmatic media, digital analytics and industry leading practices in measurement through all digital channels to proactively identify opportunities and enhance agile granular measurement within one of North American business units-Drives personalized marketing by developing consumer 360 view to improve precision targeting across the brands for paid, owned, and earned media within the assigned business unit -Partner with IT and agencies on obtaining data needed to support analytics needs and closely involved with managing the data lake to support projects-Leads digital analysis and reporting for executive-level business stakeholders to guide business unit in brand performance, competitive landscape, and opportunities to improve ROI -Closely partners with eCommerce and Insights team to further drive profitable opportunities within eRetail media-Works closely with Global Analytics for Personalized Marketing team in deploying latest capabilities in technology and advanced analytics and training for key stakeholders in the business Qualifications-Master's degree in Quant field preferred-A minimum of 5 years of progressively responsible experience within programmatic media, digital analytics, digital marketing, media, consulting or related fields-Experience in SAS, R, Python or similar statistical programming language-Experience working for CPG marketer is a plus-Comprehensive understanding of the digital ecosystem and how web, CRM, mobile, social, search and eComm channels work together to drive acquisition and lifetime value is required-Deeper understanding of social and programmatic media preferred-Experience with applying advanced analytics methods for digital measurement: such as multi touchpoint attribution, matched panel analysis, marketing mix, consumer lifetime value models, A/B testing etc. is preferred-Ability to think analytically to understand complex or am"}