{"jobID": "2813400146", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Solutions Consultant", "companyRating": null, "companyInfo": {"Website": "www.zendesk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZEN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Freshdesk, RightNow Technologies"}, "estimatedSalary": null, "jobDescription": "The Senior Solutions Consultant is responsible for all technical, solution, and competitive aspects of the Zendesk sales cycle. SCs must be both sales focused and technically savvy. They must be successful selling to Enterprise and Mid Market executives, and convincing C-level and director level executives of the technical merits of the software solution. The SC will work, in conjunction with Sales, Marketing, and Product Managers, to be the technical bridge between our Sales Representatives and their prospects. The SC will take ownership of the prime technical relationship with our prospects to drive customer satisfaction by proactively managing and delivering technical information to our customers both onsite, online, and via telephone.Requirements5+ years of Mid Market/Enterprise software selling experience.Experience mapping RFI/RFP requirements to software solutions.Excellent interpersonal, communication, persuasion, presentation and writing skills.Call Center Experience is Desired (and a huge plus!)Experience scoping, managing and executing customer pilots and Proof of Concepts.Knowledge in web / scripting technologies, HTML, CSS, JavaScript and SaaS applications.Outstanding problem solving skills, including the ability to meet a business requirement with a technical solution.Superior solution scoping abilities, using our existing solution and influencing new product development.Must be willing to work in a fast paced startup environment with multiple roles.Bachelors degree is a must; graduate degree is a plus.Must be willing to travel.Obvious passion and people skillsDesired SkillsPrevious consulting experience implementing enterprise class software solutions.In-depth knowledge of Customer Service Software, ITSM, data warehousing, business intelligence, Customer Service Software.#LI-ES1The best customer experiences are built with Zendesk. Zendesks powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesks use of your personal information."}