{"jobID": "2731287649", "jobLocation": "San_Carlos_CA", "jobTitle": "Data Scientist - Statistical Modeling Specialist", "companyRating": "3.9", "companyInfo": {"Website": "www.upstart.com", "Headquarters": "San Carlos, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": " Upstart is the first lending platform to leverage artificial intelligence and machine learning to price credit and automate the borrowing process. Our engineering and data science teams collaborate to use non-conventional variables at scale in an underwriting model that improves constantly. After exciting success over the past few years, Upstart is looking to double down on its competitive advantage by expanding its data science team!  Underwriting more accurately and using variables that no other lender considers are what allow us to give people the rates they deserve, so your role at Upstart will drastically impact our company's success. Our current Data Scientists summarize some of their favorite aspects of our team as: Having a direct impact on the company's successCollaborative, intelligent, and open teamMentorship, growth, and friendshipLeader committed to challenging and growing team membersFeeling safe asking for help when its necessary; feeling trusted to get the job done when its not We are looking for a statistical modeling specialist that enjoys working in a very fast-paced environment. Because our challenges are so new, this person will need to have strong creative problem solving skills and the technical background to implement such solutions. If you think that this could be the right role for you, we would like to learn more about you. Here are some of the requirements that we're looking for:Published research in high-quality statistical journal(s) with a preference for one of the following topics: missing data, survival analysis, consumer credit riskExpertise in predictive modeling and inference using GLMs, longitudinal, mixed-effects, and time-series models, among othersComfort designing experiments using A/B testing and multi-armed banditsFamiliarity with schemes for data imputation and the appropriateness of each when data is missing completely, missing at random, and missing not at random3+ years academic or professional experience in statistical researchM.S. in Statistics or related field; Ph.D. strongly preferredApplying to a Data Science role at Upstart: Please apply through our website and only apply to the one position that is the best fit with your skills.  If you have applied within the past year, there is no need to apply again. We're currently reviewing all previous applications. We also consider candidates for all levels of Data Science roles when candidates apply."}