{"jobID": "2820361358", "jobLocation": "Austin_TX", "jobTitle": "Health Care Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.texmed.org", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 1853", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DEPARTMENT Research and Data Analysis SUPERVISOR Associate VP, Payment Advocacy BASIC FUNCTION Performs data analysis to support TMA survey operations and identifies and analyzes data from public data sources to support TMA projects. Create and maintain data sets for analysis. Perform routine and ad hoc queries and investigations. Create tables or charts to display data relationships and trends. Build and maintain chart libraries for use by other TMA staff and physician leaders. MAJOR RESPONSIBILITIES/TASKS 1. Build new databases or import data for analysis by converting, formatting and cleaning data for use and reporting. Maintain historical data for trend analysis.Create reports of frequency distribution, tables of means, cross-tabulations or other analysis of existing data.Present analyzed data in graphic formats or charts to facilitate information communication.Maintain chart libraries or other information sources for use by TMA staff or members.Create survey questionnaires and coordinate with TMA staff on use of web surveys.Perform data entry when necessary to build or update databases.Perform research to identify health-care-related data sources available in the public domain.Answer queries from TMA staff or members by performing ad hoc analysis on existing data.Field and/or triage inquiries related to data issues from TMA staff and members.Work with cross-functional teams to support and prioritize data needs and projectsMonitor and distribute to other TMA departments data or survey-related communications from state and federal agencies including, but not limited to Texas Department of Insurance, Health Care Financing Administration, Department of Health and Human Services, Office of Inspector General, and General Accounting Office.Present survey research and data to TMA Councils and CommitteesPerform other related duties as directed or required. SUPERVISORY RESPONSIBILITY No supervisory responsibility.   INDEPENDENCE/SUPERVISION RECEIVED Duties are performed independently to achieve assigned objectives. Methods and procedures may not be specifically defined. Employee may be required to develop or research appropriate methods and procedures to be used. GENERAL QUALIFICATION REQUIREMENTSKnowledge and Experience: Requires concentrated understanding of a comprehensive field of knowledge. Knowledge required is normally equivalent to the attainment of a bachelor’s degree in related field or 2 to 3 years experience. Must have basic knowledge in data analysis, reporting, and presentation. Knowledge about health-care related data, survey research, or medical economics would be a plus. Skills and Abilities: Ability to understand and follow oral and written instructions and deal effectively with other TMA employees and members. Must be organized and able to plan work which requires evaluating facts to determine courses of action. Good communication and interpersonal skills are essential. Skilled in Microsoft Access, Excel and Powerpoint. Knowledge of SPSS statistical software would be a plus."}