{"jobID": "2832168161", "jobLocation": "West_Hollywood_CA", "jobTitle": "Marketing Data Science Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Uptown Treehouse is searching for self-motivated individuals interested in a 3-month marketing data science internship focused around social media and web traffic data. If you're selected, you'll have several different projects to choose from for a myriad of clients such as: Lenovo, Microsoft, Uniqlo, Western Union, and many more. At the end of the internship, you'll present your results.  The internship is 3 days a week in office and is not compensated. We offer experience for your time and also a written recommendation. The vast majority of our interns have gone on to work at major companies such as Amazon, Google, and Yahoo! Projects:ROI ForecastingWebsite Traffic ForecastingSocial Media Ad Spend OptimizationNLP of Social Media Conversations to Abstract High-Level InsightsImage Processing of Brand Logos via Convolution Neural Networks In addition to a project, we'll introduce you to our everyday work flow that you'll be asked to assist with. Job Functions:Assist in conducting analysis to determine key performance trends and outliers as well as uncover challenges and opportunities to build solutions that drive growth against client and agency business objectives.Coordinate with the Strategy and Design teams to draft visually appealing reports, infographics and other related materials.Learn to research and pitch emerging technologies that can be used for improving digital and social intelligence.Query and manipulate raw data through the use of advanced functions to deliver against specific objectives.Assist in ad hoc projects within the agency; collaborate with internal teams to quickly get up to speed on new technology, challenges and/or opportunities to help drive the solution.Qualifications:A working knowledge of python and some of its scientific&machine; learning modules: pandas, keras, sklearn, matplotlib, numpy - requiredB.S. (or graduating 2018) in a mathematically inclined degree - requiredFamiliarity with machine learning algorithms such as: Random Trees, SVM, KNN, Regression, etc. - requiredFamiliarity with NLP - requiredBasic understanding of simple Neural Networks - requiredBasic knowledge of HTML, CSS, and JAVAExperience interacting with APIsGoogle Analytics or Adobe Omniture"}