{"jobID": "2827487322", "jobLocation": "Long_Beach_CA", "jobTitle": "Data Analyst-HEDIS & Star", "companyRating": "3.1", "companyInfo": {"Website": "www.scanfw.org", "Headquarters": "Fort Wayne, IN", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Data Analyst HEDIS & Medicare StarLong Beach, CAFull-timeAbout SCAN Our mission is simple: Keeping Seniors Healthy and Independentthats been our mission for almost 40 years. Rated as one of the top Medicare Advantage plans in California, SCAN Health Plan employees are passionate about what they do. Understanding that  success is based on achieving the mission, SCAN employees are afforded with the training and tools necessary to do their jobs and they are rewarded for their efforts and recognized as experts in their fields. Ask anyone who works here and well proudly tell  you that SCANs commitment has never wavered. We are as steadfast in our pledge to help our members live healthy and independent lives. The job Develops, documents, and programs in support of 5-Star projects and in-house initiatives. In pursuit of high 5-Star ratings, conducts in-depth data analysis and interpretation, HEDIS reporting, and other related tasks. You willDesigns and produces timely and meaningful analysis and data interpretation regarding large health care related datasets, related to 5-Star ratings, HEDIS, , state specific programs (such as QIP/PIP), programs issued by state agencies (such as DHCS or HSAG) and other associated company initiatives.Utilizes software programs such as SAS, SQL, Excel and/or other business intelligence tools to extract needed data. Writes original code and modifies existing code, as needed, to execute projects to specifications, and assists in the development of these  specifications.Interprets data accurately and produces clear and comprehensive written analyses, graphics, tables, etc. for diverse internal and external audiences.Plans, organizes, and prioritizes assigned projects, creating and managing work plans that reflect the tasks, timeframes, and processes required to successfully complete each.Assists with development, implementation, and documentation of quality assurance (QA)processes to ensure that reported data is accurate and reliable.Documents data collection processes with other teams in Healthcare Informatics to transition data collection from one team to another.Contributes to and advances group knowledge about the Medicare population.Demonstrates a commitment to customer service through timely, accurate, and supportable deliverables.Ensures understanding of customer needs by proactively clarifying scope and requirements and keeping customers apprised of project status through effective communication.Supports customer understanding of analytical findings through effective presentation of results to individuals and groups.Achieves high-quality deliverables by assuring accuracy and thoroughness in executing projects.Manages multiple projects by effectively prioritizing work and communicating workload issues to management.Contributes to team effort by accomplishing related results as needed.Your qualificationsBachelors Degree required.2+ years of related analytical experience required.Strong analytical skills required.Ability to effectively interact with, and present findings to customers at various levels of the organization.Advanced SAS data step, SAS macro language, and other SAS procedures required.Ability to document processes and analyses for reference/re-use required.Excellent technical, interpersonal, written and oral communication skills required.Proficient in MS Office.Your preferred qualificationsProficiency with MS SQL (queries) preferred.Clinical code knowledge related to claims/utilization preferred.Experience with managed care contract terms/analysis preferred.Experience in a Medicare Advantage environment preferred. SCAN is an Equal Opportunity Employer: Minority/female/disability/veteran.  It is our policy to abide by all federal, state and local laws prohibiting employment discrimination and all qualified applicants will receive consideration for employment. SCAN will not discharge or in any other manner discriminate against employees or applicants  because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions  cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding,  hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractors legal duty to furnish information. Please view Equal Employment Opportunity Posters provided by OFCCP  here."}