{"jobID": "2800388687", "jobLocation": "Princeton_NJ", "jobTitle": "Clinical Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.otsuka-us.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " The Clinical Data Scientist at Otsuka will support a diverse array of initiatives including advanced computational modeling, clinical development (with particular focus on digital programs), and software development projects. Paramount to this role is the ability to support clinical programs with appropriate analytical strategies. Work closely with stakeholders interfacing with clinical and real-world data to identify, enhance, and support the quantitative and technological needs for all Otsuka projectsManaging software development projects at various levelsReviewing/planning clinical studies across multiple CNS programs, and conducting analyses related to time series modeling, supervised and unsupervised learning techniques, Bayesian methodologies, and othersProvide statistical and modeling support for planning and implementing clinical and real-world evidence studies/programs to meet the value/evidence needs of payers, health systems, clinicians, and patients.Provide solutions of clinical and economic utility by leveraging internal, external and real-world data sources.Guide evidence-based product development (digital/non-digital) by extracting therapeutic intelligence from such data sources Travel (up to 15-20%)  Required: A PhD in Pharmaceutical Science, Statistics, Engineering, Mathematics, or a related quantitative field with 0- 5 of years of post-graduate experienceKnowledge of existing and upcoming statistical methods (supervised and unsupervised) in pharmaceutical data analysisProficiency with programming in software such as Python, R, MATLAB, SAS, SQL etc.Knowledge of pharmaceutical modeling tools such as NONMEM, Monolix, Phoenix NMLE, etc.Knowledge of clinical development and clinical trial executionMust be agile to grow in new directions, acquire new skills, and work with a team of scientists and practitioners from different functional areas to solve problems and create solutions of clinical and economic utility.Must be able to bring insights to stakeholders with ability to extract therapeutic intelligence by leveraging internal, external, and real-world data sources.Excellent communication skills Preferred: Knowledge of, and experience with, real world databasesKnowledge of current and emerging ‘big data’ technologies Otsuka Pharmaceutical Company is a global healthcare company with the corporate philosophy: “Otsuka-people creating new products for better health worldwide.” Otsuka researches, develops, manufactures and markets innovative products, with a focus on pharmaceutical products to meet unmet medical needs and nutraceutical products for the maintenance of everyday health.  In pharmaceuticals, Otsuka is a leader in the challenging area of mental health and also has research programs on several under-addressed diseases including tuberculosis, a significant global public health issue. These commitments illustrate how Otsuka is a “big venture” company at heart, applying a youthful spirit of creativity in everything it does.  Otsuka Pharmaceutical Company is a subsidiary of Otsuka Holdings Co., Ltd. headquartered in Tokyo, Japan. The Otsuka group of companies employed 45,000 people worldwide and had consolidated sales of approximately USD 11 billion (€ 9.9 billion) in 2016.  All Otsuka stories start by taking the road less travelled. Learn more about Otsuka Pharmaceutical Company on its global website at www.otsuka.co.jp/en. Learn more about Otsuka in the U.S. at www.otsuka-us.com."}