{"jobID": "2831248949", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst, Payer Data Services", "companyRating": "3.6", "companyInfo": {"Website": "www.evolenthealth.com", "Headquarters": "Arlington, VA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (EVH ) ", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " IT Client Management Data Analyst, Payer Data ServicesChicago, IL, United StatesAPPLYIt’s Time For A Change…Your Future Evolves Here Evolent Health has a bold mission to change the health of the nation by changing the way health care is delivered. Our pursuit of this mission is the driving force that brings us to work each day. We believe in embracing new ideas, challenging ourselves and failing forward. We respect and celebrate individual talents and team wins. We have fun while working hard and Evolenteers often make a difference in everything from scrubs to jeans.  Are we growing? Absolutely—56.7% in year-over-year revenue growth in 2016. Are we recognized? Definitely. We have been named one of “Becker’s 150 Great Places to Work in Healthcare” in 2016 and 2017, and one of the “50 Great Places to Work” in 2017 by Washingtonian, and our CEO was number one on Glassdoor’s 2015 Highest-Rated CEOs for Small and Medium Companies. If you’re looking for a place where your work can be personally and professionally rewarding, don’t just join a company with a mission. Join a mission with a company behind it.  Evolent Health is looking for a Sr. Data Analyst of Payer Data Services to be a key member of the technology leadership team. This individual will play a critical role in executing Evolent Health’s mission by managing data-driven activities related to data profiling, data discovery and analysis, requirements definition, testing and continuous improvement of data collection, mapping, analysis and transformation processes.  We are looking for bright and energetic individuals to be a Data Analyst in our Payor Data Services department. This position involves the programming and analysis of healthcare data with an emphasis on payer data, reporting and data analytics. Position Description:Develop SAS programs to integrate and analyze payer data from multiple sourcesLoad and synthesize healthcare data from multiple sourcesImplement and develop data quality control protocols and monitor their impactDevelop internal reports to track efficiencies and identify process improvement opportunitiesImplement analytic directives from senior staff and clients and develop standard reports as neededAssist in designing, programming and standardizing processes and reportsQualifications:Familiarity with SAS and a desire to expand SAS programming knowledge is a plusMust be analytical, detail oriented, and possess desire to advance and grow personally and professionallyExcellent PC and database skillsAbility to multi-task and manage multiple projects with varying timelinesMust have a passion for data and client serviceBS, BA, or Masters in Public Health, Epidemiology, Statistics, Economics, Computer Science or a comparable program with a quantitative emphasis.Competency in data manipulation and analysis: accessing raw data in varied formats with different methods and analyzing and processing data1+ years of SAS and SQL programming experience, including SAS macros, PROC SQL, and Enterprise GuideEvolent Health is an equal opportunity employer and considers all qualified applicants equally without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin.APPLY"}