{"jobID": "2836054264", "jobLocation": "Washington_DC", "jobTitle": "Supervisory Physical Scientist (Section Chief)", "companyRating": null, "companyInfo": {"Website": "www.justice.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1870", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Duties Help  Help  Duties  Summary TOUGH WORK. VITAL MISSION. Challenge yourself! You have the power to help combat drug trafficking. Be a part of DEA! It's tough work, but a vital mission. Whatever your background or expertise, your work at DEA will be tremendously rewarding because it will have a daily impact on national security and the quality of life of all Americans.Learn more about this agencyResponsibilities This position is located in the Diversion Control Division, Office of Diversion Control Regulatory, UN Reporting & Quota Section, Arlington, VA. The incumbent will perform duties such as:Serve as the agencies representative on drug and chemical control issues to national, international, government, industry and academic groups.Establish and maintain liaisons with state and local authorities and provides scientific and technical guidance and support of their drug and chemical control programs.Serve as a consultant and advisor to high level management and officials within the DEA and to various US and foreign government originations regarding issues related to the domestic and international drug and chemical control program, including domestic regulatory and treaty compliance, pharmaceutical manufacturing and domestic and international regulatory issues .Collaborate and participate with other scientists and researchers in professional organizations in scientific and policy reviews of issues critically important to DEA.Prepare a variety of written documents that include formal analysis and findings to resolve highly complex scientific and drug abuse information, including documents related to the Aggregate Production Quotas and Assessment of Annual Needs, UN statistical reports, and UN resolutions.Develop plans and implement all agency domestic and international drug and chemical control program activities.Establish agency policy and program priorities regarding the scientific aspects of DEA's drug and chemical control programs.Conduct scientific reviews and statistical evaluations, which include collecting data from Department of Health and Human Services (DHHS), industry and other sources to evaluate manufacturing, procurement and import quotas for Schedule I and II controlled substances and three List I chemicals.Evaluate and critically examines the scientific needs of the domestic and international drug control programs and strives to anticipate future needs and improve the current functioning of the office.Serve as the Chief, UN Reporting & Quota Section (DRQ) in the responsibility for internal policy and program development and implementation of the scientific aspects of domestic and international drug and chemical control programs in DEA.Direct all phases of program planning and evaluation, and the allocation of resources in the UN Reporting and Quota Section (DRQ). Travel RequiredOccasional travel - You may be expected to travel for this position. Supervisory statusYes Promotion Potential15 Job family (Series)1301 General Physical Science Requirements Help  Help  Requirements  Conditions of Employment Must be a U.S. CitizenMust be able to obtain and maintain a Background and/or Security ClearanceOpen to DOJ Employees ONLYDrug testing designated positionSuccessful completion of a one-year supervisory probationary period is required (unless already completed). QualificationsBasic Qualification -- Individual Occupational Requirements (IOR)Degree: physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics.ORCombination of education and experience -- education equivalent to one of the majors shown in A above that included at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education. AND Experience Required  GS-15:"}