{"jobID": "2789473334", "jobLocation": "Arlington_TX", "jobTitle": "Sr. Data/Business Analyst - Energy Settlements", "companyRating": "3.8", "companyInfo": {"Website": "www.tenaska.com", "Headquarters": "Omaha, NE", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Tenaska Power Services has an opening for a Data/Business Analyst. The position will report to the Settlements Manager and is expected to collaborate with, and in some cases support, a number of key staff including Energy Managers, Energy Originators, and Accounting staff. This position will have an active role in updating, as well as creating, logic to validate energy settlement charge types across multiple energy markets. Essential Job FunctionsValidates energy settlement charges for multiple customers and across multiple energy marketsResponsible for settlement charge type modeling development and maintenance in TPS’s proprietary software system, creating data points and coding equationsResponsible for creation and maintenance of settlement procedures documentationResponsible for settlement report and dashboard design and development in TPS's proprietary software system and vended visualization software The ideal candidate for this position will have a working knowledge of centrally cleared energy markets and a willingness to learn TPS’s proprietary software system and business processes. He/she must be capable of developing/testing logic using C# light language.Required Skills Bachelor’s degree in a technical discipline; Electrical and Computer Engineering preferred (Five years of related experience for a related power industry company may be substituted for a degree)Previous experience validating and analyzing energy settlement charge types, is a plusObject Oriented Programming knowledge, C# programming, or VBA script is a plusStrong analytical skillsDemonstrated ability to handle multiple tasks simultaneouslyGood oral and written communication skillsTenaska is an equal opportunity employer.Required Experience  Job Location  Arlington, US-TX "}