{"jobID": "2724480755", "jobLocation": "Detroit_MI", "jobTitle": "HR Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.wayne.edu", "Headquarters": "Detroit, MI", "Size": "5001 to 10000 employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": "Posting Details Posting Number 043444 Position Title HR Data Analyst Number of Vacancies 1 School/College/Division/Institutes/Centers 49 - Human Resources Primary Department H4901 - Human Resources, Client Services Essential Functions (Job Duties) JOB PURPOSE The HR Data Analyst provides best in class people data and robust analytical services in support of Wayne State University's strategic and operational goals and objectives. Reporting to the Director, Data & Technology this role aids university stakeholders in predicting outcomes and making informed decisions by providing HR data metrics, data analysis, and predictive modeling. ESSENTIAL FUNCTIONS Design, maintain, and update key HR datasets, reports, and metrics ensuring data integrity; interpret complex organizational needs and integrate into reports and analytics.  Manipulate and analyze enterprise-wide people and other cross-functional data to identify risks and opportunities.  Conduct gap analyses on Human Resource data quality, reports, workflows, and processes; recommend solutions and drive improvements.  Establish, monitor, and implement mechanisms that measure the impact of people and HR programs.  Develop, test and deploy predictive models that identify trends, patterns, and areas of risk and opportunity that aid in projections and forecasting.  Partner with leaders to understand, gather, and deliver people data needs and analyses including standard reporting, workforce planning, and executive level analysis; provide recommendations based on analysis.  Support HR leaders' access to self-service reporting functionality with ad hoc data / reporting needs; escalate issues and risks to leadership.  Translate and communicate insights to key stakeholders through effective storytelling and data visualization including graphical displays, dashboards and presentations.  Perform other duties as assigned. Unique Duties Qualifications MINIMUM QUALIFICATIONS Education: Bachelor's degree  Bachelor's degree in human resource management, business administration, mathematics, computer science or related field or, an equivalent combination of education and/or experience. Experience: Three years' experience in data analysis, preferably in HR or people analytics; experience in predictive analysis and modeling; experience with SPSS, SAS, SAP or similar analytical software and tools; experience with human resource information systems. KNOWLEDGE, SKILLS AND ABILITIES Ability to compile statistical data. Ability to identify, analyze, and resolve problems logically and systematically. Must possess a demonstrated attention to detail.  Excellent oral and written communication skills. Strong interpersonal skills. Ability to effectively present information in one-on-one or small group settings. Excellent customer service skills with the ability to respond and follow-up to customer needs.  Strong organizational and time management skills. Ability to adapt to changing conditions. Preferred Qualifications Testing Requirements Not Applicable Test Scheduling Working Conditions Job Type Full-Time Job Category Professional/Administration & Supervisory/Management"}