{"jobID": "2820585660", "jobLocation": "Agoura_Hills_CA", "jobTitle": "Senior Data Analyst - Accounting", "companyRating": "3.9", "companyInfo": {"Website": "www.americanhomes4rent.com", "Headquarters": "Agoura Hills, CA", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Company - Public (AMH) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "American Homes 4 Rent Get in on the ground floor of a rapidly growing company, unique in the industry. As one of the country’s fastest-growing property management companies of single-family rental homes, American Homes 4 Rent has the youth of an exhilarating and fluid start-up culture and permanency of a well-founded corporation, rich with diversity. As pioneers in the industry, solidified by our place on Wall Street, American Homes 4 Rent (AMH:NYSE) is currently looking for qualified candidates. With a culture of unprecedented growth, quality and innovative collaboration, we are seeking personalities to complement our attributes.  The Senior Data Analyst - Accounting will be an integral member of a fast-paced corporate accounting department with responsibilities that include supporting the monthly / quarterly accounting system processes, creating SQL reports, prepping General Ledger data for use by the external auditors and various ad hoc requests. Responsibilities -Performs monthly and quarterly accounting systems processes such as rebuilding property lists, coordinating and scheduling the G/L rebuilds, performing manual entity roll ups, and additional tasks as required.Performs monthly maintenance procedures such as account creation, investigating and resolving out of balance system issues, and overall maintenance of the systems used in the Accounting Department. This includes advising staff performing the manual monthly system consolidation process.Create customized SQL reports for the Accounting Department end users as required.Extracts and formats data from the general ledger to accommodate requests from external auditors.Ad Hoc requests such as creating Excel templates using macros, creating dashboards using Excel VBA, data mining for accounting entries, and other tasks as required.Perform the project management function for accounting system and automation projects as required.Acquire a working knowledge of certain accounting processes in order to provide recommendations for improvements and data warehouse design input/solutions.Follows all organizational systems, programs, training, policies, and procedures as required and complies with relevant legal mandates. Seeks guidance as necessary.Actively supports and participates in the safety program, both for self-protection and the protection of other employees, by reading and abiding by all requirements in the Injury and Illness Prevention Program (I2P2).Carries out all responsibilities in an honest, ethical and professional manner.Handles various other duties as delegated by direct supervisor/management. Required SkillsRequirements -Bachelor’s Degree in Finance, Accounting or related field required3+ years of experience in data analytics requiredWorking knowledge of SQLWorking knowledge of Excel VBAMS Access knowledge requiredExperience with Excel macrosExperience with Yardi a plusProject management experience a plusExperience working in the real estate industry a plusExperience working in an accounting department preferredWork where you feel right at home – If you are a versatile professional who values culture, a concerted environment and the potential for exponential growth, we want to work with you! Apply now and someone from our Talent Acquisition team will reach out to you soon! Related Keywords - Analyst, SQL, Finance, Accounting, Analytics, Excel, Ad Hoc, Data Scientist, Business Intelligence, Metrics, SAS, Statistics, JavascriptRequired Experience  Job Location  Agoura Hills, US-CA "}