{"jobID": "2704979550", "jobLocation": "Pasadena_CA", "jobTitle": "Data Consultant -SAS Programming", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "86000", "jobDescription": " null Basic Qualifications: Experience  N/A. Education Bachelor of Arts degree in economics, finance, health care administration, public health administration, statistics, mathematics, operations research, or four (4) years of experience in a directly related field required.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A. Additional Requirements: Experience with analytical manipulation and interpretation of large databases required.  Broad familiarity with medical practices, especially population management and process and outcomes measurement preferred.  Knowledge of JCL strongly preferred. Microsoft Office skills preferred.  Very strong analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team.  Ability to express complex analytical and technical information to senior management or to audiences with clinical training.  Must be an independent self-starter.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Minimum three (3) years programming in SAS, R, SQL, Python or equivalent preferred.  Minimum three (3) years of related analytical consulting experience, healthcare experience preferred.  Experience with SQL, macros, AF, and SASGRAPH, PROC Report and statistical procedures in SAS preferred.  Project management experience strongly preferred.  Experience with MVS/TSO operating systems preferred.  Master's degree preferred.  Experience with KP HealthConnect, specifically Clarity.  Experience with Common Provider Master (CPM).  Experience with provider demographic data. "}