{"jobID": "2746766221", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "110000", "jobDescription": "Description: This Lockheed Martin (LM) position is part of the Space Systems Company (SSC) Chief Information Office (CIO) organization. The position reports to the Director of Information Technology Applications. The selected candidate will function as a practicing Data Scientist for advanced analytics techniques in support of Lockheed Martin Space System Companys programs and functions.  Develops long-range objectives and strategic plans for corporation or major division by identifying internal and external strategic issues that could affect growth and profitability.  Scans environment for business opportunities, maintains surveillance over market, and may perform financial analysis of acquisition candidates. Develops and monitors profitability, productivity, and growth targets. May prepare acquisition proposals, recommend financial and non-financial strategic objectives and alternatives, and implement and maintain strategic and operational plans.  Plans and coordinates business reviews, resource allocations, organization structures, and financial analysis.  Collaborate with our team to define project objectives, set key performance metrics, and establish project approach  Perform competitive analysis and identify gaps and opportunities in the marketplace  Demonstrate domain knowledge and expertise in a range of skills, such as business model development, financial modeling, product portfolio planning, organizational strategy, channel and go-to-market models, customer / market research etc.  Exhibits an exceptional degree of ingenuity, creativity, and resourcefulness. Applies and/or develops highly advanced technical technologies, scientific principles, theories and concepts. Exhibits an exceptional degree of ingenuity, creativity, and resourcefulness. Applies and/or develops highly advanced technical technologies, scientific principles, theories and concepts  The responsibilities of this position include collaboration with business stakeholders to identify business opportunities and requirements to develop associated analytical models that deliver useful, actionable insights, or recommendations. Responsible for modeling complex business problems, discovering insights and identifying opportunities through the use of statistical, algorithmic, mining and visualization techniques.  The candidate will need a combination of business focus, creative thinking, strong analytical and problem solving skills and programming knowledge to be able to quickly cycle hypothesis through the discovery phase of the project. Excellent written and communications skills to report back the findings in a clear, structured manner are required. WORK LOCATION FOR THIS POSITION IS AT A US BASED LOCKHEED MARTIN FACILITY IN DEER CREEK CANYON, CO AND/OR SUNNYVALE, CA.Desired Skills: Bachelors degree in an engineering/technical discipline from an accredited college in a related discipline, or equivalent experience/combined education, with 20 years or more of professional experience  18 years of professional experience with a related Masters, or 15 years with a related PhD degree. Experience in applied machine learningExperience in Business modelling translating strategies into tangible business objectivesExperience in natural language processing (NLP)Experience with SAP HANA, Hadoop (including Hive/Impala, Spark, or Mahout) and other tools that facilitate the consumption, storage, and analysis of Big DataDomain knowledge of Aerospace & Defense industryKnowledge of ERP Systems, Applications and Processes and data constructs, as it applies to Supply Chain Management, Production Operations, Global Sustainment, and FinanceExperience designing efficient algorithms with programming languages and tools, such as Python, R, MATLAB, SAS, or Scala for data manipulation and statistical analysis.Experience designing efficient Data mining and text mining frameworks with related tools (e.g. Mahout, Weka, UIMA, GATE)Project Management experience planning and monitoring analytics projects using Agile/Scrum principlesDemonstrated business and technical communication skills, including the communication of findings and their relevance in business termsAbility to build strong relationships with stakeholders, customers, colleagues and suppliers and to communicate complex quantitative analysis in a clear, precise and actionable manner Ability to obtain secret clearance BASIC QUALIFICATIONS: Minimum of 10 years of demonstrated expertise in the following: Computer science and statistics; Strong working knowledge of basic and Bayesian statistical concepts such as correlation, linear regression, optimization, and how they can be applied.Building predictive models, such as generalized linear, decision tree, and neural network modelsPerforming model selection and evaluation using criteria such as Root Mean Square Error, Receiver Operator Characteristics or Lift testsBusiness fundamentals and the ability to relate them to business processesDesigning efficient algorithms with statistical programming environments (in particular R)Using flexible analytical approaches that allow for results at varying levels of precisionProficiency with SQLIntegration and cleansing of disparate or incomplete data sets to deliver insightManipulating and analyzing complex, high-volume, high-dimensionality data from varying sources combined with empirical research and finding answers to hard questions with data and data modelsEffective use of front end reporting and visualization tools that allow for findings to be effectively communicated to and applied by the businessLockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. As a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  Join us at Lockheed Martin, where were engineering a better tomorrow."}