{"jobID": "2831409182", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist - Senior", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description:JOB SUMMARY:  Employer has an opening for a senior data scientist with a background in modeling and simulation, to work at a government site in Reston, VA. The primary focus of the group is understanding WMD-related facilities and interoperability of systems. Candidate must bring a creative, yet sound, approach to identifying and solving challenges with these interrelated systems in a customer setting, and have exceptional attention to detail and a commitment to thoroughness. The successful candidate will work as a member of an interdisciplinary team of government and contractor personnel conducting Weapons of Mass Destruction Analysis. Work will be performed in a fast-paced, high-energy environment within a government facility.  The senior data scientist shall work with operational stakeholders system developers to define and execute modeling and simulation experiments. This includes defining analytic questions, creating hypothesis and associated test plans, specifying software requirements, testing software results, and writing modeling and simulation validation and verification plans in an experimental space with sparse data. The candidate will have experience developing test plans to verify models against experimental data.  An ideal candidate will have a broad array of technical and analytic skills. They should have experience defining analytic problems for real world scenarios. They should be able to work across disciplines to create a vision of how problems are defined and solved using M&S; practices. They should possess advanced writing skills sufficient to be published in academic conferences or journals. The candidate possesses an active TS/SCI and will be required to submit for a CI polygraph.  PRIMARY RESPONSIBILITIES: The employee will be responsible for identifying and solving challenges with facility systems and subsystems in a customer settingThe employee will determine requirements for sufficient model development and delineate the trade-offsThe employee will also assess existing community modeling capabilities (to include IC specific analytical/programming tools) to better understand software framework optimization, multi-tool integration, and potential limitationsThe employee will also apply cumulative system analysis to characterize stochastic and deterministic process models as it applies to SME analysisThe employee will provide general modeling and simulation support, as well as support to development, execution and analysis/hotwash of exercise results.Qualifications:Education and Experience: Requires BS degree and 12 - 15 years of prior relevant experience or Masters with 10 - 13 years of prior relevant experience. May possess a Doctorate in technical domain. BASIC QUALIFICATIONS: Masters degree in mathematics, computer science or related field from an accredited college or university, or equivalent experience.Experience with a variety of tools and programs (MatLab, Maple, Python, )Candidate must currently possess a TS/SCI Clearance and be willing to submit to a CI polygraph.Excellent written and verbal communication skills with the ability to successfully brief and interact with Senior Officials.Ability to work in a fast-paced, high-energy environment.Defense or Intelligence Community-related experience and an understanding of operational planning is strongly desired. ADDITIONAL QUALIFICATIONS: PhD and 5-8+ years working on government siteExperience in developing, conducting and analyzing results from tabletop exercises with a variety of participantsFamiliarity with agent-based programmingExperience with AnyLogic, RePast or other modeling and simulation software packagesExperience developing metrics of effectiveness for infrastructure, facilities and networksEmployer Overview: Employer is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Employer reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Employer with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Employer.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Employer will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Employer is an Equal Opportunity Employer."}