{"jobID": "2802112135", "jobLocation": "Dallas_TX", "jobTitle": "Sr Big Data consultant-Dallas,TX with IntelliSoft Technologi", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Dallas Interviews but with IntelliSoft Technologies  Dallas Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description*******************Urgent need************* Direct client req  Location: Addison,TX  We have 3 positions with our client. We are looking for candidates with minimum 11+ years exp, Preferably local to Dallas,TX  Enterprise/Big Data Architect  Sr. Enterprise/Big Data Infrastructure Engineer  Sr. Enterprise/Big Data Engineer JD Enterprise/Big Data Architect Summary/Focus  ● Data (structure) design and governance Description  ● Responsible for the structure and usefulness of the company's data. Required by any organisation that wants to build a big data environment on premises or in the cloud. This position is the link between the needs of the organization and the big data scientists and the big data engineers. Responsibilities  ● Data governance and administration  ● Design data structures, relationships, transformations and optimizations  ● Benchmark systems, analyse system bottlenecks and propose solutions to eliminate them  ● Articulate pros and cons of various technologies and platforms  ● Document use cases, solutions and recommendations  ● Help product/project managers in the design, planning and governance of implementing data projects  ● Perform detailed analysis of business problems and technical environments and use this in designing the solution Technical Skills  ● Big Data, Enterprise Data, Distributed Data  ● Data structures and relationships  ● Data API's  ● Data transformation and optimization  ● Relational and nonrelational databases  ● Distributed platforms, Cloud, Desktop, Mobile, Web  ● Data security/privacy, including PCI  ● Data flows, transfers, imports and exports  ● Data warehouses, data lakes, data marts and conformed dimensions  ● Big Data frameworks (Hadoop, MapReduce, Hive, HBase, MongoDB, Cassandra, Impala, Oozie, Mahout, Flume, ZooKeeper, Sqoop)  ● Major programing/scripting languages (Java, Linux, PHP, Ruby, Python, R)  ● ETL/ELT tools (Informatica, Talend, Pentaho, ODI)  ● Could Platforms (AWS/EMR etc.)  ● Solutions for handling medium to large data sets Other Skills  ● Excellent leadership, management and team skills  ● Excellent written and verbal communication skills  ● Both creative and analytic approaches in a problem-solving environment Experience and Education  ● 10-15 years of work experience  ● 7+ years work experience as a data architect with enterprise/big data  ● 5+ years work experience as team lead/manager  ● Bachelors or Masters in Computer Science or Software Engineering  ● This role includes leadership skills in order to provide leadership for the Data Services Team. ● This role is typically occupied by a person with over 12 years of experience  Regards  Priya  Intellisoft Technologies Inc.,  1320 Greenway Drive STE 460 Irving TX 75038  Office:469-394-4947 | Fax: 972 753 7856  priya@intellisofttech.com | www.intellisofttech.com  (A DFWMSDC,NCTRA Minority and Texas HUB certified Firm)  Oracle Gold Partner Intel Software PartnerCompany DescriptionIntellisoft is providing software consulting, technical staffing and team augmentation services to Fortune 100 direct clients in USA, CANADA and INDIA.  With operations in USA and INDIA Intellisoft is currently engaged with leading technology, networking, telecommunication, companies to provide software consulting, team augmentation and key business process outsourcing services.  Please visit our website www.intellisofttech.com for more information on us and our clients.  Apply"}