{"jobID": "2823503113", "jobLocation": "Detroit_MI", "jobTitle": "Digital Marketing Account Manager I", "companyRating": "2.6", "companyInfo": {"Website": "www.cdkglobal.com", "Headquarters": "Hoffman Estates, IL", "Size": "5001 to 10000 employees", "Founded": " 2014", "Type": " Company - Public (CDK) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Reynolds and Reynolds, Cox Automotive, Dealer.com"}, "estimatedSalary": "59000", "jobDescription": "Accelerate Your CareerDrive global technology    With more than $2 billion in revenues, CDK Global is a leading global provider of integrated information technology and digital marketing solutions to the automotive retail and adjacent industries. Focused on enabling end-to-end automotive commerce, CDK provides solutions to dealers in more than 100 countries around the world, serving approximately 28,000 retail locations and most automotive manufacturers. CDK Global solutions automate and integrate critical processes from pre-sale targeted advertising to the sale, financing, insurance, parts supply, repair and maintenance of vehicles, with an increasing focus on utilizing data analytics and predictive intelligence.     We’re large enough to make a difference but small enough for your voice to be heard. This means that we are an organization where every person matters. You can make an impact on the success of our business and that of our customers regardless of what career you decide to pursue.     From data scientists to sales and client service experts, we’re hiring to support your growth and ours - Green light your career. Digital Marketing Account Manager    As the Account Manager, you will provide account and relationship management support to our Automotive Manufacturer (OEM) customers on a day to day basis. In addition, you will be the liaison between our OEM customer and internal personal to ensure successful delivery on the OEM programs and projects.     This position will work on site at our client location in the Detroit, MI area.    Job Responsibilities:Typical account assignment: Medium to large existing or strategic OEM accountsProvides day to day account management and support to assigned OEM accounts. Including but not limited to:IPD generationStatement of work generationProposal generationCoordination and management of projectsBilling and other general questions / resolutionsCoordination and management of program initiativesEscalation point for corporate, regional and dealer issues / resolutionsActs as the liaison between the OEM customer and internal personal to ensure successful delivery on OEM programs, initiatives and professional service projects.Acts as the internal Subject Matter Expert on assigned accounts for internal departments and provides direction and insight proactively and reactively.Meets with the client to understand their business goals and challenges and educates and provides overview and understanding of our solutions.Provides reporting and visibility of account activity, professional service projects/revenue and account insights to management and internal key stakeholders. Escalates appropriately within our organization to gain assistance with issue resolution.Assists in development and execution of sales and marketing account plan for assigned accounts to meet or exceed revenue targets and growth.Maintain and build relationships with multiple contacts at all levels within assigned accounts.Regularly communicate and meet with customers to ensure the highest level of customer satisfaction.Provides assistance and introductions for Director, Enterprise Accounts Digital within the account for business development opportunities.   Experience Required:Bachelor’s Degree, Business or Marketing.5-8 years client/account management experience.Working knowledge of digital advertising.Fundamental understanding of the auto industry preferred.Excellent planning and organizational skills to manage the customer and internal departments and resources to a successful outcome.Ability to build rapport and manage customer relations effectively.    CDK Global knows you have passions outside of work. You have family, friends, sporting events, and lots of things going on. That’s why we offer a comprehensive benefits package to not only take care of you but your family as well. All of our benefits are effective the first day of employment including 401K matching, paid time off to re-energize, donate your time to volunteer in your community, and tuition reimbursement to name a few.  At CDK, we pride ourselves on having a diverse workforce. We value and celebrate the uniqueness of individuals and the different perspectives they provide. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status."}