{"jobID": "2826754781", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Licensed Practical Nurse - LPN SIGN ON BONUS AVAILABLE", "companyRating": "2.9", "companyInfo": {"Website": "www.hcr-manorcare.com", "Headquarters": "Toledo, OH", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kindred Healthcare, Genesis HealthCare, Sava Senior Care"}, "estimatedSalary": "20", "jobDescription": " HCR ManorCare provides a range of services, including skilled nursing care, assisted living, post-acute medical and rehabilitation care, hospice care, home health care and rehabilitation therapy.  The Licensed Practical Nurse - LPN is responsible for supervising nursing personnel to deliver nursing care and within scope of practice coordinates care delivery, which will ensure that patient s needs are met in accordance with professional standards of practice through physician orders, center policies and procedures, and federal, state and local guidelines. This LPN position is a staff position that has direct care responsibilities as well as supervisor responsibility for nursing assistants. We are looking for clinicians who would like to combine their love for people and strong work ethic with the opportunities to advance your career.  In return for your expertise, you'll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.4205 - Heartland Health Care Center - Grand Rapids, MichiganOne year prior nursing experience preferred.Job Specific Details:  Be a Part of a 5 Star Facility!  Heartland of Grand Rapids is seeking experienced RN/LPN Supervisors!  Competitive compensation, benefits, 401K, paid uniforms and an award winning culture!  Ask me about a Sign-On Bonus and Differential Pay!  Please apply on line or else call the building for more information at 616-949-3000"}