{"jobID": "2828544054", "jobLocation": "San_Antonio_TX", "jobTitle": "TTI Assistant Research Scientist/Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.tamuct.edu", "Headquarters": "Killeen, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": " TTI Assistant Research Scientist/EngineerA&M; System Member : Texas A&M; Transportation InstituteDepartment : Research & Implementation - San AntonioJob Category : Other or Not SpecifiedJob Type : StaffLocation : San AntonioProposed Minimum Salary : CommensurateJob Requisition Number : R-007474Security Sensitive? : YesJob TitleTTI Assistant Research Scientist/EngineerAgencyTexas A&M; Transportation InstituteDepartmentResearch & Implementation - San AntonioProposed Minimum SalaryCommensurateJob LocationSan Antonio, TexasJob TypeStaffJob Description The Texas A&M; Transportation Institute (TTI), Research and Implementation Division seeks to hire an Assistant Research Scientist for the San Antonio office. The Research and Implementation Office in San Antonio has partnered with Texas Department of Transportation (TxDOT) Districts and local agencies in south Texas region since 1993. The SA RIO performs practical research in the traffic engineering, traffic operations, safety and emergency preparedness areas and assists local agencies and organizations link research findings to implementation practices through the transfer of technology.  The general purpose of this position is to conduct research and actively contribute to extramurally funded research projects in addition to authoring scholarly publications, performing work on basic and applied technology transfer problems, and participating in research proposals. The position spans the traditional areas of transportation planning, project development, design, operations, and maintenance. The general focus of this position is asset management, project development and delivery, utility engineering and coordination, right-of-way acquisition, and transportation operations, including traffic engineering and Intelligent Transportation Systems. The position is expected to develop and research the effectiveness of innovative solutions to traditional and emerging transportation issues in any of these focus areas. Incumbent in this title will be eligible to serve as a Principal Investigator (PI); manage and supervise the work of others; and expected to pursue and develop externally funded research.  Continued employment is dependent upon availability of funding and satisfactory performance. Essential Duties:Develop and research the effectiveness of innovative solutions to traditional and emerging transportation issues.Proposal preparation.Experimental design.Data collection.Data analysis.Report preparation.Research presentations.Other non-essential duties deemed necessary. Position Requirements: Required Qualifications:Masters Degree in Civil Engineering, Transportation or related field.3 years of full-time relevant transportation research experience.2-5 publications (published and/or accepted for publication) in major peer- reviewed journals.Demonstrated experience in developing research proposals and securing contracts and grants.Strong verbal, technical writing, and interpersonal communication skills.Preferred Qualifications:Doctorate in Civil Engineering or related field.Work experience in transportation project development and design.Utility coordination and relocation and right-of-way acquisition.Asset management, transportation operations and/or maintenance.Data modeling, database design, SQL, CAD, and GIS.Good understanding of software tools such as VB, VB.NET, C#, ASP, or ASP.NET.Good understandingof the transportation legislative framework in the United States.Engineer in Training (EIT) certification. All positions are security-sensitive. Applicants are subject to a criminal history investigation, and employment is contingent upon the institution’s verification of credentials and/or other information required by the institution’s procedures, including the completion of the criminal history check.  Equal Opportunity/Affirmative Action/Veterans/Disability Employer committed to diversity."}