{"jobID": "2677987837", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Business Operations Manager", "companyRating": "4.4", "companyInfo": {"Website": "www.zendesk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZEN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Freshdesk, RightNow Technologies"}, "estimatedSalary": "144000", "jobDescription": "Zendesk is seeking an experienced Senior Business Operations Manager to support our Go-To-Market organizations. GTM comprises of Marketing, Sales and Customer Experience (Success, Advocacy, Services). This role reports to the Director of Business Operations, in the COO organization.The COO org at Zendesk is focused on working closely with Zendesks leadership team to ensure the companys strategic goals, strategies, and priorities are correctly translated and operationalized across the company. The business operations team supports leaders and helps accelerate key projects in our go-to-market functions.The ideal candidate is a highly organized, influential, and data-savvy strategy and operations generalist. Youll have diverse skill sets that spans business operations, process design & improvement, data/analytics, and program management. Intellectual curiosity, comfort with ambiguity and a willingness to learn are essential to success in this role. You will work in a fast-paced and dynamic environment, and know how to navigate a global and matrixed org to get things done, connect the dots to better equip others in their work, and lean in where additional support is needed. You take a positive, influential and motivational approach to working across all levels, from individual contributors to VPs and C-level in supporting the GTM org achieve their goals. You are a highly resourceful individual with strong emotional intelligence, self-motivation, attention to detail and proven analytical abilities.A day in the life ranges from presentations / discussions with key cross-functional stakeholders on a mission critical project; to designing or optimizing core processes that enable us scale, to influencing change and adoption of new structures across a global team.What you'll do Design and build business/customer-facing or internal processes to streamline and optimize the most critical work done by the GTM organization.Work with teams on areas requiring significant change management and do so in a way that minimizes disruption. A good metaphor is flying a plane and changing its engine.Apply structure across people, process and tools, to ambiguous and complex problems in different areas of our business.Partner with GTM Strategy, GTM Operations, Program Management and Technology teams and various business teams to improve cross-functional work processes and ensure alignment and execution on strategic objectives.Communicate recommendations, solutions and change to a variety of audiences across functions and levels in the org ensuring the right level of detail is given to the right audience.Assess business needs using critical thinking to reduce gaps and overlaps across process, tools and people as we scale quickly. What you'll need 8+ years of work experience in SaaS or technology companyPrior business operations, management consulting or product management experience3-5 years of experience managing teams in a dynamic, cross-functional environment, preferably B2B software companiesCommunication Skills: Exceptional listening, oral and written communication skills as well as presentation skills. The ability to multitask effectively.Collaboration Skills: Strong teaming skills and experience to bring together diverse views.Results Oriented: A track record of consistently delivering excellent results, even in the face of changing environment. Regarded as a strong performer, strong attention to detail and solid leadership skills.Analytical Skills: Deep analytical skills and ability to identify patterns, process information quickly and make decisions in a timely manner. Proficiency in data visualization with tools such as Tableau, Domo, BIME etc.Flexible/Adaptable: Have a strong sense of self and can relate well to others; learns quickly and can adapt to changes in timeframes, people and situations with ease. The ability to remain calm under pressure.Team leader: Solid people manager who derives fulfillment in growing others.BA/BS in business or technical degree required, MBA/MSc preferred.The best customer experiences are built with Zendesk. Zendesks powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesks use of your personal information."}