{"jobID": "2809690850", "jobLocation": "Northbrook_IL", "jobTitle": "Data Analyst Resource I", "companyRating": "4.1", "companyInfo": {"Website": "www.planet-pharma.com", "Headquarters": "Western Springs, IL", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Contract", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": " Data Analyst  The successful candidate must have direct relevant experience working with Success Factors Employee Central customers and/or systems integrators on IT systems and platforms. The Business analyst will be tasked with data conversion activities from SAP HCM and other systems to Employee Central. The BA should have understanding on SDLC processes. The BA should have hands on experience implementing Saas solution functionality and can act as a knowledgeable liaison between technical teams, testing teams and business stakeholders during the implementation phase. The Business Consultant is expected to provide quality deliverables on time and within budget. The BA should have prior conversion experience and must be very skilled in data work activities. Primary Duties and Responsibilities:SuccessFactors Employee Central Conversion SupportData conversion / migration experience in SAP environmentsData conversion experience with SAP Successfactors HCM (PA, OM, BEN, PY)Assists client in developing the transformation mapping from their legacy system to SuccessFactorsFacilitates the data loads into environments and assists with data validationExcellent excel skillsUnderstanding SAP HR / SuccessFactors data structuresWill need to have an understanding of client data protection rulesWorks with stakeholders to understand, assign business value to, prioritize, and document functional and technical requirements.Perform fit/gap analysis and work with solution architectSupport user experience designCreates and analyzes other documentation including but not limited to proposed release schedules, requirements traceability matrices, release notes, training scenarios, and test cases.Advocates for customer requested fixes and enhancementsIdentify process improvements and guide customer in functional and business changesActs as a functionality expert for applicationsBe involved in user acceptance test planning.Provides support to complete application testing of changes and new features.Maintain accurate and timely written and oral communication with client and project teamTrack development progress and drive projects through to completionDeliver quality project tasks and deliverables on time and within budget Type:Temp/ContractLocation:Northbrook, ILSDL2017"}