{"jobID": "2835297532", "jobLocation": "Houghton_MI", "jobTitle": "Assistant Research Engineer/Scientist", "companyRating": null, "companyInfo": {"Website": "www.mtu.edu", "Headquarters": "Houghton, MI", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Position Information Position Title Assistant Research Engineer/ScientistDepartment Chemical EngineeringLocation Main Campus (Houghton, MI)Position Type StaffFull-time/ Part-time Full-timeFull-Time Equivalent (1.0=100%) 1.0Appointment Term 12 MonthPay Type Salary BasisSalary or Hourly Rate No Less Than $35,000ShiftPosition Duration Dependent on External Funding? YesTitle of Position Supervisor Assistant Professor Position Summary InformationTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Job Description SummaryConduct routine experiments; operate and maintain laboratory and analytical equipment (ion chromatograph, HPLC, etc.); gather, record, and interpret research data; order and manage laboratory inventory.Essential Duties & Responsibilities (other duties may be assigned)1. Conduct routine laboratory experiments, operating necessary laboratory equipment, following and assisting in the development of written protocols. Acquire and maintain laboratory equipment, supplies and chemicals.Provide laboratory support to faculty and students on the proper operation of experiments.Oversee safe laboratory practices and comply with all applicable University, federal, state, and local safety and environmental regulations.Perform written assessment of supervised activities.Work occasional non-standard hours as required.Commit to learning about continuous improvement strategies and applying them to everyday work. Actively engage in University continuous improvement initiatives.  SUPERVISORY RESPONSIBILITIES: Supervision may be exercised over undergraduate student assistants.Required Education (minimum requirements)• Associate’s degree in engineering, science, or technology-related field, or a comparable level of practical work experience in a related field.Required Experience (minimum requirements)• Demonstrated broad-based experience with computers, including lab data acquisition software.Desirable Education and/or Experience• Bachelor’s degree in a science, technology or engineering-related field or a comparable level of practical work experience in a related field."}