{"jobID": "2826856577", "jobLocation": "Woodcliff_Lake_NJ", "jobTitle": "Medical Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.chooseatlas.com", "Headquarters": "Berkeley Heights, NJ", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": " Reference # : 18-00699 Title : Medical Data Scientist Location : Woodcliff lake, NJ Position Type : Contract Experience Level : Start Date / End Date : 07/23/2018 / 07/22/2019 DescriptionDescription: MEDICAL DATA SCIENTIST Under the supervision and guidance of a manager, candidate should be able to perform first pass coding using a standard medical dictionary (MedDRA, WHODD); Generate queries related to clarity of reported terms ; Perform coding listings review and provide feedback. Review of protocol and CRF in relation to coding and evaluation of safety data. Logical thinking in grouping of MedDRA terms and medications for use in data analysis. (80%)  Apply clinical/medical background to review medical conditions; perform reconciliation between clinical database and CIOMS/MedWatch or safety related reports; review patient profiles and identify inconsistencies, or missing data. (20%)  Performs all duties according to company policy and regulations and guidance. Performs other duties assigned by the head of Clinical Coding & Safety Data Review or its manager. No travel required.  Quantitative analysis ? Performs a comprehensive review for the all the reported and coded terms. To assure the presence of all coding targets not limited to LLT, PT and SOC and Trade name , Preferred Name ATC 2 and ATC 4 and their respective dictionary versions. Generate coding queries and queries related to any safety data review.  Qualitative analysis ? Evaluates coding consistency and adequacy. Ensures that the selected codes accurately reflect the term as provided by the investigator. Reviews the codes for ICH compliance and adherence to coding guidelines and conventions. Ensures to write a quality and comprehensive narratives. QUALIFICATIONS: Medical Degree, Physician-Assistant or PharmD or graduate of adequate health care related course with commensurate experience in use of dictionaries in Clinical trial setting. 5-8 years' experience. Educational background in medical field with strong understanding of pathophysiology of diseases.Strong knowledge of medical terminology, ability to apply to clinical coding using standard medical dictionaryKnowledge of Central coding or any coding tool system a plus, if not will trainExperience with INFORM is a plus, otherwise ability to use/learn complex computer systemKnowledge of Oncology Clinical trial Study is a plus, or ability to learn and apply experience in the area of clinical researchnarrative writing skills a plusComputer proficiency and Expertise on use of Excel and wordStrong oral and written communication skillsSelf-motivated, pro-active, organized and quick learnerAble to work with minimum supervision and work independently"}