{"jobID": "2837804380", "jobLocation": "Arlington_VA", "jobTitle": "Senior Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.ecs-federal.com", "Headquarters": "Fairfax, VA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CSC, CGI (Nevada), ActioNet"}, "estimatedSalary": "123000", "jobDescription": " Job Description: ECS seeks a motivated scientist or engineer with knowledge or background experience in nuclear remediation, mitigation, detection, and/or effects. We are particularly interested in individuals who have knowledge of nuclear radiation in the context of a space environment. The candidate selected for this position will serve as a SETA at DARPA, with the responsibility of providing technical and programmatic support to a DARPA Program Manager. This is an existing contract, support pending PM approval Support a Government PM in all technical aspects providing full life-cycle Scientific, Engineering and Technical Assistance (SETA) support to DARPA. Identify and maintain relationships with R&D; performers and transition partners Survey and summarize relevant government, academic, and contracted research Required Skills: Advanced Degree preferred (Physics or related field) Active Secret clearance Experience providing or skills sufficient for technical support encompassing the following areas: Nuclear radiation remediation, detection, effects mitigation, and incident preparation in a space environment Understanding and modeling the physical evolution of a coupled space environment (magnetosphere, thermosphere, and particularly the ionosphere) following a natural or man-made extreme perturbation.  Understanding predictive models and simulations of nuclear radiation intensity and duration; and the effects and evolution of radiation in atmospheric and upper or lower earth orbit environments Examining or analyzing data produced experimentally or from models and simulations Carrying out concentrated technical background research to support program goals and objectives Providing technical oversight of research carried out by teams of scientists and engineers and assisting a PM with managing S&T; programs Program management ability to support the following: Preparing technical presentations and review documents Defining performance metrics, specifications, and cost objectives Support source selection and evaluation boards; develop reports, briefings, program and contract documents; and analyze programmatic documents to ensure contractual technical, cost, and schedule objectives Collaborating, interacting with, and engaging personnel at universities, UARCs, FFRDC, and other government agencies and departments Strong oral and written communication skills Advanced degree or Bachelors degree with relevant experience in Physics or related technical discipline Ability to work as part of a team as well as independently to achieve program objectives Desired Skills: Previous experience supporting DoD or IC agency client(s), with previous DARPA, IARPA, or DHS S&T; program management experience is preferred Previous experience with NOAA, NASA, or related agencies and institutions Ability to self-motivate and handle a fast-paced work environment Strong organizational, quantitative, and analytical skills ECS is an equal opportunity employer and does not discriminate or allow discrimination on the basis of race, color, religion, gender, age, national origin, citizenship, disability, veteran status or any other classification protected by federal, state, or local law. ECS promotes affirmative action for minorities, women, disabled persons, and veterans. ECS is a leading mid-sized provider of technology services to the United States Federal Government. We are focused on people, values and purpose. Every day, our 2300+ employees focus on providing their technical talent to support the Federal Agencies and Departments of the US Government to serve, protect and defend the American People."}