{"jobID": "2726225243", "jobLocation": "The_Woodlands_TX", "jobTitle": "Clinical Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.mckesson.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1833", "Type": " Company - Public (MCK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cardinal Health, AmerisourceBergen, UnitedHealth Group"}, "estimatedSalary": "85000", "jobDescription": "McKesson is in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. At McKesson Specialty Health, our products and services span the full continuum of specialty patient care. From the initial phases of a product life cycle and the distribution of specialty drugs, to fully integrated healthcare technology systems, practice management support, and ultimately to patient care in the communities where they live, we empower the community patient care delivery system by helping community practices advance the science, technology and quality of care.We have a vision —that the long-term vibrancy of community care will be achieved through the leadership of physicians committed to clinical excellence and innovation, enabled by close collaboration with our organization and our deep clinical, operational and technological expertise.Every single McKesson employee contributes to our mission—by joining McKesson Specialty Health you act as a catalyst in a chain of events that helps millions of people all over the globe. You’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.Join our team of leaders to begin a rewarding career.Current NeedCurrent NeedUnder general supervision, supports healthcare data initiatives by providing accurate and timely data analysis and data manipulation, quality assurance and ongoing system and process maintenance. Responsible for obtaining raw data and producing mock up and production reports from available sources. Validates data and performs analysis as needed. Supports and adheres to the MSH Compliance Program, to include the Code of Ethics and Business Standards.Position Description• Obtains and analyzes raw data from multiple sources to perform core job duties and to answer questions posed by internal or external customers.• Formats output of data analysis for customer readiness.• Provides quality assurance on all reporting and data extracts.• Responsible for keeping various database system maintenance and mappings up to date as well as various internal and external documentation. • Handles the reconciliation and analysis of internal and external data related issues.• Works with the data warehouse teams to insure data sets and reports are built to specifications.• Audits database contents for accuracy and validity.• Interacts with customers to clarify needs and in reviewing results.• Facilitates and participates in peer review meetings for each of the deliverables.• Obtains proper approvals on each of the deliverables. • Advises on the development of informatics, data gathering techniques, and data reduction to decrease bias and/or errors in data gathering and analysis.• Other duties as requested or assigned.• Provides overall quality assurance oversight from requirements through post-release• Ability to formulate and implement effective data strategies, and identify areas for significant efficiency gain through automationMinimum Requirements 2 years experience in programming on enterprise or department servers or systemsCritical Skills3 years of experience in programming on enterprise or department servers or systemsMinimum two (2) years of work experience in clinical data analysis and/or supporting healthcare information systems. Experience in mining Claims and EMR data, preferably Oncology related dataAdvanced SQL, MS Excel-Macros, MS Access or other Relation Database understanding is required.Statistical analysis program experience, including SPSS or SAS requiredKnowledge of programming tools like R and visualization tools like Tableau is preferredAdditional Knowledge & SkillsIn-depth knowledge of software, documentation, utilities & program scripts, & excellent written & verbal communication skills -In-depth knowledge of technical system design -In-depth knowledge of relevant external/internal regulations & compliance requirements• Oncology data experience preferred.Education4-year degree in computer science or related field or equivalent experienceBachelors/Master’s degree in Healthcare, Public Health, Statistics, Research Methods, or related fields preferredPhysical Requirements General Office DemandsBenefits & Company StatementMcKesson believes superior performance – individual and team – that helps us drive innovations and solutions to promote better health should be recognized and rewarded. We provide a competitive compensation program to attract, retain and motivate a high-performance workforce, and it’s flexible enough to meet the different needs of our diverse employee population.We are in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. We partner with payers, hospitals, physician offices, pharmacies, pharmaceutical companies and others across the spectrum of care to build healthier organizations that deliver better care to patients in every setting.But we can’t do it without you. Every single McKesson employee contributes to our mission—whatever your title, whatever your role, you act as a catalyst in a chain of events that helps millions of people all over the globe. Talented, compassionate people are the future of our company—and of healthcare. At McKesson, you’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.McKesson is an equal opportunity and affirmative action employer – minorities/females/veterans/persons with disabilities.Qualified applicants will not be disqualified from consideration for employment based upon criminal history.Agency StatementNo agencies please."}