{"jobID": "2801911928", "jobLocation": "Holland_MI", "jobTitle": "Lead Electrician", "companyRating": "3.9", "companyInfo": {"Website": "www.jrauto.com", "Headquarters": "Holland, MI", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "21", "jobDescription": "Department: Controls Technician - Electrician Job Status: Full Time Reports To: Electrical Manager  JR Automation was founded in 1980, and has grown to become one of the leading global systems integrators and solutions providers for the industrial automation industry. Today, more than 1,900 employees occupy 21 facilities across North America, Europe, and Asia, with headquarters located in Holland, Michigan. JR designs and builds highly integrated manufacturing systems, including robotic welding, testing, dispensing, material handling, and assembly solutions. JRs customer base includes the worlds leading automotive, life sciences, aerospace, electronics, and industrial manufacturers. With a keen focus on technological innovation and a strong dedication to their employees, customers, and community, JR Automation is poised to continue its path toward further strategic growth and expansion. Position Summary: JR Automation is looking for an Electrician to add to it's growing team. The role is responsible for the panel building and machine wiring within each project at JR Automation. The successful candidate will be able to read, understand and update schematics and have experience wiring machines. They will also have strong organizational and leadership skills.  JR Automation offers an electrical apprenticeship program for new employees or those currently enrolled in an apprentice program Key Responsibilities:Assist Engineering in the development phaseDirect supervision of project teams assigned during the build phasePlan, organize, and control the build process and related costsWork cross-functionally with all departments during all phases of the project including de-bug and runoffKeep the project team up to date on key project detail, and keep the team informed on workload, and hours requiredSet employee expectations, provide feedback, coaching, and accountability to insure employees meet company expectations as needed and during formal performance reviewsResponsible to assist the Electrical Manager in developing the build team through leadership, experience, positive attitude, encouragement, and trainingCommunicate to the Electrical Manager and Project Manager on open issues, milestones, release status, timing, hours, and budget concernsResponsible to assist the Electrical Manager in developing the build team through leadership, experience, positive attitude, encouragement, and trainingSupport the quoting team by giving input on concepts, hours, and material costsMaintain a clean and organized work areaDemonstrate a commitment to upholding the highest standards of safety, on time delivery, and quality of our productsResponsible for holding team accountable to company policy and procedureRelease prints according to timeline schedule sequencing purchased and fabricated parts to arrive when neededCoordinate tear down and installation schedules including trucking requirementsLead installation of equipment at customer site which may include coordinating equipment and resources needed on siteEffectively and safely:Troubleshoot wiring and circuitsWire according to NECRead and understand schematics"}