{"jobID": "2791258710", "jobLocation": "Fremont_CA", "jobTitle": "Scientist III", "companyRating": null, "companyInfo": {"Website": "www.kellyservices.com", "Headquarters": "Troy, MI", "Size": "5001 to 10000 employees", "Founded": " 1946", "Type": " Company - Public (KELYA) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Adecco, ManpowerGroup, Allegis"}, "estimatedSalary": null, "jobDescription": "Scientist III, Fremont, CA Kelly Services is currently seeking a Scientist III for one of our top clients in Fremont, CA. Type: Contract Duration: 06/04/2018 – 05/31/2019 Pay: Up to $31 Scope: This position is responsible for supporting activities related to qualification and design transfer of products into manufacturing. This includes responsibility for Design control, manufacturing documentation and hands on laboratory work as needed. Requirements:BS in a scientific discipline with 5-7 years in-vitro diagnostic industry experience.Experience with Design Control, GLP, GDP, Risk Analysis, Verification and Validation, and working in a cGMP environment.Demonstrated ability for technical proficiency, writing clear quality documents, scientific, problem solving skills, collaboration with other departments and meeting timelines.Key Responsibilities: Write verification and validation protocols and reports for manufacturing processes.Work with Manufacturing to prepare new and update existing procedures per schedule.Create Excel tools, compile, analyze and summarize data.Demonstrate good cross-functional working relationship.Demonstrate flexibility with changes to working environment, multi-tasking, attention to detail, and delivering high quality results.Effective and timely communication, build and meet schedule as part of the team.If you are interested in the position, please apply to this posting with an updated resume. Thank you for your time and I look forward to working with you.Lauren Rogers, Kelly Services Scientific RecruiterWhy Kelly®?"}