{"jobID": "2764868286", "jobLocation": "Detroit_MI", "jobTitle": "Entry Level - Business", "companyRating": null, "companyInfo": {"Website": "www.gm.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1908", "Type": " Company - Public (GM) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " FCA Fiat Chrysler Automobiles, Ford Motor Company, Toyota North America"}, "estimatedSalary": null, "jobDescription": " Are you an Business major who is an innovator, has a creative mind, and is passionate about solving challenging problems? Are you a person who loves to get things done?  If so, we are looking for people like you, who:  -have an insatiable drive for excellence  -challenge themselves and their peers  -enjoy working collaboratively in cross-functional teams  -demonstrate a strong work ethic  -have a strong willingness to learn  -desire to deliver innovative solutions to complex problems  Requirements:  Preferred academic majors: Bachelors/Masters in Accounting, Communications, Economics, Finance, Journalism, Public Relations, Sales/Marketing, Supply Chain or MBA.  Work Locations: Primarily in southeast Michigan and but may vary throughout the U.S.  Come join our team in one of the following business functions:  - Communications  - Customer Care & Aftersales  - Finance  - Human Resources  - Sales & Marketing  - Strategy & Global Portfolio Planning  - Supply Chain  Opportunities are also available to participate in a TRACK rotational assignment.  As a TRACK (Technical Rotation and Career Knowledge) Employee at GM, you have the opportunity to help drive the future of the auto industry.We create challenging assignments which align with individual and company goals. Working at GM is a unique opportunity to develop your skills and understand the inner workings of one of the largest automotive companies in the world.  PLEASE ONLY APPLY IF YOU DO NOT NEED SPONSORSHIP TO WORK IN THE UNITED STATES NOW OR IN THE FUTURE. WE ARE UNABLE TO CONSIDER CANDIDATES WHO REQUIRE SPONSORSHIP."}