{"jobID": "2796307276", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist Sr", "companyRating": "3.4", "companyInfo": {"Website": "www.baesystems.com/us", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Northrop Grumman, Lockheed Martin, Raytheon"}, "estimatedSalary": "126000", "jobDescription": "Job Title Data Scientist Sr  31-May-2018 Job Description Are you a critical thinker? Do you like to experiment with different types of data science methods to get to the best solution? Well, you are in luck. The Workforce Intelligence Team @ BAE Systems is looking for a Junior Data Scientist who has a passion for analyzing data and gleaming insights around business problems that will optimize future business decisions. Projects span from updating/maintaining a Flight Risk Model, supporting a Quality of Hire analysis, to assisting with the expansion of solving business specific questions around program execution, business development/winning, etc.  Your primary focus will be in applying data mining techniques, statistical analysis, and creating high quality predictive models that will provide business leaders with insight and drive decision making. This position is part of the Workforce Intelligence team, an enthusiastic and highly productive advanced analytics team, where each employee has the opportunity to grow and make an impact. We provide a 9/80 schedule, an end-of-year week long paid shutdown and a 6% match, with immediate vesting, on 401(k) contributions. Auto req ID39305BRState/Province Virginia Required Security Clearance None Shift 1st Shift City Arlington US Citizenship required No Advertising Title Data Scientist Required Skills and EducationDegree in math, statistics, engineering, industrial organizational psychology, or related fields with a minimum of 6 years of experience.Great communication and presentation skills, especially to those with limited or no statistical or math backgroundExcellent applied statistical skills, that include but not limited to:a. The ability to manipulate data using data science tools b. A knowledge of exploratory data analysis (i.e., how to make plots, discover patterns with visualizations, exploring assumptions, etc.)  c. Ability to create hypothesis and explore possible solutions  d. Skills to distinguish true from false patterns"}