{"jobID": "2831784693", "jobLocation": "Jersey_City_NJ", "jobTitle": "Firmwide Data Management - Data Network Architecture - Data Science Engagement Manager - Executive Director", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "143000", "jobDescription": " Apply Now  Firmwide Data Management - Data Network Architecture - Data Science Engagement Manager - Executive Director  Req #: 180056745  Location: Jersey City, NJ,US  Job Category: Accounting/Finance/Audit/Risk Job Description: JPMorgan Chase(NYSE: JPM) is a leading global financial services firm with assets of $2 trillion and operations in more than 60 countries. The firm is a leader in investment banking, financial services for consumers, small business and commercial banking, financial transaction processing, asset management, and private equity. The Chief Data Office has a mandate set and actively supported at the board level to transform data management towards demonstrable shareholder value. The Data Network Architecture team has a firm wide remit to deliver a broad set of data management capabilities including the overall functional and technical vision for data governance. Role Responsibilities:Point person for Firm Data Management (FDM) organization with Data Science departments throughout JPMCInitial focus will be aligned to Corporate Investment BankAdvocate for FDM Policy and capability technology adoption (e.g. Data Catalogue)Ensure functional integration of Data Governance capabilities (glossaries, data catalogue, model management) with data science platforms (sandboxing, sampling, modeling, testing and promotion to production)Partner with Data Science and FDM tech to design/develop techniques for predicting content of Data-in-Place and Data-in-MotionDesign human versus machine learning workflows to improve accuracy or predictions and remove false positives and false negativesPartner with Data Science and FDM product management to promote adoption of Data Governance capabilities within Data Science operationsExperience in technology change management and leadershipExperience of financial services model analyticsTrack record of delivery in matrix management organisation with multiple stakeholdersAppreciation of, experience in, information architectureAwareness / working knowledge of methods and techniques to do with:Data wrangling and stagingCreation of models including feature extraction and cost optimizationCreation of machine learning models and algorithms with an emphasis on classification (regression, clustering, neural nets, etc)Design, build, and operate ML systems (cloud, Hadoop, etc)"}