{"jobID": "2739910940", "jobLocation": "San_Francisco_CA", "jobTitle": "Systems Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.ncphs.org", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": "SUMMARY: Leads process analysis and recommends, prioritizes and implements plans for improvements and enhancements to new and existing application systems and reports with emphasis on the Human Resource Information System (HRIS). Provides consultation to systems users, including Management Staff, on applications and related processes to ensure organizational effectiveness.ESSENTIAL FUNCTIONS:Identifies business requirements, procedures, processes, and training needs for ongoing development and support of NCPHS Human Resources Information Systems (HRIS). Analyzes and integrates human resources, timekeeping and payroll processes in accordance with NCPHS procedures into HRIS application software. Reviews all HRIS processes and makes recommendation on process and systems improvements.Maintains and updates Manager and Employee Self-Service portals to include personnel procedures, position descriptions, and other related human resources information. Expands Manager Self-Service and Employee Self-Service modules based on defined organization needs.Leads process analysis and makes recommendations for the design of new systems and/or implements plans to enhance existing systems’ functionality. Develops project scope, tasks, secures required resources and produces deliverables on schedule.Ensures human resources, payroll, accounting, benefits and training functions are provided with the most efficient and effective methods of processing and maintaining employee data. Advises management and staff on processes and procedures to meet current and future needs.Maintains internal database files and tables according to IT protocols, including installation of patches/fixes, and upgrades provided by the software application vendor in accordance with internal change control processes. Maintains security across all HRIS applications. Establish, implement and maintain procedures, guidelines, metrics, reporting and audit procedures to evaluate and measure human resources activities and effectiveness. Monitors and identifies trends and provides information, recommendations and effective solutions to management.Works with users to streamline and automate business processes. Analyzes and tests applications to automate and enhance operational effectiveness. Ensures users are provided with the most efficient and effective methods of processing and maintaining data. Advises users on processes and procedures to meet current and future needs.Identifies training needs of users. Develops and provides the necessary communication, training, and materials to fulfill training needs. Provides Help Desk support on HRIS system as needed.Provides oversight to community staff to ensure process implementation and data integrity. Provides consultation to Management Staff on regulations, rules and internal procedures. Ensures established processes are in compliance.Develops, designs, tests and implements small to medium sized software projects while working closely with various departments and users within NCPHS.Manages internal and external relationships with users, collecting their input and organizing and prioritizing this information to ensure predictable outcomes.Documents system design specifications, test plans, and production support procedures for software and systems already in place, or in the planning and implementation stages.Maintains the confidentiality of employee information and adheres to applicable federal, state, and local labor laws and regulations, and NCPHS policies and procedures.Performs other duties as assigned.QUALIFICATIONS:Bachelor’s degree in Computer Science or Management Information Systems or equivalent education and professional experience. A minimum of five (5) years progressive experience with the use and implementation of Kronos WorkForce Central Human Resources Information Systems, including three (3) years in systems support. Previous work experience in a customer service, hospitality or healthcare environment preferred. California driver license, proof of insurance, clean driving record, and ability to travel to multiple locations on a daily basis.SUPERVISORY RESPONSIBILITY: None. Provides work direction and consultation to Human Resources, Information Technology and Accounting staff."}