{"jobID": "2758180386", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher / Strategy Developer", "companyRating": "5.0", "companyInfo": {"Website": "www.sunrisefutures.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "185000", "jobDescription": " Sunrise Futures is an industry leading proprietary trading company based in Chicago, IL that specializes in quantitative model based trading strategies. We seek highly talented quantitative researchers with an entrepreneurial spirit to join our strategy research team.  Sunrise Futures leaders are pioneers in algorithmic trading strategy development and have extensive experience in various senior positions in leading financial institutions. We offer our employees a team environment where you can learn from leaders in the field and have the opportunity to utilize your talents for rapid career growth.  We offer extremely competitive compensation including a performance-based bonus. Our employees enjoy a comprehensive benefits package including programs such as company paid medical and dental insurance, 401k with immediate employer match, and daily catered lunches.  If you’re interested in: Working collaboratively with senior quantitative research analysts to develop an understanding of complex financial markets, products, and strategiesAnalyzing financial market data to identify patterns and potential opportunitiesDeveloping forecasts and building predictive and profitable trading modelsEmploying in-house tools to perform strategy exploration and optimizationEvolving trading strategies and methodologies to improve current systems What we’re looking for: Problem solvers who are driven, self-motivated, and think creativelyBachelors, Masters, or PhD in a quantitative field ( Mathematics, Statistics, Physics, Engineering, Computer Science)Three or more years of experience in a related field or industryStrong problem solving and math skills and attention to detailProgramming skills and understanding of basic programming concepts. Experience with C/C++Desire and interest in advancing machine learning within the trading industryExcellent written and spoken communication skillsMust be motivated, dependable, and responsible"}