{"jobID": "2699021814", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "SENIOR DATA ENGINEERAbout the Role Figure is a financial technology company with the mission of leveraging blockchain, AI and advanced analytics to unlock new access points for consumer credit products that can transform the financial lives of our customers. We provide home equity release solutions, including home equity lines of credit, home improvement loans and home buy-lease back offering for retirement. Concurrently, we are building a blockchain protocol for the origination, custody, trading and securitization of whole loans and other assets.We are a group of passionate innovators and serial entrepreneurs with a proven track record of creating billions of dollars in value in the FinTech space. We are targeting significant growth and milestones in the next few years, and are looking to hire exceptional talent.We’re looking for a rockstar Data Engineer to join our growing team. As part of our Data team, you’ll work closely with our various business functions to understand key business needs and develop data solutions that lead to solutions to those business needs. As a member of our data engineering team, you will be contributing to the product vision and development from day one.This team has an incredible engineering challenge: integrate a variety of very large datasets that outline intricate details about consumer’s credit profile. This expansive dataset is the foundation for our AI and machine learning processes that will power everything from prospecting, to operations, to servicing of our clients. Innovations here tie directly to the extensibility of our infrastructure, the capabilities of our machine learning, and success in our mission.What You’ll DoLeverage BigQuery and other GCP tools to build robust and efficient data pipelines.Expand and optimize our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams.Assemble large, complex data sets that meet functional / non-functional business requirements.Work with stakeholders including Data Science, Analytics, Product, and Design teams to assist with data-related technical issues and support their data infrastructure needs.Work with data and analytics experts to strive for greater functionality in our data systems.What We Look ForBS degree in Computer Science or related technical field, or equivalent practical experience.5+ years of proven working experience as a data engineer.Expertise building and optimizing ‘big data’ data pipelines, architectures and data sets leveraging Kafka (preferred), Hadoop, Spark, etc. Experience with GCP's Compute, Storage, BigQuery, and Data Transfer tools is a big plus!Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of SQL and NoSQL databases, including BigQuery (preferable), Postgres or Cassandra.Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.Strong analytic skills related to working with unstructured datasets.A successful history of manipulating, processing and extracting value from large disconnected datasets.Ability to thrive in a fast-paced growing company.Benefits To YouCompetitive salary based on experience and skillsFirm-wide 25% bonus targetCompetitive stock options package as an early member of the teamA flexible paid time off and vacation policyComprehensive health, vision, dental insuranceGym membership and other company programsAnd much more to come!Figure will not sponsor work visas for this position. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire."}