{"jobID": "2735829352", "jobLocation": "Dearborn_MI", "jobTitle": "258369 - Data Scientists Modeling", "companyRating": "4.0", "companyInfo": {"Website": "www.rgbsi.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Kelly Services, TEKsystems, Randstad US"}, "estimatedSalary": "80000", "jobDescription": " RGBSI, a leader in the staffing industry, is dedicated to providing the highest quality of services to our clients and employees. We are proud to be the primary staffing partner to top companies in the automotive, aerospace, IT, media & entertainment, sports, energy, and finance industries. As a result of our clients' continued growth, we are looking for energetic, personable professionals to partner with these leading US companies. Position Description:Job Description:A high-potential analyst is needed to assist in all phases of the development, deployment, monitoring, and evaluation of analytical models & tools.We are looking for highly motivated, multi-faceted individuals to work in a high-visibility functional area.Typical Responsibilities:Work with Risk, Finance, Pricing and Sales teams to support business strategiesEmploy statistical procedures (e.g., binary/multinomial logistic, nested logit) to develop models to quantify risk or payment behaviors, responsiveness to price and other vehicle incentivesEmploy econometric procedures (e.g., ARIMA, ARCH/GARCH) to develop forecasts for loan offers, approvals, purchases as well as portfolio mix (e.g. term, risk tier)Develop optimization models and frameworks to determine optimal pricing or risk strategies; incorporating corporate objectives and constraintsDevelop model tracking methodologies and reports to monitor model performanceInvestigate data & implementation issuesWork with various data sources and platforms to compile dataSkills Required:Strong knowledge of statistical, econometric, and optimization methods (e.g., logistic, time series, seasonal adjustments, non-linear programming)Familiarity of various simulation techniquesStrong statistical programming experience requiredPractical experience in analytics in business and/or academic environment (Finance experience is a bonus)Ability to translate complex quantitative methods into easily understood results for all levels of business customersStrong oral and written communication skillsWell-organized, independent and ready to work with minimal supervisionInquisitive, team-oriented, proactive, open-minded and interested in learningSkills Preferred:1+ years of experience with statistical, econometric, and optimization methods (e.g., logistic, time series, seasonal adjustments, non-linear methods)1+ years of experience using analytics in a business or academic environment1+ years of experience in one of the following: SAS, R, MatLab or PythonExperience Preferred:SAS proficiency is strongly preferred, Matlab, R, Python is a plusExperience with various data platforms (PC, Mainframe, UNIX/LINUX, Teradata)Education Required:Complete (Or nearly complete) Master Degree Biostatistics, Mathematics, Operations Research; Economics with emphasis in Econometrics or related quantitative fieldEducation Preferred:Statistics, Apply Math We offer attractive, competitive compensation and benefits including, medical, dental, vision, longevity bonus, holidays, 401k, Short Term Disability, AD&D; and Tuition Reimbursement. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more.  RGBSI is a Multi-National Corporation headquartered in Troy, MI with branches throughout the USA, Canada, China, Germany, Mexico, Singapore, UK, and India."}