{"jobID": "2827629200", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst / Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "risk.lexisnexis.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thomson Reuters, Verisk Analytics"}, "estimatedSalary": "79000", "jobDescription": "Lexis Nexis Risk Solutions Government Vertical is growing and always interested in great talent. We are posting this description to attract and build our talent pipeline.This position serves on a unique, multi-disciplinary team providing advanced data-driven, mathematically-defined, and empirically-measured decision support to operational and executive leadership regarding quantitatively-derived patterns of insurgent, terrorist and other criminal predatory behaviors negatively impacting U.S. Forces and their allies, and U.S. National Security. Lexis Nexis provides advanced technical training on specialized tools and analytic methodologies required by the position.Responsibilities:Perform advanced strategic, operational, tactical and administrative data-driven analysis, derived from the methodologies of law enforcement crime analysis, relating to behavioral, spatial and temporal patterns to predict specific predatory activity and to develop dynamic and complex analytical solutions to critical and hazardous problem sets faced by front-line operational personnel.Apply advanced knowledge of spatial statistics, time series analysis and mathematical principles required for developing, implementing and explaining scientific modeling of spatio-temporal behaviors.Effectively learn to operate a variety of commercial and proprietary software programs and platforms at an expert level in order to move and manipulate data, and analyze and display complex analytic findings for a broad spectrum of audiences.Operate, manipulate, and manage large-scale data efforts supporting the development of comprehensive data holdings for the purposes of pattern identification.Demonstrate innovative thinking, a self-motivated work ethic, and a strong customer-focused mission working individually and in a diversely-talented collaborative team setting.Participate in and lead meetings, conferences, and engagements to exchange information and updates with peer analysts and operational customers, and brief technical findings to senior-level and executive leaders to inform decision-making.Successful applicants will have documented experience working with multi-disciplinary operations, analytic, or intelligence teams in law enforcement, military, or federal agencies.Minimum Qualifications:Must be a U.S. Citizen.Requires the ability to obtain and hold a TOP SECRET clearance with SCI eligibility, active status preferred.Requires a committed attitude to learning proven methodologies and processes, as well as proprietary and commercial software programs, including certifications where appropriate.Bachelor’s Degree in an analytically rigorous Quantitative, Qualitative, or Technical field of study, such as: Statistics, Operations Research (ORSA), Applied Mathematics, Engineering, Criminology, Intelligence, Psychology, Linguistics, Homeland Security, Geographic Information Systems (GIS), Data ManagementAnalysts require a minimum of 2 years (Sr. Analysts require a minimum of 7 years) of general analytic experience working with tabular datasets from a relevant government, academic or private sector problem set, such as: Military, Crime, Geospatial, Finance, Transportation, Security, Communications, Intelligence, Legal, Logistics, EconomicsExcellent organization and analytical skills.Excellent written and oral communication skills.Ability to work collaboratively within a team setting.Preferred QualificationsMaster’s degree or higher in any field of study, or specialized/certified training in relevant fields of study strongly preferred.Experience in a direct operational or analytic role in a military, law enforcement, or investigative environment strongly preferred.Understanding of the principles and application of process modeling, decision support, and advanced statistics preferred.Experience with large-scale database management, quality control, and data fusion among conflicting data formats and storage systems preferred.Experience with Geographic Information Systems (GIS), spatial analysis, geography, 3D analysis, raster analysis, and GIS modeling preferred.Experience working overseas in an operational or analytic role preferred. At LexisNexis Risk Solutions, we believe in the power of data and advanced analytics for better risk management. With over 40 years of expertise, we are the trusted data analytics provider for organizations seeking actionable insights to manage risks and improve results while upholding the highest standards for security and privacy. Headquartered in metro Atlanta, LexisNexis Risk Solutions serves customers in more than 100 countries and is part of RELX Group plc, a world-leading provider of information and analytics for professional and business customers across industries. For more information, please visit www.lexisnexisrisk.com. LexisNexis Risk Solutions is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact 1.877.734.1938 or accommodations@relx.com."}