{"jobID": "2823907250", "jobLocation": "Alpena_MI", "jobTitle": "General Duty Rn 2S Nrsg", "companyRating": null, "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": null, "jobDescription": " Position Information  FTE: 0.600000  Exempt: No  Any Shift: Hours per schedule  Weekend & Holiday Rotation: Per schedule  Position Summary  Summary:  This position is responsible for assessing patient health needs, nursing care requirements and the delivery of holistic nursing care on all assigned patients including the maintenance of medical records. May advise and educate patients and  the public about various health conditions and provide advice and emotional support to patients and their family members.  Responsibilities ESSENTIAL:Responsibilities:(20)* Assesses patient health needs, nursing care requirements, and delivery of nursing care on all assigned patients. Directs patient assessments by other nursing staff. (20)* Plans care for assigned patients and directs the planning of care by other nursing staff. (20)* Implements nursing actions in accordance with established standards of nursing practice and demonstrates competence in nursing care of the neonate, pediatric, adolescent, adult and geriatric patient. (20)* Evaluates effectiveness of plan of care; ensures responsible care is rendered to patients. (20)* Self-Management: Holds self accountable for delivery of responsible care, demonstrates effective communication skills and interpersonal relationships. Assumes responsibility for own continued professional development and assists with the development of other staff members. OTHER DUTIES AND RESPONSIBILITIES: Operates equipment as outlined on orientation checklists, policy and procedures.  Participates in equipment in-services and competencies as they relate to role expectations.  Performs job skills outlined on orientation checklist as they relate to role expectations.  Participates in Performance Improvement as required by the Health System and the job description.  Understands and is accountable for MidMichigan Health's customer service standards.  Qualifications  * Associates Degree Registered NurseState of Michigan  Physical/Mental Requirements and Typical Working Conditions PHYSICAL/MENTAL REQUIREMENTS AND TYPICAL WORKING CONDITIONS: Exposure to stressful situations, including those involving public contact, as well as, trauma, grief and death.  Able to wear personal protective equipment that includes latex materials or appropriate substitute if required for your position.  Is able to move freely about facility with or without an assisted device and must be able to perform the functions of the job as outlined in the job description.  Overall vision and hearing is necessary with or without assisted device(s).  Frequently required to sit/stand/walk for long periods of time. May require frequent postural changes such as stooping, kneeling or crouching.  Some exposure to blood borne pathogens and other potentially infectious material. Must follow MidMichigan Health bloodborne pathogen and TB testing as required.  Ability to handle multiple tasks, get along with others, work independently, regular and predictable attendance and ability to stay awake.  Overall dexterity is required including handling, reaching, grasping, fingering and feeling. May require repetition of these movements on a regular to frequent basis.  Physical Demand Level: Medium. Must be able to occasionally (0-33% of the workday) lift or carry 21-50 lbs., frequently 34-66% of the workday 20 lbs. and or Walk/Stand/Push/Pull of Arm/Leg controls and constantly (67-100% or the workday) 10 lbs.Apply!"}