{"jobID": "2804212432", "jobLocation": "Chicago_IL", "jobTitle": "Scientist, Cellular and Molecular Biology", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": "AbbVie is at the forefront of cancer research, discovering and developing the next generation of treatments to address unmet medical need for cancer patients. Our strong pipeline includes both small molecule and biologic therapeutic approaches with first in class agents that target multiple pathways central to the growth and survival of both solid and hematological malignancies.  We are seeking a highly motivated in vitro biologist to join our growing cancer research organization. The successful candidate will join a team dedicated to discovering and developing novel cancer targets. Key Responsibilities Independently design and execute his/her own multistage experiments and interpret results to support advancing early and late-stage Oncology research programs.  Set and meet his/her own experimental timelines to generate reliable and reproducible data.  Identify, generate, and optimize cell models and assays to achieve project goals.  Collaborate with multi-disciplinary teams both within and outside of the group to advance research programs.  Effectively manage multiple activities and responsibilities simultaneously.  Read and apply relevant scientific literature to projects to troubleshoot and solve problems.  Organize and present scientific data at group and project team meetings.Basic:Bachelor’s degree with 5+ years of experience; Master’s Degree with 2+ years of experience in cell biology, immunology, or a related field of biology.Strong background in cellular and molecular biology is required, extensive experience in the fields of cancer biology and antibody drug conjugate is preferred.Previous experience in drug discovery, either in an academic or industry setting is preferred.High degree of proficiency in standard biochemical, cellular, and molecular biology techniques is required (FACS, ELISA, cell-based assays, immunoblotting, aseptic cell culture, cloning, Lenti virus, CRISPR and etc).Strong oral and written communication skills are a must.Team player with the ability to thrive in a fast paced, multi-disciplinary, matrixed environment.Enthusiasm and passion for executing innovative scientific research.Key Leadership Competencies:Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performance.Learns fast, grasps the \"essence\" and can change course quickly where indicated.Raises the bar and is never satisfied with the status quo.Creates a learning environment, open to suggestions and experimentation for improvement.Embraces the ideas of others, nurtures innovation and manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}