{"jobID": "2677470762", "jobLocation": "San_Jose_CA", "jobTitle": "Sr Fraud Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.signifyd.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Signifyd were creating a new market. Were constantly improving and expanding the technology that has changed what fraud protection for ecommerce looks like. So we dont have time for office politics or to worry about where or when we get our work done. Were all Signifyers, so we know that what needs to get done will get done.  Signifyd is a place where no one is going to tell you how to do your job. If you want help, you'll get it from all quarters. But we pretty much figure out what needs to be done, who's in the best position to do it and then let that person roll-up her or his sleeves and have at it.  Were fighting online fraud in a way thats never been done before and we could use your help if youre someone: Who believes challenges are best overcome by thinking differently.Who knows his or her role, but isnt confined by it.Whos greatest satisfaction comes from helping customers succeed and achieve their dreams.Who isnt afraid to disagree, convincingly, civilly and honestly.Who will stop and hold the door for a colleague, even if youre running late. Oh, and a few particulars for this role: Primary ResponsibilitiesIdentify meaningful insights from chargeback data. Interpret and communicate findings from analysis to engineers, product and stakeholders.Analyze high-volume data to investigate, identify and report trends linked to fraudulent transactions.Review suspicious activity and complex fraud cases to help identify and resolve fraud risk trends and issues.Collaborate with cross-functional groups such as Customer Support, Product Management, and Engineering to enhance tools, data sources, system functionalities, and fraud detection methodsMonitor fraud alerts and configure risk rules accordingly to flag potential fraudulent ordersApply risk management policies and procedures to help manage and minimize losses.QualificationsMinimum 5 years experience in fraud investigation in e-commerce or payments industryAnalytical, quantitative mindset with a keen attention to detailHigh level of computer skills to effectively use multiple systemsWillingness to adapt to a constantly changing, customer-driven work environmentAbility to work on routine tasks both independently and with the teamSelf-starter and comfortable taking initiative while quickly grasping concepts, processes and ideasExcellent SQL skillsFluency with data analysis and visualization tools (Tableau is extra credit)(highly desired) Familiarity with scripting(highly desired) Experience working with Rules EngineLocal candidates only"}