{"jobID": "2770578075", "jobLocation": "San_Francisco_CA", "jobTitle": "QA Automation Engineer, Platform", "companyRating": "4.0", "companyInfo": {"Website": "www.vungle.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AdColony, Unity, AppLovin"}, "estimatedSalary": "118000", "jobDescription": "Engineering at Vungle: We are building a world-class engineering team with diversified skills and backgrounds. As the leader in in-app video advertising, we are taking on a challenge that has never been solved: how to fundamentally change the mobile advertising industry to have ads make sense for users, application developers, and advertisers. In this role, you will play a vital role in ensuring Vungle's backend services, our core platform, are tested with high quality industry standards. Responsibilities:Develop and maintain test plans for backend REST API services.Document the test cases with clearly defined execution steps and acceptance criteria.Participate in daily scrum and planning meetings.Effectively integrate QA cycles into development sprints.Execute test plans as part of the system platforms release cycle.Provide technical mentorship and coaching to local and remote QA testers.Requirements:3+ years of experience with testing complex software systems and platforms (significant client-server communication a plus).Experience testing and automating REST API servicesStrong experience with Python and other scripting languagesStrong communication skills to work effectively with overseas teamsExperience writing test cases and test plans for new and existing featuresExperience testing for high volume transaction processing systemsExperience with Continuous Integration using Jenkins, Maven, Git, etc.An understanding of HTTP methods/verbs/error codes (GET, POST, etc.)An in-depth understanding of cloud technologiesA passion for product quality and an eagerness to learn new technologiesExposure to JMeter or similar load and performance testing toolsAbout Vungle: Vungle is the leading performance marketing platform for in-app video ads. Advertisers depend on Vungle's creative and LTV optimization technologies to reach and acquire high-value users worldwide. Top publishers rely on Vungle to generate revenue with engaging video ads that enhance the user experience.  Vungle is trusted by 50,000+ mobile apps worldwide with key developer and advertiser partners such as Supercell, King, Zynga, EA, Ubisoft, Smule, MZ, Google, Honda, Allstate, Procter and Gamble, L'Oreal, Coca-Cola, and Nissan. Vungle serves 3+ billion video views per month on 350+ million unique devices and is consistently ranked #1 for cross-platform user retention by industry mobile performance indexes. Vungle is backed by Google Ventures, Thomvest Ventures, Crosslink Capital and SoftTech VC. The company is headquartered in San Francisco with offices in New York, London, Berlin, Beijing, Tokyo, Singapore, and Seoul."}