{"jobID": "2746934632", "jobLocation": "Chicago_IL", "jobTitle": "Experienced Data Scientist - Natural Language Processing", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " My client is a tier 1 hedgefund with a focus on long/short trading. The hedgefund manages $25 billion dollars and specialises in technologically sophisticated strategies based on machine learning and sentiment analysis for long/short trading automated investing. The data science group is responsible for researching trading signals from ubiquitous data. (chat, logistics, tweets, sales, cookies, etc). The range of data available is extensive and curated by a team of 30 data engineers. As a data scientist, you will work within an elite research cohort tasked with finding trading strategies from the data collection. The task is to predict stock prices ahead of earning announcements and to identify M&A; signals. The nuances of the role are proprietary and you will be expected to sign a non-disclosure agreement upon joining to division. In return, you can expect and attractive salary and exceptional bonus potential. Ideal candidate:PhD in Machine Learning from an elite or top tier institutionNLP expert. We are looking for a candidate with publications in journalsGPA of 3.8 or higher for undergraduate degreeAn expert in natural language processingA good understanding of data science methodsSkillset:The stack is: R, Python, Spark, Mongodb, Hadoop and Cassandra, Node.js and Reach.JSIf you would like to be considered for the position of Data Scientist, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team"}