{"jobID": "2829566615", "jobLocation": "San_Jose_CA", "jobTitle": "looking for SAP Digital Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.inframatix.com", "Headquarters": "San Jose, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Looking for SAP Digital Data Analyst  Location: San Jose - CA  Duration:6+ Months  CITIZEN, GC, H1B All candidates must speak wellBecause consultant will interact with executives they must be polished and confident. Tough hiring process. They only hire the best!!!! Required Skills: 10+ years of experience in a similar digital strategy or website analytics position or interactive agency environment.Data Analysis in SAP S/4 HANA, Digital Framework on SAPDevelop measurements, track performance, and tailor plans to client goals and KPIs.Develop ROI models for campaign reporting.Dive deep into client data and create effective stories via data extraction that help demonstrate value and drive projects forward.Collaboratively prepare monthly/quarterly client reports that provide new and creative recommendations.Advise clients on the best solution to achieve their data goalsProactively implement strategy work plans as client needs and requirements evolve.Produce integrated content, social and engagement reports and plan outcomes.Participate in value mapping of client goals and activity.Advise clients on the best solution to achieve their goals from a series of disciplines such as search, display, and other inbound marketing techniques.Proactively implement strategy work plans as client needs and requirements evolve.Produce integrated content, social and engagement reports and plan outcomes.Certifications in Analytics and Digital AnalyticsDelivered actionable insights using web performance tools such as AnalyticsExpert-level experience presenting strategies to clients, including at the executive level."}