{"jobID": "2829489235", "jobLocation": "Chicago_IL", "jobTitle": "MGS Physical Analysis Senior Scientist", "companyRating": null, "companyInfo": {"Website": "www.mars.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A mutually rewarding experience.  Work. Realize your ambitions. And realize theres more to being in business than just making a profit. Thats the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.  Because its never just about a single person, a single project or a single brand. Its about how you can grab everything thats within your reach here and use it to pursue mutual, long-term gain. Its about having ideas. And ideals. Being prepared to risk failure because the promise of success means well all be a little better off. Its that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job. About Mars, Incorporated Mars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the worlds best-loved brands: M&Ms;®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5, SKITTLES®, UNCLE BENS®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles Quality, Responsibility, Mutuality, Efficiency and Freedom inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.  Mars Global Services is looking for Physical Analysis Senior Scientist in Chicago, IL or Aimargues, France.  The Physical Analysis/Rheology Senior Scientist is responsible for the technical development and validation of fit for purpose reference and rapid physical analysis, rheology and sampling methods for use within regional and site laboratories and within factories, ensuring our access to high quality testing solutions for process measurement and control. Key Responsibilities:Lead the scoping new method development projects through client discussion to capture the method critical success factors enable the development of a fit for purpose tool.Produce a comprehensive literature review and recommendation of the technologies to be assessed as part of the method development project.Deliver high quality, fit for purpose technical method development for physical analysis methods for regional laboratory, site laboratory and in factory use, including the execution of bench/line trials for both method development and method validation.Create robust method validation documentation, including SOPs, test method transfer protocols, QC, equipment requirements, system suitability checks, etc. to evidence the suitability of methodology for useCreate effective method training packages for regional/site laboratory teams, including SOPs, test method transfer protocols, local implementation (validation) of methods, minimum training requirements, QC/PT, equipment requirements, system suitability checks, etc.Maintain a high level of customer focus and ensure that projects are delivered on-plan, on-time, and on budget.Develop sampling guidance documents for sites to support routine inspection and incident managementContribute to maintain the laboratory in a good shape, through the participation to equipment metrology program, preventative maintenance when insourced, 5S etc.Maintain a good working knowledge of the state of the art in their specific scientific/technological discipline through literature review and conference/international meeting attendance.When the investment into a new technology is needed, participate to the assessment and recommendation of technology/brand/model.Provide support to regional and site labs for troubleshooting and problem solving and improvement of method accuracy/precision and reliability of Internal and External LaboratoriesPerform risk assessment analysis before starting the bench work in the Central Lab and define the needs in collective and Personal Protective Equipment.Proactively engage a culture of safe laboratory behaviors, role model best practices, adhere to safety procedures within the laboratory, and provide open feedback to other Mars Inc. associates when working in global, regional, or site labs.Work closely with the Global Food Safety Center to ensure long term research is translated into routine chemical methodsCollaborate with the regional laboratory and GIC teams on identifying opportunities for the continuous improvement of physical analysis methods.Recommended and govern the Mars method table data in their area of expertise.Responsible for contributing to continuous improvement for MGS labs.Key Requirements: The Physical Analysis Senior Scientist is responsible for the development and validation of the prioritized methods assigned to him/her to ensure the continual development of regional and site laboratory capability, and in factory measurement. This role is critical to insuring that the MGS Labs network is equipped with fit for purpose test methods to deliver on-time and accurate data in compliance with the Mars Laboratory Standard. The role will require strong project management and planning skills as multiple development assignments may be undertaken at the same time. The role requires a high degree of networking skills as the job holder will be a key interface between the MGS expert center and the Global Food Safety Center. Up to 20% global travel including a number of multi-week trips per year with occasional weekends away from home Minimum Qualifications: MSc. in Chemistry, Physics or other appropriate scientific field with lab experience required. Experience working in a laboratory in the food, cosmetic, pharmaceutical or related industry or equivalent  Expert technical knowledge in of area of expertise physical measurement and characterization and how to apply it to analysis of raw materials, packaging and finished products, preferably in the food industry.  A technical laboratory background in food, pharmaceutical, or cosmetics industry is essential. Experience working with nanoparticles preferred.  Knowledge of sample preparation and measurement techniques using microscopy, particle size, and other physical characterization techniques.  Awareness of ISO 17025 laboratory requirements, working experience preferred  Outstanding communication skills  Outstanding stakeholder management and communication skills  Fluent in writing and speaking English  Experience in project management  Experience in technology horizon scanning  Ability to travel up 20% of the time  Successful Completion of a drug and background screen  Company paid relocation is not available for this role. Preferred Qualifications: Ph.D. in Chemistry, Physics or other appropriate scientific field is preferred  Management experience is preferred  Experienced in line management of multidisciplinary teams of technical experts  Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request."}