{"jobID": "2738713285", "jobLocation": "Bethesda_MD", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.brivo.com", "Headquarters": "Bethesda, MD", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Brivo is seeking a talented Data Engineer​ with a passion for transforming, wrangling, and manipulating data with current big data technologies. We are looking for people that have real world experience with Spark, Cassandra, Amazon S3 and related Amazon Big Data offerings. If you enjoy collaborating with other engineers, architects, and product management and are passionate about data we want to hear from you.    Your RoleSupport the design and implementation of a large scale big data solution utilizing Spark in AWSIdentify, break down, and solve data-oriented problemsWork in an open, agile environment and participate in agile team sprint planning sessions, provide work estimates and strategies to implement solutions in a most effective wayAssist with the analysis of informational needs and elements, data relationships and attributes, proposed manipulation, data output, and reporting capabilitiesCollaboratively work with architects and product managers to develop a robust data processing pipeline that will ingest, enrich, and expose large amounts of data   Minimum QualificationsExperience with object-oriented design, coding, and testing patternsExperience developing Java or Scala Spark applicationsExperience with enterprise-class software development and understand what it means to support a SaaS productExperience in data warehousing and NoSQL technologiesStrong background in working with Data Scientists and a good foundation in Statistics and MathematicsAbility to engineer large-scale data and data processing infrastructuresExperience supporting the maintenance of Spark applications in a productized production environmentStrong understanding of big data design principles, security and the factors that affect big data and distributed system performance   "}