{"jobID": "2812752825", "jobLocation": "Washington_DC", "jobTitle": "Quality Assurance Engineer", "companyRating": "4.5", "companyInfo": {"Website": "www.predictivetechnologies.com", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "QA Engineers are responsible for ensuring great products and analytics for our users. At APT, QA Engineers work directly alongside software engineers in small teams and are deeply engaged throughout the entire development process. From feature outset to feature rollout, QA Engineers are involved every step of the way guaranteeing the highest quality product and fastest possible software delivery.  APT builds analytically intensive software on top of vast amounts of data served securely over the web to many of the world's largest organizations. As a QA engineer, the challenges are endless: Are the calculations correct in all possible circumstances?Is the software fast despite huge data volumes?Do all user's, regardless of statistical background, have a great user-experience?Can testing be automated as much as possible? QA Engineers come from a variety of backgrounds. They bring their statistical, technical, or just sheer critical problem-solving skills to bear on APT testing challenges. QA Engineers quickly learn the ins and outs of database technologies, R statistics packages, agile software development processes, big data tools such as Splunk, and testing tools such as Selenium, jMeter, and many others.  In addition to these technical skills, QA Engineers learn to intimately understand the end-user's use-cases and business problem they are trying to solve. They develop a keen sense of prioritization and ability to time, coordinate and manage large efforts allowing APT to deliver software at a constantly rapid rate.  Innovation is also a key facet in the role. QA Engineers are expected to never settle for the status quo in how APT approaches its testing challenges and always look for ways to accelerate or improve the testing tactics taken.What does this mean for you? Make a real impact – features you work on help drive million dollar decisions by the world's largest organizationsGain invaluable experience seeing first-hand how rapid software development is done wellConsistently learn new technologies and project organizational skillsReceive committed mentoring and training by an experienced leadership teamHave an immediate opportunity for increased responsibility, leadership, and personal growth Ideal Candidate Qualifications Highly motivated professional with excellent attention to detail and organizational skillsIndividuals who are curious, creative, and love open-ended problemsDemonstrated analytical / quantitative aptitudeTeam first attitude, dedicated to team successPrior technical or QA experience is a plus, but not necessaryAPT is an equal opportunity employer that values diversity and inclusion. Applicants will be considered and treated without regard to gender, gender identity, race, color, ethnicity, national origin, religion, sexual orientation, veteran or disabled status, or any other characteristic protected by applicable law."}