{"jobID": "2828563087", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.healthtap.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Teladoc, WebMD Health, Epic"}, "estimatedSalary": "146000", "jobDescription": " Description  Senior Data Scientist San Francisco  Are you convinced that data is an invaluable resource for companies? Do you get excited when you build and model data to analyze and interpret into meaningful information? Are you ready to add your data touch to the future of A.I.?  Three times yes? Sounds like we found a match!  HealthTap is a technology company dedicated to helping billions live a healthier, happier, longer life. We deliver a suite of connected health apps designed to provide simplified access and compassionate guidance to care for consumers while enabling practitioners to focus on what matters most.  HealthTap is well capitalized, having raised $85m with the most recent funding of $50m in 2017.  HealthTap is backed by an esteemed collection of venture capital firms including Mayfield, Mohr Davidow, and Khosla Ventures. Each of these firms is very committed to HealthTap and are very optimistic about the future of A.I. applied to healthcare and the Virtual Care Cloud.  HealthTap offers the worlds most comprehensive Virtual Care Cloud, running on our proprietary Healthcare Operating System (HOPES), and powered by our doctor-trained artificial intelligence (Dr. A.I.). HealthTap makes our basic services available to everyone for free while providing enterprises such as health systems, insurers, and employers a connected healthcare ecosystem. At HealthTap, we combine the otherwise disjointed elements of healthcare into a single seamless experience for consumers, administrators, and practitioners.  Health & Care. Simple & Accessible. What we offer you As a senior member of the data team, you'll have resources, autonomy, and the support of other A-players to drive analysis of the HOPES platform and the millions of active patients and doctors on it.  Examples of data projects you could work on: Realize the dreams of Dr A.I., our artificial intelligence powered virtual physician, by enhancing the machine learning modelMine our knowledge base of more than 5.5 billion doctor answers served and improve the lives of millions of peopleImplement and own deep analysis of very large datasetsReal-time trending of health-related issuesWhat you bring to usYoure passionate about making the world a happier, healthier placeYou have a BS/MS/PhD in quantitative discipline (applied mathematics, statistics, CS, OR, or related field)You have 3+ years of experience using quantitative approaches to solve challenging and meaningful analytical problems (or equivalent)You are proficient in programming and the use of analytic tools to perform rapid design, prototyping, analysis, simulation of, and experimentation with, advanced algorithms and technologies such as Python, R, Java, SQL, Matlab, MathematicaYou have solid grounding in applied mathematics and statistics including expertise in Bayesian Modeling, Multivariate Regression, Logistic Regression, Machine Learning, Cluster Analysis, Decision Analysis, Time-series Analysis and Forecasting, Factor Analysis, Structural Equation Modeling, Item Response Theory, Markov chains, Data Visualization (ggplot2/Shiny/matplotlib)You have real-world experience working with massive amount of data using big data tools such as HIve, Pig, Impala, Spark Streaming/SQL, Presto, etc.You have worked with large scale data platforms such as Hadoop, Spark, Redshift, NoSQL (DynamoDB/Cassandra/MongoDB), etc.You dont stop until the problem is solvedYou like extreme ownershipNice to haveYou are familiar with AWSYou have a working knowledge of Map-Reduce, ETL, TableauAn entrepreneurial background is a plusWorking experience in a smaller hyper-growth startup is a plusMore about working with usOur contemporary offices are based in downtown Palo Alto, and San Francisco in Jackson Square.We take care of our team and offer fantastic benefits. We provide daily catered lunches, chef-prepared dinners, and healthy snacks. We offer competitive compensation and equity. We provide full medical, dental and vision coverage, as well as subsidized gym memberships, and much more.Learn more about us, our story and how we are revolutionizing healthcare virtually and globally. Visit us: HealthTap.com We are an equal opportunity employer. We value diversity and inclusion. We want to see you grow!"}