{"jobID": "2807796323", "jobLocation": "Praha_TX", "jobTitle": "Sales Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.geaviation.com", "Headquarters": "Cincinnati, OH", "Size": "1001 to 5000 employees", "Founded": " 1917", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Rolls-Royce, Safran, Pratt & Whitney"}, "estimatedSalary": null, "jobDescription": "About Us: GE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry. Role Summary: The focus of Sales Data Analyst is to provide analyses to support strategic thinking and operational decision making. He/she will will be responsible for consolidated regional/global industrial outlook and future business trends. He/she will analyze market drivers effecting business of turboprop engines market, present business impact summary to the rest of commercial team and finally interpret and report the market research. Essential Responsibilities:Collect, validate, maintain and update relevant information about markets and competitors (macroeconomics, fleet distribution and activities, retirements, deliveries etc. )Summarize and analyze market share data, perspectives on market trends and competitor activities, market forecasts and pricing information.Sales Process consolidation and adjustments.Support business transition to digital tools and data accuracy.Qualifications/Requirements:Degree from accredited university.Some years of experience in data analytics / sales.Advanced knowledge of MS Office, especially MS Excel.Fluency in English language is a must, Czech/Slovak language is an advantage.Strong analytical skills and business acumen.Positive approach to digital and IT tools.Desired Characteristics: Strong oral and written communication skills. Strong interpersonal and leadership skills. Ability to work independently. Strong problem solving skills. Locations: Czech Republic; Praha"}