{"jobID": "2837584580", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.apexsystems.com", "Headquarters": "Glen Allen, VA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " TEKsystems, Insight Global"}, "estimatedSalary": null, "jobDescription": " **If you are interested in this role, please send resumes to [Click Here to Email Your Resumé]** Data Analyst 5 month contract with potential to extend ResponsibilitiesPulls data from SAP and gathers it for analysisTurn raw information into insights, recommendations, dashboards, and reports to provide ad-hoc reporting and analytics services and proactively support business decisions and processesCollaborates with end users and other members of the team to collect and coordinate business requirements for the use of analytics and reporting. Responsible for the prioritization of ad-hoc data requests.Works with team members to meet data needs of department in various areas.Understands data flow of systems and works with team members to improve data integrations.Participates as a team member in various projects and contributes to the overall goal/objective for the team.  Knowledge / Skills / AbilitiesKnowledge and experience working with Microsoft Office ToolsKnowledge and ability of how to collect data from different information sources and distribute them to users; ability to use this information to simplify information systems and make sound business decisions. Ability to identify issues, prioritize and problem-solving resolution.  QualificationsKnowledge of SAP ECCMicrosoft Excel (Pivots, V-Lookup)Work experience with Data analysis and large datasets  Top 3-4 Required Skills:Data Gathering from SAPPutting reports in analysis formatTurnaround time work show metrics in write upPreferred Skills:Familiarity with SAP data gatheringWorking understanding of Large Data SetsCollaborate and positive attitude with team members.  EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178.  EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178."}