{"jobID": "2778664832", "jobLocation": "Columbia_MD", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.enterprisecommunity.com", "Headquarters": "Columbia, MD", "Size": "501 to 1000 employees", "Founded": " 1982", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Enterprise Business Partners, LLC is an Equal Opportunity Employer (M/F/D/V).  Start Over with Job Search  Already have a profile? Login Now 18:PAR-041: Data Analyst Company Enterprise Community Partners Department Knowledge, Impact, Strategy Location Columbia, Maryland Job SummaryEnterprise is a proven and powerful nonprofit that improves communities and people’s lives by making well-designed homes affordable. Enterprise recently launched the Opportunity360 platform – an innovative platform designed to provide actionable intelligence for community partners engaged in building inclusive, well-designed communities. The Knowledge, Impact and Strategy (KIS) department at Enterprise drives knowledge building at Enterprise and across the affordable housing industry, uses data to inform community development strategies, and demonstrates the impact of Enterprise’s work in communities across the country.  The Analyst will work with the KIS Research & Analytics team to support the rapidly expanding Opportunity360 program, help our internal and external partners become better users and consumers of data, provide insights into changing neighborhood and regional conditions, and help build visually engaging interactive and web-based data tools. The Analyst must be able to clean, process and synthesize findings from large datasets. They must be excited about finding new ways to visualize quantitative information and working with diverse partners, and they must have a passion for community development and social equity issues.  Job ResponsibilitiesPerform data processing tasks and automate routine processes.Conduct statistical and descrip­­tive analyses of data related to neighborhood opportunity, demographics, housing, and regional development.Work with graphic designers to check, format and customize standard data reports.Work closely with other team members to problem-solve, trouble-shoot and perform quality assurance checks on analyses and data products.With senior staff, develop data visualizations and interactive dashboards in Tableau.Assess and respond to requests for information, including timely and professional communication.Provide general support to Enterprise consulting teams and serve on engagements with external clients and partners.Research related issues and prepare literature summaries, written briefs, memos and report drafts, as required.Prepare client reports, project updates, and methods documentation, as required. QualificationsMaster’s degree in economics, statistics, geography, public policy, urban planning or another discipline that emphasizes analyzing and interpreting quantitative information for policy and decision-making purposes.Knowledge of community development and/or housing issues, urban economics, demographics and/or real estate development, as well as common datasets and measurement techniques from the Census, HUD, and other common sources.Proficiency with standard statistical methods and software (R, SAS or Stata).Expertise with Microsoft Office software (especially Excel and Access).Experience visually representing quantitative information through maps, charts, graphics, etc.Excellent written and verbal communication skills and experience writing research briefs, reports or case studies.Positive attitude, patience and willingness to listen to and teach non-experts.Excellent organizational and time management skills; ability to work on multiple projects simultaneously.Excellent critical thinking and creative problem-solving.Commitment to data integrity.Willing to work on highly collaborative teams, both virtual and in-person.Curiosity, desire for self-improvement, and excitement about sharing new skills and knowledge.Additional Desired QualificationsExperience with analysis of spatial data in ArcGIS or building web maps on common platforms (e.g. leaflet, mapbox, ArcGIS Online, etc.)Experience conducting analyses using relational databases and/or geodatabases.Experience with Tableau and R, and/or interest in learning.Experience working with Postgres and PostGIS.Experience scoping and developing interactive visualizations or graphics (e.g. in Shiny, d3.js, Processing, etc.)Experience with design principles and best practices for data visualization, including using Adobe CS applications to create/enhance maps, charts and other visual products.Consulting experience or experience working with diverse clients. Additional Info. -"}