{"jobID": "2771423847", "jobLocation": "Reston_VA", "jobTitle": "Principal, Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.rsa.com", "Headquarters": "Bedford, MA", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "124000", "jobDescription": " Join our team of data scientists to solve challenging problems in the world of Cybersecurity. Ideal candidates will have an understanding of data analysis and machine learning techniques, good security intuition, and the ability to develop proof-of-concept solutions. Hands on experience with a variety of machine learning algorithms, data cleaning and performance measurement and tuning are all required. Candidates should be able to identify opportunities, formulate problems, work with security subject matter experts and other researchers to develop potential solutions and then build those solutions in order to test performance. Strong communication skills and the ability to engage directly with product managers and engineering teams is highly desirable. Role is based out of Bedford, MA. or Reston, VA.Remote possibilities available to qualified candidates.Job DutiesInitiate and lead research projectsEngage with security subject matter experts and key business stakeholders to identify opportunitiesDefine the research problemDetermine the data required to address the problemWork with others in the business to find, ingest and clean the dataUnderstand the data and perform exploratory data analysisWork collaboratively with other researchers and security SMEs to develop relevant featuresWhen necessary, apply machine learning techniques (supervised, unsupervised, deep learning, etc.)Measure solution performance and refineEngage with engineering to transfer solutions into the productQualificationsM.S. in Computer Science or related field and/or 8+ years of hands-on experienceHands-on experience developing ML-based modelsData manipulation and cleaning, ideally leveraging both relational and NoSQL database technologiesPython or R experience requiredStrong understanding of algorithms and statistics necessaryFamiliarity with Apache Spark and other frameworks are beneficial, as is knowledge of graph database technologiesPreferred Security BackgroundAWS/Azure or Cloud Technologies Preferred Dell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Dell here."}