{"jobID": "2751632916", "jobLocation": "San_Francisco_CA", "jobTitle": "Sous Chef", "companyRating": "3.0", "companyInfo": {"Website": "www.guckenheimer.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " We know you like to cook and know that you have the power to change the world by tantalizing taste buds. That's a given. When you apply to this job, we will be able to see on your resume the 4+ years you've spent blowing people’s minds. But, are you also the kind of person that wants to play a critical role in changing the world, one meal at a time? Do you think about how the food you purchase, how it is prepared, the staff that makes it and provide to your guests impacts the environment, communities, and individuals?  If you enjoy working with your team to think out of the box to operationalize a big vision while engaging in meaningful and authentic ways with your clients, then you may be exactly the Sous Chef we are looking for to join our Guckenheimer team.  Perks of the job include: NO WEEKEND OR EVENING WORK. That’s right - only work Monday through FridayAbility to innovate with menu offerings, ingredients, and service stylesWork with cool people who appreciate the importance of your roleGet your grub on!Be in an exciting environment where new ideas are constantly percolating Now that we’ve got you hooked, here is what the ideal candidate would look like: Previous experience in a professional environment is a must (at least 3 years customer service, & 4 years preparation). Culinary school preferredIntimate knowledge about cooking techniques, recipes, and culinary operations. Knowledge of waste management techniques is a plusYou make good food. Like really good. The best.Passion for food and a desire to want to be part of an amazing and unique program. The client’s food program raises the bar for food at work and requires chefs to be partners and thought leaders. You must make a commitment to understanding, adopting, and modeling the client’s food program mission, vision, and values.Ability and a desire to engage with guests in English (if you know any Nadsat, you may get bonus points)Takes pride in their appearance and the appearance of their work areaHave open availability Monday-Friday Click below and think to yourself, “I’m Feeling Lucky.”  Guckenheimer is a national foodservice management company that pioneered restaurant style, healthful dining in the workplace. .Guckenheimer embraces Equal Employment Opportunity.  Guckenheimer participates in the E-Verify Program, as required by law."}