{"jobID": "2798641011", "jobLocation": "Fremont_CA", "jobTitle": "Data Engineer", "companyRating": "2.7", "companyInfo": {"Website": "www.soraa.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Cree, Xicato"}, "estimatedSalary": "132000", "jobDescription": "Job Description:About SoraaSoraa makes premier LED lighting solutions based around crystal-perfect GaN on GaN technology. We are completely vertically integrated and our data warehouse is the glue which ties together manufacturing and production test data. We’re currently running over 15M transactions per week (and expect to double over the next 12 months).ResponsibilitiesThe ideal candidate will help maintain & improve our data warehouse. Suggest and implement processes and systems to ensure that our data warehouse is consistent and up-to-date across all business units. Coordinate data accumulation from a large variety of sources (in-house and worldwide contract manufacturers). Own the integrity and quality of information stored in the data warehouse. Work with data producers to close data gaps in a timely manner. Create & maintain automation and queries as needed to support business units across the organization. Primary MS-SQL (SSIS w/ some python & matlab), but will interact with our MES system (Oracle - Application Express). Use Ignite DBA for performance analysis.  Required Experience:  Qualifications 5+ years as data engineer, DBA, software engineer or similar roleB.S. in Computer Science or related Engineering fieldExpertise in relational databases, data structures and query methodologiesExpertise in creating and maintain automated data pipelines via custom scripts or other workflow systemsExperience in high-tech manufacturing is a plusExperience with heterogeneous server/database environments is a plusExpertise in any of the following is a plus: Microsoft SQL Server 2008+, SQL Server Integration Services (SSIS), Oracle Database 11/12, Oracle Application Express, Postgres, NoSQL, C#, Python, Java, MatlabExperience with deploying and maintaining data analytics and reporting platforms is a plusExperience in Linux operating systems and open source software deployment is a plusSelf-motivated and willing to assume ownership of projectsStrong communication skills (English required; Mandarin is a plus) Keyword: Data Engineer, MS-SQL, Oracle, Ignite DBA  From: Soraa Inc."}