{"jobID": "2826573926", "jobLocation": "Brighton_MI", "jobTitle": "Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.dataspace.com", "Headquarters": "Ann Arbor, MI", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "Do you know ETL? Do you know it really well? Are you interested in working with some of the hottest new ETL tools, like Wherescape and Alteryx? Are you looking for a new challenge in a very cool company?We’re helping a very forward-thinking financial institution locate the person who can make sure the right data is in the right places at the right time. You’ll be the key data manipulation resource and will report directly to the manager of BI / DW. Your efforts will directly affect the success of the company.Is this you? If so, please submit your resume and fill out our questionnaire ASAP!THE WORK: The data engineer will work on implementing complex data projects with a focus on collecting, parsing, managing, analyzing large sets of data to turn information into insights using multiple platforms. In this role you’ll identify where needed data exists, whether it be inside or outside of the organization. You’ll then be responsible for designing and building rock solid ETL applications to access and deliver that data to key business intelligence systems and analytic users. You’ll work hand in hand with business contacts and BI developers to determine what they need and then deliver on those needs. To accomplish this you’ll have to harness some of today’s hottest ETL technologies, including Wherescape and Alteryx.  In this role, the right person will have an unusual opportunity to make a huge impact on a cool, growing company. LOCATION: Silicon Valley in the country! You’ll be working in a beautiful, brand new headquarters in Brighton, Michigan. Brighton is a centrally-located town that’s also only 20 minutes from Ann Arbor (home to the University of Michigan), 30 minutes from Lansing (home to Michigan State University) and 50 minutes from Detroit, a rapidly evolving technology hub.  The company recently built their new headquarters building around open workspaces and the latest technologies. In terms of location, this job has it all: a beautiful work environment, access to major metropolitan centers, and the ability to easily get back to nature when you want. MODE: This is a permanent role REQUIRED: Applicants must be very strong in: ETL tools and techniquesSQLDESIRED: In addition, it would be great if you had some background in: SQL Server and T-SQLData architectureBI toolsWherescapeAlteryxCloud database architecture (especially Azure)Big data / NoSQL data storesThe financial services / credit union industryCOMPENSATION: This organization is not afraid to invest in technology and the skills necessary to harness that technology. Thus, the right candidate for this role will earn a base salary of between $84,000 and $126,000 as well as a generous benefits package. INTERESTED? If you're interested and have the skills, we'd love to hear from you. Please answer our questionnaire and submit your resume right away! Thanks!  U.S. Citizens and all those authorized to permanently work for any employer in the U.S. are encouraged to apply. We are unable to provide visa sponsorship at this time.  NOTE: Dataspace performs background and drug screens on accepted candidates prior to their employment or contract start dates.- provided by Dice  ETL, ETL tools, Wherescape, Alteryx, SQL, Big Data, Azure, SQL Server"}