{"jobID": "2769400190", "jobLocation": "Washington_DC", "jobTitle": "Production Support, Business Analyst (Data Validation)", "companyRating": "3.6", "companyInfo": {"Website": "www.eab.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "About EAB EAB is an education best practices firm that uses a combination of research, technology, and services to improve the performance of 1,200+ educational institutions. Headquartered in Washington, D.C., EAB forges and finds the best new ideas and proven practices from its network of thousands of leaders, then customizes and hardwires them into every level of member organizations, creating enduring value.  At EAB, we serve not only our members but each other—that's why we are always working to make sure our employees love their jobs and are invested in their community. See how we've been recognized for this dedication to our employees by checking out our recent awards.  For more information, visit our Careers page. The Role in BriefBusiness Analyst The Business Analyst is responsible for maintaining the health and integrity of the data in our live sites. The Analyst serves as Tier II or Level 2 support for data-related issues, managing missing files, routine data updates, and working with members to resolve problems or complete change requests. The Analyst works across all products in EAB Technology.  This role is based in Washington, D.C.  Primary Responsibilities:Effectively triage and manage a queue of member production issues post implementationPerform routine data loads and data maintenance of member platformsMaster the data requirements and technical functionality of EAB's SSMS productsCommunicate directly with members in a professional and timely manner to provide a high level of customer satisfactionDevelop creative solutions to accommodate technical challenges faced by the memberProactively identify trends to product and/or process challengesFoster strong relationships with internal teams - engineering, data extraction services, consulting, and developmentBasic Qualifications:Education: Bachelor’s degree1+ years' professional work experienceExperience working with Excel and aptitude to learn advanced Excel functionalityExperience validating large datasetsProven customer service skills with a focus on attention to detailDemonstrated effective oral and written communication skillsDemonstrated analytical reasoning and problem solving abilityProven ability to be able to meet deadlines and work in a fast paced work environmentExhibit a high level of organizational skills and sense of personal accountabilityIdeal Qualifications:Experience troubleshooting SaaS platformsBenefits Consistent with our belief that our employees are our most valuable resource, EAB offers a competitive benefits package: Medical, dental, and vision insurance, dependents eligible401(k) retirement plan with company matchGenerous PTODaytime leave policy for community service or fitness activities (up to 10 hours a month each)Wellness programs including gym discounts and incentives to promote healthy livingDynamic growth opportunities with merit-based promotion philosophyBenefits kick in day one, see the full details here."}