{"jobID": "2822358010", "jobLocation": "Detroit_MI", "jobTitle": "Engineer - Staff", "companyRating": null, "companyInfo": {"Website": "www.dteenergy.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (DTE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Summary:  DTE Electric is undergoing a major technological transformation to improve power grid reliability. We are seeking electrical engineers who will help us plan, design and deploy solutions and technologies that will help deliver higher quality power to our customers. As an Electrical Engineer assigned to this incredible project, you may work within one or more focus areas: substations, sub-transmission, protective relays and control systems, or distribution planning. We look forward to working with highly motivated and team-oriented electrical engineers to energize our efforts of growing economically and environmentally.  As an Engineer-Staff assigned to this project, you will be part of this exciting transformation that will position our power distribution system to support distributed generation and electric vehicle charging that connects with cleaner energy sources like wind power, solar, and natural gas generation. Key Accountabilities:Investigate new electrical technology, material and equipment, with application to safety, electrical system reliability, performance and cost.Render sound engineering decisions - under potential time constraints – with limited supervisory input.Perform assigned (or initiates) engineering studies, proposing solutions to engineering-related problems; develops models and analyzes data to support improvement programs, techniques & solutions; makes or assists in presentations of engineering-related projects to all levels of management & external parties (contractors, customers, etc.)Prepare plans, specifications, work instructions and cost estimates for projects requiring engineering services.Coach/mentor, and provide ongoing constructive feedback to less experienced engineering & technical personnel.Propose, initiate and implement electrical system field and design changes, and performance improvements.Participates in the review and creation of test procedures for new technologies, materials and equipment.May coordinate or play a primary role in a group’s continuous improvement (CI) efforts: designing processes; establishing quality/quantity standards & metrics; collecting, refining, adapting & communicating ‘best practices’; sharing knowledge and developing staff in a systematic fashion. Uses process design outcomes to solve problems.  Minimum: Bachelor’s Degree in Engineering or Engineering Technology and a minimum of 2 years of job relevant experiencePreferred:Bachelor's Electrical EngineeringDistribution Engineering & PlanningSub transmission and Industrial Power Engineering & PlanningRelay Engineering (protective relaying and control)Transmission Engineering & PlanningCYME & PSSE Modeling & Solution Development Other Qualifications Proficiency in Microsoft Office programs, primarily Excel and WordIntermediate analytical and problem-solving skillsStrong time management, prioritization, and organization skillsProficient communication and interpersonal skills Incumbents may engage in all or some combination of the activities and accountabilities, and utilize varying combinations of the competencies cited in this description, depending on the organization and role to which they’re assigned. This description is intended to describe the general nature and level of work being performed by incumbents in this job. It is not intended as an all-inclusive list of accountabilities or responsibilities, nor is it intended to limit the right of any supervisory or management representative to assign, direct and control the work of employees under their supervision."}