{"jobID": "2545850478", "jobLocation": "Arlington_VA", "jobTitle": "Metrics and Data Analytics Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "Clearance Level Must Currently Possess:Public TrustClearance Level Must Be Able to Obtain:No Active Clearance RequiredSuitability:Public TrustJob Family:Information TechnologyJob Description:As the largest pure-play IT services provider serving the U.S. government sector, CSRA is where you can come to be successful. Join a collaborative team, solving customer issues and accessing an array of resources for your success. Take advantage of tremendous opportunities as you help us chart our path to industry leadership, and tap into our collective 90+ year heritage. CSRA represents the coming together – figuratively and literally – of two outstanding companies: the North American Public Sector business of CSC, and SRA. Join us and watch your career take flight. http://csra.com/The Federal Deposit Insurance Corporation (FDIC) mission is to preserve and promote public confidence in the U.S. financial systems by insuring deposits in banks and thrift institutions for up to $250,000; by identifying, monitoring, and addressing risks to the deposit insurance funds; and by limiting the effect on the account and the financial system when a bank or thrift institution fails.CSRA provides the day-to-day operational services to FDIC in support of infrastructure, facilities, hardware, software, and systems. CSRA supports operational security, client support/help desk, data center operations, asset management, and systems engineering service areas.US Citizenship is required. Background Investigation is required; you must have a current clean financial background.This is a 24x7x365 Operations role and requires flexibility to support issues or planned activities after hours and weekends as needed.The successful candidate:Develops, inspects, mines, transforms, and models data to raise productivity, improve decision making, and gain competitive advantage. Conducts statistical analysis on data and information to ensure correct predictive forecasting or classification. Manages all aspects of end-to-end data processing utilizing customized report building functions of systems. Maintains analytical systems, verifies the accuracy of the data, and acts as liaison with business.QUALIFICATIONS: BA or equivalent + 3 yrs related experience, or MA + 1 yr related experience# of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Telecommuting Not AllowedWork Location:USA VA Arlington - 3701 N Fairfax Dr (VAC016)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}