{"jobID": "2797040615", "jobLocation": "Fort_Belvoir_VA", "jobTitle": "Career Program Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "86000", "jobDescription": "Job Number: R0029673Career Program Data ScientistKey Role:Leverage strong technical and analytical expertise to explore and examine data from multiple disparate sources with the goal of consulting on the design of inquiries that can provide a competitive advantage. Address a pressing business problem by discovering patterns and previously hidden insights. Apply a broad domain expertise to comprehend data origins and context to ensure consistency of data, merge data sources together, and help others to gain a better comprehension of data. Basic Qualifications:-5+ years of experience with supporting DoD programs-Knowledge of the analytic techniques to be applied to generate insights from data-Ability to develop or apply mathematical or statistical theory and methods to collect, organize, interpret, and summarize numerical data to provide usable information-Secret clearance-BA or BS degreeAdditional Qualifications:-Experience with Army Information Technology Management Career Program-Experience with supporting Headquarters Department of the Army (HQDA) staff-Experience with at least one of the following processes to address specialized talent needs: defining talent, recruiting talent, placing talent, or developing talent-Knowledge of the human capital processes to hire and develop staff-Knowledge of the human capital life cycle-MA or MS degreeClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}