{"jobID": "2826315300", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.cps.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1883", "Type": " School / School District", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " The Chicago Public Schools (CPS) has set ambitious goals to ensure that every childin every school and every neighborhoodhas access to a world-class learning experience from birth, resulting in graduation from high school college- and career-ready.  The Business Intelligence Analyst is responsible building and maintaining the District's data infrastructure and data integration. This includes ensuring high quality data is integrated both between internal applications as well as with our external partners. Additionally, the Business Intelligence Analyst will be responsible for building and expanding an environment that supports data informed decision making.  The Business Intelligence Analyst will be held accountable for the following responsibilities: Maintain and Manage the existing CPS Enterprise Data Warehouse and ODS builds (SSIS and Ab Initio)Model extensions to the existing Data WarehouseBuilds ETL components according to ETL specifications. Code must address performance, dependency, auditing, error handling and data quality issues.Create Dashboard pages and metrics within CPS custom dashboard solution.Responsible for data integrity as well as the quality of data within Dashboard presentation layer.Support system and user acceptance testing activities, including issue resolution.Complete technical documentation to ensure system is fully documented In order to be successful and achieve the above responsibilities, the Business Intelligence Analyst must possess the following qualifications: Type of Education Required:Bachelor's Degree in Computer Science or related field Type of Experience and Number of Years: Enterprise Data Warehouse experience.2 years of experience with an ETL product (SSIS, Ab Initio) in a development role (administrative knowledge a plus)Strong ANSI SQL expertiseExperience developing SQL Objects, stored procedures, views, functions.Experience with SQL Server 2012Experience with Unix and Shell ScriptingGood knowledge of data modeling/Star SchemaAbility to develop and organize high-quality documentationExperience with at least one job schedulerKnowledge, Skills, and Abilities:Strong written and oral communications skills.Proven ability and initiative to learn and research new concepts, ideas, and technologies quickly.Strong systems/process orientation with demonstrated analytical thinking, organizational skills and problem solving skills.Ability to work in a team-oriented, collaborative environment.Ability to quickly pick up new tools and technologies.Willingness and ability to train and teach others.Ability to facilitate meetings and follow up with resulting action items.Ability to prioritize and execute tasks in a high-pressure environment.Strong presentation and interpersonal skills.Ability to effectively move forward on tasks even with ambiguous or changing requirements.Additional Notes:CPS employees are required to be actual residence of the City of Chicago within six months of beginning employment, and are required to maintain Chicago residency throughout employment.Chicago Public Schools is not currently hiring individuals for this position who now or in the future require sponsorship for employment based non-immigrant and immigrant visas.Chicago Public Schools is an EEO/AA Employer. All qualified individuals, including minorities, females, veterans, and individuals with disabilities, are encouraged to apply. '194642SDL2017"}