{"jobID": "2803185905", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.tapjoy.com", "Headquarters": "San Francisco, CA", "Size": "Unknown", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " FLURRY, Chartboost"}, "estimatedSalary": "145000", "jobDescription": " Join the Mobile Future with Tapjoy  Tapjoy is a creative workplace, comprised of people with different backgrounds, cultures, skill sets, and global perspectives. With offices all over the globe, Tapjoy provides mobile engagement and monetization services for leading advertisers and app developers. Advertisers rely on Tapjoy's diverse suite of rewarded Interplay ads including video and rich media to impact performance. Developers utilize our technology and mobile expertise to acquire and monetize users. The Tapjoy SDK is currently embedded in over 20,000 mobile apps, reaching 620 million monthly active users. Additionally, Tapjoy works with Fortune 500 brands and the Top 200 grossing app developers.  Here at Tapjoy, we promote a Joyful, Engaged, Trustworthy, and Innovative workplace with our company core values, and regularly celebrate and recognize the people who embody our values. Tapjoy believes its people are its greatest investments and we take extra care to support your time inside and outside of work with a multitude of benefits. In order to maintain what makes us so special here, we are committed to continued education and involvement in our community to protect and expand our one-of-a-kind workplace. Position Title: Data ScientistPosition Description/Responsibilities: Tapjoy is seeking a Data Scientist. Essential duties and responsibilities may include, but are not limited to, the following as additional roles and/or focus will be needed as the company and department continues to grow and evolve:  • Build a data/stats-driven ad optimization system, working closely with the product team  • Constantly experiment and improve the relevancy of the recommendation/ad optimization system  • Invent and improve algorithms given a set of business cases and help implement them in production  • Work with the product/engineering team to implement, test and deploy the solution on Hadoop cluster Core Competencies include: • Passionate about building data science product  • Great Communicator about complex algorithmic works as easy-to-understand story telling  • Self-Starter about game-changing algorithms and motivated to test at billions scaled data Requirements: • B.S./M.S., in Computer Science, Statistics or similar applied technical field  • Must be hands-on statistics-related industry projects  • Solid object-oriented programming skill (Java) and at least one scripting language such as Python/Ruby/Perl  • Ability to work in a fast paced, test-driven collaborative and iterative programming environment  • Understand major machine learning algorithms (Random Forest, Logistic Regression, Boosting method, Neural Network)  • Strong understanding of Algorithms, Data Structures and Data Mining  • Understanding of RDBMS, SQL and NoSQL alternatives  • Experience with Hadoop/Hbase/Pig or MapReduce/Mahout/Bigtable is a plus  Tapjoy is a one-of-a-kind workplace, comprised of people with different backgrounds, cultures, skill sets and global perspectives. In order to maintain what makes us so special here, we support work-life balance both inside and outside the office in many ways.  If you want to learn about building an amazing team with industry-leading technology, you want to surround yourself with brilliant, passionate entrepreneurial teammates at Tapjoy.  Tapjoy is an equal opportunity employer. We believe that diversity and inclusion lead to stronger, more innovative teams and better business results; we want to draw from the broadest talent pool possible and encourage qualified applicants. Tapjoy does not discriminate on the basis of sex, race, ethnicity, color, age, sexual orientation, gender (including identity and expression), disability (mental or physical), religion, national origin, citizenship, marital status, military or veteran status, or any other protected classification protected by applicable law; we will provide reasonable accommodations for qualified individuals with disabilities, and pursuant to applicable fair chance ordinances, we will consider for employment qualified applicants with arrest and conviction records.  For more information, please visit www.tapjoy.com."}