{"jobID": "2735441605", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Developer - Retail", "companyRating": null, "companyInfo": {"Website": "www.ugamsolutions.com", "Headquarters": "Mumbai, India", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Designation Sr Consultant Location California, US  Education B.E.B. Tech, Master in Information Technology, Master of Business Administration,  Key Skills R, SAS, SQL, Web Analytics, Data Science, Big Data Analytics, Predictive Analytics  Experience 4 to 8 Year(s) Job DescriptionProfile Description: This person’s key responsibility will be to work with clients to provide consulting by analyzing key business problems, infer results and generating meaningful insights. Key Responsibilities: · Understand the business of Ugam and client needs in specific  · Work with clients to understand their business problems and help articulate the problem with an analytics framework  · Work with offshore team to structure solutions based on analytics tools and techniques  · Design analytical plans and processes and leverages google analytics reporting tools to analyze data  · Design statistical tests and design of experiments  · Data processing for and execution of the analytical plan  · Communication of analytical output to client senior management through reporting, dashboards and modelling  · Provide brand insights and recommendations that have tangible business impacts  · Build relationships with clients to understand their business, and to enable them to better  · understand how to use analytics to drive their business  · Build and demonstrate capabilities to execute deliverables end-to-end including last mile  · to delivery with minimal hand-holding  · Successfully deliver pilot projects  · Support in pre-sales when needed with high-quality, well-organized presentations and reports  · Meet and exceed client expectations with high quality, timely deliveries.  · Ensure there is process improvement / automation to increase efficiency  · Adhere to procedures like communication protocols, operational practices / procedures,  · Information security practices, attendance procedures, etc.  · Participate and actively contribute in review meetings KNOWLEDGE Qualification:  BE/B.Tech , Masters / Bachelors in Statistics, Economics, Operations Research. This position requires a minimum of Bachelor’s degree in any Engineering.  Advanced degree in a quantitative discipline, preferably, Mathematics/Statistics Relevant experience: · 3 to 5 years of relevant experience in Business Analytics (preferably in the Retail domain).  · At least 2+ years hands on experience on modelling and deploying analytics solutions with clients  · At least 2+ years of exposure to Retail and/or Consumer Brands would be preferred  · Ability to apply first principles and structure approaches to problem solving as opposed to relying excessively on past domain expertise alone."}