{"jobID": "2837883448", "jobLocation": "San_Diego_CA", "jobTitle": "Clinical Lab Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "46", "jobDescription": " Performs pre-analytical, analytical and post-analytical phase testing of all complexities as defined by Clinical Laboratory Improvement Act/Amendment (CLIA) to include specialized tests and analysis in one or more areas of clinical laboratory such as Hematology, Microbiology, Clinical Chemistry, Urinalysis, Immunohematology, Serology, Parasitology and chemical and morphological examinations to obtain data for use in diagnosis and recording laboratory test results. Analysis of test results are performed on the population serviced (e.g., neonatal, pediatric, adolescent, adult, geriatric clients). Note: FOR CLS WORKING AT THE RRL, SEE ADDITIONAL REQUIREMENTS SPECIFIED IN THE MINIMUM REQUIREMENT SECTION. Essential Responsibilities: Upholds Kaiser Permanente's Policies and Procedures, Principles of Responsibilities and applicable state, federal and local laws.  Provides the highest level of patient care as defined by established standards and maintains confidentiality on all tests performed by the laboratory.  Performs and reports test results for all clinical laboratory procedures as assigned, both automated and manual, in the clinical laboratory department, without immediate review by the director, consultant, or supervisory team.  Demonstrates proficiency, competency and understanding of fundamental principles of clinical laboratory procedures with minimal amount of supervision.  Monitors and is accountable for test data, quality control, quality assurance, preventive maintenance, proficiency testing and all operations related to laboratory testing procedures.  Notifies Supervisory team of any irregularities of factors, which may influence test results.  Ability to troubleshoot equipment and test methods.  Identifies and resolves unusual laboratory situations and notifies appropriate parties within shift.  Consults with physicians, nurses, pharmacists, etc. on the technical aspects of methodologies used, appropriateness of test utilization and interpretation of patient results.  Instructs new employees and/or Clinical Laboratory Scientist students in laboratory procedures within area the CLS assigned, in order that they may develop proficiency and understanding of the clinical laboratory methodology.  Provides training, guidance and pertinent technical information to Laboratory Assistants, support staff, clerks, CLS students and Medical Center personnel.  Discusses clinical laboratory problems of mutual interest with the Supervisory team, and lead technologist in order to develop a better communication link within the department.  Participates in work groups to work through problems, issues or goals of the department.  Assists in evaluating new tests procedures when requested and communicates to the Supervisory team the possibilities for their implementation.  Meets states requirements for mandatory CEUs.  As defined by established standards, works in a professional, cooperative and courteous manner.  Observes all laboratory, Kaiser Permanente and regulatory agency policies and procedures.  Maintains overall safety (including chemical and biological) of the department in accordance with established safety, infection control and procedure protocols.  Monitors supplies and reagents and notifies appropriate parties of par levels.  As necessary and appropriate, may perform any clerical or other duties of support staff/laboratory assistants that may be assigned such as performing phlebotomy on inpatients and outpatients.  Accepts responsibility of assisting in work areas not primarily his/her own.  Operates computerized laboratory data systems/applications.  Participates in direct patient care by providing the patient with information to enhance the understanding of laboratory test, instructing the patient on specimen requirements and conditions for specialized testing and collecting from the patient samples to include blood, body fluids, secretions, and tissues for analysis. Basic Qualifications: Experience  N/A. Education High School Education or General Education Development (GED) required.  License, Certification, Registration  A current and valid California State Clinical Laboratory Scientist License (CLS). Additional Requirements: Ability to demonstrate knowledge of and to utilize the principles, theories, practices, methodologies and techniques required of a Clinical Laboratory Scientist.  NOTE: ADDITIONAL REQUIREMENTS FOR REGIONAL REFERENCE LABS (RRL):  Function competently as a Licensed Clinical Laboratory Scientist in a high volume Laboratory demonstrating knowledge of principles, theories, practices, techniques. Must have Good communication skills and able to solve problems. And, as appropriate for the department/specialty, within the last three (3) years, at least six (6) months experience:  Note: CLS students' one (1) year internship can be considered meeting the experience requirement below.  Experience in automated instrumentation; knowledge testing principles; molecular based procedures; QC protocols; knowledge in autoverification, EIA, chemiluminence and IFA platforms;knowledge of method validations, and hematology validation, QC and calibration, manual diff count. (CORE LAB, inlcudes AUTO CHEM, IMMUNOLOGY, HEMATOLOGY).  Experience and knowledge in using high complex methods employing electrophoresis,chromatography, and mass spectrometry, and Special Coagulation (SPECIAL CHEMISTRY, SPECIAL COAGULATION, BIOCHEMICAL GENETICS).  Read, interpret, work-up and report culture results for all areas of Aerobic and Anaerobic Bacteriology; proficient in reading and interpreting stained smears; knowledge and ability to set-up and report automated/molecular identification and susceptibility testing and interpret results (BACTERIOLOGY).  NOTE: ADDITIONAL REQUIREMENTS FOR REGIONAL FLOW CYTOMETRY (LOS ANGELES):  One year recent experience in Flow Cytometry analysis such as leukemia / lymphoma phenotyping, paroxysmal nocturnal hemoglobinuria, T cell subset enumeration, DNA cell cycle analysis and cytochemical staining.  A Clinical Laboratory Scientist with a limited license will only qualify for a CLS position within their specialty and only applicable in the following departments at the Regional Reference Laboratories: Chemistry limited license qualifies for Automated Chemistry or Esoteric Chemistry CLS positions; Toxicology limited license qualifies for Esoteric Chemistry CLS positions; Immunology limited license qualifies for Molecular or Immunology CLS positions; Microbiology limited license qualifies for Bacteriology, Molecular or Immunology CLS positions; Hematology limited license qualifies for Hematology and Special Coagulation. Preferred Qualifications: One (1) year recent experience as a CLS. Notes: Per Diem Clinical Laboratory Scientist, mostly dayshift with variable hours and locations including Zion and San Diego Medical Centers, and Urgent Care clinics.  May be required to work every other weekend and variable weekdays. "}