{"jobID": "2802102511", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist with Freddie Mac", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Chicago Interviews but with Freddie Mac  ChicagoInterviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description As the lead Data Scientist in Analytics Enablement this position will provide technical leadership across multiple corporate critical analytic initiatives directly tied to the enterprise Critical Initiative on Data and Analytics, many of these programs will run in parallel. The role will start off providing support to four programs: EID (Emerging Issue Detection), MAI (Manufacturing Analytic and Insights), Parts Pricing Optimization and Inventory Optimization. These current projects impact all divisions and hit many business functions including Parts, Customer and Product Support, Quality, Manufacturing, Supply Management, Engineering, and Information Technology.  What Skills You Need  5+ years of experience in conducting statistical analysis and building models in an advanced scripting language such as R or Python  5+ years of experience in solving business problems and realization of optimizations and savings with advanced analytical solutions  Demonstrated transformational consulting experience in garnering alignment by advocating potential benefits of advanced analytics and operational research with the ability to present highly technical information to business units not versed in such technicalities  5+ years of experience in classical and modern operations research methods as well as tools such as Lindo, GUROBI, CPLEX  Ability and willingness to travel up to 25%  What Makes You Stand Out  Other areas of experience or interest that will help us place you on the right team include:  2+ years of experience in defining Solution Architecture  1+ years of experience developing solutions within the AWS cloud  2+ years of demonstrated ability in application programing using languages such as Java Script, Java, Scale etc.  Demonstrated ability and desire to learn new techniques in the field of data and analytics, potentially leading to a relevant Advanced Degree  Experience in development of Expert systems  Experience performing projects using the Agile methodology  Good working knowledge of all Deere product lines and the types of data available for each having worked in more than 1 division  Basic knowledge of the internal manufacturing processes as well as the Marketing and Customer Support processes Education ​Ideally, you will have a degree or equivalent work experience in the following:  Degree in a relevant study area is required (e.g. computer science, mathematics, statistics, business analytics).  Apply"}