{"jobID": "2791247072", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Infrastructure Engineer", "companyRating": null, "companyInfo": {"Website": "www.edo.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Who We AreEDO is a data science software firm that develops analytics tools to make data accessible and actionable for the media and entertainment industry. Currently focused on film and TV, we work with many major movie studios and TV networks to help them forecast, market and distribute their content more effectively. We are growing into other verticals with a heavy focus on autos. We are a team of world-class engineers and data scientists backed by top leaders in entertainment and technology. Our co-founders and executive leadership have a strong track record with other successful ventures. What You Will DoData is at the heart of what we do as a company. You will be critical to the generation and delivery of our data. In particular: Architect our infrastructure and data pipeline to meet scaling needs Select the best data technologies and tools for each use case Own the development and deployment of our data infrastructure Collaborate with other team members and foster a culture of creativity and technical excellence in our engineering team Support the overall Software Engineering team to resolve any issues they encounter What We Are Looking For Experience building data pipelines at scale (ideally 6+ years) Experience choosing the right data infrastructure and tuning by workload Experience working with Spark, Hadoop, Kafka, NoSQL, or similar technologies Experience with managing infrastructure Self-driven individuals who take ownership of their work Strong understanding of software engineering practices and principles Interpersonal and communication skills to work on a small team Willingness to learn about our clients and their unique problems Benefits Early-stage equity and competitive salary Medical, dental, and vision insurance Meals and snacks during work Movie tickets, fitness discounts, commuter subsidies, and Apple hardware"}