{"jobID": "2799474551", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Patient Support Lead", "companyRating": null, "companyInfo": {"Website": "www.gbt.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Public (GBT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "PATIENT SUPPORT LEADPosition Summary:Global Blood Therapeutics is seeking a seasoned leader to oversee our Commercial Patient Support Program. The Patient Support Lead will report to the VP of Commercial Planning. The successful candidate will work across the organization in this highly visible position to design and manage Voxelotors US commercial patient support. The successful candidate must be able to operate in a fast-paced organization, with high expectations and accountability on quality and timing of the deliverables.The Patient Support Lead will operationalize Voxelotors US commercial patient support program by aligning with GBT values, assessing patient support needs, defining objectives and measurements, and executing programs, including reimbursement hub, co-pay, and any additional support programs. This individual also will be responsible for sourcing and managing vendor contracts, and overseeing project budgets. She/He will work closely with several departments including but not limited to US Marketing, Sales, Market Access, Commercial Operations, Community Engagement & Partnership, Regulatory, Legal, Compliance, and external customers. This is an excellent opportunity to join a high performing team committed to making a difference in the lives of individuals living with sickle cell disease.Essential Duties and Responsibilities:Lead the development and management of Voxelotors US commercial patient support and co-pay programs and ensure alignment with patient needs and GBTs company valuesDevelop and maintain SOPs and business rules related to US patient supportLead the design and implementation of a patient support HUBHire and onboard an industry leading of patient navigators.Manage strategic advisors and vendors in support of the operation, including vendor selection contracts, SOPs, reporting requirements, and budgetsSupport Access and Reimbursement field team needs with strong communication to effectively address their needsDefine measurement of patient support program performanceManage relationship with Commercial Operations to ensure accurate and efficient reporting on key metricsWork cross-functionally, as well as with compliance and legal departments, to ensure all training responsibilities, policies, and procedures are metManage daily operations of the service model and identifies areas for process improvementQualifications:The successful candidate must possess a minimum of 10-15 years experience in the pharmaceutical/biopharmaceutical industry. Candidates must have the proven ability to provide strategic leadership, vision and direction within a fast moving, challenging and energetic corporate environment. It is critical that candidate understand how to leverage and optimize partnerships with other functions including marketing, sales, market access, community engagement and partnership, legal, and regulatory. He/She should have patient support program experience, ideally having built and managed a US patient support program during a new product launch for a specialty pharmacy oral product.Bachelors degree, MBA or other advanced degree preferred, and a minimum of 10 years of experience in patient support, US in-line market access, or marketing in the Pharmaceutical/Biotechnology industry.In depth knowledge of pharmaceutical manufacturer compliance requirements, HIPAA regulationsKnowledge and experience in Medicare Part D, Medicaid and private payer policies, reimbursement process, Foundations and specialty pharmacyNew product launch experience with a specialty pharmacy productExperience leading and influencing large cross-functional teamsExperience managing customer facing vendorsExcellent leadership skills and the ability to inspire, coach, motivate and hold themselves and others accountableStrong communication skills, both written and verbalEntrepreneurial spirit, the ability to foster relationships, and the ability to develop innovative ideas and solutions.Excellent project management and prioritization skillDemonstrated ability to manage multiple projects within specified timelines, budgetary and quality standardsMay require up to 30% travel based on business needFit with GBT culture:Ability to build strong relationships with co-workers of various backgrounds and expertiseAbility to function at a high level in a team setting whether leading the group or acting as an individual contributorValues-based leadership consistent with GBT's Core ValuesExcitement about the vision and mission of GBTFlexibilityIntegrityNOTE: This position summary is not intended to be all-inclusive. Employee may perform other related duties as negotiated to meet the ongoing needs of the organization.Global Blood Therapeutics is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, protected veteran status, or disability status, or any other characteristic protected by law."}