{"jobID": "2837685783", "jobLocation": "Los_Angeles_CA", "jobTitle": "Model Risk Quantitative Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.mufg.jp", "Headquarters": "CHIYODA-KU, Japan", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (MTU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "124000", "jobDescription": "MUFG Union Bank, N.A. seeks a Model Risk Quantitative Analyst for its Los Angeles, CA location responsible for supporting best-practice model risk assessment activities consistent with the Bank's Model Governance Program; and ensuring business processes related to models are in compliance with applicable governance and policy requirements; Performing model development and statistical analysis (time series modeling) including macroeconomic indicators; programming with statistical programming language R and SAS; and performing data analytics using Excel and Bloomberg Excel API; Performing model risk activities which include model validation including assessing model conceptual soundness, evaluating model assumptions and data integrity, testing model numerical, statistical and computational accuracy, performing outcomes analysis, and reviewing model governance and control process; Overseeing financial reporting, pricing, risk management, decision-making, and economic capital estimation models used within various Business units of the Bank; Documenting and presenting observations to the Model Risk Management Unit (MRMU) team and to model owners and users; Authoring validation reports that describe validation testing activities and results; Recommending model risk management action plans, and tracking remediation progress; and Monitoring model performance reports on an ongoing basis to ensure models remain valid.Education: Master's Degree Financial Engineering (or foreign equivalent degree).Experience: 2 years of experience in the financial services industry performing quantitative model development and statistical analysis (time series modeling) including macroeconomic indicators; programming with statistical programming language R and SAS; and data analytics using Excel and Bloomberg Excel API.Other: Position requires Financial Risk Manager (FRM) certification.Location: 445 S. Figueroa Street, Los Angeles, CA 90071The above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities duties and skills required of personnel so classified.  We are proud to be an Equal Opportunity / Affirmative Action Employer and committed to leveraging the diverse backgrounds, perspectives, and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate in employment decisions on the basis of any protected category.  A conviction is not an absolute bar to employment. Factors such as the age of the offense, evidence of rehabilitation, seriousness of violation, and job relatedness are considered in all employment decisions. Additionally, it's the bank's policy to only inquire into a candidate's criminal history after an offer has been made. Federal law prohibits banks from employing individuals who have been convicted of, or received a pretrial diversion for, certain offenses."}