{"jobID": "2738243083", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist", "companyRating": "4.9", "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "138000", "jobDescription": " 23andMe is seeking an experienced data scientist to join our Analytics team. We're looking for someone with excellent analytical skills and a great track record applying them to improve the consumer experience. Who we are Since 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding. What youll doEngagement and growth: our goal is to provide a high-value, dynamic experience that delights our customers. You will play a key role by analyzing customer behavior, designing experiments, and helping our team build awesome, data-driven products.Marketing analytics and attribution: what is the optimal way to allocate spend across various customer acquisition channels? How do we measure the effectiveness of non-digital channels like TV and radio?General data science: the Analytics team at 23andMe is highly cross-functional and works with groups across the company to help solve problems in a rigorous, data-driven way. Example applications include forecasting, web analytics, and data visualization.What youll bring5+ years of industry work experience in a Data Scientist or equivalent roleM.S. in statistics, engineering or computer science, or equivalent work experienceSkilled in R, Python, and SQL. Google Analytics and AWS are a plusSelf-starter; reliable team player with strong initiative and the ability to thrive in a high-intensity, rapidly changing environmentExcellent communication skills; this role requires regular interaction with team leads from each part of the companyStrong applied statistics and data visualization skillsAn online sample of your analytical and/or data visualization abilities is greatly appreciatedAbout Us 23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.  At 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.  Please note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}