{"jobID": "2751268919", "jobLocation": "Benton_Harbor_MI", "jobTitle": "GIS Data Engineer - Lead Analyst, Information Systems", "companyRating": null, "companyInfo": {"Website": "www.whirlpoolcorp.com", "Headquarters": "Benton Harbor, MI", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (WHR) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requisition ID: 17041  Job Function: Information Systems (40000064)     GIS Data Engineer    Currently, we are seeking qualified candidates for a GIS Data Engineer to join the Whirlpool GIS Data Services team.    Function Overview: The GIS Data Engineer will work to provide process and technical solutions focused on Data Integration Services to prepare dataset for modeling and analytics by data profiling, cleansing transforming and linking methodologies. The Data Engineer is responsible for understanding the data from how it is created, stored and managed. They will directly work with the Business Engagement and Advanced Analytics organizations all part of Whirlpool Analytics Organization  This position will work closely with Whirlpool's Global Information Systems teams (Business Engagement and Advanced Analytics ), including various business functions, and third party organizations to implement core solutions, as well as ensure systems are running smoothly without disruption to business operations. The primary responsibilities will focus on acquire data and preparing it for Analytics. Our data scientists, insights and strategists count on Data Engineers to verify the reliability and effectiveness of the data as well as identify gaps and issues. Our Data Engineers know that they have been successful when they are able to deliver a cleaned and linked data set and provide the required documentation to awaiting team members.    Job Responsibilities:Acquire, transform and store data for analytics use and supply appropriate documentation for team use.Perform data profiling tasks (query, mining, etc.) to determine risks to proposed analytics solution based on quality of, and anomalies within, existing data sources.Interface internally and externally to understand business rules and identify gaps across data definitions. Perform data cleaning and table joins using knowledge of the client’s business rules.Participate in Engineering and Product Delivery to facilitate knowledge transfer and clarification of business rules and data flow.Create source to target maps, data audit, or other reference documents and deliver as input into next workflow. Data dictionaries will have concise, consistent, and unambiguous definitions.Recommend and implement enhancements that standardize and streamline processes, assure data quality and reliability, and reduce processing time to meet client expectations.Communicate progress and completion to project team. Escalate roadblocks that may impact delivery schedule.Actively participate in Quality Assurance procedures.Create hourly, daily, weekly, or monthly automated processes built on proven and completed work.Follow company policy and procedures which protect sensitive data and maintain compliance with established security standards and best practices.Support MOB: normal incident management, integration and regression testing, and ad hoc requests/enhancements processesRefinement of current documentation and processes This individual should be a person of unquestionable integrity and a team player who has a proven track record of winning the confidence and trust of colleagues. This person should be a creative thinker with a passion and curiosity for technology, and a sincere drive to create value. Effective communication with a wide variety of audiences is critical to success. A strong understanding and Familiar with various data management methodologies, data exploration techniques, data quality assurance practices, and data discovery / visualization tools. Knowledge and experience with project management and Agile methodologies are strongly recommended.    Required QualificationsBachelor's degree (Computer Science, Computer Engineering)3+ years of Data Engineer relevant work experience3+ years of experience working with relational database structures, SQL and/or flat files and performing table joins, web crawling, , web development and Hana.Proficiency in one or more of the following programming languages: PHP, Java, or Python and a familiarity with Node.js   Preferred QualificationsSuperior oral and written communication skillsSuperior analytical and problem-solving skillsAbility to lead by influence project team members and stakeholdersAbility to prioritize and manage responsibilities and commitments concurrentlyA self-starter with the ability to work independentlyAbility to navigate and drive clarity and decisions in areas of ambiguityRSRWH"}