{"jobID": "2756282928", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.uplift.com", "Headquarters": "Menlo Park, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Want to help millions of people turn their travel dreams into reality? Want to join a team of talented travel technologists, digital marketers and fintech experts? Want to grow your skillset as an engineer and become a better systems designer and builder? Play a critical role in building UpLift’s core platform and ultimately the success of the company, while working with a small and strong technical team, owning major feature areas of the codebase.  At UpLift, you’ll: Design, build and maintain data pipelines in multi-cloud infrastructure (AWS and GCP)Design and develop big data processing systems optimized for scaling (Apache Spark)Develop and maintain real time data pipelinesBuild software libraries, tools, serverless applications and workflows (Clojure, Java, Python)Design mission critical dashboards and reports using BI toolsInternal process improvements such as automating manual processes, alerting systems, tooling, devopsCollaborate closely with product teams to build tools, frameworks, reports to run experiments, analyze AB test resultsWork with analysts and data scientists to extract actionable insights from data that shape the direction of the companyActively engage in design and code reviews - learn from your peers and teach your peersLead initiatives to research, analyze and propose new technologies and tooling for our stackRequirements You have: 3 years of software development or data engineering experienceExperience with Big Data, ETL and data modelingAbility to work effectively in a fast-paced, occasionally interrupt-driven environment that includes geographically spread teams and customersExperience in developing and operating high-volume, high-availability environmentsPrevious experience with Linux, AWS, Docker and KubernetesSolid coder with Java, Clojure, Python, BashAbility to align with rapid business changes: new requirements, evolving goals and strategies and technological advancementsBA/BS degree in Engineering, CS, or equivalentAre smart, ambitious, self-motivated, curious, quick learner and adaptableBenefitsHealth and Dental Insurance CoveredEquity and 401k offeredEasy commute across from Menlo Park train stationFree lunch, everyday"}