{"jobID": "2625837617", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist III", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "Updated: October 5, 2017Job ID: 213290Status: Full-TimeRegular/Temporary: RegularLocation: San Antonio, TX, United StatesCome Work at HJF! The Henry M. Jackson Foundation (HJF) is looking for a Research Scientist IIIto support research and program objectives at the Naval Medical Research Unit ‐ San Antonio (NAMRU‐SA). HJF provides scientific, technical and programmatic support services to NAMRU-SA at Fort Sam Houston, TX. ESSENTIAL JOB DUTIES: Provide expertise in development and conduction of protocol-driven scientific research addressing various aspect of military medicine, including, but not limited to: hemorrhage and resuscitation, immunomodulation, biomedical systems, and bioassay development. Provide supervision and guidance to junior scientist contract personnel in writing protocol-driven research proposals, animal use protocols, human use protocols, technical reports, final reports, and peer-reviewed manuscripts. Provide guidance to junior scientist contract personnel on the evaluation of data sets (provided by the government and collected by the contractor); development of presentation materials, writing of research Standard Operating Procedures, and presenting findings at technical and professional meetings. Supervise contract personnel during the preparation of experimental subjects and aid in the training and the development of experimental subjects for experimental procedures in accordance with approved animal or human use protocols. Provide support in the development and establishment of in vivo and in vitro model systems, data acquisition, and data analysis. Serve as an advisor to contract personnel.Minimum Education/Training Requirements: Ph.D. in related scientific discipline or M.D. with a minimum of 6 to 10 years of experience of related research experienceThe Henry M. Jackson Foundation for the Advancement of Military Medicine, Inc. (HJF) is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or other status protected by law. Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Director of Human Resources."}