{"jobID": "2821200844", "jobLocation": "Arlington_VA", "jobTitle": "Customer Support Engineer (Mid to Senior)", "companyRating": null, "companyInfo": {"Website": "www.kinetica.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionWhen extreme data requires companies to act with unprecedented agility, Kinetica powers business in motion. Kinetica is the instant insight engine for the Extreme Data Economy. Across healthcare, energy, telecommunications, retail, and financial services, enterprises utilizing new technologies like connected devices, wearables, mobility, robotics, and more can leverage Kinetica for machine learning, deep learning, and advanced location-based analytics that are powering new services. Kineticas accelerated parallel computing brings thousands of GPU cores to address the unpredictability and complexity that result from extreme data.  For more information and trial downloads, visit kinetica.com or follow us on LinkedIn and Twitter.Job DescriptionFortune 500 companies use Kinetica&apos;s cutting-edge technology to simultaneously ingest, explore, analyze and visualize data within milliseconds to make critical decisions and find efficiencies, lower cost, generate new revenue, and improve customer experience.  We are looking for a Customer Support Engineer who will triage and troubleshoot highly complex enterprise customer issues, and serve as an escalation point for our engineering team to support Kinetica&apos;s Enterprise offerings. Reporting to the Manager of Customer Support, the support engineer will be in charge of the case lifecycle from assignment until closure, always ensuring the highest customer satisfaction. Responsibilities:Provide best in class enterprise level customer support to Kinetica Enterprise customersWork closely with Product and Engineering teams to manage customer escalationsAssist with improving Kinetica on-line Knowledge BaseProvide pre and post-sales technical support working with field teams to ensure customer successFind creative solutions to challenging and complex problems through analytical and highly technical troubleshooting skillsDedicated and flexible schedule - availability to sometimes work on weekends as required for On-Call RotationQualificationsBS or MS Technical DegreeSolid communicator (verbal and written)Strong database and SQL skillsStrong understanding of Unix/Linux2+ years software development in any of the following languages: Python, Java, Javascript, C# or C++Strong understanding of Data structures and AlgorithmsMachine Learning understanding (preferred)Highly energic self-starter with a passion for data, attention to detail, and ability to work in a fast-paced environment with limited directionAbility to work different shifts to support customers in various time zones Additional InformationAll your information will be kept confidential according to EEO guidelines."}