{"jobID": "2802148242", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.redditinc.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "190000", "jobDescription": " \"The front page of the internet,\" Reddit brings over 330 million people together each month through their common interests, inviting them to share, vote, comment, and create across thousands of communities. Come for the cats, stay for the empathy.  As a Data Scientist youll be integral in shaping, steering and evaluating strategic, operational and engineering decisions at Reddit. Youll responsible for developing and communicating transformative strategies and data insights to drive growth at Reddit.  Our Data Scientists work to answer the biggest and most exciting questions at Reddit with a passion for strategic product decisions coupled with the application of exacting statistical analysis. We solve complex problems with a combination of drive and pragmatism with a view to delivering actionable insights across the entire company.  Youll get to directly see the impact of your work on hundreds of millions of users around the world.  Responsibilities:Partner with product to create a smoother experience for users to increase retention and engagement.Identify, analyze and recommend the growth levers most critical to Reddit.Proactively design and execute in-depth exploratory analysis to shape the product development and future roadmap.Develop, operationalize, communicate and evaluate success metrics for existing and new product strategies.Collaborate with stakeholders to synthesize experiment results, qualitative research and quantitative research into actionable next steps.Lead the development and adoption of predictive models to aid decision making.Present findings to leadership to drive roadmap decisions.Take responsibility for turning data into understanding by being active, insightful, educational and supportive in every conversation about data.Qualifications:5+ years working in quantitative analytics and data modeling field at a consumer internet company (2-3+ years with quantitative Ph.D experience).Experience with predictive, descriptive and machine-learning based modeling.Ability to synthesize data from a variety of sources (models, descriptive analysis and strategic goals) into concrete next steps for stakeholders involved.Experience in data extraction (Hive, SQL), data manipulation (Python, R, Scala) and advanced statistical experience (R, Scipy, Pandas).Skilled in explaining complex analytical concepts to non-experts and influencing decision makers.Bring a combination of passion, grit, and quality to all undertakings."}