{"jobID": "2764146396", "jobLocation": "Paramus_NJ", "jobTitle": "Accounts Payable Specialist/Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.care-one.com", "Headquarters": "Fort Lee, NJ", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Atrium Health & Senior Living, Brandywine Senior Living, Meridian Care and Rehabilitation Center"}, "estimatedSalary": "44000", "jobDescription": " OverviewBalance Life & Work with a New Career Opportunity Assisted Living FacilityParamus, NJCareOne Harmony Village at Paramus The CareOne Harmony Village at Paramus mission is to define excellence within the health care community. We are dedicated to Maximizing Patient Outcomes. We treat Residents, their families and each other with respect, dignity and compassion. Through a collaborative and consultative approach, we strive to provide a framework of strength and stability for our Centers and Communities. We work to maintain the highest standards of care and service for Residents, families and our valued employees.  We are proud to Offer: Competitive SalaryComprehensive Healthcare Benefits401k Retirement PlanPaid Time OffOpportunities to advance and grow your careerAnd More! If working with people who are dedicated, compassionate, and concerned about their patients is essential to you, then you'll appreciate being a part of our team. We've built a strong reputation on the outstanding level of care that we provide. We have a graciously appointed facility with strong belief in patient care and service; join us at our beautiful facility!  We are an Equal Opportunity Employer  EEO/AA/M/F/DVResponsibilitiesAccounts Payable Specialist/Data Analyst Essential Duties and Responsibilities Processing payments based on approvals and vendor terms for assigned centersprocessing payments for vendors using DSSIEntering invoices for payments for assigned centersFiling correspondence for assigned centersEntering Suppliers into Oracleprocessing 1099’s based on supplier entriesKeep in contact with the centers accounts payableRunning payment reportsresearching vendor payments to resolve issues QualificationsEducation:  High School  Accounts Payable Experience  Oracle knowledge  INDC1Shift1st"}