{"jobID": "2814895058", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Senior Data Analyst with SAP HANA", "companyRating": "3.9", "companyInfo": {"Website": "www.alphaconsulting.com", "Headquarters": "East Brunswick, NJ", "Size": "201 to 500 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " The Judge Group, Randstad, Kforce"}, "estimatedSalary": "90000", "jobDescription": "SENIOR DATA ANALYST WITH SAP HANANEW BRUNSWICK, NJ Required Skills: SAP HANA is a MUST.  5+ years of hands-on experience with data analytics, modeling platforms, data manipulation software and visualization tools (e.g. Advanced SQL, Oracle PL/SQL, R, Python, SAP HANA, Spotfire, Tableau, Microsoft Suite, Hadoop, Redshift, Business Intelligence / OLAP).  BA/BS required (quantitative area of study).  MSci, MEng or other Masters in quantitative area of study Preferred.  5+ year's hands-on working in the area of agile data analytics, data integration, reporting, simulation and statistical modeling.  Significant experience working in the manufacturing and product development space.  Experience interpreting analytical results and ascertaining implications to the business.  Proven experience operating successfully in a complex organizational environment.  Experience interacting with senior management and business stakeholders understanding, anticipating, and fulfilling their insight/analytical information requirements.  Strong creative problem solving skills to answer key business questions.  Rapidly draws inferences from disparate pieces of data, identify key findings and link to implications and provide recommendations.  Strong interpersonal skills with the ability to work with diverse teams across organizational lines and structures.  Strong project management skills with demonstrated ability to handle multiple projects and priorities.  Strong analytical skills with substantial knowledge of data analysis, applied statistics, risk based analysis.  Strong written and verbal communication skills.  Ability to quickly gain and apply manufacturing specific knowledge.  Ability to learn new tools quickly.  Software that must be used independently and without assistance (e.g., Microsoft Suite). Project Description: The GPS (Global Product and Supply) Analytics team is a newly formed team within Business Insights and Analytics focused on partnering with the Client GPS organization. The team will answer key business questions that will drive prioritized business decisions using advanced analytics and data. These questions span the broad range of areas from Global Supply Chain, through Manufacturing Operations and Quality.  Support the Associate Director of GPS Analytics (AD) in executing the team's Book of Work (BoW). More specifically, perform hands-on work to: Support Business Decisions - Work closely with business stakeholders to address priority business questions within an assigned area. This includes all steps from problem identification and key question development through hypothesis testing, driving analysis and presenting key findings to stakeholders.  Drive Analytics and Capabilities Answer key business questions using innovative analytic techniques, assist with establishing core analytical capabilities, standards, processes and methodologies for the team.  Drive Team Productivity and Operational Excellence Play a critical role in maintaining and enhancing team productivity, timeliness and quality of deliverables. Ensure consistent adoption of standards, processes and methodologies by contracted or other team staff. Continuously seek opportunities and approaches for enhancing the team's overall productivity.  This 6+ month position starts ASAP.  Please E-MAIL your resume (attachment to email) with rate and availability to Cheryl: cambrose@alphaconsulting.com ALPHA'S REQUIREMENT #18-00832W2 ONLY MUST BE ELIGIBLE TO WORK IN THE U.S. AS AN HOURLY W2 EMPLOYEE"}