{"jobID": "2735779691", "jobLocation": "Lakewood_NJ", "jobTitle": "Quality Control Scientist", "companyRating": null, "companyInfo": {"Website": "www.renpharm.com", "Headquarters": "Lakewood, NJ", "Size": "Unknown", "Founded": " 2010", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Provide technical support for routine testing activities and conduct physical and chemical analysis of samples, products and materials. Primarily responsible for technical transfer and validation of methods to support quality control testing of products and materials. Identify basic technical problems, atypical test results or methodology malfunctions and assist in the investigation to correct them. Other important duties include ensuring notebooks and reports are in compliance with regulatory guidelines, completing projects within time limits and budgetary constraints, performing mathematical calculations, interpreting results, recording observations and responding to and assisting in audits and investigations. Participate in departmental training and provide guidance to junior staff members. Accurately generate data using validated test methods and SOPs in a cGMP environment.Demonstrate technical competence in the use of wet chemical techniques and instrumentation pertinent to the job including: IR Infra-Red SpectroscopyUV/Vis Ultra Violet/Visible SpectroscopyGC Gas Chromatography HPLC High Pressure Liquid ChromatographyUPLC Ultra High Pressure Liquid Chromatography AA Atomic Absorption Spectroscopy Dissolution apparatuCompendial testing (USP EP, FCC) – ex. Monograph assay, limits tests, chemical and physical testsResponsible for analyzing data, maintaining accurate and detailed written records and notebooks and thoroughly reviewing lab notebooks ensuring compliance to test methods and specifications.Ability to work in a team environment.Train other Scientists and Lab Technicians in various methodologies.Maintain training logs to comply with current SOP requirements.Ensuring safety regulations are adhered to in the laboratory. Bachelor’s Degree (BA or BS) in Chemistry, Biology or related science required with a minimum of 5 years of relevant experience in the pharmaceutical industry; or equivalent combination of education and experience."}