{"jobID": "2824986705", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst/Architect", "companyRating": null, "companyInfo": {"Website": "www.wearedoubleline.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview Double Line believes that each employee makes a significant contribution to our success. That contribution should not be limited by the assigned responsibilities. This position description is designed to outline primary duties, qualifications and job scope, but not limit the incumbent nor the organization to just the work identified. It is our expectation that each employee will offer his/her services wherever and whenever necessary to ensure the success of our endeavors.  The Data Architect will be responsible for supporting the data and development teams in the development of technical solutions - from initial collection and documentation of requirements, through solution design, to testing and documentation of the final solution. What we need from you:Strong analytical skills and a keen attention to detailKnowledge & understanding of data concepts and issuesExcellent written and verbal communication skills with the ability to work with technical and non-technical teams at all levels, including senior managementAbility to collaborate effectively and work as part of a teamEffective time management skillsAdditionally, it would be nice if you had:Data analysis/modeling experience in large enterprise environments working with RDBMS and/or data warehousing systemsLogical data modeling, UML, metadata and data profiling experience including prior work with standard tools (such as ERWIN, Rational Rose, ER/Studio) and methodologiesExperience with SQL and/or ETL developmentExperience with technical writing and user documentationUser interface design experienceExperience with MapForceResponsibilities:Interface with user communities to collect, understand, and document business requirements, data source systems, existing technical solutions, and how these groups utilize their data setsAnalyze data and technical requirements from business and object specificationsPerform meticulous quality assurance review of technical solutionsCreate and deliver detailed, step-by-step user documentation and training for technical solutionsIdentify gaps between current data source systems and defined data requirementsDevelop logical data models, understanding the data entities and their relationships with systems and applications, and validate these models with end usersDefine and enforce standards and conventions (definition, naming and abbreviation)"}