{"jobID": "2728227502", "jobLocation": "Washington_DC", "jobTitle": "Senior Software Engineer, Web Applications", "companyRating": "4.3", "companyInfo": {"Website": "www.fiscalnote.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": "Engineering at FiscalNoteOur team has a wealth of diverse life and career experiences that allow us to think outside of the box and ahead of the curve. And we laugh – all the time. You'll get the opportunity to work at an institution pushing the boundaries of open data transparency, while collaborating with some of the industry’s brightest engineers and data scientists to devise, nurture, and implement cutting-edge solutions to continuously evolving engineering obstacles.About the PositionAs we continue to reinvent the future of law, You will be jumping headfirst into a team of passionate and motivated individuals. As a senior member on the engineering team, your role will challenge your skills as a leader as you assist in the development and mentoring of other team members. Beyond enhancing and pushing forward the capabilities of our client-facing application, you will be critical in guiding and developing the API that powers our client applications (web, mobile, and general API) as we move toward a polyglot micro-services oriented architecture.You WillBe working with a Full stack of technologiesBuild Web Products that help push the FiscalNote platform forwardWork across teams to ensure cohesion and collaboration across engineering functionsBe creating experiences for the end user by applying your knowledge of the front and back end to deliver a top notch user experienceMentor our engineers on best practicesYou HaveDemonstrated mastery of the following frameworks: Node.js & at least one of the following: Ember.js, React.js, Angular.js, or similar Javascript frameworkDemonstrated mastery in each of the following technologies: Javascript, HTML, CSSWorking knowledge of Ruby on RailsDesign acumen rivaling that of UI/UX designers5+ years of experience in the software development industry (not necessarily with the technologies)Working knowledge of production environments (Unix, bash, nginx, etc.)Experience in each of the following: SQL, Elasticsearch, Redis- Architecture and production environment decision-making experience (must have)- Demonstrated experience building successful working relationships with Product + UI/UX teams (must have)- Experience breaking down product specs into engineering components (must have)- Led projects from inception to completion (must have)You AreAmbitious. Detail-oriented. Thoughtful. Although proud of how far you’ve come in honing your craft, you look forward to constantly growing in your technical abilities. Even more excited to share your skills and experiences, you thrive in collaborative environments in which the free flow of ideas serve as the catalyst for bold results. Feeding off of a highly competent engineering and product development culture, you yearn to contribute to the foundational growth of a company with unlimited growth and market capture potential.About UsFiscalNote is the leading Government Relations Management platform. Our mission is to build the world’s most powerful platform for analyzing government risk and opportunity. For organizations facing government impact, FiscalNote is the platform for professionals to plan and execute their organization’s government risk strategy. Organizations rely on FiscalNote because of its accurate and relevant information, cutting-edge analytics, and ease of use.Our fierce curiosity and insatiable urge for the next challenge pours into our company culture. FiscalNote earned the Top Workplace™ award for our ever growing and diverse company culture bolstered by our company values, which are at the core of every decision we make. We are always looking for individuals who are excited and driven by opening data to help impact the world around them.Company BenefitsFiscalNote offers competitive salaries, equity packages, and retirement accounts to ensure we’re all FN owners. We work hard, so we want you to play hard; our open vacation policy and vacation expense contribution help us ensure you’re getting the R&R; you need. We offer comprehensive health, vision, and dental insurance options supplemented by a flexible spending account (FSA). We have a slew of other benefits which you can check out at careers.FiscalNote.comFiscalNote is an Equal Opportunity EmployerPosted 4.9.18Apply"}