{"jobID": "2777243485", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Scientist, QC", "companyRating": null, "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Posting Title Scientist, QC  15-May-2018 Job ID239499BRJob Description*Second Shift Work (4) - (10 hour days) Sunday - Wednesday • Perform Micro/EM testing such as, but not limited to, environmental monitoring, Gram stain, sterility, endotoxin, and mycoplasma. • Perform all testing and activities compliantly following appropriate SOPs and Work Procedures. • Perform logbook reviews and monthly laboratory cleaning. • Maintain controls and reference materials to support testing. • Enter/review data in LIMS. • Review QC documents to ensure completeness, accuracy, consistency and clarity. • Generate and analyze trend reports. • Review reports that are generated and makes conclusions as to any action required based on the data. • Manage assigned projects. • Develop and revise documents to support process efficiencies and to maintain compliance. • Initiate change controls. • Maintain the gowning qualification program. • Train lab personnel. • Identify and execute process improvements • Lead and/or participate in investigations/CAPAs. • Support 5S and Lean Lab projects. • Interface with QA and regulatory agencies during audits. • Working knowledge of LabWare LIMS and/or other QC data systems. • Working knowledge of appropriate GMP quality systems (e.g. eSOPs, TEDI, etc.). • Perform other job duties as assigned.Minimum requirements BS, MS or advanced degree in Biology, Chemistry, Biochemistry, Microbiology or other related science Fluent in English  3-8 years of relevant experience in the pharmaceutical, biologics, microbiology, sterile manufacture, cell and gene therapy, or medical device industry.  Working knowledge of aseptic manufacturing, cGMPs, GLPs and applicable compendial and regulatory guidelines (e.g. FDA, EP, JP)  Thorough knowledge of microbiological test methods and environmental monitoring programs.  Experience with LIMS.  Strong written and verbal communication skills.  Detail-oriented with expertise in problem solving and solid decision making abilities.  Strong interpersonal skills. Job Type Full Time CountryUSAWork Location Morris Plains Functional Area Quality Division Novartis Technical Operations Business UnitNTO BTDMEmployment Type Regular Company/Legal Entity Novartis Pharmaceuticals EEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. "}