{"jobID": "2820881697", "jobLocation": "Dearborn_MI", "jobTitle": "Project Manager – Shopper Marketing", "companyRating": "2.8", "companyInfo": {"Website": "www.gtb.com", "Headquarters": "Dearborn, MI", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " The Project Manager is responsible for the successful delivery of online marketing campaigns and interactive marketing projects supporting the in-market ecosystem. The Project Manager will work with the shopper team to extend an integrated campaign to the online advertising space for the Ford brand. In additional to online digital campaigns, integration across cross-disciplines will also be key. We are looking for an energetic, creative leader with strong organizational skills who thrives when juggling multiple priorities in a fast paced, high performing environment while working well with other team members. MAJOR RESPONSIBILITIES / PRINCIPAL ACCOUNTABILITIES:Work closely with respective team members from various disciplines (media, creative, project management, account and analytics) within the agency and the client to optimize and coordinate advertising campaign strategies.Ensure that all projects remain consistent with agency and client approved brand communications strategies throughout the advertising development process.Drive development of online advertising messaging strategy, working with Retail First field force to ensure consistency across all consumer marketing messages.Maintain and support all company standards as specified within the Quality Management System.Supports/facilitates the mandatory adherence to ISO9001 requirements, processes and procedures.Perform other duties and projects as assigned.KNOWLEDGE AND SKILLS:MS Office (Word, Excel, PowerPoint)MS Project a plusDoubleClick System knowledge a plusMINIMUM QUALIFICATIONS:Minimum three to five years of experience in a similar role in a digital marketing agency, online advertising firm, web development firm or equivalent.Excellent interpersonal and problem-solving skills, with ability to educate internal agency personnel.Able to manage multiple projects as one cohesive client program; creating efficiencies and economies for both client and the agency.Excellent project management skills and experience, including: o Budget/schedule development and management/oversight  o Task and delivery management Strong vendor management skills.Ability to address difficult issues and to solve problems quickly in the face of challenges.Strong organizational skills and an ability to manage multiple projects simultaneously.Understanding of metrics, analytics and optimization a plus.PMI certification a plus.Bachelor’s degree or equivalent experience preferred.Have physical and mental requirements to meet the above listed job responsibilities.DISCLAIMER: The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to the job.  As an Equal Opportunity Employer, GTB Agency, LLC. does not discriminate against applicants or employees because of age, race, color, religion, gender, sexual orientation, genetics, pregnancy-related status, veteran status, physical or mental disability where the individual is otherwise qualified, national or ethnic origin, or on any other basis where protected by local, state, or federal law. #LI-JS1-TD"}