{"jobID": "2835287417", "jobLocation": "Houston_TX", "jobTitle": "Data Engineer/ Architect", "companyRating": null, "companyInfo": {"Website": "www.cilvertechnologies.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Engineer/ ArchitectPeriod:06/25/2018 to 06/21/2019Location: Houston TXClient: NTT Data Primary functions: Participating in projects as a Data Lead / Data Engineer responsible for performing many different data related tasks to make data available for the designated business need. These tasks could include the following components: Database and Interface design, Creating/Editing Data Models (physical & logical), Data Profiling, Data Mapping, data quality management. Required Advanced Level of Technical Competencies: - Data modeling (physical and logical), ER/Studio diagrams, data dictionary, data map, normalize/de-normalize, agile data - Data manipulation tools such as: SSMS, SSIS, TOAD, Access, Excel - Advanced database handling languages (SQL and variants) - Experience in Data Architecture specifically in a Data Lake environment – i.e. Data Lake Zones, Data Modeling, etc. Preferred (Beginner to Expert) Technical Competencies: - Practical skill sets in BI and Data visualization tools (Tableau) - Knowledge of programming languages and some ability to write code (e.g., python, VBA, XML, R) - API Development and Mulesoft - SAP Business Object Data Services (BODS) ER/Studio Modeling Preferred candidate should: - Strong communication and interpersonal skills with strong English proficiency - Demonstrate critical thinking, analytical skills, and employ judgment to offer thoughtful, concise input toward resolutions of problems - Be able to translate data requirements into business processes and reverse engineer business processes into data requirements - Comprehension of DevOps and Agile development and application to data centric architecture and solutions  - Minimum Bachelor’s Degree in Engineering Technology, Computer Science, or a related field with equivalent experience Manisha JhaTeam LeadCilver Technologies Inc.1546 NW 56th Street, Seattle WA 98107Web ::www.cilvertechnologies.comEmail ::manisha@cilvertechnologies.com- provided by Dice  Data Engineer/ Architect"}