{"jobID": "2817568244", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analytics Analyst, Sr. - Legal Affairs", "companyRating": null, "companyInfo": {"Website": "jobs.chla.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1901", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Give your career the best treatment. Ready to be part of the first and largest pediatric hospital in Southern California? This is Children's Hospital Los Angeles. A place where you can make a real difference in the lives of our patients and their families. A big responsibility? Absolutely. But if youre up for the challenge, were on the lookout for amazing professionals to join our elite teams talented individuals who can continue our high level of care.  The Sr. Data Analytics Analyst is under the direction and supervision of the Assistant General Counsel, the Senior Data Analytics Analyst is the system administrator for all departmental systems including SharePoint, Legal Tracker, etc., and will manage departmental finances, develop project lists, dashboards and relevant reports , monitor / maintain departmental systems, processes, and databases, and provide analysis and reporting using department programs including, MediTract and Risk Management iTrack.  Minimum Education: Bachelor in business or health administration or experience. Masters degree preferred.  Minimum Experience: 5+ years of healthcare systems experience including data analytics, finance, process improvement, and project management.  License, Registration or Certification Required: PM Certification preferred Knowledge, Skills and Abilities Required:Ability to manage difficult, sensitive and confidential situations with integrity and professionalism.Strong interpersonal skills; able to deal effectively with diverse skill sets and personalities.Excellent analytical, problem-solving, and decision-making skills.Highly organized with proven ability to prioritize workload, meet deadlines, and manage several projects at one time.Possess a high degree of flexibility to respond rapidly to changing goals, ability to work under pressure, and meet deadlines.Must be detail oriented and take initiative to learn new tasks.Excellent verbal and written communication skills.Excellent writing, editing and proofreading skills.Executes all job responsibilities and assignments promptly, reliably, honestly and ethically.Proficiency with Microsoft Office Suite (Word, Excel, PowerPoint), including creating charts and graphs."}