{"jobID": "2837688579", "jobLocation": "Los_Angeles_CA", "jobTitle": "Client Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.jooraccess.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "Who We Are: JOOR is the worlds largest digital wholesale marketplace, connecting the best brands and top retailers for faster, easier, smarter wholesale business. The only platform serving the needs of both buyers and sellers, JOOR helps more than 3,000 brands and 175,000 retail locations to rid themselves of manual processes and grow their businesses through more efficient and impactful order processing, assortment planning, and analytics. JOOR is headquartered in New York City and has offices in Los Angeles, London, Madrid, Melbourne, Milan, Paris and Philadelphia. We are a team of retail industry experts and technologists passionate about transforming the wholesale industry through disruptive products and services. Come join us!Why JOOR: We welcomed an exciting new CEO and management team We are building software that is transforming an industry Our industry-leading technology won an American Business (Stevie) Award We are global and rapidly growing We are one of the most diverse and inclusive tech companiesWho You Are: We are looking for a Client Data Analyst to join our Data Services team. You'll be responsible for analyzing and maintaining the integrity of JOOR's rich style, order, and customer data. You'll partner with our Product, Engineering, Sales, and Customer Success teams to develop data-based tools that support emerging, independent businesses all the way up to global brands and retailers. Our clients rely on JOOR to grow their business and this role is instrumental in improving internal and external workflows to achieve this.What You'll Do: Review, upload and maintain customer profiles, acting as primary point of contact regarding data for prospective and existing brands and retailers on JOOR Analyze/translate complex data and communicate to our clients in a digestible way Maintain database integrity using Excel, SQL, and on-site interfaces Write and maintain queries that allow the Data Team to update data quickly and efficiently for clients, while also partnering with Engineering teams to build tools that simplify these processes Assist with platform integrations and implementation Work cross functionally on high impact projects that help increase efficiency of data processing Undertake any other projects that may arise - be willing to step outside your comfort zone and learn quickly!What We're Looking For: Bachelors degree 2+ years of experience as a Data Analyst or Data Engineer Experience with Advanced SQL Working knowledge of Python Familiarity or willingness to learn web frameworks such as Django Experience building and maintaining data manipulation tools Interest in the generation and presentation of actionable data insights A positive do-whatever-it-takes attitude to ensure an excellent client experience Willingness to do manual data entry work if required to get the job done Ability to zoom out and understand client needs in order to strategically build and implement data tools Effective communication skills Advanced Excel proficiency - (formatting, formulas, macros, vlookup, concatenate). Experience using JIRA a plusWhat We Offer: Access to Market Weeks to see the product in action Collaborate with our teams in NY, LA, London, Madrid, Melbourne, Milan, Paris and Philadelphia Need a break? Generous My Time policy - We want you at your best! Regular social events, including happy hours, lunch & learns, company offsites, meetups and speaker series Transparency into the state of our business via monthly all-hands meetings, showcasing the companys performance in relation to revenue and growth."}