{"jobID": "2782823655", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist, Ad Tech", "companyRating": "3.6", "companyInfo": {"Website": "www.multiply.com", "Headquarters": "Saint Louis, MO", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "What is Multiply? Multiply is a premium digital publisher and technology and analytics platform. Were a group of experienced, innovative, and growth focused entrepreneurs who foster an environment of creativity and curiosity.  Multiply develops, acquires, and invests in digital brands that are lead by subject-matter enthusiasts and focus on verticals with high-value and commercially relevant audiences.  Today, we operate three premium digital publishing brands - FashionBeans, HealthyWay, and Urbo - which are focused on curating content that entertains, engages, and enlightens our readers. In 2017, our brands collectively engaged over 1.1 billion visits, with each ranking as a Top 200 U.S. mobile destination.  Multiplys publishing platform enables editorial thought-leaders with technology, insights, and revenue products that deliver market leading value to our advertisers, retail partners, and readership. Summary As a Data Scientist you will be responsible for producing innovative and actionable models to help drive business decisions. This individual will be responsible for developing state-of-the art algorithms using analytical, statistical, and programming skills. Working on the Analytics team, they will be collaborating with business partners to help solve complex business initiatives using a data driven approach. With over a trillion unique monthly data points, you will have a unique opportunity to influence our day to day business operations.To be successful, youll need to have a passion for creating actionable insights out of large and diverse data sets. What Youll Do:Build state-of-the-art statistical procedures, algorithms and models to solve a range of problemsManage and provide recommendations on highly visible and impactful projects, includingContent Recommendation EngineQuality Assurance MonitoringUser Targeting AlgorithmsMedia Bidding, Revenue Prediction, and Lifetime Value ModelsInvestigate and identify patterns in big data to generate business insightsUse your analytical and creative skills to solve complex problemsWhats Great About It:Our corporate culture and the leadership team heavily embrace data and analytics so youll be highly visible in the organization and have the support needed to succeed and advance in the companyYoull be able to see the impact of your work as new ways of interpreting data lead to impacting the top and bottom linesYoull get to collaborate with different teams across a growing companyYoull be part of an amazing work cultureRequired Qualifications:Graduate degree required in Business (with quantitative emphasis), Statistics, Data Mining, Machine Learning, Analytics, Mathematics, or related fieldAdTech / MarTech / / website analytics experience is requiredFamiliarity with Google Analytics, DFP, Facebook Analytics, Tableau is a plusDetail-oriented, organized, and capable of prioritizing and focusing on responsibilitiesInnovative, data driven mindsetHighly analytical, being able to tie business needs to numbersInquisitive and intellectually curious mindsetOutstanding written and verbal communication skillsMySQL skills (preferred)Benefits & PerksHighly Competitive Salaries & Bonus ProgramsMedical Insurance; 3 Plan options-Insurance is effective on first day of employmentDental / Vision / Rx Drug InsurancePaid Time Off (PTO) Policy 15 Days (to start) & 11 Paid HolidaysVolunteer Time Off (VTO) Policy401k Savings Plan plus Company MatchTuition Reimbursement ProgramCommuter and Transit BenefitsMaternity (16 Paid Weeks) / Paternity (4 Paid Weeks) / Adoption Leave (4 Paid Weeks)Fully Stocked KitchensCasual Dress All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status or status as an individual with disability. All qualified applicants will not be discriminated against on the basis of disability."}