{"jobID": "2820744253", "jobLocation": "Sacramento_CA", "jobTitle": "Staff Geologist/Environmental Engineer/Environmental Scientist (Entry Level)", "companyRating": "3.0", "companyInfo": {"Website": "www.erm.com", "Headquarters": "London, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " ENVIRON, AECOM, Golder Associates"}, "estimatedSalary": "45000", "jobDescription": "ERM is seeking a motivated Staff Geologist/Environmental Engineer/Environmental Scientist, who is interested in participating on a variety of projects covering the full spectrum of ERMs services, to join our consulting firm in Sacramento, CA. In this role, you will work closely with Project Managers on contaminated site management, environmental health and safety (EHS) compliance, air quality, and due diligence transaction projects. This is an excellent career opportunity to work with an expert consulting team on challenging environmental projects for large industrial and global clients. Access to ERM's national experts provides knowledge sharing of best practices across the industry and ongoing learning opportunities for our team, while building the required experience to obtain your professional registration.RESPONSIBILITIES:Provide technical assistance on site investigation and remediation, EHS compliance, air quality management, and due diligence transaction projects.Conduct field work, including sampling, ecological field studies, drilling, well installation, remedial pilot tests, construction oversight, and remedial system operation and maintenance.Prepare plans, permits, and reports for hazardous waste, air quality, storm water, NPDES, and wastewater programs.Perform environmental compliance assessments and implement follow-up corrective actions to ensure compliance with federal, state, and local regulations.Perform Phase I environmental site assessments to support property transfer transactions.Provide general environmental compliance support to clients, including on-site assistance, as needed.Compile and evaluate data and assist in report preparation.Perform multiple projects within scope/budget/schedule expectations and ensure quality standards on project deliverables.Support ERM Partners-in-Charge and Project Managers to effectively manage projects.REQUIREMENTS:BS in engineering (chemical, civil, environmental, or mechanical), geology, or related environmental science degree.Recent graduate to 2 years of relevant environmental experience or professional internships.Effective written/verbal communication and organization/analytical skills; experience recording/writing detailed technical data and reports a plus.Strong hands-on spreadsheet and database comprehension.Detail-oriented with mechanical aptitude and hands-on trouble-shooting/problem-solving skills.Ability to multi-task, maintain flexibility, travel, and work independently with minimal supervision.HAZWOPER and EIT/GIT certifications a plus.Valid drivers license and good driving record.Local candidates preferred. Please submit your resume and brief cover letter. Qualified candidates will be contacted by email, and requested to complete a video questionnaire. Based on review of these responses, shortlisted candidates will be invited for interviews. Thank you for your interest in ERM!ERM does not accept recruiting agency resumes. Please do not forward resumes to our jobs alias, ERM employees or any other company location. ERM is not responsible for any fees related to unsolicited resumes."}