{"jobID": "2803784395", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.servicenow.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (NOW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " BMC Software, CA Technologies, Salesforce"}, "estimatedSalary": "130000", "jobDescription": " ServiceNow is changing the way people work. With a service-orientation toward the activities, tasks and processes that make up day-to-day work life, we help the modern enterprise operate faster and be more scalable than ever before.  If you thought you knew about ServiceNow and what we do, take a look again!  Our products lines are diverse and robust. The Enterprise Cloud is dynamic, scalable to billions of transactions weekly, and global in scope and size.  As a part of the core Platform as a Service offering, the Intelligent Automation Development team is building the core machine learning/AI/predictive analytics technology that will power revenue generating business use-cases using customer data to predict desired outcomes automatically; hence delivering significant increase in productivity of business processes of ServiceNow customers. The team focuses on operationalizing machine learning and predictive analytics use cases for all ServiceNow business applications.  We employ only the brightest, innovative and most intuitive data scientists on the planet. We have offices in San Diego, San Francisco, Santa Clara and Hyderabad and work as a distributed team. Come join the Intelligent Automation team and make your mark in the most challenging problem area - helping customer derive the insights from their own data on ServiceNow platform for enterprise applications, each customer at a time! What you get to do in this role: Work on various ServiceNow client data sets and focus on solving applied problems in Natural Language Understanding, Text Mining, Anomaly Detection, Forecasting, etc., by leveraging statistical/mathematical concepts and core machine learning/AI tools and techniques.  Opportunity to learn, work and contribute to the innovative and enterprise grade ServiceNows Machine Learning and Artificial Intelligence engine as part of the overall Platform-as-a-Service offering.  Specifically, you will Understand the business needs of Platform BU's customersTranslate the business needs into data requirementsDesign and experiment (proof of concept), code, execute and iterate to retrieve business value/knowledge discovery from clients dataDefine and document success criteria/measures for the POC to prove the feasibility of the design experimentCommunicate and collaborate with appropriate teams and important stakeholders from the business units on the complete lifecycle of the experimentRetrieve, clean/sanitize/normalize clients data available in multiple data sources in ServiceNow instanceChoose an appropriate Statistical/ML/AI model, engineer the features and define appropriate model evaluation metrics.Plan to generalize, scale and integrate the model at the platform level making it available as a core feature/functionality to all ServiceNow client baseMonitor, support, fix bugs, iterate and improve model performance to a desired level over a definitive time period.Completely own the quality and metrics (response times, scalability etc) of the deployed model.Develop innovative patentable ideas that ensures the competitiveness of this product within the domain of similar work being done in the industryLead and deliver key asks from internal constituents by exampleAdvance the natural language capabilities of the ServiceNow platformTo be successful in this role, we need someone who has:2+ years of research experience with 1+ years of core machine learning/AI experienceStrong research background with deep expertise in building various machine learning/AI and statistical data models in Weka/Python/R/JavaAdvanced degree in the field of data science/computer science/mathematics/statistics will be a definite plus.Working experience in Natural Language Processing (NLP)/Natural Language Understanding (NLU) based solutions is highly preferredDeep understanding of Statistics/Linear Algebra/Calculus and various optimization algorithms is a must.Hands-on experience on various supervised/semi-supervised/unsupervised ML/AI algorithms like SVM, Random Forests, Clustering, Linear/Logistic Regression, Classification, PCA, Time Series Forecasting, Deep Neural Nets and Sequential speech/language models.Strong leadership and influencing skills with an ability to crisply communicate/articulate model performance/experience results to Key stakeholders and wider audience with appropriate visualization techniquesArdent data enthusiast with experience and interest in engaging with data science communities like Kaggle and various online forums.Ability to translate business needs into data requirementsExperience working in Agile/Scrum environment is desired.Experienced in various forms of decision sciences and optimization software developmentExceptional debugging, testing, and problem-solving skillsSelf-starter, with quick learning curveStrong written and verbal communication skills and an ability and interest to mentor other junior data scientists.Working experience within product development teams is a mustMust have demonstrated work experience through multiple life cycles of a product within a single company.Must have demonstrated capabilities to create patentable ideas We provide competitive compensation, generous benefits and a professional atmosphere. This is a very collaborative and inclusive work environment where individuals strong on aptitude and attitude will have an opportunity to grow their professional careers through working with some of the most advanced technology and talented developers in the business.  This position is based in Chicago, IL."}