{"jobID": "2707288971", "jobLocation": "San_Leandro_CA", "jobTitle": "Planning Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.ghirardelli.com", "Headquarters": "San Leandro, CA", "Size": "1001 to 5000 employees", "Founded": " 1852", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mars, Nestlé, Godiva Chocolatier"}, "estimatedSalary": "62000", "jobDescription": " Ghirardelli's Professional Products Division (PPD) brings and introduces our premium trusted brand to food service operators across the nation. Be part of a team that develops recipes and menu applications using premium Ghirardelli ingredients to create scrumptious treats to delight consumers in food service establishments! We are looking for a Planning Analyst that will drive strategic and tactical decision-making through analytical insights, tracking, and process management. You will ensure that the PPD team is armed with strong business insights through regular and ad hoc business tracking reports that measure performance against sales priorities. You will ensure that the PPD supply chain is optimized for high customer order fill rates and company profitability through the demand planning process, as well as coordination with Supply Planning, Logistics, and Customer Service. The Planning Analyst is a key member within the PPD and go-to person for business analysis and analytical support.Scope of Responsibilities: Track and report PPD performance against sales priorities on a monthly basis Conduct ad hoc business tracking and analysis as needed and provide recommended action plans Collaborate with Food Service Enablers as the PPD point person for our CRM system, recommending process improvements, sharing best practices, and generating monthly CRM reporting and analysis Work closely with Sales and Marketing to gather forecasting inputs on a monthly basis Work closely with Demand Planning to incorporate Sales and Marketing inputs into monthly forecasts to maximize forecast accuracy Collaborate with Supply Planning, Logistics, and Customer Service to ensure high customer order fill rates while ensuring high supply chain efficiency Trouble shoot supply issues and recommend actions to adjust inventory levels, deployment of inventory by warehouse, and customer order timing to best match supply and demand Minimize aging inventory and develop plans to sell through aging inventory Administer contract pricing, by entering contract pricing into JDE, track and report contract balance updates monthly, and maintain pricing contractsSpecific Knowledge and Skills: Strong analytical skills coupled with strong Microsoft Excel capabilities Strong critical thinking skills Strong problem solving ability Strong results orientation and a bias for action Strong verbal and written communication skills Strong project management and organizational skills Ability to manage multiple projects simultaneously with a high degree of independence Strong teamwork skills and ability to manage cross-functional teams Adaptability and flexibility to meet changing priorities Strong Microsoft Office skills and ability to learn new systems (e.g., ERP, CRM)Education and Work Experience: BA/BS degree required. Business Administration major preferred Strong analytical track record Prefer minimum 3 years of relevant experience Experience with demand planning and supply chain management is a plus"}