{"jobID": "2825096371", "jobLocation": "Washington_DC", "jobTitle": "Programmer and Data Analyst, EDIC", "companyRating": "3.8", "companyInfo": {"Website": "www.business.gwu.edu", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1821", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " The Biostatistics Center (BSC) of the Milken Institute School of Public Health is an off-campus research facility of The George Washington University located in Rockville, Maryland. The BSC serves as the coordinating center for large scale multi-center clinical trials and epidemiological studies funded by federal agencies including the National Institutes of Health (NIH). The BSC is a leader in the statistical coordination of major medical research programs of national and international scope. Visit our website at: www.bsc.gwu.edu.The Biostatistics Center is seeking a regular full-time Programmer & Data Analyst to work as a member of the coordinating center team supporting the NIH-funded clinical research study, Epidemiology of Diabetes Interventions and Complications (EDIC). This position contributes in the development of reporting systems and performs data analysis for the EDIC research study at the Biostatistics Center. Duties most typically performed by this position include utilizing their relevant professional experience and judgment to the following:-Manages EDIC ancillary studys web-based data management system.-Creates study reports using SAS, MySQL, iReports, and Javascript. -Maintains the SAS import process. -Develops edits and audits using Javascript. -Manages the update and clean-up of longitudinal data files. -Creates and automates summary reports on the status of the cohort. -Creates and updates analytic data sets for various manuscripts. -Acquires detailed knowledge of research study protocols, manuals of procedures, data forms, and other study documents. -Performs other work related duties as assigned. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position."}