{"jobID": "2722685165", "jobLocation": "Lansing_MI", "jobTitle": "Sales Development Manager – Upper MW", "companyRating": null, "companyInfo": {"Website": "www.central.com", "Headquarters": "Walnut Creek, CA", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Public (CENTA) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Spectrum Brands, Scotts Miracle-Gro, Newell Brands"}, "estimatedSalary": null, "jobDescription": " Sales Development Manager – Upper MW Work Location  MI - Lansing Job Code 4328 Department  SalesApply NowCentral Garden & Pet Company (NASDAQ:CENT and CENTA), is a leading innovator, marketer and producer of quality branded products for the pet, lawn and garden supplies markets. Our Central Life Sciences Agricultural Products Division is focused on delivering insect management solutions for challenging pests in livestock, grain storage and processing, horticulture, turf, along with ant control in food crops. We have an outstanding opportunity available for a Sales Development Manager on our Agricultural Products Team. The successful individual will be responsible for supporting sales and territory management along with market planning and product adoption in their assigned area. This role is a remote, home office based field sales position. Desirable candidates will be based in the Lansing, MI area.  We need organized individuals who can follow through on key business opportunities for insect management solutions to the agriculture industry. The sales development manager will implement successful business development plans in concert with corporate objectives, supporting key accounts, reporting on market and competition, as well as, developing market assessment for our product portfolio in assigned areas. The sales development manager represents Central Life Sciences at key industry associations, trade shows, dealer & producer meetings and in various industry seminars. More product information can be found at www.AltosidIGR.com, www.CentralFlyControl.com , www.bugfreegrains.com , or www.starbarproducts.com .  Please see our corporate web site for additional company information; all interested applicants must apply online at our “careers” page – www.central.com or www.centrallifesciences.com . MEASURES OF SUCCESSWork with sales directors, regional sales managers and business managers to achieve target market development and sales targets in assigned area for all Agricultural productsReport market conditions and competitive environment to the management teamSupports the development of market adoption strategies/tactics that are in alignment with Central Life Sciences vision/mission/objectives for the Agricultural products in assigned area and/or accountsPartner with key accounts in developing market adoption strategies that enable highest market share adoption in shortest amount of timeSupport the implementation of account and regional business plans that achieve sales objectivesManage company resources for highest ROFE (return on funds expended): expenses, marketing funds, advertising guidance, company equipment, etc.Complete administrative and reporting responsibilities as requestedQuarterly reviews the market and key account business plans with leadership and modifies to achieve best resultsReport monthly on variance against budgets volumes/expenses and sales activitiesActively participate in key industry associates, trade shows, seminars, and meetingsProvide director of sales and business manager with continual marketplace feedback, product management suggestions, product sales forecasts, and key business opportunitiesUtilize S.M.A.R.T. Goals (specific, measurable, achievable, realistic, and time oriented) in business plansIDEAL CANDIDATE ATTRIBUTESBS/BA degree in Animal Science, Agribusiness, Agronomy, Ag Economics, Ag Education, Entomology, or other related scientific degree3+ years sales experience in Life Sciences Industry; preferably in the feed, agri chemicals, swine or cattle fieldsProven successful sales resultsExcellent presentation skillsStrong Field based marketing and business planning skillsCore background in sciences: chemistry, biology, nutrition and entomologyHigh energy and enthusiasm for market developmentAbility to thrive in fast paced work environmentWORKING CONDITIONSOvernight travel approximately 70%: frequent car and airline travel; hotel sleep accommodationsAttendance at National and State Trade meetings; presentations for product training and producer meetingsHome office conditions when not actively traveling in region. Variation in work hours is necessary due to employee and customer schedules, special projects, deadlines and other business activities.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, gender identity, or any other characteristic protected by law. #LI-CM1"}