{"jobID": "2830903271", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Scientist", "companyRating": "4.7", "companyInfo": {"Website": "www.bain.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " McKinsey & Company, Boston Consulting Group, Booz & Company"}, "estimatedSalary": "122000", "jobDescription": " Our Advanced Analytics Group is a team of experts in data science, engineering, marketing science, operations research and primary research. You will work alongside Bain’s consulting teams to provide high quality results for our clients, some of the most successful and pioneering businesses in the world.  You will also work to advance AAG’s and Bain’s analytic capabilities and provide training to the consulting staff as needed.  Responsibilities  Provide data science services to Bain case teams and clients worldwide. You will work with case teams to assess client demands and suggest data science methods that provide practical, value-added answers to the client and case teams.  Develop solutions that bring critical insights to wide scale of different problems such as targeting customers and segmenting markets, product design, marketing optimization, demand forecasting and brand valuation, profit and price analyses, and fraud detection.  Develop, prototype and test machine learning algorithms on data sets that can range from a few data points to billions.  Apply machine learning and statistical techniques including regression models, decision trees, random forests, gradient boosting, support vector machines, clustering and topic models.  Prepare various sources of data using data wrangling methods in Python and SQL, leveraging infrastructure including Cloud computing solutions and relational database enviroments  Keep abreast of new and current statistical methodologies, machine learning and data wrangling techniques.  Where appropriate, train other team members to support the use of data analytics tools and to expand the use of machine learning within Bain  Combine domain expertise to perform feature engineering  Qualifications  5+ years of experience with data science and statistical analysis in a business, marketing science or social science environment  A Masters’ Degree or Ph.D. in Computer Science, Artificial Intelligence, Applied Mathematics, Econometrics, Statistics, Physics or related field is desired  Strong background in Statistics and Mathematics  Proficiency in SQL is required, and familiarity with NoSQL data stores is a plus  Proficiency with data wrangling, visualization, and machine learning in Python is required  Experience with other analytical software such as R, SAS or SPSS is a plus  Experience with explaining and applying a variety of data science and machine learning techniques  Examples of domain expertise in which we are interested is: predictive modeling, churn analysis, time series forecasting, computer vision, text mining/natural language processing, recommender systems, market basket analysis, segmentation, and graph analytics  Experience with dashboarding and visualization tools such as Tableau, Qlik, Plotly, etc.  Experience with deep learning tools such as Keras, PyTorch, TensorFlow or Theano is a plus.  Experience with distributed computing frameworks such as Hadoop and Spark is a plus  Experience with Git and modern software development workflow is a plus  Experience with building data science solutions in cloud computing environments is a plus  Strong interpersonal and communication skills are a must.  Ability to explain and discuss mathematical and machine learning technicalities to a business audience.  Must thrive in a fast paced environment and be able to work independently  Travel required"}