{"jobID": "2767772034", "jobLocation": "Rancho_Cordova_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sunrisesys.com", "Headquarters": "Edison, NJ", "Size": "501 to 1000 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client, a leading fortune company is looking for Data Analyst. This is for an initial duration of 7 months located in Rancho Cordova, CA. General SummaryPerforms research and analysis for future and current strategy developments business opportunities, performance monitoring and operational enhancements. Improve data quality, data collection and analysis processes; develops data analysis methodologies and reporting.Essential FunctionsIdentify, gather and analyze data to examine patterns & trends, and provide insights to enhance business decision making capability in business planning, process improvement, solution assessment, forecasting, etc.Recommend actions for future strategic developments & business opportunities, performance for existing initiatives and partnerships, as well as enhancements to operational programs/tacticsPerform data analysis through methodologies that include statistical analysis, forecasting and predictive analyticsJob SpecificationsTypically has the following skills or abilities:Bachelor's degree in Business, Statistics, Data Analytics or other related fields, or equivalent experienceThree years of experience using business intelligence analytic software such as SAS, Cognos or SPSS to perform statistical, strategic, data and operational analysisThree years of experience performing data analysisDemonstrated ability to proactively develop, communicate and recommend solutions based upon business acumen and analysis performedExcellent written and verbal communication skills with the ability to network, influence and build relationships with internal and external business partners and to express complex analytical and technical information to a variety of audiences at all levelsProficiency in management, interpretation and analysis of large datasets and report production and automationProficiency with Microsoft Suite applications such as; Excel, Access, Visual Basic, etc. Qualified candidates please send your word format updated resume at the earliest to Krishna.r@sunrisesys.com , Thank You! "}