{"jobID": "2781847888", "jobLocation": "Lisle_IL", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Endotronix, a growing medtech company located in Lisle, IL, is advancing the treatment of heart failure (HF) with proactive data-driven solutions that improve the quality of life for patients and clinicians. The company’s platform streamlines care for patients with advanced heart failure. It is comprised of an intuitive patient management system and a wireless implantable sensor to monitor pulmonary artery pressure, a leading indicator for early detection of worsening heart failure. The comprehensive solution overcomes inefficiencies in managing these complex patients and extends clinical care into the home.  Endotronix is immediately seeking for a Senior Data Engineer as part of the Medical Engineering team. This is an opportunity to join a dynamic start-up that is poised to revolutionize the clinical practice for patients with advanced heart failure. Key ResponsibilitiesProvide support in research and development efforts for novel analytical models combining multi-modal physiological dataDesign, develop and implement signal processing algorithms for existing and new medical sensing devicesCommunicate results (technical reports or presentations) to team and managementRequirementsBS or MS in Biomedical Engineering, Electrical Engineering or related with at least 2-5 years of experienceDemonstrated proficiency in MATLABDemonstrated proficiency in data analysis and signal processingPreferably familiar with cardiovascular hemodynamicsStrengths in computer science, with competencies in data structures, algorithms and software engineeringAbility to develop new concepts and stay current with academic research In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the U.S. and to complete the required verification document upon hire. Endotronix participates in E-Verify."}