{"jobID": "2687530762", "jobLocation": "Jersey_City_NJ", "jobTitle": "CIB QR - Quantitative Research - SPG PnL Associate", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "159000", "jobDescription": "About J.P. MorganJ.P. Morgan is a leader in financial services, working in collaboration across the globe to deliver the best solutions and advice to meet our clients needs, anywhere in the world. We operate in 150 countries, and hold leadership positions across our businesses. We have an exceptional team of employees who work hard to do the right thing for our clients and the firm, every day. This is why we are the most respected financial institution in the world and why we can offer you an outstanding career.Our businessJ.P. Morgan has the leading Global Spread business in terms of volume traded, issuers traded and investor relationships. The Spread business covers Credit, SPG, and Public Finance Markets. J.P. Morgan Global Spread Trading offers first-class, highly integrated financial services to a global client base and provides financial assets and liquidity for banks, insurance companies, finance companies, mutual funds and hedge funds. Traders, salespeople and research analysts work collectively to generate ideas. The Credit business make secondary markets in high grade bonds/CDS, high yield bonds/CDS, distressed bonds, indices, options, correlation products, and more exotic structures. The Securitized Products Group (SPG) engages in origination, syndicate, sales& trading, financing, and principal investments activities. Asset classes include: mortgage-backed securities (commercial, residential, agency and non-agency), mortgage loans, consumer asset-backed securities and receivables (auto, credit card, student, equipment loans).Our teamThe Credit and SPG QR team is responsible for developing and maintaining models for valuation, risk, PnL calculations, as well as quoting and market making algorithms and analysis tools for the Global Spread business. The responsibilities of the team span the full range from new model specification, going through model approval, implementation of models within a library, to integration into risk and PnL systems.OpportunityThe opportunity is to join our New York team as a VP or Associate depending on the experience, with a focus on pricing models, model evaluation and infrastructure for Residential Mortgage Backed Securities (RMBS) for securitized products business (SPG). The role also supports products provided by mortgage banking business.Key responsibilities could include:Building PnL Attribution process for SPG products and hedges, integrating into official PnL SystemStudying various borrower behavior with machine learning and regression approachesSupporting trading activities by explaining model and algorithm behavior, carrying out scenario analyses, developing and delivering quantitative tools, and supporting analyticsRequirementsThe role requires the combination of a very structured mathematical approach to problem solving, experience with quantitative modeling and risk neutral pricing, business knowledge, and the ability to work in a dynamic environment. Excellent communication skills are required in our interaction with trading, technology, and control functions. A strong interest in good software design principles is a requirement as well. A Ph.D. in a numerate subject from a top academic institution is a plus, but not an absolute requirement.Essential skills:Earned a PhD or Masters degree in math, statistics, physics, financial engineering, computer science or other quantitative fieldsStrong software design and development skills using C++, Python or JavaExperience with machine learning, time series and statistical analysis Great communication and interpersonal skills"}