{"jobID": "2804373304", "jobLocation": "Houston_TX", "jobTitle": "MSAT Scientist", "companyRating": null, "companyInfo": {"Website": "www.lonza.com", "Headquarters": "Basel, Switzerland", "Size": "5001 to 10000 employees", "Founded": " 1897", "Type": " Company - Public (LONN) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Perrigo, Covance, DSM"}, "estimatedSalary": null, "jobDescription": " At Lonza, we invest in great people. We encourage our employees to challenge themselves and we offer an environment that fosters creativity and success. Headquartered in Basel, Switzerland, we operate production, R&D;, and business sites around the world, including Europe, North America, and Asia.Our vision:We strive to be the leading supplier using science and technology to improve the quality of life.Our mission:We work with passion, using advanced technologies, to transform life science into new possibilities for our customers.Do you want to help us as we shape the future of this great organization?Job Description SummaryThis position is responsible for being the primary technical support person for manufacturing processes in Viral Vector or Cell and Gene Therapy. This person has experience with GMP manufacturing processes and will perform process transfer from PD Lonza or drop in transfer from customers. The individual is a subject matter expert for various aspects in process understanding and process analysis and is expected to question and solve on tasks when clarification or greater technical expertise is required. This individual may provide immediate supervision or assign tasks to a unit or group of employees. 5+ years of biotech industry exp./0-3 years for PhD in process development and process scale up manf.GMP manufacturing support (Viral Vector or Cell and Gene Therapy preferred), current Good Manufacturing Practices, US / EU regulations.Advanced knowledge of cell biology, cell culture, scale up and mass transfer, bioreactor operation, filtration and intermediate knowledge of statistical data analysis.In depth knowledge of large scale manufacturing, current Good Manufacturing Practices and US/EU regulations.Advanced knowledge of chromatography, UF/DF, virus filtration and Intermediate knowledge of statistical data analysis.Strong communication, technical writing, organizational and interpersonal skills; Strong computer skills (including Word, Excel, Outlook and PowerPoint.); Experienced in aseptic technique and mammalian cell culture;Demonstrates critical thinking skills in problem solving and decision making; Attention to detail and high level of accuracy; The capacity to motivate and encourage others 50% - Process Transfer and Process Support:  Performs all functions associated with process transfer and process support, e.g. develop process understanding, perform gap analysis / FMEA, generate process models, author / review Process Descriptions and Batch Records, author / review planned deviations and change controls, perform process monitoring (manufacturing data summary and analysis, data presentation), author campaign summary reports, perform activities for lot release (assess deviations and process changes).  May provide guidance on process transfer and support activities to junior members of the team.  15% - Deviations / Problem Solving / Data Analysis:  Assess all major deviations including those that impact product quality. Identifies potential root causes using a systematic approach. Experience using variety of problem solving tools e.g. Fishbone, Kepner-Tregoe etc. Able to identify potential solutions. Performs or is able to understand all types of complex data analysis such as multiple linear regression analysis, ANOVA, multivariate analysis.  15% - Documentation and Change assessments:  Authors and reviews process descriptions, definitive formulations, batch records, raw material listings, change controls independently and authors/reviews/modifies the corresponding templates. Assesses change controls for impact of any change to the process, equipment or procedures that can affect process performance and product quality. Supports documentation preparation for regulatory purposes.  10% - Represent MSAT:  Represents MSAT on project teams and interfaces with customer technical and quality representatives. Represents MSAT on internal functional teams (e.g. Deviation and Run Daily Management System meetings).  May participate in Customer and Regulatory Audits.  10% - Training:  Follows all training and policy guidelines established for the facility as well as all cGMP requirements. Ensures employee training profile is up to date at all times by regular monitoring of training lists (e.g. ComplianceWire, SAP Learning Portal) and completing all training in a timely fashion.  Education  Bachelor of Science degree in Biological Sciences or Biomedical/Chemical EngineeringLonza is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a qualified individual with disability, protected veteran status, or any other characteristic protected by law.Lonza. The place to Go, Stay and Grow."}