{"jobID": "2827005222", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Science Manager, Risk", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the role Uber is building a world-class Risk team that uses machine learning to deliver Uber's goal to make transportation as reliable as running water. We develop machine learning solutions to combat various types of fraud and abuse (for example, payment fraud, account security, incentive fraud, marketplace abuse) in multiple Uber business lines (Rides, Eats, U4B, etc).  We are looking for an experienced, passionate data science manager to develop cutting-edge machine learning technology to manage risk and mitigate fraud and abuse. You will experiment with a range of machine learning techniques including supervised, unsupervised and active learning approaches (e.g., tree-based models, CNN, LSTM, and DBSCAN), and tackle a variety of interesting and challenging problems including computer vision, NLP, knowledge graph, identity and reputation scores, mobile sensor and GPS feature development. What you'll needA graduate degree or equivalent in machine learning, statistics, applied math, operations research, or a related quantitative field.At least 4 years of experience using machine learning to solve real-world, large-scale problems. Risk, fraud or integrity experience preferred.Prior management and team-building experience. You'll have the opportunity to scale, build and develop a team of talented data scientists.Team spirit and collaborative leader. Everywhere you go, you can't help but mobilize people, build things, resolve problems, get into the details, go above and beyond, and draw out the best in people. You are a doer and motivator of others.A natural desire to learn and innovate. Machine learning and risk are fast-paced domains and we need to find the most efficient and clever approaches to solving risk problems.Knowledge of the latest machine learning techniques like deep learning is a plus, but not a requirement."}