{"jobID": "2816596765", "jobLocation": "Arlington_VA", "jobTitle": "Lead Training Data Analyst (PeopleSoft)", "companyRating": "5.0", "companyInfo": {"Website": "www.customsoftwaresystems.com", "Headquarters": "Leesburg, VA", "Size": "1 to 50 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "General information: - Clearance: An interim Secret clearance (or higher clearance) with DOD is required  - Location: Arlington, VA  - Education: Bachelor degree or equivalent years of experience a minimum of 5-7 years of related experience.  - Experience: 5 years of SQL skills and 3 years of PeopleSoft  Custom Software Systems, Inc. (CSS) is looking for a Lead Training Data Analyst to manage a team of fewer than five (5) data analysts to effectively identify data needed for extensive PeopleSoft Training, create the data needed for business processes, and replicate the data for multiple users and classroom instances. The lead is expected to have significant hands-on experience with the required toolsets, and the role is very hands-on. The lead performs all the same activities as the data team members, including creating data supporting each application release. Possesses knowledge of PeopleSoft Data Structure and design. Manages data for Human Resources Hands on training domains, with increasing complexity through future releases. Familiar with Army Personnel and Pay business processes and the data dependencies. Prepares and edits program documentation. Duties and responsibilities:  · Analyze training products to identity data needs  · Determine data feeds into the main application and associated transaction tables to be updated  · Serve as a subject matter expert to create, test, document and explain data in support of training  · Facilitate data review sessions  · Assign data per number of users in each classroom instance  · Create classroom activity sheets and associated data sheets to be used in training delivery  · Work closely with the Functional Team, Enterprise Learning Management, Security Applications, and SCRUM Application and Training Developers Required qualifications:  · Bachelor degree or equivalent years of experience a minimum of 5-7 years of related experience.  · An interim Secret clearance (or higher clearance) with DOD is required  · Advanced hands-on Structured Query Language (SQL) skills  · Proficient with PeopleSoft and creating data in support of learning  · Must be able to lead team to provide professional and technical direction  · Understand documentation and following standards Desired qualifications:  · Hands-on training experience  · Experience preparing and delivering oral presentations  · Data Development or Training experience for Army or DoD personnel or pay system  · Experience developing training material and explaining functionality in terms understandable by users  · Knowledge of current HR data, as found in the Standard Installation Division Personnel System (SIDPERS), Army Training Management System (ATMS), Army Organization Structure (AOS), Total Army Personnel Data Databases (TAPDBs) etc.  · Knowledge of Army Training and Doctrine Command (TRADOC) policies, guidance, standards, and procedures for implementation of automated systems training, to include New Equipment Training, Integrated Training Systems, Institutional, Operational and Self-Development Training Domains  · Knowledge of the Army Learning Concept for Training and Education 2020-2040"}