{"jobID": "2618865138", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer - Dispatch team", "companyRating": "2.8", "companyInfo": {"Website": "www.chariot.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "About the RoleThe software engineer will lead the development of our dispatch systems. During peak commute hours, there are thousands of commuters riding in hundreds of Chariots in US and UK. Our dispatch system tracks our drivers, delivers estimated wait times to riders and decides which Chariots are available to which riders. Our riders and drivers depend on this system heavily, and there remains lots of room to improve it and improve the lives of our employees and customers.ResponsibilitiesAs a core member of a cross-functional team comprised of engineers, PMs, designers and data scientists you will work collaboratively to upgrade our dispatching system, iterating frequently and analyzing any product failures. You will also collaborate with the product management team in both analyzing requirements and defining the end product.Chariot is an Equal Employment Opportunity Employer and is committed to a culturally diverse workforce. Chariot considers qualified applicants without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Chariot does not accept unsolicited resumes/CVs through this website or directly to employees from external recruiting agencies and will not pay fees to any agency without a prior signed agreement. Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Chariot will consider for employment qualified applicants with arrest and conviction records."}