{"jobID": "2788262818", "jobLocation": "Sunnyvale_CA", "jobTitle": "Senior Software Engineer/Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "140000", "jobDescription": "Position DescriptionAs part of this team, you'll help solve high impact problems in information retrieval, natural language processing, and machine learning, to understand our customers goals and enable them to make the right purchase decision.  Team members take end-to-end responsibility for collecting, cleaning, organizing, and analyzing data, and using it to improve the algorithms that determine which items are shown for a given search query or browse path. This includes:Working on real-time indexing pipelines, streaming analytics, and distributed machine learning infrastructureEvaluating and fine-tuning systems for speed, robustness, and cost efficiencyTroubleshooting production issuesPushing the boundaries of machine learning to deliver the most relevant search and browse resultsModeling compliance with company policies and procedures and supporting the companys mission, values, and standards of ethics and integrity Your work will be visible to millions of customers and you will have a direct impact on the goals of the Fortune #1 enterprise. Come join our team and be part of this exciting journey.Minimum Qualifications• Bachelors degree in Computer Science or related field and 4 years of experience building scalable, high performing and robust Java applications, or Master degree in Computer Science or related field and 2 years of experience building scalable, high performing and robust Java applications Strong computer science fundamentals in data structures and algorithmsAdditional Preferred QualificationsExperience in the search domain highly desirableExtensive Java / JEE programming experience with a focus on server side componentsExtensive experience in developing Web applications with frameworks such as SpringExperience with open source search engines like lucene, solr, or elastic searchAdvanced scripting skills in at least one of the following: Python, Perl or Shell and willingness to learn new technologiesExperience with Eclipse or other IDE development toolsExperience with Continuous Integration and related tools (e.g., Jenkins, Hudson, Maven)Experience with Code Quality Governance related tools (Sonar, Gerrit, PMD, FindBugs, Checkstyle, Emma, Cobertura, JIRA, etc)Experience with Source Code Management Tools (GitHUB, SVN, CVS, Clearcase, etc.)Expertise with some or all of Apache, JBoss / Tomcat, Jetty, JMS or other application servers like WebLogic, etc.Experience with no-sql technologies like Couchbase, Cassandra or HbaseExperience in data analysis software, data warehousing and data processing (e.g. Hadoop, Spark, Impala, and similar).Exposure to cloud infrastructure, such as Open Stack, GCP, Azure or AWSExperience in building of large scale data pipelines using big data technologies (i.e. Spark/Kafka/Cassandra/Hadoop/Hive/Pig).Experience in systems design, algorithms, and distributed systems.Experience in Python or Ruby, and SQLKnowledge of standard tools for optimizing and testing codeExposure to information retrieval, statistics and machine learningA continuous drive to explore, improve, enhance, automate and optimize systems and toolsAbility to operate effectively and independently in a dynamic, fluid environmentExcellent oral and written communication skills.Company SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryWhenever a user types a search query or browses through product categories on our websites or apps, our service goes to work. We aspire to create a world-class search and browse experience for customers, helping them easily find what they are looking for.  We mine structured and semi-structured data from product catalogs, query logs, customer behavior, etc., and design, develop, and operate petabyte-scale, low-latency, fault-tolerant data systems.  We build complex relevance and ranking models using advanced machine learning techniques.  As part of this team, you'll help solve high impact problems in information retrieval, natural language processing, and machine learning, to understand our customers goals and enable them to make the right purchase decision.  Team members take end-to-end responsibility for collecting, cleaning, organizing, and analyzing data, and using it to improve the algorithms that determine which items are shown for a given search query or browse path. This includes:Working on real-time indexing pipelines, streaming analytics, and distributed machine learning infrastructureEvaluating and fine-tuning systems for speed, robustness, and cost efficiencyTroubleshooting production issuesPushing the boundaries of machine learning to deliver the most relevant search and browse resultsModeling compliance with company policies and procedures and supporting the companys mission, values, and standards of ethics and integrity Your work will be visible to millions of customers and you will have a direct impact on the goals of the Fortune #1 enterprise. Come join our team and be part of this exciting journey. "}