{"jobID": "2804385372", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Engineer - Google Cloud Platform", "companyRating": "3.5", "companyInfo": {"Website": "www.neudesic.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " As a member of Neudesic’s Solutions Delivery Group, the GCP Senior Data Engineer will work as part of a team to jointly pursue sales with Google and work with internal teams to successfully transition sales efforts to delivery teams.  In this role, you will focus on leveraging your technical background in data management and visualization and your ability to build solutions that drive a predictive and prescriptive decision-making process. While your day-to-day activities are not exclusively writing code you must possess the ability to build the solutions you sell. You will leverage your practical experience in developing complex data solutions that map to business needs by leveraging a team of highly skilled Google technologists from around the world to ensure flawless service delivery.  To be successful, you must exhibit strong leadership qualities necessary for building trust with clients and our technologists. You will partner with solution architects to drive client success by providing practical guidance based on your years of experience in data management and visualization solutions. You will partner with a diverse sales unit to professionally represent Neudesic experience and ability to drive business results. In addition, you will assist in creating sales assets that clearly communicate our value proposition to technical decision makers. Critical Success Factors for the Role:Deep technical understanding of all things dataAbility to get hands on and not just talk and draw picturesAbility to proactively engage in complex sales pursuits with sales team membersAbility to paint a technology vision and communicate its value to Google and its customersA passion for technology and digital transformationAn innovative mind that is creative and doesn’t follow cookie cutter ideasA disciplined approach to your work life and your craftMinimum of one year of experience with major GCP data platform components (BigQuery, BigTable, DataFlow, DataProc, DataLab, DataStudio, DataPrep,, TensorFlow, Machine Learning, API’s like Vision)Minimum of three years of development, and implementation of enterprise-level data solutions utilizing Python (scikit-learn, scipy, pandas, numpy)Google Certification PreferredProficient in Linux environments If you are passionate about business and technology and have the chops to make a difference, we’d love to hear from you. Bachelor’s or Masters Degree in Computer Science, Electrical Engineering or equivalent work experience. Minimum of 5 years of development, and implementation of enterprise-level data solutions utilizing large data sets. Neudesic is an Equal Employment Opportunity Employer All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.Apply Now"}