{"jobID": "2410356113", "jobLocation": "Chicago_IL", "jobTitle": "Data and Analytics Manager", "companyRating": "4.0", "companyInfo": {"Website": "www.axiomlaw.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": " Axiom is looking for a Data and Analytics Manager to join our Delivery Operations Team in Chicago.  This role will support our growing Commercial Transaction and Regulatory/Financial Projects Delivery teams by providing reporting, analytics, and data support. You will work on highly-visible client projects that tangibly improve the way legal services are delivered at scale. You will perform data analysis to solution new engagements, lead cross-functional teams to launch/execute initiatives, and optimize our data and analytics infrastructure on an ongoing basis. Our ideal candidate:Intellectually curious, highly analytical, and purposefully innovative in solutioning and delivering amazing service to our clients and delivery teamsUnderstand data modeling, discern relationships/correlations amongst disparate data, and turn unstructured data into structured to fit into the client's data system data modelExposure and understanding of web technologies, relational databases, data warehousing and ETL toolsHigh proficiency using SQL, Excel, and VBA to analyze business data and develop key business recommendations, which may include providing visualizations that other allows to quickly apprehend and understand those insightsAbility to tackle ambiguous and complicated problems by breaking them down into digestible chunks, applying a project management lens to ensure the timely completion of all deliverablesResults-driven, goal-oriented mindset with high intent on improving our data and analytics capabilitiesYour Responsibilities:Analysis of small and large data sets from various reporting sources, tying data together into a working model using Microsoft Excel (Tables, Named Ranges, Vlookups, Index Matching, …), Visual Basic or SQLOptimization and automation of existing reportingStrategize, develop, and implement revenue-generating and cost-saving initiatives that improve Delivery OperationsDrive data projects through completion through effective project planning, issue and risk tracking, and communications.Mentor junior team members and build out Delivery Operations team methodologies and support model This role will report to our Director, Delivery Operations. Required Skills:SQL and VBA proficiencyAdvance working knowledge of Microsoft Office suite including Excel, PowerPoint, Visio & AccessIntermediate knowledge of MS SharePoint a plusExperience in a 3GL or 4GL language (java, python, powershell) a plusExpertise in data quality, data organization, and metadata.Experience with data visualization tools (Tableau, etc)Knowledge of Project Management MethodologiesExcellent Communication Skills (Written/Verbal)Orientation to provide excellent customer service (both internal and to our amazing clients)Preferred Experience:Experience in a high-growth firm, management consulting, or financial services firm a plusEducation RequirementsBachelor's Degree in a quantitative field such as statistics, mathematics, information systems, computer science, or economics with 4-7 years of experience.Master’s Degree won’t hurt though is not required; those with equivalent experience are encouraged to apply.Who We Are Axiom, a recognized leader in the business of law, is the world’s largest and fastest growing non-traditional provider of legal services. Combining deep legal and business expertise with operational prowess, Axiom works closely with leading law departments to improve their risk profiles, lower cost, and create more value for their corporations. With 1,400+ employees, the firm serves nearly half of the Fortune 100 through 16 offices and 3 delivery centers globally.  This position is with the Projects team – a group of passionate people introducing fresh ideas to a tradition-bound profession. We’re selective in our hiring and focused on creating a unique and addictive culture. With over 900 people across 11 offices globally, Axiom works with nearly half of the Fortune 100. Axiom’s unique approach has been featured in the Wall Street Journal, Financial Times, and The Economist.  Intrigued? Learn more about us and see our other open positions on our website at www.axiomlaw.com.  Axiom is an equal opportunity employer and committed to a diverse workforce.  As a member of an ISO Certified center, all hires will be required to follow the policies and procedures on Information Security Management System in place at the Chicago Center and globally at Axiom. As a member of our team, you will have access to various company and client assets and will be required to maintain the level of security as identified for each asset"}