{"jobID": "2779861429", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.organovo.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Public (ONVO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Scientist Responsibilities:Performs duties related to cell and tissue culture, bioprinting, compound dosing and analysis per established protocolsWill be responsible for new assay development and establishing standard operating procedures (SOPs)Utilizes a range of assay technologies to characterize bioprinted tissue constructs, including ELISA, qPCR, viability and histologyIndependently identifies and implements new assay technologies that have an impact on assay throughput and/or performanceIndependently designs, executes, and performs basic analysis of experiments, including independent troubleshooting.May manage individual projects, including contributing to establishing timelines and deliverablesPrimary cell culture and maintenance of bioprinted tissuesParticipates in fabrication of bioprinted tissues, including independent fabrication where applicablePrepares detailed SOPs that enable transfer of validated assays to project teams and customersReporting of results to supervisor and internally at group meetingsMay present findings at external forums (conferences)May be required to supervise junior associatesOther duties as assignedScientist Skills and Experience:M.S. or Ph.D. in biology, physiology, molecular and cellular biology or closely related fieldExtensive experience in most of the following: mammalian tissue culture, ELISA, qPCR, flow cytometryExperience evaluating and implementing new techniquesMinimum 3 years work experience in an industry settingExperience with 3D tissue culture, histology, and/or liver models is a plusAbility to work collaboratively with multi-disciplinary groups in a fast-paced work environmentAble to work independently on experimental design, execution, and analysisExcellent verbal and written communication skills and track record of ability to effectively present scientific dataDetail and task orientedPositive attitudeKeeps calm under pressureSome weekend work will be required DISCLAIMER: The above statements are intended to describe the general nature and level of work being performed by incumbents assigned to this job. This is not intended to be an exhaustive list of all the functions, responsibilities, duties and skills required for the position, and Organovo retains the discretion to modify functions, responsibilities, duties and skills at any time, including modifying the time devoted to such activities, deleting activities, and assigning other activities.  Organovo is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at 858-224-1064 for assistance. #CB"}