{"jobID": "2649163006", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.bidgely.com", "Headquarters": "Sunnyvale, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "183000", "jobDescription": " About Bidgely  Bidgely (which means “electricity” in Hindi ) is a disruptive technology startup, building an innovative energy monitoring solution that is radically changing consumer perspective on energy efficiency. We have developed ground-breaking analytics that can itemize home energy usage data to the appliance level without using any plug-level monitors. Now, we are setting out to deliver this technology to millions of households across the world and capture a market that is predicted to be billions of dollars in next few years. The combination of big data in energy, data mining and consumer advertising come together to make this world a greener place by helping reduce energy consumption at a massive scale. We are funded by one of the top cleantech VCs in the Silicon Valley. Job Description Research and develop statistical learning models for energy disaggregation. This includes adding new appliance categories and improving accuracy of existing appliance categories, and discovering short/long-term patterns and trends.  Analyze and interpret utilities program results.  Productize proven, cross-validated models into production pipeline.  Collaborate with product, marketing and engineering teams to leverage data science to solve cross-disciplinary problems. Requirements MS/PhD in Computer Science, Statistics, Applied Math, or related areas. Exceptionally strong candidates with a BS and relevant work experience welcome.  Strong background in data mining, machine learning and statistical analysis. Expert in pattern recognition and predictive modeling (time series analysis, logistic regression, decision trees, etc.)  Fluency in programming languages like Java/Python. Experience using Big Data (Hadoop / Cassandra / HDFS / HBase / HIVE / Pig) is a plus.  3+ years hands-on practical experience with large scale data analysis. Fluency in analytical tools such as Matlab/R.  Strong communication and collaboration skills. Keen aptitude for large scale data analysis with a knack for identifying key insights from data."}