{"jobID": "2683131054", "jobLocation": "Pasadena_CA", "jobTitle": "Senior Instrument Data Software Engineer", "companyRating": null, "companyInfo": {"Website": "www.swaintechs.com", "Headquarters": "Horsham, PA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Instrument Data Software EngineerLocation: Pasadena, CA; NASA Jet Propulsion LaboratoryBenefits Offered: Vision, Medical, Dental, 401K  Employment Offered: Full-TimeJob Description:Are you passionate about developing software systems and applications in support of science discovery, data-driven analysis and groundbreaking research?Do you thrive in an environment motivated to answer challenging questions about our universe and where you can work on potential approaches and solutions to new and unusual problems?JPL's Machine Learning & Instrument Autonomy team has an excellent opportunity for a Senior SoftwareEngineer to bring your software development expertise and knowledge to the team of Data Scientists and Technologists in support of the research, science data processing and analysis.Our team is within JPL's Instrument Software and Science Data Systems Section which consists of multidisciplinary teams of engineers and technologists who provide expertise across the domains of instrument operations and science data systems. The team is responsible for safely controlling JPL remote sensing instruments. Transforming data collected by these instruments into scientific measurements and preserving them for future analyses. Providing context and understanding to the measurements. Making the measurements and related information accessible to a broad and global user community.  Our engineering teams build and operate high performance data processing, management and analysis systems capable of handling petabyte scale datasets to support of science discovery, research, operations and applications. They support JPL and NASA missions, as well as other science-based projects. Our research and technology development teams create new onboard and ground-based technologies for data processing, analysis, modeling, reasoning, visualization, management, access and analytics that are infused into our data systems.Responsibilities:Making explainable, confidence-estimating systems both for space-borne autonomy and to facilitate live data exploration and decision supportRefactoring / optimizing current and future numeric ML codes for tight speed, memory, and compute requirementsLeading and enforcing compliance to the best software development practices including continuous integration, documentation styles, and validation test suitesWorking with experts in novel space-supporting ML as well as hardware teams building brand-new space-borne computing infrastructures to push the frontiers of what can be doneEducation/Experience:Master's degree Computer Science or related technical discipline with typically a minimum of 4 years related experience or Bachelor's with 6 years experienceSignificant knowledge/experience with C/C++ and Python languages as well as Linux developmentDemonstrated capability to optimize code for specific computational hardware (e.g. SIMD/GPUs, PIM, multi-core, embedded, FPGA, etc.)Exceptional modern software engineering skills on major projects such as unit testing, end to end validation, continuous integrationEmphasis on modularity, code clarity, ease of maintenance by non-developersAdvanced numeric coding experience (e.g. satellite data, real-time system monitoring, autonomous systems, data pipelines, medical imaging systems)Lead software engineer skills (system design, continuous integration/DevOps, multi-tier testing, simplicity/readability, validation suites, Jenkins, Git pull requests, code review)Excellent communication skills to understand user needs, negotiate requirements, and summarize trade-offs to researchers and sponsorsFamiliarity with probability & statistics and linear algebraKnowledge of some Machine Learning methods (e.g. Random Forests, SVMs, Linear Discriminant Analysis (LDA), Logistic Regression, etc.)Experience with some Machine Learning toolkits (e.g. SKLearn, Scipy, Numpy, Apache Big Data suite, OpenCV, etc.)Architecture Experience: cloud-based & distributed, stream-based, Apache Big Data suite, open sourceTrack record of collaboration with scientists, researchers, or other non-computer-science stakeholdersAbout Swain Techs: Make a difference with Swain Techs. As you consider a career at Swain Techs, you will find countless opportunities to contribute to solutions that are changing the world in real and measurable ways in our technical, engineering, and enterprise IT core business areas.Why Swain Techs?Swain Techs is an award winning 8(a) certified small business with over a decade of exceptional performance.Headquartered in Horsham, PA with offices in Washington, DC., Virginia, Delaware, New York and Florida Swain Techs has been awarded several prime contracts with U.S. Navy-NAVAIR PMA 250, the Department of Health and Human Services (HHS), the Defense Logistics Agency (DLA), the Department of Commerce-US Patent and Trade Office (USPTO) and the U.S. Customs and Border Patrol (CBP) We are among the fastest 5000 growing companies in the US for 2014 and 2015 according to Inc. Magazine. We are CMMi ML3 appraised for Development & Services plus Service System Development and ISO 9001:2008 certified.We know that our continued success begins with you. Swain Techs is always looking for bright, energetic, entrepreneurial people to join our team. If you are looking for an exciting environment, where your opinion is highly valued and you are fanatical about customer service, we would love to talk with you.Come and discover what makes Swain Techs a great place to work.  Visit our website http://swaintechs.com/careers"}