{"jobID": "2830899920", "jobLocation": "Springfield_VA", "jobTitle": "Statistician / Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.generaldynamics.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1952", "Type": " Company - Public (GD) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Job Description  Analyzes user needs and performs research and functional analysis on a variety of projects  Exempt  1. Analyzes user needs to determine functional requirements for a wide variety of projects.  2. Performs technical assessments aimed at improving client systems.  3. Performs functional allocations to identify tasks and their inter-relationships.  4. Researches, identifies, and recommends resources required for task execution and completion.  5. Performs functional modeling based on requirements analysis.  6. Develops new systems or updates existing systems to meet client needs.  7. Serves as technical advisor to clients in assigned subject areas, recommends functional changes, and identifies areas for further investigation.  8. Generates recommendations in the form of technical briefings, reports, and other major documents provided to senior level client personnel.  9. Consults with clients to determine optimum design for assigned projects.  10. Identifies emerging relevant technologies that may result in improvements to current processes and systems.  11. Writes and updates project documentation including system procedures, presentations, and training materials.  12. Conducts functional testing of various systems.  13. Provides guidance and work leadership to less-experienced analysts, and may have supervisory responsibilities.  14. May serve as technical team or task lead.  15. Maintains current knowledge of relevant technologies and subject areas.  16. Participates in special projects as required.  Education  Bachelors Degree in a related technical discipline, or the equivalent combination of education, professional training, or work experience.  Qualifications  8-10 years of related experience."}