{"jobID": "2652530112", "jobLocation": "Sherman_Oaks_CA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.iconmediadirect.com", "Headquarters": "Van Nuys, CA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": " Data ScientistAre you an analytics professional looking to make a difference helping others understand campaign trends, while continually developing your own skillset? Do you believe that there is nothing better than telling a story with hundreds, thousands, or even millions of data records to make an impact? Icon Media Direct is looking for a candidate to join our Business Intelligence and Data Science department to help grow our analytics capabilities and insights for our client campaigns. The Data Sceintist will work to develop and enhance our client analytics services, including media attribution systems, reporting and analysis, testing methodologies, forecasting, and dashboard development. The Data Scientist will be responsible for developing solutions for our clients and establishing processes, as well as measurement protocols, focusing on the analytical insights which show cause and effect for our TV, Print, and Digital media campaigns for direct sales and retail. Responsibilities include oversight and continued advancement of Icon’s proprietary attribution system for evaluating media performance. Additionally, the Data Scientist will drive valuable insights and recommendations utilizing advanced statistical analysis to help optimize and identify opportunities for our clients’ growth. About Icon Media Direct: Icon Media Direct is a leading brand response media agency obsessed with maximizing ROI for our clients. We are a group of experts in media, technology, relationships and analytics working together to consistently exceed our clients’ expectations. With over 17 years of experience, we pride ourselves in the deep relationships we have built with our clients, partners and employees. Headquartered in Sherman Oaks, CA, Icon Media Direct strives to be an employer of choice, offering competitive benefits and compensation, true work/life balance, and a fun, energetic company culture. We are an organization, truly focused on the growth of our team. With in-depth leadership training, strengths-based coaching and mentorship programs, we foster a culture of continual development and positive collaboration. Job Duties:Participate in the development of Icon’s proprietary media attribution system – Icon WebTraxx®Develop enhanced algorithms for Icon WebTraxx™ based on statistical analysis Work with software developers and program managers as neededConsolidate data sources with SQL, Python, and SAS for one unified reporting function (Nielsen, Core, Client Web Data)Drive the identification, creation and adoption of new performance metrics measuring the relative success of our customers’ campaignsAnalyze clients’ historical sales for the creation of predictive models that forecast performancePerform time series analyses and forecasts based on seasonality, trend, and cyclicalityProvides statistical guidance such as statistical viability on client media tests and campaign resultsAct as subject matter expert in the implementation of new approaches, identifying the optimal blend of measurement and analytic techniquesWorks in conjunction with IS team introducing new ideas and methodologiesOther duties as assignedQualifications:Strong organizational skills and attention to detailDemonstrated proactive approach to problem-solving with strong decision-making capabilityAbility to balance high-priority, long-term projects with immediate deadlinesExcellent verbal and written communication skillsStrong presentation skills with an ability to interpret analytical and technical content in an easy-to-understand manner.Possess a drive to innovate and ability to develop new analytical solutions to business challengesAbility to form strong professional working relationships with various personalitiesAbility to work independently in a fast paced, rapidly-changing entrepreneurial environmentWorks well under pressure with a positive, can-do outlookEducation and Experience Requirements:Bachelor’s degree in Mathematics, Statistics, Economics or other quantitative disciplineMaster’s degree in Data Science preferredA minimum of 3-5 years’ experience in a business environment; experience in an agency or marketing environment a plusProficiency in Python a mustDatabase knowledge and experience with big data projectsDemonstrated experience developing a data science and/or analytics project from inception to a production environmentExperience with advanced analytic techniques, including Multivariate Analysis, Multivariate Calculus, Linear Algebra, Time Series Analysis, Machine Learning, and Bayesian estimation using Machine Learning or Markov Chain Monte Carlo estimationProficiency in SQL and TableauData manipulation – experience analyzing large volumes of data and developing a solid understanding of database principles and efficiencies requiredProject Planning Experience– capable of planning and managing analytical components of projects to ensure deadlines are metOther Considerations:Salary based on skills and experienceSkills will be tested upon interviewAll applicants are subject to background checks and offers of employment will be pending the verification of information listed on applicationAll applicants will need to provide a list of professional references"}