{"jobID": "2825941644", "jobLocation": "San_Jose_CA", "jobTitle": "Data Researcher / Analyst - Entry Level", "companyRating": null, "companyInfo": {"Website": "www.avenica.com", "Headquarters": "Minneapolis, MN", "Size": "1 to 50 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Avenica actively recruits college graduates seeking entry level positions using a proven, personalized process to connect grads with great jobs, not with an app or an algorithm. Whether you are fresh out of college and looking for your first real job, or a few years out and looking to redirect your entry level career, we can help you. Our model focuses on finding the right candidate for each position. To learn more, visit our website at www.Avenica.com.The Analyst will encourage the company's growth and goals by providing high-level support for our client by serving as a contact and knowledge resource. Performs research and analysis on performance data, and shares findings with other departments and clients. Candidates must be analytical and possess excellent communication/relationship skills. Position Responsibilities May Include:Conduct analysis and develop reports on programs and processes.Develop, implement and conduct data mining activities utilizing all available resources.Participate in the design and evaluation of research initiatives.Conduct reporting, analytics, and tracking.Create, produce, and maintain reporting outputs as defined by the research department, including developing standard, automated reports.Validate and document current reports on existing resources and document new reports created.Work collaboratively with other departments on their data analytic and report needs.Compile revenue and statistical data for a variety of projects.Communicate with all levels to troubleshoot processes and resolve complex issues.Perform analysis and consulting activities to help client meet business goals.Develop and maintain strong client business relationships.Participate in proactive team efforts to achieve departmental and company goals, while contributing insight and support.Provide leadership to others through example and sharing of knowledge/skill.Maintain professionalism in all verbal and written communications.Job Requirements:Bachelors degree- all majors encouraged to apply including - Economics, History, Psychology, Communications, Business, Anthropology, Liberal Arts, Biology, English, Criminal Justice, Political Science, etc.Excellent communication skillsExperience with research (ex. academic research projects) is preferredAvenica considers the entire candidate not just specific college degree or work experience while trying to find a perfect career match. If we believe we can be a valuable resource to you in your job search, we will help you identify your transferable skills, discuss potential career options, and coach you on your resume and interview skills. All of our services are free of charge to job seekers.  Our customized and personalized approach has helped us connect thousands of college graduates to meaningful entry-level jobs at high-growth companies.Bachelor's degree required. This is an entry level position.  Avenica is an Equal Opportunity Employer and encourages applicants of all ages, experiences, and backgrounds to apply for open positions. Avenica  does not discriminate on the basis an applicants age, race, color, creed, religion, national origin, sex, marital status, disability, sexual orientation, or status with regard to public assistance."}