{"jobID": "2831449629", "jobLocation": "Pontiac_MI", "jobTitle": "Pipefitting Foreman", "companyRating": null, "companyInfo": {"Website": "www.leecontracting.com", "Headquarters": "Pontiac, MI", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Lee Contracting, Inc. is dedicated to client satisfaction. We provide the highest quality design and implementation services available. Lee Contracting, Inc. is at the forefront of innovative changes in process manufacturing, plant optimization, business operations, and overall performance. Our staff is comprised of hardworking, dedicated and ambitious employees and we welcome candidates of the same stature to join and grow with our team!We are proud to offer our employees: Health Insurance  401k  Competitive Wages  Paid Vacation  Paid Holidays  ESOP – Employee Stock Ownership PlanJob Responsibilities:Measure, cut, and bend various sizes of pipe and tubing to required angle/length using pipe cutters and bendersCopper Brazing and solderingThreading and assembling black pipePrepare, fabricate, install and fit pipe to specificationsInstall valves, hangers, supports and flanges in piping systems according to plans and applicable specificationsRepair leaks in all types of pipe systemsAssemble, install and repair piping systems according to specifications and appropriate trade and building codesTrain ApprenticesJob RequirementsMinimum 5 years of Industrial pipefitting experienceWorking knowledge of all types of piping systemsMust be able to read, comprehend, and interpret pipe drawingsAbility to evaluate existing industrial piping designs and offer input on design feasibility and accuracyStrong working knowledge of Industrial/Commercial process heating and cooling systems (service and/or commissioning, and start ups)Possess the ability to work skillfully with both hands constantlyMust have the ability to independently lift and carry objects safely that weigh up to 20 pounds routinely, 50 pounds frequently, and 80 pounds occasionallyAbility to climb and maintain balance on ladders and scaffoldingKnowledge of pipes, fittings, and fixtures for heating, water and drainage systemsMust have the ability to read and interpret a written scope of workPerform basic mathematical computations and use measuring toolsMust be able to identify basic trade materials by size, shape and function and safely use small power tools and hand toolsManagerial skillsReliable transportationPipe welding using mig, tig, or stick a plusThis job description reflects management s assignment of essential functions, and nothing in this herein restricts managements right to assign or reassign duties and responsibilities to this job at any time.No Phone Calls Please - Position Will Require A Background Check - Only Qualified Candidates Will Be Contacted"}