{"jobID": "2803939332", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analyst ( Human Resources)", "companyRating": null, "companyInfo": {"Website": "www.spectraforce.com", "Headquarters": "Raleigh, NC", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Tittle:Data Analyst ( Human Resources)Location:San Antonio TX 78249Duration:6 Months The purpose of this position is to research, analyze, and support reporting of all Human Resources related data. This role is responsible for managing incoming reporting requests and ensuring accurate and timely delivery of HR Reporting and Analytics to create a positive customer experience. Team member will develop, build and streamline standard and ad-hoc report requests including managing scheduled reports and coaching requesters on self-service. The position will be a Subject Matter Expert in our HCM and other Reporting systems. This position supports the broader HR Organization as well as non-HR business initiatives requiring HR data. The position provides expertise and is a point of contact cross functionally. Key Responsibilities · Serve as the subject matter expert for Reporting and Analytics programs, policies and processes  · Define, build and test new report requests in Workday  · Provide internal customers with recommendations from the Report Catalog and coach them on proper process to request and self-serve  · Identify and recommend methods to update, simplify and enhance processes, procedures and technologies  · Support the Payroll team with reports from the Payroll System  Provide technical support and guidance on core ASC Reporting and Analytics HR processes (respond to and resolve increasingly complex issues)  · Act in a consultative and project coordinator role to functional teams to define and implement program delivery. Identify process and systems implications of, and solutions to, new or modified programs and policies  · Primary interface to HR and Non-HR functional departments to appropriately escalate inquiries/concerns  · Lead or participate in continuous improvement initiatives to ensure services are effectively delivered  · Use online case management tool to manage incoming requests and provide timely closure of cases ensuring quality customer service  · Provide on the job training to members of other Associate Service Center teams  · Develop and publish Regional and Global metrics summarizing volume and performance against targets  · Provide input into appropriate metrics and reports around compliance, performance, and data analytics  · Provide data for internal and external audit Education · Bachelor’s Degree required with a professional HR/Business Administration qualification or Diploma preferred  · Minimum of two 2 years’ experience Reporting and Analytics required Knowledge, Skills & Abilities · Intermediate to Advanced level of Microsoft Excel knowledge and experience required  · Workday experience is strongly desirable  · SAP experience is strongly desirable  · Microsoft Office experience including Share point required  · Case Management system experience preferred  · Ability to pay close attention to details and use time effectively  · Strong problem solving and analytical skills. Ability to receive requests and create solutions  · Excellent oral and written communication skills  · Proficient in Reporting and Analytics end to end HR processes"}