{"jobID": "2699769491", "jobLocation": "Crystal_City_VA", "jobTitle": "Senior Data Analyst - PeopleSoft", "companyRating": null, "companyInfo": {"Website": "www.coresysconsulting.com", "Headquarters": "Alexandria, VA", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION SUMMARY:Multiple openings in Crystal City, VA. Plans and manages system-wide data analyses regarding the allocation of enterprise application functions for the IPPS-A program. Manages data analysis of systems in coordination with developers, business analysts, system owners. Ensures functional business requirements and process issues are resolved using comprehensive enterprise applications solutions in reference to data needs. Works with senior managers to identify and solve data issues, design solutions, develop conceptual models, map functional requirements into technical requirements, and support design and implementation of conversions and interfaces. Analyzes the IPPS-A information system baseline and performs a data analysis between the baseline, user operational requirements, and the operating capability of products. Supports technical data design reviews, enterprise approach validations, and work product assessments. Duties and Responsibilities: -Elicits and documents data requirements and specifications from functional users, system owners and subject matter experts  -Translates data requirements into a best fit within the application, and develops processes and documentation that support data  -Perform data analysis, mapping and transformation rules to convert and interface data  -Develops and maintains standard systems requirement documents including but not limited to: interface design documents, run books, run books, test plans, test scripts, business process workflows, data requirements documents, and use cases.  -Supports application configuration and security setup as needed  -Implements complex enterprise system configurations and end to end development design  -Evaluates and provides feedback on system and functional design documents, test plans, scenarios, and other associated artifacts  -Defines test scenarios based on data requirements  -Creates test scripts to prove each scenario through system and user acceptance testing  -Supports  -Meets deadlines and manages multiple, dynamic priorities  -Communicates effectively and demonstrates ability to work in a team-oriented environment  -Applies HCM knowledge and industry best practices in developing the to-be business processes and procedures Required Qualifications: -Bachelor's degree in Computer Science or Information Systems or other technically relevant degree  -Versed in the design, implementation, test and deployment of PeopleSoft ERP HCM version 9.x  -10+ years of experience with a minimum of 4 years of functional or data experience with PeopleSoft HCM 9.x  -Expertise with one or more of the following PeopleSoft modules: HR Core, Global Payroll, Base Benefits, Benefits Administration, Time and Labor, Talent Acquisition  -Must be a team player and be able to adjust to a dynamic working environment that supports a government agency  -Must have strong written, verbal, and listening skills  -Must have strong analytical skills and can demonstrate strong problem solving skills  -Ability to communicate in a clear and concise manner and success working in Integrated Product Teams (IPTs)  -Must have an active security clearance  Desired Qualifications: - Experience with PeopleSoft HCM 9.x  - ERP implementation experience in large scale projects Must be a US Citizen and possess a Security Clearance due to Federal Contracting Requirements About Us: CoreSys Consulting is a Veteran Owned Small Business (VOSB) working primarily within the US Department of Defense. The CoreSys leadership team has over twenty years of project planning, execution, and maintenance of Information Technology (IT) systems. We specialize in Custom Application Development, Enterprise Architecture and Governance, DoD Architectural Framework (DoDAF), Service Oriented Architecture (SOA), CIO Support, Application Transformation and Modernization, J2EE Solutions, Data Warehousing, etc. Employees are eligible to participate immediately in CoreSys Consulting Services competitive employee benefits package, which includes medical, dental, vision, disability and life insurance as well as participation in our 401k program with a company match."}