{"jobID": "2819819572", "jobLocation": "Jersey_City_NJ", "jobTitle": "Applied Data Scientist in Infrastructure", "companyRating": "3.6", "companyInfo": {"Website": "www.chase.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": "JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of > $2 trillion and operations in more than 60 countries. The firm is a leader in investment banking, financial services for consumers, small business and commercial banking, financial transaction processing, asset management, and private equity.Global Technology Infrastructure (GTI) is the technology infrastructure organization for the firm, delivering a wide range of products and services, and partnering with all lines of business to provide high quality service delivery, exceptional project execution and financially disciplined approaches and processes in the most cost effective manner. The objective of GTI is to balance both business alignment and the centralized delivery of core products and services. GTI is designed to address the unique infrastructure needs of specific lines of business and the demand to leverage economies of scale across the firm.We are seeking a data scientist to join our data management team. You have experience in building and implementing statistical or machine learning systems, as well as analytical tools and systems to perform in depth analysis in support of short and long range decision making.You develop strong working relationships with others and want to work in a collaborative team environment. You think deeply about the best way to solve a problem and root out important details that most people would ignore. You’re resourceful, self-motivated, and have no problem working independently to dig up and crunch data to solve a problem. You’re a skilled communicator who can express complex concepts and ideas in a simple manner.You will work within a strong data engineering team, in a collaborative approach to tackle complex problems. You love solving puzzles and digging deep to find elusive details and patterns that most others would miss. You enjoy diving into the engineering details of the data pipeline as well.You will be responsible for developing and implementing a data strategy with the data governing bodies, business partners and technology leads for their data subject area domain. This will involve helping to develop and implement the long term data strategy and systems architecture such as provisioning of data from recognized Authoritative Data Sources. DescriptionResponsible for the design, development, testing, integration, operation and support of infrastructure services that meet stated business requirements and adhere to coding best practices and architecture standardsAdheres to architectural design standards, risk management and security policies, data management policies, leading presentations in architecture review, strategic technology directions, best practice development (e.g., estimating models), mentoring less experienced team members, code reviewsSupports all elements of Software Development LifecycleParticipates in the development of integration elements, data models, Application Programming Interfaces (APIs)Assists in the building of open 3rd-party Software Development Kits (SDKs)Primary Responsibilities:Works as a member of a team developing software solutionsHandles more advanced technical problems and create solutions that solve business problemsIndependently solves technical issues and able to collaborate and contribute ideasIntegrates enterprise components (e.g., reference data, security, messaging) to build larger systemsFully analyzes problems, design, develop and test the codeCollaborates with multiple teams including engineering, development and operations teamsStrong engineer with demonstrated experience and interest in data analytics, including machine learning Prior experience in both Systems Engineering and Software DevelopmentFront to back thinking – taking a business idea through the entire delivery chain and on to ProductionAdvanced knowledge in at least one of the infrastructure disciplines and functions:Internals of distributed Operating System (Unix/Linux, Windows, Z/OS) internalsSystems programming Data pipeliningNetwork programmingExperience in large scale software development in one or more of the programming languages (Python, Java, Scala)Enterprise scale and resiliencyExperience in system and software security and entitlements (SSO, Windows, Kerberos, LDAP, Windows AD)Modern compute technologies (e.g., virtualization,cloud)Familiar with Agile development process and automated testingExperience working across large infrastructure environments and distributed across multiple data centersExperience in end-to-end systems automation and orchestrationExperience in Systems and Application monitoring systems and instrumentationExperience with data management systemsEducational background in data science, through university, bootcamp, or other. Professional experience a strong plusStrong computer science fundamentalsA passion for building software, and a long term career, as a software technologist"}