{"jobID": "2811682256", "jobLocation": "Irving_TX", "jobTitle": "SAP Inventory Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.lehighhanson.com", "Headquarters": "Irving, TX", "Size": "10000+ employees", "Founded": " 1897", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Lafarge North America, Buzzi Unicem USA"}, "estimatedSalary": "72000", "jobDescription": "Position Title SAP Inventory Data Analyst  04-Jun-2018 Department Finance Primary Location Irving-TX Job Posting Analyze data in support of new processes for SAP. This person will be responsible for reviewing material usage, purchasing, and inventory data in order to manage data required to automate procurement through MRP for spare parts. This role is critical to building data for the initial go live based on data trends as well as managing this data into the future as we mature in our system. Knowledge/SkillsProficient in the use of Tableau or Qlikview/Qliksense data analysis.Expert Skills in MS ExcelProficient in MS Access, Word, and Power PointSound Communication and Presentation skillsAbility to turn raw data into logical information for reportingA self-starter who has extensive knowledge in reporting and analysis to create and analyze standardized and ad-hoc reports and provide to management or end-userAbility to identify problems and issues and assist with reporting questionsThe position requires above average attention to details, concern for the exact correctness of work, and strong commitment to completing tasks on timeA somewhat faster-than-average pace will be the norm for this positionExperienceMin 3 years experience in SAP.Min 5 years inventory analysis experienceMin 5 years experience with MRPEducationBachelors in Business, Engineering, Computer Science or equivalentAuto req ID6775BRLine of Business Corporate Administration (SSC, IT, Employee Services, Etc.) EEO Statement Equal Opportunity Employer – Minority / Female / Veteran / Disabled "}