{"jobID": "2747232957", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Executive", "companyRating": null, "companyInfo": {"Website": "www.terminus.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Join Terminus' BrightFunnel team in San Francisco, and help B2B marketers show their true impact on revenue with the BrightFunnel Revenue Intelligence Suite. Terminus is one of the fastest-growing companies in B2B marketing technology and an Inc. Magazine Top 50 workplace in the nation. Since BrightFunnel became part of Terminus in January, weve been rapidly hiring in our San Francisco Sutter Street office.Founded in 2014, Terminus created the industry-leading Account-Based Marketing (ABM) platform and #FlipMyFunnel community that leads the ABM category. Now, were investing in marketing analytics and attribution, and were looking for more Terminators to join our team.Everyone at Terminus strives to provide the best customer experience and fanatically obsess over making each of our customers successful. We have a relentless commitment to supporting the personal and professional growth of our Terminators.Description:This role requires a rare combination of eloquent storytelling, effortless technical competency, and a passion for building a great business.Day to day, with your strong competency in modern marketing practices, you will support our prospects as they explore multi-touch attribution and incorporating BrightFunnel into their business, and operational workflow. That means guiding prospects through the five unique stages of our sales process, building deep relationships across the organization, and helping BrightFunnel build a world-class business.Month to month, youll influence the future of BrightFunnels sales process and culture.. Ultimately, youll become a trusted advisor to our VP of Sales and Customer Success, and some of the most important marketing organizations in the world.Responsibilities:Own the pre-sales customer engagementMaster the BrightFunnel Sales ProcessDeliver against a meaningful quota of ARR and Services revenuePartner with Customer Success Managers and Customer Success Engineers to design and deliver a BrightFunnel business caseDevelop deep relationships across the B2B marketing landscapeHelp us scale the businessQualifications:Have a rare combination of relevant experience, exceptional sales skills, and high technical competencyHave a strong understanding of (and interest in) the Martech and BI landscapeHave experience selling to and working with CMOs, VPs of Marketing, and Directors of Demand Generation and Field MarketingAre highly analyticalAre deeply empatheticLove building thingsHave strong process and/or project delivery disciplineHave 3-5 years experience in a closing role Incredible Benefits, Incredible Company! 100% employer paid Health, Dental, and Vision Insurance for employee only coverage100% Short-term and Long-term Disability Insurance401K with company matchUnlimited vacationGym membership reimbursementCasual dress all-day, everydayRegular team outings, parties, and surprisesWeekly free lunch, unlimited snacks and drinksWork from home dayCulture that emphasizes personal and professional growth"}