{"jobID": "2608170522", "jobLocation": "San_Francisco_CA", "jobTitle": "Financial Advisor", "companyRating": null, "companyInfo": {"Website": "www.edwardjones.com", "Headquarters": "Saint Louis, MO", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Wells Fargo, Morgan Stanley, Merrill Lynch"}, "estimatedSalary": null, "jobDescription": " Prepare yourself for a brand new career - one where your success is completely in your hands. Edward Jones is a privately owned financial-services leader with nearly 14,000 Financial Advisors in the United States and Canada and more than 90 years of serving individual investors. As an Edward Jones Financial Advisor, you will take charge of your career and your income as you form meaningful, long-term relationships with clients as you help them work toward their financial goals. What is the role of a Financial Advisor?Deliver personalized investment solutions to help clients work toward their long-term financial goalsDevelop and deepen client relationshipsBuild and manage an Edward Jones branch in your communityWhat traits and competencies should a Financial Advisor candidate possess?A track record of professional success Relationship-building skills and commitment to establishing long-term clientsStrong desire for performance driven compensation and growing earnings potentialA self-motivated, highly driven and entrepreneurial personalityDesire to work from an office in your communityWhat can an Edward Jones Financial Advisor expect?Industry-leading training* to help you succeed in your new roleProfessional support to pass your Series 7, Series 66 and insurance licensing examsFinancial support during exam study, training and the first three years as you grow your client baseUnlimited earnings potential that includes commissions, bonuses, profit sharing and incentive travelCompany-provided office in your community and a dedicated branch administrator to help manage client services and marketing activitiesOngoing business development training, mentorship and networking opportunitiesThe ability to provide strategic and personalized insight for your clients with support from a company that shares your integrityThe opportunity to succeed with the flexibility to balance personal and family valuesWhat are the preferred qualifications for the Financial Advisor role?College degree Ability to put the client firstProven track record of successStrong communication skillsConfident and resilient personalityAbility to listen, understand and give adviceGoal oriented at an individual and team levelIn the role of Financial Advisor at Edward Jones, well support you with resources and training to help you perform at your best from day one. Join an organization that is consistently recognized as a great place to work and places on FORTUNE magazine's 2014 FORTUNE 500 list of the largest U.S. companies by revenue. Discover the fulfillment of truly driving your own career in a company that respects your independence and ambition. We value financial services experience If you have past experience as a stockbroker, finance manager, financial adviser, financial consultant, wealth manager, investment banker, financial planner, investment advisor, investment consultant, investment representative, branch manager, broker or certified financial planner (CFP), your experience could translate well to the financial advisor job at Edward Jones. We also look for potential candidates who have experience in banking, accounting, real estate, hospitality, investment banking, insurance and sales. If you've held a job as an account manager, territory manager, sales manager, sales director, wholesaler, business development manager, business development coordinator, business development officer, area manager or regional manager, your skills and qualifications could be transferable to the financial advisor role"}