{"jobID": "2495162158", "jobLocation": "Redondo_Beach_CA", "jobTitle": "Data Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.ozobot.com", "Headquarters": "Redondo Beach, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview At Ozobot, we make creative robot companions for kids ages 6 to 99. We believe that big ideas come from diverse perspectives and a balance of science and engineering skills with art, creativity, and self-expression. To that end, weve assembled a colorful crew of developers and designers who work and play out of our offices on the Redondo Beach Pier. Job Summary We are looking for an experienced Data Analytics Manager to join our family of Ozobot fans. The right candidate will be energetic, enthusiastic, and mission-driven (like us). They will have serious social media mojo, enough to make the role their own; craft meaningful customer relationships; and keep pace with an exploding digital community of kids, parents, and educators who like, snap, and share Ozobot creations at an impressive rate. Our Data Analytics Manager will be responsible for strategizing and executing data analysis and reporting across all Ozobot brand platforms (websites, app, e-commerce) with the goal of increasing our understanding around customer traffic, engagement, and satisfaction. ResponsibilitiesSeek out improvements in current internal reporting and performance monitoring to drive more accuracy, better insights, and more streamlined processesWork with Marketing team to prepare detailed models to identify opportunities to improve efficiency within and across channelsPresent weekly and monthly reporting to all layers in the organizationBuild analytical tools and reports to ensure timely, consistent understanding of performanceBuild models to deepen understanding and prediction of customer behavior and valueCritically evaluate data, industry trends, and competitor performance.Work across a range of analyses spanning customer acquisition, customer retention, customer experience and product analyticsPerform ad-hoc data analysis to answer business questions and guide strategyAnalyze user behavior, marketing campaigns and product usage to identify opportunities for product marketing teams Develop customer insights and identify key performance indicators to design A/B and multivariate testsDesign and execute analysis of customer behavior and usage patterns, including account activation, print behavior, attrition and retention and customer lifetime valueMinimum Qualifications5+ Years working with customer and marketing analyticsDeep experience with Google Analytics, search and social marketing toolsExperience with mobile data analysisAdvanced experience working with reporting tools and dashboardsExpert knowledge of Microsoft Excel pivot tables & data sourcesAbility to multitask and manage multiple projects at onceProficient in data mining software such as SQL or equivalentAdvanced capabilities in extracting and manipulating large data setsBA/BS degree in Math, Statistics, Computer Science, or FinanceStrong communication and relationship-building skillsSelf-motivated individual who can expertly prioritize and multitaskWorks well under pressure and able to meet tight deadlines"}