{"jobID": "2824094368", "jobLocation": "Chicago_IL", "jobTitle": "Big Data Engineering Lead - Eden Prairie, MN", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "84000", "jobDescription": "Combine two of the fastest-growing fields on the planet with a culture of performance, collaboration and opportunity and this is what you get. Leading edge technology in an industry that's improving the lives of millions. Here, innovation isn't about another gadget, it's about making health care data available wherever and whenever people need it, safely and reliably. There's no room for error. Join us and start doing your life's best work.(sm)The Payment Integrity Software Engineering team is looking for strong leaders who are collaborative, self -starters, take ownership / accountability and drive results. The Lead Big Data Engineer will involve managing one or more Scrum teams, provide technical leadership and work with Product Owners/Functional experts and Senior Management. The person should be comfortable with and enjoy doing hands on development (30-50% time). The person will be delivering on strategic initiatives for Big Data, Cloud and APIs for all of Optum Product Engineering while advocating and accelerating DevOps/Agile adoption.*This position must be located in Eden Prairie, MN. Partial relocation assistance available for non-local candidates.Primary Responsibilities:Provide technical leadership in architecture and design for commercial software development and the introduction of new technologies in the Public Cloud (AWS), Big Data and API Space Lead the technology transformation from our legacy Data and Analytic platforms to a Big Data Cloud based Modern Software paradigm Create a common framework and repository for the development of Modern APIs available to the Optum Product Engineering Team Demonstrate leadership in the context of software engineering and be an evangelist for engineering best practices Create next generation commercial applications to use our Data as a strategic platform to grow the top line revenue Stay abreast of leading-edge technologies in the industry evaluating emerging software technologies Work collaboratively with all business areas to assess unmet/new business needs and solutions Encourage the growth of junior engineers on the team through skills development, mentoring and technical guidanceRequired Qualifications:BS / BA in Engineering, Computer Science or equivalent experience 8+ years of software product development experience working on commercially available software and / or healthcare platforms Experience with Big Data technologies such as Hadoop (HDFS), Hive, Spark, or Kafka Experience managing, leading, and / or mentoring teams in using Big Data technologies Experience in using modern software engineering and product development tools including Agile / SAFE, Continuous Integration, Continuous Delivery, DevOps etc. Minimum of 6 months of experience developing solutions hosting within key major cloud providers such as Azure and AWS or private cloud using Mesos, Kubernetes/OpenShift Proven track record of acting as an advocate for driving new technology across the organization via the creation of communities and publishing SDK / libraries for reuse across the organization Strong experience of operating in a quickly changing environment and driving technological innovation to meet business requirement Proven track record of building relationships across cross-functional teamsPreferred Qualifications:Java development experience highly preferred Experience with Big Data technologies like Hbase, MapReduce, Storm, Flume, Sqoop, Pig, Apache Drill, Oozie, Zeppelin Experience building Big Data solutions on public cloud (AWS EMR) Experience building data pipelines with Kafka and Kafka Streams Experience developing Java RESTful Services using Spring Boot and Netflix OSS Good understanding of Microservices architecture Experience with Automation Frameworks Selenium WebDriver, Restassured, SOAP UI Exposure to UI technologies like Angular4 Ability to establish repeatable processes, best practices and implement version control software in a Cloud team environment Experience of developing cloud based API gateways would be highly desirable Experience / exposure to API integration frameworks Experience in the healthcare industry Be able to create a startup mentality to accelerate the introduction of new capabilities and transform teams Demonstrate being an avid supporter of the Open Source software community Excellent time management, communication, decision making, and presentation skills Display a strong desire to achieve and attain high levels of both internal and external customer satisfactionTechnology Careers with Optum. Information and technology have amazing power to transform the health care industry and improve people's lives. This is where it's happening. This is where you'll help solve the problems that have never been solved. We're freeing information so it can be used safely and securely wherever it's needed. We're creating the very best ideas that can most easily be put into action to help our clients improve the quality of care and lower costs for millions. This is where the best and the brightest work together to make positive change a reality. This is the place to do your life's best work.(sm)Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.Job keywords: lead Big Data engineer, application development, software development, product development, leadership, cloud, AWS, Azure, Hadoop, HDFS, Hive, Spark, Kafka, Mesos, Kubernetes, OpenShift, Java, Agile, SAFE, Continuous Integration, Continuous Delivery, DevOps, open source, API gateways, automation frameworks, healthcare, microservices, Optum, Eden Prairie, MN, Minnesota, Minneapolis, Chicago, IL, Illinois, Madison, WI, Milwaukee, Wisconsin, Sioux Falls, SD, South Dakota, Fargo, ND, North Dakota"}