{"jobID": "2829528555", "jobLocation": "KenTownshipood_MI", "jobTitle": "Maintenance Technician", "companyRating": "3.6", "companyInfo": {"Website": "www.rothburyfarms.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1923", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "16", "jobDescription": "Position Title: Maintenance TechnicianReports To: Maintenance ManagerPlease note: Only 2nd and 3rd Shift Positions are Available.Company Overview: Roskam Baking Company is a family owned and operated business based in Grand Rapids, Michigan. We have been producing high quality food products since 1923. Our strategic partners include some of the largest food companies and retailers in North America. We also have our own product lines under the Rothbury Farms and Grandpas Oven brands. Our product lines include croutons, snacks, caramel corn, popcorn, seasoning blends, fresh bakery products, candy, dry mixes, glazes, frostings, and frozen foods. Our six facilities supply a complete service of production, packaging, and warehousing. Like the food industry, we are rapidly growing and looking for 15 additional technicians to support our new business.Key Responsibilities:Perform highly diversified duties to install and maintain production machines and the plant facility equipment.Provide emergency/unscheduled repairs of production equipment during production and performs scheduled repairs.Perform simple machinist duties and responsibilities.Perform mechanic skills including, but not limited to mechanical electrical, pneumatic, hydraulic, and troubleshooting.Diagnose problems, replace or repair parts, test and make adjustments.Perform regular preventive maintenance on machines, equipment and plant facilitiesPerform a variety of plumbing maintenance and carpentry functions.Use a variety of hand and power tools, electric meters and material handling equipment in performing duties.Detect faulty operations, defective material and report those and any unusual situations to proper supervisors.Comply with safety regulations and maintain clean and orderly work areas.Required and Preferred Qualifications:Required:High School Diploma or equivalent required1-2 years of basic welding and fabrication skills is neededPreferred:An AA degree in mechanical, electrical or industrial maintenance a plus3-5 years of previous experience in plant maintenance or machine repair; strong hydraulic, pneumatic, mechanical and industrial skills with experience is preferredMust be able to read and comprehend blueprints and equipment manuals, and be proficient in basic industrial/electrical skillsCompletion of an apprenticeship/journeyman program is desiredApplicants: Roskam Baking Company offers a competitive compensation package with off-shift premiums! We offer complete medical, dental, and vision benefits, life and disability insurance and a 401k plan."}