{"jobID": "2828054925", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst II", "companyRating": "3.1", "companyInfo": {"Website": "www.velocitycu.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 1947", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Velocity's mission is to provide our members personalized service and unique value as their local banking alternative. Our vision is to be the preferred financial institution for our community and to make a positive impact on our members and their financial goals. Our goal is to consistently deliver superior service to all credit union members and staff.  Work Schedule: Monday Friday 8:30am 5:30pm and always on call as needed DUTIES Maintains the core system, its databases, and back-up integrity.  Creates automated and reusable routines for extracting requested information from database systems.  Prepares custom reports as requested by department heads and as necessary on a recurring basis.  Analyzes complex data systems and documents data elements, data flow, relationships and dependencies  Supports 3rd party software integrations to the core Credit Union system.  Coordinates and executes tasks to be performed on the core computer system.  Helps identify data processing errors and problems; assists in resolutions.  Assist with HelpDesk duties and with resolving problems; especially those related to member transactions or any financial services.  Responds to IT problems or needs on a 24 hour 7 day per week basis (on-call). QUALIFICATIONS Must have sound knowledge of relational database theory, query language protocols and practices.  UNIX/Linux knowledge and experience is necessary.  Shell scripting knowledge is a plus.  SQL Query knowledge is a plus.  Knowledge of Windows networking infrastructure, operating systems, and application support.  Must have a professional level knowledge of computers and specific knowledge about the programming, operation, and maintenance of computers.  Ability to learn and adapt quickly to new processes.  Ability to comprehend complex functions and procedures and to be able to disseminate that knowledge in a clear and understandable format to others.  Ability to prepare and maintain confidential records and reports.  Ability to analyze statistics and financial data.  Ability to install computer cables and equipment.  Three years' experience in a related I.T. field required.  Must have a High school diploma or equivalent along with additional education in computers from vocational, private, self-paced, or similar sources. Bachelor's degree in computer science, information systems or related field is a plus.  Velocity provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, genetics, sexual orientation, national origin, age disability, or status as a covered veteran in accordance with applicable federal, state and local laws.0"}