{"jobID": "2815707943", "jobLocation": "Burbank_CA", "jobTitle": "Senior Digital Marketing Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "80000", "jobDescription": " Active participation in a range of market strategy projects essential to KP's membership and margin goals. Market Strategy&Analysis; Consultants provide analytical/strategic-thinking and leadership skills that enable project teams to:  1) isolate business issues;  2) design and execute analytics for studying business issues (market research, scenario planning, forecasting, market share, profitability, etc);  3) bring technical/content expertise (competitive intelligence, utilization, financial analysis, deep data analysis & programming);  4) vet findings and make formal recommendations to senior levels of KP leadership;  5) create documents (strategic segment plans, utilization reports) that inform critical strategic issues. Preferred: The role acts as the primary day-to-day strategic and execution contact for Digital Marketing client deliverables. This person will guide stakeholders in identifying KPIs and analyze web analytics data as well as other offline data to evaluate site performance and answer business questions critical to executing business initiatives and driving strategy.  Support analytics team in working with key stakeholders to understand the analytics objectives and needs and develop the appropriate tagging strategy for the web analytics tools.  Create custom analytics tagging specifications for Digital Marketing websites. Conduct quality assurance across all platforms and devices and validation of data collected by analytics tools, plus ongoing audit of existing implementations of Adobe Analytics to improve tracking and implementation.  Essential Functions  Collect and organize data from mainframe files, data warehouse reports, vendor extracts, departmental spreadsheets and databases, and internet/intranet sites for easy use by internal business and analytical clients.  Create and maintain databases as a tool for delivering data to internal clients.  Use data to investigate identified business issue and to address hypotheses.  Create more complex analytical views of data, identifying major assumptions and gaps.  Develop preliminary conclusions- tell the story. Basic Qualifications: Experience  Minimum two (2) years of related experience. Education Bachelor's degree in related field, OR four (4) years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A Additional Requirements: Working knowledge of policies, practices and systems.  Frequent use and general knowledge of industry practices, techniques, and standards.  General application of concepts and principles.  Full use and application of standard principles, theories, concepts, and techniques.  Proficient in MS Excel, Access and other databases. Must know how to manipulate databases such as MS Excel and/or Access, as well as manipulating reports and generating reports.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Minimum three (3) years of related experience preferred. "}