{"jobID": "2764110542", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.denodo.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Composite Software, Informatica, Red Hat"}, "estimatedSalary": "54000", "jobDescription": "Job DescriptionThe Opportunity We are seeking talented candidates with a desire to work in a vibrant workplace and passionate about what we do. This position will report to the Head of Technical Unit.  The selected candidate will be self-motivated, and a fast learner, with the ability to take initiative and multi-task under tight deadlines. Those who thrive in this role will challenge themselves to improve corporate operations to take their career and the company to the next level. You will play a significant role in the growth of the company and maintain cross-functional relationships with business and technical teams to ensure efficiency. Location: A Coruña, Spain or Madrid, Spain Duties & ResponsibilitiesIdentify, evaluate and implement external services and tools to support data validation and cleansingProduce and track key performance indicatorsDevelop and support reporting processesMonitor and audit data qualityIdentify, analyze, and interpret trends or patterns in complex data setsDesign and carry out surveys and analyze survey dataPrepare reports for internal and external audiences using business analytics reporting toolsCreate data dashboards, graphs and visualizations Location  A Coruña, SPAIN  Function  Analyst  QualificationsDesired Skills & ExperienceBS or higher degree in Statistics, Math, Computer Science or related field.Ability to write complex SQL queries to analyze our databases.Experience with BI Tools / Analytic Software (Tableau, Qlik View, Power BI, or similar).Highly proficient in Microsoft Excel.Be passionate about data, creative, highly meticulous, able to work under tight deadlines and are a team player.Salesforce knowledge (or any other CRM tool) is a must.Excellent communication skills.Proven analytical and research skills. Employment PracticesWe are committed to equal employment opportunity. We respect, value and welcome diversity in our workforce.  We do not accept resumes from headhunters or suppliers that have not signed a formal fee agreement. Therefore, any resume received from an unapproved supplier will be considered unsolicited, and we will not be obligated to pay a referral fee."}