{"jobID": "2803128617", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Enterprise Data Warehouse, Full-time, Days", "companyRating": "3.3", "companyInfo": {"Website": "www.sralab.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1953", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TIRR Memorial Hermann, Kessler Institute for Rehabilitation"}, "estimatedSalary": "71000", "jobDescription": "General Summary The Data Analyst will be part of the Data Innovation and Analytics Lab (DIAL). Responsible for data analytics to support the needs of the business units by utilizing the Enterprise Data Warehouse. The Data Analyst/Informatics Specialist will work with cross-functional team of stakeholders at the Shirley Ryan AbilityLab, to help gather insights for research, quality, operations and outcomes.  The Data Analyst will consistently demonstrate support of the Shirley Ryan AbilityLab statement of Vision, Mission and Core Values by striving for excellence, contributing to the team efforts and showing respect and compassion for patients and their families, fellow employees, and all others with whom there is contact at or in the interest of the institute.  The Data Analyst will demonstrate Shirley Ryan AbilityLab Core Attributes: Communication, Accountability, Flexibility/Adaptability, Judgment/Problem Solving, Customer Service and Core Values (Hope, Compassion, Discovery, Collaboration, & Commitment to Excellence) while fulfilling job duties. Principal ResponsibilitiesThe Data Analyst:Gathers, profiles, and analyzes data to support requirements analysis and/or analytics.Collaborates with technical experts and business units to determine the best possible reporting/dash-boarding mechanisms.Analyzes data and generates reports that ensure data integrity by applying statistical methods.Performs data manipulation on large sets of data to extract actionable insights.Combines data from different sources and conducts source to target mappingIdentifies trends and patterns in data and creates data visualizationsPerforms complex analysis including statistical regression and forecastingDrives analytical rigor across the organization to guide decision makingPerforms other duties that may be assigned in the best interest of the Shirley Ryan AbilityLab.Reporting RelationshipsReports directly to the Chief Data Officer as part of the Data Innovation and Analytics Lab (DIAL).Knowledge, Skills & Abilities RequiredBachelor's degree in Computer Science, Information Systems, Data Science, Engineering or related field. Masters preferredMinimum of 2 years of related experience in a corporate IT environment with a comprehensive knowledge of database tools (e.g. FRWin, SQL, Oracle, Excel, etc.) and continues developing professional expertise. Experience with data modeling, a plus.Healthcare experience highly desired, especially familiarity with ICD-9,10, CPT and other healthcare vocabulariesAble to use professional concepts and apply company policies/procedures to work on problems/issues of moderate scope where analysis of situations or data requires a review of a variety of factors.Able to exercise judgment within defined procedures and practices to determine appropriate action.Hands-on experience with statistical software packages and data mining tools (e.g. SAS, R, SPSS, Weka, Rapid Miner, etc.)Hands-on experience with industry leading data visualization and BI tools (e.g. Business Objects, Microsoft, Cognos, Tableau, OBIEE, Qlickview, etc)Strong strategic, analytical, technical, and project management skillsDemonstrated ability in engaging and communicating with stakeholders, across both business and technology functions.Working ConditionsNormal office environment with little or no exposure to dust or extreme temperature. The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified.  SRAlab is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. "}