{"jobID": "2781140071", "jobLocation": "Chicago_IL", "jobTitle": "ARA Data Sciences C&IP; Retail Manager", "companyRating": null, "companyInfo": {"Website": "www.deloitte.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1850", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " EY, PwC, McKinsey & Company"}, "estimatedSalary": null, "jobDescription": " As a Deloitte Consulting Consumer & Industrial Products (C&IP;) / Retail Manager in the Data Sciences practice of Deloitte’s Human Capital group, you will provide industry insight and technical and analytical support in a consulting environment. The job functions include the following:  Provide overall project management and client relationship support  Actively participate in defining project scope and objectives  Participate and lead aspects of the proposal development process  Contribute to the development of proposal pricing strategies  Provide technical design assistance for predictive model development  Present and communicate project deliverables/results to clients  Function as integrator between business operation needs and advanced analytical solutions  The team  A part of Deloitte Consulting LLP, our Human Capital professionals work closely with clients around the world to develop effective and efficient people-centered solutions. Our team helps clients define their talent strategy and align it with their executive business vision using innovative strategic frameworks that enhance HR service delivery models, set the stage for continuously improving operational excellence, and reimagines the HR brand. Learn more about our Human Capital practice.  Our Human Capital Data Science specialists use data and analytics technologies to help clients interpret data and make informed business decisions. Working collaboratively with diverse clients around the world, we also provide change management assistance and help clients design business processes that integrate predictive modeling within their existing infrastructure. Learn more about our Actuarial, Rewards & Analytics practice. QualificationsRequired: Minimum six (6) years of experience with SAS, R, Python, Alteryx, and big data platforms (Microsoft Azure, Hadoop Cloudera, etc.), with at least one (1) year of relevant experience in an external consulting role  Minimum four (4) years of experience in data analytics, data modeling and data sciences  Minimum four (4) years of experience leading multiple project teams simultaneously on relevant engagements  Proven experience in business development and/or proposal development in support of related specialty areas  Bachelors’ degree  Ability to travel 80-100% of the time Preferred: Master’s Degree or equivalent in statistics, actuarial science or related field of study  Advanced analytical experience in retail operations analytics, retail workforce analytics, marketing mix modeling, customer analytics, and/or procurement, supply chain and inventory analytics in a retail environment  Strong competency for statistical software packages (SAS, SPSS, MATLAB)  Solid understanding of advanced analytics (statistics, simulation, optimization, etc.)  Modeling expertise using statistical techniques such as logistic and linear regression, decision trees, neural network or clustering techniques  Actuarial designation or actuarial background  Strong project management and delivery experience, including budget oversight and staffing of project teams including time management  Strong oral and written communication skills, including presentation skills (MS Visio, MS PowerPoint, MS Word, MS Excel)  Ability to maintain a flexible work schedule including overtime  Previous experience mentoring, training and developing junior members of the team; experience in employee performance reviews"}