{"jobID": "2632918042", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Manager", "companyRating": null, "companyInfo": {"Website": "www.spothero.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " ParkWhiz"}, "estimatedSalary": null, "jobDescription": " SpotHero is seeking a Data Scientist who will be an integral contributor and manager in helping our Data Science team to grow and build Data Science products. You’ll be guiding our business decisions and the products that connect people looking to park their cars all across North America. Who we are: SpotHero is one of transportation's hottest tech companies! We’re rapidly growing with the mission of bringing the parking industry into the future through technology. Drivers across the nation use the SpotHero mobile app or website to reserve convenient, affordable parking in advance, on-the-go or through their connected cars, and parking companies rely on us to help them reach new customers while optimizing their business. We connect the dots with cutting-edge technology, delivering value to both sides of this exciting, evolving marketplace. Why This Role Is Important: As a Data Scientist working at SpotHero, you will contribute to the products and decisions we make every day that are transforming both SpotHero and the entire parking industry. Our Marketplace business and products create a more efficient marketplace. By providing data-informed recommendations to various teams within the company, you’ll be helping to expand our business quicker and more intelligently. Early in your tenure, you’ll primarily be optimizing the analytics of the marketing department and helping rapidly expand our new customer growth and perfect our customer retention strategies. What will you do?Help build and execute the vision that is Data/Data Science at SpotHero.Helping mentor and grow the Data Science team.Working closely with our Data Product Manager to shape our roadmaps across our Data Science Product portfolio.Increase our understanding of the external factors that drive our product (e.g. Weather? The success of a sports team? Ride sharing rates?).Explore third-party data source ingestion and how these sources could be used to inform business decisions.Pre-Requisites:5+ years experience as a Data Scientist, Predictive Modeler, Analytics Professional or similar role leveraging analytics and large amounts of data to drive significant business impact3+ experience managing teams of 5 or more people. Working knowledge of running an agile prioritization process and daily standups2+ years experience with working with large data sets and complex analysesAbility to generate relevant insights using data analytics and visualization solutionsSolid understanding of the principles of data management and business process workflowExperience prioritizing and leading concurrent projects and initiativesTop-notch written and verbal communication skillsWhat You’ll Learn (or Teach Us, or Both):How to write and maintain great, healthy code in Python. It’s the backend/data science language of choice around here.How to use the scientific Python stack (e.g. pandas, scikit-learn) to build methods for time series forecasting, segmentation/clustering, network graphing, and marketing attribution.How to run scientific experiments and employ sound statistical fundamentals to deliver trusted, repeatable business insights, recommendations, and projections.How to automate business intelligence tools (we use Looker) to make data-informed decisions.How to deploy and manage distributed computing processes at scale and on demand.How to interact with various databases, including relational (e.g. PostgreSQL), columnar store (e.g. Redshift), and NoSQL (e.g. Cassandra).How to quickly select and learn the right tool for the job. While almost no one will come to a job with all the desired tooling experience, the ability to learn them rapidly is key. Some technologies we use: Apache Spark, Airflow, Kafka; AWS Redshift, S3, EC2, Redis, Lambda, and Kinesis.How the different parts of a great tech organization work and what each value. You’ll collaborate closely across all the business units of our company (Marketing, Sales/Account Management, Finance, Customer Service) and learn/inform what it takes to make each of them successful.What we are offering:Career game changer – A truly unique experience to work for a fast-growing startup in a role with unlimited potential for growth.Excellent benefits – We cover 90% of Medical Premiums, 50% of Dental & Vision Premiums, and offer company sponsored Life Insurance.Flexible PTO policy, generous parental leave, and great work/life balance – We value and support each individual team member.Fun perks like snacks, catered lunches, happy hours, wellness programs, and SpotHero swag.Annual parking stipend (duh – we help people park!).The opportunity to collaborate with fun, innovative, and passionate people in a casual, yet highly productive atmosphere.A workplace recognized as the Best Consumer Web Companyzaeeuqaxrwuybbuwdavye by Built in Chicago, Top Company Culture by Entrepreneur, a Top Workplace by Chicago Tribune, and one of Chicago’s Best Places to Work for Women Under 35 by Crain’s Chicago Business.Steps to apply: Please include any GitHub account, LinkedIn profile, and (especially) any project that you’re particularly proud of. We love seeing work that others loved working on."}