{"jobID": "2560679107", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Pricing /Business Intelligence Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.kemper.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Insurance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Requisition Number KPC-175213SD Post Date 11/10/2017 Title Senior Data Pricing /Business Intelligence Analyst City Chicago State IL Description Position Summary:  Kemper is looking to hire a skilled and motivated Senior Data Pricing /Business Intelligence Analyst to join our Actuarial team at our corporate offices in Chicago. In this exciting role, you will improve efficiencies and accuracies in reporting, which will  allow for speed to data insight. Develop new reports: define, compile, analyze and interpret appropriate data to support reports; develop and build reports to meet internal customer needs; deliver and present information to technical and/or non-technical audiences;  reports include analysis on mix shift, loss and premium trends, product monitoring, competitive intel, profitability and loss. Enhance the collection, querying and manipulation of data, tools and processes; improve data accuracy; pull from most appropriate  data source; improve efficiency by automation of tools and processes. Analyze and interpret reports; monitor business performance and trends at a countrywide level. Position Qualifications:6+ years of experience in data and business analysis.Experience in the P&C; insurance industry is preferred.Bachelor's degree in finance, business, economics, mathematics, actuarial science, statistics or related field.Strong math, analytical and problem-solving skills. Expert ability to effectively use automated tools and processes to collect data and create reports.Expert skills in data and reporting tools such as Excel, VBA, SAS, SQL, R and Oracle BI.Ability to gather data and analyze facts and data, and draw correct inferences from the data, identify root causes, leading indicators and drivers of trends and outliers in the data.Ability to identify and implement appropriate improvements in processes and tools. Application Link: http://bit.ly/SrPricingDataAnalyst5213 Our employees enjoy great benefits:Qualify for your choice of health and dental plans within your first month.Save for your future with robust 401(k) match, Health Spending Accounts and various retirement plans.Learn and Grow with our Tuition Assistance Program, paid certifications and continuing education programs.Contribute to your community through United Way and volunteer programs.Balance your life with generous paid time off and business casual dress.Protect what you love with discounts on home and auto insurance products.Get employee discounts for shopping, dining and travel through Kemper Perks. Kemper at a glance  With $8 billion in assets, Kemper is one of the nation's leading insurers. The Kemper family of companies specializes in home, auto, life, health and valuables insurance products for individuals, families and businesses.  Kemper’s underwriting companies* are rated A- (Excellent) by A.M. Best Company, the leading insurance industry rating authority. Kemper services six million policies and ranks among the top 25 personal lines property and casualty writers and the 2016 Ward’s  50 Top Performers list of life insurance companies. Alliance United Insurance Company is not rated. We value diversity and strive to be an employer of choice. An Equal Opportunity Employer, M/F/D/V  +MO +CB +LJ +GD -IN -MSJ -PT"}