{"jobID": "2376630498", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Data Analyst (Quality Improvement) - MSO Clinical Ops - Full Time 8 Hour Days", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " The Business Data Analyst (Quality Improvement) supports new and established quality initiatives for the USC Care Medical Group and ambulatory clinics. Develops and manages analytical tools and/or programs for administrative, clinical, financial, and demographic data. Incumbent will serve as a subject matter expert in quality reform initiatives, particularly for the CMS Quality Payment Program (QPP), which involves researching and distilling state and federal law. This position will use research and analysis to help strategize USC Care’s engagement with quality reform improvement for enterprise leadership to achieve maximum effectiveness throughout the organization. The Business Data Analyst (Quality Improvement) identifies appropriate clinical data elements, maintains necessary databases, performs follow-up in order to maintain complete data repositories, maintains quality control of information, and assists in the creation of quality dashboards for clinical and non-clinical teams. Incumbent will assess, modify, and automate existing reports, audit tools, and programs to eliminate waste and improve overall efficiency in data collection. Develops summaries and designs effective visual displays to guide clinical and operational decision-making.). The candidate will possess strong teamwork skills and can be self-directed in assignments. Able to work with numerous and diverse personnel on complex projects and have an ability to explain analysis and data to varied audiences. Incumbent will exercise significant independent judgment on matters which will have a broad organizational and operational impact.Minimum Education: Bachelor’s degree required, Master’s degree preferred or in progress (MBA, MHA, MPH, MS, etc.) Additional education can substitute for the qualifying experience Minimum Experience/Knowledge: Minimum of 1-year experience in statistical analysis and project management. Proficient PC skills. Working knowledge of databases, spreadsheets, word processing, and statistical software programs. Knowledge of business (operational, clinical, and financial) statistics and data analyses techniques. Ability to manage and analyze data. Strong  analytical thinking and problem-solving skills.  Preferred: Experience in an academic medical center. Experience with QlikView or similar data analytics tools.  Required License/Certification: Fire and Safety Certification. If no card upon hire, one must be obtained within 30 days of hire and maintained by renewal before expiration date."}