{"jobID": "2831589577", "jobLocation": "Los_Angeles_CA", "jobTitle": "Project Director/Research Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.universityofcalifornia.edu", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": " Requisition Number: 28097 Job Title: PUBLIC ADMINISTRATION ANALYST, PRINCIPAL Working Title: Project Director/Research Scientist Salary: $5,325 - $10,533 monthly Job Type: Contract Department Name: 1916-CANCER PREVENTION&CNTRL; RESEARCH Department Website URL: Job Summary Statement: Under the general direction of Center Leadership, serve as Project Director/Research Scientist for community-based research projects in the UCLA Kaiser Permanente Center for Health Equity and the Center for Cancer Prevention and Control Research in the UCLA Fielding School of Public Health and the Jonsson Comprehensive Cancer Center. The individual assuming this position will join a dynamic and productive research team engaged in a broad and rich portfolio of research to address health disparities. The incumbent will have the opportunity to further his/her research skills by participating in the development of grant proposals and co-authoring scientific manuscripts and presentations. Responsibilities of this position include the following: plan and implement research activities; coordinate and facilitate the daily operations of projects on campus and at community sites; manage the collection, organization, and presentation of research data; work with community partners to develop and implement interventions; train and oversee project staff working on campus and at community partner sites. Examples of community-partnered research projects include studies to improve HPV vaccination in community and clinical safety-net settings, obesity control among preschool age children, and research to improve uptake of multiple cancer screening tests and other preventive health measures. Percentage of Time: 100 Shift Start: 8:00 am Shift End: 5:00 pm Qualifications for Position  18 Records Qualifications Required/Preferred  Doctoral degree in public health or behavioral sciences, with prior research experience  Required  Detailed knowledge of program planning, implementation and evaluation  Required  Knowledge of theory and practice of health education and behavioral sciences in the community, including in clinical safety-net settings.  Required  Knowledge of cancer prevention and control research  Preferred  Demonstrated ability to effectively work with community-based organizations, including clinical safety-net settings.  Required  Demonstrated analytical skills to recognize issues/situations that require action, define problems, present alternatives and formulate and recommend solutions.  Required  Strong organizational skills for project planning, data collection procedures, and conduct of complex research activities.  Required  Knowledge of policies and procedures of Human Subjects related research  Required  Working knowledge of contract and grant agencies policies and procedures.  Required  Ability to recruit, hire, train and supervise staff.  Required  Ability to work with minimal supervision.  Required  Demonstrated interpersonal skills to interact effectively and diplomatically with many different individuals at all organization levels, the lay and professional public, and to maintain effective and cooperative working relationships with staff members.  Required  Demonstrated oral communication skills to obtain and convey information accuratelyand precisely and to speak effectively and appropriately on a wide variety of job related subjects.  Required  Demonstrated ability to write concise, logical, accurate, grammatically correct and content appropriate analytical reports, policies and procedures, proposals, manuscripts and memoranda.  Required  Demonstrated ability to electronically maintain research and other data and effectively utilize data management software such as ACCESS and SPSS.  Required  Ability to analyze qualitative and quantitative data using a variety of statistical techniques using standard statistical packages such as STATA  Required  Bilingual in Spanish/English.  Preferred  Ability to travel to research sites in the great Los Angeles area  Required Additional Posting InformationBargaining Unit: 99-Policy Covered Application Deadline: 06-30-2018 External Posting Date: Quicklink To Posting: hr.mycareer.ucla.edu/applicants/Central?quickFind=73385 Special Instructions: This is a one-year contract position. Contact information: Number of Positions: Special EmploymentDesignations/Requirements Per UC PolicyConflict of Interest: N/A Critical: Continued employment contingent upon completion of satisfactory background investigation. Driving Record: N/A E-Verify Check:  Certain positions funded by federal contracts/subcontracts requires UCLA to notify job applicants that an E-Verify check will be conducted and the successful candidate must pass the E-Verify check. More Information No Response CANRA: Is this position designated as a mandatory reporter under CANRA? No Other Special Employment Requirements: Position is subject to performance standards and other requirements of the University wide Police Policies and Administrative Procedures.  Return to Search Results"}