{"jobID": "2729713479", "jobLocation": "Sterling_Heights_MI", "jobTitle": "Wheeled Lethality Sights & Sensors Engineer", "companyRating": null, "companyInfo": {"Website": "www.gdls.com", "Headquarters": "Sterling Heights, MI", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Wheeled Lethality Sights & Sensors Engineer – Engineering Specialist / Contractor  Perform design, integration, verification, & sustainment of electro-optic systems:  - Support concept to production phases, including architecture analysis, trade studies, requirements analysis, engineering reviews, design, integration/test, & qualification test  - Support component selection, procurement, and oversight of hardware build  - Create detailed specifications, ICD's, and test plans for sensors and electro-optic products  - Review and develop hardware and software/firmware requirement documents and test plans  - Evaluate optical design and analysis utilizing standard optical tools such as Zemax, Night Vision Integrated - Performance Model (NV-IPM)  - Design, develop, and test optical components and subsystems in support of integration of thermal imaging systems, color and monochrome high resolution cameras, lasers, radar, direct-view optics, and stabilized control systems, plus electronics to interact with such products  - Design using high and low speed digital communications standards (e.g., RS-232,  RS-422/485, VME, CAN, Ethernet/GigE, TCP/IP, UDP, USB)  - Support the integration & testing of sights and electro-optical sensors on various vehicle platforms  - Support box-level & subsystem-level verification/qualification tests as required, including environmental test.  - Perform laboratory & vehicle integration/test to investigate & troubleshoot sights and electro-optical sensor issues, or to release new/modified designs in this area. Such tasks involve complex functionality & interfaces, plus require use of special test equipment (e.g., oscilloscopes, logic analyzers, Ethernet/RS-422/etc. bus monitors, custom-created equipment). In support of such tests, author detailed test plans/procedures up front & document results via test reports upon completion.  - Work with outside suppliers in cases where functionality under scrutiny is “buy” instead of “make.”  - Support fielding and production sites to investigate/resolve issues.  - Work with other members of the engineering staff to ensure products meet requirements  - Prepare and present written reports, status reports, and presentations as necessary  - Provide technical support and communication with peers and leadership  - Support internal & external technical reviews and status meetings, coordinating & presenting as required. Must maintain excellent rapport with internal & external customers during project execution. Identify technical, schedule, & cost risks early during project execution & contribute mitigations or work-arounds."}