{"jobID": "2811518709", "jobLocation": "Germany_TX", "jobTitle": "Applied Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.symrise.com", "Headquarters": "Holzminden, Germany", "Size": "5001 to 10000 employees", "Founded": " 1874", "Type": " Company - Public (SY1) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Givaudan, Firmenich"}, "estimatedSalary": null, "jobDescription": " TasksThis position is responsible for the application and development of new and existing fragrance technologies to consumer products. The field and research centers around the performance of fragrance raw materials, air care delivery, the development of fine fragrance ancillaries, and mal-odor control. This position reports to Director of Applied Research. 　  A. Follows written instruction and formulations to create finished samples for research and customer demonstration.　  B. Organizes plans and participates in sensory testing of raw material and fragrances to support product development. Helps develop realistic sensory protocols. Uses statistics to draw conclusions from test results. 　  C. Develops new approaches / ideas for improved fragrance delivery. 　  D. Researches and maintains up to date patent and literature references. 　  E. Begins to independently interface with sales, marketing and development to support technology concepts. 　  F. Writes reports. 　  G. Starts to write and give client presentations.QualificationsBachelor of Science Degree and 5+ years chemical lab experience and/or 5+ years fragrance lab experience.  Skills & Abilities:  Computer Literate: Word, Excel, Power Point Excellent written, communication and interpersonal skills are needed as well as the desire to work with other team members and customers. Hands on scientist to work in the Fragrance Applied Research group. General area of research is the application of existing or new technologies to improve fragrance performance. The area of focus is predominately Household/ air care, and Personal care ancillaries. Ability to prioritize, plan, organize and conduct sensory tests to develop these technologies. Capable of carrying out practical projects with minimal supervision. Knowledge in the areas of encapsulation techniques, malodors, fragrances, flavors, GC HPLC, headspace analysis, household products, personal care products, or surfactants is desirable. Ability to work both independently and as part of a team. Ability to maintain confidentiality of information."}