{"jobID": "2836916532", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist, Apple Media Products", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Data Scientist, Apple Media Products Job Number: 113225626Santa Clara Valley, California, United StatesPosted: May. 16, 2018Weekly Hours: 40.00 Job SummaryThis team in the Apple Media Products group provides insights through data that drive decision-making for our engineering and product teams. We are looking for a Data Scientist that can derive valuable insights and help us build automated reporting tools from the data we collect on AppStore, Apple Music, Movies & TV, etc.Key Qualifications - 4 or more years relevant industry experience preferred.- Extensive background in statistical methods and data mining.- Excellent applied statistics skills, such as hypothesis testing, experimental design, sample size determination and non-parametric statistics.- Experience with Big Data systems and distributed computing, such as Hadoop.- Experience with common data science toolkits, such as R, pandas, dplyr, NumPy, etc.- Experience with data visualization tools, such as GGplot, etc.- Proficiency in using query languages such as SQL, Hive and SparkSQL.- Experience with Scala, Spark or Python.- Excellent communication skills with the ability to explain findings in layman terms.- Keep up-to-date with the newest technology trends.- Able to communicate results and ideas to key decision makers.- Able to understand various data structures and common methods in data transformation. DescriptionYou will design, execute and craft tools for online experiments (A/B tests) and offline experiments (human relevance judgement) that help us improve and fine tune our data focused features (Search, Recommendations, etc.). Your primary focus will be on applying statistical methods, develop A/B testing procedures, and automating data pipelines to develop new metrics. ADDITIONAL EXPECTATIONS OF THIS ROLE INCLUDE:Data mining using state-of-the-art methods. Investigate new data sources that can extend and improve our insights. Work with software engineering teams to improve data collection procedures. Processing, cleansing, and verifying the integrity of data used for analysis.Doing ad-hoc analysis and promptly presenting results in a clear manner.Generate reports (that can be automated) to present key insights to partners across a variety of teams. Designing experiments that will measure and test for key performance indicators. Creativity in formulating statistical questions to address business needs.EducationMaster’s Degree in Computer Science, Statistics, Applied Math or related discipline. PhD preferred."}