{"jobID": "2822921669", "jobLocation": "The_Woodlands_TX", "jobTitle": "Data Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.clariant.com", "Headquarters": "Charlotte, NC", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " BASF, Dow, Evonik"}, "estimatedSalary": "98000", "jobDescription": "Reference: 25809 Location: The Woodlands, Texas, USA  Clariant is a globally leading specialty chemicals company, based in Muttenz near Basel/Switzerland. On December 31st 2017 the company employed a total workforce of 18,135. In the financial year 2017, Clariant recorded sales of CHF 6.377 billion for its continuing businesses. The company reports in four business areas: Care Chemicals, Catalysis, Natural Resources, and Plastics & Coatings. Clariant’s corporate strategy is based on five pillars: focus on innovation through R&D;, add value with sustainability, reposition portfolio, intensify growth, and increase profitability.  The Data Engineer will design, build and maintain high frequency sensor data environment that supports Oil Business Line's Sensor to invoice automation. This position will help in design and support for the data analytics platform with focus on revenue generation. Part of the job responsibility will include interacting with Data Scientists and transfer machine-learning models and other insights into a production environment. The Data Engineer will play a consultative role in supporting Clariant's IT Leadership Team to design and develop the future big data IT landscape. Responsibilities: Design, build, and maintain high quality big data landscape Help support and enhance the sensor to invoice data transmission trade marked as VERITRAXOwnership of data engineering process with focus on commercial platforms (e.g. create and maintain data pipeline)Supports IT Management on the direction of big data platforms and digital strategy Knowledge Management SME for VERITRAX and other OMS sensor data related technology landscapeDrive data interface to customers and external data sources like LabWorksPerform cross BU know-how exchange in the field of data engineering Project Management Ensures planning and execution of projects in the area of data miningConsult Data Scientists to transfer machine-learning models into a productive setupDevelop concepts to ensure automated data base access, analytics and control Expertise Management Ensure highest industrial standards in data based optimization and simulationEnsure lean and effective approaches for the implementation in Clariant's business units and servicesInterface with Clariant's data scientists and developersRequirements:10 years of software and IT Engineering experience preferred with a proven track record of success in leadership experienceMaster’s Degree in Computer Science, Computational Engineering, Chemical Engineering preferred or previous experience in similar roleProven track record with big data transformation (Oozie, HBase, Pig, Scala, and Spark), ETL (Informatica), Structured Database (Oracle, SQL) and Programing language like C, Java, Unix Shell Scripts, etc. #LI-DNP"}