{"jobID": "2817072992", "jobLocation": "Richardson_TX", "jobTitle": "SR Business Analyst Provider Data Management", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "77000", "jobDescription": " Heres the thing about challenges. They provide limitless opportunities for greatness. And what we have in mind for you is definitely big. At UnitedHealth Group, were changing the future of health care and we have the expertise, advanced technology and global resources to make it happen. As a Senior Business Analyst on the PhyCon Product Management team, you are responsible for gathering clear business requirements in support of the PhyCon solution. The vision for the PhyCon Product team requires the understanding of people, process and technology. Your work is all about how users interact with an application within a greater provider contracting and data management business process, which is critical to the success across all of UnitedHealthcares lines of business.The focus of the Business Analyst is supporting the Product Owner and Product Manager in the development of business requirements that support the effective implementation and deployment of PhyCon enhancements and new capabilities. Demonstrating the benefits of agile methodologies, business collaboration and engagement and a consistent, repeatable process with deep business knowledge is critical to the success of the Product team.  Join us! Your passion for performance can fuel your life's best work.SM Primary Responsibilities:Supports the implementation of standard processes while working with or as part of multiple project teamsParticipates in and/or facilitate requirements gathering and scrum meetings by guiding business subject matter experts through collaborative working sessions in person or via WebExParticipates in solution analysis and design meetings for system enhancements and/or implementationsParticipates in discussions to document Current State/Future State workflows as neededCollaborates with Product Owner, gathers, communicates and documents business requirementsDevelops and documents business workflows of medium to high complexityIndependently writes Agile Scrum User Stories, including clear acceptance criteriaDevelops and documents criteria for User Acceptance Testing as part of requirements processFollows processes to manage the requirements gathering process through sign-offProvides clear description of problems/issues for medium to high complexity problemsPresents options for problem resolutionWithin six months, demonstrates subject matter expertise in at least one functional/application areaContributes in developing organizational functional knowledge across the teamAssists in the estimation of small to medium size work effortPrepares screen/user interface mockupsResearches questions that arise, including potential recommendations for team considerationServes as a product team resource to the larger PhyCon team, including providing support for the User Acceptance Test effortRequired QualificationsAssociate degree in Computer Science, Business, Finance, Health Administration, related field or equivalent work experience (minimum 2 years)Minimum two (2) years of experience in analyzing, researching, gathering and documenting Business requirements documentationIntermediate level Microsoft Office (including Visio, Excel, Outlook, PowerPoint)Experience in supporting solution analysis and design meetingsExperience in creating acceptance criteria for User Acceptance TestingExperience in acting as liaison between business and ITPreferred Qualifications:Bachelor degree in Computer Science, Business, Finance, Health Administration, related field or equivalent work experience (minimum 4 years)Experience with AgileHealthcare industry experienceUnderstanding of provider contracting and/or provider data management operationsExperience with IT system development lifecycle (SDLC)Proficiency in Microsoft AccessExperience with PegaExperience in working with global resourcesExperience in working in a virtual work environment (Teleconferencing, WebEx, etc.) \\Strong written and verbal communication skillsCareers with UnitedHealthcare. Let's talk about opportunity. Start with a Fortune 6 organization that's serving more than 85 million people already and building the industry's singular reputation for bold ideas and impeccable execution. Now, add your energy, your passion for excellence, your near-obsession with driving change for the better. Get the picture? UnitedHealthcare is serving employers and individuals, states and communities, military families and veterans where ever they're found across the globe. We bring them the resources of an industry leader and a commitment to improve their lives that's second to none. This is no small opportunity. It's where you can do your life's best work.SMDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.  Job Keywords:analysis, data analysis, business analysis, senior business analysis, senior data analysis, business requirements, provider data management, healthcare, IT, HIT, workflow analysis, Agile, Pega, PhyCon, UnitedHealth Care, UHG, UHC, Richardson, TX"}