{"jobID": "2796195085", "jobLocation": "Saint_Joseph_MI", "jobTitle": "Select Business Solutions Account Manager", "companyRating": null, "companyInfo": {"Website": "www.hubinternational.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Purpose Manages an SBS assigned book of business providing professional, courteous service to our clients, business partners, and HUB colleagues, resulting in a rate of account retention that meets or exceeds expectations (93%). Role ExpectationsProvide quality customer service to existing accounts as referenced in the SBS Roles, Responsibilities and Skills Chart (attached.)Oversees the preparation and implementation of all transactions, paperwork, and internal processing for assigned accounts.Manages a book of business generally in excess of $175,000 depending on complexity or number of accounts.Target New Business growth to equal or exceed 10% of assigned book revenue annually.Analyze coverage and identify gaps for potential account rounding opportunities and to prevent errors and omission issues.Cultural Expectations Determination Unsatisfied until we are the best. We go the extra mile for clients and colleagues  Ownership Responsible to each other, our clients and our goals  Teamwork Together we attain greater success  Sincerity Direct and caring communication Core Competencies2 5 Years Commercial Lines experienceAbility to organize large volumes of information and set prioritiesAptitude for details with consistency in follow-upAbility & desire to take ownership of role expectations with accountability to internal and external clientsEstablished insurance knowledge with proven ability to apply same to your daily workStrong verbal and written communication skillsIntermediate knowledge of Microsoft Word, Excel, Outlook and keyboarding skills.Location: United States, Michigan, Grand Rapids Location: United States, Michigan, St. Joseph Location: United States, Michigan, Kalamazoo Required Education: High school or equivalent Required Experience: 2-5 years Required Travel: Negligible Date published: 30-May-2018 Department: Account Management & Service Ref#: P2893_20180523  HUB International Limited is an equal opportunity and affirmative action employer that does not discriminate on the basis of race/ethnicity, national origin, religion, age, color, sex, sexual orientation, gender identity, disability or veteran's status, or any other characteristic protected by local, state or federal laws, rules or regulations. The EEO is the Law poster and its supplement is available here at http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm .  We endeavor to make this website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact the US Recruiting Team toll-free at (844) 300-9193 or USRecruiting@hubinternational.com . This contact information is for accommodation requests only; do not use this contact information to inquire about the status of applications."}