{"jobID": "2804025139", "jobLocation": "Battle_Creek_MI", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.divihn.com", "Headquarters": "Hoffman Estates, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DivIHN (pronounced Divine) is a nationally-recognized Business Technology Solutions and Staffing services provider headquartered in Chicago. Since our formation in 2002, we have been trusted by Fortune 500 organizations to help them locate and hire best-in-class talent through our Award-winning Professional Workforce Solutions program.DivIHN is helping its PREMIER CPG CUSTOMER in hiring a Sr. Data Scientist who has 10+ years of overall with 4-6 years of relevant experience to work out of their Battle Creek, MI office; details can be found below.Should you have any questions, please apply or call us to learn more.Remya: (630) 847 7118 / mremya@divihn.comBlessy: (847) 710 7170 / blessy@divihn.comPhebe: (440) 754 8618 / phebe@divihn.comThis is a contract to HIRE role.  Client Job Title: Data Scientist  An average day for a Data Scientist will consist of harmonization, cleansing, and general preparation of data prior to analysis. Additionally, a Data Scientist must easily interact with functional business partners (e.g. Sales, Supply Chain, etc.) to understand their business questions so an analytical solution can be built to answer them. Internally, a Data Scientist will develop the best analytical solution to solve the business question and ultimately present the proposal back to the functional business partner. Finally, a Data Scientist will work with internal IT business partners (e.g. Data Engineers, Delivery Services, etc.) to help deliver the analytical solution.  Strong data manipulation & cleansing skills using a programming language (e.g. SAS, R, SQL, etc.)  Excellent analytical skills with particular ability around advanced analytical techniques (e.g. regression, decision trees, machine learning, arima, etc.)  Strong interpersonal and communication skills with demonstrated ability to a variety of business partners using data and analysis  Subject matter expertise in Deductions (preferred), Sales, or Supply Chain  Advanced data visualization skills (Tableau preferred)  M.S. or Ph. D. in Computer Science, Economics, Statistics, Mathematics or other related field. Or specialized training/certification. Or equivalent work experience.  Typically requires 4 - 6 years of related technical /business experience  This position will be a maximum of 12 months.  Years Exp: 10+.  Advanced Degree or Certifications:Yes, highest possible.About us:DivIHN, the 'IT Asset Performance Services' organization, provides Professional Consulting, Custom Projects, and Professional Resource Augmentation services to clients in the Mid-West and beyond. The strategic characteristics of the organization are Standardization, Specialization, and Collaboration.  Check out our careers page to see all of our job openings:  http://divihn.com/careers/find-a-job/"}