{"jobID": "2733685758", "jobLocation": "Washington_DC", "jobTitle": "Data Governance and Policy Analyst", "companyRating": null, "companyInfo": {"Website": "www.devtechsys.com", "Headquarters": "Arlington, VA", "Size": "1 to 50 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DevTech Systems, Inc. (DevTech) is an international consulting firm dedicated to development, with 35 years of experience providing advisory services and technical assistance to government, private sector, and civil society stakeholders in more than 100 countries. DevTech core practice areas include: Economic and Data Analysis, Monitoring and Evaluation, Education and Youth Development, Gender and Inclusive Development, and Public Financial Management. The Policy Analyst will work on the new Analytics, Data, Visualization, and Information Services (ADVISE) project. ADVISEs main purpose is to improve the usage of USAID data and information, so that the Agency continues to ensure its development outcomes are supported by evidence. Primary Duties and Responsibilities: USAID has embarked on a program to harmonize and systematize the way its data is collected, stored, and, where appropriate, made available to the general public. To support this effort, ADVISE is seeking an individual with an understanding of this landscape and an interest in helping determine what data governance policies make sense for a federal agency working primarily in developing countries to rationalize its use of data.  The Data Governance and Policy Analyst will draft, review, update, and provide feedback on institutional, national, and international policies to ensure conformance with legal mandates, professional best practices, and expectations of practitioners in the realm of data and information management. This includes administering and shepherding the creation of policies that govern data standards, information collection, retention (accession/de-accession), preservation, rescue, sharing, and publication. The Analyst must have a thorough understanding of U.S. data and information management law and policy.  This position will be expected to maintain a strong understanding of the USAID mission, its vision and values to build awareness around ADVISEs capabilities. The candidate should have interest and experience in international development, socioeconomic data, and foreign policy issues. QualificationsGraduate degree, preferably with a strong focus on data management, data policy and applications, or a related discipline.Experience:At least three years of experience in implementing and supporting successful organization-wide data and information governance frameworks. That includes structuring, convening, and participating in effective governance bodies and working groups that collaborate to establish strategic directions, procedures, and policies for digital information and data operations and systems.At least three years of experience in writing in general and drafting data governance and policy-related documents in particular. The applicant must be a U.S. citizen to qualify for the required U.S. government security clearance for this project.  All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, national origin, disability, sexual orientation, protected veteran status or other status protected by applicable law.  NOTE: This position description should not be construed to imply that the requirements are the exclusive standards of the position nor will it be the sole basis for any subsequent employee evaluations. Incumbents will follow any other instructions and perform any other related duties as may be required by their supervisor."}