{"jobID": "2830896584", "jobLocation": "Irving_TX", "jobTitle": "Clinical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.insourcegroup.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 1992", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " No 3rd Parties **This position is ideal for someone who has worked in the operating room as a Surgical Technologist and has the knowledge of surgical specialties....but is wanting to move into a Data Analyst/office position. Healthcare organization in the DFW area is looking for several Clinical Data Analysts that have knows medical products from a clinical perspective with a specialty in the equipment/products and procedures used in various areas such as Cardio or Ortho or other specialties such as vascular, nuero, urology, thorasic and then general surgery. Nurses with heavy Medical/Surgical product knowledge or Certified Cath Lab Techs and Cath Lab Nurses are of specific interest. Areas of specialty include peripheral, diagnostic, interventional and EP lab.  Primary interest are those with Cardio or Ortho.  Secondary experience that is a highly sought after includes: General Surgery, vascular, radiology technician, electrophysiological electrosurgery such as harmonic scalpels or any electronic cutting devices.  Some of the job duties include working with Excel - sorting, importing/exporting and v-Lookups.  As long as you have solid product knowledge and you know how to do research on the internet and you have an eye for detail -they will teach you what you need to know about utilizing Excel. In addition to having specific product knowledge, any experience or knowledge in the product procurement perspective of the healthcare industry will be greatly appreciated. If you are ready and willing to put your past experiences to work yet be part of something new then we want to speak to you.  The purpose of this position is to do data integrity and data cleansing/classification of millions of medical products into categories that the healthcare organizations are accustomed to and in such a way that it will drive sales up and will drive the buyer to greater volumes. Might consider someone that has come from past medical products sales or from the supplier side or the procurement of products within a healthcare organization will be very well suited for this type of Data Analyst role.  Must be intuitive knowing when to ask questions and what types of questions to ask.......call it a \"natural curiosity\". This is a semi non-technical job and you will need to be capable of learning things quickly and an ability to do very detailed computer work for long periods of time (much different than the OR). Must have a tolerance level for repetitive work that can get very monotonous yet remain very detail oriented.  Primary skills required is that ability to logic things out, categorize and use the internet to do some research for verification purposes. Any experience in a \"service industry\" will be very helpful. Responsibilities will be able to work with the categorization and product groupings of various medical products and services"}