{"jobID": "2825966879", "jobLocation": "Union_Beach_NJ", "jobTitle": "Data Scientist (Machine Learning)", "companyRating": "4.0", "companyInfo": {"Website": "www.operationit.com", "Headquarters": "Melville, NY", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Robert Half Technology, TEKsystems, Modis"}, "estimatedSalary": "73000", "jobDescription": " Our manufacturing client is looking for a Data Scientist to join their team on a full-time basis Job Description:Use statistics tools to analyze data to understand and model the relationship between different metrics and identity key insightsCollaborate with Product Managers, Business teams to identify opportunities to build data science productsConsult with other engineers to help them run and analyze A/B testsDeliver Intelligence and Insights on raw data with Machine Learning, Artificial Intelligence, Forecasting, Advanced Search, Statistical Modeling capabilities, etc. You will ideally have a postgraduate qualification in Mathematics, Statistics, Computer Science or related field, combined with several years of experience in data science projects, preferably using agile methodologies. Job Requirements:MS degree in Computer Science, Information Technology, Engineering, Statistics, Economics, Mathematics, or quantitative fields5-7 years of data analysis, preferably with a technology company2+ years in Client algorithmic design, predictive modeling, and recommender systemsExperience creating models with a strong hands-on programming experience in R, Python, NumPy, Java (Scala a plus)Implementation of data science projects, including familiarity with NLP and machine learning libraries, and frameworks (e.g. Sci-kit Learn, H2O, TensorFlow)Extensively leverage building models using R and Python based Client and deep learning libraries.Experience using Apache Spark 2.0 (core, SQL, Client) a huge plusKnowledge of distributed computing or NoSQL technologies is a plusFamiliarity with AWS data analytics and machine learning services 'Proven analytical skillsAn ability to translate data into meaningful questions and insights"}