{"jobID": "2699669968", "jobLocation": "Chicago_IL", "jobTitle": "Head Start Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": null, "jobDescription": "Job Number: R0024996Head Start Data AnalystKey Role:Provide information management support for the Office of Head Start. Perform data management and analysis tasks, apply knowledge of federal grant guidelines, and perform various information management activities, including data entry, data tracking data analysis, and records management designed to improve processes and create efficiencies. Track data from numerous databases and Web-based systems, develop reports, and write analytical summaries of data for executive-level clients. Prepare Microsoft PowerPoint presentations by drawing on data from numerous sources, draft executive memos, and create complex reports using Microsoft Excel and Access. Recommend ideas to improve the client's existing processes. Perform various administrative tasks in support of the operations of the regional office. This position is located in Chicago, IL.Basic Qualifications:-2 years of experience with post-baccalaureate, professional work-Experience with using a variety of Web-based and commercial data management systems-Ability to aggregate, analyze, and present data gathered from multiple sources-Ability to communicate clearly, both orally and in writing, and produce high quality written products-Ability to obtain a security clearanceAdditional Qualifications:-Experience with the federal grants life cycle a plus-Experience in a non-profit, social service, or government consulting environment a plus-Ability to function as a professional team player-Ability to be flexible and adaptable in completing required tasks-Ability to pay strict attention to detail-Possession of excellent oral and written communication skills-Possession of excellent organizational, client management, and analytical skills-BA or BS degree in Early Childhood, Social Work, English, or related fieldClearance:Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}