{"jobID": "2789511544", "jobLocation": "Morristown_NJ", "jobTitle": "Geologist II or Environmental Scientist II", "companyRating": "3.7", "companyInfo": {"Website": "www.louisberger.com", "Headquarters": "Morristown, NJ", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Geologist or Environmental Scientist to lead efforts for ASTM-compliant Phase I Environmental Site Assessments, site and remedial investigations, and oversight of remedial actions. Responsibilities will encompass both office and field activities.  Office activities may include preparing proposals, reviewing and interpreting historical documents and reports, preparing planning documents, reducing and interpreting data, and preparing technical reports.  Field activities may include site reconnaissance, sampling of various environmental media (soil, groundwater, surface water, sediment, and air), oversight of soil borings and monitoring well installations, oversight of remedial construction, and other related tasks.  Candidates must have the capacity to work outdoors in all seasons in all weather and have the ability to communicate effectively with other team members and project managers. Some travel may be required. Experience in the areas of contaminated site assessments, investigations and remedial actions;Familiarity with NJDEP Site Remediation Program;Experience working in bulk and liquid fuel terminals;Transportation Worker Identification Credential (TWIC) CardARCGIS (Version 10) skills/experience;OSHA 10-hour Construction Industry training;NJ Subsurface Evaluator license;NJ field sampling experience;Must have own means of transportation; and must be able to travel around the NY/NJ Metro area (including New York City), as well as Connecticut and Pennsylvania; andAvailable to work early mornings and/or late evenings;Available to work occasional nights and weekends.Required Skills Required ExperienceThe successful candidate will have the following:Bachelor’s Degree in Geology, Environmental Science, or closely related field;Minimum of 3 years in ASTM-compliant Phase I Environmental Site Assessments, environmental investigations and/or remediation oversight;Must be willing and physically able to perform field work associated with contaminated site investigations;Strong written and verbal communication skills;Be capable of lifting up to 50 lbs.;OSHA 40-hour HAZWOPER training (and current refreshers); and,Valid driver’s license. EEO/AA/M/F/Vet/Disability EmployerJob Location  Morristown, US-NJ "}