{"jobID": "2819603458", "jobLocation": "Bloomfield_Hills_MI", "jobTitle": "HR Generalist", "companyRating": "2.9", "companyInfo": {"Website": "www.rocorealestate.com", "Headquarters": "Bloomfield Hills, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "36000", "jobDescription": "Company: ROCO Real EstatePosition: HR GeneralistFLSA Status: Salary, exemptAbout ROCO:Founded in 2012, ROCO Real Estate is a privately owned and operated full service real estate investment and management company headquartered in Bloomfield Hills, MI. ROCO currently owns approximately 20,000 apartment units across 13 states and has over 500 employees. ROCO has a long-term hold strategy for our assets, which means that when we invest in real estate we are making a meaningful commitment. We have experienced record growth due to hiring the best professionals in the industry. ROCO makes significant investments in our employees and properties. We treat our residents and Investor partners the way we would want to be treated, if our positions were reversed.We are defined by our unique culture centered around young entrepreneurs making waves in an old industry. ROCOs greatest asset, and the key to our success, is our people. We focus on customer-service and reward impact.www.rocorealestate.comAbout this position:As a HR Generalist, your primary responsibility will be to provide support to the organizational leaders and operations department in various facets of human resources, including talent acquisition, employee relations, training and development, HRIS and data management, talent management and other various assignments. The HR Generalist will play a key role in recruiting and attracting the highest quality talent to join ROCO Real Estate at our property sites and/or corporate office. You will work directly with the Area Vice Presidents, Regional Managers and Property Managers. The HR Generalist will have a thorough understanding of the overall workforce and operational responsibilities within the Property Management industry.This position requires a wide range of abilities including strong verbal and written communication and organizational skills, flexibility, high energy and attention to detail. A high standard of professionalism and an engaging personality is required, as the HR Generalist is the primary point of contact for site-level managers and employees regarding human resources and talent acquisition.Job Responsibilities:Act as a consultant to management team members regarding employee matters, providing guidance and coaching to ensure resolution of employee and/or team conflicts, performance challenges, training needs and/or behavioral concerns.Ensure consistent, fair, equitable and meaningful feedback and actions are taken by management team members when dealing with employee matters or concerns.Participate in or lead employee investigations, counseling, feedback and/or disciplinary action discussions.Actively source new candidates to ROCO by networking, building relationships with industry leaders, attending networking and career advancement events and staying abreast innovative and creative recruiting techniques.Stay abreast operational goals and directives to ensure consistency with HR guidance.Represent ROCO with the highest level of courtesy, professionalism and enthusiasm.Deliver company-wide orientation training for all new hires.Oversee all employee relations matters for corporate and site teamsAssist managers with proper procedures for employee misconduct, terminations, & performance issuesApprove all employee disciplinary notices and work with hiring managers on employee relations best practices.Work with Acquisitions Director team during due diligence, closing, and post-closing of new properties.Provide Staffing & Operations budget assumptions during acquisition underwriting.Conduct data analysis of various HR metrics, including turnover and data gathered during exit interviews. Identify new metrics to assess and analyze. Identify trends and opportunities to enhance the employee experience in a data-driven manner.Participate in and/or lead employee engagement initiatives as needed.Required Skills & Experience:Bachelor's degreePrior experience in HR, Talent Acquisition/Recruiting. Property Management experience desirableExperience using Newton and/or Paycor preferredStrong communication skills - written and verbal Ability to self-direct, prioritize competing tasks and handle constant changeROCO is proud to provide its team members with:Comprehensive benefits package including affordable Medical, Dental & Vision plan options and 401(k) with employer-matched contributions.ROCO University delivers virtual, live and instructor-led training on topics relevant to the Property Management industry.Generous paid time off, including vacation, sick and personal time off, as well as paid holidays.Paid parental leave, Tuition reimbursement, Charitable donation program, Referral bonuses, Employee recognition programs and MUCH more!"}