{"jobID": "2830335577", "jobLocation": "Houston_TX", "jobTitle": "Systems Analyst - Quantitative Research Computing", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " The primary purpose of the Systems Analyst DMI Applications/RedCap Applications position is to provide software solutions, in the Microsoft .NET environment and/or REDCap metadata environment for clinical trial, data management and other applications relevant to the research conducted in the Biostatistics Department and Biostat clients. The DMI group provides a collection of web-based and desktop applications which share a central repository of medical research data and serve diverse clients within the institution and across various external collaborating entities. This position develops solutions for software and database needs throughout the clinical trial life cycle, with an emphasis on trial data collection and data quality management. The incumbent provides technical expertise particularly in the area of web page development and database programming for cancer prevention research.  The salary range is min $ 68,400 mid $ 85,500 max $ 102,600. JOB SPECIFIC COMPETENCIESSystems Development:Perform software requirements analysis, design, development, implementation, testing and operational support. Develop software and/or REDCap databases -- particularly for trial data collection and reporting needs. Communicate existing application functionality to users and developers. Resolve issues in design and implementation. Advance our capabilities in software and database technology.Address Research Needs:Demonstrate basic understanding of the clinical trial life cycle, the software applications required to support it and the software architecture required to produce the applications. Work with faculty, end-users, and other parties to translate research requirements into software and database requirements. Develop and maintain collaborative relationships to ensure that the work is clearly supportive of the research needsCommunication and Documentation:Document products for both technical staff and end users. Clearly communicate complex technical information in verbal and written forms.Keep current and expand skills and knowledge base:Demonstrate intermediate level of technical skill particularly in use of Microsoft development tools such as C#, SQL Server, ASP.net, and REDCap. Investigate new approaches and tools for addressing technical needs. Maintain awareness of standards, policies, and regulations; appropriately incorporate into work products.Support and Continuity:Provide support for existing applications, databases, web services, frameworks and libraries. Cross-train and share information to proactively avoid gaps as assignments and staffing change.Other duties as assigned."}