{"jobID": "2792331708", "jobLocation": "Deerfield_IL", "jobTitle": "EDI Data Analyst (Trucking/ Transportation)", "companyRating": null, "companyInfo": {"Website": "www.resource-1.com", "Headquarters": "Creve Coeur, MO", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Resource 1 is in need of an EDI Data Analyst for Deerfield, Illinois. Client is open to either contract-for-hire or straight permanent (preference is on CFH). This is an established company with excellent benefits and great growth potential. Perks include bi-annual bonuses, excellent health plan, stock-options and competitive salaries. Individual should have at least 5 years of experience working as a Business Data Analyst and have EDI data mapping experience. Client would like an ambitious individual with the aspirations to take on more of a leadership role (in-house training provided). Individual will be responsible for implementing and executing the onboarding of EDI clients/ trading partners, so they will need to have strong customer-facing skills. Individual will get involved in EDI projects from start to finish. Individual will gather the required EDI specifications, file layouts, test data and assist in mapping data according to the EDI standards. Individual will gain an understanding of the various EDI formats for specific ERP systems (i.e. SAP, Oracle Applications, etc.). The majority of EDI transactions sets are related to Trucking/ Transportation/ Shipping. Ideal candidate would have some prior experience working with EDI 204 (Motor Carrier Load Tender), EDI 210 (Motor Carrier Freight Details & Invoice) and EDI 214 (Transportation Carrier Shipment Status Message). The client is in the process of moving to Agile, so any experience with User Stories, Data Flow Diagrams and Scrums meetings is a nice to have.- provided by Dice  EDI Transaction Sets (204/ 210/ 214), EDI Mapping/ Standards, EDI Specifications, Data Flow Diagrams, Business Analysis, Requirements Gathering/ Definition & Project Management."}