{"jobID": "2801659936", "jobLocation": "Springfield_VA", "jobTitle": "Senior - Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.perspecta.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2018", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Every day at Perspecta, we enable hundreds of thousands of people to take on our nation’s most important work. We’re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation’s most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselves—to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.  Perspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many ways—not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.  Perspecta’s talented and robust workforce—14,000 strong—stands ready to welcome you to the team. Let’s make an impact together.  Perspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categoriesResponsibilities Determine the most appropriate research projects, data collection and methodologies. Identify, retrieve, manipulate, relate and/or exploit multiple structured data and unstructured data sets from various sources, including building or generating new data sets as appropriate. Interpret and evaluate the results of data science community's methods and models and/or algorithms, understanding the meaning, limitation and scope of the results, translating into insightful output for data science and/or mission and identifying other applications for use. Initiate the efficient implementation of methods, tools, algorithms, including preliminary data exploration, data visualization and preparation, model calibration, specification or estimation, and algorithm validation and verification using a comprehensive range of technologies (e.g., software packages, programming languages, computation environments). Educate managers, senior internal officers and the IC through mediums such as presentations, documentation and discussion. Lead work unit proactively addressing and responding to the most difficult data science-related challenges in a timely manner while effectively balancing competing priorities. Coordinate subtask for successful project task integration.Qualifications Senior - Advanced level knowledge and skills demonstrated in previous work in their field. 10 years or greater but less than 20 years of experience. A bachelor degree in a field related to the support services may count for up to four years of experience. A master degree in a field related to the support services may count for up to two additional years of experience. A Senior is expected to work with no oversight, fully capable of meeting all service requirements without direction and directing lower level (apprentice and journeyman) staff with quality control and quality assurance checks. Seniors are expected to provide support and advice to senior level NGA office level leadership on processes, procedures, technology, and items of interest. Seniors are also expected to lead collaboration across NGA and IC analysts that contributes to analytical synergy that is better than the sum of the individual parts. Demonstrated strong writing and briefing skills consistent with national-level performance."}