{"jobID": "2802287239", "jobLocation": "Redwood_City_CA", "jobTitle": "Product Marketing Data Operations and Reporting Analyst (Redwood Shores, CA location only no relo p", "companyRating": "3.4", "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": "108000", "jobDescription": " **Product Marketing Data Operations and Reporting Analyst (Redwood Shores, CA location only no relo provided)****Preferred Qualifications****Product Marketing Data Operations and Reporting Analyst****Location:** RedwoodShores, CA (Only available location for role)**Key Objectives:**The **Product Marketing DataOperations and Reporting Analyst** will primarily beresponsible for analyzing and reporting on both sales data as well as content usagedata from a proprietary seller enablement platform. The Analyst should becomfortable analyzing large, ?messy & complex? data sets,cleaning/organizing the data (data wrangling), and transforming it intoactionable data which the Analyst can present to executives. The Analyst shouldbe prepared to present directly to senior leadership and field ad hoc analysisrequests in addition to scheduled reporting processes. The data and insightswill be used to drive decisioning across a 400 person Product Marketing (PM) organizationwithin Oracle?s Cloud Business Group.Within Product Marketing, thePM Centers of Excellence (PM-CoEs) team _?Deliversa set of scalable, high value-add marketing shared services at a significantlyreduced cost and with greater consistency.?_This position is part of the Analytics CoE.**PrimaryResponsibilities:**+ Quickly become an expert on both sales data and content usage datafrom proprietary seller enablement platform and find new ways to glean insightsfrom data+ Advance reporting and analytics with new Business Intelligencetools and creativity+ Prepare monthly reports in support of different business units andbe prepared to present results to senior leadership+ Maintain and improve dashboards. Train different business units ondashboard usage+ Present key results to senior leadership in ad hoc or scheduledmeetings**RequiredSkills and Experience**+ 2 years Marketing/SalesOps or other highly analytical role+ Data Analysis experience? Excel, Python, BI tools, etc.+ Experience writing SQLqueries+ Experience presenting analysis through PowerPoint to executiveleadership+ Possess curiosity and desire to learn new software and programminglanguages+ Enjoy optimizing and organizing messy data sets and processes**Preferred Skillsand Experience**+ Python (or other scripting language)+ Experience using Enterprise analytics / BI tools such as Tableauand MSFT Power BI**OtherConsiderations**+ Must be in the Bay Area and willing to commuteto Oracle HQ daily (or willing to relocate within commute distance)+ Up to 25% travel; possibly international+ Willing to work in the evening and early morning(from home) to interact with teams in India**Detailed Description and Job Requirements**Analyzes complex business problems and issues using data from internal and external sources to provide insight to decision-makers.Identifies and interprets trends and patterns in datasets to locate influences. Constructs forecasts, recommendations and strategic/tactical plans based on business data and market knowledge. Creates specifications for reports and analysis based on business needs or available data elements. May provide consultation to users and lead cross-functional teams to address business issues. May directly produce datasets and reports for analysis using system reporting tools.Job duties are varied and complex utilizing independent judgment. May have project lead role. 5 years relevant work experience. BS/BA preferred.**Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.****Job:** Business Operations**Location:** US-CA,California-Redwood City**Job Type:** Regular Employee Hire**Organization:** Oracle"}