{"jobID": "2836279076", "jobLocation": "Rochester_Hills_MI", "jobTitle": "Technical Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.go2si.com", "Headquarters": "Rochester Hills, MI", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " JOB TITLE: Technical Data Analyst  REPORTS TO: Department Manager  JOB TYPE: Full Time  DAYS/HOURS: 40 hrs. per week; Standard Business Hours  ON-CALL: N/A  Are you an automotive professional looking for more variety in your everyday work duties? If yes, continue reading!  SolvIT, Inc. has an opening for a Technical Data Analyst that offers a diverse skill-set and a work day that will never be the same as the next.  What does the Technical Data Analyst do?  The Technical Data Analyst is responsible for developing service wiring information used by dealership technicians to diagnose and repair vehicle issues.  What you will be doing:  Specific responsibilities include the following: Collect and analyze wiring engineering information / data (Wire List) from various sources such as harness prints, engineering schematics, CAD models, vehicle function documents, and flow chartsVerify the accuracy of the service information through engineering reviews, on vehicle reviews, and vehicle teardowns.Data created will be used for wiring diagram development / illustrationProvide technical support to internal helpdesk personnel in support of dealer technicians on field, application and data concerns. ​  What makes you qualified: The Technical Data Analyst must meet the following minimum requirements:One of the following: 1) Automotive technician with minimum 10 years’ experience with a strong background in on vehicle electrical diagnosis and repair. 2) Advanced Automotive Electrical Troubleshooting experience 3) Preferred Degree in automotive technology or engineering backgroundAbility to interface and effectively communicate with various levels of customers, management with varying degrees of technical knowledgeProficient in Microsoft Office tools (Word, Excel, PowerPoint, Outlook)Must be able to visually differentiate varying degrees of wire colorsAbility to successfully multi-task and prioritize given taskStrong communication skills both written and verbalStrong problem solving and troubleshooting skills What makes you an All Star: 5-10 years of experience with vehicle electrical/wiring systems or vehicle electrical/wiring system repairA.S.E Automotive Electrical Certified Preferred (not required)Experience analyzing or using electrical wiring diagrams for serviceExperience in one of more of the following areas is highly desirable:Ability to read and understand automotive harness prints, analyzing engineering schematics, or logical flow chartsExperience creating electrical wiring diagrams for service techniciansExperience creating Diagnostic proceduresExperience or understanding of database architecture or relational informationProficient using Microsoft Office software Can you meet these physical demands? Non-strenuous with low risk; primarily sedentary with some walking, standing, and carrying of light objects; Adequately lighted, ventilated, and heated area where normal precautions must be observed What kind of a work environment are you getting into? Work is generally performed within a normal office environment using standard office equipment; Moderate noise typical of a business office; Travel for company business required to attend off-site meetings, etc.; May require early morning, night and weekend work assignments; Interaction with contracted providers, staff and vendors by phone and face-to-face will be constant and may be interruptive; Work may be stressful at times. Do you have clearance to work? All selected candidates will be required to sign a confidentiality/non-disclosure agreement.Candidates must pass a local/state/federal criminal and employment eligibility background check.Authorization to work in the United States as verified through the E-verify System.What’s in it for you?Medical, Dental, VisionPaid Time Off401(k), company matches up to 4%Fun and flexible work environmentYour chance to work at one of the Top Workplaces in Michigan"}