{"jobID": "2732524558", "jobLocation": "Arlington_VA", "jobTitle": "Senior Principal Scientist, Data Science", "companyRating": null, "companyInfo": {"Website": "www.baesystems.com/us", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Northrop Grumman, Lockheed Martin, Raytheon"}, "estimatedSalary": null, "jobDescription": "Job DescriptionWho we are: The BAE Systems Cyber Technologies Research (CT) Group is a leading multidisciplinary cyber R&D; organization dedicated to meeting critical U.S. Cyber Security and Cyber Warfare needs. CT is the cyber R&D; engine for all of BAE Systems North America, yet it runs like a boutique firm. Its the best of both worlds--combining a small-company feel, in its own facility, with access to a large companys technology transition paths, customer base, and other resources. CT executes a variety of scientific and engineering R&D; efforts for the Department of Defense ( DoD ) and the Intelligence Community (IC). Join us for amazing R&D; challenges and work on revolutionary cyber technology that makes a direct real-world impact. What we offer:Exciting cyber research Exceptional teammates Opportunities to learn and grow A fun workplace, excellent benefits, and every other Friday off.Focus on the following::Cyber Operation & Systems Program AnalysisVulnerability and discoveryAutomated cyber attack predictionGeneration of mathematical models of program behaviorAutomated cyber defense toolsSupport uniformed operators in DoD cyber exercisesNon -traditional cyber environments including SCADA, cyber-physical systems, embedded systems, vehicles, CAN bus.Cyber Defense & Networking Secure high performance communicationsWireless and MANET protocols Distributed system analysisLifecycle attack identificationAutomated detection and containment of 0-day cyber attacksAnonymous and Covert Networks Who You Are :  We are looking for an experienced Scientist to work and lead all phases design, development, and experimental analysis of cutting edge cyber R&D; efforts. Primary emphasis on the prototyping, and experimental analysis of components and end-to-end systems for Cyber Security and Cyber Warfare at the embedded system, host, network, and enterprise levels .  Additionally you will: Develop and investigate advanced, complex algorithms and scientific solutions to complex technical problemsPlan and execute research of complex scope regularly involving multiple disciplinesCo-author / author external publications (conference papers / presentations, journal articles, books)Provide project management reporting and documentationProvide updates to internal project management for large, complex projectsActively support external project interactions with other companiesBe a technical leader or project manager on medium sized projects (5-10 people) providing solutions that are highly innovativeParticipate in external project interactions with other companiesBe heavily involved in business development effortsServe as organization spokesperson on advanced projects and/or programsBrief customers regularly on various issues/conceptsLead smaller proposals Establish relationships with current and potential customersTypical Education & Experience Typically a Bachelor's Degree and 8 years work experience or equivalent experience Required Skills and Education Strong research background in at least one of the following: Cyber securityMachine learningSensor fusion & correlationModeling and simulationBig data and analyticsReverse Engineering, vulnerability analysis, and exploit development Strong skills in at least one of the following areas: Software engineering and developmentAlgorithm developmentExperimentation design and executionProposal and presentation developmentNetworkingEmbedded Systems, SCADA, Cyber-physical systems, CAN bus Active SECRET clearance required. Must be eligible for TOP SECRET Preferred Skills and Education Capability in the following areas is desirable: Cyber security experience and interestStrong communication skillsResearch background and interestVulnerability analysis, exploit development, and related disciplinesMobile computing/Android developmentAbout BAE Systems Electronic Systems BAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services.  The Electronic Systems (ES) sector spans the commercial and defense electronics markets with a broad portfolio of mission-critical electronic systems, including flight and engine controls; electronic warfare and night vision systems; surveillance and reconnaissance sensors; secure networked communications equipment; geospatial imagery intelligence products and systems; mission management; and power-and energy-management systems. Headquartered in Nashua, New Hampshire, ES employs approximately 13,000 people globally, with engineering and manufacturing functions primarily in the United States, United Kingdom, and Israel. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression"}