{"jobID": "2823172128", "jobLocation": "Pennington_NJ", "jobTitle": "Clinical Scientist", "companyRating": null, "companyInfo": {"Website": "www.tsrconsulting.com", "Headquarters": "Hauppauge, NY", "Size": "201 to 500 employees", "Founded": " 1969", "Type": " Company - Public (TSRI) ", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client, a major pharmaceutical company in Pennington NJ is seeking a PV Scientist on a contracting basis. The candidate will support Medical Safety Assessment Physicians (MSAP) in leading Safety Data Review (SDR) Teams. The candidate perform core signal detection activities, elevate program or portfolio issues impacting benefit risk, priorities, resources, milestones with appropriate oversight. Author safety data query responses, contribute to specified sections of the Periodic Benefit Risk Update Report (PBRER) and Development Safety Update Report in a specified therapeutic area. Responsibilities:Lead Safety Data Review (SDR) Teams, and participate in related PV and product-development subteam(s) in a specified therapeutic area. Appropriately elevate signal detection findings impacting risk benefit to the MST Chair.Author PV contributions to specified sections of the PBRER and DSURs with oversight, as needed.Author safety data query responses to health authorities including coordination and integration of input from other functional groups, as needed to support responses to ad hoc queries with oversight, as needed.Periodic summary of pertinent safety-related literature, analysis of pre-determined core signal data. Provides summaries, evaluations and conclusions with oversight as needed.Collaborate within and across Major Pharmaceutical Company functions with appropriate disciplines to identify and ensure management of internal and external documentation and support when required.RequirementsBS/RN/MS/PharmD/PhD/MD, or equivalent with relevant scientific experience and/or training disciplineWorking understanding of medical concepts and some familiarity with safety activities in drug development and postmarketing and global safety health authority requirements.Demonstrated strong writing skills and experience in authoring and managing the production of scientific documents (eg, safety-risk related documents, clinical documents).Good collaborative and communication skills with scientific subject matter.Ability to understand complex medical-scientific data from a broad range of disciplines (eg, clinical trial laboratory data, nonclinical data, postmarketing reports, scientific literature, and regulatory documents)."}