{"jobID": "2764861192", "jobLocation": "Detroit_MI", "jobTitle": "RN - LABOR & DELIVERY - SANTA FE MEDICAL CENTER - Relocate to Santa Fe, NM", "companyRating": "3.6", "companyInfo": {"Website": "www.phs.org", "Headquarters": "Albuquerque, NM", "Size": "Unknown", "Founded": " 1908", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Cigna, Community Health Systems, Banner Health"}, "estimatedSalary": "30", "jobDescription": "About Us Presbyterian Healthcare Services is a locally owned, not-for-profit healthcare system of eight hospitals, a statewide health plan and a growing multi-speciality medical group. Founded in New Mexico in 1908, it is the state's largest private employer with approximately 11,000 employees.  Presbyterian's story is really the story of the remarkable people who have chosen to work here. Starting with Reverend Cooper who began our journey in 1908, the hard work of thousands of physicians, employees, board members, and other volunteers brought Presbyterian from a tiny tuberculosis sanatorium to a statewide healthcare system, serving more than 700,000 New Mexicans.  Presbyterian Santa Fe exists to improve the health of patients, members and the communities we serve in Northern New Mexico. Through our commitment to these communities, we are expanding choice, enhancing quality and elevating the patient experience. Job Description Type of Opportunity: Full Time  FTE: 0.900000  Exempt: No  Work Schedule: Varied Days and Hours  Location: Presbyterian Santa Fe Medical Center  **This opportunity is located in Albuquerque, New Mexico and relocation is provided.  Education: Associate Degree in Nursing (BSN completion within 5 years of hire)  *Degree from accredited academic nursing program (if a program is under conditional status, approval may be granted by system CNO)  Credentials: Registered Nurse - State of New Mexico or Compact State Nursing License or Graduate Nurse Permit required. BLS certification within 90 days of hire.  Summary:  Responsible for utilizing the nursing process to provide direct patient care to an assigned group of patients during a shift. Responsible for prioritizing the delivery of direct nursing care using time and resources efficiently integrating a standards-based framework model Minimum One year of nursing experience in OB, Labor & Delivery, Postpartum or NICU preferred.Benefits Benefits are effective day-one (for .45 FTE and above) and include: Competitive salariesFull medical, dental and vision insuranceFlexible spending accounts (FSAs)Free wellness programsPaid time off (PTO)Retirement plans, including matching employer contributionsContinuing education and career development opportunitiesLife insurance and short/long term disability programsAbout New Mexico New Mexico’s unique blend of Spanish, Mexican and Native American influences contribute to a culturally rich lifestyle. Add in Albuquerque’s International Balloon Fiesta, Los Alamos’ nuclear scientists, Roswell’s visitors from outer space, and  Santa Fe’s artists, and you get an eclectic mix of people, places and experiences that make this state great.  Cities in New Mexico are continually ranked among the nation’s best places to work and live by Forbes magazine, Kiplinger’s Personal Finance, and other corporate and government relocation managers like Worldwide ERC.  New Mexico offers endless recreational opportunities to explore, and enjoy an active lifestyle. Venture off the beaten path, challenge your body in the elements, or open yourself up to the expansive sky. From hiking, golfing and biking to skiing, snowboarding and boating, it’s all available among our beautiful wonders of the west.  AA/EOE/VET/DISABLED. PHS is a drug-free and tobacco-free employer with smoke free campuses.  NJ123"}