{"jobID": "2812168313", "jobLocation": "San_Francisco_CA", "jobTitle": "Catering Sales Manager", "companyRating": "4.2", "companyInfo": {"Website": "www.kimptonhotels.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Joie de Vivre, Thompson Hotels, Two Roads Hospitality"}, "estimatedSalary": "61000", "jobDescription": " Our mission is to be the best loved Hotel & Restaurant Company so regardless of position, we look for individuals who are passionate about providing genuine heartfelt care to our guest and employees.  What you get to do: Responsible for sales and operations of catering/private dining department. Act as liaison between restaurant and hotel between the client and banquet operations  Your day to day- Spends primary time on direct sellingActively understands and implements the sales process as outlined in the Shoppers ReportMaintains appropriate balance of account maintenance and prospecting for new businessEstablishes and maintains effective and profitable relationships with customersResponsible for achieving catering budgeted revenueAssists Director of Catering developing specific goals/strategies in assigned territory to positively impact revenuesThorough knowledge of property, space, capacities, concept/food style (menus)Familiar with hotels' competitive set and shared accountsEffectively cross-sells with sister restaurants/hotels for referral businessCommunicates a clear sense of strategic direction and goals for assigned territories/marketsKeeps up on industry trends and seeks creative ways to infiltrate markets/accountsActs as conduit between the catering/restaurant and hotel teamsProvides appropriate/necessary information to ensure proper operations of the departmentMaintains accurate and thorough notes/traces for accounts within the PMS and Catering DatabaseReview and update menus/packages/upgrades, as requested to satisfy customer needs/maximize revenueCreate appropriate sales collateral and tools for departmentAssist in reviewing and updating menus/packages, as requested to satisfy customer needs/maximizing revenueAssist in creating appropriate sales collateral tools for the department to maximize revenueOrganize and represent restaurant at off-premise/charity eventsJoins and attends appropriate market organizationsSpecific experience we're seeking: ~Produce marketing plan and provide input for annual budget  ~Implement monthly action plan  ~Adhere to the \"Sundown Rule\" for all customer correspondence  ~Assist in developing annual sales budget with restaurant team  ~Assist in development of yearly/quarterly marketing plan to meet and exceed budgeted sales goal  ~Completes weekly, monthly, quarterly and annual production reports  ~Provide weekly/monthly sales activity reports  ~Supervise execution of banquets on occasion  ~Respond properly in any hotel emergency / safety situation  ~Assist with additional reports and/or special projects as assigned by the Director of Catering  ~Strong Sales & interpersonal skills  ~A minimum of two years hospitality experience  ~Professional phone etiquette, writing skills and knowledge of Microsoft Office  ~High level of creativity  ~Thorough knowledge of the restaurants overall layout, rate structure and capacities  ~Tenaciously owns sales/promotional opportunities  ~Well organized, detail oriented with excellent follow-up  ~Must possess excellent communication skills both internally and externally  ~Needs to possess nimbleness by changing with the needs of the restaurant and the Kimpton Hotel & Restaurant Group  ~Emulates the Kimpton Culture DESIRABLE QUALIFICATIONS: ~Previous structured sales training course a plus  ~Preferred two years of previous restaurant and/or related banquet experience QUALIFICATION REQUIREMENTS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  EDUCATION and/or EXPERIENCE: Prior experience required. Depending on the role degree may be required.  LANGUAGE SKILLS: Ability to read, write, and verbally communicate effectively and professionally with other business departments, guests, and vendors. Ability to diplomatically deal with difficult situations and people, while exhibiting a consistent level of professionalism.  PHYSICAL DEMANDS: While performing the duties of this job, the employee is regularly required to stand, walk, and talk or hear. The employee frequently is required to use hands to finger, handle, or feel objects, or telephone. The employee must regularly lift and/or move up to 10-25 pounds and frequently lift and/or move up to 50 pounds.  (Please note: management reserves the right to change, modify, and/or alter any of the duties listed above to meet business demands)."}