{"jobID": "2828473604", "jobLocation": "Dallas_TX", "jobTitle": "Data Entry - Pricing Analyst - Insurance (P&C;) - Austin", "companyRating": "3.5", "companyInfo": {"Website": "www.genpact.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (G) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Accenture, IBM, Capgemini"}, "estimatedSalary": "14", "jobDescription": "National Vendor, a Genpact company is the insurance industrys most complete contents solution with a reputation for world-class customer service and cutting edge technology. National Vendor is a leading provider of integrated claims solutions to the U.S. property and casualty (P&C;) insurance market. We specialize in property claims management for both structural and contents losses.  We are currently searching for Data Entry - Pricing Reps to join our growing team! Qualified Candidates will have strong typing skills (ability to type at least 50 wpm), a basic understanding of MS Excel, the ability to stay organized, the ability to multi task, and are able to meet deadlines. This role is a fast paced position with requires the ability to navigate the internet and spreadsheets. Job Summary: The function of the Pricing Representative position is to transcribe inventories into Excel sheets while researching the LKQ of replacements and the understanding product categories in a time sensitive manner. This position is responsible for accuracy, efficiency and retrieval of processed data. Essential Duties and Responsibilities: Transcribe inventories into Excel. The ability to be detail oriented. Research and determine Quality replacements Input appropriate categories, depreciation and pricing sources Input pricing into National Vendor evaluation form The ability to complete assignments correctly and to meet a deadline.The ability to enter data into Excel Spreadsheets, experience with MS Word, Skype and the InternetThe ability to communicate with supervisor regarding any issues or questions which may hamper the successful completion of assigned work in a timely manner.The ability to use computers and computer systems (including hardware and software) to enter data, to process information, and as a form of communication with customers and others in the company.Keeping up-to-date technically and applying new knowledge to your job.The ability to read and understand information and ideas presented in writing.The ability to use relevant information and individual judgment to determine the best possible solution to any situation.Exercising excellent customer service skills at all times. This information can be exchanged in person, in writing, or by telephone or email.REQUIRED Education and Experience: High School Diploma or GED is required A minimum of 1 years experience in an office environment or data entry fieldCompensation and benefits: All Employee Benefits start on the first day of employment:  Health Insurance including Dental & Vision Health Reimbursement Account (HRA) Flexible Spending Accounts (FSA) Life & Disability Insurance Wellness Program 15 PTO Days a year & 11 Paid Holidays 401(k) with company match (100% Vested with first deduction) Employee Stock Purchase Program (Employee Discounts) 6 Weeks of Paid Parental Leave 12 Weeks of Maternity LeaveAdoption Assistance Program Established 1997 National Vendor is the insurance industrys most complete contents solution with a reputation for world-class customer service and cutting edge technology. National Vendor is a leading provider of integrated claims solutions to the U.S. property and casualty (P&C;) insurance market. We specialize in property claims management for both structural and contents losses. Services include loss adjusting, contents management services, end-to-end management of liability claims and managed repair services through a national contractor network.We have turned the contents-discipline into an art form by listening to our customer's needs and cultivating expert personnel that accurately and efficiently evaluate every aspect of commercial and residential contents claims. Through our Mission and Vision we add value and service to policyholder's while improving loss ratios for our insurance carriers. National Vendor became a part of the Genpact brand in May 2017. Get to know us at www.nationalvendor.com. Genpact (NYSE: G) is a global professional services firm that makes business transformation real. We drive digital-led innovation and digitally-enabled intelligent operations for our clients, guided by our experience running thousands of processes for hundreds of Global Fortune 500 companies. We think with design, dream in digital, and solve problems with data and analytics. We obsess over operations and focus on the details all 78,000+ of us. From New York to New Delhi and more than 20 countries in between, Genpact has the end-to-end expertise to connect every dot, reimagine every process, and reinvent companies ways of working. We know that rethinking each step from start to finish will create better business outcomes. Whatever it is, well be there with you putting data and digital to work to create bold, lasting results because transformation happens here. Get to know us at Genpact.com and on LinkedIn, Twitter, YouTube, and Facebook."}