{"jobID": "2802647984", "jobLocation": "Irving_TX", "jobTitle": "Senior Data Analyst", "companyRating": "2.5", "companyInfo": {"Website": "www.flagshipacc.com", "Headquarters": "Chadds Ford, PA", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " Flagship Credit Acceptance LLC (“Flagship”) is an independent auto finance company headquartered in Chadds Ford, PA. With regional offices in Irvine, California, Phoenix, Arizona, and Irving, Texas, the company has originated over $6 billion in auto finance contracts, serving over 10,000 automotive dealerships across the country. The company focuses on the mid-tier non-prime credit spectrum of borrowers, providing both indirect and direct automotive financing.  The Senior Data Analyst will be responsible for extracting meaningful insights from the large amounts of data we collect, as well as becoming the Risk and Analytics team’s subject matter expert on all things data related. This person should be capable of developing a deep understanding of the Company’s business, working closely with cross-functional teams, to find the best method to gather, integrate and deliver relevant information which enhances the company's business decision-making capabilities. Acting as the liaison between the business and technical teams, this position will create a well-structured business intelligence environment, ensuring the information is accessible, accurate and compressive.  Candidates should be comfortable with high-growth environments and expected to concurrently manage multiple complex projects and thrive in a fast-paced dynamic organization. The position will report to the Director, Business Strategy.Essential Functions and Responsibilities:Lead the charge on development and implementation of self-service data by the enterpriseDevelop extensive platform knowledge, becoming resident data expert; understand and incorporate key operational and performance metrics across all departmentsCreate new reporting that combines data from multiple data warehousesPartner with IT to further normalize our data warehouse and to improve our data dictionariesWrite advanced SQL queries to deliver ad-hoc reportsDevelop Business Objects universes, data structures, and business layers; add new fields, modify table joins, implement data structures, create derived tables.Conduct tests to ensure that reporting and data is consistent and accurate; identify, research and resolve technical data problems.Champion the adoption of new data analytics toolsCollaborate with IT in the development of database queries and SQL stored procedures to synthesize information from multiple data sources, systems, and reports to provide BI Solutions which meet departmental needsProvide training to peers and end users in the use of reporting, data provisioning and analytic toolsPerform other projects as requiredQualifications:Bachelors Degree in Mathematics, Finance, Engineering, Computer Science/MIS, Statistics or Business Intelligence and AnalyticsA minimum of 2 years’ experience in related field(s) with consumer auto lending experience a plus2+ years of experience in SQL QueryingRecent experience with Business Object platforms; implementing and maintaining data layers and universesDemonstrated quantitative/technical abilities with OLAP and report development tools (i.e. SAP Business Objects, SQL, etc.)Experience with any or all of the following statistical tools preferred: SAS, Stata, Python or R.Experience with normalizing unstructured dataExperience in complex data integration projectsDedication to information integrity, accurate reporting, and strict confidentialityOutstanding problem-solving abilitiesStrong communication skills and detail orientedAbility to perform in a rapidly changing, high-intensity environmentFinancial institution, lending or banking knowledgeAbility to manage, control, and complete multiple competing assignments simultaneously while maintaining accuracy and qualityStrong desire to achieve and succeed"}