{"jobID": "2837504080", "jobLocation": "Somerset_NJ", "jobTitle": "Environmental Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " For over 60 years, Parsons has been committed to environmental sustainability, conservation, and restoration. We have developed and tested all types of remediation methods, honing our ability to provide the most effective methods to clean up contaminated soil, water and air! If you are passionate about your environment, like the balance of working in the field and office, and want to work with a team of experts to produce a cleaner and safer world, this is the position for you! We are hiring an experienced Field Scientist for remediation projects primarily in NJ, and NY.  The responsibilities for this position will include but are not limited to the following: Soil classification and sampling during drilling, test pitting and excavation activitiesGroundwater sampling utilizing a wide variety of equipmentSupervision of drillers and other subcontractors.Operation of various types of equipment (e.g. GPS, data loggers, survey level, combustible gas meters, etc.).Completion of field documentation such as activity hazard analysis (AHA) forms, project field reports, field notes, monitoring and chain-of-custody forms.Work with Project Managers, using interpersonal and organizational skills, to ensure projects are completed on time and budget.Perform other responsibilities associated with this position as may be appropriate. Candidate will be expected to travel throughout NJ and the NY Burroughs, and is preferred to be centrally located. Fleet vehicle or rental car will be provided for travel. No relocation is provided for this position. JOB REQUIREMENTS:A 4-year degree in environmental science or similar programs.A minimum of 3 years' experience conducting environmental field efforts.A minimum of 2 years experience conducting groundwater sampling is required.Experience with Phase I and Phase II Site Investigations is preferred.Familiarity with NJDEP Technical Requirements for Site Remediation and NJ Field Sampling Manual.A valid driver's license and the ability and willingness to travel to and from field locations in New Jersey, New York, Pennsylvania, and Delaware is required.Should be able to complete work that requires some physical exertion such as extended periods of standing, walking over rough, uneven, or rocky surfaces, lifting, recurring bending, or similar activities.Work in adverse weather conditions (i.e. hot, cold, rain and snow).Excellent written and oral communications skills.Ability to perform field tasks self-sufficiently or as part of a team.Proficiency in Microsoft Word, Excel, and Project."}