{"jobID": "2803235244", "jobLocation": "Bethesda_MD", "jobTitle": "Test Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.csscareers.com", "Headquarters": "Bethesda, MD", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OVERVIEWThe CompanyCommon Securitization Solutions (CSS) is seeking an experienced Test Data Anaylst to join our team of talented professionals in Bethesda, Maryland.  How many times in your career do you get the opportunity to do something that’s never been done? To create something that will change an entire industry? CSS is building the Common Securitization Platform to issue and manage mortgage securities. We’re looking for people who can walk in two worlds – a start-up environment where development is collaborative and rapid; and a production environment where we run and monitor the performance of the platform. Longer-term, this platform could serve the entire US housing finance industry. Sound transformative? It is. Come join us and help create something remarkable.RESPONSIBILITIESJob InformationWork as a collaborative team member at CSS on the Test Data Management (TDM) Team in support of the testing of the Common Securitization Platform (CSP). Analyze, profile, catalog and vend test data and test data sets to the CSS testing organization in support of CSP testing. Develop a strong expertise of the CSP, its inbound interfaces and its outbound interfaces. Verify test data to ensure it executes as expected on the CSP. Key Job FunctionsUtilize internally developed TDM tools to search, catalog and vend test data and test data sets.Manage the full life cycle of test data sets in support of testing of the CSP by maintaining detailed run books and test data metadata.Write SQL to analyze and profile test data.Develop a detailed understanding of the required order of execution of CSP test data by creating and maintaining highly detailed run books.Perform visual inspection of the TDM-generated and GSE-generated test data in XML to ensure correctness.Provide requirements for enhancements and new features for TDM utilities.Work closely with TDM team members, testers and business architects to define and document test data needs.Perform data profiling and analysis of GSE-supplied and internally generated test data.Participate in and lead projects/meetings with internal/external stakeholders to define, develop and document test data management best practices and procedures.Use Rally to manage the backlog, user stories and defects.Report status to management on a regular basis.Work closely with testers and testing efforts to assist with triaging issues and defects. QUALIFICATIONSEducationBachelor's Degree in Information Technology, Computer Science or other similar field of study.Minimum ExperienceMinimum 5 years’ work experienceSpecialized Knowledge & SkillsMinimum of 5 years’ experience in writing Oracle SQL to extract and analyze data from RDBMS’s.Strong documentation skills.Knowledge of XML is necessary. XLST experience is a plus.Basic-level Unix and Windows scripting knowledge would be beneficial, but is not obligatory.Demonstrated ability to learn and apply new technologies quickly.Mortgage Industry experience is preferred.Good communications skills both verbal and written.Good project and time management skills.Excellent analytical skills and ability to analyze test data and CSP data.Must be able to work independently and with cross functional teams to deliver.Must be highly self-driven, self-organized and have strong attention to detail.Employment As a condition of employment with Common Securitization Solutions, any successful job applicant will be required to pass a pre-employment drug screen and to successfully complete a background investigation, which may also include a credit check for positions in some areas of our business.  Common Securitization Solutions is an Equal Opportunity Employer."}