{"jobID": "2520625299", "jobLocation": "Plano_TX", "jobTitle": "Principal Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "89000", "jobDescription": " Plano 1 (31061), United States of America, Plano, Texas  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Principal Data Analyst  Capital One is a diversified bank that offers a broad array of financial products and services to consumers, small business and commercial clients. Ranked #127 on the Fortune 500, Capital One has one of the most widely recognized brands in America. As one of the nations top 10 banks, we offer a broad spectrum of financial products and services to consumers, small businesses and commercial clients. We nurture a work environment where people with a variety of thoughts, ideas and backgrounds, guided by our shared Values, come together to make Capital One a great company and a great place to work.  At Capital One, data is at the center of everything we do. When we launched as a startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.  As a Data Analyst at Capital One you will leverage analytic and technical skills to innovate, build, and maintain well-managed data solutions and capabilities to tackle business problems.  On any given day you will be challenged on three types of work Innovation, Data Management and Business Intelligence: InnovationAct as key data lead to leverage versatile technical capabilities to drive the development, evolution, and implementation of data products, that which enable self-service by data consumersExplore industry trends, tools, and techniques in Open Source/Big Data/Digital domainBusiness IntelligenceDevelop prototypes and run experimentation for business intelligence tools, solutions, and techniquesAssist in development of standards and policies for business intelligence frameworkData ManagementEvaluate data management, data quality and data access processes for gaps, inefficiencies and opportunities; provide recommendations for improvementImplement solutions and processes for management and governance across data quality metrics, metadata, lineage, data access rights and business definitionsOur ideal candidate will have:Degree specialized in a Science, Technology, Engineering, Mathematics disciplineScripting experience in (Python, Perl, JavaScript, Shell)Strong desire and experience with data in various forms (data warehouses/SQL, unstructured data environments/PIG,HIVE, Impala)Experience leading projects to deliver complex data management solutions; working with internal and external partnersBasic Qualifications:Bachelors DegreeAt least 4 years of experience in at least one scripting languageAt least 4 years of experience in querying and analyzing and working with data languages and platformsPreferred Qualifications:Masters Degree in a Science, Technology, Engineering, Mathematics discipline4+ years experience working BI reporting tools (i.e. Tableau and Business Objects)4+ years of experience working within process management and improvement methodologies Lean, Six Sigma, etc.2+ years of experience delivering Data Governance and Data Quality Management concepts and practices within the financial services industry2+ years of experience working with Agile development methodologiesCapital One will consider sponsoring a new qualified applicant for employment authorization for this position. TBLI"}