{"jobID": "2796133853", "jobLocation": "Bethesda_MD", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.prolim.com", "Headquarters": "Farmington Hills, MI", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " PROLIM Global Corporation (www.prolim.com) is currently seeking Data Scientist for location Bethesda, MD for one of our Top client. Essential Job Functions:Lead development of the ML Framework within the Dynamic Surveillance Platform.Work closely with multiple client businesses to specify, design and build the ML Framework.Collaborate with Data Engineers to specify and design the Data Framework.Strong and disciplined coding skills with a history of creating and supporting reusable packages (Scala, R or Python).Analyze experimental data with statistical rigor.Ensure accurate interpretation by combining business acumen with detailed data knowledge and statistical expertise.Build machine learning base surveillance models to monitor markets and protect investors.Translate analytic insights into concrete, actionable recommendations for new models and communicate these findings.Drive efforts to enable independent interpretation of results through education, improved tools, and data visualization.Other Responsibilities:Mentor other Data Scientists on the team and within client on methodologies and best practicesEducation/Experience Requirements:Masters or PhD degree (preferred) in Statistics, Mathematics, Psychology, Sociology, Econometrics, or related field.5+ years relevant experience with a proven track record of leveraging analytics and large amounts of data to drive significant business impactSolid statistical knowledge and intuition, ideally utilized in experimentation and modelingStrong algorithmic thinking and independent research abilityPassion for learning and innovating new methodologies at the intersection of statistics, applied math, and computer scienceExceptional interpersonal and communication skills coupled with strong business acumen. Must be able to translate business objectives into actionable analyses, and analytic results into actionable business and product recommendationsImpactful presentation skills, including the use of meaningful charts, graphs, or other data visualizations to convey information and results clearly and conciselyStrong background in machine learningStrong knowledge of advanced statistical methods and predictive modelingWorking Conditions:Work is normally performed in an office environment.Occasional travel and extended hours may be required with extended hours when necessary. Apply online for immediate consideration, please send your updated resume and contact info via email jayaprakash.hiremath@prolim.com About PROLIM Corporation PROLIM is a leading provider of end-to-end IT, PLM and Engineering Services and Solutions for Global 1000 companies. They understand business as much as technology, and help their customers improve their profitability and efficiency by providing high value technology consulting, staffing, and project management outsourcing services.  Their IT and PLM consulting offerings include; Advisory, PLM Software/Services, Program Management, Solution Architecture Training/Staffing, Cloud Solutions, Servers/Networking, Infrastructure, ERP Practices and QA Services. Engineering services include Data Translation, CAD/CAM/CAE, Process & Product Engineering, Prototyping, and Testing/Validation within a wide range of markets and industries."}