{"jobID": "2835288666", "jobLocation": "Los_Angeles_CA", "jobTitle": "Software Engineer/ Data Scientist / Data Engineer (Python, SQL, data pipeline) - JP", "companyRating": "3.5", "companyInfo": {"Website": "www.cbsinfosys.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "My name is Joe and I am looking for Data Analyst/Engineer (SQL and Python and Data Pipeline) to work for an on-site Contract assignment in Los Angeles, CA. If you are available and interested and a good fit for the position, then please email me an updated copy of your resume along with the required details at Joe@cbsinfosys.com Updated resume Visa Status: - Current Location: - Relocation: - Availability to interview:- Availability to join: - Phone #:- Best Time to contact:- Hourly rates:- Availability to relocate:-Title: Data Analyst/Engineer  Position Type: Contract for 6 to 12 Months  Location: Los Angeles, CADescription: Strong Data Analyst who has worked with data professionally for at least 5 years.  This person needs to be well versed in SQL with building and operating data pipelines. The ideal candidate must have experience with SQL Server, SQL and Python. Work with senior client stakeholders as a trusted advisor. Connect data from multiple sources to extract data, uncover findings and support actionable solutions. Build robust data pipeline systems Evolve data schemas/models to meet new and changing business requirements. Scale up Python algorithms into production applications. Work collaboratively and cross functionally on process improvements that minimize impact and improves data quality standards. Experience with SDFC is a plus.Skill Set : Python (strong) Any data pipeline experience ( like Kafka, Streamsets, flink /storm etc), SQL & Streaming knowledge, ( Cloud knowledge is good).Responsibilities: Implementation of the continuous ML platform.  Some of the functions include the below Data Ingestion Pipelines Decentralized Data routing mechanism Integration with Cloud API’s Model Management-- JoeCBS Information Systems, Inc & Central Business Solutions, Inc37600 Central CourtSuite 214Newark, CA 94560 Mobile: 415-349-7459Cell/Text: 415-534-5637Fax: (510)740-3677Email:Joe@cbsinfosys.com - provided by DiceData, Python, SQL, pipeline, Hive, Hadoop, ETL, API"}