{"jobID": "2540400879", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Science Manager - Bangkok", "companyRating": null, "companyInfo": {"Website": "www.agoda.com", "Headquarters": "Singapore, Singapore", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " If you don't already know us, Agoda is the largest and fastest growing online hotel booking platform in Asia. And as a Booking Holding company, we are part of the largest online travel company in the world. We have the dynamism and short chain of command of a startup and the capital to make things happen. Whats stopping you from getting in touch?  Bangkok: While its 30°+ outside, our engineers dont sweat, knowing they have the coolest jobs out there. Working in one of the largest international Internet employers headquartered in Asia, your work has an impact on what we do around the globe.  We move fast why wait ages to see your ideas go live? Work on tough challenges, safe in the knowledge that you are surrounded by people as smart as you are (if not smarter!) to help solve them. And while were on the subject, Agoda people come from over 65 countries: Its an incredible technical creative melting pot.  Technology is not just what we do its at the heart of who we are. We put cutting-edge technology in your hands so you can help us change the way people run their lives. We want you to come here so they can get there and get your career going places, too.  Maintaining this growth requires an incredible amount of data, a superior IT infrastructure, and world class talent to bring it all together.  Your role is to: Manage a team that helps crack our business problems and come up with deployable machine learning modelsInterface with business to make sure they are asking the right questionsSift through our data and find us some gemsBe a world-class hands-on deploy master Charm us with: Previous experience managing a team of Data Scientist'sAn earned stripes in coding, in data handling, in statistics and in machine learning (5 years of experience is a must.A good balance between theory and practice and a strong desire to learn and keep up with the latest technologies (a master degree in a quantitative field is a must; PhD is even better)Battle-tested team leading skillsA good knowledge of whats Under the hood of statistical methodsCoding, coding, coding (R, Python, C#, Java, C++, Scala, )Some extra points on: SQL, NLP, business acumen, blog writing, good sense of humorWe welcome both local and international applications for this role. Full visa sponsorship and relocation assistance available for eligible candidates.Agoda is a Booking Holdings (BKNG) company, the worlds leading provider of brands that help people book great experiences through technology.Apply!"}