{"jobID": "2712162661", "jobLocation": "Springfield_VA", "jobTitle": "Statistician/Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Description:Anyone interested in being considered for a position for this upcoming contract, please apply with your most recent resume and contact info for us to reach out to you directly, should you qualify. All candidates must have an ACTIVE TS/SCI level clearance currently to be considered. Organizes, directs and coordinates the planning and execution of customer research projects, including: developing research proposals; design research efforts to address specific business needs; monitor projects and report regularly on progress; develop research materials based on scientific best practices; supervise research execution; collaborate with statisticians to develop data analysis plans for research efforts; interpret and summarize research results. Serve as Subject Matter Expert (SME) on social science methodology and research practices: applies latest research methods and designs; offers guidance and recommendations on questions of research methodologies as needed.  Consults with research owners and manage client relationships, including: defining research requirements in terms of business objectives; provides guidance to clients regarding appropriate research goals and setting reasonable expectations for results; creates and delivers presentations to clients regarding research findings that are appropriate for a non-scientific audience.  Possesses strong written and oral communication skills, and the ability to interact with senior government officials.Qualifications:LEVEL 1 Experience designing, executing or assisting with social science researchExperience developing project schedules for small-scale or short-term projectsPossesses strong written and oral communication skills, and the ability to interact with senior government officialsBachelors Degree or equivalent experience within social science research field: psychology, sociology, communications, economics, anthropology, consumer sciences, market research, organizational behavior, management LEVEL 2 Experience conducting independent social science research1-3 years conducting research in an organizational setting (government, industry, non-profit, etc.)Possess basic working knowledge of statistics and/or data scienceExperience developing schedules for complex projects and programs, and leading small to mid-size teams in executing these effortsPossesses strong written and oral communication skills, and the ability to interact with senior government officialsMasters Degree or equivalent experience within social science research field: psychology, sociology, communications, economics, anthropology, consumer sciences, market research, organizational behavior, management 5-9 years LEVEL 3 Experience conducting independent social science research3-5 years conducting research in an organizational setting (government, industry, non-profit, etc.)Possess basic working knowledge of statistics and/or data scienceExperience developing schedules for large-scale and/or highly complex projects and programs, and leading large teams in executing these effortsPossesses strong written and oral communication skills, and the ability to interact with senior government officialsMasters Degree in a social science research field or equivalent experience in consumer behavior, consumer psychology, market research, organizational behavior, industrial-organizational psychology or similar 10-14 years LEVEL 4 Experience conducting independent social science research6+ years conducting research in an organizational setting (government, industry, non-profit, etc.)Possess basic working knowledge of statistics and/or data scienceExperience developing schedules for large-scale and/or highly complex projects and programs, and leading large teams in executing these effortsPossesses strong written and oral communication skills, and the ability to interact with senior government officialsPhD in a social science research field or equivalent experience in consumer behavior, consumer psychology, market research, organizational behavior, industrial-organizational psychology or similar 15+ yearsLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}