{"jobID": "2810308345", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Principal Data Scientist - Prescriptive Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "160000", "jobDescription": "Job Description What you'll be doing...  You'll be part of a leading-edge advanced analytics team helping us bring the best possible experiences to our customers by helping us to identify what they like, and create personalized recommendations for them based on what we've learned. Using your analytics expertise, you'll help us figure out how to get the most accurate information and insights from all kinds of data. Supports day-to-day and tactical analytics needs of the operational teams like setting safety stock targets at DCs and storesDrives strategic efforts across the supply chain organization, leveraging advanced analytics to optimize processes and procedures that lead to improved device life cycle management, working capital optimization and cost reductionEnsures appropriate and correct modeling techniques are used by the data scientists and analysts in the teamActs as the go-to-person for the data scientists and analysts for technical modeling questions, and the state-of-the-art models and software in the field.Works as the analytics lead person in an operational planning team, supports our core business, be part of the team and equally responsible for achieving business targets with minimum possible cost and working capitalOwns the development and adaptation of quantitative models which recommend inventory targets for different stock points in the supply chain (DCs, stores, etc.) for critical and strategic OEM'sProvides data driven and analytics support and business recommendations for BAU disruptions in supply and demand like promotionsTranslates supply chain challenges into an analytical problem, relaying results in common business language with managerial implicationsPartners with Supply Chain operational teams (e.g., supply & replenishment planning, distribution & logistics) and other Verizon organizations (e.g., device marketing, merchandising) to identify supply chain inefficiencies and potential root causesDesigns and implements creative approaches to predictive modeling problemsPerforms model assessments, validation, and enhancement activitiesTracks and reports success metrics for projects and their impact on key supply chain KPIsPartners with IT to effectively migrate analytical models from prototype to productionDrives adoption and application of analytical model results with business partners, ensuring benefits realizedProvides research/analysis information to department/executive staffMentors for data scientists and analysts in the teamYou'll be is an individual contributor, and autonomous in technical and analytical choices like determining the appropriate modeling technique to utilize and design decisions. What we're looking for...  You are good with numbers and you love to dig into data to find the story. Designing reports and spreadsheets is a fun afternoon for you. You are detail-oriented and know how to focus on what really matters. You understand the importance of accuracy in data analytics and reporting. You are a self-starter and a multi-tasker who can work independently under tight timelines. You want to make an impact by providing the data that will help improve the experience of our customers. You'll need to have:Bachelor's degree or four or more years of experienceSix or more years of relevant work experience.Three or more years of experience in developing and implementing analytical models in business.Experience with SQL and statistical software packages (e.g., R, SAS or SPSS)Even better if you have:Master's or PhD in Operations Research, Industrial Engineering, Statistics, Economics or a related field.Experience with data visualization software such as Qlikview, Tableau or Excel.Experience and competency in supply chain management.Coding skills in a general-purpose programming language (e.g., C/C++, Java or Python).Proficiency in engaging and influencing large teams and functional leaders. When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}