{"jobID": "2673559890", "jobLocation": "Chicago_IL", "jobTitle": "Actuarial Data and Visualization Analyst", "companyRating": null, "companyInfo": {"Website": "www.argolimited.com", "Headquarters": "Hamilton, Bermuda", "Size": "1001 to 5000 employees", "Founded": " 1948", "Type": " Company - Public (ARGO ) ", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Argo Group has an exciting and challenging opportunity for an Actuarial Data and Visualization Analyst reporting to our Actuarial Data and Visualization Manager. The desired locations for the candidate are the Scottsdale, AZ, Denver, or Chicago offices. Responsibilities will include contributing to the data efforts for the Actuarial Team including database strategy, creation, visualization, and coordination. The position will work closely with the Pricing, Reserving and Predictive Modeling Actuaries to create robust databases, visualizations, modeling datasets and reports. Other responsibilities will include working with Argo’s Digital and IT organizations to coordinate dataflows from Oracle, SQL, AWS, SAS, etc.Responsibilities:Work in a team environment with Actuarial, Underwriting, IT and Digital.Update, create and support cross-company actuarial databases and reports to provide executives, business leaders, actuaries and underwriters with key metrics to make important strategic decisions.Identify and gather relevant and quality data sources required to fully answer questions, address problems, and recommend strategy through testing or exploratory data analysis (EDA). Integrate/transform disparate data sources and determine the appropriate data hygiene techniques to apply.Familiarity with technical issues in statistical modeling and ability to adjust data to solve business problems. Work with IT and Digital to create data/modeling environment that is efficient for analysis.Support and execute a strategy for reporting/visualization for Actuarial.Support other areas within Argo as a knowledge resource on data sources, collection, and tools.Responsibility to keep up to date on new/updated tools in the Big Data environment.Qualifications:Bachelor's Degree in Mathematics or Statistics or in a related field of study2+ years of experience in a data/reporting roleExperience with combining data sets from multiple sources and varying database types preferred.Ability to be creative/flexible and to manage concurrent projects and reporting schedulesStrong with SQL skills with both Microsoft and Oracle SQLExperience with Business Intelligence reporting package such as Business Objects, Cognos, Tableau, QlikView or Microsoft Power BIStrong communication skills with the ability to convey technical concepts to other functional areasPassion for finding streamlined and less complex solutions to data gathering, analysis and reporting We are an Equal Opportunity Employer. We do not discriminate on the basis of age, ancestry, color, gender, gender expression, gender identity, genetic information, marital status, national origin or citizenship (including language use restrictions), denial of family and medical care leave, disability (mental and physical) , including HIV and AIDS, medical condition (including cancer and genetic characteristics), race, religious creed (including religious dress and grooming practices), sex (including pregnancy, child birth, breastfeeding, and medical conditions related to pregnancy, child birth or breastfeeding), sexual orientation, military or veteran status, or other status protected by federal, state and/or local laws. Applicants: For the most convenient application experience, please use the “Apply with LinkedIn” button. If manually entering, only include your most recent or relevant job information needed for this role. For either method, please attach your most current resume. Additional job history may be obtained if selected for the interview process."}