{"jobID": "2805848795", "jobLocation": "Oakland_CA", "jobTitle": "Health Data Analyst IV Decision Support", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "117000", "jobDescription": " Provide quantitative measurement and data analysis expertise for the Utility for Care Data Analysis. Responsible for implementing established, as well as developing and applying innovative techniques for measuring, analyzing, and reporting on healthcare processes, health outcomes, and health costs. Essential Functions: Independently determines and implements appropriate measurement and analytical methods to achieve specified analytical project or tasks objectives.  Exercises independent professional judgment regarding analysis assumptions and data quality. Identifies and resolves data quality issues, as required.  Coordinates the work of other project team members (UCDA staff, regional analytic staff, and contractors) to accomplish specified analytical project or task objectives.  Determines the most informative approaches to summarizing data and communicating analytical results. Develops, as required, innovative or customized templates and formats.  Implements specified quality assurance procedures to ensure accuracy of project data, results, written reports, and presentation materials.  Designs and creates written reports and presentation materials describing project objectives, methods, data, and results.  Given project or task data requirements, determines the most efficient approach to data collection and validation and works independently to obtain needed data from KP HealthConnect information systems (e.g. Clarity).  Trains and coaches less-experienced healthcare data analysts on data retrieval techniques, programming practices, and statistical analysis and data visualization methods in the context of specific tasks.  Specifies project quality assurance reviews and tests based on project characteristics and requirements. Provides guidance to other healthcare data analysts regarding the implementation of such QA reviews and tests.  Develops detailed measurement and reporting specifications based on project characteristics and requirements provide by project leadership. Provides guidance to other healthcare data analysts regarding the implementation of such specifications.  Applies analytic knowledge, skills and experience to perform project-related work, complete specific project tasks, and create project deliverables. Basic Qualifications: Experience  Minimum five (5) related years of work experience with master's degree. Education Master's degree OR a doctoral degree.  Disciplinary training in advanced quantitative measurement methods (mathematics or statistics), ideally in the context of a quantitative social science or health services research.  License, Certification, Registration  N/A Additional Requirements: Demonstrated effectiveness in written and verbal communication of technical material.  Demonstrated effectiveness working as a member of a technical project team on complex projects.  Experience with analysis of large administrative databases and computer-intensive statistical analysis (preferably using SAS), multivariate statistical methods, general research methodology.  General knowledge or work experience in one (1) or more of the following areas: disease management, survey design, health status measurement, case-mix or health risk adjustment methods, research methods, actuarial methods, cost-benefit or cost-effectiveness analysis.  Skills in analytical methods including problem and model formulation, algorithm selection, and development of overall solution strategy.  Creativity, critical thinking, and excellent problem-solving skills.  Outstanding written and verbal communication and effective interpersonal skills.  Ability to train and coach less-experienced team members on technical tasks.  Considered functional expert.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Minimum five (5) related years of work experience (i.e. in an analytical environment, preferably in healthcare) with master's degree.  Knowledge of healthcare industry, especially healthcare analytics preferred.  Familiarity with Kaiser Permanente healthcare system preferred. "}