{"jobID": "2802758815", "jobLocation": "Waterford_MI", "jobTitle": "Cloud Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.oakland.k12.mi.us", "Headquarters": "Waterford, MI", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": "GENERAL ANNOUNCEMENT: POSITION OPENINGCloud Engineer – Technology ServicesWHO WE ARE:Oakland Schools is a regional service agency that offers support services to school personnel that are best delivered regionally and provide cost, size and quality advantages to those we serve. Oakland Schools is an autonomous, tax-supported public school district governed by Michigan General School Laws and is one of 56 intermediate school districts (ISDs) established in Michigan in 1962.Our organizational focus is centered on these central objectives:Increase student achievementServe diverse needs of schoolsDecrease costs/increase efficienciesSALARY DETAILS:$78,709 - $89,999 Annually / Exempt position / 12-month work year IN THIS ROLE:Oakland Schools is looking for an experienced Cloud Engineer to plan, configure and setup cloud computing resources in addition to maintaining the availability, functionality and performance of the network-computing environment including but not limited to voice, video, and data application utilization. Are you ready to take your career to the next level? If so, apply today!WHAT WE NEED:We are seeking a motivated collaborative team member to develop cloud migration strategies maintaining current Hot/Warm level of failover capabilities; plan, configure, and implement required routing patterns for MAN (metro area network) and WAN (wide area network) networks; diagnose and resolve equipment problems on a timely basis; participate in the evaluation, operation and testing of software, hardware and network configurations.This position requires assisting in implementing system upgrades, enhancements and expansions; coordinating technology into business and teaching efforts and design and implementation of technology projects.WHAT YOU NEED:Bachelor’s degree in Computer Science, Information Technology or a related field plus 4-6 years of related experience; or other equivalent combination of education and experience from which comparable knowledge and abilities can be acquired.Experience in Networking, Windows, Cloud Development and CommunicationCertification related to cloud infrastructure, network engineering, and/or network administration preferred.WHAT WE PROVIDE:Oakland Schools offers company paid coverage for life insurance, short and long-term disability, well-being benefits and leave days. In addition, Oakland Schools offers comprehensive medical coverage or a cash in lieu benefit, dental, vision, additional life insurance, health savings account, flexible spending accounts, pet insurance, legal plan, college savings plans, tax-sheltered annuity (TSA) plans and the Office of Retirement Services retirement plans.APPLICATION INSTRUCTIONS:Letters of interest and resumes will be accepted until position is filled.CLICK HERE TO APPLY!https://oakland.k12.mi.us/Pages/default.aspxOakland Schools does not discriminate on the basis of sex, race, color, national origin, religion, height, weight, marital status, sexual orientation (subject to the limits of applicable law), age, genetic information, or disability in its programs, services, activities or employment opportunities. Inquiries related to employment discrimination should be directed to the Assistant Superintendent of Human Resources, Personnel Management and Labor Relations at 248.209.2429. Title IX complaints should be directed to the Manager/Supervisor, Career Focused Education at 248.209.2160. For all other inquiries related to discrimination, contact the Executive Director of Legal Affairs at 248.209.2062. All complaints may be addressed to 2111 Pontiac Lake Road, Waterford, MI 48328-2736.This job description is intended to describe the general nature and level of work being performed by a person assigned to this job. It is not to be construed as an exhaustive list of all job duties that may be performed by a person so classified. Incumbents may be asked to perform additional duties as required by his/her supervisor."}