{"jobID": "2701240527", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Description:The Civil Health group is currently seeking a Data Scientist to support a large contract in DC.  The Data Scientist will help our customer answer their business questions by developing methods, process, and systems to provide them insight into their data.  Designs and develops methods, processes, and systems to consolidate and analyze structured and unstructured, diverse sources including big data sources. Develops and uses advanced software programs, algorithms, querying and automated processes to cleanse, integrate and evaluate datasets and models complex business problems. Is familiar with disciplines such as Natural Language Processing, Machine Learning, Predictive modeling, Statistical Analysis and Hypothesis testing. Works with cross-discipline teams in order to ensure connectivity between various databases and systems. Identifies meaningful insights, and interprets and communicates findings and recommendations. May develop information tools, algorithms, dashboards, and queries to monitor and improve business performance. Maintains awareness of emerging analytics and big-data technologies.Qualifications:BS and 4 8 years of prior relevant experience or Masters with 2 6 years of prior relevant experience.  Has experience with the following:  · Tools and techniques for data analysis and data preparation  · Data visualization (e.g. Microsoft PowerBI, Tableau), and machine learning;  · Working directly with stakeholders to solve business problems;  Working within a team with standard development lifecycle processes including agile methodologies Preferred Qualifications Experience in the following areas are desirable: health care, retail sales & marketing, manufacturing.Leidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}