{"jobID": "2824097302", "jobLocation": "Princeton_NJ", "jobTitle": "2018 Global Data Technical Operations Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.bloomberg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Google, Goldman Sachs, Thomson Reuters"}, "estimatedSalary": "69000", "jobDescription": " Global Data Technical Operations Analyst  Bloomberg runs on data. In the Global Data team, we're responsible for supplying it which also means we solve problems. Problems that can only be solved by people, not defined by conventional roles, but by diverse experiences, skills, and styles. You can be a designer, scientist, entrepreneur, engineer, or any combination as long as you're delivering with an impact. All of your efforts will help our clients answer some of their most challenging questions as we work to normalize the world's data so other teams here can turn it into insights.  What's the role?  You'll be joining a team responsible for using and developing cutting-edge technology and project management techniques to enhance our acquisition, data flow and automation processes. As an individual contributor, you will be responsible for developing technical solutions that improve internal processes and produce unique client-facing content.  We are hiring for a couple different areas within our Technical Operations team including data engineering, workflow engineering, and acquisition. During the interview process, our TechOps experts will see which team is the best fit for you. However before we get there, here's a breakdown of the areas so you can see how your skills will align:  Acquisition Manage and streamline the use of automated data acquisition tools and processes for ingesting content from around the world.  Data Engineering Focused effort in NLP and content classification, anomaly detection/predictive modeling and ETL processes that allow us to deliver high impact data for our clients.  Workflow Engineering Lead the design, development and implementation of workflows that facilitate the data management process from beginning to end for our internal Global Data clients.  After classroom style training, you will be prepared to hit the ground running and put your STEM background to use. We'll trust you to: Apply problem-solving skills to identify innovative work-flow efficiencies and use cutting-edge technology solutions to enhance our processes and software  Assist in monitoring and communicating progress throughout each project's development lifecycle  Collaborate with data analysts and managers to devise creative solutions to technical issues they face in their businesses  Develop systems and methods for acquiring content from external sources to support the Global Data and News businesses  Liaise with stakeholders to gather requirements, scope projects, and develop project plans  Troubleshoot technical issues relating to the automated systems we employ You need to have: 0-2 years previous work/internship experience in information technology, engineering, business management, data analysis or research  Demonstrated experience using one or more programming languages (e.g. Python, JavaScript, etc.)  Prior coursework or involvement within a field like Informatics, Mathematics, Economics or other applied sciences We'd also like to see: Project management and organizational skills  Proven ability to adapt to a fluid environment  Effective written and verbal communication skills  Strong aptitude for problem solving, plus the drive to think creatively You need to be able to: Start working full time in/after January 2018  Provide proof of graduation (Bachelors or advanced degree) prior to your start date  Legally work in the US without visa sponsorship  Does this sound like you?  Apply! If we think you're a good match, we'll get in touch with you soon about next steps.  Apply Now  2018 Global Data Technical Operations Analyst - Princeton, NJPrinceton  Posted Oct 5, 2017 - Requisition No. 62499  Apply Now  Global Data Technical Operations Analyst  Bloomberg runs on data. In the Global Data team, we're responsible for supplying it which also means we solve problems. Problems that can only be solved by people, not defined by conventional roles, but by diverse experiences, skills, and styles. You can be a designer, scientist, entrepreneur, engineer, or any combination as long as you're delivering with an impact. All of your efforts will help our clients answer some of their most challenging questions as we work to normalize the world's data so other teams here can turn it into insights.  What's the role?  You'll be joining a team responsible for using and developing cutting-edge technology and project management techniques to enhance our acquisition, data flow and automation processes. As an individual contributor, you will be responsible for developing technical solutions that improve internal processes and produce unique client-facing content.  We are hiring for a couple different areas within our Technical Operations team including data engineering, workflow engineering, and acquisition. During the interview process, our TechOps experts will see which team is the best fit for you. However before we get there, here's a breakdown of the areas so you can see how your skills will align:  Acquisition Manage and streamline the use of automated data acquisition tools and processes for ingesting content from around the world.  Data Engineering Focused effort in NLP and content classification, anomaly detection/predictive modeling and ETL processes that allow us to deliver high impact data for our clients.  Workflow Engineering Lead the design, development and implementation of workflows that facilitate the data management process from beginning to end for our internal Global Data clients.  After classroom style training, you will be prepared to hit the ground running and put your STEM background to use. We'll trust you to: Apply problem-solving skills to identify innovative work-flow efficiencies and use cutting-edge technology solutions to enhance our processes and software  Assist in monitoring and communicating progress throughout each project's development lifecycle  Collaborate with data analysts and managers to devise creative solutions to technical issues they face in their businesses  Develop systems and methods for acquiring content from external sources to support the Global Data and News businesses  Liaise with stakeholders to gather requirements, scope projects, and develop project plans  Troubleshoot technical issues relating to the automated systems we employ You need to have: 0-2 years previous work/internship experience in information technology, engineering, business management, data analysis or research  Demonstrated experience using one or more programming languages (e.g. Python, JavaScript, etc.)  Prior coursework or involvement within a field like Informatics, Mathematics, Economics or other applied sciences We'd also like to see: Project management and organizational skills  Proven ability to adapt to a fluid environment  Effective written and verbal communication skills  Strong aptitude for problem solving, plus the drive to think creatively You need to be able to: Start working full time in/after January 2018  Provide proof of graduation (Bachelors or advanced degree) prior to your start date  Legally work in the US without visa sponsorship  Does this sound like you?  Apply! If we think you're a good match, we'll get in touch with you soon about next steps."}