{"jobID": "2721330625", "jobLocation": "Austin_TX", "jobTitle": "Data Science Manager - Content", "companyRating": "3.8", "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": "67000", "jobDescription": "HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands. The Opportunity: As for engineering, we solve problems of scale and work on cutting edge and open-source technologies. Our culture is one that strives on solving difficult problems focusing on product engineering based on hypothesis testing to empower people to come up with ideas. Day-to-day duties:Act as player-coach for team overseen. This includes being a technical leader, with an expectation to contribute in a technical capacity as a Data Scientist. Other aspect of player-coach include: mentoring individual contributors, identifying and cultivating key talent and ensuring an efficient working environment (by, for example, removing blockers). In this particular role, leading Data Scientists focussing on the Content efforts are required. This Manager is expected to coordinate the teams work across disjoint projectsEnsure that the work being done by Team is connected to Expedia and HomeAway business driversEscalating any performance issues (positive or negative) to more senior managementMundane tasks such as approving time-cards, ensuring status communication, preparing outward communications, and one on one meetings with direct reportsEducational Requirements:To lead effectively, the Manager must have a sufficient education and work experience combination to be a data scientist. Typically, this is a Masters or PhD in a quantitative field, but can be relaxed with sufficient work experienceWork Experience:Several years (3+) of data science roles in a corporate environment. The data science roles ensure technical capability. The corporate environment provides connection to a corporations business, and evidence that the Manager knows how to manage and be managed.Needs Skills:Fundamental data science skills - mathematics, coding, machine learning, storytellingEvidence of Team Leadership, for example, providing leadership on and/or management for other teamsAbility to focus on multiple disjoint projects3+ years experience with Unstructured data preferably Natural Language Processing (NLP) and/or Image Processing/Computer Vision3+ years Python development experienceInterpersonal skills so that Team managed will respect decisionsBenefits & Perks:Competitive health and insurance benefitsCompetitive salaryAnnual target bonus or commissionPaid vacation and sick timeVacation rental on a yearly basis (taxable benefit)Employee Stock Purchase ProgramFree snacks and beveragesFrequent company update talks with our leadership teamFree listing on HomeAway.comElectronic, adjustable stand-up deskDiscounted Metro & Rail passCasual dress We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}