{"jobID": "2837707788", "jobLocation": "Kenilworth_NJ", "jobTitle": "Senior Scientist, Downstream, Biologics Process Development and Commercialization", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As part of the Merck Manufacturing Division, within Global Vaccines and Biologics Commercialization (GVBC), the Biologics Process Development and Commercialization (BPDC) department provides the technical process leadership and laboratory capabilities in support of late stage pipeline and commercial manufacturing processes for biologics (therapeutic proteins). For pipeline programs, BPDC supports various commercialization activities, including technology transfer to internal and external manufacturing sites, process validation, and authoring of regulatory submissions. For commercial programs, including but not limited to KEYTRUDA and ZINPLAVA, the scope includes site-to-site process transfers, manufacturing investigations and trend evaluations, process enhancements, next generation process (i.e., post approval) development and characterization, process validation, and regulatory submission authoring.  Under the general scientific and administrative direction of the Director in Downstream and working in conjunction with internal and external partners, this individual will support these late stage and commercial biologics program activities within BPDC. The individual will demonstrate scientific, experimental and tech transfer skills focusing on downstream processing.  Technical Scope (For R3 Downstream.. for other levels, small refinements to be made)  Participates in teams focusing on late stage clinical process development, characterization, and technology transfer and validation with line-of-sight for licensure and commercialization.  Responsible for laboratory-scale and manufacturing scale studies to support commercial process validation, characterization, and investigation evaluations, including studies performed either in-house or externally. Provides technical leadership for the design of experiments, data analysis and interpretation, as well as the execution of (internal) or management of (external) laboratory activities.  Provides technical leadership in the interpretations of trends observed in commercial process monitoring (e.g., statistical process control (SPC) and/or multivariate analyses (MVA)), and for further technical investigations and process changes that seek to drive improvements to yield and/or robustness  Primary focus will be on downstream processing, but with a working knowledge of the various aspects of product manufacture and functional area interdependencies, including cell culture, analytical, and site readiness.  Actively interacts with internal and external counterparts. May represent functional area on cross-functional and cross-divisional teams.  Authors required regulatory and technical documentation. Ensures that process/product are developed and documented according to standard Merck practices. Qualifications Education Minimum Requirement:  BS or MS in Biological Sciences/Chemical Engineering/Biological Engineering/Chemistry with 6 years (for BS) or 4 years (for MS) relevant experience. PhD candidates with 0+ year(s) of relevant experience will also be considered. Required Experience and Skills: Technical background in purification of biological molecules, including laboratory models for chromatography and filtration systems.  Experience with technology transfer and scale-up of processes to pilot and manufacturing scales for biologics manufacture.  Excellent oral and written communication skills. Ability to effectively articulate understanding of process science, in order to drive decision making, impact assessments, design of studies, etc, in a multi-disciplinary team environment. Preferred Experience and Skills: Experience with downstream purification of biological molecules required, with an in-depth knowledge of preparative chromatography, tangential flow filtration, and virus retaining filtration desired. Demonstrated understanding of the fundamentals and/or modeling of unit operations is a plus.  Technical operations experience in the manufacture of biological molecules at the pilot- and/or commercial-scale is a plus.  Prior experience in late stage process development, process characterization including viral clearance studies, process performance qualification and validation, site readiness, batch record reviews, authoring regulatory BLA sections and/or working with external contract organization for development and or manufacturing.  Working knowledge of statistical methods for DOE design and data analysis (e.g., JMP or Design Expert software)  Working knowledge of statistical process control (SPC), multivariate analysis (MVA), and/or process analytical technologies (PAT) techniques for biologics processes  Working understanding of analytical methods to characterize biologics and /or US/EU regulatory requirements and / or working knowledge of cGMPs is a plus"}