{"jobID": "2712338441", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Watson Health Data Engineering & Management Sr Director", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "168000", "jobDescription": "Job Description The newly formed IBM Watson Health business unit is now looking for talented individuals destined to usher in the next era of healthcare. We live in a moment of remarkable change and opportunity. The convergence of data and technology is transforming healthcare and life sciences organizations in every way. New roles are being created that never existed before to meet the demands of this transformation. Job Description: The divisions Data Engineering & Management Leader is tasked with ownership and management of the data engineering service. This function will ensure enterprise wide adherence to the data lifecycle and the data strategy. Additionally the leader will be provided collaboration with business teams to fulfill comprehensive data validation, data migration and data testing needs. Essential Responsibilities:Lead the Data Engineering & Management organization and lead the team in realizing vision of data managed as an asset.Oversee and champion adherence to the data lifecycle and serve as the connection and facilitation between business data and the technology organizations implementing the data lifecycle process, data quality, and data lineage and data engineering and management best practicesImplement all shared services data projects, delivering data requirements, data quality, data mapping and transformation, data migration and reconciliation and testing scenariosOversee the collection, storage, maintenance and distribution of all shared services data and data solutions.Conduct assessments of the shared services environments, champion continuous improvement initiatives and drive innovation.In collaboration with key stakeholders, create and maintain shared data strategyContribute to the data acquisition playbook. Ensure business operational execution of daily responsibilities for the following functional areas: • Data warehousing • Reference data Management • Customer Data Integration • Data migration and reconciliation Required Technical and Professional Expertise A minimum of 15 years information technology experience with significant people management responsibilitiesA track record of success in implementation of large cross organization technology data projects and data migration projects including MDM and data warehousing. Experience with managing a team with both operational and project responsibilities and with data warehousing and business intelligence.Experience in modern data technologies and data architecture.Big data ecosystem experience Preferred Tech and Prof Experience Experience in enterprise data architectureSecure Cloud architectureExperience in data analytics in a healthcare environmentKnowledge of Six Sigma, process improvement, and decision support toolsExperience managing vendor relationships and vendor resources EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}