{"jobID": "2827327886", "jobLocation": "Princeton_NJ", "jobTitle": "Center for Observational Research & Data Scientist- Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " The Center for Observational Research & Data Scientist (CORDS) - Manager is an individual contributor responsible for performing non-interventional research projects in support of key customer groups including HEOR, PV&E;, local HEOR teams, Medical and others. Project work includes identification of appropriate data sources, execution of protocol-related programming, analysis and summary of data and collaboration with customer on presentation of results. In addition, this role serves as a knowledge resource for the data development team and works with the CORDS Lead to coordinate therapeutic area support and communication. RESPONSIBILITIES OF POSITION:Conduct thorough and careful analysis of data, to effectively produce required information. Includes assisting with identification of appropriate data sources for the research objectives, acquiring and storing the data for the project, programming the appropriate statistical analyses using BMS standard tools, delivering results to customers in appropriate formats and media, and assisting with follow-up questions.Collaborate with the data development team to identify and deliver appropriate data resources for research strategies.Actively engage with protocol authors and researchers to identify issues and influence resolutions.Communicate the results of any analyses conducted effectively orally and in writing.Manage complex work environment, balancing demands from multiple customers to execute projects.Make sound scientific decisions based on a balance of data, analysis and experience.QUALIFICATIONS:EDUCATION: Master's of Science, in a quantitative discipline such as biostatistics, epidemiology or a related field.YEARS OF EXPERIENCE: Minimum 3 years of real work data; preferred: Pharmaceutical and/or Epidemiology/ Outcomes Research experienceLIST MAJOR SKILLS:Demonstrated abilities to analyze observational data for pharmaco-epidemiology, outcomes research, and market research.Ability to use appropriate statistical methods common in outcomes research and epidemiology.Proficient in SAS programming (3 years experience) to execute these studies.Manage research projects.Ability to effectively communicate a study's objectives, methods and findings."}