{"jobID": "2827854122", "jobLocation": "Bridgewater_NJ", "jobTitle": "R&D; Scientist I / II", "companyRating": null, "companyInfo": {"Website": "www.careerslb.com", "Headquarters": "Baabda, Lebanon", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Located in Bridgewater, New Jersey, Kashiv Pharma is an emerging pharmaceutical research and drug delivery company focused on developing innovative technology platforms and novel drugs with clinical differentiation and a compelling value proposition for patients, physicians, and payers. We have developed a portfolio of proprietary drug delivery technologies to improve the efficacy, safety, compliance, and dosage of low bioavailability drugs where absorption could be limited due to solubility, permeability, and stability problems. Our approach is to understand market needs and develop innovative medicines to improve health outcomes. The pipeline consists of novel drug formulations for preventing drug abuse or misuse, and in improving treatments for severe debilitating diseases. We plan to commercialize our products through licensing, or partnering, or through the creation of our specialized internal commercialization infrastructure. Summary A Scientist will be a key technical resource responsible for independently developing methods, generating reliable and interpreting data, using analytical instrument that include HPLC, UPLC, GC, UV/Vis, Mass spectrometer, dissolution apparatus and particle analyzer. You will be expected to develop a close working relationship with Technical personnel at all levels within the organization to provide technical support needed in meeting R&D; milestones and goals.  This position is also responsible for designing experiments, writing method validation protocols, conducting method validation, and processing and interpreting the analytical data.  Key responsibilities of the position include, but are not limited to – Conduct routine and advanced analytical tests in accordance with SOPs and regulatory guidance.Write protocols, reports, methods, standard operation procedure, and submission documents.Provide analytical support for formulation and process development.Conduct instrument troubleshooting.Analyze organic or inorganic compounds to determine chemical or physical properties, composition, structure, relationships, or reactions, using chromatography, spectroscopy or spectrophotometry techniques.Prepare test solutions, compounds, or reagents for laboratory personnel to conduct tests.Evaluate laboratory safety procedures to ensure compliance with standards or to make improvements as needed.Study effects of various methods of processing, preserving, or packaging on compositions.Review laboratory notebooks, raw data and technical documentation (e.g. test method, validation protocol, or validation report) in support of regulatory filings.Conduct laboratory investigations and prepare investigation reports.Performs other functions as required or assignedComplies with all company policies and standardsPosition Requirements and QualificationsMinimum B.S. degree in Analytical Chemistry, Biophysical/biochemical sciences, pharmaceutical sciences or related with 2-4 years industry experience required; or M.Sc. or degree in Analytical Chemistry or related with 0 – 2 years experienceSpecialized Knowledge and SkillsPosses broad analytical chemistry knowledge in HPLC, GC, UV, FTIR and other related analytical technologiesGood understanding of USP methodologies, ICH Guidelines, cGMP and FDA regulations.Hands on experience in wet chemistry techniques.Good verbal and written communication skills.Attention to details and accurate record keeping. Ability to plan, schedule and work independentlySelf-motivation, adaptability, and a positive attitude.Working knowledge of applicable safety and standards guidelines, such as SOP, cGMP, GLP, DEA regulations and/or MSDS.Ability to work under pressure in a fast pace environment. and meet deadlinesWork Environment & Physical Demands General work environment and physical demands as required to successfully perform the essential functions of this job. Ability to work flexible hours as needed. Some travel may be involved."}