{"jobID": "2827289785", "jobLocation": "Hoboken_NJ", "jobTitle": "Business analyst - Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.outlinesys.com", "Headquarters": "Somerset, NJ", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Profile - Senior Business Analyst Data Analytics  The business analyst is responsible forgathering requirements, developing workflow and system specifications, and execution of tasks required to deliver IT solutions in support of applications. Responsibilities: Requirements gathering from the business users and well as developing system specifications for projects, enhancements and bug/issues.  Work directly with various levels of business users (executive, managers, and processing personnel) to document requirements, review specifications, obtain approval, support UAT and post Production role out.  Develop business and technical requirement documents as well as technical specifications.  Learn new databases and systems to produce specifications needed to create financial and analytical reporting requirements  Supporting quality assurance and user acceptance testing  Drive solutions via system modifications and/or workflow to implement new processes (automation, regulatory, etc).  Customer support and guidance.  Compiling detailed documentation for technical teams (architect, developers, QA, etc  Issue resolution/escalation including prioritization and tracking.  Working with developers to assure specifications are understood and followed. Developers included in house development as well as off the shelf software  Project Management duties.  Project management of issues through the entire System Development Life Cycle (SDLC)  Professional Qualifications  Strong experience in client facing roles with expert skills in requirements gathering with the ability to draw out requirements using a variety of methods to uncover needs that clients would not be able to articulate on their own  Ability to communicate technically complex IT concepts to business clients  Must have strong business acumen as well as technical solutions expertise  5 to 7 years experience in data analytic and business intelligence projects in transactional applications as well data reporting repository.  3 to 5 years managing the full SDLC with data visualization tools and techniques  Proven ability to work on multiple project simultaneously  5 to 7 years experience in the SDLC implementing new applications and major enhancements. These include underwriting, financial, statistical reporting and claims systems.  Strong SQL skills as well as data base concepts  Experience in data integration and data quality projects.  Ability to work with technical teams (developers, architects, QA, infrastructure), business partners and software vendors to document and implement system modifications on time and within budget.  Excellent understanding of how technology impacts the business  Excellent team player with a proven background of individual contribution.  Excellent interpersonal, documentation, communication, and presentation skills.  A minimum of 5 years experience in the insurance industry implement new applications and major system enhancements.  PreferredIndustry and Technical Skills  Strong SQL skills to query SQL databases.  Understanding of XML language  Hardware and networking as it relates to system design and implementation  A minimum of 5 years experience in the insurance industry implement new applications and major system enhancements.  In addition it would be an asset if your experience included:  Excellent knowledge of the P&C; business and familiarity with a broad spectrum of Insurance applications.  Proven experience in developing and managing Underwriting and Claims applications.  Thorough understanding of underwriting process included the policy lifecycle, coverages, rating, etc  1 to 2 years experience working on ceded reinsurance systems. Education and Training: Bachelor's degree in computer science, management information systems, or equivalent working experience in information technology  Insurance specific training or designation a plus Company Benefits: Equal opportunity employer  Offer competitive compensation  Comprehensive health coverage for employee and eligible dependents  Dental and vision coverage Location: Jersey City - NJ"}