{"jobID": "2701358283", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Lead Data Scientist", "companyRating": "5.0", "companyInfo": {"Website": "www.aavalar.com", "Headquarters": "Malvern, PA", "Size": "1 to 50 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Modis, Aerotek, Robert Half Technology"}, "estimatedSalary": "101000", "jobDescription": "Position Title:Lead Data ScientistWork Location:Downtown Phila areaWork environment: High rise office building Who does this position report to? ManagerWhy is this position open? GrowthResponsibilities: Prep and clean data for analysis. Develop approaches that answer high level questions. Review data sets to understand trends and support department strategies. Develop recommendations for safety and quality related issues. Mentor staff and business users with regards to data mining and analysis procedures and best practices.Required Skills:Bachelor’s degree8+ years of advanced analyticsExperience with statistical theory and machine learning techniquesExpert in R, RStudio, Shiny and SQLExperience using advanced techniques for handling big data with structured and unstructured dataExcellent oral and written communication skillsDesired Skills:HTML, D3.js, CSS)Linux Server-side app admin experienceSelling point of the job: great company that invests in its employees.Work Hours and Schedule: flexible hoursFIs there travel involved? Probably notDress code: business casualHow is compensation structured? SalaryAnnual BonusWhat other benefits are there? Choice of Medical PlansDomestic Partner BenefitsPrescription PlanDental/Vision InsuranceLong/Short Term Disability InsuranceProfit Sharing plus 401k with company matchPension PlanTuition reimbursementWho is involved in the interview process? Initial HR phone screen, then tech phone screen, then in-person with management (including CIO).Target Start Date:Aavalar Consulting is trusted partner that enables technology leaders to connect with and deploy in-demand, skilled IT professionals at client sites across the Mid-Atlantic region. Since 1999, Aavalar Consulting has built an award-winning reputation with over one hundred of the most innovative Fortune 500 and mid-market companies to deliver substantial value through a broad set of technology consulting and IT staffing services that include: IT Staff Augmentation, Interim Technology Executives, and IT Search and Recruitment. "}