{"jobID": "2784903244", "jobLocation": "San_Diego_CA", "jobTitle": "Deep Learning/Computer Vision Scientist", "companyRating": null, "companyInfo": {"Website": "www.humanlongevity.com", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Purpose of Job Human Longevity, Inc. is looking for an Deep Learning/Computer Vision Scientist to assist with developing image analysis and deep learning models using medical imaging data. In this position, this scientist will be part of a team working to create of first of kind methods that would improve the detection of cancer and prediction and prevention of other diseases including cardiovascular disease and dementia. Tasks and ResponsibilitiesThis scientist will contribute by creating algorithms for medical image analysis and risk models utilizing computer vision techniques and deep learning.Minimum Qualifications (Must have)5+ Years of software development experiencePh.D. in computer science, machine learning, or equivalentStrong proficiency with deep learning is requiredStrong proficiency with computer vision is requiredStrong proficiency with Python, C/C++Proficiency with object oriented programmingStrong proficiency with deep learning frameworks (tensorflow, caffe, pytorch, keras)Strong understanding of machine learning algorithms & principles, and numerical optimizationExperience working with medical imaging data (3D, multiparametric, multimodal data)Experience with image recognition, classification, and segmentationCoding experience from inception through implementationSolid understanding of good programming practices, architecture, design patterns and unit testingExcellent communication skills requiredKnown for passion and perseverance to pursue long-term goals through short-term high performanceMaintains a positive and respectful attitude while working collaboratively in a highly dynamic environmentEnergized by driving innovative solutions and adapting quickly to new dataPreferred QualificationsExperience with OpenCV is preferredExperience with cloud programming and architectures (AWS)Domain experience in Biotech and Healthcare is desirableExperience working with time series data, longitudinal data, recurrent networks is beneficialExperience in a start-up environmentExperience in a regulated environmentWorking ConditionsOpen office environmentDog-friendlyWork with multidisciplinary team including software developers and cliniciansAbout Human Longevity Inc. Human Longevity Inc. (HLI) is the genomics-based, technology-driven company creating the most comprehensive database of whole genome, phenotype and clinical data. HLI is developing and applying large scale computing and machine learning to make novel discoveries to revolutionize the practice of medicine. A privately held company headquartered in San Diego, CA, HLI was founded in 2013 by pioneers in the fields of genomics and stem cell therapy. HLI will be licensing access to its database and developing new diagnostics and therapeutics as part of their product offerings. For more information please visit, www.humanlongevity.com."}