{"jobID": "2756443648", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ringdna.com", "Headquarters": "Sherman Oaks, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "THE COMPANY: RINGDNA (www.ringdna.com)  Founded in 2011 by proven serial entrepreneur, Howard Brown - RingDNA is the leading enterprise sales acceleration and communication platform. Sales teams use RingDNA to increase productivity, engage in smarter sales conversations, gain predictive sales insight and provide leaders with real-time data to better develop successful reps faster than ever before.  The companys array of powerful products is consistently cited as the top solution for teams using Salesforce. Sales acceleration is expected to be a $38B category of enterprise software ($13B in 2014).RingDNA is positioned incredibly well with an experienced executive team, proven board, advisors and investors.Investors include leading private equity firms, Bryant Stibel ($100M fund) and angel investors from leading companies such as Salesforce, Dropbox, LegalZoom, and others.Named \"Hot 100\" best privately held software companies by JMP Securities and One of the Best Privately Owned Companies in Americaby Entrepreneurial magazine.Some clients include: Amazon, HP Enterprise, lyft, Twilio [NYSE: TWLO], NetApp.THE OPPORTUNITY: Data Scientist RingDNA is looking for a Data Scientist to compliment our Product, Engineering, Sales, and Marketing teams to deliver an analytical depth to our suite of product offerings. Our mission is to provide deep insights and learned behavior on top of our telephony products and the millions of calls and messages that power our customers critical infrastructure and business success. In this mission we value integrity, reliability, insights, and being a stewart of RingDNAs customers and internal business objectives. We strive to provide immediate value and ROI to our customers but also look to the future and stay ahead of market trends.  The ideal candidate will be a highly engaged data scientist with three to seven years of experience in an analytic role. You will be responsible for developing in-depth business analyses, machine learning and AI integrations, and providing ad hoc support to our leadership teams to drive strategic initiatives. An inquisitive mindset is required as you will execute and design advanced data modeling that translates to actionable intelligence. What you will need:Advanced SQL querying skillsIdentify, research and analyze data so that it can be accurately processed.Manipulate large data sets with efficiency and assist with acquisition and ETL of various data sets.Design, create, and run mission critical ad hoc reportsBack up decision-making on company initiatives with product utilization insights and user behaviorIsolate opportunities to implement data hygiene strategies and uncover opportunities to improve data qualityDevelopment of ML and AI models to integrate into our core advanced intelligence products.Manage the resolution of data issues.EDUCATION: BS in computer science or a quantitative field (Mathematics, Statistics, or Economics)EXPERIENCE: 3-4+ years experience working in the enterprise SaaS space preferably within a business intelligence or analytics modeling role.SQL experience or experience with relational database systems, previous experience with Amazon Redshift a plus.Outstanding written and verbal skills to present insights to customer and executive stakeholdersSelf starter with the ability manage multiple initiatives in parallel.Develop, lead and execute deep dive quantitative analyses and advanced modeling that translates data into actionable insightsProactive with a bias towards action and outcomes.Experience with R, SPSS or similar statistical software.WHY RINGDNA? RingDNA is a progressive startup that values academics, creativity and diversity. Regular interaction with company leaders maximizes education, mentoring and development. The company cares as much about life balance as it does creating great solutions. To maximize wellness, RingDNA provides generous health and dental plans to our team. Outstanding medical benefits package including individual, family and dental insurance.Opportunity to work with a veteran team of leaders and developers working at the forefront of enterprise software technology."}