{"jobID": "2830113911", "jobLocation": "Sterling_Heights_MI", "jobTitle": "Communications Specialist", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalmichigan.com", "Headquarters": "Troy, MI", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "35000", "jobDescription": "Capital is currently looking for Entry Level Communications Specialists for a new exciting promotional and events sales campaign.If you've recently graduated, and you're looking to get your foot onto your career ladder, looking for progression, as well as personal business development and looking for an exciting career then we encourage you to apply. No experience is necessary as we provide FULL product training, guidance, and mentoring throughout.Graduate Communications Specialists would be:Identifying and delivering customers needsManaging and developing campaignsBuilding strong relationships with existing clients, new clients and customersSetting and meeting individual goalsDelivering and engaging informative information to customers and clientsCapital is a fast paced growing industry leader and we believe in investing in great people who can provide a great service will result in great results. Full product training and guidance throughoutProgression within the businessTravel opportunitiesGreat IncentivesFun, enjoyable environmentCapital engages clients and customers on a small, medium, or large scale and drive sales forward. If you're looking to grow and develop your business skills in a fun, energetic, high energy then you'll be pleased to know Capital has fantastic plans for future growth, not only in the USA but throughout North America with 100% promotion from within policy. Top performers will have the opportunity to travel to events outside of the greater Detroit area.If you’re excited about a new challenge and really want to kick start your business career then apply today by simply clicking on the apply button, a member of our administration team will contact all successful candidates within the next 24 – 48 hours. Please ensure all contact details are provided correctly on your resume. Successful applicants will be invited for an initial face-to-face sit down with a member of our management team"}