{"jobID": "2819531591", "jobLocation": "Chicago_IL", "jobTitle": "Junior Scientist/Engineer", "companyRating": null, "companyInfo": {"Website": "www.otie.com", "Headquarters": "Milwaukee, WI", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Oneida ESC Group is a family of companies owned by the Oneida Nation of Wisconsin that delivers customer-focused engineering, science, and construction services worldwide.  Our family of companies include: Oneida ESC Group (OESC), Oneida Total Integrated Enterprises (OTIE), Mission Support Services (MS2) and Sustainment&Restoration; Services (SRS). We integrate our staff for dedicated, cooperative, and business-like delivery of services to enhance our customers missions.  Sustainment&Restoration; Services (SRS) is an 8(a) firm that delivers environmental science and remediation services from initial investigations through removal and remedial actions, including the restoration of previously used sites for beneficial use.  SRS has an immediate opening for a Jr Scientist/Engineer in our Chicago, IL office. Job Duties:Conduct Environmental Site Assessments, Preliminary Assessments, Site Investigations, and Hazard Ranking System (HRS) site evaluationsSampling multi-media (soil, water, sediment) and air monitoring locationsPrepare work plans, sampling plans, and technical correspondencesProvide data management of site sampling resultsProvide client technical and administrative support during disaster response activitiesMinimum QualificationsBachelor degree in Science, Geology, Environmental Sciences, Environmental Engineering, or science related field1 - 4 years of experience in the environmental industryWillingness to travel up to 50% on average with extended overnight staysStrong organizational, technical writing and communication skillsProficiency in MS Office including Word and ExcelPositive attitude, good interpersonal skillsSelf-starter, flexible, team player, willing to work on a wide variety of tasks with minimum supervisionValid drivers license with an acceptable driving recordSolid credit history to obtain credit (card) for travel expenses which will be reimbursedDrug/Alcohol screening and a Background check is required Preferred Qualifications Completion of OSHA 40-hour HAZWOPER training preferred or to be completed within 1 year of hireExperience with field screening equipment or air-monitoring equipment NOTE: Applicants must be able to work in locations that feature rough terrain typical of construction sites and to enter and work within facilities that include limited accessibility, moving machinery, and other conditions typical of industrial facilities. Job assignments may involve work on hazardous waste sites and may require use of Personal Protective Equipment to evaluate or sample hazardous materials. Participation in a medical surveillance program is required and safety training will be provided before being assigned to work on these sites.  EOE- Minorities/Females/Disabled/Veterans  www.oescgroup.com"}