{"jobID": "2750361955", "jobLocation": "Union_Beach_NJ", "jobTitle": "Scientist, Flavor Delivery Systems", "companyRating": null, "companyInfo": {"Website": "www.iff.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 1889", "Type": " Company - Public (IFF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Givaudan, Firmenich, Symrise"}, "estimatedSalary": null, "jobDescription": " We are IFF. We are the catalyst for discoveries that spark the senses and transform the everyday. International Flavors & Fragrances Inc. is a leading innovator of sensorial experiences that move the world. At the heart of our company, we are fueled by a sense of discovery, constantly asking “what if?” That passion for exploration drives us to co-create unique scents and tastes in fine fragrances and beauty, detergents and household goods, as well as beloved foods and beverages.  Our 7,300 team members globally take advantage of leading consumer insights, research and development, creative expertise, and customer intimacy to develop differentiated products.  Dreamers and doers, we work tirelessly to discover flavors and fragrances that inspire customers and delight consumers. We are fueled by our four corporate values of passion, creativity, expertise and empowerment. It is the unique blend of these values that make us IFF. These qualities can be seen and felt throughout our amazing 129 year history and will continue to guide us as we explore our limitless possibilities and develop new-to-world solutions that enhance the lives of millions around the globe.  Please view our careers video at IFF Career Video- Great things are happening here  The History of IFF: The History of IFF  Follow us on social media: LinkedIn Facebook Job Summary Conduct laboratory and/or pilot research in the development and use of flavor delivery technologies that provide IFF with new opportunities for profitable growth.  Primary activities include execution of technical work under direct supervision of more senior technical staff, which includes: Preparation of samples or prototypes in a laboratory or pilot settingIncorporation of samples/prototypes into finished food/beverage/confection productsEvaluation of samples/prototypes as-is and in finished productsPreparation of samples/prototypes for product stability testingCompletion of basic analytical testing (i.e. water activity; droplet size measurements)Sample preparation for advanced analytical testingData organization and reporting of results in a timely This position is for an entry level scientist with basic skills and an interest in bench-level technical work. The individual will be required to develop a basic understanding of flavor delivery and encapsulation technologies needed to support group programs. Key ResponsibilityPlan, setup and execute experiments including preparing samples for sensory, analytical and stability evaluations (60%)Organize data and accurately document experiments in eLN and elsewhere (20%)Follow safe laboratory practices and keep areas clean (10%)Participate in Department meetings and other R&D; facility activities (10%) Required SkillsEssential BS in Food Science or related field  Experience working in a laboratory setting  Strong organizational, record keeping & time management skills  Proficiency in Microsoft Office (i.e. Word, Excel)  Good communication & interpersonal skills Preferred Experience in a food, flavor or related laboratory setting  Familiarity with analytical and/or sensory methodologiesRequired Experience  Job Location  Union Beach, US-NJ "}