{"jobID": "2688798194", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist – Innovation Team", "companyRating": "2.8", "companyInfo": {"Website": "www.hidglobal.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Ingersoll Rand, Identity Group"}, "estimatedSalary": "110000", "jobDescription": " HID Global powers the trusted identities of the world’s people, places and things. We make it possible for people to transact safely, work productively and travel freely. Our trusted identity solutions give people secure and convenient access to physical and digital places and connect things that can be accurately identified, verified and tracked digitally. Millions of people around the world use HID products and services to navigate their everyday lives, and over 2 billion things are connected through HID technology. We work with governments, educational institutions, hospitals, financial institutions, industrial businesses and some of the most innovative companies on the planet. Headquartered in Austin, Texas, HID Global has over 3,000 employees worldwide and operates international offices that support more than 100 countries. HID Global® is an ASSA ABLOY Group brand. For more information, visit www.hidglobal.com.  HID Global PACS Innovation, the Physical Access Control applied-research group of HID Global, is looking for a Research Scientist to drive our efforts to develop neural networks and artificial intelligence capabilities for our next-generation product platforms that will provide breakthrough user experiences. Duties and Responsibilities include the following. Other duties may be assigned. The PACS Innovation applied-research group is responsible for absorbing and transposing research and the latest technologies within demonstrable advanced proof-of-concepts that will be the basis for next generation products. Challenges such as understanding person intent in unconstrained environment, anomaly detection, indoor localization, smart-city connectivity, smart-building optimization, and continuous contextual-and-temporal authentication are some of the topics on our todo list.  While being a part of, and benefiting from, a larger organization, the HID Global PACS Innovation group is assuming a startup execution environment, comprised of experts in at-scale backend/frontend, hardware/software embedded systems, virtual machines, security and advanced cryptography, mobile development, and radio communication.  The successful candidate will be a key individual contributor, recognized as our neural network lead scientist. He/She will perform hands-on research, conceive and develop neural networks that can run on edge or embedded devices, simulating and optimizing the operation of these networks, and targeting emulation and silicon platforms to implement them. To that extent, he/she will also be very familiar with a wide range of domains, from algorithms development, system software to hardware components (sensing, monitoring, displays, audio, coms). Required Knowledge / Experience:Required Skills:Capable of framing appropriate questions to design the corresponding neural networks to answer them.Proven deep neural network knowledge and expertise, along with practical implementation experience (data gathering-prep/setup/train/optimize/run).Knowledge of computer vision, preferably related to face/person/object detection & recognition or re-id, and use of framework such as OpenCV or Dlib.Familiar with usual neural network development tools (for eg: Tensorflow, Torch, deepmat, Caffe, cudamat, cuDNN, Matlab, etc..) and various architectures (Inception, RestNet, SqueezeNet, …).Must be capable of defining runtime (post-training) embedded-system transposition (CPU/GPU, RAM, FPGA).Sufficient knowledge in high-level languages such as C/C++, Python, Java or C#.Sufficient math and physic abilities to understand, evaluate and apply scientific publications (in ml, dnn & cv domains).Nice to have:Familiarity with Linux, embedded Linux, and/or realtime Linux is a plus.Familiarity with nVidia GPUs, CUDA, ARM microprocessors and memory architectures is a plus.Familiarity with IoT systems principles, from backend, to edge, to sensors is a plus.Familiarity with Stereoscopy, Infrared, Multi-spectral sensing, AoA, ToF, Optics is a plus.Familiarity with Augmented Reality development (Hololens for eg) is a plus.Familiarity with various biometrics sensors and environment (FP, Face, Iris, Gait, Palm, ...) is a plus.Other Requirements:Has contributed to publications related to neural networks and/or computer vision.Has significantly contributed to publicly accessible source code.Must be fluent in both spoken and written English.Qualifications:PhD, MS degree in machine learning, or equivalent, with 5+ years of experience in applied-research and/or domain related product development.In absence of academic diploma, we will consider candidates that can demonstrate the required skills. Location:Austin (Texas, USA) is preferred, but we will consider remote from anywhere in the world for the appropriate candidate. HID Global is an Equal Opportunity Employer/Minorities/Female/Disabled/Veteran  If you have a disability which limits your ability to apply online, please contact us at lcampilongo@hidglobal.com to submit your expression of interest in a position with our Company"}