{"jobID": "2695590408", "jobLocation": "Washington_DC", "jobTitle": "Behavioral Scientist (Seoul, Korea)", "companyRating": null, "companyInfo": {"Website": "www.celestar.com", "Headquarters": "Athens, Greece", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Celestar Corporation is looking to identify a Behavioral Scientist. Please review the position description below. If interested and qualified, we welcome you to apply for this challenging opportunity.CLEARANCE REQUIREMENT: Active Top Secret Clearance; Clearance and Investigation must appear in JPAS and be within scope (5 – Years) -- TS/SCI Highly DesiredPLACE OF PERFORMANCE: Seoul, South Korea IMPORTANT INFORMATIONThis position has been filled. However, if you’re interested in being placed on a Hot Fill-Standby to Hire List, we encourage you to apply. If an opening is determined, we will visit our candidate list and call qualified candidates in order of application date. If you’re available when the vacancy surfaces…this could prove to be a Win-Win! NOTE: It can be expected that a Hot Fill would require the select candidate to start in 2 to 4 Weeks once accepted and approved via the interview process. RESPONSIBILITIESProvide services to program supporting U.S. Forces-Korea in South Korea. Duties and responsibilities include the following:Use social science techniques in an innovative fashion to deal with significant information gaps that are routinely encountered in the course of socio-cultural or pol-mil research and analysisDevelop new approaches and methodologies to deal with research problems that cannot be resolved by the usual meansEmploy knowledge of information collection requirements management processes and proceduresApply knowledge of a wide range of research and collection methods and the analytical ability to develop innovative productsParticipate in the processes of collaboration with the team that aids the commander and staff by providing authoritative advice and insight into first, second, and third order effects of CS decisions, providing situational awareness and developing mitigation strategies; ability to keep abreast of current events and cultural issues, regional trends and developments as they affect the military objectives and mutual concerns of the United States and host nationIdentity information requirements, the most effective way to integrate them into CS plans, and the most effective products to communicate research findings and recommendations;Create the engagements baseline assessment during the research planning and design processMaintain the Spheres of Influence component of the Common Operating Picture (COP)Collect, process, and store team research products, classified and unclassified, published and unpublished, in order to prepare analyses, estimates, and plans Compile, categorize, label, and store team research products appropriately to enable easy storage in the Key Leader Engagement data bases and timely retrieval of information from data basesApply analytical skills to research, identify key influencers, track spheres of influence, investigate backgrounds, define problems, develop solution sets, evaluative criteria, recommend best solution, and assist with implementation of the CSProvide CS- specific socio-cultural training as requestedDesign and supervise the conduct public opinion surveys, focus groups, and other research tools to identify measure of performance and measures of effectiveness of Command engagements, messages, and activities, and make recommended adjustments to the communication strategy based on research resultsREQUIREMENTSMust have a PHD in a Research Focused Behavioral Science Field with at least Five (5) Years of appropriate experience - RequiredMinimum DoD Top Secret Clearance - RequiredKorean Language Capabilities and Regional Experience – Highly DesiredExperience with social media data as well as text analysisExperience using rigorous quantitative and qualitative methods to deal with unprecedented problems and situationsExperience with identifying, collecting, organizing, and maintaining specified and implied socio-cultural or pol-mil dataExperience sifting through large sets of coded data to extract key takeaways and making actionable recommendationsExperience with pulling structured data from APIs, and both commercial and open source datasets and munging the data as needed; experience reading, writing, creating, and explaining complex statistical models, including the experience coding in any of a number of common statistical programming languages, including R, Python, STATA, SPSS, or SASExperience in collecting and aggregating information to identify trends and gaps in the data available during the planning phase of research executionExperience in analyzing incomplete and conflicting information to produce research products that assess pol-mil environments, anticipate trends, and forecast likely results of US and partner nation actionsExperience in producing documents, products, and briefings for the Command as required and present them to senior leaders and other audiencesExperience in reviewing products for accuracy, relevance, timeliness, soundness of analysis and adherence to both commander’s intent and the broad guidelines of national policyExperience in developing and implementing the team’s research and reporting process, in compliance with established regulations and guidance to enable trend analysis and knowledge transferIMPORTANT NOTE: This is a Best Athlete Selection Process! Please ensure that the required and/or desired experience is reflected on your resume to receive fair and competitive consideration. Come onboard with a company that Values its Employees! Celestar, a Veteran Owned Company, is Very Competitive with Salaries and Benefits. As an example, we offer Company Paid Benefits that include Employee and Family Dental Insurance, Employee Health Insurance, Life Insurance and Short Term Disability Insurance. We also offer a 401k retirement company match, paid Holidays and Personal Time Off!__ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ __ Minimum physical demands for on task positions: Employee needs to be able to sit at a workstation for extended periods; use hand(s) to handle or feel objects, tools, or controls; reach with hands and arms; talk and hear. Most positions require ability to work on desktop or laptop computer for extended periods of time reading, reviewing/analyzing information, and providing recommendations, summaries and/or reports in written format. Must be able to effectively communicate with others verbally and in writing. Employee may be required to occasionally lift and/or move moderate amounts of weight, typically less than 20 pounds. Regular and predictable attendance is essential. Team Members on Task (CONUS only, minimal or no job-related travel):Work Environment: The noise level in the work environment is usually moderate.Office Type Environment with Temperature Control. May be exposed to chemicals related to office equipment. The noise level in the work environment is usually moderate. General office environment.Team Members on task (CONUS and OCONUS assignments, some travel):Specific vision abilities required by the job may include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.Team Members deployed to a combat zone must be physically able to live in austere conditions during off duty time that may include extremes in temperature, noise, and must not have any medical conditions that require access to uninterrupted power sources.Team Members deployed to a combat zone will be subject to hazardous conditions which may require them to wear a kevlar helmet, individual body armor and/or wear a gas mask for extended periods of time. PAY TRANSPARENCY POLICY STATEMENT The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information.  Celestar is an Equal Employment Opportunity Affirmative Action Employer that is committed to providing equal opportunity for all applicants or employees on the basis of their race, color, sex, sexual orientation, gender identity, national origin, age, religion, veteran status, disability, or any other characteristic protected by law.  If you should have difficulty accessing our online application, please call us during normal working hours for immediate assistance @ (813)-627-9069"}