{"jobID": "2831870081", "jobLocation": "Arlington_VA", "jobTitle": "Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.aptima.com", "Headquarters": "Woburn, MA", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Aptima, Inc. is the market leader in optimizing human performance within complex, mission-critical systems. The company currently has an opening in our Learning and Training Systems (LTS) Division. Aptima is looking for individuals interested in working on and managing a variety of projects related to instructional strategy development, training needs analysis, lifelong learning, individual and team performance assessment, and training system development and evaluation. Minimum Requirements:US CitizenshipMinimum of a Masters in Human Factors Psychology, Educational Psychology, Industrial/Organizational Psychology, Applied Psychology, Cognitive Science, or related fieldMinimum of 3 years of relevant work experienceExperience managing projects, to include customer interfacing, planning and tracking taskingExperience leading knowledge elicitation sessions with subject matter expertsExcellent written and verbal communication skillsWillingness to travel up to 25% The ideal candidate also will have knowledge and experience in at least three of the following: Defining measures for assessment for learning and performanceDomain analysis techniques such as task analysis, training needs analysis, training evaluation, system requirements analysis, etc.Experimental design and statistical data analysis, and associated statistical software packagesTeam and/or leader developmentLearning and development theoryDesired but not required:History of leading winning proposalsExperience developing/delivering military trainingExperience conducting research and collecting data within the military domainExperience working in situations that are outside applicant's immediate area of expertiseExperience working with individuals from other disciplines to create and deliver innovative solutions and technology All applicants selected will be subject to a background investigation and must meet eligibility requirements for access to classified information.  Aptima, Inc. participates in the US Government E-Verify Program. For more information, click on http://www.uscis.gov/e-verify. EOE MINORITIES/FEMALES/PROTECTED VETERANS/DISABLED"}