{"jobID": "1514379438", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.lexingtonmanagementsolutions.com", "Headquarters": "Lexington, KY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Responsible for revealing hidden relationships, patterns and potential areas for improvement. Collaborate with the client and other stakeholders to uncover this information using advanced statistical and computational capabilities across various domains and data sources. Identify critical information from existing data sources to analyze past results. Predict future Intelligence trends including the impact of evolving technologies, evolving client preferences and other changes. Set up processes to incorporate the information on an ongoing basis from strategic, tactical and operational levels. Create and present briefings to senior government officials. Work closely with the client to ensure metric requirements are met. Design, evaluate and implement database applications to accommodate a variety of user needs. Analyze and determine informational needs and elements, data relationships and attributes, proposed manipulation, data flow and storage requirements and data output and reporting capabilities. Define logical attributes and inter-relationships and design data structures to accommodate database production, storage, maintenance and accessibility. 5-8 years since undergraduate degree or 3-6 years since MBA.  Basic Qualifications: Excellent analytical writing and briefing skillsAbility to write business cases, recommendations, white papers, and proceduresProvide recommendations and findings to executive managementUnderstand the stakeholders and customer interest or productsIdentify significant underlying relationships between internal/external factors and critical variablesGather requirements for customized analytic and metric solutions using logistic and linear regression techniquesWork closely with other statisticians on finalizing all custom metric reporting outputCommunicate customized requirements to internal and external technical teamProvide statistical expertise to tackle business analytic problems and provide ad-hoc metric reporting solutions for internal and external clientsCollaborate with IC senior leadership and analytical team members to produce metric reports of usage, DI product, customer interest, etc.Prior experience working for or interfacing with various technologies: analytical tools, data mining or database2+ years business experience developing metric gathering solutionsAdvanced skills with Microsoft Excel and AccessExperience in working with relational databases, including Oracle or SQLTS/SCI Clearance and CI Polygraph are required  Additional Qualifications:Bachelors Degree in Business Management/Statistics/Economics/Computer Science or equivalent work experienceStrong oral and written communication skills including the ability to communicate complex information to various target audiencesProficient in Microsoft Word and PowerPointExperience with SharePoint"}