{"jobID": "2786112170", "jobLocation": "Irving_TX", "jobTitle": "IBM Netezza Data Analyst w SSAS", "companyRating": null, "companyInfo": {"Website": "www.connectionsitservices.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " TEKsystems, Robert Half"}, "estimatedSalary": null, "jobDescription": " Connections IT Services is now hiring a Data Analyst with extensive experience leveraging SSAS and IBM Netezza. The Data Analyst is responsible for leveraging and transforming ETL and Data extraction tools. This will be a dynamic role where you will be an integral member of a small team building an end-to-end business intelligence solution. This person should be very analytical with an even mix of business acumen and technical capability and experiences with SSAS and IBM Netezza tools. Position ID: CITS0579 Location: Irving, TX Term: FTE/CTH Title: Data Analyst IBM Netezza - SSAS No VendorsSponsorship is not availableTo stand out as a candidate for this role you have the following skillsets:SQL, SSAS, PowerPivot, IBM Netezza, SharePoint, DAX, Data warehouse experience (IBM Netezza – Pure Data for Analytics)Description The ideal candidate will have an innate curiosity and some analytical capability with a passion for learning. An understanding of ETL and Datawarehouse tools, data table manipulation and extraction are required. Experience in designing, developing and maintaining Datawarehouse and ETL tools and solutions is required. Financial and Lending industry experience are a plus Role and ResponsibilityThe Data Analyst will be responsible for working with analysts, managers, and executives to understand and document business needs and working with other IT groups and the data warehouse team to understand the data sources.This will be a collaborative role that will be responsible for designing, building and deploying IBM Netezza data warehouse appliances, advanced analytics applications, predictive analytics and business continuity planning.This person should be able to work independently and have a drive for excellence.Should be able to develop and execute database queries and conduct analysis. This person must be able to communicate well verbally and written and must exercise the importance of documentation.This person should be at near expert level with SQL and be familiar with concepts like common table expressions, RANK, CASE, sub-queries, etc.Candidates should have extensive knowledge and expertise with SSAS. Must be familiar with pulling data out of data warehouse Dim/Fact tables as well as unstructured data and 3rd party data and marrying them together to get an overall view of the business.A couple of years of SSRS experience is necessary with detailed understanding of expressions, data driven subscriptions, drill-down, drill-through, sub-reports, parameters, and report objects like tables, matrix, charts, maps, etc.…Familiarity and some experience with PowerPivot are needed including creating data visualizations to support business monitoring, complex DAX expressions, and performance tuning PowerPivot and Tabular data models. Some experience with Qlik Sense, Power View, Essbase, SAS and visual analytics tools are nice to haves.Experience migrating from SSAS to IBM Netezza is highly desired, but an individual with expertise in both is acceptable.Required Skills4+ SQL4+ SSAS (experience with other vendor tools will be considered)2+ Data warehouse experience (IBM Netezza – Pure Data for Analytics)4+ years with ETL, Datawarehouse, and Data extraction tools required"}