{"jobID": "2835772169", "jobLocation": "Santa_Clara_CA", "jobTitle": "iOS/OSX Data Analysis DevOps Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "120000", "jobDescription": "iOS/OSX Data Analysis DevOps Engineer Job Number: 113249254Santa Clara Valley, California, United StatesPosted: May. 17, 2018Weekly Hours: 40.00 Job SummaryThe Software Engineering Data Analysis team uses petabytes of data to improve the user experience. Through data, we drive strategic software direction, resolve issues, and make our phenomenal devices even better. We provide these answers with the latest distributed systems and technology along with some of the largest data volume in the world. Engineering these systems takes a different mindset of scale and volume. Do you love building and engineering data systems at this scale? If so, we’d like to talk to you!Key Qualifications  Strong development skills in Python and ScalaProficiency in a Linux Production EnvironmentKnowledge of Hadoop and MapReduce conceptsExperience developing software on distributed systemsExcellent written and verbal communication skillsDeep understanding of software development processes DescriptionWe develop large scale systems that extract and process data to provide insights to teams across Software Engineering and Apple. You will work with Data Scientists to implement algorithms to find answers to complex questions. Your systems will be designed to scale and be reliable in a production environment. Using your software engineering skills, you will follow standard methodologies to ensure that your code is correct, and well tested.EducationBS in Computer Science or equivalent experienceAdditional Requirements- Experience working with Hadoop SQL database design/query concepts Mastery of key algorithms and tools for developing high efficiency data processing and ETL systemsProven software engineering experience (design, test, and source code management) Experience with some of the following technologies is a plus: Hadoop, Hbase, Kafka, Flume, Impala, Pig, MySQL, Capistrano, Samza, Anisble, Spark, Jenkins, ZooKeeper"}