{"jobID": "2728737906", "jobLocation": "Santa_Clara_CA", "jobTitle": "PPD - Senior/Staff/Principal Scientist (Natural Language Generation)", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description Natural Language Generation ScientistLocation: Santa Clara, CA Job Type: Full-time Department: PPD Responsibilities: Research, design, develop and support new data-driven, personalized e-commerce and marketing products. We are seeking a Senior/Principal Research Scientist who will join our team in the field of Natural Language Generation, and work together to break new ground in the world of understanding and classifying different forms of content, and creating interactive experiences to help users find the content they are in favor of. Qualifications: Advanced degree in Computer Science, Computational Linguistics or related field, Ph.D degree preferred Solid theoretical background with machine learning and intensive application experience. Relevant professional experience in state-of-the-art Natural Language Generation and Deep Learning with one or more of the following subjects: language modeling, information retrieval, dependency parsing, text classification, word embedding, question answering, knowledge extraction, knowledge base management. Proficient in one or more programming languages: Python, C++, Java or equivalent. Comfortable working in a fast paced environment, and a can-do attitude.About JD-PPD Platform Product Development is responsible for the development of platform for all JD's online retail business - the core business of JD.COM, and smart device business. The Silicon Valley R&D; division is established to aim for the next generation of online retail platform using the most advanced Artificial Intelligence, Virtual Reality, Augmented Reality techniques to achieved JD's intelligence business goal. User experience of online shopping will not be limited to a few pictures or short video clips tomorrow. 3D information, in virtual or augmented reality, with AI powered cloud system and fully-connected smart devices, the future platform will be a personalized, highly tailored content based intelligent online retail platform. With Millions of daily users from JD.COM, your work will have direct impact on people's everyday life."}