{"jobID": "2805415346", "jobLocation": "Sacramento_CA", "jobTitle": "Senior Staff Clinical Research Scientist", "companyRating": "2.5", "companyInfo": {"Website": "www.leicabiosystems.com", "Headquarters": "Buffalo Grove, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": " Reporting to the Head of Clinical Affairs at Beckman Coulter, the Sr. Staff Clinical Research Scientist understands business needs and follows established operating company policies/procedures and Good Clinical Practice global standards in the strategic design and oversight of assigned clinical study programs.  Responsibilities:  Leads the development and execution of the clinical evidence portfolio for multiple programs in clinical microbiology, ensuring that both global market needs and regulatory requirements are designed into the plan for clinical trial investments (pre-market and post-market).  Represents the Sponsor in clinical study planning, trial design, trial execution and trial closeout. Examples of work deliverables include clinical evidence strategy, clinical protocol, data management plan, monitoring plan and clinical report. Collaborates with other functions (biostatistics, data management, regulatory, quality, R&D;, etc) and external partners (investigators, subject matter experts, Contract Research Organizations) on product development process deliverables.  Operational activities supporting these clinical responsibilities require strong cross-functional collaboration. Deliverables include: Study site qualification, site selection, site initiation, clinical study monitoring, evaluate clinical results, report generation and clinical evidence publication of trial results in peer-reviewed journals.  Represents the Clinical Affairs department on multi-functional core teams, and at FDA/regulatory bodies, to ensure program requirements are met and that clinical trials are executed in a compliant, scientifically appropriate manner.  Uses the Danaher Business System and standard work to systematically measure/report/improve the overall clinical study process and compliance.  Maintains current knowledge and ensures adherence to Good Clinical Practice (GCP) global standards and department standard operating procedures for conducting clinical studies.  Position Description:  Sr. Staff Clinical Studies Scientist is responsible to design, organize and conduct complex internal and external clinical studies for new & improved products including developing a comprehensive clinical plan and negotiating with regulators.  Responsible for:  Developing a comprehensive, global clinical evidence strategy including supporting clinical plans  Assists in negotiating trial strategy/design with FDA and other regulatory bodies[IT1]  Designing and writing clinical protocols  Designing CRFs and eCRFs  Identifying and contacting potential investigators  CRO management  Negotiating study budgets and financial payments  Ensuring adequacy of clinical research staff/facilities  Site selection  Monitoring clinical studies consistent with GCP  Analyzing the clinical data  Writing summary reports  Preparing technical articles for publication in professional journals and company literature  Collaborating across functions in representing the clinical function to address customer needs or new product development as a core team representative  The incumbent acquires technical information for customer support regarding product performance, competitive features and clinical requirements. The Sr Staff Clinical Studies Scientist participates on program teams for product definition and specification setting, developing the clinical strategy in support of regulatory submissions, and assisting development in the management of product development.  Qualifications  Bachelor’s degree with 9+ years’ experience, Master’s with 7+ years’ experience, or Doctoral degree with 4+ years  Experience designing, organizing and conducting simple and complex clinical trials for clinical diagnostics including microbiology, medical devices or pharmaceutical products in a regulated environment  Experience in statistical analysis and management of clinical data, writing summary reports and technical articles for publication in professional journals  Experience in IVD product development with clinical trial (preferred)  Experience in clinical microbiology, specifically antibiotic susceptibility/resistance testing (preferred)  Demonstrated experience in effectively negotiating with regulators (such as the U.S. Food and Drug Administration) and designing/executing clinical programs resulting in a successful global commercial release  Stays current with competitor products and approaches on how Microbiology products are used in global clinical practice  Must be detail-oriented; demonstrate excellent verbal/written communication skills and interpersonal skills.  Ability to apply the Danaher Business System to track/measure/report performance, solve problems and drive continuous process improvement. .  Able to travel (domestic and international) up to 50% of the time, depending on business need[IT2]  Education and Experience:  Bachelor of Science (B.S.) or Master of Science (M.S.) or Doctor of Philosophy (Ph.D.). in Microbiology, or a related field and a minimum of the following years of industry or relevant experience according to degree:  Bachelor’s Degree 10+ years, OR Master’s degree with 7+ years, OR Doctoral degree with 5+ years  Language Skills: Must be proficient in writing, and communicating in the English language. Mandarin Chinese highly desired.  Certifications, Licenses, Registrations: Experience in clinical microbiology, specifically antibiotic susceptibility/resistance testing (preferred)  Clinical research certification (such as CCRA, CCRC) preferred."}