{"jobID": "2766107532", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.glu.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Public (GLUU) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Zynga, KIXEYE, Kabam"}, "estimatedSalary": "85000", "jobDescription": "Role Overview: As a Data Analyst, you will be the analytical data partner for our game studios. You will work closely with Game Designers & Product Managers to transform subjective discussions about product into concise analytic questions that deliver actionable answers. You will take a leadership role in managing studio relationships, mentoring junior analysts & shaping the evolution of our analytics infrastructure. This is a high visibility role that will have a direct impact on the success of some of our biggest titles. What youll be doing:Working with game teams to measure and optimize performance of titles in beta and after worldwide launch.Using state of the art big data tools such as Hive, Presto and Redshift, to sift through billions of rows of data to answer challenging business questions.Helping design and analyze AB and multivariate experiments.Using Tableau to build dashboards that allow game teams to self-serve custom data for their titles.Collaborating with game team to define telemetry of titles.Continuously learning new technologies that advance analytic function at Glu.Youll be a great fit if you have:3+ years of experience as an analyst, data scientist, or related quantitative role.High proficiency with SQL, especially in distributed environments (Hive/Presto).Experience in UNIX and Python.An understanding of statistical analysis and familiarity with core statistical functions.Extra bonus points if you have:A passion for gaming.Experience with Hadoop, HP Vertica, and other big data technologies.Experience with modern programming languages (e.g. Python, JavaScript)Experience with statistical packages such as R or SAS.Predictive analytics or machine learning experience. If all of this sounds exciting to you, then we think you might be someone who would succeed here on the team! We would love for you to apply, so we can discuss your valuable skills and how we can benefit from each other!"}