{"jobID": "2827557766", "jobLocation": "Thousand_Oaks_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.amgen.com", "Headquarters": "Thousand Oaks, CA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (AMGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Genentech, AbbVie, Janssen Biotech"}, "estimatedSalary": "123000", "jobDescription": " Amgen is seeking a Senior Data Scientist to be based in our Thousand Oaks, CA global headquarters, who will report into the Director of Quality Data Science.  The Senior Data Scientist will lead strategic planning and development of data science, natural language processing machine learning, and artificial intelligence capabilities across Quality Data Science. Additionally, the Incumbent will lead cross functional teams on projects and/or programs with aims to systematically integrate data, derive insights, and automate processes.  The focus of Quality Data Science (QDS) is to advance the utilization of data, analytics, artificial intelligence and automation to unlock and leverage Amgen data. QDS aims to accomplish this by supplying solutions that efficiently provide insights and intelligence for the Quality and Operations functions. This includes ensuring data access, application of appropriate analysis methods to unlock information and meaningful visualization and interpretation of information. An untapped resource within quality is the preponderance of data stored as text, as such QDS has made text analytics a primary focus. Primary Responsibilities for the Senior Data Scientist includes:Partners across the entire value chain at Amgen so as to interact, learn from, and lead teams involved in Amgen processes across operationsSuccessfully executes projects allowing for demonstrated technical feasibility for advanced informatic capabilities, as well as ultimately derive substantial business value for AmgenProvides strategic, technical, and people leadership with both internal and external stakeholdersBasic Qualifications: Doctorate degree OR Masters degree and 2 years of applied data science and/or data science functional leadership experience  OR  Bachelors degree and 4 years of applied data science and/or data science functional leadership experience OR Associates degree and 10 years of applied data science and/or data science functional leadership experience OR High school diploma / GED and 12 years of applied data science and/or data science functional leadership experience Preferred Qualifications:2+ years of experience with variety of data analysis and modeling methods particularly in their application to biological systems with demonstrated mastery in the application of natural language processing (NLP)Proficient in SQL, Python, and RStrong statistics and programming background with proven experience delivering on data science and machine learning projects (experience with NLP is a big plus)Familiarity and background with biotechnology processes and regulatory requirementsFamiliarity with DevOps and good software practices (i.e. version control, continuous integration, test driven development)Strong communication skills and experience with client engagement: candidates will have outstanding experience engaging directly with clients (scientific/biological experience is preferred) in developing data science/machine learning or other software solutions Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.  Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.  #DS2018Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}