{"jobID": "2821476810", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Intelligence Analyst / Developer", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The Business Intelligence (BI) Technology Analyst, you will be a member of a highly-motivated Data Science team responsible for providing impactful data, analytical tools and insights to business users. You will work closely with business unit stakeholders and technology teams to turn data into critical information and insights that support business decisions. It is essential, and a success criterion, that you build an understanding of the business at a level of detail that enables you to identify and address critical issues and opportunities. Your role as BI Technology Analyst provides data that is accurate, congruent, contextualized and actionable, and ensures information is easily available to users for direct consumption or integration with other systems. Together with the team you will educate and train business stakeholders to visualize, explore and understand information in new ways, generating compelling insights and competitive advantage for our clients.  You will work with business stakeholders to determine business requirements, priorities and key performance indicators (KPIs). You will be accountable for providing leadership of independent initiatives, facilitating information gathering, analysis, documentation and presentation of findings to all levels of business stakeholders (Sales and Executives, and client management teams).  The position will report to the Director of Data Science. ResponsibilitiesAnalyze business requests to understand how data and visualization can be used to generate insightsIdentify third-party data sources that can be used as a source of insights, or complement existing dataPrepare data for ingestion into PowerBI from databases, APIs or other sourcesPerform exploratory data analysis to determine quality and identify errors/biases in the dataUse DAX to create custom measures for reporting and analyticsCreate dashboards and custom reports that combine data from multiple sources to provide unique insights.Provide support for user community.Train users to transform data into action-oriented information and to use that information correctly.Participate in workstream planning process including inception, technical design, development, testing and delivery of BI solutions.Participate in project management estimation process.Required CapabilitiesExperience working with data to solve business problems/generating actionable insights requiredMastery of BI platforms required PowerBI strongly preferred (Tableau or Qlik experience will be considered)Advanced Excel skills required (Pivot tables, macros PowerPivot preferred)Proven experience in DAX and SSAS Tabular model (OLAP)Experience with Data Extraction and Transformation using PowerBI s capabilitiesExperience with SQL and Relational Databases (RDBMS) requiredBachelor's degree in Computer Science, Information Systems, Business Management or specialized training/certificationMBA or advanced analytics degree preferred2+ years of Business Analysis or related technical experience. Consulting experience preferred2+ years experience in the entertainment industry preferredMust demonstrate strong business insight, impressive career development, and outstanding performance track recordExcellent written and oral communication skills are requiredprovided by Dice Microsoft Power BI, DAX, Microsoft SQL Server, Microsoft SSAS, Pivot table, Visualization, Dashboard"}