{"jobID": "2802360339", "jobLocation": "Chicago_IL", "jobTitle": "Cloud Big Data Developer - Master Sales Consultant", "companyRating": null, "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": null, "jobDescription": " Provides direction and specialist knowledge in applying the technology/application to client business. Facilitation of customer product/application understanding through presentations demonstrations and benchmarks; provision of support throughout the sell.  As a Master Principal Sales Consultant you will be responsible as the expert for formulating and leading presales technical / functional support activity to prospective clients and customers while ensuring customer satisfaction. Acts as a technical resource and mentor for less experienced Sales Consultants. Focuses on large or complex sales opportunities that need creative and complex solutions. Develops productivity tools and training for other Sales Consultants. Develops and delivers outstanding Oracle presentations and demonstrations. Leads any and all aspects of the technical sales process. Advises internal and external clients on overall architect solutions.  Acknowledged authority within the Corporation. Acts as a leader of large-scale company initiatives. Viewed by peers as a leader and top contributor and by line management as a key business partner. 3 years vendor (sales and marketing) experience. 7 years business experience with relevant computer applications or database/tools. Ability to implement the most advanced product features. Thorough knowledge of system and application design. In depth knowledge of competitors. Demonstrated project management skills. Demonstrated excellent verbal and written communication skills: needs analysis, positioning, business justification, closing techniques. Ability to persuade others through presentations, demonstrations, and written communication. Ability to travel as needed. BA/BS degree or equivalent, advanced degree highly desirable. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.*Cloud BIG DATA Platform Developer - Central Region- * 18000BQBPreferred Locations: * Missouri/Minnesota/Ohio/Indiana Other Locations: * Chicago/Texas/Wisconsin/Michigan/Kentucky/Tennessee/Las Vegas/Colorado  Preferred Qualifications  We are looking for hands-on Big Data Management engineer who has experience working with systems supporting Artificial Intelligence / Machine Learning at all levels for Technology and Solution Architecture. The position is located anywhere on the west coast.  Job Requirements: Cloud Platform Specialist/Big Data Ability to gather and understand query, analytic, and real-time data processing requirements and effectively recommend solutionsAbility to gather data integration and data ingestion requirements from a variety of structured, semi-structured, and streaming data sources and effectively recommend solutionsExperience with Cloud architectures and providers (AWS/GCP/Azure)Ability to communicate with many different audiences (lines of business and technical audiences) Members on the team focus on the following areas: Information architecture best practices and approachesSpecific knowledge of certain industries and drivers of potential projectsCommunication with team and customersSkills needed to develop and manage prototypes in labs or at customer site using customer specific data Detailed Description and Job Requirements  The successful candidate is a self-motivated big data developer / machine learning programmer / data scientist who can understand and develop machine learning / deep learning models. She/he lives and breathes big data management and understands the nuances of scaling. She/he needs to have software development experiences and has expertise one or more ML learning frameworks supported by Spark/SparkML/CUDA. The person should have expertise at least one of programming language Python, R or Scala/Java.  7 years business experience with relevant computer applications or tooling. Ability to implement the most advanced solution features. Thorough knowledge of system and application design. In depth knowledge of data management landscape. Demonstrated project management skills. Demonstrated excellent verbal and written communication skills.  For more information, contact: Anita Filip, Principal Talent Advisor - anita.filip@oracle.com *Job:** **Pre Sales**Organization:** **Oracle**Title:** *Cloud Big Data Developer - Master Sales Consultant - CENTRAL REGION**Location:** *United States**Requisition ID:** *18000BQB*"}