{"jobID": "2730192781", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst (Product Analytics)", "companyRating": "4.1", "companyInfo": {"Website": "www.match.com", "Headquarters": "Dallas, TX", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Public (MTCH ) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " We are looking for a Data Analyst to join our Product Analytics team! Whats the team like? Our teams mission is to use data to deliver long-term strategic insights. We also provide short-term guidance on A/B tests, user behavior etc. We leverage data to understand our users: what they need, what they do, how to retain them and ultimately how to help them find the best dates.  We also work to support business trends/forecasting, model the impact of new product ideas on Revenue/EDITDA and other metrics. Whats my day-to-day? You will help guide Matchs product decisions by crunching large data sets, analyzing, building models and driving key insights. Youll also work with other cross-functional teams like Finance, CRM, Engineering and Business Intelligence. Analyze and help design A/B tests for various site features to drive measurable improvementsProvide data and/or insights to internal customers on their specific needsResearch issues about customer behavior/changes by analyzing relevant metrics, trends etc.Assist with conducting member market research - design questionnaires, analyze data and provide meaningful insightsWhat skills is Match looking for?3+ years of SQL (T-SQL preferred)Exposure to applied statistics (descriptive statistics, statistical testing etc); Python/SPSS experience a plusAdvanced Excel knowledgeExcellent problem solving skillsBachelors or Masters degree in Mathematics, Computer Science, Engineering / related field, Marketing, or MBA with quantitative focusSelf-starter with good communications skillsExperience in consumer internet preferred*applicants will be required to complete a SQL and Data Analysis skills assessment testWhy Match? A lot of businesses say they change lives, but we actually do it. Weve helped millions of people find love and happiness. You can wear jeans every dayOur benefits and perks are pretty amazingDrinks and snacks are on us every single dayWe have happy hours monthly, so theres always something to celebrate"}