{"jobID": "2761627545", "jobLocation": "Chicago_IL", "jobTitle": "Investment Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.bamfunds.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " The Job Details are as follows: ROLE OVERVIEW Working within a global team of data analysts, data scientists, and content experts within each of BAM’s key geographic locations the Investment Data Analyst will serve as a steward for all of BAM’s internal and external data content providing actionable data to our L/S, macro, and quantitative investors and will be responsible for the following: Partnering with investors to respond to and address their data needs.Developing a keen understanding of how data is utilized in our investment processes to generate insights and ideas.Designing and implementing programmatic data accuracy, outlier detection, error correction and remediation processes.Evaluating new and differentiated data within the firm and helping strategically prioritize new data initiatives.Working closely with our Data Engineering teams and defining the on-boarding and production requirements for all new data.QUALIFICATIONS & REQUIREMENTS:A passion for data and experience in applying that passion to high quality data products.Strong understanding of time-series data, third party data vendors, and how they apply to quant and fundamental analysis. Prior experience with quantitative investors (either as a quant or vendor) is strongly preferred.Serve as an in-house expert on data, leveraging your knowledge of vendor and market data collection methodologies to build data, which investors can act on.Demonstrated track record of ownership, leadership, high achievement and raising the standard of those around you.Experience working in an agile environment and with development teams. We expect you and your data to be organized and pragmatic.Strong understanding of SQL and relational databases. Ability to perform data analysis and wrangle the data using Python or R is preferred. Familiarity with AWS a plus."}