{"jobID": "2771638560", "jobLocation": "Northbrook_IL", "jobTitle": "Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "jobs.cvshealth.com", "Headquarters": "Woonsocket, RI", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CVS) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Walmart, Walgreens, Express Scripts"}, "estimatedSalary": "95000", "jobDescription": " Job DescriptionAre you passionate about data AND helping patients improve their health? Consider the position of Data Scientist, where your experience in advanced analytics and modeling will directly inform how CVS Health helps patients on their path to better health. As a key member of the Enterprise Analytics Group, you will work with a variety of business partners from across the enterprise to both support the development of innovative programs to improve patient outcomes as well as reduce cost and improve efficiency across CVS Health The role of Data Scientist will primarily be responsible for developing machine learning and other advanced models that drive business outcomes across CVS. The Advanced Analytics team is an interdisciplinary team of Data Scientists that partners with business groups across CVS to ideate, develop, and deploy analytic models and solutions that leverage advanced machine learning and analytics methodologies. As a member of this group you will work with a highly collaborative team to apply state of the art analytic methods to solve real world problems. The successful Data Scientist will translate business needs into analytic questions; design and conduct rigorous analyses of clinical, financial, customer, and operational data; and translate these analytic findings into predictive models and evaluation results for our business partners. Key job functions include, but are not limited to, the following: Consulting with key internal and external stakeholders to determine how best to leverage predictive modeling and advanced analytic methods to support business objectives across CVS Health. Able to select several potential appropriate modeling approaches for a given analytic problem (regressions, time series analysis, neural networks, decision trees, ensemble models). Efficiently implement the models in a variety of modeling tools, achieving highly accurate models. Understands the underlying statistical concepts and computational approaches that enable efficient execution of models and may be able to design and implement modifications and enhancements to the computations.Developing sound analytic plans based on available data sources, business partner needs, and required timelines. Able to apply innovative approaches to understand and predict what will happen across the business. Managing deliverables across multiple projects in a deadline-driven environment and project related to a wide variety of business settings and clinical needs. Presenting analytic findings in a variety of formats (reports, PPT, graphs, figures and tables), formulating recommendations, and effectively presenting the results to non-analytic audiences. #analytictalent#DCERequired QualificationsTo be considered for this exciting opportunity on the Advanced Analytics team, candidates will need to have the following experience: A minimum of 5 years of professional post-graduate experience in constructing, validating, and executing predictive modeling solutions. Advanced skills and training in machine learning data mining and other quantitative research analytics such as: Non-Linear Regression Analysis, Multivariate Analysis, Bayesian Methods, Generalized Linear Models, Decision Trees and Random Forest, Non Parametric estimations, Neural Networks, Ensemble Models, etc. Experience in translating business problems across disciplines into advanced analytic projects with measurable business value. Experience with theoretical modeling approaches and matching analytic modeling approaches to a wide range of business applications. Analytics experience within the retail and/or healthcare industries, with experience deploying capabilities across a wide range of business disciplines. Demonstrated strong project management and time management skills. Strong background in statistical languages technologies such as R, Python, SAS, etc. Experience with computer development languages (Java, C++). Preferred QualificationsPhD in Economics, Statistics, Mathematics or directly related field. EducationMasters in in Economics, Statistics, Mathematics or directly related field. Business OverviewCVS Health, through our unmatched breadth of service offerings, is transforming the delivery of health care services in the U.S. We are an innovative, fast-growing company guided by values that focus on teamwork, integrity and respect for our colleagues and customers. What are we looking for in our colleagues? We seek fresh ideas, new perspectives, a diversity of experiences, and a dedication to service that will help us better meet the needs of the many people and businesses that rely on us each day. As the nations largest pharmacy health care provider, we offer a wide range of exciting and fulfilling career opportunities across our three business units MinuteClinic, pharmacy benefit management (PBM) and retail pharmacy. Our energetic and service-oriented colleagues work hard every day to make a positive difference in the lives of our customers.CVS Health is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, ethnicity, ancestry, color, religion, sex/gender (including pregnancy), national origin, sexual orientation, gender identity or expression, physical or mental disability, medical condition, age, veteran status, military status, marital status, genetic information, citizenship status, unemployment status, political affiliation, or on any other basis or characteristic prohibited by applicable federal, state or local law. CVS Health will consider qualified job candidates with criminal histories in a manner consistent with federal, state and local laws. CVS Health will not discharge or in any other manner discriminate against any Colleague or applicant for employment because such Colleague or applicant has inquired about, discussed, or disclosed the compensation of the Colleague or applicant or another Colleague or applicant. Furthermore, we comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENTFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require assistance to apply for this job, please contact us by clicking EEO AA CVS HealthCVS Health does not require nor expect that applicants disclose their compensation history during the application, interview, and hiring process.For inquiries related to the application process or technical issues please contact the Kenexa Helpdesk at 1-855-338-5609. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352. Please note that we only accept resumes via our corporate website: https://jobs.cvshealth.com/"}