{"jobID": "2628953905", "jobLocation": "Addison_TX", "jobTitle": "Sr Scientist CPI", "companyRating": null, "companyInfo": {"Website": "www.marykay.com", "Headquarters": "Addison, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB PURPOSE Independently lead, coordinate, execute, analyze, interpret data, and report sensory research, consumer research, and claims testing in support of product development, processing, and packaging research initiatives for cosmetic and skincare products. Scientist will work with the technical community, business team, and vendors to conduct appropriate research to advance in-depth product and business knowledge of the product and meet the business objectives. Preference for a candidate with knowledge and experience in all aspects of descriptive testing, claims testing, and in front end innovation methods. ESSENTIAL DUTIES AND RESPONSIBILITIESConducts developmental studies requiring a thorough knowledge of both sensory evaluation and consumer testing (qualitative; quantitative) processes. Designs and executes a wide variety of sensory tests, including complex sensory research studies to determine key sensory drivers of consumer liking for new and competitive products and provide direction for product/brand development. Projects require a testing plan from conceptualization to product launch. Projects may involve innovative and/or hybrid methodologies in areas which have little or no standardization. Develops or is assigned a project with direct application to Company operations, designs appropriate research methodology, and conducts research without technical guidance. Moderates focus groups and performs one-on-one interviewing to gain key consumer experience insights towards products and packaging. Provides status updates to manager.Partner with Brand, Brand Positioning, Regulatory, and Legal in the design of consumer claims studies by understanding competitive product claims and developing appropriate language for new claims to be tested with consumers.Screens viable candidates to determine sensory acuity to visual, tactile, and other stimuli and selects panelists with discriminatory abilities for language development and training for key product categories. Develops lexicon and testing procedures for key product categories. Maintains sensory descriptive panels by monitoring performance, frequency of testing, refresher training, panel motivation, and leading group discussion to ensure panel understanding of attributes, definitions and ballot usage. Validates panel reproducibility via subsequent exposures to products and replication of testing. Determines ingredients and products to be used as references for panel training and scale usage. Provides technical training in sensory methods to other members of the CCE team.Partners with CCE colleagues to establish guidelines for sensory and consumer evaluation procedures, including development of descriptive language and attribute scales and appropriate methodology for statistical data analysis.Participates on project, research, and organizational teams and interacts directly with Product Development, US/Global Brand Development, Brand Marketing, Package Quality, Skin Care Research, Product Safety, Microbiology, Regulatory Affairs, Contract Services, Program Management, E-Bus, Information Services & Technology, and outside customer contacts and vendors to determine appropriate strategies for overall project as well as individual studies to help optimize prototype formulations for an acceptable sensorial product and packaging experience. Represents the team or department in providing solutions to difficult technical problems associated with specific projects.Determines statistics to be used in evaluation and provides business implication/interpretation to data as it relates to the project and potential launch. Independently analyzes data from sensory and consumer use, surveys and from several aspects (correlation to select attributes). Assists project team with incorporating results into team decisions. Determines if advanced statistical analysis is appropriate to obtain better insight into data and implications of results for consumer preference mapping studies. Routinely presents data to US/Global Brand Development, Product Development and Marketing through top line and final reports as well as presentations of data to teams. Makes recommendations for formula modifications and project direction.KNOWLEDGE, SKILLS AND ABILITIES Education: Master’s degree in Science, Sensory Science, Food Science/Technology, Engineering, Psychology, or Marketing with a Market Research emphasis is required.  Experience: Five years of related experience in cosmetic, consumer product, or food industry research. Must have direct experience in testing methodology and questionnaire design in either consumer/market research or sensory evaluation. An advanced degree or experience in sensory evaluation, market research, consumer use testing is desired. Must demonstrate a high proficiency in verbal and written communication, language skills, panel development, sensory test methodologies, sensory language development, ballot development, focus group moderating, discussion guide development, protocol development, questionnaire design and conduct of sensory and consumer product research analysis and report writing.Must possess the ability to identify and clarify product and business issues and objectives and have the ability to integrate various research data, interpret, report, and communicate test results to technical and non-technical team members as it relates back to the business. Must also have the ability to correlate current and past studies to develop insights.Must possess a solid understanding of consumer/market research, sensory evaluation, and claims testing as they relate to Mary Kay, Inc. product areas.Must have a solid understanding of parametric statistics and hypothesis testing principles including a basic understanding of ANOVA, regression, correlation and cluster analyses. Requires a solid understanding and ability to apply experimental design to all projects where appropriate. Must be proficient in statistical analysis software (SAS, SPSS, etc.) as well as SIMS.Must possess excellent interpersonal skills and be able to appropriately influence colleagues on sensory, consumer, and claims issues.Demonstrates intellectual curiosity; innovativeMust be proficient in Microsoft Office programs (Outlook, Word, Excel, and PowerPoint)."}