{"jobID": "2816766700", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist/Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.arevolabs.com", "Headquarters": "Santa Clara, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At AREVO, our team is taking 3D printing technology to the next level. We are 3D printing ultra strong composite parts exceeding the strength of titanium. We have invented the world’s strongest composite materials, True3D printing and robotic arm based factory of the future manufacturing cells — and this is just the beginning. With our technology, we are making lightweight production parts for aerospace, industrial, consumer and medical industries enabling new applications for additive manufacturing.Arevo is looking for a candidate that can leverage/develop machine learning technologies using imaging/non-imaging data for solving a diverse set of problems.(computer vision, deep learning, structural optimization, Material Property Prediction etc)Be part of a cross-disciplinary team working on product development. Teams include computer scientists, material scientists and roboticists.Be a thought leader - guide data strategy, labeling/annotation methodologies,Strong background and experience in machine learningExperience end-to-end machine learning pipeline ( data exploration, feature engineering, model building, hyper parameter optimization, performance evaluation, inference )Experience with image processing / signal processing a plusExperience with image analysis leveraging mythologies using GPUs (a plus)Extensive experience with neural network libraries (i.e. Keras, TensorFlow, PyTorch, etc)Excellent Communication skillsSelf driven individual take high-level problem and see to completionDemonstrated programming skills proficient in C++/Python/MATLABDemonstrable body of work ( i.e. GitHub repo, Kaggle competition, peer-reviewed scientific publications)PHD in Computer Science, Machine Learning, StatisticsResponsible for: collecting/processing/generating data from variety of sources (sensors, images) identify, generate and selecting modeling features train build model to meet goals Innovate new techniques to address needs"}