{"jobID": "2823665197", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.vitalconnect.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "178000", "jobDescription": " Senior Data Scientist  Email inShare Location: San Jose, CA Date Posted: 02-14-2018Senior Data ScientistJob description We have an immediate need for an outstanding Algorithms Architect in the field of Wearable Computational Bio-sensing. You will be responsible for developing and deploying advanced algorithms in both embedded and cloud environments to aid in clinical monitoring and diagnoses using physiological signals. An ideal candidate for this job will be adept in signal processing, machine learning, and data science with a passion for developing algorithms in the medical engineering field. Are you a top performer looking for a dynamic atmosphere with a lot of freedom and responsibility? We want to hear from you!  VitalConnect is a front runner for a revolutionary medical device patch technology configured with an innovative ecosystem that allows healthcare providers to remotely monitor patient’s health and critical events round-the-clock. VitalConnect leverages extensive expertise in chip design, signal processing, data analytics, machine learning, and mobile and cloud software to create the cutting-edge technology that supports decision-making paradigms for achieving better health and economic outcomes. VitalConnect’s biosensor technology platform is designed for continuous use in a broad range of inpatient and outpatient settings, such as hospital monitoring, post discharge care, cardiac monitoring and pharmaceutical solutions. As a Senior Data Scientist at Vital Connect, you will be an integral part of the Research and Development team, utilizing your expertise to ensure we deliver a high-quality solution that meets the demanding needs of leading edge medical providers. Responsibilities:Algorithm and System architect for biometric sensors.Study designs, data collection, develop solutions & analyze biometric data.Develop Reference models for Embedded and Cloud deployments.Contribute to corporate patent portfolio and technical publications.Collaborate in cross-functional engineering groups on product development.Adopt good scientific practices in all phases of the research and development process.Requirements:5+ years experience in algorithm research and development.Must have excellent knowledge and experience in signal processing.Must have excellent knowledge in using machine learning techniques.Strong Statistical analysis techniques.Proven track record in innovative problem solving.Top-notch programming skills in Matlab and Python.Advanced Degree in Engineering, Biomedical Engineering, Applied Physical or Applied Mathematics.Ability to work and thrive in a fast-paced environment, and willing and able to learn rapidly.Desirable Qualifications:Fluent in C/C++.Experience in biomedical signal processing.Knowledge and experience in deep learning frameworks.Benefits at VitalConnect include:Employee Medical, Dental, and Vision benefits paid 100% by Vital Connect for employee and dependentsPre IPO StockAnnual holiday shutdown from Christmas to New Years!Lunch catered daily (TOGO's, Premier Pizza, Subway, Gotta Eatta Pitta, Rangoli India, Panda Express, BBQ, and many more!)Morning snacks provided (Hi5 Fruit, Whole Foods, Noah's Bagels, Hobee's)Free on-site gym Apply Now"}