{"jobID": "2828049103", "jobLocation": "Foster_City_CA", "jobTitle": "Ready to Return - Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.visa.com", "Headquarters": "Foster City, CA", "Size": "10000+ employees", "Founded": " 1958", "Type": " Company - Public (V) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " American Express, Mastercard, Discover"}, "estimatedSalary": "92000", "jobDescription": " Company DescriptionCommon Purpose, Uncommon Opportunity. Everyone at Visa works with one goal in mind making sure that Visa is the best way to pay and be paid, for everyone everywhere. This is our global vision and the common purpose that unites the entire Visa team. As a global payments technology company, tech is at the heart of what we do: Our VisaNet network processes over 13,000 transactions per second for people and businesses around the world, enabling them to use digital currency instead of cash and checks. We are also global advocates for financial inclusion, working with partners around the world to help those who lack access to financial services join the global economy. Visas sponsorships, including the Olympics and FIFA World Cup, celebrate teamwork, diversity, and excellence throughout the world. If you have a passion to make a difference in the lives of people around the world, Visa offers an uncommon opportunity to build a strong, thriving career. Visa is fueled by our team of talented employees who continuously raise the bar on delivering the convenience and security of digital currency to people all over the world. Join our team and find out how Visa is everywhere you want to be.Job DescriptionThis opportunity is posted in relationship with VisasReady to Returninitiative.While you may have taken extended time away, Visa believes it doesnt diminish your value or worth at work.If you are a professional who had to hit pause on your career, but are now ready to re-enter the workforce, we want to meet you! Learn if you&apos;re eligible for Visa&apos;s Ready to Return Program by going to the link below: https://careers.smartrecruiters.com/Visa/ready-to-return Imagine working for one of the pioneers in the payment technology space. The kind of company thats been setting the bar for the way people pay and get paid for more than 50 years, and continues to innovate on a global scale. Now imagine that company is less than 15,000 employees worldwide, small enough that youll actually have an impact and do some amazing things. Sounds pretty awesome. Well, that company exists and its Visa.  Yep, Visa.  Imagine, in a single day, the diversity of transactions that Visa manages from gaming enthusiasts who buy virtual goods to advance a level, to a small business merchant launching their first ecommerce business to a large consumer brand hitting their largest single-day sale. Now multiply transactions and interactions like that by millions on a global scale that&apos;s Visa. It is a multi-billion dollar market that has experienced year over year growth!QualificationsAt Visa, everyone is a leader. The Visa Leadership Principles will be integrated into all we do, driving accountability for the way we act and the way we lead. So what are we looking for in our experienced hires? Exposure to any of the following:Highly driven and resourcefulStrong ability to collaborateAdheres to Open Communication and fostering relationships across the enterprisePayments experience preferred but not always required  For more specific qualifications needed; your Recruiter will work with you to identify and assess your alignment to opportunities at Visa.Additional InformationVisa will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of Article 49 of the San Francisco Police Code.  All your information will be kept confidential according to EEO guidelines."}