{"jobID": "2809118254", "jobLocation": "Arlington_VA", "jobTitle": "Business Process and Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.avercg.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " AVER is seeking a motivated and proactive Business Process and Data Analyst with to join our rapidly growing team in Arlington, VA. Specific Duties and Responsibilities:Apply the use of process improvement, reengineering methodologies, and internet-related methodologies and principles to conduct process modernization projects.Responsible for transition of existing organizations or project teams in accomplishing the organizations goals or project activities and objectives through improved use of internet and other automated processes.Support activity and data modeling, development of modern business methods, identification of best practices, and creation and assessment of performance measurements.Provide group facilitation, interviewing, training, and additional forms of knowledge transfer.Key coordinator between customers and multiple project teams to ensure enterprise-wide integration of reengineering efforts and application of best practice including e-business practices experience.Data gathering and analysis, including support with data analysis tool, as assigned by supervisor.Maintain databases or reporting systems.Minimum Qualifications:Ability to obtain and maintain a Security Clearance with the Federal GovernmentBachelors Degree in related field.2+ years' of professional experience.2+ years of business process analysis and/or data analysis.About AVER, LLC:AVER is a verified Service Disabled Veteran Owned Small Business (SDVOSB) Technology and Management Consulting firm specializing in supporting Federal, State, and local government customers. We provide to all our clients the best customer experience by employing people that have a passion for consulting and who deliver real business value every day. We pride ourselves on anticipating our client's needs and delivering solutions with diligent execution. Our multi-disciplined staff are capable of doing more than just the primary duties, allowing our clients to spend less and avoiding inefficient single-track teams."}