{"jobID": "2831927145", "jobLocation": "Southfield_MI", "jobTitle": "Member Service Representative - Operations Team", "companyRating": "4.1", "companyInfo": {"Website": "www.mortgagecenter.com", "Headquarters": "Southfield, MI", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": "MEMBER SERVICE REPRESENTATIVE Southfield, MI  10am - 6pmDUTIES: Do you have a passion for providing world class customer service? Do you want to contribute to a growing team?  If you answered \"YES!\" to these questions, the Member Service Representative role at Mortgage Center may be a great fit for you! We're looking for those who are looking for growth and change. The Opportunity Mortgage Center's Operations Member Service Representatives tackle our credit union members' accounts behind the scenes. They post, proof, and balance members' payments, provide internal and external loan payoff quotes, and handle other administrative duties throughout the day. They execute many facets of loan servicing throughout the life of the loan (until it's paid off).  But there's more!! Not only is there an opportunity to service our members behind the scenes, but they also get the opportunity (here and there) to serve our members over the phone and via email, by answering members' questions, taking their payments, walking them through enrolling in e-statements and online payments, making escrow payments, and more!Why Join Mortgage Center's Team? Mortgage Center offers opportunities for growth within the Member Services department and throughout the organization. We want to see our employees grow within their positions and even into new positions when they're ready!  At Mortgage Center, we believe that the well-being of the total person is a priority. So we offer 3.5 weeks of Paid Time Off annually to all new employees to use however they see fit. We also offer your typical benefits, but you'll likely find they're at a much better price! Mortgage Center pays 85% of our employees' medical benefit premiums!  Additionally, we offer 401(k) with a company match, dental insurance plan options, a vision insurance plan, short-term and long-term disability, a free $15,000 life insurance policy, and more! REQUIREMENTS: Candidates who will be successful in this role have the following skills, experience, and qualifications:Education: High school diploma or equivalent. Some college coursework preferred.Experience: At least one (1) year of experience in a customer service role. Call center experience preferred.Pleasant speaking voice with superb listening skills.Professional verbal and written communication skills, with an ability to inspire trust through an empathetic communication style which promotes a quality image of Mortgage Center.Strong attention to detail, problem-solving and analytical skills.A passion for helping members effectively and efficiently in a fast-paced, highly regulated, and deadline-driven environment.Ability to accurately balance transactions by using the following math skills: Addition, subtraction, division, and multiplication.Flexibility in schedule during busy call times and payment processing.Strong keyboarding skills and proficient with Microsoft Outlook, Word, and Excel."}