{"jobID": "2766070380", "jobLocation": "Southfield_MI", "jobTitle": "Outside Software Sales Consultant", "companyRating": "2.7", "companyInfo": {"Website": "www.dexyp.com", "Headquarters": "Dallas, TX", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Requisition Number Southfield Post Date 5/7/2018 Title Outside Software Sales Consultant City Southfield Description Outside Software Sales  Are you just working for a company or are you part of a CAUSE?  Our Cause: Protect & grow local business market share through Local Business Automation and use of our customizable software  Local Business Automation – Customizable Software  We provide a unique way to automate a business’s everyday operations with software. Our software offers Customer Relationship Management (CRM), Search Engine Optimization, Marketing, online invoices & receipts, text messaging, email marketing and social media  management. This automation provides the edge a local business needs to better succeed in their market. We do it all in a convenient app which allows the local business owner complete control over their operations anytime, anywhere, and from the palm of their  hand. Take a look : https://vimeo.com/203503866 Who you are: We are seeking hungry and moldable individuals to strategize and offer our unique software solutions to local business owners. In addition, the candidate selected to join our team will be upselling existing accounts as well as growing local business via cutting  edge leads generation platforms.  We are looking for individuals who are: Goal oriented…you’re known for destroying your sales goalsPersuasive…you can explain software solutions in simple termsExceed sales quotas & expectationsBuild a pipeline of prospects & close dealsDevelop great solutions to help customers WIN! Basic Qualifications +2 years sales experienceProven record of prospecting & cold calling experienceTech savvyValid driver's license and clear driving record required, no multiple infractions within last 12 months Preferred Qualifications Proven success in new business acquisitionExperience in up-selling Software SolutionsDesire to achieve and be competitive with an optimistic attitude"}