{"jobID": "2820907682", "jobLocation": "Rolling_Meadows_IL", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.ajg.com", "Headquarters": "Rolling Meadows, IL", "Size": "10000+ employees", "Founded": " 1927", "Type": " Company - Public (AJG) ", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Aon, Marsh & McLennan Companies, Willis Towers Watson"}, "estimatedSalary": "60000", "jobDescription": "Arthur J. Gallagher & Co., one of the world's largest insurance brokers, provides a full range of retail and wholesale property/casualty (P/C) brokerage and alternative risk transfer services globally, as well as employee benefit brokerage, consulting, and actuarial services in the United States. We also offer claims and information management, risk control consulting, and appraisal services to clients around the world.  Arthur J. Gallagher Risk Management Services, Inc. is the U.S. retail property/casualty brokerage division of Arthur J. Gallagher & Co. Our advisors specialize by industry and coverage types—developing solutions uniquely tailored to individual client requirements. We deliver a full range of insurance and risk management products and services, including traditional and loss-sensitive coverages, captives, alternative risk solutions, and financial products to clients around the world. For additional information, please refer to Career Opportunities with Arthur J. Gallagher & Co.Position Summary:Designs and develops solutions to advance business performance management. Essential Duties:Analyizes data for complex risk assessments to be performed on behalf of clients.Plans and conducts assignments demonstrating a comprehensive knowledge of a field (or fields) of specialization.Develops and implements project plans, determines solutions to minimize or eliminate risks, and compiles reports showing the proposed plan of action for exisiting and potential clients.Presents resulting findings and recommendations to senior management.Monitors and assesses the post-period implementation of risk management strategies.Predicts the future trends from the current developments in the market and recommend the management accordingly to plan the strategies.Develops solutions based on subject expertise and occasionally represents the department or function at a broader level.May assist in orienting and training lower level employees.p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px 'Lucida Grande'; color: #000000}Required:Bachelor's degree and 5 years related experience required.Knowledge of statistics and other analytical tools.Desired: Problem-solving and project management skills.Work Traits:The ability to present complex concepts to a wide audience.Excellent attention to detail.U.S. Eligibility Requirements:Interested candidates must submit an application and resume/CV online to be consideredMust be 18 years of age or olderMust be willing to submit to a background investigation; any offer of employment is conditioned upon the successful completion of a background investigationMust have unrestricted work authorization to work in the United States. For U.S. employment opportunities, Gallagher hires U.S. citizens, permanent residents, asylees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H or L visas), such as students in practical training status. Exceptions to these requirements will be determined based on shortage of qualified candidates with a particular skill. Gallagher will require proof of work authorizationMust be willing to execute Gallagher's Employee Agreement or Confidentiality and Non-Disclosure Agreement, which require, among other things, post-employment obligations relating to non-solicitation, confidentiality and non-disclosure Gallagher offers competitive salaries and benefits, including: medical/dental/vision plans, life and accident insurance, 401(K), employee stock purchase plan, educational expense reimbursement, employee assistance program, flexible work hours (availability varies by office and job function) training programs, matching gift program, and more.Gallagher believes that all persons are entitled to equal employment opportunity and does not discriminate against nor favor any applicant because of race, color, religion, sex, age, veteran status, disability, national origin, or any other legally protected status. Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Gallagher will make reasonable accommodations to known physical or mental limitations of an otherwise qualified applicant with a disability, unless the accommodation would impose an undue hardship on the operation of our business. p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 12.0px 'Lucida Grande'; color: #000000} "}