{"jobID": "2685678679", "jobLocation": "Carrollton_TX", "jobTitle": "Application Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.cps4jobs.com", "Headquarters": "Westchester, IL", "Size": "51 to 200 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Aerotek, Robert Half"}, "estimatedSalary": "94000", "jobDescription": "Job DescriptionApplications Scientist The Application Scientist is integral to the core innovation teams. In addition to working on projects in the innovation pipeline, you will contribute to ongoing research and development activities. You will support the innovation team by leveraging your skills in product development and formulations by working with new applications for company. The Application Scientist reports to the Sensory and Application Development Manager. Daily collaboration with brand managers and scientists is essential for success.  *Formulate and execute product development from bench top to production scale for new products  *Develop and maintain component and ingredient specifications  *Assess technical feasibility and provide direction on formulations  *Assist in planning, monitoring and documentation of product trials  *Manage shelf-life testing  *Maintain accurate records of lab work, and provide statistical analysis  *Application specific tests for existing products  *Occasional travel is expected, but minimal  **If you’d like to hear more about this opportunity and others we are currently working on, please contact Mary Rigas at 815.756.1221 / [Click Here To Join].  JO: 70.18MR  #MHR Job RequirementsRequirements: *MS degree in Food Science or related discipline is required  *2-5 years of product development experience in a CPG company  *Dairy experience is a plus  *Working knowledge of Microsoft Office  *Excellent written, verbal and presentation skills  *Detail-oriented and highly analytical  *Ability to work independently and as part of a team on multiple projects  *Data analysis, experimental design, statistics and statistical software  *Work with complex interactions of foods in recipes and applications  *Ability to identify aromas and basic tastes  *Sensory experience is a plus  *Experience with fruit prep also a plus  **If you’d like to hear more about this opportunity and others we are currently working on, please contact Mary Rigas at 815.756.1221 / [Click Here To Join].  JO: 70.18MR  #MHR"}