{"jobID": "2797468010", "jobLocation": "Oakland_CA", "jobTitle": "SR Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.lqdigital.com", "Headquarters": "Emeryville, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Company Background: LQ Digital is a cross channel sales acceleration company, We help our clients acquire customers leveraging digital media channels like Google, Facebook, Bing, Yahoo, and the Display Ad Exchanges as well as develop and execute fully integrated marketing to sales campaigns with our U.S. based call center.  We are looking for a data scientist / business analyst to lead the charge in leveraging our growing repository of marketing and sales ops data to develop actionable insights for our teams. The Sr. Data Analystwill work across the organization with projects such as building a consolidated reporting engine and dashboard and the call center operations team to build predictive models that will drive real time decision making to drive efficiency. Position Responsibilities: -Lead the development of business requirements to consolidate, aggregate and analyze marketing and operational data.  -Slice, dice and analyze the data to answer questions like: Which marketing channels are most effective? When should our outbound calls be made to maximize contact rates? How many people do we need to staff hour by hour for our call center?  -Work with multiple business stakeholders and owners to solve business problems with data.  -Develop and maintain the data reporting infrastructure for the organization. Position Expectations: - Demonstrated expertise and experience with business intelligence and data visualization tools.  - Ability to wear many hats and be self-driven in solving business challenges.  - Curiosity for business problems and desire to find the best, most elegant solution to a problem Attention to detail and a strong capacity for problem solving.Be a true team player with the ability to have fun!Qualifications:2-4 years of previous business analytics or data mining experience in a professional setting.  - Experience with relational databases (SQL Server etc.)  - Experience with data visualization and analytics planforms (Tableau or similar)  - Previous experience working with clients in an agency or call center setting, preferred but not requiredFamiliarity with scripting languages is a plus (PHP, Python or similar)  - Experience with statistical models and predictive modeling algorithm development. (R, SAS, etc)  - Bachelor's degree We recruit only the most qualified candidates, and offer continual training and growth opportunities (not to mention all the snacks you can consume and a game room). We believe that a happy and productive team results in happy clients - and we love making our clients look awesome."}