{"jobID": "2628930085", "jobLocation": "Washington_DC", "jobTitle": "Research and Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.aamc.org", "Headquarters": "Washington, DC", "Size": "501 to 1000 employees", "Founded": " 1876", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " The Association of American Medical Colleges, representing the nation's medical schools, teaching hospitals, and related professional societies, is seeking a Research and Data Analyst. The major responsibilities of the position include maintaining and enhancing recurring data collections, surveys, and data reports that address a variety of topics, such as applicants, students, graduates, residents, faculty, hospital operations, medical school finances, and organizational characteristics. In addition, the individual will be responsible for providing support to users of online bench-marking tools, collaborating with colleagues across the Association on data and operational issues, and conducting ad hoc analyses for internal and external audiences. Responsibilities Manage data operations Manage a number of recurring data services, such as those relating to compensation studies, hospital operations, and Group membership. Serve as a Data Steward for key AAMC data assets.Update and maintain office manuals that document policies and procedures for data collections, data management, and data reporting.Collect and report data in compliance with AAMC and applicable federal or IRB policies and procedures.Help design, test, launch, enhance, and manage surveys and reporting tools in Verint, ColdFusion, Java and other platforms.Produce and maintain programming files for importing, data checking, and analyzing data in syntax such as SQL, PL/SQL, VBA, HTML, and JavaScript.Contribute to the development and maintenance of data management and data reporting applications to meet internal and external information needs.Develop and maintain quality control checks and project management schedules to ensure that surveys and reports are launched in a sound and timely manner.Provide day-to-day support to survey participants, report recipients, and application users with log-in issues, content-related questions, reminders, extensions, or similar operational concerns.Review articles, papers, presentations, and other materials for accuracy of analysis and interpretation.Respond to ad hoc requests for special reports, presentations, report access, and other data services.QualificationsA four-year college degree is required, although a master’s degree is preferred.Two to three years of experience is preferred in planning, executing, and distributing quantitative reports and analyses. Experience with complex relational databases is required.This position requires basic proficiency in SQL, PL/SQL, Visual Basic, or similar programming languages, as well as Microsoft Office Suite. Ability to generate compelling visuals using HTML5, JavaScript, Excel, PowerPoint, SAP, or other reporting tools is desired.Strong writing skills, verbal skills, presentation skills, and attention to detail are expected.If a bachelor’s degree is required, related work experience may be substituted in some positions. One year of college course work at an accredited institution is equivalent to one year of related work experience.The Association of American Medical Colleges (AAMC) is an Equal Opportunity/Affirmative​​ Action Employer. The AAMC is committed to the policy of an equal employment opportunity in recruitment, hiring, career advancement, and all other personnel practices. The AAMC will not discriminate on the basis of race, color, sex, national origin, religion, age, marital status, personal appearance, sexual orientation, gender identity or expression, family responsibilities, matriculation, political affiliation, genetic information, disability, past or current military service, or any other legally protected characteristic.Please attach a resume as part of the application process. It is important that files DO NOT include periods ( . ) within the file name.BROWSER REQUIREMENTS: Applications must be submitted using Chrome, Mozilla Firefox, Safari, or Internet Explorer v.10 or higher."}