{"jobID": "2790126179", "jobLocation": "Mountain_View_CA", "jobTitle": "Quality Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.elcaminohospital.org", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "The Quality Data Analyst supports clinical business decisions and operational processes through interaction with executive management and other key management staff. In partnership with leadership and physician key stakeholders, the Quality Data Analyst identifies and supports areas of analytical focus for the organization's quality of service, care delivery performance and evaluation of potential areas of opportunity and risk. Incorporating clinical best practices and interpreted data, the analyst produces both long-term and short-term activities and deliverables and defines innovative solutions that drive measurable benefits to the organization.  The Quality Data Analyst creates analytical tools using an in?depth understanding of healthcare data (e.g. patient, claims, financial, clinical and provider data) and operations coupled with the knowledge of large data set development and quantitative data analysis methodology.  The Analyst Leads special projects, lending data expertise and actionable insightDevelops exception reporting and conduct drill?down analysis to proactively identify specific variances in practice patternsGenerates customized work products, presentable for content and audienceMaintains strong attention to details and prioritizes workload while meeting deliverables and expectationsWorks autonomously and collaboratively with report requestors, providing guidance to define report requirements and validate resultsWorks collaboratively across departments to understand and meet the organization's clinical quality analytic needsQualificationsBachelor's Degree in a healthcare-related field, science/social sciences, mathematics/statistics, information technology, or public/business administrationMinimum of 5?years' experience in a managed care, hospital, provider practice or similar settingMinimum of 5 years' experience in data systemsProficiency with SQL, Access, Excel, reporting software, Business Objects, Epic Clarity, Epic Reporting Workbench, PowerPoint and healthcare transactional systemsExperience building partnerships and fostering trust with cross functional team membersExperience working with databases, large data sets, multiple data sources and interpreting complex data to create meaningful informationExperience managing projects, tasks, deadlines and discerning priorities while working within budget constraintsExhibits critical thinking and problem solving skills  License/Certification/Registration RequirementsEpic Clarity certification projects and exams within six weeks of taking required Epic training."}