{"jobID": "2808476809", "jobLocation": "Rahway_NJ", "jobTitle": "Scientist, Stat. Programming", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition ID: STA000918  Merck&Co.;, Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world - class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  This position supports statistical programming activities for late stage drug / vaccine clinical development projects. Accountability predominantly includes the development and execution of statistical analysis and reporting datasets, tables, listings, figures and submission deliverables under the guidance of a senior level programmer. The statistical programmer will perform validation tasks according to departmental SOPs and collaborate effectively with outsource partner on medical monitoring reports development, validation, and deployment. The position is a key collaborator with statistics and other project stakeholders to gather and document user requirements for statistical programming deliverables. Primary Activities:Programmatically develop, validate and maintain efficacy and safety datasets, tables, listings, and figures at a protocol levelAssure deliverable quality and compliance with departmental SOPs and good programming practicesCollaborate effectively with project team members including outsource provider staffQualificationsEducation Minimum Requirement:B.A / B.S in Computer Science, Statistics, Applied Mathematics, Life Sciences, Engineering or related field plus 2 - 4 years SAS programming experience in a clinical trial environmentM.S in Computer Science, Statistics, Applied Mathematics, Life Sciences, Engineering or related fieldRequired Experience and Skills:Department Required Skills and Experience:Good interpersonal skills and ability to negotiate and collaborate effectivelyGood written, oral, and presentation skillsKnowledge and experience in developing analysis and reporting deliverables for R&D; projects (data, analyses, tables, graphics, listings)Takes direction effectively and completes tasks at a project level; ability to collaborate with key stakeholdersPosition Specific Required Skills and Experience:SAS programming experience including data steps, procedures, SAS / MACRO, SAS / GRAPHAbility to quickly and effectively learn new program techniques and data structuresTakes direction effectively and completes programming tasks under the guidance of a senior programmer at a project levelKnowledge in CDISC SDTM and ADaM standardsAn interest to advance career by investing in development activities and taking on tasks with increasing levels of challenge and responsibilityPreferred Experience and Skills:Knowledge of pharmaceutical development processes and clinical endpoint data (efficacy and safety)Unix operating system experience; systems and database experienceGood working knowledge of reporting processes (SOPs) and software development life - cycle (SDLC)Ability and interest to work across cultures and geographies Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com. Search Firm Representatives Please Read Carefully: Merck&Co.;, Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  Visa sponsorship is not available for this position.  For more information about personal rights under Equal Employment Opportunity, visit:  EEOC Poster  EEOC GINA Supplement  Job: Statistical Programming  Other Locations: Upper Gwynedd, PA, US  Employee Status: Regular  Travel: No  Number of Openings: 1  Shift (if applicable): 1st  Hazardous Materials: None  Company Trade Name: Merck  Nearest Major Market: New York City  Nearest Secondary Market: Newark"}