{"jobID": "2770670887", "jobLocation": "Dallas_TX", "jobTitle": "Field Scientist", "companyRating": null, "companyInfo": {"Website": "www.terracon.com", "Headquarters": "Olathe, KS", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Kleinfelder, URS Corporation, PSI"}, "estimatedSalary": null, "jobDescription": " Field Scientist  11-May-2018 Service Line Environmental Job DescriptionGeneral Responsibilities: Conduct environmental site investigations, assessments and surveys to sample, measure and analyze air, water, material, and soil. Identify, evaluate and recommend risk and remediation strategies/designs to ensure compliance with federal, state and local regulations. Prepare applicable permit applications, risk assessments and technical documents including proposals, reports and regulatory agency correspondence. Design systems and environmental protection plans. Projects may include Phase I/II environmental site assessments, ecological and natural resource field surveys, tank closure assessments, asbestos abatement, storm water management, and site planning and permitting. Essential Role and Responsibilities:Follow safety rules, guidelines and standards for all projects. Participate in pre-task planning. Report any safety issues or concerns to management.Be responsible for maintaining quality standards on all projects.Developing level scientific professional responsible for conducting analyses of component portions of projects (e.g. collection of field data using GPS, preparation of exhibits in ArcGIS, soil sampling, vegetation sampling, etc.). Assignments are designed to develop knowledge and abilities.Perform site visits, field observations and field data collection or assignments.Assist in the collection and analysis of data from sampling, reports, maps, drawings, tests and aerial photographs to evaluate, plan and permit projects. Typical projects may include permitting or agency coordination under Section 404 of the Clean Water Act, Endangered Species Act, National Historic Preservation Act, Rivers and Harbors Act, National Environmental Policy Act, Migratory Bird Treaty Act, or Bald and Golden Eagle Protection Act, and data collection/analyses will be centered around resources related to these Acts (i.e. wetlands and streams, wildlife, cultural resources, socio-economic environment, etc.).Implements technical requirements to complete client projects by directing field staff to sample, test and collect data and/or document site activities.Outlines required investigative program(s) by selecting the proper alternative techniques to conduct site studies in field of expertise.Drafts written proposals to clients for small projects and may assist with portions of proposals on larger projects.May have limited client contact pertaining to specific projects/tasksRequirements:Bachelor’s degree in Environmental Science, Wildlife & Fisheries Science, Natural Resource Management, Biology, Range Management, Geology, Geography, or related science field and a minimum 1 year related experience. Or, in lieu of a degree, a minimum of 5 years’ related experience.Master's Degree PreferredValid driver’s license with acceptable violation historyMinimum one-year experience in the following…Wetland & stream delineation/preliminary jurisdictional determinationsGPS mappingGIS mappingPreparation of NEPA documentationWildlife surveys and habitat assessmentsVegetation identificationPreferred Certification:Certification in field of expertise preferred.Exemption Exempt Requisition ID9336BRPosting Title Field Scientist (Natural Resources) Employment Type Regular, Full Time City, State (Office Location) Dallas, TX About Terracon Terracon is a 100 percent employee-owned consulting engineering firm providing quality services to clients. Since 1965, Terracon has evolved into a successful multi-discipline firm specializing in environmental, facilities, geotechnical, and materials services. Terracon currently has more than 3,500 employees in 130 offices with services available in all 50 states. Terracon’s growth is due to valued employees exceeding expectations in client service and growing their careers with new and exciting opportunities in the marketplace. EEO Statement Terracon offers an excellent compensation and benefits package including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays.  Terracon is an EEO employer. We encourage qualified minority, female, veteran and disabled candidates to apply and be considered for open positions. We do not discriminate against any applicant for employment, or any employee because of race, color, religion, national origin, age, sex, sexual orientation, gender identity, gender, disability, age, or military status. Job Category Scientist "}