{"jobID": "2812752836", "jobLocation": "Washington_DC", "jobTitle": "Software Engineer", "companyRating": "4.5", "companyInfo": {"Website": "www.predictivetechnologies.com", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": " Back to job listingBe part of Product Development at APTCreative product opportunities, modern business questions, and intricate datasets present uniquely challenging problems for organizations. At APT, we empower those organizations to make multi-million dollar data-driven decisions. APT's next generation platform blends industry-leading analytics, advanced software architecture, and the latest web technologies. As a member of our Product Development team, you will play a vital role within a rapidly growing firm, working closely with experienced and driven engineers to solve these problems.Make an impact as a Software EngineerWhat this means for you: Apply your skills in computer science, math, and statistics to solve important problems faced by some of the world's largest organizationsDesign and develop state of the art service oriented software architectures.Create cutting-edge algorithms and analytical techniques that can handle on-the-fly processing across hundreds of dimensionsPlay a central role in developing a powerful suite of web applications, and drive valuable improvements to the capabilities of our productLeverage new technologies and approaches to innovating with increasingly large data setsLead and push the boundaries of analytics and powerful, scalable applicationsCollaborate across teams with exceptional peers who are passionate about what they doBuild expertise in full stack development Bring your passion and expertiseWhat we're excited about: Proficiency with advanced object-oriented programmingDeep understanding of algorithms and data structuresPassion for solving varied and complex real-world problemsInitiative and creativity in approaching new challengesAbility to thrive on small, highly collaborative project teamsSolid technical foundation with a degree in Computer Science or related fieldAPT is an equal opportunity employer that values diversity and inclusion. Applicants will be considered and treated without regard to gender, gender identity, race, color, ethnicity, national origin, religion, sexual orientation, veteran or disabled status, or any other characteristic protected by applicable law. Apply Now  Learn more about the Engineering team  Interview Resources Share this Job FacebookTwitterLinkedIn"}