{"jobID": "2739547814", "jobLocation": "Paterson_NJ", "jobTitle": "Enterprise Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "jobs.stjosephshealth.org", "Headquarters": "Paterson, NJ", "Size": "5001 to 10000 employees", "Founded": " 1867", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " Overview St. Josephs Healthcare System is recognized for the expertise and compassion of its highly skilled and responsive staff. The combined efforts of the organizations outstanding physicians, superb nurses, and dedicated clinical and professional staff have made us one of the most highly respected healthcare organizations in the state, the largest employer in Passaic County, and one of the nations 100 Best Places to Work in Health Care. Job Overview The Manager of Enterprise Analytics will align, direct, and manage the integration of data analytics and business intelligence necessary to meet the mission, vision, strategy, goals and objectives of the organization. Reporting to the Vice President and CIO, the Manager of Enterprise Analytics will collaborate with the enterprise analytics steering committee to develop and implement an enterprise analytics department and function. This role will lead the data analytics department in developing performance insights to align enterprise goals and objectives. Responsibilities B.A. /B.S. in data science, information technology, economics, business administration or related field required; Master's degree preferred. 5 to 10 years of increasing experience, including data warehousing, data and business analytics, data governance, and data visualization required. The candidate must also have successful experience in leading and working with teams. Excellent verbal and written communication skills to facilitate the communication required for collaboration. Significant skill in research and data analysis, including data transformation, visualization, and presentation. Experience with enterprise data warehousing, statistical and business intelligence tools is required. The ability to inspire and lead cross-functional groups and instill a common vision and framework is integral to this position. This candidate must be approachable and relate well to executives, management and staff. Qualifications Apply for this job online Apply Share Email this job to a friend Refer"}