{"jobID": "2782716828", "jobLocation": "Sunnyvale_CA", "jobTitle": "Lead Data Scientist - NLP", "companyRating": "3.4", "companyInfo": {"Website": "www.target.com", "Headquarters": "Minneapolis, MN", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (TGT) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Description: About This OpportunityJoin the Target.com interactive team, where your goal is to make the multi-channel shopping experience as simple, secure and enjoyable as a visit to your local Target store. Youll develop strategies that drive sales and innovation while creating a fast, fun experience that inspires guest loyalty.Anticipates future business needs and identifies opportunities for complex analysis. Gathers and analyzes data to solve and address highly complex business problems and evaluate scenarios to make predictions on future outcomes and support decision making. Designs and drives the creation of new standards and best practices in the use of statistical data modeling, big data and optimization tools for Target.com and Mobile.Use your skills, experience and talents to be a part of groundbreaking thinking and visionary goals.Execute solutions to business problems using data analysis, data mining, optimization tools, and machine learning techniques and statisticsDeploy data-science and technology based algorithmic solutions to address business needs for Targets digital businessEvaluate new commerce data technologies to determine the effectiveness of the solution and its feasibility of integration with Targets current digital commerce platformsUtilize recommender systems, collaborative filtering techniques, propensity modeling to drive Target business prioritiesImplement Natural Language Processing, Latent-Dirichlet Analysis, Topic Modeling, search relevanceExecute large scale models using Logistic Regression, Linear Models Family (Poisson models, Survival models, Hierarchical models, Naïve-Bayesian estimators), Conjoint Analysis, Spatial models, Time-series modelsRequirementsM.S. in math, advanced statistics, physics, bio statistics, bio science, operations research and/or computer science3+ years of experience deploying algorithms in a production environmentExperience designing algorithms on Hadoop ecosystemExperience with recommendation systemsA strong passion for empirical research and for answering hard questions with dataExcellent written and verbal communication skillsSimilar Industry Titles and Key Words: Algorithm Developer, Junior Scientist, Project ScientistQualifications:"}