{"jobID": "2720922070", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.opensystemstech.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " A global Investment Bank is currently seeking a Data Analyst to join their team in Jersey City. This candidate will focus on improving efficiency through application of data analytics tools and techniques. You are also responsible for ensuring proper data governance is adhered to, provide training and education on the tools available, evaluate and optimize the analytics solutions developed by other regional business units, and develop solutions across a variety of functional areas within the bank.  You will collaborate with business analysts to gather and document requirements, and to design, develop, and test solutions which meet a business identified need. You will analyze heterogeneous data sets, develop data extraction and data preparation packages using Alteryx, dashboard visualizations in Tableau, as well as workflow enhancements using standardized tools adopted within the organization. Responsibilities:Governance and oversight for the production deployment of regional analytics solutions. Review and optimize the submitted solution to maximize efficiency and ensure stability.Develop Alteryx ETL packages to extract and transform data.Create and maintain SQL queries which are used to provide data extracts in support of business requirements.Design data visualizations using Tableau dashboards to facilitate business decisions.Create and maintain detailed specifications; data mapping & technical documentation for the projects.Assist in Data Architecture design, tools selections; data flows analysis.Coordinate all phases of a project lifecycle.Develop and maintain data analytic solution library for reusable components.Write/analyze functional requirements based on obtained business requirements.Facilitate a user community of data analysts and data scientists to foster collaboration and innovation.Provide education, raise awareness, and develop training programs surrounding data analytics and data science.Qualifications:BS in Computer Science or related IT field, or equivalent work experience required.5+ years of experience in data analytics projects.5+ years of experience in providing SQL based data solutions5+ years of hands-on development in Alteryx and Tableau.5+ years of project management experienceGood track record in Oracle database development, i.e. good knowledge & practice of Oracle SQL and PL/SQL.Experience in business analysis, strong problem solving/troubleshooting skillsFamiliarity with machine learning techniques, Python, and R is a plus."}