{"jobID": "2802182742", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.gotinder.com", "Headquarters": "West Hollywood, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "Tinder brings people together. With tens of millions of users and a presence in every country on earth, our reach is expansive and rapidly growing. Tinders Business Analytics Team is looking for a Data Analyst to empower teams across the business.  Our analytics team takes ownership of the decisions being made from our data we develop a deep understanding of both the business and its data and establish close working relationships with all teams - including Product, Marketing, Engineering, and Finance -- so that we can provide recommendations and make proposals regarding prioritization of initiatives, product launches, A/B tests, and company performance.  As an analyst, you will provide data-driven insights via ad-hoc analyses, presentations, and automated reports and dashboards. This role will require extensive experience with SQL, data wrangling, and statistics as well as ability to work in cross-functional teams to drive actionable insights. Experience with consumer mobile products preferred. Key Roles and Responsibilities:Master and own the analytical understanding of customer behavior and business performance across numerous aspects of our productFind the story in the data and communicate insights and opportunities with executive and other internal teamsConduct comprehensive analysis of growth, engagement, and revenueIntegrate captured event data with other sources of customer data, such as surveys and app store dataSupport Tinders data needs by using SQL to query Amazon Redshift (and soon Apache Spark)Skills Required:5+ years of relevant experienceAbility to think objectively and interpret meaningful themes from quantitative and qualitative dataAbility to build constructive and effective relationships with a broad and diverse group of business partnersAbility to execute on complex analytics projects where you have to determine salient questions in a complex ecosystem and present action-oriented conclusionsProficiency with SQL requiredScripting skills, preferably in Python. Strong Python/NumPy/PANDAS skills a plusKnowledge of statistics, specifically experimental design and analysisProficiency in Microsoft Excel and Microsoft PowerPointFamiliarity with common KPIs, metrics, and growth experimentsAs part of our team, youll enjoy:The hustle of a startup with the impact of a global businessTremendous opportunity to solve some of the industrys most exciting problemsWorking with an extraordinary team of smart, creative, fun and highly motivated peopleComprehensive health coverage, competitive salary, 401(k) match and meaningful equityUnlimited vacation and flexible working hoursDaily catered lunches, an endless supply of refreshments, basketball court, fitness classes and social eventsModern, uplifting work environment in an ideal location"}