{"jobID": "2628804727", "jobLocation": "Garland_TX", "jobTitle": "Application Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.daisybrand.com", "Headquarters": "Dallas, TX", "Size": "201 to 500 employees", "Founded": " 1917", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "Level ExperiencedJob Location Garland - Garland, TXPosition Type Full TimeEducation Level Bachelor'sTravel Percentage Up to 25%Job Shift DayJob Category ResearchDescriptionThe Application Scientist is integral to the core innovation team. In addition to working on projects in the innovation pipeline, you will contribute to ongoing research and development activities. You will support the innovation team by leveraging your skills in product development and formulations by working with new applications for Daisy products. The Application Scientist reports to the Sensory and Application Development Manager. Daily collaboration with brand managers and scientists is essential for success.ResponsibilitiesFormulate and execute product development from bench to production scale for new productsDevelop and maintain component and ingredient specificationsAssess technical feasibility and provide direction on formulationsAssist in planning, monitoring and documentation of product trialsManage shelf-life testingMaintain accurate records of lab work, and provide statistical analysisApplication specific tests for existing productsPerform other duties as neededSchedule and TravelTypical work schedules are Monday through Friday during daytime hours. Work hours may be adjusted to accommodate project schedules. Occasional travel is expected.QualificationsEducation and Work ExperienceM.S. degree in food science, or related discipline is required2-5 years of product development experience in a CPG companyDairy experience is a plusRequired Knowledge and SkillsWorking knowledge of Microsoft OfficeExcellent written, verbal, and presentation skillsDetail-oriented and highly analyticalAbility to work independently and as part of a team on multiple projectsData analysis, experimental design, statistics and statistical softwareWork with complex interactions of foods in recipes and applicationsAbility to identify aromas and basic tastes Daisy Brand is a nicotine-free workplace.EOE/M/F/D/V"}