{"jobID": "2731581790", "jobLocation": "San_Francisco_CA", "jobTitle": "People Partner Leader - Engineering", "companyRating": null, "companyInfo": {"Website": "www.fundingcircle.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " LendingClub, OnDeck, Bond Street"}, "estimatedSalary": null, "jobDescription": "As a People Partner Leader you will Work with our Chief Product & Business Operations Officer and broader leadership team to identify, build and execute HR strategies to meet Funding Circles business objectives. You will understand the critical business and technology priorities and proactively develop a People agenda that supports the business as it continues to grow while incorporating our values and adding to the strength of our culture. Your People agenda will include partnership across the People Team to deliver initiatives globally on performance management, organizational design, change management, managerial & leadership development, total rewards, culture & engagement and diversity & inclusion.  You must be able to anticipate needs, diagnose problems, identify and drive appropriate solutions while collaborating well across a global matrixed environment. You know how to coach, mentor and advise at all levels of the organization. With senior leadership, you will bring and elicit the critical thinking necessary for navigating complex people situations. You thrive in a fast-paced environment and naturally apply data and analytics to help inform trends, identify appropriate interventions and measure impact. As a People Partner Lead, you will report directly to the Chief People Officer and be a member of the People Leadership Team committed to building a best in class People function. Youve been there and done this8+ years as a People Partner or Senior Business Executive supporting a global business, with specific knowledge of US employment law2+ years supporting multiple senior executivesStrategically focused - can build people strategies to enable business outcomesDevelops trusted relationships, credibility and influence, via remote working arrangementsLed the planning, design, delivery of cross HR-functional initiatives and managed others either directly or indirectlyData driven in analyzing organizational trends and recommending action items. Must be comfortable using spreadsheets and creating pivot tables, v-lookups and other basic formulas.Assesses training and facilitation needs and conducts 1:1 and group sessions tailored to deliver specific outcomesExceptional oral and written communication, listening and presentation skillsIt would be great if youve alsoExperience with local laws and regulations in the UK, Germany, and the NetherlandsWorked in a regulatory environmentPrivate and public company experienceHave managed people or teamsSignificant depth of expertise in another HR functional discipline such as Strategy, HRIS,Compensation, Diversity & Inclusion, People Analytics and/or Learning & DevelopmentExperience with project management methodologies and techniquesIdentifies with our mission, to build a better financial worldAligns with our core values: Think Smart, Make It Happen, Be Open, Stand together, Live The AdventureWhy Join Us? Happy employees are productive employees, thats why we offer a hearty benefits package. From learning and development and commuter stipends, to a competitive salary, equity, and health benefits, weve got you covered! That being said, have you heard about what we're doing?! Our mission is what really motivates us to come to work each day: We're supporting small business, the engine of economic growth.We're helping facilitate higher yields for investors and lower interest rates for borrowers.We can fund loans extremely quickly, all online!We have a clear competitive advantage globally in areas like domain expertise and regulatory processes. To learn more about our work environment, culture, and perks, visit: https://www.fundingcircle.com/us/careers Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Funding Circle provides equal employment opportunity to all individuals regardless of their race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, pregnancy, or any other characteristic protected by state, federal or local law.  #LI-SC1"}