{"jobID": "2795805314", "jobLocation": "Detroit_MI", "jobTitle": "Digital Business Leader", "companyRating": null, "companyInfo": {"Website": "www.dynatrace.com", "Headquarters": "Waltham, MA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Digital Business Leader will have overall strategic and operational responsibility for the global Dynatrace Digital Business team. The leader will advance the Dynatrace vision of extending its #1 market position and #1 product leadership in a hyper-growth environment by designing and building services that transform customer engagement, external and internal.The Digital Business Leader will create the worlds best customer experience through an innovative mix of great talent, artificial intelligence, big data analytics, customer-facing employee engagements, and excellent execution.This role is responsible for leading, mentoring, and aligning the Digital Business Team with software engineering, cloud operations, infrastructure applications, security, and end user services functions across the globe. The leader will collaborate closely with Business Systems and Global Technology Groups.Success will be measured by achieving and sustaining exceptional customer satisfaction, as well as delivering company growth and customer retention through an innovative, smart, and effective digital business environment.Why is this opportunity cool? Global organization experiencing hyper-growth with a unique SaaS approach that allows us to own the enterprise cloud market and provide a unique customer experienceA \"non-siloed\" BizDevOps role, working with the top stakeholders across the organization, to help our customers digitally transformAbility to drive innovation through culture and tech working closely with the Detroit labUtilize the latest cloud technologies big data analytics, AI, next generation tech, microservicesBe part of building a BizDevOps/NoOps environment with self-healing cloud automation Key Attributes The ability to drive solutions by excellence, leading through empowermentAn entrepreneurial mindset to understand the business goals and needs in our digital transformationDemonstrated passion for leading through coaching and mentoringA clear focus on driving the organization to modern techniques and practiceOperating in a bi-modal IT environmentSolution engineering experience in an agile environment Specific Responsibilities Create an unparalleled customer experience in all interactions with DynatraceDrive increased effectiveness of Dynatrace employees, especially sales and services teams, through driving digital approaches in the context of human behaviorStrategically partner with all business areas to understand challenges and design solutions that meet operational requirements, including scalability, sustainability, security, and flexibilityDevelop a common, consistent, repeatable approach for support, including infrastructure support capabilitiesDefine, guide and maintain metrics and overall performance of internal teamsGain a deep understanding of internal and external customer experience by interfacing and anticipating their needs to ensure offerings are aligned to drive business growthProvide a voice to develop strategy and vision, oversee creation and successful execution of multiple projectsBuild world-class teams, through hiring, coaching and developing empowered, smart employees where everyone is a leader in their own way, both in the Detroit and international labsBe technology visionary for the digital business, and work hand-in-hand with the SVP of Products and CTO to put the vision in placeOwn your outcome - at Dynatrace, all leaders, including technical leaders, take full pride and responsibility in operations and resultsA team player who operates in a collaborative style, aligning people and strategy, with the ability to build strong relationships internally to advance the businessDynatrace has redefined how you monitor todays digital ecosystems. AI-powered, full stack and completely automated, its the only solution that provides answers, not just data, based on deep insight into every user, every transaction, across every application. The worlds leading brands, including, 72 of the Fortune 100, trust Dynatrace to optimize customer experiences, innovate faster and modernize IT operations with absolute confidence.We offer competitive compensation, company-sponsored premium benefits, medical, dental, vacation/holidays, company matching 401(k) Plan, etc. Dynatrace is an equal opportunity employer and VEVRAA Federal Contractor. We consider all qualified applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law. If your disability makes it difficult for you to use this site, please contact recruiting@dynatrace.com. Dynatrace participates in E-Verify, participant information in English and Spanish. Right to work information in English and Spanish. EEO is the Law/EEO is the Law Supplement.Note to Recruiters and Placement Agencies: Dynatrace LLC (Dynatrace) does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Dynatrace employee. Dynatrace will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Dynatrace."}