{"jobID": "2486104012", "jobLocation": "Chicago_IL", "jobTitle": "Sr Analytics Consultant", "companyRating": "3.9", "companyInfo": {"Website": "www.transunion.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Public (TRU) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": "Dynamics of the Role As a Sr. Analytics Consultant on our team, you  will join a world class group of statisticians, data scientists, mathematicians,  and modelers on a mission to extract insights from information and put them to  good use. You will have an opportunity to be a part of a variety of analytical  projects in a non-siloed environment and be recognized for the work you  deliver. TransUnion offers a culture of  lifelong learning and as a Sr. Consultant here, your growth potential is  limitless. The Team’s Focus You want to talk about big  data? At TransUnion, we have data on  virtually every active credit consumer in the United States. Yes, almost every  single one (and data on millions of consumers in 30 other countries).  But, ‘having data’ means nothing  without curious analytical minds to unlock the meaning within it. Our analytics  team is home to some of the most brilliant minds in the market. Here, we will  not only understand your stats jokes, but appreciate them. We come to work every day to quantitatively  explain how things happen and why. Why? Because the work that we do allows  people to have access to credit, enables new generations to pursue an  education, and builds economies from the ground up. TransUnion is a place where it’s cool to be  smart. Have we piqued your interest? Well, read on… How You’ll Contribute This  position is responsible for developing credit risk management and business  intelligence analytic solutions through consulting engagements and research  serving TransUnion’s clients. This position requires an understanding of US  consumer lending and credit risk management practices. Collaborate with  internal and external partners to deliver innovative analytical products and  insights. You will be directly involved in the development of predictive modeling  and business intelligence solutions for clients such as credit lenders,  insurance carriers, and other financial services institutionsDesign and lead initiatives  involving descriptive, predictive, and prescriptive analysis leveraging a  variety of techniques (such as segmentation, logistic regression, survival  analysis, principal component analysis, Monte Carlo simulation, scenario and sensitivity  analysis, and machine learning); this will involve delegating tasks to other  team members and managing the team to meet deliverables on timeDig in by  extracting data and performing segmentation and statistical analyses on large  population datasets (using languages such as R, SAS, SQL, and Python on Linux  and PC computing platforms)Deliver analytic  insights and recommendations in succinct and compelling presentations for  internal and external customers at various levels including an executive  audience; may lead key presentations to clientsHelp to cultivate  an environment that promotes excellence, innovation, and a collegial spiritServe as a  subject matter expert on the team and act as a mentor to more junior team members;  may directly manage a small team of AnalystsServe as an  advisor and partner to the senior management team: proactively seek out  opportunities for innovation and present new ideas and solutions on behalf of  the teamWhat You’ll BringA graduate degree in the hard sciences with advanced coursework in  statistics6-12 years of professional analytical modeling experience,  solving problems relevant to the problems we solve at TransUnionExpert proficiency with one or more statistical programming languages  such as R or SAS; additional experience writing intermediate SQL queries for  data extraction preferredStrong written and verbal communication skills: ability to clearly  articulate ideas to both technical and non-technical audiences, strong  presentation skills with comfort presenting to executive audiencesStrong analytical, critical thinking, and creative problem solving  skillsStrong time and project management skills with the ability to  oversee and manage project teams to meet project deliverables inclusive of  delegating work, setting clear goals, providing coaching and feedback, and  managing customer expectationsDirect and effective experience managing junior analytical  professionals preferredWhat We Offer We aim high — and are reaching for new heights every day. This is a terrific time to join our team as we build on our commitment to integrity, service, reliability and innovation. These values stand behind the decisions we make every day, as well as our relationships at work and with the customers we serve. We believe in the power to achieve and are taking it in bold new directions. Who We Are At TransUnion, we are dedicated to developing  ways information can be used to help people make better and smarter decisions.  As a trusted provider of global information solutions, our mission is to help  people around the world access the opportunities that lead to a higher quality  of life. We do this by helping  organizations to optimize their risk-based decisions and enabling consumers to  understand and manage their personal information. Because when people have  access to more complete and multidimensional information, they can make more informed  decisions and achieve great things.  We are an equal opportunity employer  and all qualified applicants will receive consideration for employment without  regard to race, color, religion, sex, national origin, disability status,  protected veteran status, or any other characteristic protected by law.#LI-ET1"}