{"jobID": "2812806405", "jobLocation": "Lubbock_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lubbockheart.com", "Headquarters": "Lubbock, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "GENERAL SUMMARY: The Data Analyst serves in a key support role to the Business Analyst and CFO being a liaison between the financial and clinical operations of the Hospital and Physician Clinics. This position requires the ability to gather, analyze and communicate data to the various leaders of the organization either directly or through the Business Analyst or CFO. Skills in data mining and the assembly and interpretation of the data are essential. ESSENTIAL FUNCTIONS: Explore and Analyze datasets with tools like Excel  Visualize data insights and communicate findings to others across the organization  Develop and generate automated daily, weekly and monthly reports that are relevant to the operations and processes of the organization.  Analyze business, financial and clinical data producing accurate results  Apply deductive reasoning to the information gathered  Perform routine and special projects as needed to support the operations of the organization. Assist in developing operational plans and budgets supporting the organization's leadership. Perform budget analysis, tracking and reporting to leadership with the intent of improving financial performance.MINIMUM KNOWLEDGE AND SKILLS REQUIRED: Know the definitions of fundamental computer terms related to applications software and desktop PC's Know how to open, read, and respond to email Know how to manage electronic files Know how to print electronic documents and reports Knowledge of electronic file management  Advanced analytical skills utilizing Excel, Access and similar programs  Possess the ability to communicate information in a manner that is understood by others  Must be self-motivated and able to work independently  Understanding of basic statistics and how to apply them  Ability to work with others to understand their information needs and how to best obtain the desired reporting results. MINIMUM EDUCATION AND EXPERIENCE REQUIRED: Bachelor's degree in a business-related field, computer science or data analysis 3 - 5 years of experience in financial reporting and/or data mining and analysis  Advanced skills in Excel and other database programs. Experience in a healthcare setting is preferred but not required.LICENSURE AND CERTIFICATION: No specific requirements but certification in Excel or other programs will be usefulENVIRONMENTAL AND PHYSICAL REQUIREMENTS: Works in temperature controlled environment. Must to able to read, write and speak English fluently, have cognitive skills for math, reading, filing and sterile technique skills. Vision for near, mid-range, far and accommodation. Hearing for low, medium, and high pitch. Communication skills to deal well with employees, patients, families and physicians. Requires physical ability for standing, sitting, crouching, kneeling, frequent walking, reaching above head and below waist.  Risks include exposure to blood and body fluids (high), contact with laser and chemicals, lifting of 30-50 pounds, and exposure to infectious disease."}