{"jobID": "2768417380", "jobLocation": "Washington_DC", "jobTitle": "Human Capital Analytics Consultant", "companyRating": "3.7", "companyInfo": {"Website": "www.fanniemae.com", "Headquarters": "Washington, DC", "Size": "5001 to 10000 employees", "Founded": " 1938", "Type": " Company - Public (FNMA) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Freddie Mac"}, "estimatedSalary": "94000", "jobDescription": "THE COMPANYAre you interested in helping solve today's most critical housing challenges? In simplest terms, Fannie Mae serves the people who house America. We work at the heart of housing by providing reliable, affordable mortgage financing in all markets at all times, buying loans that banks and other lenders originate, so they can fund new loans. This gives more people the opportunity to buy, refinance, or rent homes and apartments. Creating these opportunities is what drives thepeople who work at Fannie Mae.For more information about Fannie Mae, visit www.fanniemae.com/progress.JOB INFORMATIONThe Human Capital Analytics Consultant contributes to the organization's success by collecting and analyzing human capital and HR data and metrics to identify important workforce trends and demonstrate the implications of these trends on the business. This is a high-impact, key contributor position responsible for consulting with the business and/or HR COEs to analyze workforce data and insights, particularly as it relates to workforce planning, succession planning, recruiting, diversity/EEO, and talent management. This role is responsible for ensuring the data is accurate and for translating it in a clear, concise, and business-relevant manner to key business stakeholders.KEY JOB FUNCTIONSLeverage multiple data sources and tools to produce actionable metrics that drive strategic decision making. Work proactively and independently with business and/or HR COE customers to perform analysis of relevant workforce metrics, uncover and interpret trends in data, and produce substantiated recommendation presentations. Conduct in person and Webex training to support analytics products and produce relevant training documentation. Investigate new methods of improving analytics service delivery while ensuring compliance with governance standards. Conduct benchmarking analysis by tracking of progress of business and/or HR COE customers metrics against benchmarks. Conduct research, design, and execute studies to analyze special workforce issues for internal business clients and HR COE Leadership. Provide ad-hoc data analysis as required.#LI-VN1EDUCATIONBachelor's Degree or equivalentMINIMUM EXPERIENCE4+ years of related experienceSPECIALIZED KNOWLEDGE AND SKILLSPrior experience working in a human capital analytics/insights role required. 2+ years of experience using Tableau is required. Ability to successfully partner across multiple groups. Understanding of descriptive and inferential statistics techniques. Highly consultative and able to work closely with internal business customers effectively in a fast paced, changing environment. Ability to problem solve and present findings to multiple levels of the organization. Knowledge of R and/or Python is a plus. Knowledge of Oracle HCM Cloud is a plus.EMPLOYMENTAs a condition of employment with Fannie Mae, any successful job applicant will be required to pass a pre-employment drug screen and to successfully complete a background investigation.Fannie Mae is an Equal Opportunity Employer."}