{"jobID": "2729376214", "jobLocation": "Chicago_IL", "jobTitle": "Applied Data Scientist, Commercial", "companyRating": "4.6", "companyInfo": {"Website": "www.civisanalytics.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "About the Company Are you interested in using data science to solve new and challenging problems in innovative ways like helping a green energy startup find new areas of growth, building a resource optimization solution for a healthcare provider network, or shaping the product and engagement strategy for a large Fortune 500 company? Civis Analytics is looking for an Applied Data Scientist to join our commercial ADS practice in Chicago and help us solve some of the most challenging and interesting questions facing businesses today.  Civis Analytics helps businesses use data to gain a competitive advantage in how they identify, attract, and engage loyal customers and employees. With a powerful combination of best-in-class proprietary data, cutting-edge software solutions, and an interdisciplinary team of data scientists, developers, and survey science experts, Civis works with Fortune 500 companies and the countrys largest nonprofits to make data-driven decision-making essential to how the worlds best companies do business.  Civis embraces the individuality of our employees and we celebrate each other's differences. Our products, services, and culture benefit from and thrive on the unique perspectives brought by each person in our Civis community. We're proud to be an equal opportunity workplace, and we are committed to equal employment opportunity regardless of race, age, sex, color, ancestry, religion, national origin, sexual orientation, gender identity, citizenship, marital status, disability, or Veteran status. If you have a disability or special need that requires accommodation, please let us know. About the Role The Applied Data Science (ADS) team is the solutions and advisory arm of Civis Analytics, and works closely with organizations to help solve their toughest challenges with data science. This role of Applied Data Scientist will support clients in our commercial verticals specifically, and report to an Applied Data Science Manager.  Civis has opportunities for applicants who are seasoned professionals, brilliant newcomers, or anywhere in between offering competitive compensation and benefits packages. We are looking for detail-oriented individuals from diverse backgrounds, with demonstrated quantitative and problem-solving skills. We especially value self-starters, quick learners, and those with the ability to work well in small teams. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States. ResponsibilitiesAn Applied Data Scientist is responsible for the end-to-end execution of client engagements utilizing data science, which includes:Unifying large 1st- and 3rd-party datasets and building predictive modelsDeriving clear, actionable, and timely insights from analysesCreating client-ready materials and solutions for stakeholders of varying technical experience or familiarity with methodsWorking with cross-functional teams of data scientists and software engineers where necessary to create and implement solutionsOther job responsibilities of an Applied Data Scientist include:Creatively identifying opportunities in the solution delivery process for scalable applications, and collaborating with other teams to further construct these toolsMaintaining a continuous and independent education of cutting-edge statistical techniques and programming languagesTravel requirements: QualificationsBachelors degree in an analytical subject (statistics, math, economics, physics, engineering, business, political or social science, computer science, etc.)Proven affinity for and experience working with large or messy data setsSQL experience a plusExperience with statistical programming languages (R, Python, etc.) and proven ability to work pragmatically with statistical conceptsExperience with presentation or data visualization software, such as Microsoft PPT, Tableau, Shiny, etc.Excellent interpersonal and communication skillsPreferred QualificationsPractical understanding of and experience with predictive analytics, machine learning, and/or causal inferenceFamiliarity with software development tools and practices (Git, code review, etc.)"}