{"jobID": "2725783460", "jobLocation": "San_Francisco_CA", "jobTitle": "Site Director", "companyRating": null, "companyInfo": {"Website": "www.collegetrack.org", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 1997", "Type": " Nonprofit Organization", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Site Director - San Francisco  ​  About College Track  ​  College Track is a national college completion program that empowers students from underserved communities to graduate from college. From the summer before 9th grade through college graduation, our 10-year program removes the barriers that prevent students from earning their college degree by providing them with comprehensive academic support, leadership training, financial and college advising, and scholarships. We teach them the skills necessary to succeed in college and beyond. In four years, a College Track student receives support equivalent to one extra year of high school.  College Track started in 1997 with a cohort of 25 students in East Palo Alto. Today, we serve over 2,400 high school and college students in East Palo Alto, Oakland, San Francisco, New Orleans, Colorado, Los Angeles and Sacramento. By 2020, we will double the number of students we serve and produce nearly 1,000 college graduates. Last year, 96% of our high school seniors were accepted to four-year colleges and our college graduation rate is 2.5 times the national average for low-income students.  Our Commitment  From the summer before ninth grade through college graduation, our 10-year program removes barriers that prevent students from earning their college degree by providing them with comprehensive academic support, leadership training, financial and college advising, and scholarships. We teach them the skills necessary to succeed in college and beyond.  Our Values  At College Track, our values drive the way we do our work, and we look for individuals who share our passion. We blend an entrepreneurial spirit with our nonprofit roots, cultivating a dynamic culture where everyone's contributions are valued and encouraged.  ​ COMMITMENT: We have an unwavering belief in our students.PASSION: We are dedicated to changing our nation’s college completion story.JOY: We create environments rich with smiles and laughter.AUTHENTICITY: We believe relationships matter.EXCELLENCE: Our students deserve nothing but the best. Position Overview  The Site Director is the inspiring leader who sets a powerful vision for student achievement and is responsible for ensuring that at least 90% of students matriculate to a four-year college and 70% graduate from college within six years. S/he leads a team of full time and part time employees and builds and maintains the positive presence of College Track in the local community.  ​  Primary Responsibilities Include: Site Vision and Culture: Set a powerful vision for student achievement; inspire the commitment of others towards the shared vision, and ensure all decisions are aligned to and support the vision. Build a strong and enduring site culture based on mission, vision and organization’s values.Individual Student Planning and Monitoring: Work with program directors to assess student data continuously and ensure that students are on track to graduate from high school and thrive in four-year universities. Focus relentlessly on delivering outcomes despite obstacles, ensuring students graduate from high school and receive a college degree.Staff Management: Recruit, lead, manage and develop a high-performing site team of full-time and part-time employees (paid and volunteer) to ensure the overall success of students. Build a collaborative team of individuals committed to achieving excellence and meeting site goals.School and Community Partnerships: Develop strong and formalized partnerships with community based organizations, schools and districts that result in additional resources for our students and improvements to our program model. Keep abreast of emerging trends and practices within the education landscape and community, and be active in the educational and community landscape.Fundraising and Development: Work in collaboration with the College Track development team, as the external leader of the site, to execute development activities that support long-term sustainability. Skills & Experience Required Minimum of 5-7 years of teaching and/or supporting students to excel academically; history of driving significant gains in student achievementLeads and inspires others under a shared vision of excellenceBuilds relationships and communicates in ways that foster trust, value differences and further College Track’s missionProven track record in successfully recruiting, hiring, leading and developing people and teams. Creates the conditions for staff to learn, grow and do their work with ever increasing excellenceManages people, project and oneself to achieve excellent results and expand organizational impactHigh degree of flexibility and adaptability; can work within and thrive in an ambitious, fast-moving environment, while also driving toward clarity and solutionUnwavering belief in economic, racial and social justice; makes all decisions through the lens of what is best for the students and families we serveMinimum 4-year college degree (Masters Degree preferred) Compensation & Benefits  Salary is competitive and commensurate with experience.  College Track is an equal opportunity employer fully committed to achieving a diverse workforce. College Track does not discriminate on the basis of race, age, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, or gender identity or expression."}