{"jobID": "2820741197", "jobLocation": "Chicago_IL", "jobTitle": "Senior Analyst, Data and DMP Client Strategy", "companyRating": null, "companyInfo": {"Website": "www.sparkfoundryww.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionWHY YOU WANT TO WORK AT SPARK FOUNDRY Lets be honest in this industry, sometimes we complicate things that should be simple. Here is the bottom line: we want YOU to join us if you are truly passionate about guiding marketers on how to best connect their brands with people. It doesnt get much simpler than that.  At Spark Foundry, we have a unique approach and provide the support to help you do this. In fact, our approach is built on creating the space for ideas that lead to smart work, and Spark Foundry is built to celebrate and develop YOUR ideas.Job DescriptionThe Senior Analyst at Spark Foundry is an excellent opportunity for someone looking to further advance their skillset in the field of Data-driven Digital Marketing. This will be a data-focused role that involves working with clients on data strategy, data onboarding and data insights as well as internally with operations, analysts and client teams. The Senior Analyst is responsible for discussing data strategies and DMP implementations with clients, leading data targeting and optimization strategies across assigned accounts and working internally with the Programmatic buying teams to make sure the data strategies are implemented properly.  This is a client-facing role and you will be expected to communicate technical concepts to your assigned client(s) and to ensure account success and customer satisfaction. You will also be expected to learn the capabilities of multiple DSP and DMP platforms, attend training sessions with numerous vendors and communicate internally to their strengths and weaknesses.  This is a unique opportunity at Spark Foundry with the potential to help build out a team/department of data architects. SPECIFIC RESPONSIBILITIES • Manage data strategy for programmatic advertising clients and communicate strategies/recommendations to clients using a consultative approach. Work with Data Management Platform (DMP) partners and manage day-to-day onboarding of client data.Leverage data to assess, diagnose and prescribe campaign optimizations to exceed client expectations.Extract insights from data and effectively communicate to clients in relation to their goals and objectives. Share results from audience analytics reports with clients when available.Actively attend training sessions with various vendors and inquire about data and platform capabilities.Assist in the development of client-facing materials including data strategy presentations and audience performance reports.Develop a strong overall understanding of the clients business objective and demonstrate through campaign results how data targeting can help them achieve their business goals.Participate in team meetings and knowledge sessions to share new strategies for targeting campaigns and to provide feedback on platform and data performance.QualificationsREQUIRED SKILLS • The ideal candidate will have at least 1-3 years prior digital advertising experience in a client services capacity with hands-on knowledge of the DSP/DMP landscape, as well as a passion for data-driven advertising and insights.Experience managing Online Display, Video and Mobile campaignsUnderstanding and experience with DSPs, DMPs, 3rd Party data, pixels and Ad ServersFamiliarity with customer acquisition goals and optimizing to CPA, CTR, Completion Rate, etc.Strong analytical skills, technical know-how and strategic thinkingExcellent interpersonal, oral, and written communications skillsStrong attention to detail and ability to follow projects through to completionAbility to communicate technical concepts to a non-technical audienceProficiency in Microsoft Office solutionsHighly organized with attention to detailAdditional InformationWHO WE ARE Throughout our rich history, weve taken pride in our ongoing legacy of and commitment to constant evolution. Its in our DNA to evolve.  By melding the spirit of a startup and the soul of a powerhouse across our business, we aim to bring modern heat to brands the kind of heat that arises at the intersection of startup and powerhouse; of data and content; of art and science; of old and new.  Energy and innovation fuels our startup spirit, while the unrivaled marketplace clout, exclusive partnerships, and global practice capabilities we have at our disposal as a full-service Publicis Media agency deliver our powerhouse soul for our clients.  We hope youll take a few moments to learn more about us, and to begin thinking about how we might put the power of plus to work for you (http://www.sparkfoundryww.com/).  Spark Foundry is an Equal Opportunity Employer."}