{"jobID": "2832700961", "jobLocation": "Paris_TX", "jobTitle": "Analyste Risques/Quant/Data SG 29 Haussmann-(H/F)", "companyRating": null, "companyInfo": {"Website": "www.societegenerale.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1864", "Type": " Company - Public (GLE) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " BNP Paribas, Natixis, Calyon Securities USA"}, "estimatedSalary": null, "jobDescription": " Environment  SG 29 Haussmann (SG 29H) est la société de gestion de PRIV/FRA. Pour des raisons réglementaires, c'est une entité juridique distincte de SGPM, constituée sous forme de SAS, dont les actions sont détenues par l'actionnaire unique SG.  Prestataire de service d'investissement, son champ d'activité est celui de la gestion pour compte de tiers, sous régulation de l'AMF. Elle a obtenu son 1er agrément en 2007, celui-ci a été complété au fil du temps. SG 29 Haussmann est agréée pour la gestion des fonds UCITS, pour la gestion des FIA, elle a obtenu l'extension nécessaire pour l'utilisation des instruments financiers complexes, ainsi que pour la Réception Transmission d'Ordre.  La société de gestion intervient exclusivement au profit de la clientèle privée du groupe Société Générale. SG 29 Haussmann est logée au sein du département de l'offre dans l'organisation Banque Privée France.  Ses salariés sont mis disposition par le groupe SG, ils ont signé un contrat de détachement.  SG 29 Haussmann est organisé comme un pur front-office, les fonctions connexes de son activité (middle, back-office, juridique, etc.) ayant été sous-traitées dans la banque. L'effectif de la société de gestion (agents de la Société Générale détachés auprès de la SdG) se compose de 30 personnes environ.  Mission  Ce poste s'inscrit dans le cadre de l'activité de la Société de gestion de portefeuilles SG 29 HAUSSMANN (Société Générale Private Banking France).  L'analyste travaille au sein de l'équipe risques/quant/data, en coordination avec l'équipe de conformité et au service de la gestion. Il a pour mission de participer (i) au développement et l'exécution des contrôles de risque, (ii) au développement et la mise disposition de la gestion d'outils d'aide la décision ainsi (iii) qu'au développement et l'exploitation de solutions d'analyse pour valoriser le patrimoine de données de la société de gestion. Missions et objectifs : Dans un contexte d'industrialisation de l'activité, les missions et objectifs du poste se déclinent comme suit : l'élaboration et la mise en œuvre d'un service de restitution et d'analyses de performances en transversal pour l'ensemble de SGPB ;la maintenance et développement d'outils de contrôle et de reporting SG 29H ;le développement et la mise en œuvre d'outils d'aide la décision d'investissement pour le compte de SG 29H ;la participation la mise en œuvre et la réalisation de contrôles de 1er niveau, comme le contrôle des valeurs liquidatives et de ses composantes, la production et le contrôle des analyses de risques, VaR et stress tests, et plus généralement, participation l'exécution des contrôles du dispositif de contrôle des risques pour le compte de SG 29H ;la production récurrente de reportings réglementaires (reporting AIFM par ex.) pour le compte de SG 29H ;la production de reportings automatisés pour le compte de SG 29H ;le support aux réponses des demandes ad-hoc du Directeur Général, du COO, du RCCI et de l'équipe de gestion de SG 29H ; Parmi ses responsabilités, le/la titulaire du poste s'engage au strict respect des Politiques et Procédures SG définies localement, au niveau de PRIV et du Groupe Société Générale, afin de maîtriser les risques opérationnels : Respect des procédures SG et de la réglementation au niveau localRespect du code de conduite SGRespect des règles internes liées la maîtrise du risque opérationnel Il/elle devra porter une attention particulière son exposition aux risques opérationnels dans ses activités quotidiennes. Il/elle devra solliciter son management et/ou le gestionnaire des risques opérationnels de son entité en cas de doute.  Profile  Bac+5  3 5 ans d'expérience professionnelle,  Anglais courant VBA Bloomberg  Instruments financiers : pricing et risques de marché  Analyse et visualisation de données  Développement tactique/commando en Python et VBA  Techniques de développement logiciel  déalement sur un poste similaire"}