{"jobID": "2728430699", "jobLocation": "Pasadena_CA", "jobTitle": "Staff Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.caltech.edu", "Headquarters": "Pasadena, CA", "Size": "1001 to 5000 employees", "Founded": " 1891", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Staff Scientist Job Category  Fulltime Term ExemptOvertimeEligible  Exempt Benefits Eligible  Benefit BasedApply NowCaltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.Job SummarySeeking a motivated individual to work as part of the Voorhees laboratory to carry out structural and functional studies on protein biosynthesis and quality control. The work includes all aspects of molecular and structural biology including cryo-electron microscopy, cloning, protein expression, and protein biochemistry.Job Duties– Assist with general laboratory organization and set-up.  – Assist with guiding junior lab members in basic molecular biology techniques.  – Cloning and testing of various protein expression constructs.  – Purification and analysis of single proteins and protein complexes.  – Functional experiments in mammalian cells and in vitro translation systems.  – Assist with electron microscopy grid preparation and data collection.  – A highly motivated and qualified candidate may develop independent projects.  – Other duties as assigned.Basic Qualifications– Bachelor degree in science is required with educational emphasis in chemistry or biology.  – Must have at least four years practical experience in basic molecular biology.  – The ability to learn new skills related to all aspects of cryo-electron microscopy.  – Ability to work as part of a team.  – Excellent organization and communication skills are required.Preferred Qualifications– PhD in molecular or structural biology.  – Experience with mammalian tissue culture.  – Protein purification experience.  – Mentoring and/or lab management experience.Required Documents– Resume"}