{"jobID": "2810109645", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist, People Analytics", "companyRating": "4.4", "companyInfo": {"Website": "www.linkedin.com", "Headquarters": "Mountain View, CA", "Size": "5001 to 10000 employees", "Founded": " 2003", "Type": " Company - Public (LNKD) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " XING AG, Monster Worldwide"}, "estimatedSalary": "149000", "jobDescription": " Data Scientist, People Analytics  We are looking for a Data Scientist to join our global Talent Insights Data team. This individual will develop tools that enable our employees to make better, faster talent decisions. This person will interact closely with various stakeholders to engage on concurrent projects of varying size, duration and complexity. This role provides some of the most interesting data, focused on the world's workforce and how it relates to our employees.  We are looking for a team member who's interested in building out the next generation of people analytics function here at LinkedIn. We require high quality decision making to effectively solve business problems and strong communication skills. Our ideal candidate is someone who can work hard and have fun. ResponsibilitiesData InfrastructureWork with HRIT/Engineering teams to ensure data pipelines and datasets are built to scale from large-scale datasets to help support analytics and self-service reporting solutions.Working in Hadoop, Spark and PostgreSQLGuide user-focused improvements in the collection of unstructured data.AnalysesBuilding and refining models (attrition, learning suggestions, etc)Conduct deep dives to identify areas of opportunity to ensure we achieve our talent objectives and be able to translate findings into succinct, actionable insights.Education to Team MembersCreate an environment of learning by hosting technical training sessions for Data teamProvide expert advice and education to others in HRYou'll break down highly, highly complex problems and drive analytical analyses alongside the best and brightest in Talent Analytics.You'll utilize NLP, ML, DL or similar methodologies to their fullest potential go for it!Create and share code using best practices from your prior lives to ensure version control, efficiency, and scalability.You'll deliver WORLD CLASS data solutions in a highly autonomous environment - where you'll learn everyday with no shortage of problems to solve. Basic Qualifications 3+ years of experience working with quantitative analysesBA/BS in Computer Science, Math, Physics, Engineering, Statistics or other related technical field3+ years of experience in SQL or other programming languages3+ years' experience with distributed computing (Hive/Hadoop)3+ years of Development experience in any scripting language (PHP, Python, Perl, etc.)3+ years of experience manipulating data sets through statistical software (ex. R, SAS) or other methods Preferred Qualifications Experience with creating simple, digestible visualizations for all types of stakeholders from senior executives to individual contributors with Tableau, Javascript (D3, Highcharts, etc), or other visualization toolExperience with text analytics and be able to apply NLP techniques in partnership with other team members to unstructured datasets.Experience in Talent Analytics or HRYou go above and beyond and willing to do anything for the team. You understand the power of 'WE' and not 'I'You're someone who can share ideas, challenge the status quo and love data - no exceptions"}