{"jobID": "2828726898", "jobLocation": "Burnet_TX", "jobTitle": "Senior New Product Scientist", "companyRating": null, "companyInfo": {"Website": "www.entegris.com", "Headquarters": "Billerica, MA", "Size": "1001 to 5000 employees", "Founded": " 1966", "Type": " Company - Public (ENTG) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pall, GLOBALFOUNDRIES, TSMC"}, "estimatedSalary": null, "jobDescription": "Entegris At Entegris we are committed to providing equal opportunity to all employees and applicants. Our policy is to recruit, hire, train, and reward employees for their individual abilities, achievements and experience without regard to race, color, religion, sexual orientation, age, national origin, disability, marital or military status.  US-TX-Burnet Job ID 2018-5373 Category R&D; Company Overview and Values Why work at Entegris?  Lead. Inspire. Innovate. Define Your Future.  Not everyone who works for a global company shares the same background, experiences and perspectives. We leverage the differences of our employees to bring new ideas to the table. Every employee throughout the company is encouraged to share input on projects and initiatives. Our decision making process is truly a collaborative effort as we realize there are leaders at every level of the organization. We put our values at the core of how we operate as an organization - not just when it's convenient, but in a lasting and meaningful way. We want the time and energy you spend here to have a positive impact on your life inside and outside of the office. Entegris is a values-driven culture and our employees rally around our core PACE values:  PeopleAccountabilityCreativityExcellenceThe Role In this exciting role, you will be responsible for the development of precursors for Chemical Vapor Deposition (CVD) and Atomic Layer Deposition (ALD) applications. Your hands-on experience in synthesizing and handling of air and moisture-sensitive organometallic compounds will be integral to success. Bring your knack to build rapport across cross-functional teams and desire to serve as a mentor to junior technical personnel to further enhance our talented team. If you thrive in a highly-collaborative, fast-paced environment this may be the perfect role for you! In this role you willIndependently and in concert with technical staff, lead the synthesis and purification of air- and moisture-sensitive organometallic precursors for CVD/ALD applications;Maintain / own lab equipment required to perform the job (i.e. glove boxes, etc.);Conduct Thermal Stability testing of promising compounds;Coordinate the analysis of synthesized compounds, as needed (NMR, STA);Present technical data within the research and development group and to customers, as needed;Document all experiments, procedures and results thoroughly;Fulfill R&D; sample orders involving the synthesis, purification, container filling and shipment of air-sensitive organometallic compounds up to 5 kg quantities.Traits we believe make a strong candidateMS or PhD (preferred) in Chemistry with >5 years of industrial experience;Demonstrated academic or industry experience in organometallic syntheses;Experience in handling air- and moisture-sensitive chemicals is required;Experience in chemical analysis is preferred (NMR, STA, GC-MS, ICP-MS);Experience in high-purity materials handling and methods are required.Your success will be measured byCreatively develop solution for new product synthesis and purification;Demonstrated results in continuous improvement on the global level;Ability to influence leadership at all levels;Technical Expertise in executing New Product Development;Proactively identify concerns and recommend solutions.What we offer: Our total rewards package goes above and beyond just a paycheck. Whether you're looking to build your career, improve your health, or protect your wealth, we offer generous benefits to help you achieve your goals. Very Competitive total compensation plans.A 401(K) plan to help you plan for your future with an impressive employer match that's all yours- no vesting!Great health, dental and vision insurance packages to fit your needs to ensure you're happy and healthy.A progressive PTO policy that empowers our employees to take the time they need to recharge! #LI-JL1PI103100794"}