{"jobID": "2745574392", "jobLocation": "South_Plainfield_NJ", "jobTitle": "Associate Scientist I/II, RS", "companyRating": null, "companyInfo": {"Website": "www.genewiz.com", "Headquarters": "South Plainfield, NJ", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are seeking an Associate Scientist I to join our Molecular Genetics Regulatory Services team.  Title: Associate Scientist I/II  Location: South Plainfield, NJ Job Description:Ability to independently carry out PCR and sequencing, Mutation Analysis, 16S sequencing, DNA preparation, Plasmid sequencing, cDNA verification, qPCR and related molecular biology projectsRelated tasks include but are not limited to: PCR amplification, post-reaction preparations, sequencing data analysis, qPCR, extraction of DNA and RNA, DNA transformation, restriction digest analysis, at the GLP-level or GMP-level.Communicate with customers by phone and e-mail in a friendly and professional mannerUtilize Lasergene and similar DNA analysis software for analysis and reportingAssist with troubleshooting effortsFollow SOPs and guidance of supervisorsAdditional tasks as assigned by supervisorQualifications:Bachelor’s degree in Life Sciences is required2+ years of previous lab experience is preferredGLP and/or GMP experienced is highly desirableKnowledge of Molecular Biology techniques requiredCustomer service experience is highly preferredExcellent interpersonal skills; both verbal and written are essentialExtreme attention to detailClosely follow Standard Operating Protocol (SOP) GENEWIZ is a leading global genomics service company and trusted provider for DNA sequencing, gene synthesis, molecular biology, next generation sequencing, bioinformatics, and GLP regulatory services. Our customers depend on GENEWIZ to achieve results in a rapid, cost-effective manner through specialized expertise and customizable, scalable services.​  GENEWIZ employees have a winning attitude and champion innovation, teamwork and accountability through a results-oriented, customer-centric, and fun culture. A generous benefits package, various growth opportunities through learning and development programs, and working with and learning from the best in the industry are just a few of the perks that a GENEWIZ employee receives.  To review all of our open positions and to apply, please visit the Careers page at www.genewiz.com.  Connect with us on LinkedIn and Twitter: @GENEWIZCareers"}