{"jobID": "2823728766", "jobLocation": "Austin_TX", "jobTitle": "Enterprise Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kendrascott.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "ENTERPRISE DATA ANALYST HOME OFFICE AUSTIN, TEXASAbout Kendra Scott: We are a fun, talented and driven team dedicated to providing our customers with gorgeous products and a WOW! experience. Family, fashion and philanthropy are at the core of our company and though we move at a very fast pace, we are committed to maintaining a family-oriented work environment and giving back to our community. A passion for great design, dedication to innovation and a strong social media presence are our building blocks for creating a unique and engaging lifestyle brand across all channels, including retail stores, wholesale accounts and e-commerce. Our headquarters are located in the heart of Austin, Texas, and we embrace the unique vibe and energy of our hometown as an inspiration for our brand and company culture. Position Overview: Kendra Scott seeks to hire an Enterprise Data Analyst to help build and maintain our data ecosystem and support the fast-growing business with the implementation of a multiple new operational, data warehouse and business intelligence systems. Our ideal candidate must be highly organized, detail oriented, an amazing communicator, and great at working with cross-functional teams on multiple projects.  The ideal candidate for this position will have a very strong SQL background, deep analytical skills, and experience working with end users. Tableau knowledge is required. The ability to do ad-hoc SQL to research data questions, identify root causes, and interact closely with peers and the business data analysts is essential. Responsibilities:Troubleshoot ETL and integration system errors, engage in cleanup and reprocessingDesign and support a robust ETL platform in a Pentaho environmentDesign, build and support data warehouse schema; contribute to the design of tactical and strategic data models when necessaryDesign and develop complex analytical reports, including trend and dashboard reportsBuild, manage and support Data Warehouse, ETL middleware and reporting interfaces from multiple internal and external systems; support and maintain data feeds and data quality Work with internal team and vendors on data analysis and troubleshooting issuesAbility to assist in deployment, administration, tuning, monitoring, performance and scalability of database technologies including security, backup, recovery, and archival concepts and proceduresEnable business decision making by analyzing and combining data across channelsWork with internal team and vendors on data analysis and troubleshooting issuesParticipate in meetings with multiple business and IT stakeholders on a regular basis and understand their data needs as it pertains to analyzing business performance and KPI'sPropose and prototype BI reporting solutions that are holistic (span multiple departments or Enterprise wide), simple, creative, scalable and reliableMentor the reporting team on the industry standards, best practices and optimal solutionsSkills:Experience with relational and nonrelational databasesExperience interacting with canned and custom APIs and external systemsExpert with Business Intelligence tools (Tableau, Pentaho, etc.) and Business Intelligence systems such as Oracle Retail Insights (Oracle Merchandise Insights, Oracle Customer Insights) or Manhattan Associates SCI (Supply Chain Intelligence)Expert level knowledge of data integration and familiarity with common data integration challenges like converting data types, handling errors, and translating between different technology stacksExperience with Dell Boomi middlewareExpert with star and snowflake data schemasExpert SQL and Google Analytics knowledgeAdvanced Data ETL using Pentaho Data IntegrationProficient in use of REST&SOAP; web servicesWorking knowledge of JavaScript, HTML, CSS, Linux/RedHat; familiarity with JSON&XML;GIT revision control experience preferredOur Ideal Candidate will have:BA/BS in Computer Science/Information Systems or equivalent5+ years of experience using SQL3-5 years of technical experience designing and building databasesFull-stack conversant; full-stack development knowledge or experience a plusExperience in a fast-paced Retail omnichannel environmentExcellent analytical, mathematical, and creative problem-solving skillsExcellent communication and presentation skillsHighly self-motivated and directed, proactively reporting on status and tasks. Ability to effectively prioritize and execute tasks while under pressureAdaptable. The role requires a willingness to take on tasks outside of a narrowly defined role, and ideally a desire to be multi-skilledExperience with fast-moving and growing organizations, and/or experience working in retail organizations understanding the priorities and nature of the services provided"}