{"jobID": "2758939079", "jobLocation": "Detroit_MI", "jobTitle": "Advanced Analytics Consultant", "companyRating": "4.4", "companyInfo": {"Website": "www.slalom.com", "Headquarters": "Seattle, WA", "Size": "5001 to 10000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Deloitte, Avanade"}, "estimatedSalary": "93000", "jobDescription": "Advanced Analytics Consultant, Information Management & Analytics Slalom is a purpose-driven consulting firm that helps companies solve business problems and build for the future, with solutions spanning business advisory, customer experience, technology, and analytics. We partner with companies to push the boundaries of what’s possible—together.  Founded in 2001 and headquartered in Seattle, WA, Slalom has organically grown to more than 5,000 employees. We were named one of Fortune’s 100 Best Companies to Work For in 2016, 2017 and 2018, and are regularly recognized by our employees as a best place to work. You can find us in 25 cities across the U.S., U.K., and Canada.  Slalom Detroit is looking for an Advanced Analytics Consultant who can both advise and deliver for clients looking to solve their most critical business challenges. This individual will be an integral part of Portland’s Information Management and Analytics Practice and, in addition to working with clients, collaborate closely with members of the Slalom team who are focused on data visualization, data architecture and engineering, data science, data strategy, and process. Responsibilities: • Deliver transformative solutions to clients that are aligned to industry best practices and provide thought leadership in data space.  • Exceptional analytical, conceptual, and problem-solving abilities.  • Experience with quantitative analysis techniques (e.g., predictive modeling, clustering, regression).  • Collaborate and enable business stakeholders with self-service analytics.  • Highly self-motivated to deliver both independently and with strong team collaboration.  • Ability to creatively take on new challenges and work outside comfort zone.  • Strong written and oral communications along with presentation and interpersonal skills.  • Conduct and support white-boarding sessions, workshops, design sessions, and project meetings as needed, playing a key role in client relations.  • Strong aptitude for learning new technologies and analytics techniques. Qualifications: • Quantitative background with 3+ years of experience using data to solve problems and answer questions.  • Advanced knowledge of SQL for the use of data extraction, cleansing, and analysis.  • Experience with Python, R, SAS, or other advanced analytics platform.  • Knowledge of relational and dimensional database structures, theories, principles, and practices.  • Familiarity with advanced analytics techniques for unstructured data is a plus.  • Graduate degree in a technical field (computer science, applied mathematics, statistics, etc.).  • Experience using data visualization tools such as Tableau, Qlik, or Power BI is a plus."}