{"jobID": "2625283183", "jobLocation": "Mountain_View_CA", "jobTitle": "Sales Development Representative", "companyRating": "4.8", "companyInfo": {"Website": "www.lacework.com", "Headquarters": "Mountain View, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " RedLock, Symantec, Evident.io"}, "estimatedSalary": "75000", "jobDescription": " Lacework was founded to keep critical data and applications safe as organizations increasingly migrate workloads to the public cloud. Where traditional security tools and manual log analysis fail in these environments, Lacework gives security teams the automation, speed, and scale to protect cloud workloads at the pace of DevOps. Lacework Polygraph, our flagship product, monitors workloads, applications, processes, containers, machines, users and accounts to automatically surface anomalous behaviors out of billions of events per hour. Lacework provides unprecedented visibility, automates breach detection, delivers one-click investigation, and simplifies cloud compliance. Based in Mountain View CA, Lacework is funded by Sutter Hill Ventures.  The Sales Development Representative (SDR) is a critical function of the Lacework sales team and is responsible for generating leads and building new customer pipeline for a specified region. The SDR will initiate contact with new leads, follow-up on marketing activities, and move prospects through the discovery phases. At Lacework, we believe in promoting from within and our SDRs will have a clear growth path for transitioning into closing roles. Role Responsibilities:Generate new customer appointments by means of proactive outbound prospecting via phone, email, and social networking.Work directly with marketing to discover opportunities from leads and set appointments from those leads.Use of strong selling and influencing skills to set up qualified appointments.Understand the Lacework platform enough to provide high level introductions to prospects.Work closely with Account Executives and Regional Sales Managers to customize outreach efforts.Attend sales meetings, vendor training, and trade shows to keep current with technology.Diligently log, track, and maintain outbound activity in CRM.Role Experience & Qualifications:Four year college degree from an accredited institution.Excellent verbal and written communication, presentation, and relationship management skills.Must be able to communicate business and technical value to prospects at all levels of a customer organization.Prior experience in a startup environment.Highly motivated, driven and self-directed individual with grit.Knowledge of Salesforce.com and other sales enablement tools.Ability to manage time effectively and work independently. Lacework is an Equal Opportunity Employer. It is the policy of Lacework to provide equal employment opportunity to all persons, regardless of age, race, religion, color, national origin, sex, political affiliations, marital status, non-disqualifying physical or mental disability, age, sexual orientation, membership or non-membership in an employee organization, or on the basis of personal favoritism or other non-merit factors, except where otherwise provided by law."}