{"jobID": "2770578401", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst / Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.needtoimpeach.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SUMMARY: Need To Impeach is seeking a Data Analyst / Data Scientist to handle our data and analytics needs. Campaign and political experience is a big plus.  The staffer will work with our very rich dataset using Python and SQL/BigQuery to facilitate and drive the way we use data as an organization. The job main roles will be managing and executing our internal query needs and building data pipelines. Additionally, you are encouraged to bring insights and new ideas as to how we can best use the data. RESPONSIBILITIES:Run counts, queries, and apply models to our datasetsWork closely with the Data Director to apply Machine Learning models to our very big databaseIncorporate data and analytics into digital advocacy tools, planning, and implementationCoordinate data experiments and analysisDevelop accurate tracking systems for data collection online and offlineImplement reports and metrics as part of a robust data cultureDissect large datasets, synthesize results and present findings to leadershipWork with email and advertising teams to ensure data and analytics are managed appropriately across channels, ensuring lists and audiences are segmented accuratelyREQUIRED QUALIFICATIONS:Advanced skills in data extraction and manipulation, predictive analytics, and data modelingHigh proficiency in Python, SQL, and BigQuery, and Google Cloud PlatformStrong familiarity with the 2018 electoral landscapeRelated Bachelors degree or equivalent relevant experienceADDITIONAL QUALIFICATIONS:Pythons Pandas library, JavascriptClear, concise communication style with an easy-going attitudeExperience in producing easy-to-understand reports and ability to tell a story using numbersMust be organized and work quickly and accurately under deadlineMust be able to work professionally and effectively with staff at all levels of the organization as well as external contacts, constituents, and vendorsABOUT NEED TO IMPEACH: Need to Impeach is a national progressive movement dedicated to removing Donald Trump from power, fighting the Alt-Right agenda, holding the Establishment accountable and developing a progressive voice and policy framework that help American families, not just corporations and the wealthy. For more information, visit www.needtoimpeach.com."}