{"jobID": "2830364397", "jobLocation": "Ne_Jersey", "jobTitle": "Data Scientist II", "companyRating": null, "companyInfo": {"Website": "www.zurichna.com", "Headquarters": "Schaumburg, IL", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Public (ZURN) ", "Industry": " Insurance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Travelers, AIG"}, "estimatedSalary": null, "jobDescription": "Job Summary Zurich is currently looking for a Data Scientist II to  work out of the Predictive Analytics Center of Excellence in our North American  headquarters in Schaumburg, Illinois or Jersey City, New Jersey.  The Data Scientist II role is critical  to the success of Zurich and the Data Scientist team as the role blends  analytical problem solving, project management, and leadership: Leads  predictive analytics projects - this means leading a team of data scientists and  collaborating with our stakeholders to solve business challengesConducts  exploratory data analysis, model development, model monitoring, and benefit  estimationPartners with business stakeholders to  translate business objectives into clearly defined analytical projectsWorks with the business to develop and  implement a strategy on how to use the predictive model for most impactEstablishes and maintains collaborative  relationships throughout the organizationDemonstrates commitment to continuous  education and personal development on areas of technical expertise and share  knowledge with team members and business partners.Job QualificationsBasic Qualifications:High  School Diploma or Equivalent with 7 or more years of experience in  Computer Science, Statistics or Mathematics and experience transforming  data in the business analysis area OR Zurich  Certified Insurance Apprentice including an Associate Degree in Computer  Science, Statistics or Mathematics and 5 or more years of experience  transforming data in the business analysis area OR Bachelor’s  Degree in Computer Science, Statistics or Mathematics and 5 or more years  of experience transforming data in the business analysis area OR Master’s  Degree in Computer Science, Statistics or Mathematics and 3 or more years  of experience transforming data in the business analysis area OR Ph.D.  in Computer Science, Statistics or Mathematics and 0 or more years of  experience transforming data in the business analysis areaPreferred  Qualifications:Advanced  analytical and problem solving skillsAbility  to develop actionable solutions to business challengesAdvanced knowledge of statistical and  predictive modeling techniques such as machine learning, decision trees,  ensemble learning, probability networks, association rules, regularized  models, clustering, regression, GLMs, and neural networks and their  application to business decisionsDemonstrated  experience in one or more of the  above mentioned statistical and/or machine learning techniquesExperience  applying data transformation techniques such as exact and probabilistic  matching methods; fuzzy matching, text mining, and data reductionExperience  applying data transformation techniques such as exact and probabilistic  matching methods; fuzzy matching, text mining, and data reductionExperience with programming  and data mining tools such as R, Python, SAS, SQL, Hadoop, Hive, or PigExcellent  verbal and written communication skills, particularly possessing the  ability to share technical results and recommendations to audiences at varying  levels of analytic understandingAbility to  perform high-level work both independently and collaboratively as a  project member or leader on multiple projects.Coach and  provide technical advice and counsel within and outside operating unit.Additional Information Imagine working for a company that truly cares about their  employees, customers, stakeholders, and communities they serve. Imagine working  for a values-driven organization that has the ambition and desire to be the  best global insurance provider in the world. Zurich is that place where 55,000  employees across approximately 200 countries and territories are all focused on  helping people and helping companies protect what is truly most important to  them. We are a values-driven organization that takes pride in the work that we  do every day and we have the ambition to be the best global insurer in the  world.  EOE disability/vets  Zurich does not accept unsolicited resumes from search firms or  employment agencies. Any unsolicited resume will become the property of Zurich  American Insurance. If you are a preferred vendor, please use our Recruiting  Agency Portal for resume submission."}