{"jobID": "2738748440", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.sapientglobalmarkets.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture"}, "estimatedSalary": "123000", "jobDescription": " At Sapient Global Markets, we are quite literally on the front lines of the biggest issues facing the global markets leaders today – investment banks, asset management firms, wealth managers, oil and energy firms, and government and regulatory agencies. Driving transformation and leading change within these industries requires big thinkers who bring insight, knowledge, technical acumen and passion for innovation. We offer the opportunity to join a recognized leader in developing and delivering groundbreaking solutions for today’s dynamic global marketplace and an award-winning culture that fosters growth and leadership. KEY SKILLS, EXPERTISE The individual chosen for this position should have extensive knowledge and experience in the following areas:  · 5 years in data science domain, building prediction models in a variety of engagements  · Solid understanding of applied statistics, such as probability distributions, measures of dispersion and central tendency, hypothesis testing and statistical inferences.  · 3 yrs. experience with machine learning algorithms, such as k-NN, Naive Bayes, SVM, Random Forest, Linear Regression, ARIMA, Neural Nets, Deep learning, etc.  · Must be able to formulate an ML problem, analyze/explore/identify relevant data, apply various methods for feature modelling, and leverage suitable ML algorithms.  · Must be able to explain the logic and reasoning behind the ML models, and identify the best strategy, algorithm or techniques for a particular problem, and/or develops one if none already exist. Should be able to custom design new ensembles of existing algorithms  · Must be thoroughly hands-on and should be able to put theory into practice by writing code, building visualizations and fine-tuning existing algorithms.  · Experience with one or more data science toolkits, such as Azure ML, AWS ML, R, scikit-learn, Matlab, Rapidminer, SAS, etc.  · Understanding of data visualization patterns. Experience with one or more data visualization tool / library such as Tableau, R Shiny, Seaborn, etc.  · Excellent consulting skills, oral and written communication, presentation, and analytical skills. Should be able to guide and direct a team of junior data scientists and data analysts  · Ability to understand the business context, ask the right questions, articulate scope, approach and set right expectations with stakeholders for data science projects.  · Active involvement in thought leadership and data science competitions is a big plus. Examples include publications in reputed journals, participation in Hackathon and data science competitions such as Kaggle. ADDITIONAL/OPTIONAL SKILLS · Nice to have knowledge of Big Data platforms like Hadoop: Hive, Pig, Spark etc. and NoSQL DBs like MongoDB, Cassandra and HBase  · Nice to have Exposure to traditional BI/data warehousing EDUCATION: BSc/MSc in Mathematics/Statistics. Phd. Preferred in Mathematics / Statistics from a reputed University, formally educated in data science. About Global Markets Sapient Global Markets, a part of Publicis.Sapient, is a leading provider of services to today’s evolving financial and commodity markets. We provide a full range of capabilities to help our clients grow and enhance their businesses, create robust and transparent infrastructure, manage operating costs, and foster innovation throughout their organizations. We offer services across Advisory, Analytics, Technology, and Process, as well as unique methodologies in program management, technology development, and process outsourcing. Sapient Global Markets operates in key financial and commodity centers worldwide, as well as in large technology development and operations outsourcing centers. For more information, visit www.sapientglobalmarkets.com.  Sapient is a registered service mark of Sapient Corporation.  Reasonable accommodations will be made as necessary for the known physical or mental disability of an otherwise qualified applicant or employee unless doing so would impose an undue hardship on the operation of the Company’s business.  Sapient US is an Equal Opportunity / Affirmative Action employer. All qualified applicants to Sapient US will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.  *LI-GMNA"}