{"jobID": "2751061414", "jobLocation": "Madison_NJ", "jobTitle": "Biological Research Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.allergan.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1948", "Type": " Company - Public (AGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "Allergan plc (NYSE: AGN) is a bold, global pharmaceutical company and a leader in a new industry model - Growth Pharma. Allergan is focused on developing, manufacturing and commercializing branded pharmaceutical, device, biologic, surgical and regenerative medicine products for patients around the world.Allergan markets a portfolio of leading brands and best-in-class products for the central nervous system, eye care, medical aesthetics and dermatology, gastroenterology, women's health, urology and anti-infective therapeutic categories. With commercial operations in approximately 100 countries, Allergan is committed to working with physicians, healthcare providers and patients to deliver innovative and meaningful treatments that help people around the world live longer, healthier lives every day.Allergan is a company that will inspire you to aim high with your ambition. Where you can build bridges all over the world. Where you can power ideas that drive change. And where you will act fast and drive results for customers and patients. Power your future & join our bold team.Position OverviewUnder minimal supervision, the successful candidate for this position will contribute to projects aimed at pharmacological characterization of novel biopharmaceutical agents. He/she will be required to work on, and potentially develop a variety of in vivo pharmacology models to help characterize biological compounds. This individual will need to organize, analyze and interpret results, come forward with recommendations or understanding of the findings, and communicate and present in team meetings and reports. The ideal candidate will be able to investigate and design assays and possess exceptional troubleshooting skills. Experience in writing in vivo protocols are a requirement. Experience with histological and microscopy techniques is highly valued. The successful candidate will collaborate extensively with other Research Scientists and Associates, while taking personal responsibility for success of assigned tasks and projects. The ability to provide relevant guidance to associates with less experience in performing in vivo pharmacological models would be highly valued.Main Areas of ResponsibilitiesIndependently design, plan, execute and interpret complex in vivo pharmacological studies focused on motor and autonomic nervous system function. Formulation and dilution of large protein molecules.Data analysis and presentation to multidisciplinary teams, preparation of technical reports and participate in strategy and goal setting.Identification of risks within function and development of contingency plans to mitigate risk.Work with cross-functional team members by representing Research to accomplish the goals and requirements of the organization, including excellence in execution, priority setting & career development.RequirementsExtensive experience with developing, performing and troubleshooting a wide variety of in vivo behavioral and physiological assays.Extensive experience with handling, dosing of small or large molecules through a variety of different routes. Experience with histological techniques, including immunohistochemistry and standard staining, as well as microscopy techniques is highly valued.Proficiency in laboratory bench skills such as ELISAs, Western blots, qPCR and flow cytometry is beneficial.RequirementsExtensive experience with developing, performing and troubleshooting a wide variety of in vivo behavioral and physiological assays.Extensive experience with handling, dosing of small or large molecules through a variety of different routes. Experience with histological techniques, including immunohistochemistry and standard staining, as well as microscopy techniques is highly valued.Proficiency in laboratory bench skills such as ELISAs, Western blots, qPCR and flow cytometry is beneficial.Preferred Skills/QualificationExperience with electrophysiology and ex vivo models of neuronal activity is a plus.Exceptional writing and communication skillsComputer skills: advanced knowledge of Excel, Word, Powerpoint and Graphpad prism is required.Exhibits strong leadership skills, flexibility and a commitment to scientific excellence.Highly motivated, hands-on experimentalist who thrives in a collaborative, multidisciplinary environment.Perform experiments with minimal supervision, demonstrate leadership skills and interact in a team environment.Able to have a direct impact on department or project performance.Ability to work within a structured environment following specific guidelines.EducationPhD in neuroscience or related discipline preferred.Minimum 2-years industry experience with a focus on in vivo behavior and pharmacology is desired. Masters-level education in a biological science field with at min. 6 years specific experience will also be considered.*LI-DM1"}