{"jobID": "2835258585", "jobLocation": "Weehawken_NJ", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.humanedge.com", "Headquarters": "White Plains, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist/Data Analyst needed for a long-term contract in Weehawken, NJ in a financial services company in the area. As the Data Scientist/Data Analystfor the company, you will be responsible for determining required IT business solutions for analytics/modeling and implementing them.  Determine required IT business solutions for analytics/modeling and implementing them.  Leverage business requirements via internal and external data and conducting stakeholder interviews to determine modeling needs.  Act as a key point of contact with the Business, Compliance and IT to drive model training and development.  Define options based on modeling/analysis results to provide forward-thinking alternative options for the Business that they may not have considered - think outside of the box .  Leverage tools provided by Digital Reasoning Product (Synthesis) to execute modeling/analysis.  Assist in quality control and project management as required.  Computer science academic background (bachelor or master degree).  Experience with data warehouse and data management.  Strong database, data modeling, and data analysis skills.  Excellent communication skills and experience in liaising with global compliance teams.  Strong analytical, problem-solving and synthesizing skills (you figure out issues and provide solutions with little or no information).  Understanding of a broad range of platforms, technologies, and tools, such as SQL, Unix, Elastic search, & CURL Commands.  Working knowledge of distributed processing systems, e.g. Hadoop Map/Reduce.  Familiarity with Natural Language Processing engines. Category: Financial Services - provided by Dice  Analysis, Analyst, Business Requirements, Data Analysis, Database, Data Modeling, Data Warehouse, Development, Hadoop, Management, Modeling, Project, Project Management, SQL, Unix"}