{"jobID": "2804736901", "jobLocation": "Detroit_MI", "jobTitle": "Customer Happiness Hero", "companyRating": null, "companyInfo": {"Website": "www.helloinnovation.com", "Headquarters": "Detroit, MI", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT US Working at Hello Innovation is more than just a job. Its an invitation to reinvent the world as we know it, to go against the grain of whats possible and to rewrite the rules along the way. Every day we get up and challenge ourselves to create products that are sexier, work better and solve problems that no one has ever thought to solve.  A decade later, weve proved that industries change, problems are solved and lives are improved when design, technology, and the unexpected collide. And were just getting started.  A career at HI isnt for everyone. Were an eclectic team of dreamers, creators and doers who are on a mission to bring meaningful innovation to the world. If youre looking to be inspired, challenged and leave work every day knowing you did the best work of your life, youve come to the right place. ABOUT THE JOB Customer experience is different at Hello Innovation.  We don't believe in red tape or limits; well arm you with the resources you'll need to exceed customers expectations and deliver a truly remarkable experience.  As a Customer Happiness Hero, you can truly make a difference in the lives of the customers you serve and work closely with a team whos obsessed with delivering the best. As a major player in supporting the success of our multi-million dollar eCommerce brand, you not only get to grow your skills in customer service, but learn about the operations and technology behind scenes. ABOUT YOUNo babysitter required. Youre the ambitious, roll up your sleeves type thats ready to get the job done.Empathy is your middle name. You have an uncanny ability to relate to peoples emotions and know just how to de-escalate a tense situation.Youre a modern-day MacGyver. Youve never met a problem that couldnt be solved.Youre ready for anything that comes your way. Youre comfortable with a little chaos and are always up for the challenge.You get it right, down to the last detail. You believe the difference between mediocrity and excellence is attention to detail.You are a learning animal. Youre always ready to devour resources to learn about new ways of doing things. Theres always a better way.You think before you act. Your high EQ allows you to self-regulate, continuously improve your weaknesses and ask for help when you need it.Helping people energizes you. You know that everyone has trouble sometimes, and seek to inject quality and care into every interaction.Youve mastered the art of communication. You can gracefully break down, solve, and explain, even the most complex problems.YOUR RESPONSIBILITIESDo whatever it takes to deliver the best customer experience while serving as the direct point of contact between our eCommerce store, customers and product vendors.Act as a resource for our online shoppers, providing product advice and guidance, while being compassionate to their needs and thinking outside-the-box to deliver happiness.Delight customers and vendors with a wow experience as often and creatively as possible, whether it be in resolving customer inquiries, placing new orders or coordinating order fulfillment.Support the team by coming up with innovative solutions to problems, sharing ideas, reporting trends and challenging yourself and the people around you to improve every single day.COMPENSATION & PERKSMeaningful work. Get paid to give a sh*t and make a real impact on peoples lives when they need it most.Top of market pay. Along with a full benefits package including health, dental and 401k.We ignite you - thats right, you. We exist not only to deliver meaningful innovation, but to ignite and inspire the creative problem solver in you.Experience to prepare you for whatever career lies ahead. Including training and mentorship opportunities from some of worlds top talent.A fun, come-as-you-are environment. Our team never stops pushing you to be the best that you can be and still makes time to have some fun.Flexible scheduling. We can work around your schedule, whether youre going to school, being a parent, or just living life to the fullest.Plus many more. Additional perks include daily catered lunches, team activities, paid holidays, bonuses and much more.We have full-time, part-time and weekend positions available for this role. Diversity isnt just a checkbox. At Hello Innovation, our eclectic team from all walks of life is our secret sauce to meaningful innovation. Needless to say, we are an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}