{"jobID": "2815606017", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Data Scientist - Risk Management", "companyRating": "4.3", "companyInfo": {"Website": "www.bill.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": " Bill.com seeks Senior Data Scientist - Risk Management in Palo Alto, CA.  Build and productionalize predictive models and fraud detection algorithms by utilizing advanced statistical modeling, machine learning, or other data mining techniques. Utilize predictive models to build strategies that can address fraud mitigation and operations efficiency. Continuously evolve models to improve the detection rates. Analyze diverse sources of data to achieve targeted outcomes related to anomaly detection and probability of fraud. Identify and evaluate new data sources to build effective fraud controls for online transactions. Provide on-going tracking and monitoring of performance of decision systems and statistical models. Work with product and engineering team to evangelize data best practices, deploy models, and design/ implement new analytical systems/frameworks. Design and measure A/B tests to optimize existing fraud and credit strategies.  Requires a Master's degree in Statistics, Engineering, Computer Science, Economics or related field plus 5 years of experience. Requires 5 years of experience in data science, performing statistical modeling and data analysis. 5 years of experience in Machine learning techniques and algorithms. 5 years of experience in data analysis and manipulation tools such as SQL. 5 years of experience with Data science and Machine learning tools such as Python. 3 years of experience with Segmentation methodologies such as clustering, decision trees, or anomaly detection.  40 hours/week. Must also have authority to work permanently in the U.S. Applicants who are interested in this position may apply online at www.jobpostingtoday.com, Reference # 66118.SDL2017"}