{"jobID": "2831449426", "jobLocation": "Pontiac_MI", "jobTitle": "Rigging Foreman", "companyRating": null, "companyInfo": {"Website": "www.leecontracting.com", "Headquarters": "Pontiac, MI", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Lee Contracting, Inc. is dedicated to client satisfaction. We provide the highest quality design and implementation services available. Lee Contracting, Inc. is at the forefront of innovative changes in process manufacturing, plant optimization, business operations, and overall performance. Our staff is comprised of hardworking, dedicated and ambitious employees and we welcome candidates of the same stature to join and grow with our team!We are proud to offer our employees:Health Insurance401kCompetitive WagesPaid VacationPaid HolidaysESOP – Employee Stock Ownership PlanJob RequirementsAt least 5 years of rigging experienceOperate gantry, overhead and mobile cranesCDL-A license (preferred)Willingness to travel as dictated by job site locationAbility to lead projects and teach ApprenticesJob ResponsibilitiesSafely move large machinery - 1 pound to 1 million poundsComplete rigging projects working with large stamping presses, weld cells, assembly cells, fixtures, and mezzaninesOperate gantry, overhead and mobile cranesOperate forklift (3 ton - 40 ton)Other duties as assignedCompany RequirementsEnergetic go-getter, who learns quickly and takes initiativeProfessional attitudeAbility to multi-taskMechanically inclinedExcellent communication skillsExcellent interpersonal skillsWork well within a team environmentThis job description reflects management s assignment of essential functions, and nothing in this herein restricts managements right to assign or reassign duties and responsibilities to this job at any time.No Phone Calls Please - Position Will Require A Background Check - Only Qualified Candidates Will Be Contacted"}