{"jobID": "2798388059", "jobLocation": "Plano_TX", "jobTitle": "Consultant - Analytics Consulting", "companyRating": "3.4", "companyInfo": {"Website": "www.infosys.com", "Headquarters": "Bengaluru, India", "Size": "10000+ employees", "Founded": " 1981", "Type": " Company - Public (INFY) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tata Consultancy Services, Accenture, Cognizant Technology Solutions"}, "estimatedSalary": "96000", "jobDescription": "Role Consultant - Analytics Consulting Auto req ID 31944BR Domain Analytics Skillset Enterprise Architecture , Country USA State / Region / Province Plano, TX and various and unanticipated locations throughout the U.S. Work Location Plano, TX and various and unanticipated locations throughout the U.S. Company ITL USA Job Description Senior Consultant – Data Strategy If you could put your talents to work on strategic projects for the world’s most successful and admired brands?  If you could innovate with the most dynamic partners in the world – the hottest emerging start-ups as well as the global technology giants?  If you were part of a company that doesn’t just talk about a culture of learning – but actually runs the world’s largest corporate university?  For starters, you’d probably be working for Infosys. You’d probably be excited to come to work every day. And you would have made a very exciting decision about the next stage of your career. Problem Finders on a mission Anyone can solve a problem: we all learned how to do that in second grade. But it takes a special kind of person to look beyond the stated problem and see the deeper challenges, the hidden issues that could unlock unimaginable value if we only understood their relevance.  We call those people Problem Finders, and we are building a posse of them at Infosys. That’s why we’ve partnered with Stanford University’s B School and our own corporate university to train 180,000 employees around the world, from software developers and cloud architects to HR professionals and lawyers. We’re taking great people, and helping them become amazing Problem Finders.  Isn’t that an investment that your career deserves? It’s all about timing This is an exciting time to be at Infosys. We are making investments in technology, culture and talent that are the envy of our industry.  We invite you to join us at Infosys – there’s never been a better time or place to untether your talent and Be More. Wanted: Global Innovators To Help Us Build Tomorrow’s Enterprise In the role of Senior Consultant – Analytics consulting you will be responsible for solving business problem for our Retail/CPG clients through statistical and machine learning algorithms. Your role will combine a judicious and tactful blend of Retail/CPG domain, Analytical experience, Client interfacing skills, Solution design and business acumen so your insights not only enlighten the clients but also pave the way for launching deeper into future analysis. You will advise clients and internal teams through short burst high-impact engagements on identifying business problem, solving business problem through suitable approaches and techniques pertaining to learning and technology. You will effectively communicate data-derived insights to non-technical audiences appropriately and mentor junior or aspiring consultant/data scientists. You will play a key role in building components of a framework or product while addressing practical business problems. You will be part of a learning culture, where teamwork and collaboration are encouraged, excellence is rewarded, and diversity is respected and valued.  This position will be located in Plano, TX.  100% travel might be required.  U.S. citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time. QualificationsBasic6+ years of experience in data disciplines, with at least 2 years in relevant advisory rolesBI Assessment & Roadmap creation ExperienceWorking knowledge on Data migration, measurement, visualization, storage and distribution strategies. Exposure to BICC implementation will be an added advantageAssisting in RFPs and developing assets and collaterals to showcase capabilities, documenting and communicating the proposed solution to stakeholdersCapability improvement to enhance practiceAbility to work closely with Project Delivery for successful delivery of BI & Data Strategy engagementsUnderstanding of BI Architectures and optionsValue Proposition creationAnalytical and quantitative skillsPreferredMBA or MS from prestigious University in area of quantitative discipline such as Statistics, Applied Math, Operations Research, Computer Science, Engineering or PhysicsLove to travel across the world in short/long stints, interact with people from multiple cultures and thrive in ambiguityBe an excellent team player as well as a strong individual contributorEffectively communicate to lead business discussions or build consensus or put forth recommendations in meetings/ presentations or in emailsIs a technology agnostic yet technology aware (and more)?Are a proven expert and thought leader in any one of the areas of Enterprise Data Strategy, Big Data, IoT, Data Security & Architecture or Traditional BILove to coach and mentor rookies into seasoned Data Strategists like youAbout Us Infosys is a global leader in consulting, technology and outsourcing solutions. We enable clients, in more than 30 countries, to stay a step ahead of emerging business trends and outperform the competition. We help them transform and thrive in a changing world by co-creating breakthrough solutions that combine strategic insights and execution excellence. Visit www.infosys.com to see how Infosys (NYSE: INFY), with US$8.25 billion in annual revenues and 160,000+ employees, is Building Tomorrow's Enterprise® today. EOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity"}