{"jobID": "2824295329", "jobLocation": "Fort_Worth_TX", "jobTitle": "AMI Data/Systems Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The City of Fort Worth Water Department Business Services Division has an AMI Data/Systems Analyst job available in our Water IT Section. Working as part of the Automated Metering Infrastructure technical team reporting to the AMI Systems Administrator, you will be expected to perform duties associated with the daily maintenance and support activities required by our Sensus/Harris AMI applications and related systems. This position will require you to work in the office environment with no option for remote work. AMI Data/Systems Analyst job responsibilities include:Provide daily technical and application support and assistance for Harris MDMS, Sensus Flexnet and other AMI specific applications and systems.Assist with system planning, testing and implementation of new releases, patches, and upgrades.Perform data sourcing, validation, analysis, and testing to support data quality.Monitor system performance and network availability.Design automated system monitoring using scripts, scheduled jobs, and scheduled tasks.Build T-SQL and PL/SQL queries, jobs, and reports for AMI analytics and to access and extract AMI data.Assist and collaborate with other team members on projects and issues.Identify solutions to non-standard requests and problems.Perform other duties as required.Minimum job requirements include:Bachelor's degree from an accredited college or university with major coursework in Computer Science, Management Information Systems or a related field.At least two years of responsible experience in an information systems technical support capacity.Must possess a valid driver's license and an acceptable driving record.Work a regular schedule of Monday through Friday and must be able to work nights, weekends, and holidays without advanced notice, as needed.Participate in a 24 x 7 on call rotation.Preferred Qualifications:Extensive knowledge of relational databases, T-SQL and/or PL/SQL, complex queries, and data warehouses.Experience monitoring both application and database servers.Experience with a combination of Python, PowerShell, Java, or .NET scripting capabilities.Familiar with SSL, TCPIP, and LF wireless networks.Demonstrated knowledge in data/quantitative analysis.Proactive in systems downtime prevention and disaster recovery techniques.Fundamental knowledge of Linux Command Line.Ability to develop algorithms and problem solving solutions in SQL, Python, Batch Files, etc.Demonstrated experience monitoring networks and wireless communications."}