{"jobID": "2796273525", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist Manager - Machine Learning Fraud", "companyRating": "4.4", "companyInfo": {"Website": "www.affirm.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "167000", "jobDescription": "Affirm is a data-driven financial technology company. Machine learning is core to our decision making processes, from validating identities and detecting fraud, to credit underwriting and servicing. We seek to revolutionize the credit system by building higher quality alternatives to incumbent systems and methods.We are looking for a Data Science to lead our Fraud centric efforts. You will be a technical leader within the data science team, leading a team of data scientists that will be responsible for the fraud related decisioning at Affirm.What you'll do Designing and developing machine learning systems that support our identity verification and fraud detectionCreate and maintain business logic and other decision modelsResearch and develop tools to create signals, models, with effective evaluation of potential onlineEffectively planning, coordinating, and communicating within the team, and cross-functionally with engineering and operationsWhat We Look For Passion and drive to change consumer banking for the better5+ years industry experienceStrong proficiency and industry experience building and leading the development of machine learning based fraud systemsDeep understanding of models, feature engineering, feature selection, and other applied ML issuesExperience in Python or other similar language is requiredData Science management experienceFinance and credit experience is a plus, specific fraud related experience is desired but not requiredABOUT AFFIRMAt Affirm we are using technology to re-imagine and re-build core parts of financial infrastructure to enable friendlier and more transparent financial products and services that improve lives.We believe the financial industry is fundamentally broken. Not only is the core infrastructure built with technology from the 1970s, but there are a dwindling number of people who say \"I trust my bank to look out for me\". It doesn’t have to be this way, and it’s our mission to fix this problem.We are based in San Francisco; founded by Max Levchin (founding CTO PayPal), Jeff Kaditz (CDO DeNA/ngmoco), and Nathan Gettings (founding CTO of Palantir); and building a team of exceptionally talented people to join us on our mission."}