{"jobID": "2832459386", "jobLocation": "Oakland_CA", "jobTitle": "Support Group Program Coordinator", "companyRating": "3.6", "companyInfo": {"Website": "www.ebac.org", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 1952", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Support Group Program Coordinator East Bay Agency for Children (EBAC) improves the well-being of children, youth and families by reducing the impact of trauma and social inequities and is committed to building a comprehensive, place-based continuum of accessible, trauma-informed and culturally relevant services that build resiliency, aid in recovery and, where possible, prevent exposure to adverse childhood experiences.  Our staff seeks to reduce barriers that contribute to disparities in wellness for socio-economically disadvantaged and racially marginalized families and to create communities where all children and families have supports to reach their full potential. A. FUNCTION The Support Group Program Coordinator recruits, trains and supervises approximately 40 Circle of Care community volunteers who help facilitate our grief and illness support groups. The coordinator develops and implements the volunteer trainings, leads evening support groups, conducts intakes with families, and provides community outreach and statistical reporting. Coordinates all aspects of support groups including Living with Loss Living with Sudden Loss, and Living with Illness support groups with children, teens, and their parent/caregiver and provides ongoing supervision and support to volunteer facilitators. In addition to these groups, this position also provides outside grief and loss workshops, trainings, and support groups for the community and collaborating agencies. Provides consultation, intake, assessment, and referrals to children and families facing life-threatening illness, death or trauma. The Support Group Program Coordinator reports to the Program Director. B. QUALIFICATIONS and COMPETENCY FACTORSBachelor’s degree (B.A.) or equivalent combination of education and four years of related experience or a Master’s Degree in a related field with experience in the use of expressive arts, with both adults & children.BSW preferred.Experience recruiting, training, retaining and supervising large group of volunteers.Experience working with children aged toddler through teen and adults and diverse populations.Experience working in a support group setting particularly with issues of illness/bereavement, child development, and parenting support. Understanding of group dynamics, age appropriate activities for children, behavior management, end of life issues. Excellent communication and empathic skills, Ability to provide on-going support both to our support group family participants, volunteer facilitators.Ability to accept feedback and integrate into working style while maintaining a leadership role.Evening work required on Tuesday, Wednesday and Thursday evenings until 9:30pm and twice a year on weekends training volunteers. Once a year Walk to remember event all day Saturday and possible other trainings and community events. Ability to keep clear, complete records and utilize our Electronic Health Record Database.Ability to work cooperatively and independently in a multidisciplinary setting.Excellent organizational and administrative skills.Valid driver's license in good standing and own auto insurance.Language skills that include the ability to read, analyze, and interpret documents such as safety rules, operating and maintenance instructions, procedure manuals, and government regulations. Ability to write routine reports, correspondence, and field notes. Ability to speak effectively before groups of children, with mental health professionals, with parents or guardians, interns, volunteers and collaborating agencies.Basic computer skills, plus proficiency in Excel, Publisher, Word & Access preferredC. RESPONSIBILITIES (Those with an asterisk are essential duties.) *Coordinate outreach, recruitment, retention and ongoing support and supervision of 40 volunteer support group facilitators.*Develop and lead volunteer facilitator trainings (2 times a year), and quarterly skill building sessions for facilitator team.*Coordinate and lead volunteers in facilitating grief clinic based Living with Loss/Sudden Loss, Living with Illness, groups for toddlers, children, teens and adults, and school or community based support groups as needed.*Assign and oversee volunteer facilitator responsibilities. Provide supervision to volunteer facilitators before and after each support group.*Provide consultation and resources for facilitators regarding group activity planning, problem management and team building.*Provide intake assessments with support group families. Manage the intake process and group assignments for families entering support groups. Consult with staff providing intake assessments and group work. Provide ongoing support and check with families enrolled in our groups.*Plan and implement team building, skill building, appreciation events for support group volunteers and other special events for groups i.e. Holiday Gathering, Summer Fun Day.Work from a culturally informed practice with sensitivity to children, families, staff and community we work with. 9. Oversee the distribution of educational handouts for parents, volunteers, students and interns.Maintain inventory of group supplies.Solicit in kind donations for program events.Provide targeted and general outreach to the community attending appropriate events to disseminate information about our services & to recruit volunteers.Coordinate, plan, implement and provide consultation for groups offered in collaboration with schools and outside community organizations.Plan, coordinate and implement Annual Support Group Community Event – Walk to Remember Fundraiser/Awareness raiser in cooperation with development department and Program Director. Assist with other fundraising efforts, as needed.Attend staff meeting, EBAC meetings, supervision meetings, and appropriate offsite meetings.Perform other duties as assigned.D. WORKING CONDITIONS and JOB SETTINGWork is in a two-story building with stairs that need to be climbed for access to the second floor. Work is primarily in a routine office setting.Position requires the mobility to set up and break down the facility space for the group meetings, including moving chairs and rubberized mats.Periodic lifting up to 25 pounds.Periodic driving required to offsite workshops, support groups and meetings. Part time Casual 15-18 hrs per week  EBAC offers a uniquely generous time off package and an outstanding benefits package that includes health; chiropractic; dental; voluntary life insurance (for yourself and your family), AD&D; and SDT; accident and critical illness coverage (for yourself and family); flexible spending for medical, child care and commuter benefits; 403b retirement program; legal insurance; and, agency paid life insurance and long term disability coverage.  East Bay Agency for Children is an equal opportunity employer and encourages diverse candidates to apply by sending a cover letter and resume to group40@ebac.org, or by fax to 510-268-0143. Please use the job title as the subject. No phone calls please."}