{"jobID": "2754115404", "jobLocation": "College_Station_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.lynntech.com", "Headquarters": "College Station, TX", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Lynntech offers a stimulating work environment centered on creativity and scientific excellence, developing innovative products from initial concept all the way to deployed systems. We bring together the best team of innovators by combining diverse and complementary talent from our technology groups, academia, and industry. Lynntech operates in a collaborative environment, to innovate, plan, and execute advanced solutions. The Intelligent Systems unit develops innovations based on Machine Learning, AI, signal processing, and new sensors systems, leveraging data to deliver actionable decision tools and empower autonomous systems. Intelligent systems extract actionable information from a sea of raw data, helping users in meeting mission objectives in the field in real time. Our team uses state-of-the-art algorithms, cloud computing resources, visible, infrared imaging, hyper-spectral imaging, embedded navigation, and human-machine interfaces, to solve real-world problems such as signal recognition and matching, geo-spatial data analysis, virtual and augmented reality applications, anomaly detection, assistive technologies for disabled users, data analytics, and computer vision on mobile devices.  Lynntech seeks talented scientists and engineers with expertise in machine learning, data science, artificial intelligence, signal processing, and massively parallel computing, to join our Intelligent Systems unit. We rely on a high level of technical competence and efficiency within our team. We are looking for motivated, talented, and skilled innovators to join us in developing advanced solutions. Lynntech is seeking an experienced scientist with background in machine learning and artificial intelligence, preferably with at least 3 years of previous experience (including post-doc positions) in at least one of the following areas (more preferred):Machine learningDeep LearningParallel processing with GPUs and multi-core programmingSignal Processing Successful applicants will have the following qualifications: PhD. in Computer Science, Statistics, Applied Math, Electrical Engineering, or a related fieldStrong technical writing skillsExperience in conducting independent research with demonstrable resultsHigh level of awareness about state of the art research in Deep Learning and Machine LearningExpert level proficiency with Python (scientific), Matlab, C, and C++ to enable fluid communication with the teamPlatform agnostic: Microsoft Windows, Linux, MacOS, and mobile (Android, iOS)Ability to provide evidence of being either a U.S. citizen or U.S. permanent resident at the time of application to meet contract requirements.Secret clearance or the ability to obtain one is a plus. Effective proposal and report writing are an important aspect of the position. In addition to working with a highly capable team, qualified applicants will have the opportunity to interact with industrial and government customers and collaborators. Lynntech: Creativity. Execution. Collaboration.  Interested candidates are encouraged to apply online at www.lynntech.com. Lynntech is an Equal Opportunity Employer/M/F/Vet/Disabled.0 Job Posted by ApplicantPro"}