{"jobID": "2682406404", "jobLocation": "Chicago_IL", "jobTitle": "Marketing & Web Analytics Consultant", "companyRating": "3.9", "companyInfo": {"Website": "www.transunion.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Public (TRU) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": "\"We're not just a  credit bureau, but we're truly a global information solutions provider.\" -  Julie SpringerOverview  of the role:The Marketing & Web Analytics Consultant is responsible for measuring and analyzing data from marketing initiatives  and channels, and delivering recommendations to business stakeholders to  improve performance. This individual will provide visibility and insights  through reporting and analytics from TransUnion’s B2B marketing  initiatives and website properties. You must be highly analytical,  detail-oriented and an excellent communicator who can effectively work and  collaborate across teams to drive business results. What we'll bring:A welcoming and energetic  environment that encourages collaboration and innovation. We consistently  explore new technologies and tools to be agile.Flexible time off, workplace  flexibility, an environment that welcomes continued professional growth  through support of tuition reimbursement, conferences and seminars.Our culture encourages our  people to hone current skills and build new capabilities, while  discovering their genius.What you'll bring:Bachelor's degree in Marketing,  Mathematics, Statistics or similar field4 years of quantitative  experience with 2 years of web analytics experience3 years' experience working  with Google Analytics platform (with understanding of dimensions and  metrics)Google Analytics Individual  Qualification requiredExperience with Tableau, or  similar data visualization/dashboard tool requiredExperience with Salesforce or  similar CRM requiredWe'd love to see:Experience with Tag Management  (Google Tag Manager)Experience with AlteryxHighly analytical,  detail-oriented, and strong organizational skillsExcellent communication,  collaboration and presentation abilityAbility to effectively work and  collaborate across teams to drive business resultsImpact you'll make:Own and manage Google Analytics  for B2B website properties. Maintain cleanliness of data within the  platform and ensure proper, consistent tracking throughout all web  properties and experiencesAnalyze performance of our web  properties. Monitor behavior patterns on the site,(user journey/flows, and  path & funnel analysis).Use data to identify failure and success  points and improve pain points to increase conversionMeasure, analyze and report out  on monthly and ad hoc dashboards to internal business partners and  stakeholdersPartner with data analyst to  monitor data accuracy and enhance data sets for reportingWork with marketing channel  owners and the marketing strategy team to set campaign specific goals,  analyze campaign and channel effectiveness, and provide recommendations to  increase conversions and ROI for future campaignsAbility to make adjustments  and/or modifications in the tag management platform (GTM) We are an equal  opportunity employer and all qualified applications will receive consideration  for employment without regard to race, color, religion, sex, national origin,  age, disability status, veteran status, citizenship status, sexual orientation,  gender identity, or any other characteristic protected by law#Ll-EF1"}