{"jobID": "2804868511", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Sr Data/Reporting Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.tellussol.com", "Headquarters": "Santa Clara, CA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " TEKsystems, Aditi Consulting, Artech Information Systems"}, "estimatedSalary": "98000", "jobDescription": " Data/Reporting Analyst - A person who knows data and the business domain well, but is solid with Tableau and can take on dashboard development.  One of our Pharma client is looking for Data/Reporting Analyst in South San Francisco, CA  The Data/Reporting Analyst will be accountable in the full lifecycle of reporting solutions providing business customers with strategic, tactical, and operational insights. The individual will be responsible for end to end solutions including strategy development, design patterns, product selection, technical implementation, and configuration of reporting solutions. The role will work with stakeholders and strategic partners to identify data warehousing and analytics requirements and opportunities. The individual will serve as the front-line resource in managing reporting requests and requirements for the Commercial organization. The individual will create and maintain the processes for deploying new reporting solutions and functionality into production, enhancing current production solutions and providing consistent quality service levels to internal and external customers. This role will interact regularly with business customers to capture and understand reporting and data change requests, help define and clarify requirements, define and propose appropriate solutions, and provide guidance for development of the reporting solution to the development team. The individual will perform quality review of developed solutions and ensure proper user acceptance. This role requires extensive collaboration within Sales Operations, as well as with cross-functional colleagues in Marketing, Market Access, Sales, Finance, and Compliance. Responsibilities: · Maintain the production Business Intelligence products and solutions, including resolving production issues and responding quickly to priority problems.  · Perform intake review and assist in prioritization of reporting requests.  · Analyze reporting change requests and define technical specifications for efficient development.  · Identify opportunities for self-service and educate the business on self-service capabilities.  · Analyze data and data requirements regarding reporting solutions, ensure data quality and match-back to core systems transaction results.  · Maintain documentation of reporting solutions, data mapping, data dictionary, and reporting standards.  · Perform quality review of new and existing reporting solutions. Coordinate end user review and acceptance of the developed solutions.  · Support IT goals and objectives by working closely with management team to deliver value to the business.  · Ensure resources are available for reporting activities.  · Ensure available data and reporting solutions meet customer needs.  · Meet established key milestones related to assigned major projects.  · Steward of presentation and data consumption standards.  · Participate in developing and ensuring compliance with architecture principles and standards for the various systems and components based on design patterns.  · Leads Product Selection process for Data/Reporting/Analytics tools and processes. Qualifications: · B.S. Degree in Information Systems, Computer Science, or similar subject.  · 15+ years in Information Technology.  · 8+ years developing reporting or technical solutions (i.e. data warehouses, ETL, stored procedures, data marts, reports, dashboards).  · Thorough understanding of modern data warehouse architecture and business intelligence.  · Thorough understanding of systems integration and enterprise architecture principles.  · Extensive experience with industry leading BI tools (e.g.Tableau, ClikView, etc.).  · Working experience with end user Report design, development and implementation.  · Demonstrated ability to drive to deadlines, balancing multiple priorities, and ensuring quality standards.  · Excellent analytical, problem-solving, and innovative thinking skills.  · Excellent organization and prioritization skills with strong ability to multi-task and shift focus as necessary to meet deadlines.  · Excellent interpersonal listening, verbal, and written communication skills. Ability to communicate technical details to technical and non-technical resources. Ability to interact effectively with people at all levels and functions across the business.  · Able to communicate complex messages, accurately understand specific needs of intended audience and tailor communication accordingly, detail oriented with ability to understand big picture impact.  · Able to work collaboratively across expertise areas and functions; seeks to advance higher goals; highly regarded across stakeholders both at senior and junior levels; inspires trust at all levels; patient-centric, and passionate about innovation and discovery.  · Demonstrated working knowledge and understanding of pharmaceutical sales data (e.g. IMS Health, Symphony Healthcare Analytics, etc.), marketing and sales operations, financial data, business principles, processes and technology.  · Demonstrated working knowledge of healthcare organization landscape, relationships and affiliations, etc.  · Working knowledge of data modeling and various database applications (e.g. Netezza, Oracle).  · Demonstrated proficiency in writing SQL queries to answer business questions.  · Demonstrated extensive computer proficiency with desktop software in a Windows environment including Microsoft Word, Microsoft Excel (VBA) and Microsoft PowerPoint.  · Demonstrated excellence with organizational, planning and cross-functional project management, written and verbal communication, and problem-solving skills with a strong attention to detail, personal initiative and ability to work independently in a dynamic fast paced environment with minimal supervision.  · Demonstrated ability to proactively evaluate existing strategies and recommend changes, when appropriate."}