{"jobID": "2825289759", "jobLocation": "Baltimore_MD", "jobTitle": "Power Washing Technician", "companyRating": "5.0", "companyInfo": {"Website": "www.citycleaninc.com", "Headquarters": "Linthicum Heights, MD", "Size": "Unknown", "Founded": " 2009", "Type": " Self-employed", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "14", "jobDescription": "About City Clean:City Clean, Inc. is the largest and most recognizable power washing, soft washing and hybrid washing company in the greater Baltimore area. We have grown over the last ten years at a fast pace because of our focus on only the best customer service available. We follow-up with each customer after a job has been completed to assure we met all their expectations. Go to our website at www.citycleaninc.com to learn more about us.Qualifications: High School graduate/GED preferredThis is a full-time seasonal position (March to November)Position reports to the Lead Technician as part of a two-person teamMust be able to lift a minimum of 50 poundsStep ladder and extension ladder skills a big plusMust not have a fear of heightsWork outside in all types of weather conditionsAble to have a flexible schedule and willing to work occasional nights and weekendsMechanically inclinedWork with mixed chemicals (safety equipment provided)Able to work at a brisk pacePossess a very positive and customer service-oriented attitudeBe a team playerDependability and a strong work ethic is a mustTransportation to and from work is necessaryThe job:Employee will assist the team leader daily in a company truck with power washing equipment. Will effectively use high pressure power washing, soft wash and hybrid wash equipment. Work will be performed on residential homes as well as commercial buildings and property. Must be able to keep up with a brisk pace to complete all scheduled jobs each day. Attention to detail is important to perform quality work and care must be taken to not disturb surrounding property such as scrubs and flower beds.If this sounds like you, please respond to this job posting and provide your resume. A cover letter as to why you would make a great applicant may work in your favor to help us to better understand you.Position pays $15.00 per hour."}