{"jobID": "2828433612", "jobLocation": "Irving_TX", "jobTitle": "SAP Inventory Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Genuent is hiring a SAP Inventory Data Analyst for our direct client in Irving, Texas. Qualified candidates should send their resume to Tele De La Cruz at Tdelacruz@genuent.com  SAP Inventory Data Analyst  Irving, TX  Direct Hire/Full Time  Our client is one of the largest construction materials companies in North America with more than 550 active operations in the U.S. and Canada. Their core activities include the production and distribution of cement and aggregates, the two essential raw materials in concrete. Our client companies also produce ready-mixed concrete, asphalt and other concrete products.  The parent company is a global leader in aggregates, cement, concrete, and other downstream activities. The Group employs over 60,000 people at more than 3,000 locations in 60 countries. About the Role: The SAP Inventory Data Analyst position is critical to building data for the initial go live based on data trends as well as managing this data into the future as we mature in our system. The position is responsible for analyzing data in support of new processes for SAP and for reviewing material usage, purchasing, and inventory data in order to manage data required to automate procurement through MRP for spare parts.  Who we are looking for: Bachelors in Business, Engineering, Computer Science or equivalent  Minimum of three years of experience in SAP  Minimum of five years of inventory analysis experience  Minimum of 5 years of experience with MRP  Proficient in the use of Tableau or Qlikview/Qliksense data analysis.  Expert Skills in MS Excel  Proficient in MS Access, Word, and PowerPoint  Sound Communication and Presentation skills  Ability to turn raw data into logical information for reporting  Self-starter who has extensive knowledge in reporting and analysis to create and analyze standardized and ad-hoc reports and provide to management or end-user  Ability to identify problems and issues and assist with reporting questions  Above average attention to details, concern for the exact correctness of work, and strong commitment to completing tasks on time  Qualified candidates should send their resume to Tele De La Cruz at Tdelacruz@genuent.com"}