{"jobID": "2640052758", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Salesforce Business Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.appannie.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "132000", "jobDescription": " Senior Salesforce Business Analyst What can you tell your friends when they ask you what you do? As the Senior Salesforce Business Analyst, you will develop, maintain, and improve App Annies Salesforce technology platform. You will use your deep Salesforce experience to deliver innovative, high-quality solutions and partner with Sales, Marketing, and Engineering to ensure our Salesforce technology stack is evolving at pace with our fast-growing business. This is a full-time role based in our San Francisco headquarters. How will you be doing this?Performs Salesforce full stack requirements gathering and analysis to include: analytical techniques, interview approaches, data gathering methodologies, current system documentation, business modeling methods, business process, rules and logic, data gathering to solve complex issues, development of plans & requirements, and key performance indicators.Deliver technology solutions Leverage your strong technical experience to architect, engineer and provide guidance in delivery of key initiatives for an enterprise-class global Salesforce platform.Subject matter expert Collaborate with internal and external partners for the definition, planning, modeling, governance, and implementation of Salesforce.com capabilities.Be a visionary partnering with our Enterprise Architects, technical leads and key individuals within our functional organization and recommend SFDC Platform improvements.Work proactively to remove technical debt and security vulnerabilitiesCommunicates the business directives, goals, and needs to technical teams and serves as business interface from the campus management team managing expectations and defining project completion and user satisfaction metrics.Oversees all Salesforce platform environments, and manages the development/release cycle, while serving as lead administrator and lead developer.Functions as Technical Lead, assuring that the technical direction taken leverages the capabilities of the platform to maximum advantage.Assists technical teams in translating various application functionality into application, systems, and technology solutions consistent with campus IT architecture and standardsWhat will you bring to the teamStrong and deep technical background in Salesforce.com, Service Cloud, Marketing Cloud and sets technical vision and roadmap for our Salesforce appsOversee the architecture and delivery of our apps to ensure that they are highly scalable, deployable, extensible, and maintainableCollaborate with functional teams to establish best implementation of solutionsPartner with Salesforce team on best practices and stay current with new Salesforce capabilities, and assess their benefit to the companyEscalation point for technical issuesDeep knowledge of the Salesforce platform and integrationSeek out ways to utilize Salesforce to improve process, productivity, and make recommendationsDeliver software product and solutions that drive customer satisfaction and business resultsWelcome and embrace tough conversations for trade-off and optionsStay abreast of industry trends and opportunities for new technologiesUnderstanding best practices for multi-org app design on the Force.com platform8+ years of successful software development experience with Salesforce platformMust be Salesforce Certified Developer or Salesforce Certified Architect with 8+ years of experience in Salesforce platform requiredAdvanced technology leadership skills requiredUnderstanding of Salesforce governor limits and architecting for themDemonstrate success with at least one large deployment of SalesforceExperience integrating Salesforce with other applications (real-time, batch, sync/async)Strong presentation, communication, and facilitation skillsAbility to work in a fast-paced environment where continuous innovation is a way of lifeSelf-starter with proven ability to successfully kick-start new initiatives and drive complex issues through analysis and resolutionStrong team-orientationBachelors degree in CS, Software Engineering, MIS or related fieldTechnical exposure to Marketo, Salesforce CPQ, SFDC Communities is requiredWhat do we offer?Competitive compensation.All the tech tools you need to succeed: a new smartphone and Mac laptop.Catered lunches Monday through Thursday, snacks, fruit, good coffee and other stuff to help you get through the day.A 401(K) plan to help you plan for your future.Great health, dental and vision insurance packages to fit your needs to ensure youre happy and healthy.A yearly fitness stipend that will keep you up and moving.Commuter benefits that make getting to and from work a breeze.Employee referral bonuses so youll get the opportunity to work with friends (and get some extra cash in your pocket!).About App Annie App Annie delivers the most trusted app market data and insights for your business to succeed in the global app economy. Over 1 million registered members rely on App Annie to better understand the app market, their businesses and the opportunities around them. The company is headquartered in San Francisco with 450 employees across 15 global offices. App Annie has received $157 million in financing, including from investors such as Sequoia Capital, Institutional Venture Partners, IDG Capital Partners, e.ventures, Greenspring Associates, and Greycroft Partners.  App Annie does not accept unsolicited agency resumes. Any unsolicited agency resumes received will be treated as the property of App Annie, and App Annie will not be responsible for any fees related to such resumes.  App Annie is an equal opportunity employer. App Annie values diversity, and all employment decisions are made on the basis of job requirements and individual qualifications."}