{"jobID": "2756021165", "jobLocation": "Bethesda_MD", "jobTitle": "Data Analyst II (Must be US Citizen)", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "Updated: TodayJob ID: 213886Status: Full-TimeRegular/Temporary: RegularLocation: Bethesda, MD, United StatesJoin the HJF Team! Provides routine and non-routine statistical/analytical support for ongoing research collaboration to study clinical and economic aspects of healthcare within the Military Health System; collaborates with clinicians and health services researchers, but can exercise independent judgment in the resolution of analytical problems.  Responsibilities:  Collaborates with clinicians and health services researchers to design and manage multiple research projects simultaneously. Maintains research databases, ensuring accuracy and completeness. Links and merges datasets to create larger datasets for projects. Performs data manipulations and statistical analyses using SAS. May transfer SAS programs into other statistical software as needed. Creates tables and charts for manuscripts for peer-reviewed professional journals. Reviews and remains current with technical and scientific literature in military-relevant areas of epidemiology and biostatistics. Conducts complex analytical and statistical work using appropriate statistical techniques, which may include multivariate logistic and linear modeling as well as Cox proportional hazard modeling. Collaborates and communicates with team members and external collaborators. May direct work assignments. May assist in training and/or mentoring of lower level staff/students. Prepares and presents informal and formal briefings at various international, national, and military activities. Reviews and assesses the work of other professionals in own field. Contributes to the team effort by accomplishing related duties as needed.Required Knowledge, Skills, and Abilities: American citizenship and ability to obtain Secret clearance. Experience with large healthcare databases. Proficiency in SAS and other statistical analytic software. Intermediate knowledge of epidemiology. Skill in use of word processing, spreadsheet, graphic, email, and database software. Skill in writing memorandums, correspondence, abstracts, articles, and proposals. Ability to plan and prioritize work. May require the ability to supervise and direct work assignments. Ability to make presentation to groups. Ability to be a self-starter and work independently. Ability to interface with investigators, vendors, research staff, and study participants. Ability to communicate effectively and professionally with team members and external collaborators.Preferred Knowledge, Skills, and Abilities: Familiarity with the Military Health System Data Repository. Experience in healthcare costing.Minimum Education/Training Requirements: This position requires an advanced college degree in Public Health, Epidemiology, or related field. Minimum Experience: 2-4 years related experience. Physical Capabilities: Walking, standing, must be able to read reports, labels and use computer, must be able to hear well enough to communicate with coworkers, must be able to write, type, and use phone system Clearance: If a security clearance is not active upon hire, the candidate must be able to obtain a security clearance of secret for this position. Work Environment: Normal office working conditions HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer."}