{"jobID": "2692381338", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.fooda.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "Who We Are: We believe a workplace food program is something employees should love and look forward to every day. Powered by technology and a network of over 1,000 restaurants, Fooda feeds hungry people at work through our ongoing food programs located within companies and office buildings. Every day, each Fooda location is served by different restaurants that come onsite and serve fresh lunch from their chefs unique menus. Fooda operates in seventeen major US cities and plans for continued expansion. What You Will Do:Extract financial data from our operating system and import into our accounting system to support the monthly close processMaintain high quality standards by following a consistent process, investigating discrepancies and testing final output for accuracyBe curious look for variances and inconsistencies and seek to explain the dataConduct research and analysis to support the preparation for and implementation of a new accounting systemWork with stakeholders to define requirements for reporting and analysis; then implement the solutionPrepare KPI reports and supporting commentary highlighting trends in the financial metrics of the businessLead and complete ad hoc data analysis projects for senior management as they ariseWhat Yo­­u Should Have:1-2 years of experience in an analytical role, preferably within consulting or financeBA/BS from top-tier University; degree in math, computer science, accounting or finance preferredExperience analyzing detailed data; understanding of financial statements preferredStrong analytical skills with an ability to dive deep, summarize, and communicate important dataAbility to balance attention to detail with expeditious execution in a fast paced environmentHighest standards of accuracy and precision; extremely organizedAdvanced Microsoft Excel and PowerPoint skillsIntermediate SQL knowledge preferredWhat Well Hook You Up With: Competitive market salary and stock options, based on experience  Comprehensive health, dental and vision plans  Flexible spending accounts  401k matching  Daily subsidized lunch program (ours!) and free food and beverages in the office  A fulfilling, challenging adventure of a work experience Must be authorized to work in the United States on a full-time basis. No phone calls or recruiters please. Fooda provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Fooda complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}