{"jobID": "2822551864", "jobLocation": "Houston_TX", "jobTitle": "Biocuration Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.jacobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Company - Public (JEC) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Fluor, Bechtel, AECOM"}, "estimatedSalary": "52000", "jobDescription": "The Biocuration Scientist will: Collect and interpret aqueous chemistry and/or organic chemistry data.  Collect and interpret spectroscopic and B.E.T. surface area data.  Cultivate bacteria and fungi.  Culturing of cells (immortal and primary).  Perform In vitro and in vivo exposure studies.  Summarize and communicate results to project lead/manager and contribute to abstracts, presentations, peer reviewed journal articles, and grant proposals.  Prepare Standard Operating Procedures (SOP) for new lab processes.  Sustain a safety-first laboratory culture with particular emphasis on chemical and biological safety.  Perform other duties as required.  Qualifications Required Education/Experience/Skills: This position has been posted at multiple levels. Depending on the candidates experience, requirements and business needs, we reserve the right to consider candidates at any level for which this position has been advertised.  BS degree from an accredited college or university in an associated technical discipline and four (4) to nine (9) years of related experience, or a MS degree in an associated technical discipline with two (2) to seven (7) years of related experience, or Ph.D. in an associated technical discipline with zero (0) to three (3) years of direct science experience.  Experience working with fungi and/or anaerobes.  Experience with cell culture (primary cells and cell lines).  Experience using sterile technique or equivalent experience working in a cleanroom setting.  Experience with DNA sequencing.  Experience building and maintaining relational databases (e.g. Microsoft Access, Oracle, SQL).  Experience in the use of an array of instrumentation, including, spectrophotometer, spectrofluorometer, B.E.T. surface area analyzer and/or demonstrate an ability to learn these techniques expeditiously.  Must have excellent verbal and written communication skills, as well as excellent interpersonal skills."}