{"jobID": "2795656566", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist - Individual Markets", "companyRating": "3.8", "companyInfo": {"Website": "www.mibcn.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Responsible for supporting the analytical needs of the Individual Business Unit (IBU) by developing predictive modeling applications. Mines business and enterprise data sources to develop statistical analysis of trends in historical data.Creates predictive models with applications in the individual health insurance industry. Performs analysis and reporting of relevant health care and member data. Trains and consults with others to increase the leverage of predictive analytics. Provides leadership to team in developing new models that will utilize cutting edge methodologies and algorithms.Serves as the liaison to enterprise advanced analytics initiatives and connect cross-functionally to leverage other analytics/data sources outside the segment.Works with IBU Informatics team to define data requirements for the IBU Operational Data Store (ODS) as well as connect new sources of data to better support analytics efforts.Other duties as assigned.Bachelor's Degree in data science, predictive analytics, computer science, or statistics related field required. Master’s degree preferred.Four (4) years relevant business experience with a minimum of two (2) years experience in a predictive analytics or data science role.Expert knowledge of SAS.Experience working with various types of data such as SQL Server, Oracle, Hadoop, etc.Experience with machine learning and predictive algorithms.Experience working with R, Python or similar packages is preferred.OTHER SKILLS AND ABILITIESExcellent verbal and written communication skills to interact effectively with various levels of internal and external management.Strong analytical skills, demonstrated business acumen and ability to define problems, collect data, establish facts and recommend solutions.Proficient in current Microsoft office PC applications (Word, Excel, etc.) and relational database systems.Other related skills and/or abilities may be required to perform this job.All qualified applicants will receive consideration for employment without regard to, among other grounds, race, color, religion, sex, national origin, sexual orientation, age, protected veteran status or status as an individual with a disability."}