{"jobID": "2724603309", "jobLocation": "San_Francisco_CA", "jobTitle": "Head of Talent Acquisition", "companyRating": null, "companyInfo": {"Website": "www.searchwizards.com", "Headquarters": "Sarasota, FL", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Head of Talent Acquisition – San Francisco, CAAre you passionate about the Talent Acquisition Profession and the impact you can make on the organizations you support? Do you enjoy being challenged and solving problems? Are you an energetic, results-oriented Professional with a competitive nature? If so, we want to talk to you.Search Wizards is a global provider of Talent Solutions. We have excelled at matching our clients’ staffing needs to the BEST Talent Acquisition Professionals in the market since 2000.If you are in the Talent Acquisition Profession make us your first call. This is all that we do and it’s all about YOU.Excited yet? Us too!We currently have a very exciting opportunity available for a Head of Talent Acquisition in San Francisco, CA. This is a direct hire position.Our client’s Head of Talent Acquisition is responsible for defining and leading the company’s talent acquisition strategy to support their rapid growth and strengthen the recruiting model and programs. As a senior leader this role will act as a true partner to the business to identify talent gaps, implement sourcing tools and processes, ensure we have robust programs for diversity and employer branding, and scale the team to deliver against hiring plans.Responsibilities:Utilize knowledge of business needs and priorities to develop recruiting strategies and programs that ensure an ongoing pipeline of top talent to fill positions at all levels in the organization including strategic and Executive positionsProvide expert guidance, facilitation and collaboration for all Senior leaders and hiring leaders to recruit, identify, select, onboard, and retain highly skilled best in class candidatesProvide leadership, training, coaching, and guidance to the Talent Acquisition team and hiring leaders on interviewing best practices, offer recommendations, negotiating/creating job offers, closing, and administrative functions involved in full cycle recruitingBuild a strong, credible relationship with Senior leaders, Hiring Managers and critical stakeholders; operating as trusted advisor and subject matter expertDesign, implement and maintain the appropriate processes, tools, systems and trainings necessary to scale and support the recruiting functionCreate a strategic plan and organizational model that provides a unique menu of talent services designed to operate at a scale and efficiency for the business and talent acquisition functionBuild talent communities and talent pipelines for critical skill areas and diversity sourcing efforts, that yield into hiring outcomes for the businessManage efficient, fast-paced full-cycle recruiting operations that support the company’s rapid growth plansKeep abreast of external trends and innovative recruiting and sourcing techniques in order to be competitive in state-of-the-art recruiting practicesDevelop and implement employer branding efforts and strategy for the companyDevelop and implement workforce plans, refine hiring forecasting capabilities, and establish and report on key recruiting metrics to measure team effectiveness and provide data-driven, actionable insightsBasic Qualifications:10+ years of broad recruiting and leadership experience in Talent Acquisition or Human Resources, with at least 5+ years of managing teamsA successful track-record of talent acquisition management at a rapidly growing technology companyDemonstrated experience creating and executing a metrics-driven, consultative service oriented recruiting strategy for a global organizationAbility to develop business cases and service requirements, influence and foster trust with stakeholders at all levels, while creating and managing strategic alliancesDeep expertise in social media, digital marketing and recruiting platforms/tools, and employer brand best practicesStrong interpersonal savvy and self-awareness with strong written and verbal communication skillsPreferred Qualifications:Undergraduate degree in Business, Human Resources or equivalent professional experienceExperience working in the gaming or entertainment industrySearch Wizards is an equal opportunity employer.Search Wizards is known for its pioneering efforts and niche focus on Talent Solutions. We offer competitive rates, an excellent benefits package (healthcare and 401k), ongoing education, and more.StayConnected:WebsiteFacebookTwitterGlassdoor"}