{"jobID": "2679479479", "jobLocation": "Mountain_View_CA", "jobTitle": "Scientist / Senior Scientist - Health R&D;", "companyRating": null, "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Health R&D; teams goal is to identify and develop the next set of products and features that will drive the future of the 23andMe health product offering. We are building a world-class R&D; portfolio and are looking for a scientist to join our efforts in researching and developing the next big thing for 23andMe customers. Are you excited to use 23andMe data to create novel consumer health products? Are you someone who is ready to think big about whats next in the world of genetics and personalized medicine? Come join us in this new role! Who we are Since 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding. What you'll doGenerate and execute on novel ideas with little guidanceUse coding skills to dive into new and existing data to support ongoing R&D; activitiesCollaborate closely with other members of the Health R&D; team to generate new ideas, critically evaluate and contribute to existing projects, and build out the R&D; portfolioCollaborate with cross-functional teams, including Product and Engineering, to take early stage research projects and turn them into fully functional features or new productsCommunicate project results both verbally and in writing to scientists and non-scientistsAct as a scientific mentor and advisor for individuals inside and outside of the Research teamMaintain compliance with all company policies and proceduresPerform other related duties as assignedWhat you'll bringPh.D. in Statistics, Genetics, Computer Science, or a related fieldStrong coding experience (Python, R, and other relevant programming languages)At home in a Unix/Linux environmentStrong working knowledge of statisticsExperience generating and executing on novel ideasExperience working with large structured and unstructured dataA history of being proactive, thorough, and independentExcellent verbal and written communication skillsEnthusiasm for working in a highly collaborative and changing environmentPlusesExperience with genetic association studies or epidemiologyExperience with machine learning techniquesExperience with cloud services such as AWSExperience with varied data types (microbiome, blood chemistry, activity, heart rate, etc.)About Us 23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.  At 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.  Please note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}