{"jobID": "2827396145", "jobLocation": "Washington_DC", "jobTitle": "Data Services Analyst", "companyRating": null, "companyInfo": {"Website": "www.gopdatatrust.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Summary: Data Trust is currently seeking a Data Services Analyst, a full-time position, that will be responsible for working under the Deputy Director of External Support fielding requests from clients relating to voter and consumer data. The Data Services Analyst will be responsible for managing client relationships and fulfilling various requests, primarily with Data Trust’s data firm, consultant, and pollster clients. They will be a motivated self-starter with an interest in politics and data. Reporting: The Data Services Analyst will report directly to the Deputy Director of External Support, as well as the Director of External Support. Responsibilities:Leverage Data Trust’s library of voter data to help our variety of clients reach their desired audiences.Utilize thousands of political, demographic and consumer data points to create actionable voter universes, polling samples, and various files that allow clients to achieve electoral goals.Analyze voter data to provide actionable insights to clients to help drive strategic initiatives.Apply political knowledge and understanding to aid clients with strategic decisions making use of data and technical skills.Adapt to ever-changing client needs and build a knowledge of campaign strategies.Serve as Data Trust’s point of contact with clients when needed.Qualifications:0-2 years of professional experience, preferably in campaigning/electoral politics, or political data.An ideal candidate will be professional, reliable and display strong communication skills.The ability to effectively multitask and prioritize while meeting deadlines.Possess an understanding of how data educates and interacts with the political process.Prior experience in the political space is helpful but not required.Proficiency in Microsoft Excel.Impeccable attention to detail."}