{"jobID": "2829126678", "jobLocation": "Paris_TX", "jobTitle": "Scientist in surface passivation materials for advanced silicon solar", "companyRating": null, "companyInfo": {"Website": "www.total.com", "Headquarters": "Courbevoie, France", "Size": "10000+ employees", "Founded": " 1924", "Type": " Company - Public (TOT) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " ExxonMobil, Shell, BP"}, "estimatedSalary": null, "jobDescription": "Job Description For the foundation of IPVF, TOTAL Gas Renewables&Power; is seeking a scientist who will contribute to identify and develop innovative surface passivation materials for c-Si solar cells. The work will focus not only, on different deposition methods (PECVD, ALD) of new passivation materials but also on advanced laser processing and the impact of various surfaces (flat, chemically polished, textured and nanostructured).  The candidate should have experience in surface passivation of c-Si ideally with innovative materials.  He or she will be an active member of a R&D; team developing new process steps for the next generation of c-Si solar cells and collaborate actively with TOTAL's partners within IPVF. She/he will be in charge of developing new processes, i.e. defining the experimental plan and performing the experiments as well as treating and interpreting the data. The candidate's research will be part of the long term R&D; projects of TOTAL GRP, and it will contribute to the design of the technology roadmap of TOTAL and its affiliates.  The principal responsibilities of the Scientist will be to: Participate in the design and fabrication of surface passivation materials with innovative processes and apply them on device architectureMeasure the electrical, optical, physical properties of the fabricated materials using a complete set of advanced characterizationDesign experiments, organize, and execute device fabrication stepsInnovate and solve challenging technical problems with solution-oriented approachesAssist in laboratory management activities such as calibrations, organization and othersReport regularly on the status of the activities in meetings or phone conferences The candidate will benefit from a highly dynamic and inspiring international R&D; environment. He/she will be trusted with a large extend of autonomy, while being part of a team of outstanding scientists, and of TOTAL, a company where \"Developing complementary next generation energy activities\" is a strategic priority.  Employment type  Fixed term position"}