{"jobID": "2837467018", "jobLocation": "Chicago_IL", "jobTitle": "Spark Big Data Engineer -120k", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Engineer/Data Scientist - Chicago, IL 110k -120k Salary: Up to US$110,000-120,000 per annum + Company Equity + BonusesTechnology: AWS Big Data JobsJob Type: Full Time PermanentDate Posted: June 26, 2018 An awesome new opportunity has just opened in Chicago! My client is a well-known and reputable company in the AWS Big Data field. They are looking for a full-time Data Scientist/Engineer to be part of a thriving team who has a wide range of experience in technology. You will be working with the latest cutting edge technology and working on client facing projects. Working here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it and be rewarded. They will also help you make an impact with their training and mentoring offerings. Requirements:Extensive experience with analyticsAWS (EMR, S3, RedShift)Hands-on experience with MongoDB, SQL, ScalaSpark is a mustKnowledge in Java and PythonData Scientist is a plusData modelling experienceBenefits:No travelPaid Time Off401kMedical/Dental/Vision Jefferson Frank is the Amazon Web Services (AWS) recruiter of choice. We work with organizations worldwide to find and deliver the best AWS professionals on the planet. Backed by private equity firm TPG Growth, we have a proven track record servicing the AWS permanent and contract recruitment market and, to date, have worked with over 30,000 organizations globally from our offices in North America, Europe, and Asia-Pacific.  At Jefferson Frank, our mission is simple: we want happy customers. Whether you're an AWS professional walking into your dream AWS job, or an organization hiring an incredible contractor for your cloud migration project, our goal is to deliver an unrivalled customer experience. Work with us and you'll get the personalized experience you deserve - one you'll simply not find at any other recruitment agency. At Jefferson Frank, we find great people great jobs in AWS.  I understand the need for discretion and would welcome the opportunity to speak to any Big Data and cloud analytics candidates that are considering a new career or job either now or in the future. Confidentiality is of the upmost importance. For more information on available AWS Big Data Jobs as well as the cloud market, I can be contacted at 212-731-8282. Please see www.jeffersonfrank.com for more information. If you or someone you know is interested in this position, please send your resume directly to [Click Here to Email Your Resumé]. My client is looking to start the interview process as soon as possible.Data Engineer/Data Scientist - Chicago, IL 110k -120k  Salary: Up to US$110,000-120,000 per annum + Company Equity + Bonuses  Technology: AWS Big Data Jobs  Job Type: Full Time Permanent  Date Posted: June 26, 2018  An awesome new opportunity has just opened in Chicago! My client is a well-known and reputable company in the AWS Big Data field. They are looking for a full-time Data Scientist/Engineer to be part of a thriving team who has a wide range of experience in technology. You will be working with the latest cutting edge technology and working on client facing projects. Working here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it and be rewarded. They will also help you make an impact with their training and mentoring offerings. Requirements: Extensive experience with analytics  AWS (EMR, S3, RedShift)  Hands-on experience with MongoDB, SQL, Scala  Spark is a must  Knowledge in Java and Python  Data Scientist is a plus  Data modelling experience Benefits: No travel  Paid Time Off  401k  Medical/Dental/Vision  Jefferson Frank is the Amazon Web Services (AWS) recruiter of choice. We work with organizations worldwide to find and deliver the best AWS professionals on the planet. Backed by private equity firm TPG Growth, we have a proven track record servicing the AWS permanent and contract recruitment market and, to date, have worked with over 30,000 organizations globally from our offices in North America, Europe, and Asia-Pacific.  At Jefferson Frank, our mission is simple: we want happy customers. Whether you're an AWS professional walking into your dream AWS job, or an organization hiring an incredible contractor for your cloud migration project, our goal is to deliver an unrivalled customer experience. Work with us and you'll get the personalized experience you deserve - one you'll simply not find at any other recruitment agency. At Jefferson Frank, we find great people great jobs in AWS.  I understand the need for discretion and would welcome the opportunity to speak to any Big Data and cloud analytics candidates that are considering a new career or job either now or in the future. Confidentiality is of the upmost importance. For more information on available AWS Big Data Jobs as well as the cloud market, I can be contacted at 212-731-8282. Please see www.jeffersonfrank.com for more information. If you or someone you know is interested in this position, please send your resume directly to [Click Here to Email Your Resumé]. My client is looking to start the interview process as soon as possible."}