{"jobID": "1803333712", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst Level 1", "companyRating": "3.0", "companyInfo": {"Website": "www.vergemobile.com", "Headquarters": "Houston, TX", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "42000", "jobDescription": "Job DetailsLevel EntryJob Location Houston - Houston, TXPosition Type Full TimeEducation Level 2 Year DegreeSalary Range $26,000.00 - $31,000.00 Salary/yearTravel Percentage NoneJob Shift DayJob Category Admin - ClericalDescriptionJob DescriptionReceives, reviews, and enters data into computer system or tracking database according to established procedures. Ensures accuracy of all data recorded and performs database maintenance functions, support the companies vision, mission and goals.  This list of duties and responsibilities is illustrative only of the tasks performed by this position and is not all-inclusive. ESSENTIAL DUTIES AND RESPONSIBILITIES: Reconcile Data between multiple data sources and systems.Keeps track of received data and source documents.Prepares and sorts source documents, and identifies and interprets data to be entered.Contacts preparers of source documents to resolve questions, inconsistencies, or missing data. Confirms accuracy of data.Compares data entered with source documents, or reenters data in verification format to detect errors.Reviews and makes necessary corrections to information entered.Assists in establishing and maintaining an effective and efficient records management system.Generates reports and responds to inquiries regarding entered data as requested.Contributes to a team effort and accomplishes related results as required.Maintains confidentiality of data and informationPerforms general clerical duties such as typing, answering phones, etc.Perform other duties as assigned.Prepare Reports in ExcelQualificationsQualifications Proven Mastery of Excel and MacrosProven Mastery of SQLMicrosoft Office Expert with focus and expertise around Microsoft Excel.General understanding of records management procedures.Ability to operate spreadsheets, and database programs.Communicate efficiently and effectively both verbally and in writing.Carry out multiple tasks and meet deadlines.Follow instructions furnished in verbal or written format.Detail oriented and possess skill in ten-key by touch.Additional Information- Verge Mobile is an Affirmative Action/Equal Opportunity Employer, and we are committed to hiring a diverse and talented workforce. EOE/AA/M/F/D/V  - Great Employee Perks/Benefits  - Paid Training  - Discounted T-Mobile Service  - Paid Time Off  - Professional Development  - Plus much more!"}