{"jobID": "2835594754", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " HBUS is the exclusive US strategic partner of Huobi, one of the worlds leading virtual currency service providers. Headquartered in San Francisco, CA, HBUS believes that distributed ledger technology, or blockchain, is about more than virtual currencies and ICO tokens. For just as few could have foreseen the rise of social media when the Internet emerged three decades ago, the most revolutionary digital assets built upon distributed ledgers are likely yet to be conceptualized. It is with this vision in mind that HBUS strives to be a reliable and efficient marketplace for a rich selection of high-quality virtual currencies so that our users can be part of the open and competitive market that discovers blockchain assets with genuine potential to revolutionize the future of finance.  We are building a new R&D; center in Silicon Valley. This is a fantastic opportunity for a driven and career focused individual to join a progressive and growing team!  Responsibilities Interpret data, analyze results using statistical techniques and provide ongoing reportsDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and interpret trends or patterns in complex data setsManaging and designing the reporting environment, including data sources, security, and metadataWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesWork with executive, produce, data and design teams to assist with data-related technical issues and support their data analytics needs Requirements 4+ years of Data Analytics experienceTechnical expertise regarding data models, database design development, data mining and segmentation techniquesStrong knowledge of and experience with reporting packages and databasesKnowledge of statistics and experience using statistical packages for analyzing datasetsStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsMust be able to quickly learn our productsCreative & ambitious person with a passion for excellenceExcellent verbal and written communication skillsBachelor's degree in Mathematics, Economics, Computer Science, Information Management, Statistics or equivalents Nice to Have Knowledge of Crypto-currencies and experience in using exchangesExperience with Tableau"}