{"jobID": "2838005685", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher, Non-agency Mortgages", "companyRating": "3.8", "companyInfo": {"Website": "www.factset.com", "Headquarters": "Norwalk, CT", "Size": "5001 to 10000 employees", "Founded": " 1978", "Type": " Company - Public (FDS) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " S&P Global Market Intelligence, Bloomberg L.P., Thomson Reuters"}, "estimatedSalary": "131000", "jobDescription": " FactSet (NYSE:FDS | NASDAQ:FDS) delivers superior analytics, service, content, and technology to help more than 85,000 users see and seize opportunity sooner. We are committed to giving investment professionals the edge to outperform, with fresh perspectives, informed insights, and the industry-leading support of our dedicated specialists. We're proud to have been recognized with multiple awards for our analytical and data-driven solutions and repeatedly ranked as one of Fortune's 100 Best Companies to Work For and a Best Workplace in the United Kingdom and France.  The Analytics SBU is responsible for the strategy, execution and development of products that will establish FactSet as the premier technology partner for the Analytics investment community. The FactSet Research group is currently looking to fill the position of Quantitative Researcher to oversee non-agency mortgage prepayment and loss research.  The research team is responsible for defining, establishing and maintaining the quality of the analytics delivered to clients via the FactSet workstation, applications and data feeds. The successful candidate will establish FactSet as a market leader in Fixed Income analytics through original research, publishing in academic journals and timely integration of this research into FactSet applications. To achieve this, strong communication between Research, Product Development, Engineering and Sales specialists is essential.  This position will report to the director of Fixed Income and Derivatives Research. ResponsibilitiesSet the research direction for non-agency mortgage backed securitiesPerform cutting edge research on non-agency mortgage prepayment and loss modelsCollaborate with fixed income, derivative and risk researchers, product development and engineering to implement research in the FactSet workstationCommunicate research and model improvements to the marketStay informed on market developments in non-agency, fixed income markets and regulatory changes FactSet (NYSE:FDS | NASDAQ:FDS) delivers superior analytics, service, content, and technology to help more than 85,000 users see and seize opportunity sooner. We are committed to giving investment professionals the edge to outperform, with fresh perspectives, informed insights, and the industry-leading support of our dedicated specialists. We're proud to have been recognized with multiple awards for our analytical and data-driven solutions and repeatedly ranked as one of Fortune's 100 Best Companies to Work For and a Best Workplace in the United Kingdom and France.  The Analytics SBU is responsible for the strategy, execution and development of products that will establish FactSet as the premier technology partner for the Analytics investment community. The FactSet Research group is currently looking to fill the position of Quantitative Researcher to oversee non-agency mortgage prepayment and loss research.  The research team is responsible for defining, establishing and maintaining the quality of the analytics delivered to clients via the FactSet workstation, applications and data feeds. The successful candidate will establish FactSet as a market leader in Fixed Income analytics through original research, publishing in academic journals and timely integration of this research into FactSet applications. To achieve this, strong communication between Research, Product Development, Engineering and Sales specialists is essential.  This position will report to the director of Fixed Income and Derivatives Research. ResponsibilitiesSet the research direction for non-agency mortgage backed securitiesPerform cutting edge research on non-agency mortgage prepayment and loss modelsCollaborate with fixed income, derivative and risk researchers, product development and engineering to implement research in the FactSet workstationCommunicate research and model improvements to the marketStay informed on market developments in non-agency, fixed income markets and regulatory changesVEVRAA Federal ContractorRequest Priority Protected Veteran & Disabled Referrals for all of our locations within the stateThe EEO is the Law poster is available here.FactSet Research Systems Inc. endeavors to make our website accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact Jennifer Passeck, Lead Recruiting Specialist, Human Resources at +1 (203) 810-2472 or recruiting@factset.com.Equal Opportunity Employment PolicyIt is the policy of FactSet Research Systems Inc. (\"FactSet\") to provide equal employment and advancement opportunities to all qualified employees and applicants for employment regardless of their race, color, religion, sex, age, sexual orientation, gender identity or expression, national origin, physical or mental disability, genetic information, protected veteran status, pregnancy, military or military reserve obligations, or any other class or status protected by law. This policy applies to all policies and procedures related to recruitment, hiring, training, promotion, compensation, benefits, transfer, discharge, and other terms and conditions of employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status. If you have questions concerning this policy, please contact the Human Resources department at +1 (203) 810-1000."}