{"jobID": "2798396004", "jobLocation": "Detroit_MI", "jobTitle": "Big Data Engineer, Group Manager, Azure Experience", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "120000", "jobDescription": " Role Overview:  Big Data Engineering Sr Consultant / Manager is a member of the delivery team. This role leads architecture, design and implementation of projects focused on collecting, aggregating, storing, reconciling and making data accessible from disparate sources to enable analysis and decision making. Big Data engineers and architects are a critical part of the data supply chain, ensuring stakeholders can access, manipulate data for routine and ad hoc analytics. This role leads analytics team for creation of big data and analytics solutions, spanning full lifecycle of data from ingesting through analytics to action. Manages the planning and delivery of big data platforms and solutions by leveraging Azure Big Data & Analytics PaaS Services including but not limited to – Azure Data Factory, Azure Data Lake Store, Azure Data Lake Analytics, Azure Storage, Azure Cosmos DB, Azure SQL, Azure DW, Azure Analytics Services and Power BI.Analyzes current business practices, processes and procedures as well as identifying future business opportunities for leveraging Microsoft Azure Data & Analytics PaaS Services.Works closely with client architects and software and hardware vendors to understand the potential architectural impact of different vendor strategies.Manages the design and development of standard/custom big data platforms; warehouse schematics, layouts, architectures, and relational databases for data storage and data mining.Ensures data is delivered to clients in ways that meet requirements and drives business value.Customize data storage and extraction, data mining, database architecture, metadata and repository creation.Leads creation and implementation of effective metrics and monitoring processes.Leads design and development of business intelligence reporting tools.Work with deal teams to provide subject matter expertise and solutioning support for client proposals and RFPs.Produce actionable reports that show key performance indicators, identify areas of improvement into current operations, and display root cause analysis of problems. QualificationsExperience Requirements: Demonstrates significant experience working with large scale data and analytics platforms, including data warehouses, database, storage, collection and aggregation models, techniques and technologies, with the ability to apply such methods to solve business problems.Played a role of a data warehouse and analytics architect leading projects with 4+ team members in onsite-offshore delivery model.Must have experience with estimating end to end data & analytics solutions including writing SOWs.Demonstrated experience of working with business stakeholdersMust possess excellent communication and presentation skillsExperience in structured problem solving assignments and strong project management and people management skills - Excel, PowerBI, PowerPivot, SQL Server, SQL Server Analytics Services, & SQL Server Integration Services(SSIS).Understanding and knowledge of building analytics solutions using NoSQL databases.Preference would be given to candidates with experience in one more of the following; Azure Data Factory, Stream Analytics, Azure IoT Services, Azure Data Lake Storage, Azure Data Lake Analytics, HDInsight/ Hadoop, Azure Data Warehouse, Statistical methods, and Advanced Analytics. About Avanade  Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 29,000 digitally connected people across 23 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. We welcome all, and seek talented individuals who can bring their whole self to work, build inclusive teams and encourage diversity inside and outside the organization. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.com  Avanade® Is An Equal Opportunity Employer. Avanade prohibits discrimination and harassment against any employee or applicant for employment because of race, color, age, religion, sex, national origin, gender identity or expression, sexual orientation, disability, marital status or any other protected status. Avanade is also committed to providing accommodations for persons with disabilities in accordance with the Accessibility for Ontarians with Disabilities Act. Requisition ID - 52764 Avanade is the leading provider of innovative digital and cloud-enabling services, business solutions and design-led experiences, delivered through the power of people and the Microsoft ecosystem. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation and has 30,000 professionals in 24 countries. Visit us at www.avanade.com."}