{"jobID": "2836074535", "jobLocation": "El_Segundo_CA", "jobTitle": "University Programs: Data Analytics Intern", "companyRating": null, "companyInfo": {"Website": "www.raytheon.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Public (RTN) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "***Great opportunity for current college students entering their Junior or Senior year by Fall 2018 or college graduate students (entering or currently enrolled) in a graduate program by Fall 2018. If you are not a current college or graduate student, please visit our other opportunities at www.raytheon.com/careers and apply!***As a defense contractor, there are specific programs requiring a certain level of security clearance and special access for assigned staff. The selected candidate will be required to secure these accesses. Not being able to secure the Interim Secret Security Clearance needed for this position may result in an offer of employment being rescinded.This position requires a U.S. person or the ability to obtain an Export Authorization from the appropriate government agency for non-U.S. persons. Job Description: Join a dynamic digital analytics team to conduct research and development of communications strategies to micro-target key audiences for recruitment and retention of employees. This position will play a supporting role in implementing a data-driven approach to inform the companys marketing efforts. The intern should be able to quickly to learn analytic tools and be curious about how data drives communication strategies.  Job responsibilities may include, but are not limited to: digital monitoring and analysis of influencers and key topics, assisting with production of materials and reports, and partnering with teammates to drive talent acquisition campaigns by converting data into actionable insights. Additionally, the Digital Analytics Intern will spend time conducting and supporting research projects, organizing content assets, as well as database management.  For Multi-Level Intern Requisitions:  This position can be a Salary Grade of G04, G05 or NUG based on the candidate's qualifications as they relate to the skills, experience and responsibility requirements for the position. G04 (College Junior by Fall 2018) - must have completed 60 hours of collegeG05 (College Senior by Fall 2018) - must have completed 90 hours of collegeNUG (Post- Graduate-Masters-PhD by Fall 2018) - must have an undergraduate degree and currently enrolled or about to enroll in a graduate degree programRequired Skills:Excellent communication skills and a keen eye for detailPrior work experience (related or unrelated)Must be a college Junior, Senior or Graduate student by Fall 2018U.S. Citizenship is requiredDesired Skills:Knowledge of micro-targeting or open source intelligenceExperience with data analysis tools like Google Analytics, Adobe Analytics or TableauExcellent communication skills and a keen eye for detailRelevant class projects, internships or coursesCreative and enthusiastic to gain new knowledgeMinimum 3.0 cumulative GPA (Please upload an unofficial transcript when applying)Required Education (including major): Currently pursuing a BS / BA degree from a four-year university and entering as a college Junior or Senior year OR pursuing a MS / MA / PhD by Fall 2018. Must be working towards a degree in Communications, Public Relations, Journalism, Digital Communications, Data Science or Computer Science Major, or equivalent technical discipline. Must be appropriate grade level listed above118007Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}