{"jobID": "2812615139", "jobLocation": "Dearborn_MI", "jobTitle": "Machine Learning Scientist 46726 (SV1) (RS2)", "companyRating": null, "companyInfo": {"Website": "www.fastswitch.com", "Headquarters": "Dublin, OH", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob ID: 46726Machine Learning Scientist Position Description:The Global Data Insights and Analytics (GDI&A;) Product Analytics team supports Product Development organization with analytical solutions.We are looking for a data scientist with an expertise in Machine and Statistical Learning.As a member of this dynamic team, you will have the opportunity to work with some of the brightest global subject matter experts in product development and vehicle connectivity that are transforming the automobile industry.We are seeking a Machine Learning scientist to assist in all phases of project work, including problem formulation, model development, and deployment for use in support of Design, Product Development and Connectivity initiatives.The job candidate should have great autonomy, exceptional collaboration skills, and self-discipline to conduct original research and choose appropriate methodologies to solve related problems.Responsibilities: Analyze source data and data flows, working with structured and unstructured dataManipulate high-volume, high-dimensionality data from varying sources to highlight patterns, anomalies, relationships and trendsCollaborate with Product Development experts to understand their requirements and overall business needsApply Machine Learning technology to solve real-world automotive related problemsCommunicate and present models to business customers and executivesCollaborate internally and externally to identify new and novel data sources and explore their potential use in developing actionable business insightsExplore emerging technologies and analytic solutions for use in quantitative model developmentSkills Required:2+ years of experience in at least one of the following languages: R, Python, MATLAB, Java, C/C++/C#, SASSkills Preferred:2+ years of experience with SQL, Spark, OR Hadoop1+ year of post-graduate work experience (in a business or post-doc setting) involving complex quantitative modeling and analysis in any of the areas mentioned under Basic QualificationsDemonstrated ability in the application of Machine Learning in real-world industrial settings with large scale dataExperience with Deep Learning frameworks such as TensorFlow, Caffe, Caffe2, PyTorch, or MxNetStrong oral, written and interpersonal communication skills and an ability to work in a team environmentComfortable working in a fast paced and innovative environment where problems are not always well-definedExperience Required:2+ years of experience with Machine Learning models and tools to include one or more of the following: neural networks, deep learning, regression, classification, or clusteringEducation Required:Master’s degree in Computer Science, Computer Engineering, Statistics, Economics, Mathematics or Physics or related fieldEducation Preferred:PhD in a quantitative field such as Computer Science, Computer Engineering, Statistics, Economics, Mathematics, Physics Fast Switch, Ltd., delivering the Right Talent at the Right Time for over 21 years. We are an IT Consulting company with offices in Detroit, MI, Columbus, OH, Cleveland, OH, Cincinnati, OH, New York, Hartford, CT, Massachusetts, Minneapolis, MN, Los Angeles, CA, San Francisco, CA, and Tucson, AZ. We’re doing business in almost half the states in the union.  We're a financially strong, privately-held company that is 100% consultant and client focused. You are our most important asset!  We've differentiated ourselves by being creative, flexible, and fast. Throw out everything you've heard, seen, or felt about every other IT Consulting company.  We're different. Our consultants and clients tell us so, and it's our great people who make the difference! We do unique things, and we do them for Fortune 10 companies, Inc. 500 companies, and technology start-ups. We also have a strong belief in giving back to the communities we serve.  Our benefits are second to none and thanks to our flexible benefits options you can choose just the benefits that you need or want, options include:  • Medical and Dental (Fast Switch pays majority of the medical program)  • Vision  • Personal Time Off (PTO) Program  • Long Term Disability (100% paid)  • Life Insurance (100% paid)  • 401(k) with immediate vesting and 3% (of salary) dollar-for-dollar match  Plus, we have a lucrative employee referral program and an employee recognition culture.  In 2013, 2014, 2015, 2016 and 2017, Fast Switch was named one of the Top Work Places in Michigan by the Detroit Free Press and one of the Best Staffing Firms in 2016 and 2017. We have won the Columbus Business First “Fast 50” award 9 times in 12 years because of our strong growth which translates into more and better opportunities for our consulting staff members.  To view all of our open positions, please go to: www.fastswitch.com and at the bottom of the page click Job Opportunities, or get there directly at: http://tinyurl.com/z6r74up  You can also follow us on Twitter at: www.twitter.com/fastswitch  And you can become a fan of Fast Switch on Facebook at: http://tinyurl.com/y9y3gdp"}