{"jobID": "2738492527", "jobLocation": "San_Jose_CA", "jobTitle": "Talent Scientist - Industrial-Organizational (I-O) Psychologist", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "87000", "jobDescription": "Job DescriptionPreferred locations: RTP, NC, San Francisco, Austin, Boston, NY  About the Organization IBM is a global technology and innovation company headquartered in Armonk, NY. It is the largest technology and consulting employer in the world, with 380,000+ employees serving clients in 170 countries. In this new era of Cognitive Business, IBM is helping to reshape industries by bringing together our expertise in Cloud, Analytics, Security, Mobile, and the Internet of Things changing how we create, collaborate, analyze and engage. IBM offers a wide range of technology and consulting services; a broad portfolio of middleware for collaboration, predictive analytics, software development and systems management; and the world's most advanced servers and supercomputers. IBM invests more than $6 billion a year in R&D; and has 20+ consecutive years of leadership. About the Job IBMs Talent Acquisition organization has a full time opening for a Talent Scientist with a background in Industrial-Organizational (I-O) Psychology, Occupational Psychology, Organizational Behavior, Social Psychology, or a related discipline. This role is part of the Talent Science Team comprised of I-O psychologists and HR analysts focused on decision support solutions proven to isolate the best talent for IBM. Talent Science also provides day to day custom analytics, governance and decision support for external (~40,000 new hires per year globally) and internal hiring and staffing decisions.  On a global scale, you will lead the design, development, training and validation of next generation (e.g., artificial intelligence / Watson, games) and traditional (e.g. personality, cognitive ability, coding, structured interviews) assessments used globally across all business units and job families. You will also partner with Recruiters/Leaders from Talent Acquisition, Hiring Mangers, and Business Leadership to enable understanding, adoption and effective use of solutions to deliver the highest quality talent for IBM.  In addition, you will conduct analyses to inform and understand the impact of HR processes across the recruitment lifecycle designing and executing research projects that address critical HR business questions. You will translate findings into actionable insights, communicate results to key stakeholders, and influence process changes. Successful candidates should have a solid foundation in quantitative and research methods coupled with strong business acumen and an ability to present complex information to nonacademic audiences.  Required Technical and Professional Expertise Obtained PhD or equivalent in Industrial-Organizational (I-O) Psychology, Occupational Psychology, Organizational Behavior, Social Psychology, or a related discipline5+ years of experience in the design, development, training, validation and implementation of assessments and interviewsKnowledge of legal, regulatory and compliance requirements related to assessments5+ years of experience conducting job analysis research and creating success profile frameworksAdvanced statistical analysis ability (e.g., regression, analysis of variance, factor analysis, structural equation modeling, multilevel modeling, longitudinal data analysis, item response theory)Advanced ability using one or more statistical programs (e.g., R, Statistical Package for the Social Sciences (SPSS), SPSS Text Analytics, SPSS Modeler, SAS)Experience in leading large-scale research and work projects Preferred Tech and Prof Experience  Ability to conduct machine learning, natural language processing, and data mining Experience creating compelling data visualizations of statistical analyses, including dashboards Experience creating and delivering training across mediums (e.g., classroom, virtual, online) Experience partnering with vendors and developing external professional and benchmarking networks Experience applying statistics to HR and business problems beyond selection and assessment Experience conducting text and sentiment analysis EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}