{"jobID": "2685562922", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr Quantitative Analyst - Disciplined Equity", "companyRating": "3.6", "companyInfo": {"Website": "www.americancentury.com", "Headquarters": "Kansas City, MO", "Size": "1001 to 5000 employees", "Founded": " 1958", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "197000", "jobDescription": " The Disciplined Equity Research Group at American Century Investments is looking for a skilled programmer with a passion for data visualization and quantitative analysis. The applicant will be part of a nimble and talented fintech team, working together towards innovation and investment success. The work you do will directly contribute to enhancing the team’s research capabilities and stock-picking algorithms, which underlie over $14 billion in assets under management.  In this role, you will build analytics tools and design interactive dashboards detailing the behavior of our stock-selection models and equity portfolios. You will also play an important role supporting our data-driven investment processes – sourcing complex data sets and monitoring the quality of the output.  The position is based out of Mountain View, CA. ResponsibilitiesBuild analytics tools and interactive dashboards supporting our quantitative stock-selection algorithms and equity portfoliosContribute to the data-access layer underlying our cutting-edge research platform, including information retrieval techniques for unstructured dataMonitor the quality of our investment technology processesQualificationsB.S. or M.S. in Computer Science, Engineering, Statistics, Applied Mathematics, or other computationally intensive field.Experience with data structures and database designAbility to aggregate, manipulate, and visualize complex dataInterest in quantitative finance and time-series analysisExperience with R, Python, Java, Tableau, SQL is preferred.Ability to communicate technical findings and work within a team environment. We look forward to hearing from you! EOE Policy Statement: American Century Investments believes all individuals are entitled to equal employment opportunity and advancement opportunities without regard to race, religious creed, color, sex, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, gender, gender identity, gender expression, age for individuals forty years of age and older, military and veteran status, sexual orientation, and any other basis protected by applicable federal, state and local laws. ACI does not discriminate or adopt any policy that discriminates against an individual or any group of individuals on any of these bases."}