{"jobID": "2819195024", "jobLocation": "Franklin_Lakes_NJ", "jobTitle": "Audit Data Analytics Manager", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Description Summary Job Description We are looking for an experienced audit analytics professional to join the Internal Audit team. The AuditData Analytics Manager will be responsible for building the data analytics team and will align, direct, and manage the integration of data analytics and business intelligence necessary to meet the objectives of Internal Audit. The role will develop repeatable data analytics processes to provide real-time audit assurance and improve audit efficiency. This position will drive analytics and technology strategy for Internal Audit and will collaborate with the IA leadership team as well as other functions within the organization. Responsibilities:Engage and partner with Internal Audit team members to develop and deliver the Internal Audit data analytics strategy. Strategy to include all phases of the audit process including the risk assessment process, planning&scoping;, fieldwork and reporting.Propose and implement techniques, including analysis of both structured and unstructured data.Contribute innovative ideas in an effort to continuously improve the audit methodology and audit procedures. This includes the strategic deployment of technology (e.g., robotics process automation) to improve the effectiveness and efficiency of audit procedures and increase value to the business.Develop talent and build data analytics team.Develop training and usage of data analytics capabilities within Internal Audit team.Build and maintain Audit Data Analytics architecture, tools and techniques.Identify and develop innovative and re-usable analytics solutions/applications which can be used to drive auditor 'self-service.'Keep abreast of new industry tools and emerging technologies which may offer improved functionality or a more efficient and effective ability to deliver audit analytics solutions.Qualifications:B.A. /B.S. in data science, information technology, economics, business administration or related field required; Master's degree preferred.5 to 10 years of increasing experience, including data warehousing, data and business analytics, data governance, and data visualization required. The candidate must also have successful experience in leading and working with teams.Excellent verbal and written communication skills to facilitate the communication required for collaboration.Significant skill in research and data analysis, including data transformation, visualization, and presentation. Experience with enterprise data warehousing, statistical and business intelligence tools is required (Tableau, Qlik, Power BI, ACL Analytics or SQL).The ability to inspire and lead cross-functional groups and instill a common vision and framework is integral to this position. This candidate must be approachable and relate well to executives, management and staff.Strong understanding of business processes and related controls.Ability to coach and develop people.Self-motivated individual with ability to operate independently.Strong critical thinking and analytical skills.Preferred Qualifications:Data Scientist Profile and ExperienceBig 4 Consulting ExperienceCIA, CISA, CFE or any meaningful Big Data certification preferredExperience with software such as Tableau, Qlik, Power BI, ACL Analytics or SQLKnowledge of automation technologies like (e.g., Automation Anywhere)Experience working with SAP and knowledge of SAP tables/data Primary Work LocationUSA NJ - Franklin Lakes  Additional Locations  Work Shift"}