{"jobID": "2829552400", "jobLocation": "San_Bruno_CA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "129000", "jobDescription": "Position DescriptionThe @WalmartLabs Personalization team consists of platform, application engineers, scientists and product visionaries all working together to design, prototype and build technology-driven products and experiences that will change the future landscape of ecommerce. We are focused on building the global service layer that will enable the end-to-end customer experience, from finding the product to delivering it to the customer. This will span many markets, business models and form factors; therefore, we are looking for engineers who will bring not only an abundance of experiences in technologies, but an abundant curiosity to innovate.  Come join an organization where you'll get to work as part of a world-class team, solve problems that are at a scale few can create, and get to build products that are only bound by the scope of your imagination. Put your footprint on ground up development focused on building brand new products that will impact a Global customer base.Minimum Qualifications- MS, BS + 4 years of work experience in Computer Science, Machine Learning, Natural Language Processing, Statistics or related fields Solid foundation in data structures and algorithmsProficient with at least one modern compiled programming language (C++, Java etc) and one scripting language(Python, Ruby, PHP, Javascript etc.)Excellent problem solving and analytical skillsStrong skills in database systems (mySQL) and complex SQL queriesAdditional Preferred QualificationsCompany SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryThe @WalmartLabs Personalization team consists of platform, application engineers, scientists and product visionaries all working together to design, prototype and build technology-driven products and experiences that will change the future landscape of ecommerce. We are focused on building the global service layer that will enable the end-to-end customer experience, from finding the product to delivering it to the customer. This will span many markets, business models and form factors; therefore, we are looking for engineers who will bring not only an abundance of experiences in technologies, but an abundant curiosity to innovate. Come join an organization where you'll get to work as part of a world-class team, solve problems that are at a scale few can create, and get to build products that are only bound by the scope of your imagination. Put your footprint on ground up development focused on building brand new products that will impact a Global customer base. "}