{"jobID": "2836804154", "jobLocation": "Hercules_CA", "jobTitle": "Global Commercial Operations Data Governance & Analyst Manager (Data Governance Manager, GCO)", "companyRating": null, "companyInfo": {"Website": "www.bio-rad.com", "Headquarters": "Hercules, CA", "Size": "5001 to 10000 employees", "Founded": " 1952", "Type": " Company - Public (BIO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Abbott Labs, bioMérieux"}, "estimatedSalary": null, "jobDescription": " Responsible for ensuring all master data is accurate, complete and consistent across GCO organization. Drives development of policies and procedures in concert with process owners and Senior Management, Conducts audits, performs analysis, and recommends and implements improvements.  Uses technologies, analytical techniques and methodologies in order to retrieve and analyze a broad range of data from various sources to provide quality reporting in support of the business decision making.  Represents and act as the single point of contact on GCO data governance matters. Serve as a Subject Matter Expert for Big Data analytics and partner with other domain leads or stakeholders in developing analytical routines to drive business objectives. Identifies areas for data quality improvements and helps to resolve data quality problems through the appropriate choice of error detection and correction, process control and improvement, or process design strategies.Ensures quality of master data in key systems as well as development and documentation of processes with other functional data owners to support ongoing data maintenance.In collaboration with subject matter experts defines and implements data strategy, policies, controls, and programs to ensure GCO Customers data is accurate, complete, secure, and reliable.Ensures integrity of master data in key systems.Define and coordinate standardization of definitions, business rules, and business usage for critical data elements, attributes, list of values and reference data with other functional data owners.Work with system owners to document existing change control processes and define new processes, define and review data exception reports and work with the respective business area and team to understand how the change will impact business processes and downstream uses of the data.Identify, document, and manage data quality issues and/or improvement opportunities.Define appropriate metrics to measure the quality of the data in terms of fit for use.Define process, frequency, and responsibility for measuring data quality as defined.Assist with preparation of data quality assessments and publishing assessments results.Define acceptable levels of quality for each metric and any business rules associated that may indicate business process issues or the need for steward policy.Build consensus with business stakeholders to establish report ownership and accountability for key reports.Identify report consumers and establish strong working relationships with both report owners and consumers to enable key report governance and management.Build key report and co-ordinate ongoing report maintenance.Establish periodic completeness and accuracy recertification procedures for high risk reports.Serve as a subject matter expert for key reports.Experience working with industry standards, regulations, and guidelines in database warehousing and other relevant systems.Database management and data structure background with progressively increasing responsibilities.Experience working with company hardware and software products to make sound financial recommendations.Experience working with information security practices and available security software packages. Experience working with relational databases.SAP Customer Master, Salesforce, Business Intelligence and insights. PowerBI, Excel, SalesForce.com, SQL Server Management Studio and/or Azure(Hue). Must be able to write SQL queries.Proven experience in developing and executing strategic road-maps.Demonstrated ability to think strategically about business, product, and technical challenges in an enterprise environment.Proven ability to influence others in absence of hierarchical authority.Bachelor's degree or equivalent combination of education and experience.Bachelor's degree in information science, data management, computer science or related field preferred.About Bio-Rad: Bio-Rad is a global leader providing a broad array of clinical diagnostics and life science research products. With a team of more than 7,800 employees and a global network of operations serving our customers, we help people live longer, healthier lives.  Bio-Rad was founded over six decades ago and has continued to provide the healthcare industry with innovative and useful products that help life science researchers accelerate the discovery process and medical diagnostic labs obtain faster, better results.  EEO/AA Employer/Veterans/Disabled/Race/Ethnicity/Gender/Age Agency Non-Solicitation: Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes."}