{"jobID": "2747022110", "jobLocation": "Cerritos_CA", "jobTitle": "Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.revolve.com", "Headquarters": "Cerritos, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "Meet REVOLVE: REVOLVE is the virtual home for an unrivaled collection of over 700 of the world's most-coveted established and emerging brands in women's and men's designer apparel, shoes, and accessories. REVOLVE provides the highest quality online and mobile shopping experience, serving the style-savvy consumer with impeccable customer service. Based in Los Angeles, REVOLVE’s aesthetic is deeply rooted in the Southern California lifestyle from which it was founded, where a savvy view of fashion and fun-loving attitude are infused into the entire REVOLVE customer experience. For more information please visit www.revolve.comAt REVOLVE the most successful team members have a thirst and the creativity to make this the top e-commerce brand in the world. With a team of 800+ based out of Cerritos, California, we are a dynamic bunch that are motivated by getting the company to the next level. It’s our goal to hire high-energy, diverse, bright, creative, and flexible individuals who thrive in a fast-paced work environment. In return, we promise to keep REVOLVE a company where inspired people will always thrive.Some of the sweetest perks we offer aren’t in a typical benefits package; like a hefty discount on items we carry – as in 50% or more off retail prices, free weekly lunches, and pretty rad company parties.To take a behind the scenes look at the REVOLVE “corporate” lifestyle, check out our Instagram @REVOLVEcareers or #lifeatrevolve.Are you ready to set the standard for Premium and Luxury online shopping?The Opportunity:Use a diverse skill set across math and computer science, dedicated to solving complex and analytically challenging problems at REVOLVE.The Details:Essential Duties and Responsibilities include the following. Other duties may be assigned.• Partner closely with business leaders in Marketing, Product, Operations, Buying team to plan out valuable data science projects• Conduct complex analysis and build models to uncover key learning form data leading to appropriate strategy recommendations• Work closely with the DBA to improve BI’s infrastructure, architect the reporting system, and invest in time for technical proof of concept• Serve as an algorithm and engineering lead to build advanced quantitative solutions• Work closely with the business intelligence and tech team to define, automate and validate the extraction of new metrics from various data sources for use in future analysis and reports• Work alongside business stakeholders to apply our findings and developmentRequired competencies:To perform the job successfully, an individual should demonstrate the following competencies:• Outstanding analytical skills, with a strong academic background in statistics, math, science or technology• High comfort level with programming, ability to learn and adopt new technology with short turn-around time• Familiarity with SQL, ability to dive into the dataset and arrive at a conclusion• Knowledge of quantitative methods – statistics, machine learning, general data analysis• Intense intellectual curiosity – strong desire to always be learning• Proven business acumen and results oriented• Ability to demonstrate logical thinking and problem-solving skills• Strong attention to detailMinimum Qualifications: • Master Degree is required• 2+ years of experience in a strong analytical environment• Python, NumPy, and other packages• Excel Pivot Table, advanced functions• Advanced SQL experience, query optimization, Data extract• Ability to build and validate modelsPreferred Qualifications: • Ph.D. in a quantitative field• Strong business acumen• 5+ years of analytical experience preferred• Advanced SQL experience, query optimization preferred• Experience with Tableau, Google Analytics preferred• Experience with A/B testing preferred• Experience with E-Commerce marketing (Acquisition Retention, Retargeting, SEO, Social Media, etc.) is a plus• Familiarity with JSP, cron job, ability to work with APIA successful candidate works well in a dynamic environment with minimal supervision. At REVOLVE we all roll up our sleeves to pitch in and do whatever it takes to get the job done. Each day is a little different, it’s what keeps us on our toes and excited to come to work every day. "}