{"jobID": "2837180757", "jobLocation": "San_Diego_CA", "jobTitle": "Principal Scientist, Computational Biology (Oncology)", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.  We seek a talented, collaborative computational researcher to drive the effort in multi-omics data integration and target evaluation/prioritization for solid tumor indications. The successful applicant is expected to play a key scientific role in leveraging innovative computational analysis strategies across a variety of biological and chemical data sources to empower data-driven decisions in development of next generation Employer protein homeostasis therapies for solid tumor indications.  Reporting to the Research Analytics lead for Protein Homeostasis research, the successful candidate will work alongside Employer Research colleagues in the Protein Homeostasis Thematic Center of Excellence (TCoE) and Chemistry and Structural Biology based in San Diego California, and the global Research Informatics and Knowledge Utilization (RIKU) department. Scientific objectives and research scenarios include:Integrating data across internal and public datasets for new target identification, prioritization and indication selection,developing systems biology approaches for assessing disease relevance and generating therapeutic hypothesis on novel targets,early identification and predictive leverage of patient molecular subtypes most likely to benefit from a targeted intervention,inference of synergistic target combinations by leveraging pharmacogenomics data and molecular networks. Data originate from a wide range of cellular and molecular profiling platforms, including transcriptomic, proteomic, genomic, functional and immunophenotypic assays, and from the efforts of colleagues in structural biology and cheminformatics. The role offers the opportunity to directly impact the delivery of transformational therapies in key diseases of unmet medical need. Strong interest in the inter-disciplinary application of computational analysis methods to life sciences data is imperative. Responsibilities: Working in collaboration with computational, biological and drug discovery scientists across the Employer Research and Development organization, responsibilities include but are not limited to: Accelerate cutting edge predictive computational research in drug discovery utilizing new technologies, model systems and the power of AI.Develop and apply innovative computational analysis to leverage internal, public and partner datasets and empower data-driven decisions for new target prioritization and validation.Lead the identification and systematic ingestion of publicly available cancer genomics and relevant annotation and literature datasets, and their integration with internal data sources.Collaborate as a member of cross functional teams to drive rational decision making across early drug discovery programs, including supervision of junior scientist as required.Author scientific reports, and present methods, results and conclusions to publishable standard.Contribute to planning and execution of collaborative projects with leading academic and commercial research groups worldwide.Background experience & complementary knowledge:Ph.D. in computational biology or bioinformatics with at least 8 years of experience in applying quantitative approaches to solve biological problems in university, hospital, pharma or biotech research environments, with considerable depth of experience in cancer genomics.Demonstrated ability to integrate heterogeneous data sources and perform multivariate analysis of integrated datasets.Proven expertise in the development and/or implementation of algorithms to distill, analyze and interpret complex datasets, with focus on evidence integration and mechanistic inference.Experience of computational biology research on a wide variety of molecular profiling platforms, including mRNA profiling, mutational profiling, DNA copy number quantification, epigenetic profiling and proteomics.Familiar with various cancer genomics consortium efforts, tools and databases.Expertise in algorithmic implementation, statistical programming and data manipulation, using e.g. R/Bioconductor and contemporary, open-source bioinformatics tools and database structures.Track record of peer-reviewed publications in top-tier scientific journals.Proven problem-solving skills, collaborative nature and adaptability across disciplines.Excellent verbal and written communication skills. Fluent verbal and written English language skills prerequisite. #LI-POST  BIO-USEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}