{"jobID": "2780977689", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.joinhoney.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Honey is helping millions save money every day and we're growing! Our data pipelines process hundreds of millions of events per day. We are looking for engineers who love distributed systems and are motivated by the challenge of scale. Data engineering at Honey is a small team, so youll have opportunities to work on a variety of product features and technology platforms. What Youll Do: Design, build and operate Honeys data pipelines with a focus on performance and reliability.Participate in new feature development for recommendations, product catalogs, and mobile applications.Propose and evaluate storage technologies and methodologies with an eye toward scalability and performance.About You: 5+ years programming in at least one modern programming environment. Python, Scala, or Node.js are helpful but not required.5+ years architecting with both SQL and no-SQL data stores. We use Redis, MongoDB, BigQuery, and HBase/Big TableExperience and working knowledge of Elasticsearch.Experience designing schemas and maintaining representations for low latency, request- cycle queries.Experience with streaming platforms (PubSub, Kafka, Kinesis) and near-real-time data pipelinesWorking knowledge of statistics and experimental designComfortable building and maintaining data infrastructure in the cloud Honey is an equal opportunity employer. We are committed to building a diverse and inclusive company. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, disability status or genetic information, in compliance with applicable federal, state and local law."}