{"jobID": "2674807650", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer, Payformance Solutions", "companyRating": "3.5", "companyInfo": {"Website": "www.altarum.org", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Booz Allen Hamilton, MPHI, RAND"}, "estimatedSalary": "74000", "jobDescription": "About Us: We are Chicago based team. Our team writes beautiful & functional code that is easily reproducible and testable. We encourage open source contributions, especially with the technologies we use. We don’t release on Fridays.  In addition to the meaningful and challenging work, Payformance’s dynamic work environment emphasizes integrity, personal commitment, and teamwork. We allocate each employee 15% innovation time per week with optional work-from-home days once a week. Plus, outstanding benefits: 100% employer-paid health insurance options (employee, spouse, & family), dental & vision coverage, and 401k matching. About You: We want developers that are serious about their work but don’t take themselves too seriously. You are flexible, can quickly pick up new technologies, and are a DIYer with a GSD mindset. 4+ years of experience in the fieldBackground writing in Python, ScalaBackground working with LinuxExperience with SQLExperience with data acquisition (writing crawlers, interfacing with various api’s, fetching and transforming data, etc.)Experience with web services architectureExperience implementing Spark or HadoopSkills (must have some or all):Experience working with task schedulers (e.g., Aurora, Marathon, Airflow, etc.)Experience with distributed computing / concurrent data pipeliningELK Stack (i.e., Elasticsearch, Logstash, Kibana)Experience working with message queues (Kafka preferred)Experience with Config Management software (Ansible preferred,)Knowledge of security concepts in programming such as OWASP Top 10 or SSL Configuration.Education: A minimum Bachelor’s Degree in Computer Science, Engineering or any equivalent education or experience.  At Payformance, we don’t just accept difference - we celebrate, support, and thrive on it for the benefit of our employees, our clients, and our community. Payformance Solutions is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to, among other things, race, color, religion, sex, sexual orientation, gender identity, national origin, age, marital status, status as a protected veteran, or disability."}