{"jobID": "2765967039", "jobLocation": "Pasadena_CA", "jobTitle": "Deep Learning and Vision Robotic Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.irobot.com", "Headquarters": "Bedford, MA", "Size": "501 to 1000 employees", "Founded": " 1990", "Type": " Company - Public (IRBT) ", "Industry": " Retail", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Do you want to work on cutting-edge technologies that will be the foundation for future products of the largest consumer robotics company in the world? As a pioneer in the consumer robot industry, iRobot’s goal is to drive innovation, serve as an industry catalyst and change the world by fueling the era of robots. To support and encourage the development of robot technology, we offer comprehensive resources for third-party developers, providing information and products that facilitate the creation and easy integration of new payloads, behaviors and capabilities on our platforms.  iRobot’s Technology Organization is looking for an exceptional Deep Learning and Robotics Vision Scientist to join our team. You can thrive in an environment with fuzzy requirements and enjoy working on the front end of product development. Key personality attributes should include passion, energy, and the desire to build. As part of the Technology Organization, you will be at the forefront of proposing, choosing, and implementing new technologies that will be incorporated into iRobot’s next generation products. Design, implement, train, evaluate and optimize novel perception algorithms based on state-of-the-art deep learning techniques, such as convolutional neural nets (CNNs).Solve problems related to object detection, scene classification/understanding, map segmentation and robot localization with the goal to be deployed in cloud-connected consumer robotics products.Define and perform experiments leveraging relevant large scale datasets to identify and tune viable proof-of-concept approaches.Transfer and optimize proven approaches to run on cloud, embedded processors, or hybrid targets.A solid understanding of and experience with Deep Learning, in particular with design, training, evaluation and optimization of convolutional neural net (CNN) architectures in the context of object recognition, scene classification or scene segmentation.Experience with at least one major deep learning framework (such as Caffe, Theano, Torch, Tensorflow). Experience with Caffe preferred.Self-motivated learner who keeps up-to-date with the current state of computer vision and deep learning techniques/architectures.A solid background in machine learning/classification concepts.A solid background in computer vision/image processing concepts.Minimum of 3 years experience in algorithm implementation in C++ and Python.Hands on experience with computer vision or robotic systems operating on real-world datasets.Strong analytical skills and mathematical foundation.Good understanding of computer systems / architecture trade-offs.Comfortable in a Linux-based environment.Excellent verbal and written communications skills.Ability to work independently, without direct supervision.Strong problem solving skills and ability to learn quickly.Minimum Degree: PhD in Computer Vision, Computer Science, Data Science, Machine Learning, Robotics, or related fieldDesired Qualifications:Experience with CUDA GPU programming.Experience with Cloud computing, in particular AWS EC2 and Docker.Experience with Deep Net compression techniques (both size and speed).Experience with embedded processor platforms.Experience with mobile GPUs / OpenCL / OpenGL / shader programming.Experience with robotics or other embedded real-time systems.Experience with RGB-D sensors and algorithms.Background in SLAM, 3D reconstruction, motion planning.Experience with IoT protocols and products. We are the leading global consumer robot company, designing and building robots that empower people to do more, both inside and outside of the home. Founded by MIT roboticists who had the vision of making practical robots a reality. To date, we have sold over 20 million robots and globally employ more than 600 of the robot industry’s best and brightest. iRobot is committed to fostering invention, discovery and technological exploration in the pursuit of practical and valuable robot products for the home. iRobot stock trades on the NASDAQ stock market under the ticker symbol IRBT.  Our Pasadena office is in the heart of Old Town, set against the San Gabriel mountains. iRobot is headquartered in Bedford, Massachusetts. We also have offices in Europe, Japan, China & Hong Kong. Imagine the future you could help us build as a fellow iRoboteer!  Instagram: @irobotcareers  Check out #LifeAtiRobot and follow us on Instagram:  iRobot is an Equal Opportunity Employer"}