{"jobID": "2612152111", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Analytics - Product Foundation", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.As Facebook continues to expand to all corners of the world, having performant apps matters more than ever. The vast majority of our users access Facebook using old devices and unreliable networks, and bad performance leads to less engaged users and a poor user experience. In this role you will be working closely with the team responsible for making sure the Facebook app delivers the best possible performance across iOS, Android and Web platforms. Our team works cross-functionally with product and infrastructure teams across Facebook to improve app start time, scrolling performance as well as reduce crashes and minimize resources consumption. Were looking for a thought leader in this space to help us frame up and prioritize all the performance investments that were making across the company. This position will directly engage with the CTO for the Facebook app and have the opportunity to directly shape our investments and roadmap for the next 3 years.Some key challenges were looking to solve in the next year include:How often do users have a bad experience while using the apps? How can we quantify this and how does it affect engagement?What sectors of the population are the most sensitive to performance regressions and how should we adapt our strategy as a result?How should we prioritize our efforts across different users and performance metrics to deliver the best possible performing app? This position is based in Menlo Park or Seattle, WA offices. Responsibilities:"}