{"jobID": "2804490813", "jobLocation": "San_Diego_CA", "jobTitle": "Light Source Research Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.asml.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (ASML) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " General Atomics, KLA-Tencor, Illumina"}, "estimatedSalary": "81000", "jobDescription": " We are a part of ASML, located in beautiful San Diego. ASML provides chipmakers like Intel, Samsung, TSMC, Global Foundries and others with everything they need - hardware, software and services - to mass produce patterns on silicon, helping to increase the value and lower the cost of a chip. Our key technology is the lithography system, which brings together high-tech hardware and advanced software to control the chip manufacturing process down to the picometer. Our vision is a world in which semiconductor technology is everywhere and helps to tackle society’s toughest challenges.  We are presenting you with a unique and exciting opportunity to join a dynamic and innovative Technology Development team, focused on conceiving and demonstrating the technologies required for next generations of high-power extreme ultraviolet (EUV) light sources. Based on a laser produced plasma (LPP), our light source relies on a wide range of unique and challenging technologies, ranging from tin droplet formation and laser light amplification to tin debris disposal and EUV collection. You are invited to bring your passion, knowledge and expertise in areas of applied physics, optics, photonics, lasers to push the boundaries of these technologies forward.ResponsibilitiesCreate experimental data collection, storage and analysis automation systems for complex electro/opto/mechanical and vacuum systemsDevelop data collection, analysis and documentation applications and proceduresPlan, develop and execute system and subsystem performance tests, analyze test results and extract actionable knowledgeDocument learning and communicate knowledge to product development teams to guide product improvement and developmentProvide experimental data infrastructure and support for a team of scientistsMinimum QualificationsBachelor’s or Master’s degree in physics, electrical engineering, photonics, computer science or similar field with focus on data acquisition, processing and analysisUnderstanding of computer and data acquisition architectures, sensors, data communication and networksHands-on experience with building data acquisition and processing systems using oscilloscopes, cameras and data acquisition boardsExtensive experience with experimental data analysis and development of data analysis tools with Matlab and Python and data acquisition systems such as NI LabviewAbility to clearly and logically communicate ideas and knowledge to various audiencesPreferred Skills And Experience QualificationsExcellent understanding of computer hardware and software at the level of data acquisition, storage and computingPractical experience with collecting, storing and routine processing multi-gigabyte data setsExperience with high performance computing systems and parallel data processingPractical experience with relational and time series databases like InfluxDB, SQLKnowledge and practical experience with modern data visualization methods and techniquesDemonstrated ability to work effectively as a part of a team and lead investigation and research effortsOther informationEEO/AA (W/M/Vets/Disability) Employer"}