{"jobID": "2735381062", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. HRIS Reporting and Data Analytics Analyst", "companyRating": null, "companyInfo": {"Website": "www.nio.io", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "OverviewThis position will analyze and interpret data in order to support the objectives of the Human Resources department and our business partners. The Sr. HRIS Reporting and Analytics Analyst will compile reports, analyze and synthesize data in order to communicate key HR metrics to stakeholders in HR and other stakeholders in the company. They will also analyze data in order to identify areas of concern or best practices for specialists to review in more detail. Essential Functions HR ReportingManage timeliness and quality of recurring and ad hoc reportsInteract with end users (HR and other departments) to understand business issues and provide advice about data that are available to support the businessDevelop simple to complex HR reports using data from multiple HR data sourcesPerform complex data manipulation and aggregation of data from multiple HR data sources.Design and develops dashboards to answer relevant business questions and communicate report data in a concise and easy to understand format.Integrate disparate data from multiple systems and toolsLeverage technology to deliver the right information to the customer in a timely fashion. This would include creating dashboards and dynamic reporting.Use knowledge of relational databases to retrieve data from Core HR systemProactively work to improve reporting (value-add, efficiency, quality, speed) and delivery processes considering all available technologiesCollaborate with HRIS to maintain data integrityHR Data AnalyticsDevelop and interprets reports which clearly and concisely show key workforce trends and problem areas, including status and trendsReview reports to identify trends or areas that may require further review by HR team. This could include ad hoc analysis or systematic analysis (for example, the Recruiting Activity Report)Plan and conduct end to end analysis including data gathering and validationHR Project SupportSupport would be inclusive of but not limited to:Support project lead on timeline and communication for HR technical projectsManage vendor directly to ensure technical deliverables are metAnalyze project data to ensure optimal system operation, best use of time and resources as well as value of the projectDesign and create organizational feedsIdentify and troubleshoot issues during projectPartner with project stakeholders prepare, analyze, and communicate reports to identified audiencesSupport the technical documentation of project either by creating documents or reviewing vendor documentsManage any ad hoc analysis requests related to project and project dataCompetenciesAnalysis and JudgmentCollaborationBusiness AcumenTechnical competenceCommunicationQualificationsKnowledge of and experience in HR Recruiting process and metricsAdvanced proficiency in Microsoft Office applications - Word, Excel, Access, Outlook; experience with Workday requiredCompensation knowledge preferredDemonstrated ability to interface with both internal and external business partners and act as liaison when neededBachelors degreeExcellent organization skills and meticulous attention to detail; process orientedExcellent communication skills, written and oral, and interpersonal skillsAbout NIOOur mission is to shape a joyful lifestyle for our users by offering smart, premium electric vehicles and providing the best user experience. We are a global company with world-class research and development, design and manufacturing centers in Shanghai, Beijing, San Jose, Munich, London and nine other locations. NIO U.S. is our Global Advanced Technology Center and North American headquarters.Our global company has achieved many great milestones such as:· Securing the inaugural Formula E Drivers Championship title in 2015· Unveiling the fastest electric car in the world, the EP9, and setting a lap record for an electric vehicle at the Nürburgring Nordschleife in 2016· Unveiling its vision car, EVE, in 2017· Setting a new world speed record for an autonomous vehicle with the EP9 at the Circuit of the Americas in 2017· Launching the ES8, a seven-seat high performance electric SUV, on December 16 with deliveries slated to begin in 2018.Want to be a part of this? Join us!NIO is committed to a policy of equal employment opportunity. We recruit, employ, train, compensate, and promote without regard to race, color, age, sex, ancestry, marital status, religion, national origin, disability, sexual orientation, veteran status, present or past history of mental disability, genetic information or any other classification protected by state or federal law.NIO US is an E-Verify employer."}