{"jobID": "2836730146", "jobLocation": "Piscataway_NJ", "jobTitle": "Business Intelligence Analyst & Report Writer, Corporate Activities", "companyRating": "4.0", "companyInfo": {"Website": "www.ieee.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1963", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": "Job Summary: The overall purpose of this position is to develop, document, support and provide standardized and/or customized reports from the central database and other sources to support IEEE business. The incumbent responds to work requests and scheduled projects, proactively communicating and collaborating with colleagues to analyze and meet information needs. He/she communicates professionally with all levels of staff and management using effective visual, verbal, and written communication skills and may also provide training and support to these customers.The incumbent will learn to leverage a wide variety of internal and external data sources using advanced tools to deliver routine and ad hoc information to internal customers and external partners in the form of interactive dashboard reports for marketing analysis, labels for internal customer outreaches, lists for external sales and print/digital publication fulfillment for all IEEE subscriptions.He/she will make recommendations to improve the efficiency, quality, and value of reports and underlying data assets and assists in developing priorities in conjunction with leadership. Also participates in release testing, system upgrades and recommendations for process improvements.The role typically reports to a Manager, has no direct reports, and works independently as well as collaboratively.Key Responsibilities:Specific duties include but are not limited to:Business Intelligence, Report Writing and Analysis (80>)• Respond to work requests that result in Developing and/or leveraging existing Business Intelligence Dashboards, Reports, ad hocs and counts based on internal customer needs. • Create analyze customized database reports.• Perform data analysis, data querying, and data validation functions.• Write general queries, views, and stored procedures and functions.• Create scripts for importing, exporting, analyzing and mapping data. • Provide support to end users on standardized and ad hoc reports.• Collaborate with business stakeholders and internal customers to understand their needs, define or enhance reporting requirements.• Demonstrate outstanding communication skills to translate reporting requests in order to accurately meet the actual information and deadline needs of users. • Analyze data in the CRM and related sources to establish knowledge of data for accurate retrieval and use in report writing. • Troubleshoot and facilitate solutions for report issues.Other (20>)• Contribute to requirements, testing and process change triggered by existing, new and evolving technology projects and system• Contribute to and disseminate data usage guidance in support of industry best practice, IEEE policy conformance and evolving global legal compliance requirements.• Provide accurate, actionable descriptions of issues and impact via help desk tickets; collaborate with IT to reproduce issues, identify and test solutions.• Identify and implement process improvements, using technology as solution where feasible.• Identify issues with data integrity; participate in root cause analysis and process improvement.• Apply critical thinking to resolve data issues and combine data from multiple sources using tools such as SAS, Marketo SAP and/or Tableau.• Manipulate high volume, high dimensionality data from varying sources to highlight patterns, anomalies, relationships and trends. Research data anomalies and recommend corrective actions.• Conduct data analysis to determine completeness and accuracy of source data to determine feasibility and type of output that can be produced. • As necessary, serve as backup to colleagues including Senior Report Writer, Database Report Writer and Data Operator.Education and Experience:• Bachelor’s degree or equivalent in related fields • Minimum two years relevant report writing experience using BI and Analytical tools such as OBIEE, Pentaho, Cognos, Business Objects, SSRS, Access• Basic understanding of a wide range of interpretive analysis tools (eg, trend analysis, spreadsheets, comparisons, graphs). Ability to question and eyeball data quality in reports. • Experience with Structured Query Language (SQL)• Knowledge/experience with CMS, data visualization tools• Experience with data visualization tools (eg, Tableau) a plus• Association or publishing industry experience a plus• Experience in an Agile environment a plusSkills & Other Requirements: • Advanced Excel skills• Solid MSWord, PowerPoint, Visio and GoogleTools skills• Solid presentation, public speaking and communication skills.• Strong analytic, problem solving, conceptual and data interpretation skills • Strong written and verbal communication skills including the ability to communicate complex information effectively to technical and non-technical users• Demonstrated understanding of business intelligence best practices• Ability to work successfully in a team environment and independently, effectively handling detail oriented work while meeting schedules and deadlines• Ability to prioritize and manage time effectively, thrive in a fast paced work environment and manage multiple projects simultaneously• Ability to take ownership and initiative on projects• Exhibits professional demeanor, interpersonal skills and excellent customer service• Demonstrates a willingness and ability to learn and contribute• Must be a technologically and communications savvy knowledge worker who seeks out technology solutions to business challenges and processes.Values & Expectations: • Display empathy and positive regard for others in written, verbal and non-verbal communications. • Work effectively with colleagues by practicing punctuality, respect for deadlines, collaborative problem solving, and honest communication. • Build trusting relationships by acting with integrity, courtesy, and responsibility, even in the face of stress or demanding workplace conditions. • Maintain proficiency as needed and approved by attending trainings, reading job-related materials, and meeting with others in area of responsibility. For information on work demands and conditions required for this position, please consult the reference document below, “Physical, Mental, and Work Environment Standards for IEEE Positions.” This position is classified under [Category I –Office Position].IEEE is an EEO/AAP Employer/Protected Veteran/Disabled================================================================================Disclaimer: This job description outlines the general nature and key features performed by various positions that share the same job classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties and qualifications required of all employees assigned to the job. Nothing in this job description restricts management’s right to assign or re-assign duties to this job at any time due to reasonable accommodations or other business reasons. "}