{"jobID": "2796625084", "jobLocation": "Dearborn_MI", "jobTitle": "Digital Designer/Developer", "companyRating": null, "companyInfo": {"Website": "www.marketingassociates.com", "Headquarters": "Detroit, MI", "Size": "201 to 500 employees", "Founded": " 1967", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " MRM//McCann, Urban Science"}, "estimatedSalary": null, "jobDescription": "Job Description:SUMMARYAs a Digital Designer/Developer you will support production of email campaigns for our client, a leader in their industry. The Digital Designer/Developer is responsible for design and execution of responsive design and development of email promotions ensuring that projects are completed accurately and on schedule, as well as maintaining existing ongoing efforts.ESSENTIAL DUTIES AND RESPONSIBILITIESDesign and maintenance of daily emails and testing of new creative conceptsDetermine the best approach for project-specific email design initiativesWork with a cross-functional team to produce high quality workResearch design and interactive trends using internet and other means Required Experience:QUALIFICATIONSAdobe Creative Suite, experience with HTML/CSS and email coding ability are required. Responsive email design experience is a plus. The ideal candidate should have an understanding of user experience and be passionate about design. You will interact closely with the email team, outside agencies, marketing personnel and various other departments to develop, schedule, and produce projects through to completion.EDUCATION AND/OR EXPERIENCEMust have at least 2 years of professional experience in email designExperience with HTML/CSS and HTML for emailAbility to build emails that render properly across all major email clients and browsersExperience building responsive design; mobile first design experience (big plus)Ability to quickly understand brand or design goals and integrate style into your designStrong communication and problem-solving skills in both technical and business environmentsConfident and capable of working on multiple projects, with the ability to deliver results on a tight deadlineProficiency in Salesforce ExactTarget or other similar email service providerAll candidates must have an online portfolio displaying user-centered email designExceptional written, verbal communications and presentation skillsTeam oriented with strong organizational skills and ability to manage multiple projectsAdaptive learner able to make decisions but comfortable with ambiguityStrong understanding of retail marketing is a plusOneMagnify is an equal opportunity employer. Keyword: Digital Designer / Developer  From: OneMagnify"}