{"jobID": "2697497837", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Operations Analyst HPS", "companyRating": "3.6", "companyInfo": {"Website": "www.evolenthealth.com", "Headquarters": "Arlington, VA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (EVH ) ", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "It’s Time For A Change…Your Future Evolves Here Evolent Health has a bold mission to change the health of the nation by changing the way health care is delivered. Our pursuit of this mission is the driving force that brings us to work each day. We believe in embracing new ideas, challenging ourselves and failing forward. We respect and celebrate individual talents and team wins. We have fun while working hard and Evolenteers often make a difference in everything from scrubs to jeans.  Are we growing? Absolutely—56.7% in year-over-year revenue growth in 2016. Are we recognized? Definitely. We have been named one of “Becker’s 150 Great Places to Work in Healthcare” in 2016 and 2017, and one of the “50 Great Places to Work” in 2017 by Washingtonian, and our CEO was number one on Glassdoor’s 2015 Highest-Rated CEOs for Small and Medium Companies. If you’re looking for a place where your work can be personally and professionally rewarding, don’t just join a company with a mission. Join a mission with a company behind it. What You’ll Be Doing:Provide advanced troubleshooting, analysis and triage for ETL and data issues and work with other teams to identify and implement resolutionsWork with onsite and offshore resources to monitor status of and resolve any data file movement or loading issues for Health Plan Services (HPS) inbound and outbound interfacesMonitor health data interface using a variety of technologies including but not limited to SQL server, SSIS, and SASWork with HPS Engineering team to adjust, improve, and expand operational functionalityDevelop tools, techniques to improve efficiency/automation of Data Operations team monitoring, alerting, or communication processesDevelop detailed client-specific operational SOPs and documentationServe as liaison between technical and non-technical stake holders in cross functional initiativesAssist in training and supporting offshore resources to maintain a high level of operational qualityThe Experience You’ll Need (Required):Bachelor’s degree in Healthcare Management, Computer Science or another technology/business field of study or equivalent experience required.3-5 years experience working within a data or IT Operations groupMust have experience creating complex SQL statements, writing Stored Procedures, designing SSIS packages, and must be familiar with relational database modeling and design conceptsExperience with MoveIT, Aldera(or other claim processing systems), sftp/SSH applications, CMS EDGE Server, Linux/Unix scripting, SAS, Jira, and Confluence a plusKnowledge of healthcare industry and healthcare x12 format (especially, 837, 834, 835 files) or eligibility or claims data a big plusAbility to work independently with minimal supervision and collaboratively within a teamWork effectively with customers and internal staff in fast-paced environment and time-sensitive situationsAbility to work in a team environment across multiple functional groupsAbility to explain technical concepts to non-technical usersFlexibility to work effectively in a constantly changing environmentStrong analytical, root cause analysis skillsEagerness to expand technical skill setEvolent Health is an equal opportunity employer and considers all qualified applicants equally without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}