{"jobID": "2818075106", "jobLocation": "Irving_TX", "jobTitle": "Lead Data/Systems Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.ctg.com", "Headquarters": "Buffalo, NY", "Size": "1001 to 5000 employees", "Founded": " 1966", "Type": " Company - Public (CTG) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Wipro, Impact Advisors"}, "estimatedSalary": null, "jobDescription": " Computer Task Group (CTG) is seeking a Data/Systems Lead Business Analyst for a project with an enterprise healthcare solutions company.  Project Location: Irving, TX- local candidates only  Project Duration: 1-year Contract with possibility to be extended  Rate: $62 per hour W2  W2 employees only, please no C2C Job Description: The Data/Systems Lead Business Analyst functions as the liaison between the Developer and the client reviewing, analyzing, evaluating and documenting the technical component of data or systems business requirements for data/systems enhancements or new client implementations. Instructs, directs and communicates with the team to ensure deadlines are met. Assists manager with staff development and quality assurance standards as needed. Typically, leads projects with moderate to large budgets or of a moderate to long duration. Executes implementations of diverse scope and complexity. Manages projects from concept to implementation. Main Duties and Responsibilities:Reviews, analyzes, and evaluates data/system business requirements for existing and new developmentWrites detailed technical and business specifications, program functions, and steps required to develop or modify data files or systemsCreates project plans, leads project meetings and coordinates other project activities to ensures deadlines are metLeads the data analysis and profile efforts for new client implementations and system enhancementsLeads technical meetings with IT and business project teamProvides data mappings, user interface specifications, processing logic as per business requirements to the DeveloperCommunicates with users, developers and other team membersTests development efforts and assists the client in user acceptance testingProvides regular status reports clients, developers, and management as neededPrepares weekly status report to management, monitors attendance records, contributes to the performance appraisals, prioritizes the project focus and monitors testing progress/resultsMentors and coaches more junior Analysts on the teamSubject matter source within the department fostering staff knowledge expansion and developmentRequirements:6 years related work experienceExpert SQL knowledgeExpert relational database systems knowledgeExperience with various IT platforms and languages such as Informatica Power center, Java, DB2Bachelor's degree or equivalent work experience requiredKnowledge and/or certifications in software development methodologies such as Scrum is desired, but not requiredAbility to develop relationships both in person and over the phoneAbility to be careful and thorough about detailAbility to analyze information and use logic to address work-related issues and problemsAbility to work proficiently in Microsoft Word, ExcelRequired experience in Access, Outlook, PowerPoint, Project, SQL, and VisioFamiliarity with TSA, File-Aid, and reviewing Flat filesAbility to understand relational database concepts and client-server conceptsAbility to drive project timelines to completion with a cross-functional teamAbility to work on complex projects with general direction and minimal guidanceAbility to work independently as a member of various teams and committeesAbility to multi-task and work under pressure.To Apply: To be considered please immediately apply to this requisition using the link provided or by going to www.ctg.com/careers. For more information, contact Sara Wade at sara.wade@ctg.com. Kindly forward to any other interested parties. Thank you!  CTG's Benefits Plan allows you to select insurance coverage that best suits your lifestyle, and take part in our savings programs and educational plans. We offer Flexible Spending Accounts, a 401(k) Retirement Plan, and an Employee Stock Purchase plan. Our educational plan comprises access to more than 2,000 web-based technical, professional and business development courses.  CTG (NASDAQ: CTG) provides industry-specific IT services and solutions that address the business needs and challenges of clients in high-growth industries in North America and Western Europe. CTG also provides strategic staffing services for major technology companies and large corporations. Backed by more than 50 years of experience and proprietary methodologies, CTG has a proven track record of reliably delivering high-value, industry-specific staffing services and solutions to its clients. CTG has operations in North America, Western Europe, and India.  CTG's greatest asset is its people, and as such, we are committed to providing employees programs and processes to support their performance, hone their skills, and advance in their careers. This commitment is reflected by CTG being named a Best Places to Work in Healthcare company by Modern Healthcare (2013-2016) in North America, and a Best Workplace in the United Kingdom (2013), Belgium (since 2007), and Luxembourg (since 2011).  CTG will consider for employment all qualified applicants including those with criminal histories in a manner consistent with the requirements of all applicable local, state, and federal laws.  CTG is an Equal Opportunity/Affirmative Action Employer and strong advocate of workforce diversity. Minority/Female/Sexual Orientation/Gender Identity/Disability/Veteran.SDL2017"}