{"jobID": "1922219634", "jobLocation": "Fremont_CA", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.sigmaways.net", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sr. Data ScientistIndustry Information Technology and Services and Automotive Location Palo Alto, California Description Sigmaways is a leading global consulting and IT services company with over a decade of onsite and offshore engagements, which continue to deliver state-of-the-art IT solutions through quality and ROI. We offer a wide array of solutions for a range of key verticals and horizontals, from the strategy consulting right through to implementing IT solutions for clients. Sigmaways is a diverse end-to-end IT solutions provider, helping our customers leverage the market knowledge, technical skills and rich industry experience we have gathered through the years. Our methodologies follow best practices and adhere to ever-changing industry standards so that our customers can achieve their goals through faster time-to-market at the most affordable rates. Sigmaways is made up of a team of highly skilled IT professionals who follow our unique Right Sourcing delivery model. This allows us to leverage local competencies to offer global competitiveness to our customers, helping us deliver best-of-breed solutions to cater to your unique requirements. Sigmaways’ consulting and IT solutions have resulted in technology-intensive transformations that have met the most stringent of international quality standards. Our relationships are based on expertise, knowledge and long term commitment to quality for every single customer engagement.Our direct client inPalo Alto, CA is looking for a Sr Data Scientist to join their team immediately.Data driven analytics is impacting our direct cleint’s products and services in many domains: Purchasing, Predictive Maintenance, Health Informatics, Vehicle Diagnostics, Manufacturing, Large-Scale Simulations, and more. The Data Science team at Client’s Research and Technology Center (RTC) researches and develops novel machine learning and data mining algorithms with focus on large scale data analytics. We provide thought leadership to the client on Big Data frameworks, architecture and data management needs. Our focus areas include distributed and hybrid architectures for big data analysis, temporal data analytics, multi-modal and heterogeneous data analysis, distributed optimization, and anomaly detection among others. We are looking for a Senior Data Scientist to uncover new domain knowledge and providing data-driven predictive analytics to increase added value to the client. Experience Mid-Senior level Employment type Full-time ResponsibilitiesResearch, develop and apply advanced machine learning algorithms for modeling and analyzing large scale time series datasetsScale learning algorithms to parallel and distributed settingsCreate and deploy analytics solutions for various domains including but not limited to automotive, manufacturing, smart home, industrial engineeringCollaborate with academic partners externally and technical experts internally for cross-domain applicationsScout and identify emerging machine learning technologies that could impact future client’s businessPublish research findings in leading conference and journal papersSkillsPhD in Computer Science, statistics or other engineering discipline with strong quantitative componentDemonstrated experience in the field of statistics, machine learning, or data mining on large, time series data setsOutstanding work results in at least one of the following areas: unsupervised feature learning, streaming data analysis, temporal data analytics, multi-modal and heterogeneous data analysisVery strong programming experience with two or more of the following languages: Python, R, Java, Scala, C++Experience with distributed programming frameworks like MapReduce, Spark, a plusWorking knowledge of SQL and relational databasesExcellent communication and presentation skillsFamiliarity with NoSQL database systemsFirst author publications in top Machine Learning and Data Mining conferencesExperience in research and development, automobiles and industrial engineering. APPLY "}