{"jobID": "2559286877", "jobLocation": "The_Woodlands_TX", "jobTitle": "Data Analyst 3 - Support Analyst (Data)", "companyRating": "3.6", "companyInfo": {"Website": "www.primussoft.com", "Headquarters": "Duluth, GA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Job Description:  Work Location: 10101 WOODLOCH FOREST DR. THE WOODLANDS TX 77380  Request Title: Data Analyst 3 - Support Analyst (Data)  Qty: 1  Desired Start Date: 10/23/2017  End Date: 4/13/2018  Is this position contract to hire?: NO  Local Candidate Required?: YES  Support Analyst (Data)  Responsibilities:  • Properly identify client issues, log tickets, and close tickets with known fixes.  • Maintain and consistently demonstrate knowledge of company guidelines, standard operating procedures, and practices.  • Resolves Level 1 & 2 issues, and escalate complex and/ or high priority issues to the appropriate support groups for resolution  • Work closely with other Analysts to help diagnose and solve issues as they come up.  • Identify problematic areas and conduct research to determine the best course of action to correct the data  • Analyze and problem solve issues with current and planned systems as they relate to the integration and management of patient data (for example, review for accuracy in record merge, unmerge processes)  • Analyze reports of data duplicates or other errors to provide ongoing appropriate inter-departmental communication and monthly or daily data reports (for example, related to the EMPI)  • Monitor for timely and accurate completion of select data elements (for example, verbal physician orders)  • Identify, analyze, and interpret trends or patterns in complex data sets  • In collaboration with others, develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality  • In collaboration with others, interpret data and develop recommendations based on findings  • Create and present quality dashboards  Knowledge/Skills  • Technical expertise regarding data models and database design development. Ability to perform data profiling using SQL or similar tools/languages  • Proficient in MS Word, Excel, Access, and PowerPoint, Sharepoint, JIRA.  • Experience using SAS, SPSS, or other statistical packages is desirable for analyzing large datasets  • Programming skills preferred. Adept at queries and report writing.  • Knowledge of statistics, at least to the degree necessary in order to communicate easily with statisticians  • Experience in data mining techniques and procedures and knowing when their use is appropriate  • Ability to present complex information in an understandable and compelling manner  Preferred Qualifications:  • Bachelor's in Information Management, Healthcare Information, Computing, Mathematics, Statistics, or related fields  • Healthcare background or experience  • Previous data analyst experience  To be considered for this position, you must have: BA/BS in Business, Economics, Math or related discipline 5-7 years professional experience. Strong technical skills with Microsoft Excel including Visual Basic; ability to manipulate, merge and report from large data sets and platforms."}