{"jobID": "2725082869", "jobLocation": "Addison_IL", "jobTitle": "Sr Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.pamperedchef.com", "Headquarters": "Addison, IL", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Public", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "About the Role:The Senior Data Analyst will need to be able to understand business requirements/ data and migrate data (Oracle EBS, hybris, external parties) to an AWS Redshift platform. You will be working closely with end user community to better understand their analytic needs and document the raw data from source systems along with the necessary calculations. About the Team:The Data Analytics and Reporting team is responsible for the technical set-up and design of all internal and external reporting for Pampered Chef. They leverage a variety of tools and applications, including AWS Redshift, OBIEE, Legacy Warehouse, and Informatica, to provide data necessary to report out to consultants along with internal personnel.What You'll Do:Work with end user community to better understand their analytic needs and document the raw data from source systems along with the necessary calculations.Understand business requirements/ data and migrate data (Oracle EBS, hybris, external parties) to an AWS Redshift platform.Lead data modeling, database design development, and data mining. Build out the one source of truth for our primary data and teach/ mentor throughout the organization to increase their understanding.Curate and interpret data, analyze results using statistical techniques and provide ongoing reports. Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyPresent findings to business teams (including senior leaders).Skills You'll Need:Bachelor’s Degree in Computer Information Systems, Mathematics, Statistics, Finance, or Accounting with 5 years of experience.Experience working with AWS, SQL, and Oracle.Preferred experience with predictive analysis and data visualizations techniques using Tableau, SPSS, SAAS, and R.Ability to interpret data and analyze results.Ability to write and speak clearly in order to communicate complex ideas.About Pampered Chef:We’re a global brand delivering curated, high-quality kitchen solutions through a network of over 40,000 independent consultants. We began as a Chicago-based start-up in 1980. Today, we’re a small, agile company with long-term focus—backed by the resources of Berkshire Hathaway.Our team is guided by our core values and our purpose of enriching lives…one meal & one memory at a time. We aren’t your typical company—we act like owners, crave challenges, seek out learning opportunities, and thrive in an environment of empowerment and accountability."}