{"jobID": "2808989972", "jobLocation": "Princeton_NJ", "jobTitle": "Associate Research Scientist, Cognitive Science", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Description:POSITION SUMMARYETS Research & Development has an opening for an Associate Research Scientist in the Cognitive Sciences Research Group. The CogSci Group investigates, develops, and applies cognitive science theories and methods to solve educational assessment problems. We collaborate on a variety of internally and externally funded research agendas around innovative student and teacher assessment capabilities, including game- and simulations-based assessment. We conduct interdisciplinary assessment research from a variety of perspectives within the cognitive sciences, spanning cognitive psychology, education, computer science, educational technology, language learning, and artificial intelligence. In partnership with teams of psychometricians, statisticians, validity theorists, computational and applied linguists, IT developers, assessment developers, and other cognitive scientists from across ETS, we create, develop, and maintain valid, innovative, technology-enhanced assessments to assess complex competencies for educational and workforce contexts.We are recruiting a cognitive scientist with expertise in the areas of cognitive task analysis and cognitive modeling, especially as applied to problem solving and interpretation of multimodal data (e.g., facial expressions, voice, and gaze patterns) predominantly in the domain of English language learning. Because of the CogSci group&apos;s emphasis on interactive, online learning and assessments, we are particularly interested in candidates that also have expertise in human-computer interaction, especially learner experience design.BASIC FUNCTIONS AND RESPONSIBILITIESContribute to the planning of a research agenda that draws upon the cognitive sciences and new technologies to advance the fields of educational or workforce assessment.Take responsibility for conceptualizing, proposing, obtaining funding for, and directing small projects and/or assisting in moderate-to-major ones. This includes managing, or participating in the management of, projects involving management skills such as staff assignment and scheduling, budgeting, and acquisition and utilization of equipment, facilities, and services.Research and Development Efforts:Design and conduct research studies functioning as an expert in the major facets of projects: respond as a subject-matter expert in presenting the results of acquired knowledge and experience. Consult and collaborate on problems arising from research, testing programs, or corporate management concerns.Design, develop, and evaluate research prototypes of new forms of assessment in a variety of domains.Develop, and contribute to the development of, new products or services for education based on scientific principles drawn from the research literature.Document and disseminate the results of research or development projects and programs through a portfolio of publications and presentations that have impact on the field and ETS.Develop proposals for research or development projects, and obtain financial support for new or continuing research activities.Professional Service and Engagement:Actively seek input from peers on the quality of one’s work. Participate as a reviewer of others’ work.Actively seek mentoring from more senior scientific and other R&D; staff, developing a continuing mentoring relationship.Assist more senior scientific staff in consulting on testing program, R&D; management, or other ETS management concerns.Develop external professional relationships and work to cultivate a scientist’s identity. Become a member and regular presenter at the annual meetings of one or more organizations substantively related to the work of ETS. Required Experience:EDUCATIONA Ph.D. or Ed.D. in a cognitive science, educational psychology, or educational technology or similar area is required.EXPERIENCEOne year of independent substantive research and/or development experience in educational technology, assessment innovations and technologies, computer science, education, cognitive and learning sciences, or cognitive and social psychology is required. Experience can be gained through doctoral or post-doc studies.EDUCATIONAL TESTING SERVICE is an Equal Opportunity and Affirmative Action Employer of Women and Minorities.EDUCATIONAL TESTING SERVICE is an Equal Opportunity and Affirmative Action Employer of protected Veterans and Individuals with Disabilities.EDUCATIONAL TESTING SERVICE is a Drug-free workplace. Keyword: research, scientist, education, assessment, cognition, psychology, cognitive science, computer science, technology, artificial intelligence, learning science, learning sciences, cognitive psychology  From: Educational Testing Service"}