{"jobID": "2787849065", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.massdrop.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "Overview Were looking for a Data Scientist to work directly with the CTO to found Data Science as a discipline at Massdrop. The core responsibilities are to apply quantitative analysis, modeling, and data mining to augment the delivery of content and products. Massdrop is a nexus of social community and e-commerce; there are many signals to leverage for driving unique and engaging experiences for our users. Youll be working on organizing and delivering community content into a feed that users delight at engaging with on a daily basis.  In partnership with multinational enthusiast brands, youll also be working on translating signals from our knowledgeable, active user base into best-in-class physical products that are loved by the community. Youll be adding to, and accelerating the growth of, our list of collaboration products (such as the https://www.massdrop.com/buy/massdrop-sennheiser-hd6xx, with $10M+ in sales) developed for and by our community. Here's what you'll do as part of the team:Perform deep dive analysis to understand and optimize the key levers of our ads and search ecosystemsDesign core metrics for team efforts and model trade offs across product areasApply statistics, modeling, and ML to improve the efficiency of systems and relevance algorithmsWork with product managers and engineers to design data products and debug A/B experimentsAnd here are the skills and experience you'll need to be successful:2+ years of work experience applying scientific methods to solve-real-world problems on web scale dataExpertise in at least one scripting language, preferably PythonKnowledgeable about the machine learning trade-offs and model evaluationWho We Are Massdrop puts community first. We create high-quality, custom gear, apparel, and products inspired and designed by our online communities. We provide over 5 million members a place to connect, discuss, buy products together, and learn about the things that are important to them.  The engineering team contains of a number of seasoned developers who have scaled web apps beyond 10M daily active users. We have seen a lot of what doesnt work in our past engineering teams and distilled the right practices and processes to ensure a healthy, sane, and efficient work environment. Were all about quality engineering, not big egos; the best ideas win here.  If this sounds like the right environment for you to continue your software engineering career, then please submit an application. Wed love to talk with you!"}