{"jobID": "2789236420", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist, AMP Commerce Analytics", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Data Scientist, AMP Commerce Analytics Job Number: 113818603Santa Clara Valley, California, United StatesPosted: May. 24, 2018Weekly Hours: 40.00 Job SummaryAt Apple Media Products (AMP) Analytics, we analyze large-scale data across customer and content provider touch points in order to develop metrics and deep insights to measure performance and drive strategy.  Our culture is about getting things done iteratively and rapidly, with open feedback and debate along the away; we believe analytics is a team sport.  We support independent decision-making and taking smart risks. AMP Analytics collaborates deeply with partners across product, design, engineering, and business teams: our mission is to drive innovation at Apple through deep quantitive research of the App Store, Apple Music, iTunes Video, iBooks, Podcasts amongst other services.Key Qualifications 3 + years of recent experience in a data science or data analyst role.Familiarity with measuring UX, customer engagement, planning and analyzing AB experiments.Appropriate and well versed working with predictive and causal problemsA real passion for improving the customer experience through refining the product.Excellent presentation, communication and social skills, with strong attention to detail.Strong business mindset, possessing an ability to condense complex analysis and technical concepts into clear and concise takeaways for business leaders.Ability to operate appropriately and effectively in a dynamic, highly cross-functional, fast-paced environment.Excellent time management skills with the ability to lead work to tight deadlines and handle the pressure of product launches and executive requests.Well-versed SQL languages. Experience with big data technologies such as Hadoop and Spark preferred.Familiarity with Python or R and data visualization tools such as Tableau for full-stack data analysis, insight synthesis and presentation.Ability to comprehensively understand data elements, sources and relationships in business and technical terms.Strong familiarity with multiple platforms, tools, methodologies in data analysis and insight synthesis. DescriptionYou will play a key role improving the AMP commerce engine. As a member of this team you will help optimize the engine by developing new products and tuning existing features. A few areas your work will influence include account and payment creation flows, transaction efficiency and authorizations, and subscription management and renewals. YOUR DAY-TO-DAY ACTIVITIES WILL INCLUDE:Deep dives in large-scale data to identify key insights that inform product improvements and business strategy.Supervised and unsupervised learning. A/B testing and causal modeling.Define how best to measure and monitor commerce products and features. Engage with business, engineering, product management teams as a thought partner.Build and maintain positive relationships with key partners across the company to successfully deliver actionable insights.Partner with other Apple organizations on data gathering, data governance, democratizing data with reporting tools and evangelizing critical metrics.EducationMaster’s degree in Economics, Statistics, Computer Science, Mathematics or relevant field."}