{"jobID": "2797834042", "jobLocation": "Perth_Amboy_NJ", "jobTitle": "Associate Environmental Scientist / Engineer - Perth Amboy NJ", "companyRating": "3.4", "companyInfo": {"Website": "www.parsons.com", "Headquarters": "Pasadena, CA", "Size": "10000+ employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " AECOM, Bechtel, URS Corporation"}, "estimatedSalary": "49000", "jobDescription": "Parsons is an industry leader in delivering technology driven solutions to promote safer, healthier and sustainable world class infrastructure to communities around the world. We have on-going projects with chemical companies and oil and gas companies in Environmental Remediation in NJ, and NY. We are hiring colleagues who enjoy working in the field at active complex remediation sites, who thrive in a high energy environment.We are looking for an Associate Environmental Scientist with field work experience performing various sampling activities to extract data to support remediation solutions for environmental issues. If you are in environmental scientist or engineer, with a few years of experience, this could be a great opportunity for you to get in on the ground floor of a highly motivated and technical team!Do you enjoy working in the field and being hands on with analysis and testing? Do you enjoy performing a wide variety of complex and diverse environmental sampling and data collection tasks? This is a career building opportunity for you to learn about complex contamination issues at large project sites like Superfund sites, and Brownfield sites!Activities will include groundwater sampling and monitoring, soil sampling, oversee and direct groundwater monitoring well installations, overseeing excavations, writing and preparing remedial action reports and other related documentation. Additional responsibilities may include analysis of test data, developing/preparing descriptive charts, figures, or matrices; writing test specifications and making recommendations to the team on solutions. In this role, you will assist the Task Manager/Field Team Leader coordinating field efforts with client site personnel and subcontractors, participate in kick-off meetings with field teams, and provide assistance to field personnel performing field activities. This role requires the ability to develop solutions to challenges identified during implementation and clear and concise communication while serving as a liaison between field activities and task manager. Travel to and from various site locations will be expected.Requirements:4-year degree in a technical, science or engineering curriculum related to environmental science, or earth sciences (Geology, Hydrogeology).0 to 3 years of related work experience with groundwater sampling using various methodologies such low flow, volume averaging and soil sampling including soil screening, logging and sample collection. Experience in performing subcontractor (including drilling, excavation, surveying) oversight is preferred.Proficiency in commonly used computer software applications such as Microsoft office and mobile electronic devices typically used for data collection and tabulation.Understanding of environmental rules and regulations, particularly those of the New Jersey Department of Environmental Protection including the Field Sampling Procedures Manual is preferred.40-hour OSHA HAZWOPER Certification will be required prior to start.Must pass fitness for duty evaluation and DMV check, as will be eligible to use company vehicle.Demonstrated strong commitment to safetyProficiency in implementation of a behavior based safety program is preferred.Experience at petroleum refining or storage facilities is preferred."}