{"jobID": "2750465035", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.brinkerjobs.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (EAT) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "What does it mean to be a BrinkerHead? We play like a team, take pride in our culture and seek every opportunity to make people feel special. Life is short. Work happy. At Brinker, we connect, serve and give to create the best life for our Team Members, Guests and community. Through our cultural beliefs, Brinker empowers its Team Members to positively impact our 4 Key Results: Engaging Team Members, Bringing Back Guests, Growing Sales and Increasing Profits.Job SummaryThe Data Scientist will be responsible for providing advanced analytics, developing predictive models and Machine Learning/AI solutions for Brinker CRM/Loyalty, Digital Marketing, and other data-intensive areas, such as Talent analytics, Financial forecasting, Operational analytics, etc. Your Key Job FunctionsAnalyze Loyalty program performance; design and measure tests; develop advanced segmentation; conceptualize and design the algorithms for individualization of the offers and content with the goal of optimizing revenue.Estimate the impact and ROI of different marketing initiatives in the Digital and Traditional media; provide thought leadership for the advertising agency and the marketing team in terms of designing media tests and measuring their results;Provide actionable, comprehensive, data-driven answers to business questions using the variety of the available data sources (transactions/sales, media consumption, social data, guest satisfaction, operational data etc.).Visualize the data and communicate the insights and results to the leadership.The successful candidate will be able to demonstrate and bring to life the Brinker cultural beliefs to drive our 4 key results:Feedback’s Priceless - I see more through your feedback. Own it - I own, drive and achieve key results.Win Together - I work across boundaries to achieve key results. Trust Matters - I act in a manner that cultivates trust in others. Thinking Forward - I think and act in a manner to deliver desired future results.What You Bring to the TeamBachelor or Master’s (preferred) degree in Computer Science, Math or Scientific Computing, Data Science/Analytics, Business Intelligence, Economics, Social Sciences. 6 years of relevant experience in Data Analytics. Extensive hands-on experience with development of predictive models and machine learning/AI-based solutions.Experience in one or more of the following areas: Digital Marketing, CRM analytics, Market research, financial analysis, IT-Business Intelligence.Exceptional ability to understand, analyze and solve business problems.Ability to extract, process, and analyze large volumes of diverse structured and unstructured data to produce meaningful insights that can be linked to business results.Ability to concisely summarize the findings of a complex analysis in a way that can be intuitively understood by non-specialist.Ability to effectively visualize data highlighting important insights and conveying the story by using charts and tables.Ability to thrive in dynamic fast paced environment. Superb multitasking skills: ability to effectively work on multiple projects and ad-hoc analytical requests with tight deadlines.Must be a self-starter, able to work independently and take initiative to find solutions for business requirements.Highly collaborative work style; must work well with people. Flawless execution, attention to details.Ability to maintain confidentiality on proprietary business information.Hospitality/Retail experience is a strong plus. Strong SQL skills.Experience in developing machine learning and artificial intelligence algorithms using Python, R, C , and Java.Experience in working with distributed computing i.e. Hive SQL, Pig, Java Map/Reduce, and Apache Spark. Strong knowledge of statistics.Advanced proficiency in data visualization (Tableau). Be a United States citizen, permanent resident or have a valid Visa with work authorization.Limited travel.Why BrinkerCompetitive salary.Every team member working at the Restaurant Support Center (aka Brinker headquarters) eligible for annual bonus potential.Generous dining discounts at Brinker owned brands.A choice of healthcare plans, 401(k) Savings Plan with company match and generous holidays.Onsite gym plus opportunities to increase your wellbeing with onsite Yoga and boot camp programs. Work/Life/Fun balance in a casual and collaborative work environment.Team members enjoy company-wide events and celebrations.Regular volunteer opportunities with our community give back programs."}