{"jobID": "2791358176", "jobLocation": "Troy_MI", "jobTitle": "Senior Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.internetbrands.com", "Headquarters": "El Segundo, CA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Demand Media"}, "estimatedSalary": "49000", "jobDescription": " Internet Brands, Inc., is currently seeking an analytically-minded Senior Data Analyst. This position will be a key component in driving company growth for our newest joint venture with Fiat Chrysler Automobiles by developing an understanding of customer behavior and identifying business trends. Responsibilities:Develop a deep understanding of operational, customer and financial data.Coordinate with leadership team to define key business metrics.Support ad-hoc analytical reporting to drive business insight.Collaborate with product, database and operations teams to plan data and analytic needs.Design and deliver dashboard tools. Requirements:Quantitative degree in Mathematics, Statistics or Economics.One to three years of proven experience in business analytics, reporting and data visualization.Ability to frame unstructured, complex analytical problems.High level of comfort with large relational data sets, database mining and manipulation.Experience summarizing and communicating key financial information.Clear written and oral communication skills.Strong Excel and SQL skillsFamiliarity with set-up and management of online reporting tools such as QlikView, Domo or Pentaho.Highly developed analytical and problem solving skills.  Success starts with having the right people. At Internet Brands, we value and mentor each member of our growing team. We seek out talented, goal-oriented professionals who live and breathe the Internet and thrive in a flexible but challenging work environment. Our team of innovators has enabled Internet Brands to sustain high levels of profitability and success while evolving along with the Internet for over 20 years. At IB, we promote an entrepreneurial, friendly culture that applauds innovation and results while embracing change and independence. Our employees are intensely driven and constantly encouraged to reach higher and use creativity to achieve success – all the while enjoying high levels of collaboration and the luxury of coming to work in jeans and sneakers. We are proud to offer a unique blend of the innovation of a start-up with the history, stability, and benefits of an established corporation.  Internet Brands and its wholly owned affiliates are an equal opportunity employer.  Keywords: Business Data Analyst, Data Analyst, Web, online, Internet, Statistics, Analytics"}