{"jobID": "2802601176", "jobLocation": "Washington_DC", "jobTitle": "Senior Market Strategy Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.fiscalnote.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "About the PositionAs we work towards our mission of connecting the world to their governments, you will be jumping headfirst into helping drive the success of FiscalNote. You will be supporting key priorities across the company and executing directly on high leverage needs. Your role will challenge your skills as a market analyst, cross-functional collaborator, and customer advocate.You WillWork with senior go-to-market leaders (sales, marketing, customer support, professional services) to help position our products and services and rapidly scale their strategy and operationsFunction as a support to product and marketing teams in conducting analysis in market sizing and growth, market share, and market opportunity validation in M&A; opportunitiesCollect data, conduct analysis, and communicate information on pricing, packaging, bundling, and incentives/discounting approaches in marketAssess growth potential and demand analysis of new products and segmentsAssist with competitive and market differentiation Help refine value proposition and customer experience for products and segments, especially in M&A; situations which require product rationalizationAssist in analysis of alignment of specific market growth opportunities to segments to market resources and channels investments in marketingStress-test novel business models and products through market insight and analysisPresent findings and visualizations to senior executives, managers, and Board members within FiscalNoteDevelop the Strategy function within FiscalNote with the Chief Strategy OfficerYou AreFiercely curious, highly intelligent, driven, and detail-oriented. You are drawn to growth companies and have a passion for seeing companies grow into new markets and testing new strategies. You are able to work independently in a highly entrepreneurial environment to support teams and clients. People view you as a natural leader by virtue of your analytics and problem-solving skills and your ability to work collaboratively across different teams and at all levels of an organization to drive action. Hard problems don’t scare you and you love to untangle webs of information and data to find the truth and drive the best outcomes. You are cable of taking complex problems and ideas and communicate them effectively verbally and in writing to different stakeholders.You Have2-4+ years of experience at a top tier management consulting firm or in house strategy group at a company with multiple product lines analyzing markets and executing on go-to-market strategiesFluent in product marketing, pricing strategies, business operations, internal change managementProven track record of applying expertise to deliver business impactExperience with data analysis, clean-up, etc. alongside data visualization tools (Tableau, Looker, etc.)Experience working with SaaS companies and principles (subscription mechanisms around churn, retention, etc.)Experience in information services or collaboration software industry a plusGlobal experience preferred; additional languages a strong plusAbout UsFiscalNote is the leading Government Relations Management platform. Our mission is to build the world’s most powerful platform for analyzing government risk and opportunity. For organizations facing government impact, FiscalNote is the platform for professionals to plan and execute their organization’s government risk strategy. Organizations rely on FiscalNote because of its accurate and relevant information, cutting-edge analytics, and ease of use. Our fierce curiosity and insatiable urge for the next challenge pours into our company culture. FiscalNote earned the Top Workplace™ award for our ever growing and diverse company culture bolstered by our company values, which are at the core of every decision we make. We are always looking for individuals who are excited and driven by opening data to help impact the world around them.Company BenefitsFiscalNote offers competitive salaries, equity packages, and retirement accounts to ensure we’re all FN owners. We work hard, so we want you to play hard; our open vacation policy and vacation expense contribution help us ensure you’re getting the R&R; you need. We offer comprehensive health, vision, and dental insurance options supplemented by a flexible spending account (FSA). We have a slew of other benefits which you can check out at careers.FiscalNote.com FiscalNote is an Equal Opportunity EmployerFiscalNote values diversity. We are committed to equal opportunities and creating an inclusive environment for all our employees. We welcome applicants regardless of ethnic origin, national origin, gender, race, religious beliefs, disability, sexual orientation or age. FIscalNote is an EEOC.FiscalNote uses E-Verify to confirm the employment eligibility of all new employees. To learn more about E-Verify, including your rights and responsibilities, please visit www.DHS.gov/E-VerifyApply"}