{"jobID": "2807721057", "jobLocation": "Los_Angeles_CA", "jobTitle": "Advertising, Marketing and Commerce Analytics Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.deloitte.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1850", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " EY, PwC, McKinsey & Company"}, "estimatedSalary": "118000", "jobDescription": " Advertising Marketing and Commerce Analytics Manager  Marketing Sciences is at the forefront of guiding data driven strategies by leveraging emerging technology, keen analytic abilities and a laser focus on addressing the client’s business initiatives. Marketing Sciences is a critical influencer in what drives marketing success and is in constant exploration for clients as the discipline of a data first mentality as marketing evolves.  Work you’ll do  This person works cross-functionally between teams to guide measurement frameworks, learning agendas, data strategy, performance analytics, modeling and technology solutions.  Embody an intellectual curiosity around what data means by putting it into context of the clients business and focusing on asking the next question.  Exercise strong collaboration with others providing support to an extended team, sharing skills & expertise with co-workers, and constantly expanding your knowledge base.  Wear many hats, between steering a team of Sr. Analysts, partnering with internal teams, client facing exposure, and diving in with a start-up mentality.  Apply a strong familiarity with all available analytics tools, both syndicated and proprietary to ensure all client recommendations are supported by quantitative and/or qualitative research.  Use data to evaluate the effectiveness of marketing strategies, tactics, and measurement techniques.  Bring a strong background with proven experience in digital analytics, measurement, modeling, and data quality.  Work on a fast paced, forward-looking CPG brand who is pushing the status quo in using data to drive marketing decisions.  Work cross-functionally with multiple internal teams developing strong working relationships and have a hands-on mentality.  The team  Advertising, Marketing & Commerce  Our Advertising, Marketing & Commerce team focuses on delivering marketing and growth objectives aligned with our clients’ brand values for measurable business growth. We do this by creating content, communications, and experiences that engage and inspire their customers to act. We implement and operate the technology platforms that enable personalized content, commerce and marketing user-centric experiences. In doing so, we transform our clients’ marketing and engagement operations into modern, data-driven, creatively focused organizations. Our team brings deep experience in creative and digital marketing capabilities, many from our Digital Studios.  We serve our clients through the following types of work: Cross-channel customer engagement strategy, design and development(web, mobile, social, physical)eCommerce strategy, implementation and operationsMarketing Content and digital asset management solutionsMarketing Technology and Advertising Technology solutionsMarketing analytics implementation and operationsAdvertising campaign ideation, development and executionAcquisition and engagement campaign ideation, development and executionAgile based, design-thinking, user-centric, empirical projects that accelerate resultsQualificationsRequired: Minimum of 3-4 years relevant marketplace experience  Experience with at least several of the following tools:  Data visualization, Tableau, Omniscope, PowerBI, Web Analytics, Adobe Analytics, Google Analytics, Webtrends.  Ad Servers: DoubleClick, Sizmek, Atlas, MOAT, DoubleVerify.  Syndicated Measurement: comScore, Nielsen.  Ad Effectiveness Research: comeScore, Millward Brown Digital, GFK, Nielsen Marketing Cloud.  Data management and demand-side platforms. Preferred: Bachelors or advanced degree in Statistics, Economics, Business, Math, or Advertising is preferred  A strong desire to learn and passion for digital marketing, research and analytics  Strong time management skills to ensure accurate delivery while handling multiple projects  Ability to prioritize issues quickly and creatively with a solution based attitude  Strong analytic and problem solving skills  Excellent written, oral and presentation abilities-must be able to communicate complex ideas in both technical and user-friend language  Ability to foster collaborative relationships with other cross-functional teams"}