{"jobID": "2795620111", "jobLocation": "Irwindale_CA", "jobTitle": "Accounting/Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.superiorcommunications.com", "Headquarters": "Baldwin Park, CA", "Size": "201 to 500 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "Accounting/Data AnalystGeneral Summary... The Accounting/Data Analyst collects data and prepares reports to serve as summary information to managers. This position is also responsible for identifying relevant insights and compiling analytical reports to enable the company to make better business decisions. This person will be responsible for... 1. Compile monthly actual vs. prior month’s department expense analysis (over 70 departments)  2. Present monthly operating expenses variance analysis (department-level, as well as, individual level)  3. Assist in planning, updating, and tracking departmental budget  4. Prepare and track T&E; actual expenses monthly by individual level as well as department level  5. Analyze expense data to ensure accuracy of balances and to provide cost-saving suggestions  6. Assist in writing expense procedures  7. Prepare schedules and analysis for Income Tax Returns, R&D; Study, etc.  8. Provide data support in preparing analysis for third party auditors  9. Provide data support to the Finance function for ABC analysis, such as department expense allocation  10. Compile and calculate cost management fees monthly  11. Analyze data and prepare graphs and charts for executive presentation  12. Other duties as assigned  13. Follow ISO/TL9000 requirements as it pertains to position QualificationsYou might be a great fit if... 1. Minimum 2 years’ work experience in data analysis or accounting  2. Bachelor’s degree in Accounting, or some Accounting courses completed, a plus  3. Computer proficiency of Microsoft Outlook and Word, exceptional Excel experience required  4. Experience working with Navision, highly desired  5. Strong written and verbal communication skills  6. Problem solving skills; able to analyze situations  7. Able to communicate well with others  8. Able to work in a team environment  9. Organized, detail-oriented, thorough, able to handle heavy workloads and meet deadlines  10. Strong work ethic with attention to detail  11. Effective written and verbal communication skills  12. Robust math skills Travel No travel is expected for this position. Referral If this isn't the job for you, perhaps you have a friend who would be a perfect fit. Please send them this link! ADA - Superior Communications will make reasonable accommodations in compliance with the American with Disabilities Act of 1990. Reasonable Accommodations are available for qualified individuals with disabilities throughout the subsequent application process."}