{"jobID": "2787119502", "jobLocation": "Sacramento_CA", "jobTitle": "Consulting Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "61000", "jobDescription": " Under close supervision, this position exists to assist the organization in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. This position functions both as an analyst and as a statistical analytics programmer. Essential Functions: Designs and enhances databases.  Designs menu systems that are effective and user-friendly.  Develops reports with accurate, easy to read, useful information.  Designs and generates tracking and monitoring tools.  Participates in the development of outcomes and process measures, including technical specifications, to enable population measurement, guideline implementation, and evaluation.  Maintains complex statistical routines using macros, vendor software, and software written by self and others.  Tests and maintains data integrity. Basic Qualifications: Experience  Minimum one (1) year of programming in SAS, SQL, VBA; net or equivalent statistical analytical programming language. Education Bachelor's degree in economics, finance, health care administration, public health administration, statistics, mathematics, operations  research, or related field required OR four (4) years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  Licenses, Certifications, Registrations  N/A. Additional Requirements: Microsoft Office skills required.  Strong ability to apply analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work  within a team.  Must be an independent self-starter.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: . SQL, Tableau  Experience with analytical manipulation and interpretation of large databases.  Analytical consulting experience.  Project management experience.  Experience with MVS/TSO operating systems. "}