{"jobID": "2791911350", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist/Formulations Chemist (Must be US Citizen)", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "Updated: TodayJob ID: 213880Status: Full-TimeRegular/Temporary: RegularLocation: San Antonio, TX, United StatesJoin the HJF Team! HJF is seeking a Research Scientist II/Formulations Chemist to support the Naval Medical Research Unit — San Antonio (NAMRU-SA) in San Antonio, TX. NAMRU-SA is a major research center conducting medical and directed energy biomedical research, which focuses on ways to enhance the safety, health, performance and operational readiness of Navy and Marine Corps personnel and addresses their emergent medical problems in routine and combat operations. Incumbent is responsible for designing novel polymeric formulations and/or nanoformulations for dental resins. Formulation delivery strategies may include nanomaterials or nanoparticles, hydrogels, biodegradable materials and scaffolds, resins, and ointments. Responsibilities Designs and synthesizes therapeutic formulations using theoretical and wet chemistry. Tests biocompatibility, toxicity, and stability properties of novel formulations and their individual components. Characterizes release kinetics, dose/responses, degradation, metabolism, and interactions in biological model systems. Assists with IACUC and IRB approval process. Collaborates with engineers, biologists, analytical chemists, microbiologists, toxicologists, and veterinary staff Participates in key meetings with sponsors and other team members. Maintains a safe work environment with appropriate training of other personnel. Completes other projects as needed.Required Knowledge, Skills, and Abilities: Must possess Ph.D. in polymer sciences, pharmaceutical sciences, biomaterials, biomedical engineering, chemistry, nanotechnology, or nanomaterials. Must have 2-5 years of postdoctoral experience. Possess experience collecting data through complex laboratory/scientific experiments, techniques, and procedures. Experience with polymeric materials characterization including UV-Vis, HPLC/MS, DLS, FT-IR, XRD, SEM, and TEM. Pharmacokinetic analysis software experience is desired. Ability to troubleshoot and work independently. Guide and direct junior staff. Must possess excellent written and oral communication skills as demonstrated by presentation and publication record. Must participate in initiating new hypothesis driven research and technical report, manuscript, poster, abstract, and proposal preparation. Maintain detailed, accurate records. Minimum Education/Training Requirements: PhD in Polymer Sciences, Pharmaceutical Sciences, Biomaterials, Biomedical Engineering, Chemistry, Nanotechnology or Nanomaterial or a related field. Minimum Experience: 4 to 6 years related research experience. Physical Capabilities: Work involves long periods of standing Required Licenses, Certification or Registration:Must be a US citizen. Must be able to pass a background investigation. Supervisory Responsibilities/Controls: May supervises technical support staff Work Environment: Laboratory environment; may require working evenings and weekends; may involve working with human and animal subjects. HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer."}