{"jobID": "2611433028", "jobLocation": "Arlington_VA", "jobTitle": "Regional Sales Manager, US Federal-DOD and IC", "companyRating": null, "companyInfo": {"Website": "www.threatconnect.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company DescriptionThreatConnect® arms organizations with a powerful defense against cyber threats and the confidence to make strategic business decisions. Founded in 2011, ThreatConnect officially launched the ThreatConnect Platform in 2013. Since then, ThreatConnect has grown to more than 20,000 users worldwide. Today, ThreatConnect provides a suite of products designed to meet the threat intelligence aggregation, analysis and automation needs of security teams at any maturity level - built on the industry's only intelligence-driven, extensible security platform. If you want to work on building a world-class security platform, you will enjoy a career that truly makes an impact. For more information on the benefits of working at ThreatConnect, visit www.threatconnect.com/careers Job Description ThreatConnect is experiencing rapid growth fueled by our market-leading solutions and experienced sales team. This position addresses expanding market share across the Civilian Agencies in the U.S. Federal Government.  This position reports directly to the Senior Vice President of Global Sales. Responsibilities:Full responsibility for driving revenue in your area, with a strong focus on net-new customersIdentify, qualify, and develop new opportunities through prospecting and networkingManage and maintain your territory’s sales pipeline and target key accounts and vertical markets for developmentConsistently achieve assigned monthly, quarterly, and annual sales targetsProvide accurate monthly and quarterly sales forecastsSupport channel and MSSP sales resources in your regionStay abreast of competitive intelligence and provide feedback for executive managementRequirementsBachelors Degree and 6+ years of sales experience with enterprise security offerings to the DOD/IC CommunityExperience with modern sales strategies; experience with Sandler is a plusThe ability to take on a consultative style when presenting ideas and productsCompetency with sales tracking toolsOutstanding oral and written communication skillsMust be detail oriented and capable of accurate work with minimal supervisionThe ability to travel approximately 25% of the timeMust be located in the DC/Baltimore areaBenefitsWORK-LIFE BALANCE:10 Paid Federal HolidaysAccrued Paid Time Off (PTO) for vacation/sick timeYour birthday offEmployee recognition program with quarterly awardsEmployee referral programMilitary leave options availableEducation Reimbursement program for job-related college courses and professional trainingCompany-provided refreshments at our headquartersQuarterly events with your geographic teamAnnual company partyMEDICAL:MEDICAL COSTS FOR INDIVIDUALS AND FAMILIES ARE 100% COVERED!Prescription drug coverageDental coverageVision coverageCompany-paid short-term and long-term disabilityCompany-paid life insurance and AD&D; coverageFINANCIAL:401K retirement savings plan with company matching program of up to 6%Cell phone stipendHealth Savings Account"}