{"jobID": "2764003481", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.verticalnerve.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "The Data Analyst will join our growing Business Intelligence team and will be responsible for collaborating with our business user teams in circulation, content, production, distribution, and sales.     This role will work closely with our senior leaders and our analytic vendors to bring advanced data driven solutions that will guide corporate strategies around the content we produce, subscriber growth strategies, advertising growth, and overall corporate decision making.    Working knowledge of statistical modeling or similar skillsExperience with major testing methodologies (A/B, multivariate) and tagging/measurement strategies associated with performance optimizationUses SQL and other data mining tools (Alteryx, R, SQL, SAS), ensures that a reporting infrastructure is in place that measures success across a variety of quantitative indicators, including but not limited to campaign performance, trial conversion, retention, and online conversion funnelsExperience using relational databases for extracting and analyzing dataPerform ad hoc analysis on digital prospects or current digital subscribersReviews data for insights, trends, and key observations and prepares reports and presentations in non-technical terms to describe key analytic findings # of Hires Needed 1 Job RequirementsBachelor's degree in a quantitative discipline (Statistics, Mathematics, Economics)  3-5 years of analytics experience.   Experience with database analysis tools and techniques.  Experience in experimental design and testing methodology.  Proficient in analytical tools such as R, Alterys, SQL, SAS, SPSS, Excel and other MS Office Software.  Experience working in the Azrure environment is a plus."}