{"jobID": "2829531493", "jobLocation": "Plano_TX", "jobTitle": "Advertising & Analytics - Data Scientist: Applied Machine Learning and Advertising Modeling (AdCo)", "companyRating": "3.4", "companyInfo": {"Website": "www.att.jobs", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (T) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon, T-Mobile, Sprint"}, "estimatedSalary": "96000", "jobDescription": "Machine Learning Scientist Overall Purpose: The Machine Learning Data  Scientist will be responsible for designing and implementing large- scale  machine learning and deep learning models intended to support advertising  targeting, optimization and attribution-based decision making. Key Roles and Responsibilities Machine learning and deep learning model development  using open source machine learning libraries such as TensorFlow, Keras, H2O,  Caffe, MXNET.  This position will work closely with the IT, Sales and  Marketing organizations functional leads to formulate hypothetical insights and  work through the lifecycle of delivering these insights to production in the  form of go-to-market products targeting advertisers, ad agencies and planners.  Design and build large and complex data sets, from spurious sources while  thinking strategically about uses of data and how data use interacts with data  design. Primary focus on application of Machine and Deep Learning models in the  creation of products targeting the digital, television and programmatic space.  A foundational understanding of advertising and media data setstelevision  viewership data, mobile and desktop browsing, digital ad logs, etc.as well as  a background in the mechanics of ad-tech (DSPs, SSPs, DMPs, Programmatic  bidding and placement) targeting and delivery mechanisms helpful.Additional areas of focus include (but not  limited to) performing statistical analyses with existing data sets in  statistical packages. Visualize and report data findings creatively in a  variety of visual formats that appropriately provides insights to the  organization. Technical  Expertise: Mastery or self-sufficient in programming  environments, including Python (especially NumPy and pandas), Scala or R. A  working knowledge of Spark, Jupyter Notebooks, Sparkling Water, Driverless AI,  Databricks or other COTS (Commercial Off the Shelf) development environments  would be helpful.Bonus: Machine  learning development and deployment in cloud environment such as SageMaker in  AWS or Colab in GCP, Azure Machine Learning Studio. Deep learning using  TensorFlow or similar libraries. Familiarity with extremely large datasets,  data structures and development platforms, including Hive, Hadoop and Pig.  Candidates may provide their own GitHub depository to show their work. Education: Prefer Masters of Science or above in Statistics, Econometrics, Data Science, Computer Science, Mathematics or Scientific Computing; Data Analytics, Machine  Learning or Business Analyst nanodegree; or equivalent experience. Experience: Typically requires 5 or more years experience or PhD in  a relevant field. Previous modeling work in advertising or content (television  viewership, mobile/digital browsing, ad logs, etc.) preferred. Supervisory: No. Additional Information:"}