{"jobID": "2776978624", "jobLocation": "Sunnyvale_CA", "jobTitle": "Principal Scientist, PK Modeling", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "General Position Summary/Purpose: Responsible to provide PK and PKPD modeling expertise to support oncology discovery and development projects and influence regulatory strategy, particularly with pharmacokinetic (PK) and pharmacodynamics (PD) modeling and simulation and other statistical analyses. Work closely with multidisciplinary teams to integrate PK, PKPD, and DM data to support preclinical development of drug candidate and regulatory submission.  Key Accountabilities/Core Job Responsibilities: Expert in PK and PD principles and design, execution, data analysis, modeling & simulation, interpretation and statistical analysis. Expert in PK, PD, PBPK and population PK/PD modeling and simulation using relevant software tools. Perform mechanism based PKPD and population PK and PKPD-analyses, and other model based analyses on a regular basis. Review nonclinical data and utilize modeling and simulation approaches using in vitro and animal data to determine the starting dose for first in human studies and potential DDI liability. Provides a rationale for dose escalation and dose range in phase 1 studies. Functions as a consultant in areas of expertise both within the department and for project teams. Provide PK and PKPD expertise and input into related documents including clinical development plans, protocols and amendments, Investigator Brochures, SOPs, case report forms, study reports, manuscripts, summaries for regulatory authorities, INDs, NDAs and sNDAs. Participate and present the results in group and project team meetings. Participate on cross functional teams to effectively identify and characterize high quality drug candidates. Write scientific reports and prepare appropriate documentation to support applications for regulatory agency filing as required. Must have clear and effective communication skills and building effective technical collaborations in a team model environment.  Qualifications and Requirements: Ph.D. degree in pharmacokinetics/pharmaceutical sciences, pharmacometrics, clinical pharmacology, mathematics, statistics, or other related discipline with an emphasis on pharmacometrics and PKPD modeling. At least 8 years hands-on in the modeling and simulation in industrial drug discovery setting with a solid understanding of application of PK, PKPD, and PBPK models and fundamentals of statistical modeling. Appropriate modeling and computer software experience and proficient in computer programs or PK software, i.e., WinNonlin, NONMEM, GastroPlus, Simcyp or similar programs. Experience in delivering multiple small molecule compounds into IND is a must; experience in early stage clinical development programs/NDA submission is a plus Proactive in problem-solving and be able to independently manage timelines and priorities. Excellent interpersonal skills, strong written and oral communication skills. Ability to work independently to drive project forward as well as collaboratively in a multidisciplinary team environment. Equal Opportunity Employer Minorities/Women/Veterans/Disabled "}