{"jobID": "2824008550", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.hireclout.com", "Headquarters": "Woodland Hills, CA", "Size": "1 to 50 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sr Data EngineerAre you looking for a transformative career in the aviation industry? Does the prospect of building a platform for unmanned aircrafts excite you? Then join our team today! This is a hands-on position where you will help develop, test, and improve our company’s database and APIs that allow aircrafts to connect with our data. As a Data Engineer this is a great opportunity to serve as the technical lead for our data engineering team in addition to acting as an individual contributor in all aspects of the development process including: architecture, specification reviews, automated testing, implementation, code reviews, debugging, and documentation.About You:You are a veteran software engineer with 7+ years of experience.You have solid Computer Science fundamentals including data structures, algorithms, object-oriented design, and systems architecture.You are an expert in one or more programming languages including: JavaScript, Go, C++, Python, Scala, or Java.You understand SQL deeply and know how to build fast and reliable distributed databases with the ability to ingest large quantities of data from various sources and standardize them into relevant information.You are knowledgeable of geographic information systems and tools.You’ve built applications and microservices with Docker or Kubernetes container technologies.You know when and why to use certain cloud providers such as AWS, Azure, or Google Cloud.You have a deep understanding and reasoning behind certain technical decisions and have the ability to make practical, well-though-out recommendations during uncertain and risky situations.You enjoy solving complex technical problems with cross-functional teams.Brownie points if:You have a passion for aviation technology.You have worked with geospatial mapping technologies.You have experience with mapping technologies (e.g. Google Maps, Apple Maps), and data visualization tools (e.g. D3.js).You understand data science, machine learning, and data mining.You have experience working with large sets of data and distributed computing tools such as Hadoop, Hive, Spark, or Cassandra."}