{"jobID": "2834946874", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist, Healthcare", "companyRating": null, "companyInfo": {"Website": "www.hitachipowersystems.us", "Headquarters": "Basking Ridge, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company: Hitachi America, Ltd. Division: R&D;/Big Data Lab Location: Santa Clara, CA Status: Regular, Full-Time Summary Hitachi America, Ltd. (http://www.hitachi-america.us/) has an opening for Research  Scientist, Healthcare in the Big Data Laboratory located in Silicon Valley. The  mission of this laboratory is to help create new and innovative solutions in  big data and advanced analytics. The laboratory focuses on research, technology  innovation, proof-of-concept activities, technical marketing and business  development for novel big data solutions, leveraging Hitachi’s technologies,  reinforcing Hitachi’s messaging around big data, and establishing Hitachi as a  leader in big data.  Large  amounts of data are being generated from all segments of healthcare. From image  data coming from MRI machines, ultrasound machines and CAT scans, to clinical  data from Electronic Health Records, to operational data from hospitals, to  financial data from payers, all the way to personal health data from wearables.  Hitachi is looking at harnessing all this data, structured and non-structured,  real-time and historical, to develop advanced analytics technologies in the  emerging areas of Early Warning Systems, Clinical Decision Support Systems, Patient  Analytics, Population Analytics, Hospital Operations Analytics and other such  important areas.  We are seeking a Research Scientist in machine  learning to create innovative algorithms and solutions for healthcare. The successful candidate will have an opportunity  to solve challenging real-world problems, work on big healthcare data and to  contribute to solutions that will benefit society, and potentially help save  lives. This  position is a perfect match for a visionary scientist who is passionate about  empowering society through the tremendous potential of Artificial  Intelligence/Machine Learning.  More information about Hitachi  healthcare technology and the research being done at the Big Data Laboratory  can be found at:  http://www.hitachi-america.us/rd/about_us/bdl/  Responsibilities:  · Research and develop innovative data analytics  algorithms and solutions for healthcare  · Prepare and execute proof-of-concepts of the solutions  with customers  · Work with business units to commercialize the  successful proof-of-concepts  · Protect Hitachi’s IP through patents and other  activities, and publish technical results in leading venues to establish  Hitachi as a leader in big data and advanced analytics.  · Ph. D degree in Computer Science or related field, with training in  machine learning, statistics, or applied mathematics.  · At least 1 year of research experience with healthcare data preferred.  · Strong research experience in machine learning algorithms.  · Good programming  skills and knowledge of data science tools and libraries in R, Python or Scala.  · Self-motivated and passionate about solving real-world healthcare problems  and building innovative systems with big data analytics.  · Understanding of  high performance computing for big data is preferred.  · Demonstrated ability to effectively create and deliver technical  communications, including patent applications, presentations, papers, and  reports.  · Ability to collaborate successfully with R&D; co-workers, Hitachi  group company customers, partners, engineers, and business units in Hitachi  with the goal of commercializing the proposed solution.  · Strong communication skills.  · Ability to travel within the US and internationally as needed. EOE-Females/Minorities/Protected  Veterans/Individuals with Disabilities"}