{"jobID": "2832171823", "jobLocation": "Dallas_TX", "jobTitle": "Data Engineer - Master Data", "companyRating": "4.0", "companyInfo": {"Website": "www.lrs.com", "Headquarters": "Springfield, IL", "Size": "501 to 1000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " LRS Consulting Services is seeking an experienced Data Engineer (Master Data) for a contract to hire great new opportunity with our client in Dallas, TX. If this is you, please submit your resume now! Job Description: Our Client is looking to add an exceptional contributor to the Data&Analytics; team who will help implement centralized master data. This team is responsible for managing master data applications and we are constantly looking for opportunities to improve the internal customer experience through consistent and scalable data management solution. This is exciting time to join a fun and dynamic team at Our Clilent Site that is a trusted source of goodness for millions of families. The Data Engineer, Master Data will report in to the Senior Manager of Data&Analytics; within Information Technology, Data&Analytics; team (D&A;) ResponsibilitiesJoin existing project building and supporting master data repositories and enterprise database.Perform analysis, data profiling, development, and integration of disparate systems throughout all phases of the project life cycle.Develop extensions and customizations to the services tier of MDM.Supporting requirement analysis, system analysis, design, development, testing, implementation.Develop data models which supports data enrichment and extendibilityPerform automation and optimization work on new and existing models.Provide MDM development support and detailed technical knowledge of MDM products.Analyzes and defines detailed MDM processes, tasks, data flows, and dependencies.Provide technical knowledge of ETL and create integration solutions.Produces detailed MDM technical design specificationsWork with data and information architects to choose a reference architecture or data integration style to meet individual project needs.Play a key role in information governance, contribute to development guidelines.Assist in defining technical best practices for data movement, data quality, data cleansing and other ETL related activities.Work with Data Management Analyst to ensure proper documentation and definitions are incorporated into the Enterprise Data Dictionary.Required Skills Desired Development Skills Visual Studio, Windows Communication Framework (WCF)IIS,SharePoint DevelopmentVisual Studio, Windows Workflow Foundation 4.5, AppFabric, IIS, WCFETL experience (Informatica, Integration Services, etc.)Data warehouse experience, or experience with at least 1 multidimensional OLAP tool Solution development for MDM system with deep expertise on all aspects of (Microsoft Master Data Services (MDS), Profisee Master Data Maestro (preferred), etc.) MDM implementation options.  Required Development Skills Enterprise data management, integration, analytical, and data quality skills.Hands-on experience with MDM configurations - Data modeling&Data; Mappings (Landing, staging and Base Objects), Data validation, Match and Merge rules, writing and customizing user exits.Understanding of SOA, Data Integration, Data Quality, Data Architecture and MDM, project life cycle phases, best practices and processes.Participated in and led the requirement gathering/solution architecture for MDM initiatives.Experience in integrating external business application with MDM using batch processes, services, API, and message queues a significant advantage.T-SQL Development skills including developing stored procedures and ETL processes.Extensive experience in MS SQL Server, SSIS, SSAS, SSRS and comparable data management tools.Experience with lifecycle management developing, testing, documenting, implementing, automating, and maintaining system changes.Proficiency in Microsoft Excel, Visio and PowerPoint.Familiarity with Lean Software Development and Agile methodologies.Demonstrated ability to quickly learn new systems.Excellent analytical and technical skills with high attention to detail: demonstrated strength in problem-solving.Excellent verbal, written and interpersonal communication skills.Demonstrated strong customer focus.Strong organizational skills with the ability to manage multiple projects and analysis.Familiarity of ASP.NET, C#.NET Candidate must be able to effectively communicate in English (written&verbal;)  Candidate must have permanent authorization to work in the USA for any employer  Corp to corp candidates will not be considered  LRS is an equal opportunity employer. Applicants for employment will receive consideration without unlawful discrimination based on race, color, religion, creed, national origin, sex, age, disability, marital status, gender identity, domestic partner status, sexual orientation, genetic information, citizenship status or protected veteran status."}