{"jobID": "2688121020", "jobLocation": "San_Francisco_CA", "jobTitle": "Travel Dialysis Registerd Nurse", "companyRating": null, "companyInfo": {"Website": "jobs.fmcna.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Baxter, DaVita, Dialysis Clinic Inc"}, "estimatedSalary": null, "jobDescription": "Fresenius Travel Nurse Program: As part of the Fresenius Travel Nurse program, youll have a unique opportunity to build your career in a flexible, autonomous environment. Working with new and different people and personalities, and with physicians and nurses from various facilities, will make each day an exciting challenge. Through it all, youll make a profound difference in the lives of patients affected by kidney disease. Come join a leader in Dialysis, where assignments are ongoing, as we have over 2,200 clinics and numerous acute facility programs, so travel with us can be continuous. Benefits:13 week assignmentVariety of settingsAcute or Chronic care positionsTop salariesPaid time offFree private housingGrowth OpportunityPosition Specific Details:Anticipated Start Date: ASAPExpected call time: N/AHours/Shifts: MWF 7am-9:30pm, TTS 4am-6:30pmMachine type: T machinesProton/AMI/eCube: eCubePatient Ratio: RN 1:8 PCT 1:4Number of Chairs/Stations: 17Position Summary: The Fresenius Medical Care Healthcare Recruitment registered nurse (RN) is responsible for the delivery of quality patient care through the nursing process of assessment, diagnosing, planning, implementation, and evaluation. The RN is responsible for directing and coordinating all nursing care of patients based on established clinical nursing practice standards. The RN collaborates with other healthcare professionals to ensure effective and efficient patient care delivery and achievement of desired patient outcomes. The RN utilizes knowledge of patients age and cultural diversity into the provision of patient techniques that demonstrate positive outcomes in patient care. The RN provides care as a temporary employee and understands that travel away from his or her home state may be required for employment, or continues employment with Fresenius Medical Care Healthcare Recruitment. Position Education / Qualifications:Graduated from an accredited school of professional nursingLicensure appropriate to the state RN is working in and the appropriate certifications to the position and facilityMinimum 1 year Dialysis experience. For Inpatient Services (Acutes), the preceding 12 months must be in a hospital setting. For Outpatient (Chronic), 2,000 hours in Dialysis in the preceding 2 years.Proficient oral and written skillsCurrent CPR certificationAnnual PhysicalTwo professional references from current / former supervisorsCitizen of the U.S. or proof to work in the U.S.Job Knowledge / Responsibilities:Ability to utilize the nursing process in the provision of nursing care including but not limited to administering medications and treatments in compliance with the physicians orders and applicable hospital policy, interpreting diagnostic tests, formulating a plan of care, collaborating with other healthcare providers, and provide education to patients and / or significant others (while in compliance with HIPPA).The RN must be able to demonstrate the knowledge and skills necessary to provide care appropriate to patients of all age groups. Must demonstrate knowledge of the principals of growth and development through the life span, possess the ability to assess data reflective of the patients status, and interpret the appropriate information needed to identify each patients needs in relation to age.Must document / chart observations and other data related to the clinical condition of the patient. Must properly and accurately chart observations and activities related to patient care.Communicates report to appropriate healthcare workers in accordance with hospital policy.Performs all required and related duties.Physical Requirements: The individual may be required to pull up or reposition patients, lift supplies, place equipment on supports, push bed or chair through facility. The individual must be able to bend over to perform certain duties, the individual must be able to maneuver throughout the facility in response to any facility emergency. Interpretation of environmental input requires visual and auditory skills. In the event there is a need to evacuate the building, heavy lifting of the patients may be required. EO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity"}