{"jobID": "2811525139", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst (Product)", "companyRating": "4.0", "companyInfo": {"Website": "www.omadahealth.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Omada Health is on a mission to inspire and enable people everywhere to live free of chronic disease. Job Overview: The data team is responsible for building quantitative narratives and data products that empower healthy behavior change for our users and smarter decisions for our stakeholders. We are deeply motivated to learn what works (and what doesnt) for health behavior change at scale, especially since Omada is paid when we improve clinical outcomes for our users.  As a Data Analyst, you will have significant say in what you do and how you do it, and youll be backed by a diverse team of analysts, scientists, and engineers from disciplines including epidemiology, economics, statistics, and computer science. Your work will drive business impact, alongside your own intellectual growth, and will ultimately inspire and enable participants in the Omada program to live free of chronic disease.  Data Analysts at Omada own projects from end to end, translating raw, complex datasets into meaningful insights, visualizations, and narratives that help our business and clients make critical decisions. Your impact:Build analytic and reporting solutions for cross-functional business partners in product, design, user insights, finance, operations, and engineeringQuantify participant and/or health coach behaviors so future product changes are prioritized appropriately and health outcomes are optimally improvedDesign and build self-service dashboards to measure performance and direct product teams efforts towards initiatives with the largest impactDefine data to be collected for measuring success of new product features, and work with engineering on proper tracking and instrumentation of dataDesign and analyze A/B tests for experimental product featuresPerform ad-hoc analyses for internal stakeholdersProvide tool training and assistance to internal stakeholders to democratize data and champion a data-driven cultureAssist in core Data Team initiativesYou will love this job if you are/have:Methodical. You put frameworks to unstructured problemsMultimodal. You iterate through different presentations of data to better translate a problem and its solution so stakeholders from all backgrounds can understand the dataCurious. You ask enough whys to get to the root problem of a data requestResult-driven. You seek to find the most efficient and effective path to an analysisBusiness-sense. You know that solving hard problems require contextual understanding to put numbers to good useDetail-oriented. You typically catch gotchas before they get youCollaborative. You can work both as part of a team and in a self-directed mannerYou will be successful in this job if you have:BA/BS in a quantitative field or equivalent practical experience2-5 years of applicable industry experience in data analysis and visualizationExperience working on cross-functional teams of engineers, product managers, and designersConfidence with at least 1 analytical tool, such as R or PythonConfidence with SQL or other querying languageFamiliarity with Tableau or other business intelligence toolsExpertise in creating clear and concise presentationsExpertise in addressing and prioritizing client inquiriesExcellent written and verbal communication skillBonus points for:Experience in writing ETLsWorking knowledge of statistics, hypothesis testing, and experimental designExperience working with various types healthcare data, such as claims data, enrollment data, and clinical dataBenefits:Competitive salaryStock options + extended post termination option exercise window (for Omadans who are with us 3 years or more)Flexible vacationParental leaveHealth, dental, and visionHealthy snacks and mealsWellness events (e.g. running club)Community volunteering401k retirement savings planAbout Omada Health: Weve pioneered digital behavioral medicine: an innovative approach to tackling the growing epidemic of type 2 diabetes, heart disease, and obesity. Our online programs combine world-class science, technology, and design to inspire and enable people everywhere to live free of chronic disease. Named one of Fast Companys 50 Most Innovative Companies in the World, our team includes passionate and talented individuals. Our approach has been embraced by major employers across the country, including Costco and Iron Mountain, as well as leading health plans, such as Kaiser Permanente and BlueCross Blue Shield of Louisiana.  We carefully hire the best talent we can find, which means actively seeking diversity of beliefs, backgrounds, education, and ways of thinking. We strive to build an inclusive culture where differences are celebrated and leveraged to inform better design and business decisions. Omada is proud to be an equal opportunity workplace and affirmative action employer. We are committed to equal opportunity regardless of race, color, religion, sex, gender identity, national origin, ancestry, citizenship, age, physical or mental disability, legally protected medical condition, family care status, military or veteran status, marital status, domestic partner status, sexual orientation, or any other basis protected by local, state, or federal laws."}