{"jobID": "2835282183", "jobLocation": "Westlake_TX", "jobTitle": "Network Systems Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.techstargroup.com", "Headquarters": "Irving, TX", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "About US:TechStar Group is a niche Product Development, Business Solutions, and Global IT Services firm based in Dallas, TX. At TechStar, we help drive customer success by leveraging our deep expertise in IT Solutions and Business Process improvements to enable our clients to achieve their organizational objectives.Founded in 2002, TechStar Group has grown to become a solutions and implementation partner of choice to multiple Fortune 500 companies. Headquartered in Dallas, TX, TechStar currently has offices and delivery locations throughout the US and India.Job Title: Network Systems Data ScientistLocation: Westlake, TX 76262Duration: 12+ MonthsAbout the opportunity:Develop, install, maintain, and modify advanced scientific and/or engineering application programs, business application programs, or integrated programs. Identify and analyze user requirements and recommend appropriate applications or modifications. 10+ years of experienceJOB TITLE: Network Systems Data ScientistJOB DUTIES: Build Network systems Data Models utilizing BIG data HADOOP Echosystems- all tools, Tableau and SPLUNK.Data Analytics Work and Data Preparation: • Activity to be performed with Strict Security guidelines. • Data preparation. Exploratory analysis. • Features engineering and dimensionality reduction. • Supervised and unsupervised modeling. • Apply Data Science Statistical algorithmsPerformance Data Modeling and Data Analyzing: Following activity to be performed • Analyzing large volume of data • Organize Models by root cause category, app, sub-team, • Predict the accuracy for root cause. • 3 Used Cases and Models for each of them.Productionize Model (3 Models as Defined by Used Cases): Following activity to be performed • Activity such as scoring,exporting and monitoring model in production. • Developing and implementing data collection systems and other strategies that optimize statistical efficiency and data quality • Filtering and “cleaning” data and review computer reports, printouts, and performance indicators to locate and correct code problems • Developing, prototype and test predictive algorithms • Identifying, analyzing, and interpreting trends or patterns in complex data sets • Acquiring, cleaning and structuring data from multiple sources and maintain databases/data systems.MUST HAVE SKILLS:Python, SQL, Machine Learning, RStudio/SAS, SPARK, HIVE, InformaticaEDUCATION/CERTIFICATIONS:Please indicate whether this position is standard 9-5, if weekend work is required, if the person need to be \"on call\" at any time, etc.What we offer:At TechStar, we are always seeking high-performers who are at the forefront of technology. We provide competitive compensation, a comprehensive benefits package and access to challenging opportunities that facilitate personal and professional growth.Learn more about us at: www.techstargroup.comSuman GurramEmail: suman@techstargroup.comC: 972 591 8719 - provided by DicePython, SQL, Machine Learning, RStudio/SAS, SPARK, HIVE, Informatica"}