{"jobID": "2646199769", "jobLocation": "Northville_Township_MI", "jobTitle": "Summer Intern - Digital Roots", "companyRating": null, "companyInfo": {"Website": "www.interactions.com", "Headquarters": "Franklin, MA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Nuance, Avaya, Aspect Software"}, "estimatedSalary": null, "jobDescription": " Job Title Summer Intern - Digital Roots Location Michigan-Ann Arbor - Ann Arbor, MI 48104 US  Michigan-Northville - Northville, MI 48167 US (Primary) Education Master's Degree Category Intern Shift Type Standard Business Hours Employee Type Internship Willingness to Travel NoneInteractions is changing the way businesses and consumers communicate by transforming frustrating experiences into productive conversations.  At Interactions, we have created an environment that is based on innovation, quick-thinking and abundant growth opportunities. Our employees are smart, hard working and invested in the success of the company. We pride ourselves on our forward thinking and innovation, and our ability to balance a start-up environment with a healthy work-life balance.  Working at Interactions is an opportunity to be part of the team that’s changing the way customer care is delivered.  To support our continued growth, Interactions is continuing to expand its Internship Program for 2017 in speech recognition, natural language processing and machine learning. Specifically, this year’s projects will focus on Rapid creation and adaptation of Natural Language understanding models, Joint speech recognition and understanding models, Deep Neural Networks for spoken language understanding, Discourse parsing of conversational texts, and Voice biometrics. The summer internship will last ten weeks. Job ResponsibilitiesUnder the guidance and direction of the internship project leader, use vast spoken and written corpora of conversations to develop algorithms and software for language understanding and conduct original research to invent new methods for improved performance.These innovations will push the edge of science forward and will be deployed in large-scale services such as virtual assistants and intelligent agents for Fortune 500 customers. .QualificationsRequiredCandidate for PhD or MS or BS in computer science, engineering, mathematics, or a related fieldA background in speech recognition, machine learning, or \u2028natural language processing with experience in one or more of the following: data-driven modeling methodologies for speech and language tasks, advanced machine learning such as deep neural networks, active learning, large-scale text mining, web crawling, and dialog modeling. \u2028\u2028 \u2028Strong software skills: Python, C/C++, shell programmingAbout Interactions: Interactions is a leading provider of speech and natural language technology that enables businesses and consumers to engage in productive conversations. With flexible products and solutions designed to meet the growing demand for unified, multichannel customer care, Interactions is delivering significant cost savings and unprecedented customer experience for some of the largest brands in the world. Founded in 2004, Interactions is headquartered in Franklin, Massachusetts with additional offices in Indiana, Texas, New Jersey and New York. For more information, visit www.interactions.com.  The above statements are intended to describe the general nature and level of work being performed by people assigned to do this job. The above is not intended to be an exhaustive list of all responsibilities and duties required.  External and internal applicants, as well as position incumbents who become disabled as defined under the Americans with Disabilities Act must be able to perform the essential job functions (as listed) either unaided or with the assistance of a reasonable accommodation to be determined by management on a case by case basis"}