{"jobID": "2648635140", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Bioinformatics Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.progenity.com", "Headquarters": "San Diego, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "Job Title:Bioinformatics ScientistJob Description:Progenity invites applications for an exciting Scientific Computing / Bioinformatics position at our R&D; facilities located in Ann Arbor, MI, near the University of Michigan. Our focus here is the development of new and innovative molecular diagnostics products that provide reliable information for life impacting decisions in the fields of oncology and women’s health.The Bioinformatics Scientist will collaborate across multi-disciplinary teams to develop analytical methods for the discovery and classification of genetic signatures to diagnose or predict risk of developing a spectrum of diseases. Successful candidates will have the opportunity to work at the cutting-edge of the genetic testing industry, and expand their skills in a collaborative and fast-paced environment.Responsibilities:Participate in R&D; projects to develop new molecular diagnostic products.Solve practical problems in data analysis and interpretation.Develop software components that facilitate high-throughput data analysis.Communicate effectively with collaborators to support projects and mitigate risks.Document development activities and quality control measures.Qualifications:Degree requirement: B.S., M.S. or Ph.D. in a quantitative field (Bioinformatics, Mathematics, Statistics, Computer Science, etc) or core science field (Chemistry, Biology, Physics). Specific job title and classification will depend on education, applicable experience, and prior accomplishments.Effective communication skills in verbal, written, and visual media.Knowledge of genetics and biochemistry, particularly of high-throughput sequencing and genetic testing is a plus.A demonstrated ability to work with large data sets in pursuit of research goals, applying appropriate statistical and analytical methods.Experience with statistical analysis packages such as R is a plus.Proficiency with software development in Python, and some experience with a compiled language (C, C++, C#), employing coding best practices and use of version control systems preferred. To apply ofor this position, contact HR@progenity.com. Progenity, Inc. is an equal opportunity employer. Reasonable accommodations may be made for individuals with disabilities to perform the essential functions of this position. "}