{"jobID": "2515108794", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher- Machine Learning", "companyRating": "4.2", "companyInfo": {"Website": "www.akunacapital.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Optiver, Citadel, DRW"}, "estimatedSalary": "150000", "jobDescription": "About Akuna: Akuna Capital is a young and booming trading firm with a strong focus on cutting-edge technology, data driven decisions and automation. Our core competency is providing liquidity as an options market-maker meaning we provide competitive quotes that we are willing to both buy and sell. To do this successfully we design and implement our own low latency technologies, trading strategies and mathematical models.  Our Founding Partners, Andrew Killion and Mitchell Skinner, first conceptualized Akuna in their hometown of Sydney. They opened the firms first office in 2011 in the heart of the derivatives industry and the options capital of the world Chicago. Today, Akuna is proud to operate from additional offices in Sydney, Shanghai, and Boston. What youll do as a Quantitative Researcher at Akuna: Akunas Quantitative Trading and Research team is looking to add Quant Researchers to a team of mathematicians, statisticians and technologists. This team creates trading strategies scientifically by combining its quantitative expertise with a sophisticated understanding of derivatives and financial markets.  We are looking for talented researchers who can apply and develop machine learning algorithms to contribute to Akunas strategy portfolio. In this role, you will: Develop trading strategies using statistical and machine learning algorithmsDesign and implement optimization algorithms for portfolio constructionAdvance existing initiatives and explore opportunities for new research topicsQualities that make great candidates:2+ years of strong professional work experience in statistics, machine learning or related areaMasters or PhD in Statistics, Computer Science, Mathematics or similarIntermediate programming skills in Python (C++ is a plus)Experience working on practical applications with real-world datasetsFinancial experience is not a requirement"}