{"jobID": "2830856884", "jobLocation": "Los_Angeles_CA", "jobTitle": "Advanced Analytics Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "92000", "jobDescription": " About the role  The Analytics Consultant focuses on building impactful data visualization and solutions to support business decisions at Avanade and for Avanade clients. Its goal is to support the use of data-driven insights in business performance, opportunities for improvement and identification of root cause problem analysis.  Day-to-day, you will:  Gather requirements for business analysis from end users and document the same.  Understand business objectives of analyses and document the same  Rationalize and Identify use cases for developing data visualization, including identifying different personas for each use case  Undertake data analysis and collaborate with analytics team to shape data to meet data visualization needs  Profile data and identify data quality issues. Collaborate with project team to identify options to address data quality and make appropriate recommendations  Develop data models, data shaping logic and data visualizations using Excel, PowerPivot, Power BI  Use PowerBI, Excel, Power Query and DAX to develop Power BI Models/Solutions.  Publish and support roll out of Power BI and Excel solutions as part of project deliverables  Travel to client location as needed.  About you  You are an experienced technology professional with a passion for emerging technologies and a desire to innovate. You can work with cross-functional teams and diverse clients. You have knowledge in the common skills of database development including data models and T-SQL, report development and business intelligence terminology.  Your background and skills likely include:  Demonstrable experience working with database, storage, collection and aggregation models, techniques and technologies, with the ability to apply such methods to solve business problems.  Experience working with statistical and data visualization tools and techniques.  Experience in structured problem solving assignments.  Experience working with PowerBI or Tableau and Excel  You likely have a Bachelor's Degree in Mathematics, Statistics, Economics with a passion for analyzing data to delivery business insights.  About Avanade  Avanade leads in providing innovative digital services, business solutions and design-led experiences for its clients, delivered through the power of people and the Microsoft ecosystem. Our professionals combine technology, business and industry expertise to build and deploy solutions to realize results for clients and their customers. Avanade has 29,000 digitally connected people across 23 countries, bringing clients the best thinking through a collaborative culture that honors diversity and reflects the communities in which we operate. We welcome all, and seek talented individuals who can bring their whole self to work, build inclusive teams and encourage diversity inside and outside the organization. Majority owned by Accenture, Avanade was founded in 2000 by Accenture LLP and Microsoft Corporation. Learn more at www.avanade.comQualifications"}