{"jobID": "2783105515", "jobLocation": "Rockville_MD", "jobTitle": "Proteomics Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.mscweb.com", "Headquarters": "Rockville, MD", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Medical Science & Computing (MSC) is an exciting growth oriented company, dedicated to providing mission critical scientific and technical services to the Federal Government. We have a distinguished history of supporting the National Institutes of Health (NIH) and other government agencies. MSC offers a dynamic and upbeat work environment, excellent benefits and career growth opportunities.  We attract the best people in the business with our competitive benefits package that includes medical, dental and vision coverage, 401k plan with employer contribution, paid holidays, vacation, Medical and Flexible Spending Accounts, Pre-Tax Transit Assistance and tuition reimbursement. If you enjoy being a part of a high performing, professional service and technology focused organization, please apply today!  Medical Science & Computing is searching for a Proteomics Data Scientist to support the National Institutes of Health (NIH). This opportunity is full-time, and it is on-site in Rockville, MD. Duties & Responsibilities: Design and implement computational methods for high-throughput analysis of mass spectrometry data, in particular for proteomicsAnalyze biological data, integrating proteomics and genomics (proteogenomics)Work closely with researchers to assist them with selection of appropriate methods, use of databases and interpretation of dataProvide training and support in the use of commercial and/or open source tools for proteomics analysis (e.g. PEAKS Studio)Collaborate with researchers providing proteomics analysis services including presentation of resultsProvide statistical and bioinformatics consultation to NIH scientistsPosition Requirements:Ph.D. preferred. (Preferred degree in Analytical Chemistry, Structural Biology, Computer Science, or related discipline) OR M.S. degree with 4–6 years relevant work experienceAmple expertise in LC-MS/MS methodologies and data analysisUnderstanding of common proteomic assays and techniques, from basic proteolytic digestions to more complex tasks in post translation modification analysis, proximity ligation, and structural crosslinkingSolid foundation in proteomic bioinformatics, search algorithms, and data processing workflows, and the ability to develop new analyses in RMass spectrometry-based lipidomics/metabolomics experience is a plusExcellent analytical and problem-solving skillsExcellent written and verbal communication skillsQualified candidates must be legally authorized to be employed in the U.S.Medical Science & Computing is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status."}