{"jobID": "2827004891", "jobLocation": "Chicago_IL", "jobTitle": "Deals Analytics Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.pwc.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " PwC/LOS Overview  PwC is a network of firms committed to delivering quality in assurance, tax and advisory services.  We help resolve complex issues for our clients and identify opportunities. Learn more about us at www.pwc.com/us.  At PwC, we develop leaders at all levels. The distinctive leadership framework we call the PwC Professional (http://pwc.to/pwcpro) provides our people with a road map to grow their skills and build their careers. Our approach to ongoing development shapes employees into leaders, no matter the role or job title.  Are you ready to build a career in a rapidly changing world? Developing as a PwC Professional means that you will be ready to create and capture opportunities to advance your career and fulfill your potential. To learn more, visit us at www.pwc.com/careers. PwC Advisory helps our clients with their most challenging imperatives from strategy through execution. We combine the breadth of knowledge of over 48,000 global professionals with deep industry knowledge to deliver custom solutions for our clients. We work with the world's largest and most complex companies and understand the unique business issues and opportunities our clients face. Job Description As businesses grow and become more complex, they navigate complicated transactions. Our growing Advisory Transaction Services practice helps executives achieve strategic growth objectives for their organizations by driving informed and empowered acquisition, divestiture and reorganization decisions. Our transaction services professionals help companies across the deal continuum  developing the right strategy, identifying issues and points of negotiation and value, executing the deal seamlessly, and implementing changes to deliver synergies and improvements post integration.  Our Transaction Services consultants help clients across the deal continuum. This high performing team advises clients in executing acquisitions, divestitures, joint ventures & structured investments, as well as provide  financial and accounting diligence analysis for clients' transactions.  As businesses grow and become more complex, they navigate complicated transactions. Our growing Advisory Transaction Services practice helps executives achieve strategic growth objectives for their organizations by driving informed and empowered acquisition, divestiture and reorganization decisions. Our transaction services professionals help companies across the deal continuum- developing the right strategy, identifying issues and points of negotiation and value, executing the deal seamlessly, and implementing changes to deliver synergies and improvements post integration.  Our Transaction Services consultants help clients across the deal continuum. This high performing team advises clients in executing acquisitions, divestitures, joint ventures and structured investments, as well as provide financial and accounting diligence analysis for clients' transactions.  Position/Program Requirements  Minimum Year(s) of Experience: 4  Minimum Degree Required: Bachelor's degree  Degree Preferred: Bachelor's degree Finance, Business, Economics, Statistics,  Computer Science, Information Systems, Engineering or similar quantitative discipline.  Certification(s) Preferred: Certified Public Accountant Knowledge Preferred: Demonstrates extensive knowledge and/or a proven record of success in the following areas: Understanding of data extraction/transformation, analytics, and visualization approaches;Analyzing or managing accounting, financial, transactional data, and statistical methods in support of data analysis;Working with relational databases (SQL Server 2008, Oracle 10g, Microsoft Access, OLAP or other proprietary software);Leveraging business intelligence software (e.g. Tableau, PowerBI, Qlik, etc.);Understanding of financial statements, business cycles (Revenue, supply chain, etc.), business diligence, and valuation, etc.;Working in a dynamic, collaborative environment and working under time sensitive client deadlines; and,Demonstrating product development and management experience.Skills Preferred: Demonstrates extensive abilities and/or a proven record of success including in the following areas: Using a high degree of collaboration, ingenuity, and innovation to apply tools and techniques for application in Deals;Managing high performing technical teams, comprising data scientists, database administrators, data analysts, and data visualization specialists, etc.;Leveraging techniques to perform data ETL (Extract, Transform and Load), and experience with SQL, Alteryx, Power Query and other agile technologies;Designing interactive visual interfaces and dashboards (Tableau, Qlikview, Microsoft Power BI); and,Demonstrating knowledge in Modern web and software development using HTML, CSS, JavaScript, Ajax, PHP, ASP, Python, R, C#, JSON, .NET; interface design, UI and UX skills."}