{"jobID": "2795628949", "jobLocation": "Emeryville_CA", "jobTitle": "HRIS Data Integrity Analyst", "companyRating": null, "companyInfo": {"Website": "www.vituity.com", "Headquarters": "Emeryville, CA", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Help Us Enhance Patient Care Across AmericaThe Vituity Team. We innovate using our diverse business, analytic, and communications skills to tackle the challenges of today’s complex healthcare landscape. We reward excellence in our mission to enhance patient care across the health care continuum. We collaborate, cooperate, and celebrate our unique contributions because we know we can achieve more together than we can alone.  From our administrators and management consultants to our recruiters, data and financial analysts, developers, and marketers—we help the providers and hospitals we serve improve patient outcomes, operational efficiencies, revenue, and job satisfaction.  As a member of the Vituity team, you’ll put your skills to work helping our providers improve the care of the 6 plus million patients our providers treat annually in over 250 practices throughout the United States. You’ll have the recognition and support you need to grow professionally. And you’ll have the opportunity to discover work you really love in a family oriented company that wants you to succeed.  Vituity Practice Management is in an exciting phase of its journey as we transform our systems, processes and service delivery model into best-in-class operations. We’re looking for a HRIS Data Integrity Analyst (extensive Oracle Cloud HRIS experience required) with a proven track record who will be responsible for information certification and will execute processes that ensure the accuracy, completeness, and reliability of data—including associated business rules, business formulas, aggregations, etc.—for designated output (like reports, dashboards, etc.) You will be the primary liaison with system owners, end users, data entry specialists and IT educating them on how data needs to be entered, integrated and maintained, within the HCM system. You will lead system data governance processes. There is a lot of work to do. You in? Responsibilities include, but are not limited to…Data Analysis & IntegrityManage foundation structure governance – new contract acquisitions process, maintain work structure tables in HCM (i.e. Department, Location, Job, etc.), represent Oracle HCM in data governance advisory committeeMaintain Area of Responsibilities (“AOR”). Liaise with business on keeping up to date with frequent organizational changes (i.e. hospital leadership changes)Liaise with IT security counterpart on making updates to HCM security profilesRun frequent audit reports and obtain validation from business to maintain overall data integrityMaintain a high degree of data integrity, ease of acquisition, granular and aggregated visibility.Understand current HR data business functionality and author business requirements, mapping specs, and data models.Provide subject matter expertise and accurately interpret, counsel, communicate, and educate business on importance of data integrity and data consistency between systems.Create template with all data elements required and teach HRIS users how to accurately perform and validate data entry. HRIS AdministrationServe as backup to Sr. HRIS Administrator and Manager.Strong functional HR knowledge base with firm understanding of HR processes and data, especially as related to HR systems.Ability to fully comprehend holistic view of global systems structure and HR processes in order to make solid, independent decisions with confidence relevant to supported systems.Strong client service skills as you apply functional and technical knowledge to proactively troubleshoot issues and conduct knowledge transfer with end users.Strong interpersonal skills with the ability to collaborate with team members to understand and develop technology solutions for business needs.Organized, strong time management skills and ability to prioritize multiple tasks in order to meet established deadlines. Our Ideal Candidate Profile:Bachelor’s Degree.5+ years HRIS data integrity experience required.A plus would be experience with Oracle reporting tool OTBI or BI Publisher.Highly analytical mindset with strong ability to identify, troubleshoot and resolve data issues.Strong interpersonal skills with the ability to collaborate with team members to understand and develop technology solutions for business needs.Organized, strong time and project management skills and ability to prioritize multiple tasks in order to meet established deadlines.Excellent communication and presentation skills and ability to communicate effectively with all levels in the organization.Must possess strong ethical standards regarding the handling of confidential information.Must possess advanced proficiency in MS Excel.Attention to detail and accuracy is a must.Track record of leading through transformational change. Seasoned skills to ensure successful adoption of the future state ensuring staff are highly productive in the future state where new processes and tools have been introduced.Demonstrable experience in strategic execution.Experience working collaboratively across departments. Why Vituity? When you work at Vituity, you share your talents with an awesome team that makes coming to work empowering and fun. That’s why our employees have voted us a Best Place to Work in the Bay Area for nine years. That and some pretty incredible benefits: Competitive benefits package: Superior health plan options, best in class 401k plan (with a very generous company match like you’ve never seen before), 3 weeks paid vacation in your first year, tuition reimbursement policy, paid sabbaticals, and more!A Culture of Caring: not only like working together, but care about one another personally and professionally. We host fun staff activities, health and wellness programs, employee recognition programs, and so much more.Location, Location, Location: We are located in the Emeryville Watergate business park overlooking the San Francisco Bay -- just minutes away from San Francisco and the East Bay.Your Life. Your Career. Your Success. Apply Today!Vituity is an Equal Opportunity Employer."}