{"jobID": "2707823011", "jobLocation": "Dallas_TX", "jobTitle": "Sr. Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.edmentum.com", "Headquarters": "Bloomington, MN", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": " Edmentum is committed to making it easier for educators to individualize learning for every student through simple technology, high-quality content, actionable data, and customer success. Founded in innovation, Edmentum’s powerful learning solutions blend technology with individual teaching approaches. We are dedicated to being educators' most trusted partner in creating successful student outcomes everywhere learning occurs. Our commitment is built off the emphasis we place on our core values: passion, people, respect, collaboration, and performance.  At Edmentum, we are committed to building research-based curriculum and assessment solutions that empower educators and improve student outcomes across the globe. The Edmentum Research and Design Team is central to fulfilling our commitment to our national and international educators and learners. Each member of our team must be curious, collaborative, and have a passion to develop and conduct best-in-class research to provide evidence of valid, useful educational solutions that truly meet the needs of learners and educators.  The Sr. Data Scientist will be a thought leader, contributing to the strategy and tactical decision-making around algorithmic solutions to complex learning and assessment challenges and advanced data and learning analytics. This person will be flexible, innovative, and bring creative solutions to educational data challenges, whilst being well organized and willing to work collaboratively across the organization to ensure the solutions are practically and successfully designed and implemented. The Sr. Data Scientist will be responsible for developing and documenting methods for the management, extraction, and analyses of operational data that ensures data privacy and integrity and brings innovation in complex educational data challenges.  The Sr. Data Scientist must have experience and advanced knowledge of machine learning, artificial intelligence, unstructured data, and some experience in educational assessments, including adaptive assessments, and natural language processing. This role will require knowledge of advanced query tools and design requirements for how data is to be structured for scientific research, modeling, psychometric and cognitive analysis, reporting analytics and visualizations. The Sr. Data Scientist will serve as a liaison to leaders working on platforms, data architecture, development and technology to fulfill data requirements and collaborate with those leaders in developing innovations in methods for data structures, tracking and metrics, as well as analytics. Here's what you'lldo:Develop innovative and practical methods and models for advanced data analyticsProvide clear documentation and explanations of complex data needs and solutions to inform and influence, and provide evidencePerform advanced queries on operational databases using SQL and other query tools as needed.Create and maintain analytic tools for the automaticity of analysesEstablish data extraction methods across the organization in support of research and psychometric analyses.Provide support and collaborative contributions for research and psychometric activities using appropriate statistical analysis, and contributing to technical documentation by way of quality assurance and output.Manage timelines and data expectations for research studies and analyses, including coordination of data requests and extractions across internal stakeholders and schools/districts, and data agreements and exchange approaches that adhere to privacy standards and expectations of integrity.Here's what you'll need:Master’s or Ph.D in Computer Science, Statistics, Mathematics, Educational Research, or related field,At 10+ years of full time experience in the conducting increasingly advanced data analytics, data modeling, preferably in education, assessment, or similar field.Experience in innovative analytics, such as social network analyses, Cognitive Diagnostic Models, Bayes, simulations/model testing, and use of non-traditional data architecture, such as graphical databases.Work history showing a proven capacity for thought leadership in setting a data management agenda, executing it, and using the results to shape new and existing approaches in Data Science for educational challenges.Knowledge of psychometric methods and statistics, including adaptive, traditional, and innovations in psychometric modelingStrong project management skills with a proven ability to deliver products on time and on budget.Lifelong learnerStrong written communication skills.Experience using complex SQL queries.Experience using advanced statistical computing software.Familiarity with educational technology.Familiarity with current trends in education. Edmentum is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability status, protected veteran status, or any other characteristic protected by law."}