{"jobID": "2783586250", "jobLocation": "Chicago_IL", "jobTitle": "Research and Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.colum.edu", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 1928", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Under the general direction of the Director of Institutional Research and Reporting,  the Research and Data Analyst is responsible  for providing institutional and external reporting and data analysis that  supports the institutional strategic planning process, enrollment management,  and federal and state compliance as well as support accreditation. The Research and Data Analyst is responsible  for improving data quality and designing or presenting conclusions gained from  analyzing data using statistical tools and programs. This individual will also be  responsible establishing and maintaining archived data and conducting  background research from the public domain and other national research studies  such as compiling comparative information on other colleges and universities.  The job requires the ability to work independently, manage multiple tasks and  deadlines, demonstrate effective written and verbal communication, and find  creative solutions to problems in project design and implementation.Duties & ResponsibilitiesGather and analyze data from various databases and  sources utilizing standard statistical methodsImport, clean, transform, validate, or model data  to generate conclusions for decision making purposesPrepare tables and graphical representations of  statistical results for inclusion in reports and presentationsPresent data in charts, graphs, tables and designing,  connecting and developing relational databases for collecting dataAssist with the development of the data warehouse  and reportingExtract data efficiently and accurately from  college databases using business intelligence applications such as SQL Server,  Hyperion, or Crystal ReportsEffectively communicate research and data to a  broad audience across the institutionMaintain documentation related to projectsAssist in identifying information needs of the  College communityPrepare written reports of research results and  methodsDesign new research projects and information  products for the College communityPerform other related duties as assignedQualificationsBachelor’s degree required, Masters preferred, in  an applied research or related field1-3 years of experience performing statistical  analysis and creating statistical reports1-3 years of experience in business intelligence  data extraction and analysis is requiredDemonstrated ability to prepare statistical and  written reports for a non-technical audienceEstablished skills at data extraction and  manipulation using business intelligence applicationsProven skills in statistical analysis and  interpretationKnowledge and experience in Microsoft SQL Server,  Hyperion Interactive Reporting, Crystal Reporting, or other business  intelligence software highly preferredAbility to use a statistical software package, such  as SPSS, SAS, or RAbility to use spread sheet, word processing and  ERP systemsKnowledge of practices and processes of higher education  and/or institutional research a plus This job description is not designed to cover or contain a  comprehensive listing of activities, duties, or responsibilities required of  the employee and is subject to change based on the needs of the college (or  department).  At Columbia, we offer a rewarding  work environment for our faculty and staff. We take pride in offering  competitive benefits with affordable health, dental and vision coverage;  flexible spending accounts; commuter benefit program, life and accidental,  death & dismemberment coverage; paid and unpaid leave options; work/life  benefits; educational assistance programs; and retirement and financial  planning benefits.  We invite you to join our  talented faculty and staff and become part of our collective aspiration to  ensure Columbia prepares students for success in their creative fields through  innovation, engagement and real-world experiences.Additional InformationTo ensure consideration, please  include a cover letter, salary expectations, and three professional  references in your submission.  Position subject to a background  screening.  This is a union, non-exempt  position.  Qualified candidates of diverse backgrounds are encouraged to  apply. Columbia College Chicago is an equal opportunity employer and  complies with all local, state, and federal laws and regulations concerning  civil rights. The college does not discriminate on the basis of race, color,  religion, sex, sexual orientation, gender identity, national or ethnic origin,  age, disability, protected veteran status, genetic information, or other  protected classes under the law."}