{"jobID": "2747894437", "jobLocation": "Washington_DC", "jobTitle": "Workforce Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "54000", "jobDescription": "Job Description CACI is seeking a Workforce Data Analyst in support of CACI's Naval Sea Systems Command (NAVSEA's) Program. What Youll Get to Do:The analyst will be a member of the team that provides the client with an ongoing data analysis, modeling and forecasting support and briefings pertaining to the organization's workforce and the health of the organizationProvide analysis and understanding of workforce dataDevelop products by implementing the defined analytics and modeling methodologyCollect reporting requirementsConduct operations research studiesAggregate and synthesize data from authoritative systems into metrics and analyticsDesign models, tools for workforce planning and forecasts to facilitate recruitment, development and retention of workforce excellenceAnalyze NAVSEA workforce demographics, attrition trends, etc and develop sophisticated metricsOrganize and build suitable data modelsPrepare briefings for senior leadershipPerform extensive data validationYoull Bring These Qualifications:Extensive Excel skills including features within Excel such as: v-Lookup, h-Lookup, pivot tables, quick charting for presentationsStrong math (statistics) skills & excellent analytical aptitudeAbility to synthesize large amounts of data and identify key trendsAbility to present data in a logical, concise mannerExperienced applying statistical methodsKnowledge of database integrity and security standardsExceptional written and verbal communication skillsDirect client support experience in a fast-paced environmentEffective multi-tasking skillsThese Qualifications Would be Nice to Have:5-10 years of data analytics experienceBackground and knowledge of Federal HR policies, processes, and proceduresProficient in SQLStrong understanding of federal human resource databases and systemsExperience with Defense Civilian Personnel Data System (DCPDS) helpfulWhat We Can Offer You:Weve been named a Best Place to Work by the Washington Post.Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.We offer competitive benefits and learning and development opportunities.We are mission-oriented and ever vigilant in aligning our solutions with the nations highest priorities.For over 55 years, the principles of CACIs unique, character-based culture have been the driving force behind our success. . Job Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}