{"jobID": "2820422021", "jobLocation": "Washington_DC", "jobTitle": "Political Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.scripps.com", "Headquarters": "Cincinnati, OH", "Size": "1001 to 5000 employees", "Founded": " 1878", "Type": " Company - Public (SSP) ", "Industry": " Media", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " The E.W. Scripps Company, an enterprise media company, is seeking a Political Data Analyst. This position will be located in Washington, DC or Cincinnati, OH. Primary Purpose: The Political Data Analyst utilizes his or her skills to ask questions, turn data into knowledge, form conclusions, and make recommendations that enable Scripps to innovate, differentiate itself from competitors, work smarter, make better decisions, and enhance profitability. This individual will partner with the analytics and sales teams, analytics products and services director, business leaders and end users to be a change agent, identifying questions that are important to our business & clients, and using statistical analysis and data mining techniques to inform the answers, recommendations and next steps and communicate visually, orally, and in writing. Key Activities:Support advertising sales pitch with analysis and data driven collateral that is compelling to the clientGuide clients' decisions using historical results and future projections as a trusted advisor to business leaders and users, using data and analytics as a basis for better, more informed decision makingIdentify impactful choices for courses of action that drive value for the organization and clientsInfluence the direction of the business by effectively communicating conclusions to cross-functional groups and external clientsMine large amounts of data and perform data analysis to extract useful business insights for a wide range of topics including product development and performance, market dynamics, consumer and audience knowledge, internal operations, and external researchInitial study design, acquisition of data, prototyping and production roll outOngoing tracking, monitoring, and periodic follow-up studiesSupport the design and implement of reporting dashboards that track key business metrics and provide actionable insightsSecure final, accurate and validated data files from vendorsUse software and other tools to develop analyses that identify patterns, influences, correlations, relationships, predictive factors, and risk factors that provide better situational awarenessCreation of models, simulations, and optimization routinesDevelopment of data flows and acquisition strategies to facilitate the capture and sharing of data and analytics within the organizationSupport the development of analytics products and services by providing input into product roadmapsCreation of analytics and measurement roadmapsEducation & Experience/Certifications:Bachelor's degree in Business Analytics, Political Science, Market Research, Business, Advertising, Marketing, Statistics, or related field, or equivalent experience. Master's degree preferredMinimum of 3 years' experience in solving analytical problems using quantitative approaches (or equivalent)2+ years marketing analytics, political campaign experience, media sales support or advertising agency experience (strongly preferred)Experience (either through academic work/projects, internships, previous work experience) in quantitative and qualitative market research, political polling, consumer insights, brand management or other related workFamiliarity with media & political data and/or previous political campaign experience preferredExperience with political campaigns preferredTools/Methods:Data acquisition/ETL using MySQL, Python, RapidMiner and/or R from sources like Oracle, Twitter, Google, LinkedIn, Public Databases, Facebook, and/or APIsData visualization capability with tools like Excel and/or Tableau preferredApproximate travel is 10%About Scripps: The E.W. Scripps Company (NYSE: SSP) serves audiences and businesses through a growing portfolio of television, radio and digital media brands. Scripps is one of the nation's largest independent TV station owners, with 33 television stations in 24 markets and a reach of nearly one in five U.S. households. It also owns 34 radio stations in eight markets. Scripps also runs an expanding collection of local and national digital journalism and information businesses, including podcast industry leader Midroll Media and over-the-top video news service Newsy. Scripps also produces television shows including \"THE LIST\" and \"The Now,\" runs an award-winning investigative reporting newsroom in Washington, D.C., and serves as the long-time steward of the nation's largest, most successful and longest-running educational program, the Scripps National Spelling Bee. Founded in 1878, Scripps has held for decades to the motto, \"Give light and the people will find their own way.\" If you are interested in this position, please apply online at www.scripps.com for requisition #14551. #LI-CH1#GD-CH1"}