{"jobID": "2750072743", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Scientist - Operations Research", "companyRating": "3.8", "companyInfo": {"Website": "www.netflix.com", "Headquarters": "Los Gatos, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (NFLX) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "203000", "jobDescription": "Senior Data Scientist - Operations Research Los Angeles, CaliforniaScience and AnalyticsNetflix is seeking a versatile data scientist with a focus on Operations Research who is ready to tackle challenges in a refreshingly new problem space: Studio Production. Netflix has released over 600 Originals and plans to spend over $7B on content in 2018: each one of these productions is a complex operation that requires thoughtful resource assignment, scheduling, analysis and optimization. Our Studio Production Science and Analytics teams have an opportunity to organize, analyze and visualize this data at scale in ways never done before in the entertainment industry.  The Physical Production Science & Analytics team focuses on solutions that evolve and empower the production finance, physical production, and post production of our Original content. As an Operations Research-focused Data Scientist at Netflix, you’ll create tools to enable data-driven optimization throughout the production process. This is a small, expanding team with enormous opportunity for impact and ownership.  A thread of inquiry with data in this space could include -- What is an optimal schedule to shoot a TV show?How can we make such a schedule robust to unexpected delays?How can we relate such a schedule to the ultimate TV show quality? Learn more about Studio Production Science & Analytics in this blog post.As a Senior Data Scientist working in this space, you will… Partner with technical and creative stakeholders to identify opportunities for optimization and operational improvements in Studio ProductionLead the research and development of mathematical optimization models and techniques to optimize or sharpen decision-makingTranslate insight into actionable recommendations, working with designers and engineers to incrementally introduce your solutions to production teamsPresent your research and insights to all levels of the company, clearly and conciselyEmbody and steward the Netflix cultureYou have... PhD/MS degree in Operations Research, Computer Science, Statistics, Mathematics, or related quantitative fieldsA proven track record with 3+ years combining optimization techniques with human expertise to drive high-impact work in Operations ResearchExceptional interpersonal skills with the business acumen to own stakeholder relationships directly and develop solutions iterativelyEnthusiasm and expertise in communicating the logic and impact of your work to a broad range of technical and non-technical audiencesExperience using at least one common solver (e.g. Xpress, Gurobi, CPLEX) and a willingness to adopt new tools as neededComfort with ambiguity; an ability to thrive with minimal oversight and processExperience in applied machine learning/statistics a plus"}