{"jobID": "2793762972", "jobLocation": "Chicago_IL", "jobTitle": "Analytics Consultant, Full-time, Days", "companyRating": "3.8", "companyInfo": {"Website": "www.nmh.org", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1965", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Rush University Medical Center, Advocate Health Care, University of Chicago Hospital"}, "estimatedSalary": "72000", "jobDescription": " Defines, extracts, analyzes and presents data cogently to answer the question being asked. Synthesizes raw data into actionable information in the form of reports and presentations. Serves as a functional and content expert user of EDW, including but not limited to Epic Clarity data. Works with business users to define requirements, formulate queries, validate results, and generate reports using Microsoft SQL Server Reporting Services. Analyzes large datasets using descriptive and inferential statistics, evaluates data quality, and interprets results in a clear, concise manner. Seeks and summarizes relevant evidence and literature in relevant business area. Works collaboratively with and supports multi-departmental efforts and projects. Provides training and support throughout the organization for the use of analytics tools.  Directly supports multi-disciplinary groups participating in the Academy for Quality and Safety Improvement (AQSI). Assists groups in developing, refining and collecting data for their respective projects. Required:Bachelor's degree in relevant field.2+ years of experience in a role querying and/or analyzing data.Experience with a programming language.Experience using SQL for data extraction, manipulation, and reporting.Demonstrated competency with Microsoft Excel, PowerPoint, and/or Access.Effective problem solving and critical thinking skills.Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner.Effective problem solving and multi-tasking skills.Excellent verbal and written communication skills.Preferred:Experience using a software package (R, SAS, SPSS, Stata, etc.) for statistical analysis.Previous healthcare experience, ideally with a health system.SDL2017"}