{"jobID": "2738000430", "jobLocation": "San_Mateo_CA", "jobTitle": "Software Application Engineer - International", "companyRating": "4.6", "companyInfo": {"Website": "corp.roblox.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unity Technologies, Valve Corporation, Facebook"}, "estimatedSalary": "94000", "jobDescription": "Roblox, Software Application Engineer - International, San Mateo, CAWHY ROBLOX? Robloxs Imagination Platform is ushering in the next generation of entertainment, enabling kids of all ages to imagine, create, and play together in immersive 3D worlds. Powered by a global community of millions of developers and creators, Roblox allows anyone to build, publish, and monetize any experience imaginable.  comScore ranks Roblox as one of the top online entertainment platforms for audiences under the age of 18 based on average monthly visits and time spent. In addition, Roblox has been named one of Americas Fastest-Growing Private Companies on the Inc. 5000 for the past two consecutive years.  Work with the most passionate, team-oriented, visionary, crazy-smart people youll ever meet. The engineers at Roblox are working on the hardest problems in tech today -- distributed systems, real time communication, 3D co-experience, massive data processing, social networking, rendering, physics, and more. As a Roblox engineer, you will have real ownership and impact across one or more of these domains.  As a Software Application Engineer working on the International team, youll have a unique opportunity to bring the largest social platform for play to a global audience. Your mission will be to ensure that players can experience Roblox in the language of their choice, and that creators can easily create and tailor their content for players everywhere. If you are passionate about empowering creative people, youll be right at home on our growing International team. You Are:C++ expert: you are competent in C++ with 5+ years of professional experienceScripting pro: you know how to write scripts to orchestrate in-engine game code and create toolsMulti-platform: you jump with ease between Windows, OS X, Linux, Android, iOS, XboxUser-oriented: you care about the user experience, and are focused on delivering a product that caters to the needs of a global audienceTeam-player: you work well with other team members, and are able to take on responsibilities for the greater teamFocused: you write clear, readable, testable, and monitored code.You Will:Empower Roblox creators worldwide by internationalizing our game creation toolsFacilitate global creations by allowing games developers to easily support, tailor and test their creations for a range of languages and localesImprove the local experience for players across all Roblox platforms, ensuring a consistent, high quality experience in their chosen languageSelf-organize your work and take ownership of projects throughout their full life-cyclesYou'll Love:Excellent medical, dental, and vision coverageA rewarding 401k programFlexible vacation policyFree catered lunches five times a week and several fully stocked kitchens with unlimited snacksOnsite fitness center and fitness program creditAnnual CalTrain Go PassA super-cool Roblox Admin badge for your avatarRock star status with our communityRoblox Powering Imagination.[ID854]"}