{"jobID": "2745812207", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.oldsecond.com", "Headquarters": "Aurora, IL", "Size": "201 to 500 employees", "Founded": " 1981", "Type": " Company - Public (OSBC) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Drawing on our rich, 147-year history, Old Second understands opportunity and how to seize it. Whether the economic cycle is trending up or down, we have the experience, know-how and solutions to help our customers START BANKING. And if you’re interested in advancing your career, we look forward to speaking with you about opportunities at Old Second. Apply now and START BANKING!  The Data Integrity Analyst manages all processes associated with data extraction, modification, migration and verification of the Data Warehouse, Budgeting, Profitability and Asset/Liability Management functions (Target Systems). This is a newly created position in an exciting and growing area in which you will have the opportunity to collaborate and improve data & analytics across broad parts of the organization. Old Second is headquartered in Aurora, IL but this position could house out of a suitable Old Second location, including our Chicago (Loop) office.  Essential Job Functions Create and maintain methods of extraction of data from the Bank’s various data sources for use within the Enterprise Wide Data Warehouse Systems.Develop reporting dashboards for senior leadership and departmental use across the Bank, and assist in dashboard maintenance as needed.Perform periodic validation exercises; ensuring accuracy and integrity is maintained within source databases.Monitor data transfer operations, verifying accuracy and trouble-shoot system generated errors.Develop and/or modify processes to accomplish above functions as data sources are added or modified.Implement Data Governance strategy, polices and standards across a given area: engage key resources, drive data principles, establish data ownership and improve data issue management processes.Play a leadership role in key business initiatives on data strategy, data quality, business, and technical issuesServe as a liaison between Business and Functional areas and technology to ensure that data related business requirements are communicated and well understood and considered as part of operational prioritization and planning.Ensure strict confidentiality is maintained for both customer and Bank information to protect the customer and the Bank and to ensure compliance with Bank Policies & Procedures.Act as resource for users wishing to extract data or create reports, providing direction and assistance as time permits.Perform ad hoc projects as assigned, including implementations of financial software systems. Requirements (experience, education, competencies) Knowledge of data architecture, master data management, business intelligence or experience in similar projects; Understanding of data concepts, tools, and SQLSound business and technical acumen, with proven agility in learning and ability to quickly become comfortable with businesses, functions or technologies and apply to business problems.Strong relationship management, presentation, written and verbal skills which bring visibility and precision at all levels within the organizationExcellent problem-solving and critical-thinking skills to recognize and comprehend complex issues, policies, regulatory requirements and industry information affecting the business environmentExperience with data extraction and manipulation techniques.Ability to function independently and provide self-direction toward assigned goals.University degree in Business, Finance, Engineering or Information Systems, or an equivalent combination of education and experience.Experience in US Banking or Financial Services industry preferred: Specific knowledge/expertise for a given business area: ALM, Deposits, Loans and Customer Data."}