{"jobID": "2614544999", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist|Chicago, IL|$110", "companyRating": null, "companyInfo": {"Website": "www.interquestgroup.com", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Harvey Nash Group, Randstad, Adecco"}, "estimatedSalary": null, "jobDescription": " Data Scientist \u0096 Chicago \u0096 R, Python, SAS, Machine Learning  Key Skills: R, Python, SAS, Machine Learning, Regression Models, Decision Trees, Random Forests, Neural Networks  Salary: up to $110,000 great benefits  A leading marketing consultancy based in Chicago, IL is searching for a Data Scientist that has a passion for solving analytical problems and using data as the primary resource in doing so. As Data Scientist, you will be:helping identify new opportunities within the data science space for future solutionssupporting in the delivery of projects on time and to a high standard for data science work plans whilst supporting the market needssupporting the roll-out of new data science methods, technologies and thinking to the market, enabling the business to better understand the data science tools and processesassisting in any QA processes on projects, rectifying issues where possible and escalating any issuesEssential Skills:Fluency in SAS, SQL, R, and/or PythonExcellent communication skillsMachine Learning experience (Decision Trees, Random Forests, Regression Models, etc.)Why should I apply:An amazing opportunity to join a worldwide, leading consultancy who has a great reputation both externally and internallyThe chance to work with cutting edge technologies and projects in the data science space PLEASE NOTE \u0096 You must have a valid Green Card or U.S. citizenship to be considered for this position. No third parties. Please submit your resume at the earliest should you wish to be considered for this role.  Please contact Carson McCusker of InterQuest at 646-809-4192 or carson.mccusker@itqanalytics.com."}