{"jobID": "2822128812", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Data Scientist I (Consumer Bank Perform Integrity)", "companyRating": "3.6", "companyInfo": {"Website": "www.td.com", "Headquarters": "Toronto, Canada", "Size": "10000+ employees", "Founded": " 1855", "Type": " Company - Public (TD) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Chase, BB&T, SunTrust"}, "estimatedSalary": "83000", "jobDescription": " Company Overview About TD Bank, America’s Most Convenient Bank®TD Bank, America’s Most Convenient Bank, is one of the 10 largest banks in the U.S., providing more than 8 million customers with a full range of retail, small business and commercial banking products and services at approximately 1,300 convenient locations throughout the Northeast, Mid-Atlantic, Metro D.C., the Carolinas and Florida. In addition, TD Bank and its subsidiaries offer customized private banking and wealth management services through TD Wealth®, and vehicle financing and dealer commercial services through TD Auto Finance. TD Bank is headquartered in Cherry Hill, N.J. To learn more, visit www.tdbank.com. Find TD Bank on Facebook at www.facebook.com/TDBank and on Twitter at www.twitter.com/TDBank_US.  TD Bank, America’s Most Convenient Bank, is a member of TD Bank Group and a subsidiary of The Toronto-Dominion Bank of Toronto, Canada, a top 10 financial services company in North America. The Toronto-Dominion Bank trades on the New York and Toronto stock exchanges under the ticker symbol “TD”. To learn more, visit www.td.com.Job DescriptionProvide technical expertise across a broad range of data analysis functions including data modeling, visualization, data profiling, data origin and lineage, report design, and other specialized data management functions.RequirementsMust be eligible for employment under regulatory standards applicable to the position. • Work autonomously and accountable for acting as a lead within a specialized business management function and may provide work direction to others Provide seasoned specialized knowledge, advice and/or guidance to various stakeholders and team membersScope of role may have enterprise impactFocus on short to medium – term issues (e.g. 6-12 months)Undertake and complete a variety of complex projects and initiatives requiring specialist knowledge and/or the integration of cross functional processes within own area of expertiseOversee and/or independently perform tasks from end to end"}