{"jobID": "2817653156", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Distinguished Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "130000", "jobDescription": "Job Description What you'll be doing...  The Network Business Analytics team is hiring a strategic thinker to join a high profile, high visibility team that powers Network analytics and strategy for Verizon. You will be part of a team that drives business decisions and optimized capital investment for the Verizon Wireless and Wireline Networks. That includes building tools, creating analyses, and discovering insights into our Networks that can be used to optimize our capital plan.  We create actionable operational and strategic insights as well as visualizations for senior leaders in the company across multiple organizations. You will be part of the team that shapes multi-billion dollar investments for the nation's largest and fastest 4G LTE Network, and next-generation investments into 5G. This is a job for a decisive, quick, forward-thinking, strategic, and tactical thought leader. You should have exceptional influencing skills and preferred experience working across areas and levels of an organization. Data Science:Architect and design solutions to complex predictive & prescriptive modeling challenges including capital optimization across our Networks.Research and develop analyses, forecasting, and optimization methods to improve Network quality of service; example application areas include throughput optimization & end-user behavioral modeling.Develop and implement machine learning and optimization algorithms across multiple platforms to create scalable solutions with actionable insights from complex data sets.Lead strategic efforts across the Network organization, leveraging advanced analytics to optimize processes and procedures that lead to improved Network KPIs, capital optimization and cost reduction.Perform time-series analyses, hypothesis testing, and causal analyses to statistically assess relative impact and extract trends.Design and implement data architecture, analytics environments, and methodologies for analyzing and storing large sets of structured and unstructured data.Business Intelligence:Make business recommendations (e.g. cost-benefit, forecasting, exploratory analysis) with effective presentations of findings to multiple levels of stakeholders through visual displays of quantitative information.Define key success metrics and create dashboards / reports to communicate results and monitor KPIs.Lead the creation of new data processes as identified through industry benchmarking and collaboration with Verizon's data scientist community.Cross Functional Collaboration:Manage multiple projects simultaneously, adapt to changing priorities and meet aggressive deadlines.Be the go-to-person for network & technical modeling questions, including familiarity with next-gen network architecture and applications.Collaborate with IT and business stakeholders to ensure data governance audit standards.Participate in cross-functional project teams as a predictive and prescriptive modeling subject matter expert.Executive Presentations:Analyze complex data sets, draw conclusions and relationships and develop actionable recommendations.Effectively communicate actionable insights to category leads supporting their goals and objectives.Prepare executive level presentations to clearly articulate results of complex mathematical analyses. What we're looking for... You'll need to have:Bachelor's degree or four or more years of work experience.Six or more years of relevant work experience.Experience programming/scripting/coding (SQL, Python, R) and knowledge of relational databases.Experience with business intelligence and visualization tools (e.g., Tableau, D3.js, matplotlib).Even better if you have:Master's degree in computer science, computer engineering, statistics, operations research, industrial engineering, economics, mathematics, physics, electrical engineering, industrial engineering or related discipline.Ph.D. in computer science, computer engineering, statistics, operations research, industrial engineering, economics, mathematics, physics, electrical engineering, industrial engineering or related discipline.5+ years of experience programming/scripting/coding (SQL, Python, R) and knowledge of relational databases.5+ years of experience with business intelligence and visualization tools (e.g., Tableau, D3.js, matplotlib).High level of curiosity and investigative mind-set with an attention to detail.Flexibility to adapt to new challenges to overcome short-term hurdles by staying focused on the team's deliverables.Capacity for quickly learning and using widely available tools and methodologies.5+ years of experience in data modeling, programming, data mining, large scale data acquisition, transformation and cleaning of structured and unsecured data.Working knowledge of predictive modeling tools, machine learning tools (scikit-learn, PyTorch, Spark, TensorFlow, Keras, Theano), and statistical data analysis such as linear models, multivariate analysis, stochastic models, sampling methods.Optimization modeling (CPLEX, gurobi).3+ years' experience with data warehousing technologies (e.g. Oracle, SAP, Teradata, MS SQL) is a plus. Familiarity with Hadoop ecosystem and NoSQL database technologies (MongoDB, Cassandra). When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}