{"jobID": "2827460016", "jobLocation": "N_o_n_e", "jobTitle": "Business Development Consultant", "companyRating": null, "companyInfo": {"Website": "www.thebluebook.com", "Headquarters": "Jefferson Valley, NY", "Size": "501 to 1000 employees", "Founded": " 1913", "Type": " Other Organization", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Attention RAINMAKERS!Are you a proven, hungry sales entrepreneur, expert negotiator and positive dealmaker consistently exceeding your targets but finding yourself looking for something more? Are you interested in “franchise” business ownership but not interested in any of those up-front fees?Then you have found it in The Blue Book Network, a 100+ year old employee-owned, and performance driven, enterprise committed to excellence! We are looking for an experienced sales entrepreneur to take ownership of our Michigan (Counties to include: Allegan, Ionia, Kalamazoo, Kent, Montcalm, Ottawa) territory as a Business Development Consultant. You will think like a franchise owner driving the success of your protected territory, while being part of a nationwide sales team, training and working alongside seasoned industry leaders. In this role, you will partner with the customer to become an extension of their business with the goal of connecting them to the relationships in the commercial construction industry that will sustain and enhance their brand.How can you succeed? By demonstrating you have the business acumen to help your customers develop relationships and grow their business. If you can grow your territory and continue to build upon relationships within an established book of business and reoccurring revenue, then you can succeed!How can you make money? It’s simple math, really. Own it, exceed goals and be rewarded! Or if you prefer an equation: Base + Commissions + Bonuses = Uncapped Earnings Potential!How We (and You!) Define Success:You take action and see yourself as innovative; fulfilling needs and inventing as you goResourceful; you work with what you have available and know where to go when you need somethingFocused: you’re keeping your eyes on the prize of profitabilityYou like to disrupt the status quo – always looking for opportunities to improveYou’re fearless with potential and the opportunity for growthOpen to change – you consistently evolve to market feedbackCoachable - you look for feedback from your manager, peers, customers, etc. when trying to identify areas for improvementYou’re motivated by challenge and rise to the occasionYou surround yourself with innovators and make informed decisions on research conducted.Required Qualifications:Intense passion to sellGoal setting, time-management and strategic planning for goal achievementSelf-motivated, coachable, adaptable, and organizedHigh School Diploma or equivalentProven successful track record and experience within a B2B sales and marketing verticalStrong sales skills including prospecting & closingAbility to build and maintain relationshipsKnowledge of Windows-based software and Microsoft applicationsExcellent verbal and written communication skillsAbility to work independently and as part of a teamStrong analytical skillsAbility to travel daily within assigned territory as well as 10% travel outside of territory (within the U.S.)Valid Driver’s LicensePreferred Qualifications:Bachelor’s Degree and/or equivalent industry experience2+ years of successful outside sales experienceExperience in digital advertising salesExperience with CRM softwareBenefits:Ownership! (With NO Franchise or start up fees)Paid expenses (mileage reimbursement and monthly phone allowance)Competitive benefits package that includes: Medical, Dental, Vision and Life, to name a few)401(k) w/employer match + ESOP benefitsGenerous Paid Time Off policyPaid company holidaysPresident’s Club - Achieve and you shall receive!So many more!Ready? Set……. Grow with us!"}