{"jobID": "2802544642", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.virgilsbbq.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Virgil is seeking a Data Engineer to architect, design, implement, enhance and maintain highly scalable, available, secure and elastic cloud ready data solutions based on industry best practices by using cutting edge technologies. About Virgil Virgil is a Chicago-based startup that has developed a revolutionary recruiting and career navigation platform. Virgil enables job seekers to assess their competitiveness for any career in About the Role The Data Engineer will be responsible for designing, creating, deploying, enhancing, maintaining and managing the organization's data architecture and data stores.  The Data Engineer must have hands-on experience with frameworks, tools and data modelling and design techniques.  The Data Engineer will develop detailed designs and become an expert of the underlying data as well as business events within the enterprise. He will be the subject matter expert (SME) on content, current and potential future uses of data, and the quality and relationships between core elements of the data stores and data products.  The Data Engineer will be also hands on monitoring, optimizing and troubleshooting current data stores to guarantee optimal performance and scalability.  The Data Engineer will be actively working to understand how the information will be captured, retained and exploited RequirementsBasic Qualifications: Degree in computer science, computer engineering or equivalent8+ years of experience in requirements analysis, data architecture, integrated database design, data security, performance tuning, back-up and recovery specificationsAdditional Qualifications:Expert knowledge of relational databases (Postgres, MySQL, SQL Server)Experience with scalable cloud storage solutionsExperience in handling large data volumes, deep understanding of data marts, data warehouse architecture, multidimensional databases, data lakes, and data migrationExperience with cloud infrastructure and data analytics offerings including Apache Spark, Compose, Elastic Search, MongoDB, and/or RedisExperience working with agile teamsExperience writing complex SQL scripts with optimal performanceExperience in developing web services technologies (SOAP and RESTful)Experience working with data models using Erwin or equivalentKnowledge of various data structures such as Relational, XML, JSON, NOSQL, Tuple Store, Columnar, in-memory and Graph DBKnowledge of Big Data technologies (e.g. Hadoop, Spark, Pig, Hive)Experience with log monitoring systems (e.g. Splunk, ELK)Experience troubleshooting design and performance issues with online transactional processing databases Preferred Skills Hands of scripting experience in Python.Experience with Enterprise Data Warehouses and migrating data from relational databases to cloud enabled databasesExperience in building data pipelines and ETL jobs using tools such as Infosphere Information Server (DataStage)Hands-on experience with migration of on-prem data to AWSExperience with streaming analytics Kafka, Differentiating Skills PhD or Masters in Computer ScienceExperience developing dashboards and data platforms for complex event processing and analytics components in a big data environmentBenefits Compensation is competitive based on experience with equity participation  Benefits include: medical, dental, vision, 401k VIRGIL INC IS AN EQUAL OPPORTUNITY EMPLOYER – EOE"}