{"jobID": "2828212660", "jobLocation": "Plano_TX", "jobTitle": "Senior Associate, Data Science", "companyRating": null, "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": null, "jobDescription": " Plano 6 (31066), United States of America, Plano, Texas  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Senior Associate, Data Science  Senior Associate, Data Science position with Capital One, National Association in Plano, TX; Multiple positions available:  -Lead the application and validation of statistical and other mathematical methods to collect, organize, interpret, and summarize economic data in order to assist in decision- making and support the development of business strategy.  -Employ specialized statistical analysis software and advanced mathematical and statistical methods to design, analyze, build, validate, and help implement quantitative predictive models in order to solve business-level problems utilizing qualitative and quantitative data analysis and reporting, statistical modeling, multivariate linear and logistic regression, and experimental design.  -Work in an interdisciplinary team to design, develop, and optimize customer-impacting products and experiences.  -Own statistical data modeling and related analytical projects throughout the lifecycle.  -Assess data quality, prepare data for processing, build, monitor, or validate statistical models, identify relationships and trends in econometric data, and analyze and interpret statistical data to support business decisions.  -Identify opportunities to apply statistics to improve business performance.  -Internalize business problems, translate them into actionable analyses or solutions, and prepare presentations of complex statistical concepts and research results to non-statistical audience.  The position requires a Masters degree or foreign equivalent in Statistics, Mathematics, Economics, Finance, Engineering, Science, or a related quantitative analytical field and the following skill set through education or experience: qualitative and quantitative data analysis; developing reports; data modeling; Unix programming; SAS; SQL; Teradata or similar relational database tool. Must pass companys assessment.  #LI-DNI"}