{"jobID": "2831757448", "jobLocation": "San_Francisco_CA", "jobTitle": "Regional Corporate Childcare Director for Northern California", "companyRating": null, "companyInfo": {"Website": "www.bayclubs.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The Bay Club Company Founded in 1977, The Bay Club Company (TBCC) is a lifestyle company that owns and operates a growing collection of resort-inspired properties across eight California campuses located within the San Francisco, San Jose, Los Angeles, and San Diego markets. Bay Club's comprehensive approach to lifestyle is founded on four points of focus: Fitness, sports, family, and hospitality.  With a vibrant community of more than 90,000 members and a professional team of over 4,000 associates, Bay Club is a one-of-a-kind model with innovative and exciting fitness programs, year-round options for tennis, swimming, squash, and golf, enriching family programs and Kids Camp, and gathering spaces with classic hospitality amenities, including dining options, workplace suites, and Sanctuary Spas.  For over 40 years, Bay Club has maintained the highest standards of professional service, earning a reputation as one of the leading private club companies in the United States. Headquartered in San Francisco, the Companys Four Quadrant Playbook has helped solidify its position in the active lifestyle space, and now points toward extensive growth over the next five years. For more information on Bay Club, visit www.bayclubs.com. About the Position: Under the direction of the Corporate Childcare Director, the Regional Childcare Director is responsible for oversight of the Childcare/Kids Program for the Bay Club Company, specifically in Northern CA (from Marin to Los Gatos). The Regional Childcare Director will also collaborate with members of the TBCC Management Team on strategies and tactics for growing the Family Membership. This person is responsible for overseeing Childcare Directors in their respective region, covering any open Childcare Director positions until they are filled, and identifying and providing necessary training to improve operational skills, standard business practices, safety protocols, client service and client retention. Nothing in this job description restricts managements right to assign or reassign duties and responsibilities to this job at any time.PRIMARY JOB FUNCTIONS:Leadership and Management - Operations Ensure standard operating procedures are consistent at each property related to safety, staffing levels, and business initiatives.  Achieve optimal staffing levels for clubs in the Bay Clubs by creating and executing a staffing strategy in partnership with third party resources as well as internal/external recruiting.  Deploy recruiting initiatives for the clubs.  Educate and model the technical skills and competencies for existing and new Childcare Directors as to develop staff and/or provide initial training for new staff.  Review forecasting sheets to track previous day sales and production  Educate on and model the administrative skills as necessary to the Childcare Directors.  Create and execute club-specific growth strategies to increase the revenue production.  Provide regular follow up and training on Payroll process and labor expenses.  Ensure Childcare Directors execute monthly accruals, monthly forecast sheets, monthly business plans and up line reporting.  Serve as a subject matter expert on field Childcare operations and provide input to the TBCC Management Team  Develop and Support New Childcare/Kids/Tweens/Teens programming for the Bay Club Financial Accountability Prepares monthly and annual operating and capital budgets  Reviews financial statements and reports  Supervises the payment of vendor accounts  Assists in the development, implementation and maintenance of internal controls and procedures that provide operation and fiscal control, cost savings, projections, planning, forecasting and effective utilization of assets and properties Operations Marketing Partner with the Marketing team to deliver quarterly marketing and promotions.  Collaborate with the Corporate Childcare Director on promotional pricing for the month/quarter basis.  Establish and build relationships with the club teams to coordinate club specific marketing tools when necessary.  Partner with field leadership to ensure execution of Bay Club event initiatives and programs.  Works with the Corporate Childcare Director, Childcare Directors and General Managers to ensure that all in-club programming is standard to the Bay Club. Administration Attends and contributes to all required Regional meetings and other meetings as necessary.  Perform miscellaneous administrative duties, as necessary. Corporate Goals & Objectives  Promote the companys safety goals and actively work towards ensuring a safe working environment.  Interpret and ensure compliance with company policies and procedures.  Actively further corporate objectives and continuously support improvement and positive change, which includes participating on corporate designated committees to improve the company and business operations. Hours: Will vary, must be able to work evenings and weekends Required Qualifications Strong verbal and written communication skills  Strong public speaking and presentation skills  Experience with Project Management  Ability to organize and lead a team  Working knowledge of Word, Power Point, and Excel Minimum certifications/educational level Bachelor degree in Business, Child Development or related field preferred  AED/CPR certification required.  Minimum experience  3-5 years experience in management and business  Minimum 1 year in-club manager or multi-unit experience preferred.  Physical Requirements:  Must be able to sit, stand and walk for up to 8 hours a day. An Equal Opportunity Employer The Bay Club Company (TBCC) provides equal employment opportunities without regard to age, ancestry, color, creed, mental or physical disability, marital status, medical condition, national origin, race, religion, sex, sexual orientation, veteran status, or any other consideration made unlawful by federal, state, or local laws."}