{"jobID": "2802867150", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.cdicorp.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1950", "Type": " Company - Public (CDI) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist Washington, District Of Columbia, United States COMPANY PROFILE: Join a team with EXCELLENCE, LOYALTY and INTEGRITY! CDI Corporation consistently appears on ENR's annual \"Top 500 Design Firms\" list, ranking the largest engineering, architectural and environmental design firms by revenue. Ranked #28 in Top 500 Design Firms in 2012! Forbes.com named CDI as one of the Most Trustworthy Companies in the United States. (2008) CDI Marine Company is a division of CDI Government Services and a leader in providing our clients with high quality, cost effective engineering, design and logistics services in the marine industry.CDI Corporation is an EEO/An Affirmative Action M/F/D/V EmployerGENERAL DESCRIPTION: CDI is seeking Sr Data Scientist. This is a Full Time position in the Washington, DC area. This position is contingent upon contract award.GENERAL DUTIES: Scrum Team Lead Lead a team of modeling specialist that will build predictive models Team will be platform builders who create data platforms, balancing both engineering and data analysis concerns (current client data platform is Amazon Web Services (AWS)); Team will be polymaths who do all data science activities; Team will be User Interface designers to produce government approved analytics dashboards from the results of Task 2.0 and as reflected in the Final Report (see Task 2.0 below); Technical Team Leader who leads the team of data scientists and promotes best practices. Performing analysis, design, and development. Create and maintain Standard Operating Procedures and other similar documentation. Provides expertise in systems and affordability/failure analysis, experimental testing, training, technical assurance oversight and evaluation of OCO capabilities, hardware design and development, and software development. Responsible for requirements gathering and documentation, software development, test plan development and implementation, and eventual rollout and user training for multiple applications Leverages advanced analytics experience and knowledge of computing technologies, computer science, statistics, mathematics, and other cutting edge technologies. Addresses scientific, engineering or business objectives by writing, modifying or adapting computer programs in machine level, assembly and third or fourth generation programming languages. Formulates architectural design, functional specifications, interfaces and documentation of hardware or software systems considering system interrelationships, operating modes and software or equipment configurations. Researches unconventional applications of software and operating systems in designing and developing new methodologies, significant modifications or adaptations of standardized techniques. Responsible for developing project plans, guidelines, and controls.MINIMUM SKILL REQUIREMENTS :  BS degree in computer science or other technical field and degree of applicability Five (5) years of demonstrated experience in data analysis, testing, and fielding implementation for large audiencesMust have the ScrumMaster Certification Must have experience managing user experience teams Must possess an outstanding knowledge of standard written English grammar, spelling, punctuation Strong communication and interpersonal skills required to interface with clients, employees, and management; Must have enthusiasm and a positive, team-oriented attitude Ability to organize and multi task is a must Proficiency in Microsoft Excel, Word, and PowerPoint and other MS products Excellent and effective written & verbal communication skills.SECURITY REQUIREMENTS: Applicant may be subject to a security investigation and then meet the eligibility requirements to obtain and maintain a Secret security clearance issued by the US Government. In addition to the security clearance, this position may require an additional background screening for base access.PHYSICAL REQUIREMENTS/PHYSICAL DEMANDS: CARRYING and LIFTING. Ability to transport and lift up to 30 lbs. Employee is required to access remote areas of multi-level vessels Must comply with Company's Driver Safety Policy if assigned to operate company and/or rental vehicles Type: Contract  Reference ID: 368996"}