{"jobID": "2828392459", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.futurefinance.com", "Headquarters": "Dublin, Ireland", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data ScientistThe Role Future Finance is looking for an experienced data scientist to join our growing teamm in Chicago. As a key contributor in our data-driven lending business, you will be responsible for supporting our risk management, operations, capital markets, and marketing functions with insights gained from data-mining internal and external data. The ideal candidate is adept at using large data sets to find opportunities for risk management and process optimization, and at using models to test the effectiveness of different consumer lending strategies. Candidates must have strong experience using a variety of data mining and data analysis methods; using a variety of data tools; building and implementing models;using and creating algorithms; and creating and running simulations. ResponsibilitiesMine and analyze data from internal and external sources to drive optimization and improvement of lending strategiesAssess the effectiveness and accuracy of new data sources and data gathering techniquesDevelop customized models and algorithms to apply to the company’s underwriting, fraud detection, operations, and marketing functionsUse predictive modeling to increase and optimize acquisition, underwriting, customer experience, revenue generation, ad targeting and other business outcomesDevelop company A/B testing framework and test model qualityCoordinate with different functional teams to implement models and monitor outcomesDevelop processes and tools to monitor and analyze model performance and data accuracyMust Have SkillsInnate curiosity combined with strong learning capabilityProblem solving skills with an emphasis on product developmentKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages and drawbacksExpertise in advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and applicationsExperience using statistical computer languages (SAS or R, Python, SQL, etc.) to manipulate data and draw insights from large data setsAbility to liaise cross functionally with excellent written and verbal communication skillsNice to Have SkillsExperience in consumer lending, fraud analytics, or database marketingExperience with distributed data/computing tools eg Map/Reduce, Hadoop, Hive, and SparkQualificationsMasters or PhD degree in Statistics, Computer Science, Mathematics, Social Science, Engineering, or other related Quantitative disciplineLocation Chicago, IL About Us Education can be expensive. Many aspiring students are not reaching their potential because they can't afford it. Our mission is to change all that. We believe everyone has the ability to have a positive impact on society. And money shouldn't prevent you from being the best you can be. That's why we exist.  Future Finance, Inc. is one of the fastest growing Fintech companies in Europe. Founded in 2014, Future Finance is backed by elite institutions such as S-Cubed, QED, KCK and Blackstone, and has been appointed by the EU agency European Investment Fund as an intermediary to provide financing solutions for those in pursuit of higher education. Headquartered in Dublin, we have offices in Chicago and London.  We are a team of pioneering entrepreneurs with a passion for fintech. Future Finance thrives on collaboration and exchange of ideas. We operate a philosophy of Best Idea Wins and No Ego. This is a fantastic opportunity for a talented individual to grow with a dynamic team of smart, self motivated individuals who are working towards a common goal."}