{"jobID": "2738543123", "jobLocation": "N_o_n_e", "jobTitle": "Senior Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.maximus.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MMS) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "*This is a remote position that requires working from a home office; candidates may be located anywhere in the US. Develop and lead efforts in operationalizing data science in support of government service operations and create data-driven products that help our customers improve their program performance and have measurable impacts on the livesof the beneficiaries we service. This role wil provide insight into leading analytic practices, design and lead iterative development cycles, and produce new and creative analytic solutions that will become part of our core product capabilities. Select features, building and optimizing classifiers using machine learning techniques.Conduct data mining processes through examining large data sets/databases, in order to generate new information.Identify appropriate decision technology techniques to apply relevant analytic frameworksCreate automated anomaly detection systems and tracking model performanceApply appropriate statistical analysis and quantitative methods to analyze data and predict future trendsExtend company's data with third party sources of information.Enhance data collection procedures.Process, cleanse, and verify the integrity of data used for analysis.Conduct ad-hoc analysisMaster's degree from an accredited college or university5+ years of experience in data analysis with heavy emphasis on data-driven decision making.Excellent understanding of machine learning techniques and algorithms.Experience with common data science toolkits and data visualization tools.Applied statistics skills. Active military service members, their spouses, and veteran candidates often embody the core competencies MAXIMUS deems essential, and bring a resiliency and dependability that greatly enhances our workforce. We recognize your unique skills and experiences, and want to provide you with a career path that allows you to continue making a difference for our country. Were proud of our connections to organizations dedicated to serving veterans and their families. If you are transitioning from military to civilian life, have prior service, are a retired veteran or a member of the National Guard or Reserves, or a spouse of an active military service member, we have challenging and rewarding career opportunities available for you.  A committed and diverse workforce is our most important resource.  MAXIMUS is an Affirmative Action/Equal Opportunity Employer.  MAXIMUS provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disabled status. "}