{"jobID": "2825886512", "jobLocation": "Suitland_MD", "jobTitle": "Sr. Data Programmer/analyst (SAS)", "companyRating": "4.5", "companyInfo": {"Website": "www.gunnisonconsulting.com", "Headquarters": "Alexandria, VA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Sr. SAS PROGRAMMER/ANALYST  Gunnison is growing! Join our team!  Gunnison is seeking SAS programmers interested in working on challenging and rewarding assignments supporting our largest client. These positions offer the flexibility to find your own career path within the Gunnison organizational structure and become an integral part of a team supporting a massive data collection and analytics effort.  Location: Suitland, MD - Easily Accessible by car or Metro, free parking. Potential Teleworking Opportunities.  Sr. SAS PROGRAMMER/ANALYST JOB DUTIES AND RESPONSIBILITIES:The positions include writing and modifying SAS code to produce complicated combinations of detailed dataWork on cross functional teamCollaborate with client teamClear communication and problem-solving abilityProduct development in an agile style environmentTECHNOLOGIES: SAS, UNIX/LINUX, Shell scripting, SFTP REQUIREMENTS:Bachelor's Degree in CS, Statistics, or applied math5-10+ years of experienceKnowledge of Unix/Linux operating systemAt least one scripting language to run in Unix/Linux environmentExperience with Unix operating system.Experience with shell scriptingSAS programming experience with macros, proc sql, sas data steps.Ability to pass a US Government Background investigation (national agency check, Secret or TS not required).OTHER:SAS Certification, Korn shell scripting, Perl script, PythonHands on experience with Agile projectWriting technical requirementsExcellent communication skillsAbility to work in a team environment Sr. SAS PROGRAMMER/ANALYST  Why Join Gunnison? Gunnison takes on ambitious projects. We target fun, challenging work that requires creative thinking and innovation. Quality is our top priority.Gunnison's employee benefits meet or exceed what other companies in the Washington, D.C. metropolitan area offer.Gunnison is a family-oriented business. As a small firm, there is a great sense of camaraderie and employees are treated like family. This is an atmosphere we fully intend to maintain, even as we continue to grow.Gunnison's revenues have grown steadily since the firm's founding in 1994. Our growth rate over the past decade is 19% per year.Our employee resources, financial resources, and client base are all expanding. Just as important, we have solid partnerships with several other firms, providing specialized niche expertise to fulfill unique customer needs. The vast majority of our work is from repeat customers. Employee Benefits  Gunnison's employee benefits meet or beat other companies in the Washington, D.C. metropolitan area. We invite comparison.  Click here for details  Equal Opportunity/Affirmative Action Employer  Must be eligible for employment in the United States  We are unable to sponsor candidates at this timeSDL2017"}