{"jobID": "2733040868", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Environmental Permitting and Compliance Engineer or Scientist - Entry Level", "companyRating": "3.7", "companyInfo": {"Website": "www.barr.com", "Headquarters": "Minneapolis, MN", "Size": "501 to 1000 employees", "Founded": " 1966", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " Summary  The person selected for this position will work on a variety of environmental consulting projects to support an industrial fast paced client base. The position requires strong problem-solving ability and communication skills to develop solutions to meet client objectives for air and water program regulatory requirements. Projects may include compliance assistance, on-site staff assistance, site evaluations and investigations, regulatory and technical analysis, solution development, report writing, and regulatory negotiations. In fulfilling these duties, the position will interface with internal project teams, industry representatives, and regulatory staff. Key job activities may include: mass balance calculations; emission inventories; evaluation and troubleshooting of new or existing systems; providing regulatory assistance including preparing draft NPDES permit applications, air quality permit applications, and related documents; development of compliance monitoring plans; development of waste management, spill prevention and risk management plans; and technical and economic feasibility studies for pollution control equipment and processes. The work may require out-of-town assignments in the field, client facility or in another Barr office.  NOTE: Applicants must be able to work in locations that feature rough terrain typical of construction sites and to enter and work within facilities that include limited accessibility, moving machinery, high temperature and pressure process equipment, and other conditions typical of large industrial facilities. Job assignments may involve work on waste disposal sites and sites requiring cleanup of hazardous materials. An OSHA-mandated physical exam may be required; safety training will be provided.  Minimum Qualifications Bachelor's degree in environmental engineering, chemical engineering, mechanical engineering, chemistry, or a related scientific degreeStrong interpersonal, verbal, and written communication skills with the ability to communicate effectively with project team members and clientsStrong technical and problem solving skills including attention to detail, accuracy, and completenessStrong computer skills, including MS Excel, Word, and OutlookEffectiveness in building working relationships and working in multi-disciplined project teams. including the ability to influence outcomesA flexible working style and willingness to occasionally modify personal schedules as required to meet project deadlines and/or client needsSelf-initiative and motivation with an emphasis on client service and growing a career in environmental consultingWillingness to travel for field work or work at client sites 20-30% of the time or more depending on client needsAcceptable driving recordLegal authorization to work in the United States without the need for sponsorship Preferred Qualifications One or more internships in heavy industries or consultingPost-college professional experienceHigh level of proficiency working in Excel spreadsheets and data systems, Plant Information (Pi), ASPENExperience working with regulations and environmental permittingProject or task management skillsStrong leadership skills and experienceAptitude for developing client relationships and businessFE certification and interest in pursuing a PEBarr Engineering Co. reserves the right to consider other legitimate, non-discriminatory factors that are not specifically listed.  We require proof of eligibility to work in the United States.Barr strives to make www.barr.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance with completing the application process, please call 952-832-2600, or toll free at 800-632-2277.Barr is proud to be an affirmative action/equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, race, color, religion, gender identity, sexual orientation, age, national origin, disability, protected veteran status, or any other lawfully protected status."}