{"jobID": "2827622980", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Research Investigator/Scientist-Analytical Development", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": " Research Investigator - Analytical Development Description: This Analytical Development role will be responsible for developing effective collaborations within CSD project teams consisting of organic chemists, chemical engineers, and analytical scientists to support of an increasingly complex portfolio of small molecules and milla-molecular (ADCs, peptides, oligonucleotides) drug candidates. Accountable for providing fit-for-purpose analytical methods and analyses which provide key insights and process knowledge for scale-up and process optimization studies for projects within the portfolio.Accountable for collaborating within project teams to provide innovative analytical approaches to help solve challenging problems encountered to support route selection and process optimization studies conducted by chemists and chemical engineers.Accountable for developing and transferring methods to other analytical release functions to support the timely release of clinical API batches.Partners with other Analytical Functions within CSD, and across Product Development to evolve, integrate and optimize analytical support to create a world-class analytical function.Successful candidates expected to grow and advance to become either analytical leaders for projects responsible for overall project leads of CSD project teams.Specific accountabilities and responsibilities may include: Responsible for willingly and enthusiastically working at the bench to solve challenging pharmaceutical development problems using their expertise in a particular area of pharmaceutical analysis and through demonstrated broader understanding of analytical techniques and how they may be applied to cross functional development challenges. Can be relied upon to work independently to develop and validate methods within their area of expertise. Seeks opportunities to publish/present work externally. Accountable for identifying opportunities and/or implementing solutions to improve efficiency, productivity, quality or reduce costs, operate in accordance with safety and compliance standards (e.g., GMPs, facility, division and department SOPs). Demonstrates capability to influence teams (e.g. not just attend meetings, but offer suggestions) and seeks leadership opportunities.Responsible for actively collaborating with other Key Scientists within the team. Expected to consistently display a can-do attitude and demonstrate the willingness and capability to adapt and grow within a complex and changing environment.Responsible for working with leadership to develop self, share best practices, work effectively to solve pharmaceutical development problems, and continuously learn and improve. Expected to demonstrate capability to advance upon the technical ladder or become an effective analytical lead within project teams.Qualifications/Requirements:Ph.D. or Masters in analytical or organic chemistry is required. Practical experience directly relevant to the role is critical to success and minimum degree requirements change relative to experience.0-5 years of experience in analytical problem solving in the pharmaceutical industry. Experience in supporting API process development preferred.Demonstrated expertise in chromatographic separations a must. Experience with supporting development of milla-molecular molecules (ADCs, peptides, oligonucleotides) a plus.Demonstrated commitment to safety.Excellent interpersonal, collaborative, team building, and communication skills to ensure effective collaborations within matrix teams. Demonstrated performance against cooperation principles and enterprise mindset. Primary Location: NA-US-NJ-New Brunswick  Job Function: Pharma Dev/Process Dev  Organization: GPS-PharmDev  Senior Research Investigator - Analytical Development Description: The Analytical development role will be responsible for developing effective collaborations within CSD project teams consisting of chemists, engineers, and analytical scientists to support of an increasingly complex portfolio of small molecules and milla-molecular (ADCs, peptides, oligonucleotides) drug candidates. This role includes expectations for being both a hands-on scientist, as well as an Analytical Leader who creates development strategy for the project team. Partners with chemists and chemical engineers to strategically developing effective control strategies to support drug substance processes, as well as process knowledge and data needed to ensure health authority acceptance of regulatory filings.Accountable for providing fit-for-purpose analytical methods and analyses which provide key insights and process knowledge for scale-up and process optimization studies for projects within the portfolio.Accountable for collaborating within project teams to provide innovative analytical approaches to help solve challenging problems encountered to support route selection and process optimization studies conducted by chemists and chemical engineers.Accountable for developing and transferring methods to other analytical release functions to support the timely release of clinical API batches.Partners with other Analytical Functions within CSD, and across Product Development to evolve, integrate and optimize analytical support to create a world-class analytical function.Successful candidates expected to grow and advance to become overall project leads of CSD project teams.Specific accountabilities and responsibilities may include: Accountable for strategically driving project development as Analytical Leader across CSD (i.e., effectively plan/manage workload, assess and manage appropriate project risks without being overly risk adverse, develop appropriate control strategies, and collaborate with chemists/engineers). Embraces evolving expectations in AL role such as increased emphasis on risk acceptance, embracing variabilization approaches, and effectively collaborating with chemists&engineers; to provide strategic impact to the projects. Responsible for willingly and enthusiastically work at the bench to solve tough analytical problems, especially when problems arise and resources are not readily available.Accountable for developing focused presentations which highlight the project strategy and risks, and effectively presenting project strategy at CSD Governance meetings (Office Hours, PL Forum, and Team Meetings) and other project forums.Demonstrated skill and ability to influence initiative(s) which improve efficiency, productivity, and alignment within CSD. Within teams, is routinely active in discussion, accepts action items, and delivers within timelines, and with high quality.Partner with other subject matter experts to continually develop knowledge and capability amongst CSD chemists and engineers to perform routine separations analyses (HPLC, GC, etc) across CSD.Qualifications/Requirements:Ph.D. or Masters in analytical or organic chemistry is required. Practical experience directly relevant to the role is critical to success and minimum degree requirements change relative to experience.Experience with coordinating/leading analytical teams and support of projects is highly desired.Minimum of 5 years of experience in analytical problem solving in the pharmaceutical industry. Experience in supporting API process development highly preferred.Demonstrated expertise in chromatographic separations a must. Experience with supporting development of milla-molecular molecules a plus.Demonstrated matrix leadership skills and capability to be effective within matrix teams.Demonstrated commitment to safety.Demonstrated ability to accept and adapt to change and proactively manage ambiguity and risk and make decisions in the absence of complete data.Excellent interpersonal, collaborative, team building, and communication skills. Demonstrated performance against cooperation principles and enterprise mindset. Primary Location: NA-US-NJ-New Brunswick  Job Function: Pharma Dev/Process Dev  Organization: GPS-PharmDev  Principal Scientist - Analytical Development Description: The Analytical development role will be responsible for both influencing the strategic direction of the analytical community within Chemical&Synthetics; Development (CSD) and developing effective collaborations within CSD project teams consisting of chemists, engineers, and analytical scientists to support of an increasingly complex portfolio of small molecules and milla-molecular (ADCs, peptides, oligonucleotides) drug candidates. This role includes expectations for impacting science and innovation as either a hands-on scientist and/or a project leader who creates development strategies for project teams. Significant impact within our departmental is expected through influencing strategies developed within our senior leadership team, managing or mentoring our scientists, or significantly impacting analytical problem solving across our portfolio. Specific accountabilities and responsibilities may include:Partners with chemists and chemical engineers to strategically develop effective control strategies and generate process knowledge and data needed to ensure health authority acceptance of drug substance manufacturing processes. Collaborate within project teams to provide innovative analytical approaches to help solve challenging problems.As a project leader, accountable for strategically driving appropriate risk-based project development across CSD. Project leaders are expected to apply evolving CSD strategies which include increased emphasis on risk acceptance, embracing variabilization approaches, and align resource needs with priorities across the portfolio. Provide focused presentations which highlight project strategy and risks at CSD Governance meetings.Partners with other department leaders to develop functional area strategy and define new opportunities to impact and innovate. Influence initiative(s) which improve efficiency, productivity, and alignment within CSD.Position may include responsibility for the leadership of a small team of analytical scientists within our flexible, matrix organization. Accountable for establishing annual objectives, assessing performance, and mentoring/coaching of direct reports.Accountable for developing and transferring methods to other analytical release functions both internally, and at CMOs to support timely release of clinical API batches.Partners with other Analytical Functions within CSD, and across Product Development to evolve, integrate and optimize analytical support to create a world-class analytical function.Qualifications/Requirements:Ph.D. or Masters in analytical or organic chemistry with a minimum of 8 years of experience of demonstrated analytical problem solving in the pharmaceutical industry. Experience in supporting API process development highly preferred.Experience with coordinating/leading analytical teams and support of projects is highly desired. Experience leading and developing staff is highly desirable.Demonstrated matrix leadership skills and capability to be effective within matrix teams.Demonstrated commitment to safety.Demonstrated ability to accept and adapt to change and proactively manage ambiguity and risk and make decisions in the absence of complete data.Excellent interpersonal, collaborative, team building, and communication skills. Demonstrated performance against cooperation principles and enterprise mindset. Primary Location: NA-US-NJ-New Brunswick  Job Function: Pharma Dev/Process Dev  Organization: GPS-PharmDev  Bristol-Myers Squibb is an equal opportunity employer - Minorities/Females/Protected Veterans/Disabled"}