{"jobID": "2804741601", "jobLocation": "Battle_Creek_MI", "jobTitle": "Steward", "companyRating": null, "companyInfo": {"Website": "www.firekeeperscasino.com", "Headquarters": "Battle Creek, MI", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Other Organization", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Shift:SwingEmployment Status:Full-timeDate Posted:6/6/2018Job Code:StewardLocation:FireKeepers Casino HotelAddress:11177 Michigan AveCity:Battle CreekState:MICountry:United States of AmericaDescriptionSCOPE OF POSITION: Responsible for ensuring the sanitation and cleanliness of assigned kitchens and food preparation areas, ensures that all china and glassware is cleaned efficiently and promptly providing all facets of the dining venues available stock of silver and dishware on a continual basis.    ESSENTIAL DUTIES AND RESPONSIBILITIES: The following is a list of the main duties and responsibilities. However, other duties may be assigned as deemed necessary by management. All duties must be performed in accordance with Tribal, Federal, and other applicable requirements, organizational specific policies, procedures and practices.    Ensures compliance to standards set by management in scraping, racking, stacking and washing of dishware, small wares, china, glass & silverware all cooking pots, pans and utensils, and cleanliness of walk in coolers, floors, walls, and rolling equipment. Responsible for keeping assigned work area clean and sanitary. Assists in maintaining standards of health, safety, and sanitation. Participates as a Team Member with Food Servers, Cooks, Supervisors and any pertinent company Team Members in producing a smoothly and efficiently run operation that meets the highest standards of guest service. Maintains the highest level of confidentiality. Responsible for maintaining a consistent, regular attendance record as outlined in the FireKeepers Casino Hotel Attendance Policy. Outstanding example of and a credit to FireKeepers Casino Hotel.Minimum RequirementsMINIMUM REQUIRED QUALIFICATIONS An applicant’s education, training and experience must be sufficient to demonstrate that the applicant possesses the ability to successfully perform each of the essential duties and responsibilities satisfactorily. FireKeepers reserves the right to verify the sufficiency of a candidate’s education, training and competencies through the interview process, testing and methods.  The requirements listed below are generally representative of the education, experience, and skills and/or abilities required to enable one to successfully perform the essential duties and responsibilities:  Strong attention to detail skills.    GENERAL OR PREFERRED QUALIFICATIONS High School Diploma or GED.    LANGUAGE SKILLS Ability to read and interpret documents such as safety rules, operating and maintenance instruction, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of organization.    MATHEMATICAL SKILLS Ability to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimal, and work with mathematical such as probability and statistical inference.    REASONING ABILITY Ability to define problems, collect data, establish facts, and draw conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables.    PHYSICAL & ENVIRONMENTAL DEMANDS: The physical demands described here are representative of those that must be met by a Team Member to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this position, a Team Member is regularly required to talk or to hear. The Team Member is also regularly required to stand, walk, sit, and use hands to handle or feel objects, tools or controls. A Team Member is occasionally required to reach with hands and arms, and to sit; climb or balance; and stoop, kneel, crouch or crawl. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.  Work is performed throughout all areas of the facility where the noise level varies from quiet to loud depending upon business. Must be able to work in a smoke filled environment. INDIAN PREFERENCEIndian preference will be applied in the selection of qualified applicants in accordance with the NHBP Indian Preference in Employment Code, which affords employment preferences to NHBP Tribal citizens, parents or spouses of NHBP citizens and other Native Americans. For purposes of this preference, NHBP law defines \"Native American\" as: (a) an enrolled member of any other federally-recognized Indian tribes; (b) an enrolled member of a Canadian Indian tribe or First Nation; or (c) an enrolled member of the Grand River Band of Ottawa Indians or the Burt Lake Band of Ottawa/Chippewa Indians.    FireKeepers Casino Hotel reserves the right to make changes to the above job description as necessary. Apply Now Back to ResultsSave this JobRefer this Job Apply Now"}