{"jobID": "2796186994", "jobLocation": "Chicago_IL", "jobTitle": "Junior Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.shipbob.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As a Junior BI Analyst, you will have the opportunity to help every department visualize and track its progress by creating dashboards, allowing for insightful data driven decisions. You will partner closely across the technology, product and operations teams to develop easy to understand analytics to elevate our most pressing issues. You work primarily with our Head of Analytics and Data Scientists but must be able to collaborate effectively and efficiently with multiple teams. Responsibilities:Perform/Handle Ad Hoc data requests and analysisDesign and develop Microsoft SQL Database applications.Create and Maintain dashboards for easier data visualizationParticipate in requirements sessions with technical and non-technical stakeholdersDesired Responsibilities:~0-1 years experienceCommunicative, energized and dedicatedFamiliarity Tableau or other visualization tools a plusBachelor of Science in Computer Science, Engineering or similarCan do attitude, ability to handle multiple projects, and strong work ethic neededExpertise in the following:~1 year building data models, reports and dashboardsSQL is a must, C#, Python, JavaScript or other languages a plusExperience building visualizations using Tableau, Design Studio, or other toolsAbility to communicate with both technical and non-technical stakeholders We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}