{"jobID": "2781689536", "jobLocation": "Deerfield_IL", "jobTitle": "Data Scientist I", "companyRating": "3.2", "companyInfo": {"Website": "www.baxter.com", "Headquarters": "Deerfield, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (BAX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Johnson & Johnson, Abbott Labs, GE Healthcare"}, "estimatedSalary": "88000", "jobDescription": "About Baxter Baxter provides a broad portfolio of essential renal and hospital products, including home, acute and in-center dialysis; sterile IV solutions; infusion systems and devices; parenteral nutrition; surgery products and anesthetics; and pharmacy automation, software and services. The company’s global footprint and the critical nature of its products and services play a key role in expanding access to healthcare in emerging and developed countries. Baxter’s employees worldwide are building upon the company’s rich heritage of medical breakthroughs to advance the next generation of healthcare innovations that enable patient care. Description The Renal Peritoneal Dialysis Product Quality Engineering Team is looking for a talented data scientist to help shape state-of-the-art new analytic capabilities to drive proactive product improvements. ResponsibilitiesUtilizing rigorous machine learning techniques and statistical methods to solve complex problems (e.g. utilizing device self-test and sensor data to develop algorithms for predictive device maintenance)Mining and analyzing product quality data sources (i.e. device log data, manufacturing, complaint, service) to extract useful insightsDesign new visualizations to make descriptive analyses intuitive and more informative.1-3 years experience.BS degree in Computer Science, Data Science, Predictive Analytics, Statistics, Engineering or similar Quantitative Field from a leading academic institution.Some experience/projects involving real-world analytical problems using machine learning, statistical modeling, or similar quantitative approaches.Fluency in Python, SQL, and TableauA passion for problem-solving, comfort with ambiguity, and creativity.Ability to thrive in a dynamic and fast-paced environment and drive change, and collaborate effectively with a variety of individuals and organization."}