{"jobID": "2831388490", "jobLocation": "Redwood_City_CA", "jobTitle": "Scientist, High Impact Data- Protein Analytics (52)", "companyRating": null, "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " High Impact Data Scientist for Protein Analytics Job Description: We are seeking a highly skilled and very enthusiastic data scientist to support the work of our high functioning Protein Analytics group within BMS' Biologics Discovery Center. Using your in-depth knowledge of modern data analytics and visualization, you will build and implement the tools necessary for our group to gain insight into our complex data sets. These data sets are derived from our group's characterization of antibodies and protein and their interactions by mass spectroscopy, biosensors and related analytical techniques. Specific Responsibilities:Working with laboratory scientists, identify gaps where data analytics and/or visualization will help us understand and share our data and resultsDesign, build/buy and implement those solutions including coding as necessary where \"off the shelve\" solutions are not availableTeach and mentor group members how to use these solutions and/or use these tools yourself to help us and our drug discovery teams choose and advance lead drug candidatesAssist in the maintenance and continual improvement of your solutionsRequirements:Degree in computational science, statistics or related field with 3 to 5 years of professional experienceProven ability to analyze data from mass spectrometers, biosensors and other modern biologics analytical techniquesBroad and in-depth knowledge of and experience with leading-edge data analytics and visualization softwareProven ability to perform at a very high level within a small team of laboratory scientists and drug discovery expertsStrong knowledge of present and next generation antibody discovery, small scale production and purification and screeningExcellent written and oral communication skillsSDL2017"}