{"jobID": "2819583338", "jobLocation": "Piscataway_NJ", "jobTitle": "Research Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.colgatepalmolive.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1806", "Type": " Company - Public (CL) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Colgate-Palmolive is a leading global consumer products company, tightly focused on Oral Care, Personal Care, Home Care and Pet Nutrition. Colgate sells its products in over 200 countries and territories around the world under such internationally recognized brand names as Colgate, Palmolive, Speed Stick, Lady Speed Stick, Softsoap, Irish Spring, Protex, Sorriso, Kolynos, elmex, Tom’s of Maine, Sanex, Ajax, Axion, Fabuloso, Soupline and Suavitel, as well as Hill’s Science Diet, Hill’s Prescription Diet and Hill’s Ideal Balance.  For more information about Colgate’s global business, visit the Company’s web site at http://www.colgatepalmolive.com. To learn more about Colgate Bright Smiles, Bright Futures® oral health education program, please visit http://www.colgatebsbf.com. To learn more about Hill's and the Hill’s Food, Shelter & Love program please visit hillspet.com. To learn more about Tom’s of Maine please visit http://www.tomsofmaine.com.  Location: Piscataway, New Jersey, United States  Relocation Assistance Offered Within Country  # 64561  Colgate-Palmolive invites applications for a Research Scientist position based at our Piscataway, NJ location. This is a two year fixed term of at-will employment.  The Research Scientist will participate in Cross-category Research and Innovation and document research results with technical reports, patent applications, and present technical findings to R&D; community and management.    Specific Responsibilities Include:Manage Atomic Force Microscope (AFM) and Light Microscopy Laboratory that houses various advanced light microscopes, including IR and Raman microscopes, Fluorescence and high resolution-dark field microscopes.Develop and implement new microscopy methods, develop and manage fundamental microscopy research programs (both internal and external) that are relevant to Colgate Research & Development initiativesTrain and coach internal users (Research & Development scientists and process engineers) on operation of light microscopes and data interpretationInvestigate product efficacy, active delivery and mode of action by studying their effects on biological systemsEvaluate product morphology and stability to support formulation development and optimization of manufacturing processDocument research results by technical reports, prepare and validate Standard Operation Procedures, and present technical findings to Research & Development community and managements   Education and Qualifications:Ph.D in microscopy/spectroscopy or related material science (chemistry, biochemistry physical or biological sciences) with 0-2 years of postdoctoral experience Required.Expertise in atomic force microscopy (AFM) is preferredSolid academic training with creative and strong problem-solving abilities.Experience involving consumer products is not required, but beneficialExcellent oral and written communication skills Are you interested in working for Colgate-Palmolive? You can apply to work with us using this online application. Attach all relevant documents such as a cover letter and resume or CV. Applications received by e-mail are not considered in the selection process.  Become part of our team. We look forward to your application.  Equal Opportunity Employer  Colgate is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, ethnicity, age, disability, veteran status, marital status, or any other characteristic protected by law."}