{"jobID": "2732246861", "jobLocation": "Oakland_CA", "jobTitle": "Rest Room Care Service Technician", "companyRating": "4.3", "companyInfo": {"Website": "www.rochestermidland.com", "Headquarters": "Rochester, NY", "Size": "201 to 500 employees", "Founded": " 1888", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "21", "jobDescription": "Job Title: Rest Room Care Service Technician Location: Oakland, CA Position: PART TIME Type: Customer Service Other: Field Based Position Summary of Responsibilities CleanAire / WellBeing Hygiene Division – Restroom Equipment Care Service Technician – Oakland, CA and surrounding areas  Required Qualifications: Experience performing customer service duties including use of manual hand tools as needed, route service experience is a Plus.Ability to use own vehicle for route service – reimbursement for mileageAbility to make deliveries and provide customer service.Clean driving recordAbility to use personal computer, and Microsoft word, excel, outlookExperience or willing to learn services business, Restroom Hygiene Care or the facility services market place, would be preferred. Feel good about the work you do and the service programs you sell. Picture yourself working for a reputable company where you represent some of the best service programs in the industry. Now is the right time to explore a career with CleanAire WellBeing Hygiene, a division of Rochester Midland.  Rochester Midland Corporation seeks a Customer Service Technician for a service route in the Oakland, CA and surrounding areas.  Our CleanAire / WellBeing Division programs consist of, Feminine Hygiene Waste Disposal, Restroom Odor Control & Neutralization, Hand Care, and, Ambient Large Area fragrance services. We deliver these turn-key services through a dedicated team of service professionals that are committed to serve & delight our customers.  Rochester Midland Corporation has been owned by the same family for over 125 years, gaining a reputation for stability, growth, and continual improvement. The company is proud to be LEED and ISO 9001 certified. It’s time to join a company with unbeatable benefits, opportunities for advancement, and where your growth will set yourself up for a lifetime of success.  As a member of the team, you can expect: Great reputation – LEED and ISO 9001 certified companyCompany stability – we’ve been in business since 1888 About the company: Rochester Midland Corporation has been a leader in the specialty chemical manufacturing industry since 1888 and has a pioneering position in the development of sustainable programs. They partner with their customers to provide integrated solutions to solve problems and help them reach their strategic business objectives and environmental, health & Safety goals.  All qualified applicants will receive consideration for employment without regard to the individual's race, color, sex, national origin, religion, age, disability, and genetic information, status as a military veteran or any other characteristic protected by applicable law.  We are an Equal Opportunity Employer, EOE /IWD/PVProduct LinesRestroom ServicesIf Interested Email your resume or fax to(585) 266-8919or mail to Human Resources  155 Paragon Drive  Rochester, NY 14624 "}