{"jobID": "2725036732", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.corelab.com", "Headquarters": "Amsterdam, Netherlands", "Size": "1001 to 5000 employees", "Founded": " 1936", "Type": " Company - Public (CLB) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Amspec Services, SGS, Intertek"}, "estimatedSalary": "57000", "jobDescription": "DATA ANALYSTJOB SUMMARY The Data Analyst is responsible for scientific data analysis of various oilfield and laboratory measurements, as well as creation of log images for presentation to the customer. The Data Analyst is called upon to process and analyze the data utilizing proprietary software, creating finished log images for use by both internal and external customers. The Data Analyst must have the capability of supporting innovation of multi-well deliverables when needed (3-D graphics, data analytics and statistics). ESSENTIAL DUTIES AND RESPONSIBILITIESinclude the following. Other duties may be assigned. The principal duty is to computer-process field-generated log data into processed log images for presentation to customers. This includes processing chemical analysis data, and interpretation of well logs for Sales staff and customers, as well as making special data presentations. It also includes interacting with customers to obtain customer-provided data necessary to process the well data and to ultimately interpret the results for internal and external customers, either verbally or in written form.Processing of data requires knowledge of the underlying science and mathematics associated with the data and analyses, and the ability to explain these principals. This knowledge is also used to make necessary adjustments to produce quality analysis results.The Data Analyst must demonstrate the ability to identify correlations between the processed data and well completion records, client provided log and production data and other information. Results are interpreted using a variety of techniques such as; data aggregation and statistical analysis. All available information is used to improve the quality of the final result. Interpretations of identified correlations are communicated to internal and external clients.The Data Analyst must demonstrate the ability to review processed results along with the various available data and information from multiple wells, and identify trends and correlate the trends to completion, drilling, geologic and other miscellaneous records.Processed data must be managed and archived for future retrieval.Responsible for contributing to continuous improvement of processes and presentation of data to the customer. These improvements may include: algorithm development, minor programming,innovation of new data deliverables in various forms: print, digital, 2‑D, 3‑D and animation.The Data Analyst must demonstrate the ability to execute the above mentioned duties and responsibilities accurately with minimum supervision from the Senior Data Analyst or supervisor.QUALIFICATION REQUIREMENTS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION AND/OR EXPERIENCE Bachelor’s degree required, with an emphasis in physics or mathematics preferred. Minimum 5 years of experience with data analysis in the oilfield industry preferred. An equivalent combination of education and experience will be considered in lieu of a degree. Knowledge of offshore operations (gravel/frac pack environments) preferred. Strong computer skills with experience in data analysis software required. Must be able to produce technical reports on analysis of stimulation tracing and post fracturing stimulation logs. Experience with oilfield stimulation and completions preferred. LANGUAGE SKILLSAbility to read, analyze and interpret instructional and technical materials. Ability to write applicable reports and correspondence clearly. Ability to effectively present information in one-on-one and small group situations to clients and other third parties.Strong written and oral communication skills preferred for Data Analysts supporting work from Mexico, Central and South America.MATHEMATICAL SKILLS Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals, and calculate area, circumference and volume. Ability to compute rate, ratio and percent and interpret various graphs used to analyze data. Ability to apply mathematical operations to such tasks as determination of test reliability and validity, analysis of variance, and correlation techniques. REASONING ABILITY Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form. Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to apply principles of logical or scientific thinking to a wide range of technical data problems. Ability to deal with formulas, scientific equations, and graphs. CERTIFICATES, LICENSES, REGISTRATIONS None required; participation in professional organizations (for example, SPE) strongly encouraged. PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The employee may be asked to lift and/or move up to 10 pounds and occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Work is performed in a normal office working environment. The noise level in the work environment is usually moderate."}