{"jobID": "2802111269", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst with Dallas Market Center", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Dallas Interviews but with Dallas Market Center  Dallas Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Dallas Market Center (DMC) is currently looking for an experienced Data Analyst that enjoys finding simple solutions to complex problems. The selected candidate will be part of a highly professional team responsible for the direct support, delivery and success of DMC’s custom desktop and mobile applications. They will be responsible for all duties related to system and application data. The Data Analyst is also responsible for data cleanup, quality, and reliability. Position Description:Validate all data including interpreting data and analyzing results.Conduct queries and produce reports as needed.Understand trends and provide recommendations to management to streamline data collection efforts.Assist in the development of data collection systems and other strategies to optimize efficiency and data quality.Work closely with the application development and infrastructure teams to help maintain system uptime, performance and documentation.Will be part of a QA team responsible for testing all applications and source code after development as well as verify system integrity before and after deployments.Ensure all systems, applications and data transactions operate correctly and as anticipated.Understand and conduct proper data analysis and review campaign results, working closely with all departments post campaigns to identify target data changes and maintain data integrity including managing data cleanup efforts.Must be able to examine and interpret post campaign data and responses to provide desired reports to various departments to help drive future marketing activities.Required Education:High School diploma or equivalency.Bachelor’s degree or equivalent work experience.Required Experience:Proficiency in MS SQL data manipulation and reporting.Must be able to understand and create MS T-SQL scripts.Strong Excel skills (pivot tables, data analysis and reports).Self-starter with attention to detail.Excellent communication, interviewing and requirement gathering skills.Ability to properly create and execute project and test plans.Experience with SQL server execution plans and query optimization a plus.Experience with MS SQL's reporting tools a plus.Experience with Tableau or other query applications a plus.Experience with Oracle PL/SQL a plus.Company DescriptionDallas Market Center is a global business-to-business trade center and the leading wholesale marketplace in North America connecting retailers and interior designers with top manufacturers in home decor, furniture, gifts, lighting and fashion. Inside its dynamic, five million square foot campus near downtown Dallas, nearly 200,000 customers from all 50 states and 85 countries seek industry trends, business education and new products via open-daily showrooms and from exhibitors participating in trade events held throughout the year. Apply"}