{"jobID": "2808478963", "jobLocation": "Chicago_IL", "jobTitle": "Junior Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.guaranteedrate.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Quicken Loans, loanDepot"}, "estimatedSalary": "37000", "jobDescription": "Guaranteed Rate is looking for a new Junior Data Analyst!Data driven, numbers person who loves to dig into data. You are an expert who wakes up every day wanting to monitor, analyze, model and find new ways to drive ROI for the Online business. This is all driven by researching, analyzing, and optimizing lead opportunities.At Guaranteed Rate we live and breathe to provide the best experience to our clients and employees each and every day. We are fresh, passionate, have tons of energy, and love what we do – provide mortgages with low, low rates and wow our customers with impeccable service.Job Responsibilities and Qualifications:Microsoft Excel expert especially with pivot tables and vlookupsThe gate keeper for the data and work flows that are generated to explain the entire leads life cycleBe able to articulate to Senior Management and other internal employees the lead trends, needs, and changesData expert with excellent communication skills. Can you dive into the data and explain it to someone who is not an expert like you?Understand market trends and how to model future trendsAble to analyze business procedures and make data driven recommendations for improvementConducts full lifecycle analysis to include requirements, design and development of analytical toolsLocate and define new process improvement opportunitiesExperience with SQL and database applications a plusExperience with Tableau business intelligence a plusWork extremely well in a high paced, rapidly growing, high energy businessOh, and if that isn’t enough, what about some of the perks you earn from working here at Guaranteed Rate and being part of the family:Our location rocks – right off the brown line at Irving Park. Our home base is a hip office with exposed brick and duct work, windows we can actually open during the summer, and an open floor plan. Rather than a cubicle life, we work in an open and collaborative environment.An in-house café offers breakfast, lunch and a late afternoon healthy snack. We subsidize all meals so you’ll never pay full price.Access to the office gym for only $20 a year. Yes, a whole year! There is also yoga, cross fit, and boxing offered for a very small fee. We want our folks happy, healthy, and feeling good.A FREE on-site nurse. Psshh who needs a doctor’s appointment when our nurse can do it all?A 5,000 square foot rooftop deck that’s available to everyone all day and all evening with WiFi, two bars, music, grills, fun umbrellas, a ping pong table, corn hole, and fire pits. All of this is offered when Chicago gives us those non-snow covered days.Holiday parties? We got’em!! Not just major holidays, any holiday…corporate sponsored holiday eventsInter-office contests like the Great Mac-Off, Chili Cook-Off and Limbo. We always keep you guessing, participating, and wanting more.401k with percentage matching, Blue Cross health care coverage (yup, dental and vision too), short-term disability, life insurance, and even legal assistance (for a small monthly fee)…and did we mention the awesome rooftop deck?Work for the #16 Top 100 Companies to work for in Chicago.Who Guaranteed Rate is:Since 2000, Guaranteed Rate has been creating a better way to get a mortgage. Today, the company has become the 8th largest retail lender in the country with an A rating from the Better Business Bureau and operations in all 50 states. Nearly a fourth of the top 200 loan officers in America work for Guaranteed Rate1 and they have over 500,000 happy customers and counting2. Guaranteed Rate funded $23 billion dollars in loans in 2016 and more than $100 billion in loans since inception.1 As ranked among the 400 top producers on National Mortgage News 2017 Top Dollar Volume list. 2 Source: Guaranteed Rate’s funded loan data from 2000-2016If this sounds like something you want to be part of then reach out, apply and let’s get the conversation started."}