{"jobID": "2764156000", "jobLocation": "Jackson_MI", "jobTitle": "Logistics Admin", "companyRating": null, "companyInfo": {"Website": "www.chemetallamericas.com", "Headquarters": "New Providence, NJ", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Henkel, DuBois Chemicals, Fuchs Lubricants"}, "estimatedSalary": null, "jobDescription": " Logistics Admin Location  Jackson, MIApply NowDescription  A chemical structure is only as strong as the bonds between the molecules. At Chemetall, the strength of the bonds lies not just in the chemicals but is also mirrored in the links forged between the global companies and employees of the Chemetall world.  We are a company with highly qualified talent, who give their contribution each and every day across the different sectors to make the Chemetall difference. We demonstrate uncompromising ethics and appreciation for our employees, as well as respect for the environment. Chemetall is a leading specialty chemical company whose quality, innovation, and service exceed the expectations of our customers.  Where the Chemistry Happens…  Perform job duties to ensure customer and interplant orders are processed in an efficient manner so that external delivery dates are met. Will also be responsible for coordinating incoming and outgoing truck traffic to ensure a safe and efficient work environment.  Formula for success: You will… Develops, implements, and enforces SHE goals and objectives of the facilityAssist, dispatch and direct freight carriers for inbound/outbound shipments working with shipping staff to ensure planned requirements are metCombine customer orders, intercompany and intracompany orders to create cost effective loads for various outside warehouses and customers; this includes meeting daily delivery schedules, monitoring orders, preparing bills of lading and ensuring proper information is on all shipping orders for each loadEnsure shipments are routed via correct freight carrier to satisfy company objectivesWork in other areas of Supply Chain as dictated by workforce demand and Supply Chain Team Leader or Supply Chain ManagerOther duties as assigned by management Ingredients for success: What we look for in you… High School Diploma or equivalent required1+ year in the Logistics field including transportation and distribution1+ year working in a chemical environment desiredFamiliarity with computer data entry, word processing, and spreadsheets requiredExcellent phone skillsProven decision maker who needs minimal supervision with good organizational, and oral and written communication skillsWe are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, age, citizenship, color, religion, sex, marital status, national origin, disability status, gender identity or expression, protected veteran status, or any other characteristic protected by law."}