{"jobID": "2787145781", "jobLocation": "Cranbury_NJ", "jobTitle": "Senior Scientist, Drug Product Development", "companyRating": "3.6", "companyInfo": {"Website": "www.amicusrx.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Public (FOLD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Shire, Actelion Group"}, "estimatedSalary": "95000", "jobDescription": " Position Summary  The successful candidate will be a highly motivated individual ready to work within a Technical Operations group consisting of multi-discipline technical background professionals supporting Drug Product (DP) development and manufacturing.  The pharmaceutical scientist will have experience in developing drug products and understand the complexities and regulations associated with the drug product development process. The candidate will have the opportunity to work with a variety of dosage forms across all stages of development (Phase I to late stage Phase III), with initial primary responsibilities with small molecule dosage forms including solid oral dosages, with additional growing areas such as drug delivery platforms and combination products development.  Roles and Responsibilities  Fully integrated team member of the drug product development team supporting formulation and process development (currently managed at CMOs) including formulation design, data review and analysis, critical process parameter identification, stability study review and trending, process transfer, and batch record development and review  Evaluate and develop drug delivery systems for parenteral and oral products in the pipeline as necessary  Support/ Lead externally managed studies to characterize the product manufacturing process to determine critical process parameters and material attributes and their relationship to product quality attributes and process performance  Support technical troubleshooting including deviation handling and investigations  Oversee clinical manufacturing of for small molecule, solid oral dosage form drug products. This may expand to large molecule biologics, combination products or medical devices, as needed  Contribute to CMC regulatory submissions Requirements BS degree in a Pharmaceutical Science or Engineering, or related discipline with 4 – 8 years of Pharmaceutical and/or Medical Device industries including drug product development experience (or)  MS degree in a Pharmaceutical Science or Engineering, or related discipline with 2 - 4 years of Pharmaceutical and/or Medical Device industries including drug product development experience (or)  PhD degree in a Pharmaceutical Science or Engineering, or related discipline with 0 – 2 years Pharmaceutical and/or Medical Device industries including drug product development experience.  Experience and Skills  Strong Scientific and/or Engineering knowledge of the drug product development process for solid oral dosages, drug delivery technologies and/ or combination products.  Knowledge of formulation development for small molecules to support oral, and potentially other dosage forms, drug products.  Engineering background with advanced pharmaceutics degree is a plus  Experience with medical devices or combination products a plus.  Experience working with external contract manufacturers is a plus.  Solid Knowledge of current Good Manufacturing Practices (GMPs).  Excellent oral and written communication skills.  Strong interpersonal skills, a collaborator/ team player, open minded to the diverse opinions of others.  Ability to produce highest quality and timely work product/ documents with limited direction.  A superior work ethic and a strong personal desire for success. A good balance of confidence and humility.  Must be passionate about Amicus and rare diseases and orphan drugs."}