{"jobID": "2645453486", "jobLocation": "Rancho_Cordova_CA", "jobTitle": "Professional, Business Systems/Data (BI) Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.corelogic.com", "Headquarters": "Irvine, CA", "Size": "5001 to 10000 employees", "Founded": " 2010", "Type": " Company - Public (CLGX) ", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "Job DutiesTechnical and implementation focus is on providing standard and customized applications to resolve business issues. Conduct business process evaluations to gain technical knowledge of business requirements. Analyze and identify problems, research alternatives, create presentations, test to confirm, and implement solutions for defined business processes.Gather business requirements and translate into technical requirements. Collaborate with development to create new customizations with design, documentation, testing and training.Identify business system requirements and related business/application solutions over a complete business process. Identify problems, research alternatives, prepare presentations, drive solutions, test to confirm, gain consensus, and implement solutions for multiple applications within multiple functions.Provide training and support directly to customers.Create documentation of business processes, training procedures, and standard operating procedures. Maintain system protocols by writing and updating procedures. In conjunction with the Product Development and Operations Teams, provide analysis, data cleansing, and data validation to lead the creation of a standardized questionnaire /database to be used for alert driven mortgage analytic products  In conjunction with Product Development, define data elements that will drive actionable alerts including: Identification and creation of relevant datasetsPerform data analysisSynthesize relevant dataPresent recommendations to senior managementWork closely with development staff to assure data integrity with the internal Data Warehouses and Data MartsLead the data importing / exporting process and determine relevant data mappings between source / destination data elements Lead the creation and interpretation of key metrics as related to operational measurements including: Production metrics relating to new, in process, completed ordersException reportingProcess and staff efficiencyWork queue reportingScorecards (client, employee, COA, teams) The position involves significant interfacing with our product, operations, technical, and client services teams to drive the direction of the system"}