{"jobID": "2776383007", "jobLocation": "Chicago_IL", "jobTitle": "Product Manager, Data Science", "companyRating": "4.2", "companyInfo": {"Website": "www.spothero.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " ParkWhiz"}, "estimatedSalary": "85000", "jobDescription": " SpotHero is seeking a “dyed in the wool” analytics-driven product manager who will be foundational in building out our Data and Data Science products and team. This will be a far-reaching role that will have dramatic impact across all aspects of our business including our customers, external partners, and internal teams.  Our product management team solves incredibly hard problems each and every day to create an experience for our customers that strives to be nothing short of breathtaking. We have incredibly high standards, especially when it comes to our team. Who we are: SpotHero is one of transportation's hottest tech companies! We’re rapidly growing with the mission of bringing the parking industry into the future through technology. Drivers across the nation use the SpotHero mobile app or website to reserve convenient, affordable parking on-the-go or in advance, and parking companies rely on us to help them reach new customers while optimizing their business. We connect the dots with cutting-edge technology, delivering value to both sides of this exciting, evolving marketplace. What will you do?Lead the research, ideation, and creation of the data products roadmaps for our Data Science and Data Engineering teams.Create innovative data products and features that leverage our unique position in a multi-sided marketplace.Partner with UX design, marketing, engineering, and sales to deliver the best product for our customers, partners, and internal teamGlean insights about our users and sellers from qualitative and quantitative research which will inform future product decisions:Formulate well thought-out data deliverables that align with company and department goals.Establish how data accuracy is measured and tested; create an action plan in place if something breaks.Work with all stakeholders across the organization to identify and establish a process for data modeling, data exploration, and data visualization.Work with engineers to identify the optimal solutions to meet current and future strategic needs while keeping data vision and roadmap in mind.Drive growth and revenue using a data driven approach.You are:Passionate about data, learning, and working and collaborating to build a great product.Excited to collaborate with your UX team to conduct usability tests, A/B testing, and site surveys. You’ll need to interpret results and surface learnings to the organization.Solid communicator, possessing strong presentation and verbal & written communication skills. Exceptionally organized and very comfortable working with engineering and design teams.Pre-Requisites:3+ years product management experience, preferably with a data or data-driven productExperience with online and offline data collection, data onboarding and data management platformsExperience performing user research, market/competitive research, and soliciting customer feedbackExperience working with engineers in an agile environmentStrong relationship-building, interpersonal, and organizational skillsTeam player with a positive, collaborative attitudeWhat we are offering:Career game changer – A truly unique experience to work for a fast-growing startup in a role with unlimited potential for growth.Excellent benefits – We cover 90% of Medical Premiums, 50% of Dental & Vision Premiums, and offer company sponsored Life Insurance.Flexible PTO policy, generous parental leave, and great work/life balance – We value and support each individual team member.Fun perks like snacks, catered lunches, happy hours, wellness programs, and SpotHero swag.Annual parking stipend (duh – we help people park!).The opportunity to collaborate with fun, innovative, and passionate people in a casual, yet highly productive atmosphere.A workplace recognized as the Best Consumer Web Companyzaeeuqaxrwuybbuwdavye by Built in Chicago, Top Company Culture by Entrepreneur, a Top Workplace by Chicago Tribune, and one of Chicago’s Best Places to Work for Women Under 35 by Crain’s Chicago Business.Steps to apply:Please include your portfolio (optional), LinkedIn profile, and links to any project that represent your skill set. We love seeing work that you’ve loved working on."}