{"jobID": "2791322814", "jobLocation": "San_Ramon_CA", "jobTitle": "Staff Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.gepower.com", "Headquarters": "Schenectady, NY", "Size": "10000+ employees", "Founded": " 1892", "Type": " Company - Public (GE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "205000", "jobDescription": "About Us: GE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.  GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Role Summary: The Staff Data Scientist will work in teams addressing statistical, machine learning and data understanding problems in a commercial technology and consultancy development environment. In this role, they will contribute to the development and deployment of modern machine learning, operational research, semantic analysis, and statistical methods for finding structure in large data sets. Essential Responsibilities:Lead accelerated NPI development of physics aided AI and Machine Learning driven software solutions for Network Performance Management of Electricity Value Network (EVN) spectrum for Power Digital suite of products Demonstrate technical leadership in building foundation for AI and Machine Learning for Power Transmission and Distribution Collaborate with key stakeholders in defining multi generation technology roadmaps for data science and analytics for EVN/T&D; analytics Contribute to build out of most comprehensive EVN Analytics Catalog and Workbench for Power business Work seamlessly with cross-functional global teams to deliver innovative advanced analytics based solutions for power customers Demonstrate solid engineering and domain knowledge and help organization gain the competitive edge Understand business level drivers for electricity value network from product line and from customer perspective in order to meet their needs and requirements Contribute to technology forecasting and IP strategies to the business Collaborate across Power and Digital businesses to build differentiated solutions that fit the design and future of our products Qualifications/Requirements:Basic Qualifications:"}