{"jobID": "2822530405", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist (Temporary)", "companyRating": "3.8", "companyInfo": {"Website": "www.compuware.com", "Headquarters": "Detroit, MI", "Size": "201 to 500 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " IBM, CA Technologies, Micro Focus"}, "estimatedSalary": "96000", "jobDescription": " Compuware is inviting applications for Data Scientist to support our zAdviser group. This is an excellent opportunity for Candidates who aspire a career in Data Science. We at Compuware are doing many interesting things around data and analytics with a vision to transform the company to a data-driven decision making organization. The role will provide you with an exposure on solving real world business problems with data using Machine Learning/AI leveraging state of art tools and technologies. Whats in there for you (Job Responsibilities):Apply strong analytics skills to broad set of business problems and demonstrate capacity for statistical modeling/Machine learning towards creating and analyzing products, operations improvement and optimization.You would be coding customized functions in Python/R to build algorithms on predictive models, to evaluate KPIs such as Risk, ROI, engagement, retention, and other Customer behavior.Leverage big data and diverse technologies to improve proprietary predictive models.Present and interpret analytic findings and participate actively in discussions of results.Design and build flexible, semi-automated reporting templates using Python, SQL, and R.Requirements:M.S/Ph.d. in Computer Science, Machine Learning, Statistics, Finance/Economics or other quantitative field.Excellent Programming skills in Python/R- should be comfortable in handling large data frames and writing custom algorithms.Strong knowledge of linear algebra concepts around Matrix Transformation & Dimensionality Reduction techniques (SVD/PCA)- experience of creating algorithms around recommendation systems using matrix collaborative filtering.Strong understanding of Machine Learning Models and experience with relevant libraries is Statistical packages.Experience interacting with databases using SQL, Spark, Elasticsearch.Experience with data analysis using Excel Spreadsheets.Experience with Spark/Scala is big plus but not mandatory.Experience with ELK stack is big plus but not mandatory.Strong Math Background and Analytical Skills."}