{"jobID": "2822807144", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Science Machine Learning Expert", "companyRating": "4.1", "companyInfo": {"Website": "www.hp.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (HPQ) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "This role is for a Data Scientist position in the Media Data Sciences Group. This individual will work along with other data scientists and analysts in building analytics based solutions that leverage best in class methods and models from statistics, machine learning and AI frameworks to solve key customer problems in the area of planning and execution of digital campaigns. This would include analysis, and development of models and algorithms for creating customer segments and profiles, understanding and predicting customer interests and actions and as well as building models of business KPIs that enable improved decision making.The individual will also be expected to manage and guide data scientist and analysts to conduct analysis and develop algorithms and procedures and demonstrate new approaches. Additionally, the individual will collaborate with business partners and internal customers including business unit marketing, insights, and measurement organizations.This role requires proficiency and hands-on skills in an analytics programming and data management software and platforms. It also requires demonstrated experience in methods and models from statistics, machine learning and artificial intelligence frameworks such as classification, clustering, probabilistic models, network models, graph models, supervised, reinforced and unsupervised learning models, dynamic models etc.Applies advanced subject matter knowledge to design and build analytics solutions and guide team to solve business and technical problems that enable analytics based decision-making. Manage non-exempt/exempt individual contributors and/or supervisors. Has accountability for results of a major program in terms of cost, direction and people management. Provides guidance on process improvements and recommends changes in alignment with business tactics and strategy for area of responsibility. Plans, manages and monitors operational/tactical activities of Staff. Staff members' work may involve strategic issues. Recruits and supports development of direct staff members. Typically reports to Director.Additional Guidance/Criteria:Directs and controls activities within a sub-region or Region.Typically manages 10 or more direct reports. Span of Control guidelines may differ from these numbers.Responsibilities: Typically hire/manage/develop Individual Contributors (IC).Direct/supervise the development of analytics based solutions leveraging statistics, machine learning and artificial intelligence frameworks to enable continuous improvement across the operations of field marketing and demand generation.Direct/supervise the implementation of marketing process and tools such as marketing resource management (MRM), customer relationship management (CRM) and customer knowledge management (CKM).Direct/supervise the management of marketing assets and investment envelope and the creation of metrics across organizations and job functions with effective quality control.Direct/supervise the integration and utilization of new campaign management and other MPM tools.Direct/supervise the execution of marketing programs against metrics and goals.Direct/supervise closed-loop analysis to drive continuous improvements to marketing efficiency and effectiveness.Direct/supervise the development of training and research materials and related processes and tools.Education and Experience Required: PhD or MS in statistics, mathematics, engineering, science or related fields15+ years of experience in team management in a business environment15+ years of experience in consumer & commercial customer insights and marketing analytics with an online marketplace leader or leading e-Commerce player 10+ years marketing, market research and project management or operational experience.Experience in Marketing systems such as MRM or CRM applications.Advanced statistics background for analytical positions preferred (advanced degree preferred) with research and statistical focus background for analytics roles.Knowledge and Skills: Expert knowledge of marketing principles, practices, tactics and tools. Preference in experience in machine learning & AI.In-depth knowledge of Marketing fundamentals, lifecycle, marketing mix and knowledge management.Experience in leading an engineering or project teamAt least 5 years of related experience in analyticsExcellent written/oral communications and analytical skills.Excellent interpersonal skills; ability to build, manage and influence direct reports and virtual teams.Excellent negotiating skills.Ability to interface effectively with management team and functional disciplines.Financial and business acumen.Strong influencing, consensus-building and conflict resolution skills.Proficiency in SQL.Proficiency developing machine learning algorithms in R, SAS, or PythonUnix shell scripting is a bonus.#LI-POST"}