{"jobID": "2835259364", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Associate Research Scientist I", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives. Job ResponsibilitiesEnsure the compliance with Good Laboratory Practice, Standard Operating Procedures, and study protocols in conducting toxicology studies. Ensure compliance with all company/departmental policies, as well as other federal, state and corporate policies and guidelines particularly those relating to animal welfare and employee safety and health.Create an atmosphere of scientific excellence, open communication, and creativity in order to maximize productivity.Embrace/demonstrate BMS Core Behaviors.Train personnel and ensure proper documentation of training.Implement the professional tasks for toxicology studies in an organized, complete, and timely manner, including supervision of the day-to-day operations of assigned studies as follows: Ensure compliance with study protocols.Assign and manage performance of procedures relating to the conduct of toxicology studies.Maintain all study data and samples and prepare these for archival storage.Accurately enter, verify, and/or review study records and study data.Communicate study results to the Study Director.Prepare tables, appendices, and graphs and assist in generation of reports that accurately and completely reflect the data collected.Act as Study Director on assigned studies.Ensure compliance with study protocols.Supervise Biological Technicians and provide direction and encouragement in the performance of their job duties.Prepare study protocols.Monitor and manage the daily operation of studies.Ensure the proper organization and recording of study data.Evaluate and interpret test results.Keep management apprised of study results.Prepare written summaries and reports.Prepare and submit study data to the departmental archivist.Participate as a Study Monitor for toxicology studies conducted at contract laboratories, when needed.Order and maintain inventory of laboratory supplies.Assist in testing, validation, and maintenance of computerized data capture, handling, and reporting system.Maintain maintenance records of all laboratory equipment.Perform other tasks/procedures as assigned by line management.Assist in developing new procedures and evaluating equipment.Minimal knowledge base/skill set requirementsBS in toxicology or related discipline with 0-2 years experience in the oversight and conduct of toxicology studies required for the product registration.Knowledge of the general principles of toxicology, animal and human biology and physiology, especially clinical and functional changes associated with toxicity.Familiarity with various laboratory animals regarding normal behavior, restraint and, dosing techniques, collection of biological samples and use of various types of toxicology laboratory equipment.Assist in the design and interpret of general and investigative toxicology studies.Ability to effectively communicate with co-workers at all levels and to work independently.Knowledge of Standard Operating Procedures, and Good Laboratory Practice Procedures."}