{"jobID": "2610634128", "jobLocation": "Austin_TX", "jobTitle": "Director of Data Science", "companyRating": null, "companyInfo": {"Website": "www.sparkcognition.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " SparkCognition is looking for a dynamic and motivated leader to manage a team of Data Scientists that are developing products using Machine Learning, Artificial Intelligence and Big Data technologies. The ideal candidate is a strong leader who loves to build complex products with a team consisting of high-performing and talented individuals. As a leader, you will be responsible for other Data Scientists in both research and technical aspects of their projects. If you are passionate about driving teams to exceptional performance, growth and challenge, this is the job for you. To be successful in this role, you must be self-motivated, driven and able to help the team in whatever way necessary including hands-on development. ResponsibilitiesMotivate and lead team members with graduate and post-graduate degrees doing applied research solving leading-edge business problemsMentor and lead other members of the department in data science best practicesKeep senior management informed of progress and any obstacles impeding the successful implementation of projects and other departmental activities thru status reports, presentations, etc.Handle routine daily activities such as logistics, coordination, coaching, mentoring, recruiting, planning, delivery, quality, customer/vendor relationships, performance metrics, operations, efficiency and other servicesWork in a highly collaborative environmentQualificationsGraduate degree, Ph.D. preferred, in Computer Science, Statistics, Physics, Mathematics, Neuroscience, Linguistics, Electrical Engineering, Economics, or a related scientific disciplineStrong understanding of machine learning, cognitive computing, natural language processing, statistics, and modeling techniques5+ years in positions applying machine learning, natural language processing, data science, and analytics.3+ years managing projects as a technical project leaderStrong verbal and written communication skills, and the ability to summarize technically complex information for a non-technical audienceStrong 'can do' attitude, thrives in a dynamic, fast paced environment with many simultaneous projectsExperience working with Big data, Cloud, AI or Machine Learning technologiesExcellent interpersonal skills to effectively work with all stakeholders to improve data and business processes and to negotiate prioritiesAdditional qualificationsExperience with distributed computing, such as Hadoop, Spark, or an MPP environmentExperience with developing application on full stack of HTTP, JSON, REST, Angular JS, Java/C#, Python, SQL and no-SQL databasesExpertise in R, Python or similar Machine Learning languages/packagesExperience with NLP, Big Data Analytics, and Graphing techniquesUS Citizenship is required"}