{"jobID": "2831116262", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.dfsco.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Public (DFIN) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Donnelley Financial Solutions (NYSE: DFIN) provides software and services that enable clients to communicate with confidence in a complex regulatory environment. With 3,500 employees in 61 locations across 18 countries, we provide thousands of clients globally with innovative tools for content creation, management and distribution, as well as data analytics and multi-lingual translations services. Leveraging advanced technology, deep-domain expertise and 24/7 support, we deliver cost-effective solutions to meet the evolving needs of our clients. Company Info  Donnelley Financial Solutions (DFS) is a leading financial communications services company with approximately 3,500 employees and 2015 revenues of $1.1 billion. DFS serves capital market and investment market clients by delivering products and services to help create, manage and deliver accurate and timely financial communications to investors and regulators.  Position Summary  The Data Analyst will report to the Chief Data Architect and will be responsible for gathering and analyzing data from disparate systems and producing insights to solve business problems.  Responsibilities Create and manage enterprise data models with logical and physical viewsBuild, manage, and maintain a data dictionary and data lineage for various functional areas of business and applicationsCollect, organize, and analyze data using data profiling and data analysis tools such as Talend, Informatica, or by writing custom SQL queriesIngest data from disparate systems using data integration tools or writing custom code in SQL, Python, or other scripting languagesIdentify, analyze, and interpret trends or patterns in complex data sets.Work with the functional business area to identify, gather, investigate, and document business processes related to data architectureVisualize data insights using data visualization tools such as Tableau, Power BI, or QlikView.Perform root-cause analysis to understand data problems and find solutions by understanding user requirements.Understand use of a data cleansing tool or package such as Talend, or able to write SQL scripts to clean data where necessary.Cleanse data using technical and business validation rules.Build an inventory of data needed to implement the architecturePerform other duties as assigned Required Skills Strong database querying competency using SQLAbility to develop data visualization dashboards in Tableau, Power BI, or QlikViewExcellent knowledge of using statistical packages for data mining using R, Python, Spark ML, or Azure MLBachelor’s Degree in Computer Science or Computer Engineering3 years experience in a data analyst roleAbility to collaborate effectively and work as part of a teamStrong attention to detailUnderstand the fundamental concepts of object oriented programmingIt is the policy of Donnelley Financial Solutions to select, place and manage all its employees without discrimination based on race, color, national origin, gender, age, religion, actual or perceived disability, veteran&apos;s status, actual or perceived sexual orientation, genetic information or any other protected status.  If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access jobs.dfsco.com as a result of your disability. You can request a reasonable accommodation by sending an email to AccommodationRequests@dfsco.com."}