{"jobID": "2697473089", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist III", "companyRating": "3.6", "companyInfo": {"Website": "www.camris.com", "Headquarters": "Bethesda, MD", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Government", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " CAMRIS International is an international development and research firm that realizes innovative solutions to health and development challenges through high-quality, cost-effective program and research management services. With experience working in more than 80 countries, we combine our proven systems with today’s most effective, evidence-based best practices to improve the lives of people around the world. We apply a customized, customer-centric, cost-effective business approach to offer greater value to our clients and challenge the way things have always been done in our field.  CAMRIS clients include U.S. government agencies and multilateral and private organizations. Our core practice areas include public health, agriculture and food security, economic development, education, environment, humanitarian assistance, democracy and governance, and medical research.  CAMRIS seeks a Research Scientist III for an upcoming contract with the Naval Medical Research Unit – San Antonio (NAMRU – SA). NAMRU – SA is a major research and development center conducting medical, dental, and directed energy biomedical research, which focuses on ways to enhance the health, safety, performance, and operational readiness of Navy and Marine Corps personnel and addresses their emergent medical problems in routine and combat operations. Note: The position is contingent on contract award.Provides expertise in development and conduction of protocol-driven scientific research addressing various aspect of military medicine, including, but not limited to: hemorrhage and resuscitation, immunomodulation, biomedical systems, bioassay development, craniofacial, infectious diseases and directed energy bioeffects.Provides supervision and guidance to junior scientist contract personnel in writing protocol-driven research proposals, animal use protocols, human use protocols, technical reports, final reports, and peer-reviewed manuscripts.Provides guidance to junior scientist contract personnel on the evaluation of data sets (provided by the government and collected by the contractor); development of presentation materials, writing of research Standard Operating Procedures, and presenting findings at technical and professional meetings.Provides supervision for contract personnel during the preparation of experimental subjects and aid in the training and the development of experimental subjects for experimental procedures in accordance with approved animal or human use protocols.Provides support in the development and establishment of in vivo and in vitro model systems, data acquisition, and data analysis.Oversees personnel associated with the projects and manage data.Performs surgical procedures on animal models for both survival and non-survival.PhD is a relevant field.Seven years of more of relevant experience.Ability to work effectively independently or as a team.Strong oral and written communication skills.Excellent organizational and time management skills.Previous experience with the U.S. military is highly preferred."}