{"jobID": "2787806119", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist -- Sr.", "companyRating": null, "companyInfo": {"Website": "www.radiantsolutions.com", "Headquarters": "Herndon, VA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ResponsibilitiesRadiant Solutions has an urgent and immediate need for a Data Scientist to join our team in Reston, Virginia. To be qualified you must be a US Citizen and must have an active TS/SCI. CI Poly highly desired.General SummaryFull-time senior-level Data Scientist will perform a broad range of complex data analytics in support of a hard target mission.ResponsibilitiesUtilize statistical techniques and extract relevant information from large amounts of dataAutomate and optimize data extraction, cleaning, processing and analysis functionsDevelop, validate, and implement data models to solve problems/answer questionsDevelop and implement novel statistical approaches to address complex issuesPerform data science/engineering with little guidance and independently write reports detailing methods, results, and impacts to assigned issues QualificationsRequired QualificationsAdvanced degree in mathematics, statistics, operations research, engineering, science, or equivalent experience10 years of relevant professional experienceExperience performing data science/engineering work and writing reports based upon the resulting work/accomplishmentsPublished data science reports and/or authored new procedures/methods to create innovative statistical approaches to solve complex issuesProficiency in statistics packages such as SPSS, SAS, S-PLUS, and RProgramming skills sufficient to extract, transform and clean multi-terabyte databasesSignificant current experience (i.e., within last 2 years) in data science/engineering workTo be qualified, you MUST be a US Citizen and must have an ACTIVE TS/SCI clearance. Poly highly desired. Radiant Solutions is an Equal Opportunity Employer. #cjpostOverviewJoin our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.  We are a new organization but no company has such strong roots in geospatial with our level of scale and a strong commercial mindset. Our heritage companies, MDA Information Systems, RadiantBlue, DigitalGlobe Intelligence Solutions, and HumanGeo are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technology and our unique intellectual property to both national security and commercial problems.  We offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance. Radiant Solutions values diversity in the work place and is an Equal Opportunity Employer."}