{"jobID": "2801659022", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.perspecta.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2018", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Every day at Perspecta, we enable hundreds of thousands of people to take on our nation’s most important work. We’re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation’s most complex challenges. We continually push ourselves—to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.  As the innovation hub of Perspecta, Perspecta Labs is molding the future of emerging technologies. We refuse to think inside the box. Our experts conduct leading research in machine learning, artificial intelligence (AI), mobile communications and internet of things (IoT) technologies that provides customers with transformative insights and real-time situational intelligence. With your finger on the pulse of next-gen technology, you’ll be rewarded in many ways—not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.  Perspecta’s talented and robust workforce—14,000 strong—stands ready to welcome you to the team. Let’s make an impact together.  Perspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categoriesResponsibilities #NAME?Qualifications Required Experience - 5+ years’ experience in data analytics and algorithm development for scientific or industrial data - 5+ years’ experience developing software on Linux platforms - 5+ years’ experience coding in Java or C++ - B.S. or M.S. in Computer Science, Electrical Engineering, or closely related field - Must be a US citizen with willingness and ability to obtain a US government security clearance Desired experience - Understanding of basic radio frequency concepts and terminology"}