{"jobID": "2832029987", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "106000", "jobDescription": "Job DescriptionPosition:Cognitive Data Scientist,Hybrid Cloud Management System AIOps,Job Description IBM Cloud Brokerage Services (ICBS) business unit is seeking an experienced Cognitive Data Scientist with machine learning model development, train and deployment experience. The ICBS team develops applications for hybrid cloud management across the lifecycle of plan, order, deploy, operate and govern customer workloads.  As a Cognitive Data Scientist, you will be responsible for development, training, and deployment of machine learning models for the Hybrid Cloud Management System - AIOps application. You will closely work with the ICBS Product Management, Architecture, and Delivery teams to understand product requirements and roadmap from both a business, technical, and delivery perspective. You will collaborate with the teams to commit to delivering stories/tasks/defects within a sprint cycle. You will participate in the current agile development process based on the Spotify model. You will mentor and lead junior development resources to ensure increase in the productive output.  The successful candidate will be ambitious and self-directed with a passion for Agile-based Cloud-native development in a Spotify model. You will have prior machine learning model and data analytics development experience with a thorough understand of DevOps and its supporting services and tools. You will also have proven analytical capabilities, and web application development experience, and the tenacity to develop ideas independently and thrive in a fast-paced start-up environment. You are very delivery-focused, balanced with being a big-picture evangelist. You are able to communicate clearly and compellingly with the stakeholders of the product. ResponsibilitiesResponsible for following the defined agile development processes including attending the required meetings with contribution towards the successful completion of the sprints..Collaborates with product management and customer delivery teams to ensure product requirements are clear on what customers expect and what the delivery teams should set as the right expectations with the customers.Communicate rigorously within the squad on goals, ongoing progress, milestones, and any issues.Support and follow the overall product architects, delivery architects, to drive and establish the architecture decisions and designs for the product.Leverage the DevOps team to ensure product can be automatically built, deployed, and tested using a CI/CD pipelines across all of the release cycles from dev to production.Mentor and develop required skills of other junior product developers.Required QualificationsExperience as a Cognitive Data Scientist for large-scale enterprise cognitive applications.Experience with Machine Learning frameworksExpert in coding hands on: Python, NodeJS, JavaScript, Angular (4 or 5), React, HTML5, CSS3End to End Software development experience (hands on) in a combination of the following : Architecture & Design, User Interface, Database systems, Analytics, Cognitive systemsProven ability to develop resilient code (best practice error handling) that performs and scales for large enterprise needsDevOps end to end experience with tool chains such as Docker, Travis, minikube/kubernetes, Jira, GoCDDeep expertise in developing REST-based API's (json/yaml), Micro-services with RDBMS and NoSQLBachelor's degree in Computer Science or equivalent with specialization Machine LearningSkillsUnderstanding of Public and Private Cloud Provider services, usage and delivery paradigmsExperience applying machine learning and predictive analytic techniques to large, complex data setsWorking knowledge of cloud technologies and architectures, including Virtualization, APIs, Micro-services and Containers.5+ years experience delivering enterprise-class cognitive applications2+ years experience developing in Python and modern web-based languagesExcellent verbal and written communication abilities: must effectively communicate with technical and non-technical teamsHigh attention to detail and proven track record in taking ownership, driving results and moving with speed to implement ideas in a fast-paced online environmentWillingness to roll up your sleeves and do whatever is necessaryAbility to process and manage multiple prioritiesPreferred QualificationsPh.D in Computer Science/Artificial Intelligence with specialization in Machine Learning.Knowledge of IT Service Management and IT Operations Management processes, tools and technologiesKnowledge of CI/CD processes, DevOps toolchains, blueprint, template and/or container based deployment modelsExperience with multiple Cloud services, including vmWare, IBM Cloud, AWS, MS Azure, Google Cloud beyond compute and storageExperience with Big Data architectures including Spark/Hadoop, HDFS, analytical processingExperienced with Jira / Confluence, GitHub, Travis, TestRails, GoCD.Required Technical and Professional Expertise Experience as a Cognitive Data Scientist for large-scale enterprise cognitive applications.Experience with Machine Learning frameworksExpert in coding hands on: Python, NodeJS, JavaScript, Angular (4 or 5), React, HTML5, CSS3End to End Software development experience (hands on) in a combination of the following : Architecture & Design, User Interface, Database systems, Analytics, Cognitive systemsProven ability to develop resilient code (best practice error handling) that performs and scales for large enterprise needsDevOps end to end experience with tool chains such as Docker, Travis, minikube/kubernetes, Jira, GoCDDeep expertise in developing REST-based API's (json/yaml), Micro-services with RDBMS and NoSQLBachelor's degree in Computer Science or equivalent with specialization Machine Learning Preferred Tech and Prof Experience Ph.D in Computer Science/Artificial Intelligence with specialization in Machine Learning.Knowledge of IT Service Management and IT Operations Management processes, tools and technologiesKnowledge of CI/CD processes, DevOps toolchains, blueprint, template and/or container based deployment modelsExperience with multiple Cloud services, including vmWare, IBM Cloud, AWS, MS Azure, Google Cloud beyond compute and storageExperience with Big Data architectures including Spark/Hadoop, HDFS, analytical processingExperienced with Jira / Confluence, GitHub, Travis, TestRails, GoCD. EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}