{"jobID": "2421510271", "jobLocation": "Rockville_MD", "jobTitle": "Research Scientist, Mass Spectrometry", "companyRating": "2.7", "companyInfo": {"Website": "www.nantworks.com", "Headquarters": "Culver City, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Position Overview:The Research Scientist is part of a team focused on supporting R&D;, GLP and CLIA efforts by performing sample processing of GLP and CLIA samples. They will also maintain the Companys mass spectrometry facility, and involve in developing high-value cancer assays that enable sensitive, quantitative high-throughput analysis of proteins in human tissue.Essential Responsibilities:Coordinate the GLP service projects by performing MS experiments, analyzing data and timely presentation of results and conclusions in oral and written formats with principals and clients. (30%)Develop SRM assays for drug target proteins. Generating ideas and optimizing lead peptide for assays. Validating these assays in pre-clinical samples through collaborative experiments with biopharma and academic partners and also validating the assays in clinical tissue samples. (30%)Following CLIA guidelines, perform SRM MS assays on samples received from clinical clients as commercial services. Absolute adherence to all CLIA documentation requirements is necessary. (15%)Maintain and refine the Companys mass spectrometry facility and capabilities. Troubleshooting mass spectrometry instrumentations to ensure the daily productivity. Evaluating methods, improving methods and software to incorporate into the Companys mass spectrometry operations. (15%)Develop and maintain standard operating procedures (GLP, CLIA) by authoring SOPs and implementing the current SOP for maintenance of GLP and CLIA facility. Contribute to manuscript submission and to patent application. Timely sharing of data with principals is essential. (10%)Education/Experience Requirements:Ph.D. in analytical chemistry, biochemistry or related field with 1-5 years post-doctoral experienceHands on experience with triple quad mass spectrometry, nano-LC fluidics and processing and managing data flow with Pinpoint/Skyline or equivalentExperience with peptide SRM assay developmentHighly organized and willing to analyze detailsExcellent oral and written communication skillsAbility to thrive in an early stage company environment that requires hands-on implementation, optimal use of limited resources and an ability to work closely with others in a small team settingOther comments or specific duties:"}