{"jobID": "2825684949", "jobLocation": "Elk_Grove_Village_IL", "jobTitle": "QA/QC Analyst (Data Entry Clerk)", "companyRating": "3.1", "companyInfo": {"Website": "www.montrose-environmental.com", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Montrose Environmental Group, Inc. is a high-growth Environmental Services company offering (i) Measurement and Analytical services and (ii) Environmental Resiliency and Sustainability services to a diverse range of clients in industry and government throughout the United States and abroad. Our qualified engineers, scientists, technicians, associates and policy experts are proud of our ability to objectively help industry, the public and regulators work constructively together on environmental opportunities.  We are looking to hire a Data Entry Clerk who will be responsible for completing the following tasks.  The position responsibilities include, but are not limited to, the following: Enter data for Tagging and Inventory Projects and component inventory purposesProvide administrative assistance to Project Managers and StaffCheck data entry email daily, print, save and delegate to appropriate peers, maintaining priority in conjunction with the 24 hour processEnter data from hand written field sheets for component inventory generation the Extranet applicationReview own data entry work and cross check with peersDocument time spent on each project in the project database and the data entry tracking sheetEmail all questions, changes and work completed to Lead Technician and Project Manager and follow up on all pending questionsOrganize all data entry materials for review and filing purposesMaintain open communication (written and oral) with Supervisor and StaffCoordinate with Project Managers to ensure the proper flow of inventory information, project specifics, and deadlinesUnderstand the logic and procedures for routing and tag placementAbility to accurately identify and record descriptions of components and their associated leak-pathsSave project files neatly and organized; both hard copy and electronicallyRecords time for project billing and payroll as requiredPerforms basic administrative tasks such as copying, filing and creating bindersMust be proficient with MS Excel or Web based application for entering data and shows aptitude for process improvementMeets desired goals and deadlines, communications progress and request extensions when neededMaintains good attendance and punctuality Montrose Environmental Group is an equal opportunity employer committed to creating a diverse workforce. All qualified applicants will receive consideration for employment without regard to age (40 and over), ancestry, color, religious creed (including religious dress and grooming practices), denial of Family and Medical Care Leave, disability (mental and physical) including HIV and AIDS, marital status, medical condition (cancer and genetic characteristics), genetic information, military and veteran status, national origin (including language use restrictions), race, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), gender, gender identity, gender expression, and sexual orientation.  As permitted by applicable law, employment with Montrose is at-will."}