{"jobID": "2815675019", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ceremity.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "IMMEDIATE OPPORTUNITIES, GREAT BENEFITS, WALK IN INTERVIEWS AVAILABLE DAILY! COME VISIT US!Multiple shifts available for manufacturing laborers!When you join our talented employee family at a location near you, you will earn a steady income that rewards your hard work within our fast-paced environment. You will also enjoy the growth opportunities, stability, and generous benefits you would expect from the world’s largest (and expanding!) furniture manufacturer.  Disclaimer! Must be able to pass a drug screening.Ashley Furniture is proud to be honored as one ofAmerica’s Best Large Employers 2017 by Forbes.The team at Ashley Furniture is excited to announce that our organization has earned a place on the Forbes 2017 list of America’s Best Large Employers, which is based on employee feedback.Multiple shifts available for manufacturing laborers!We now offer flex shifts exclusively for our distribution center laborers: Work your choice of three 12-hour shifts per week, any day or shift you decide! MANUFACTURING LABORERSThe skilled professionals we select will manufacture furniture using hand tools, adhesives, jigs, fabrics, and other components; set up and use jigs to assemble component parts, inspect parts for defects, and make repairs; and inform personnel of non-conforming parts. Requirements:Basic math and written/verbal communication skills.Ability to measure using English and metric scales.Ability to learn basic computer systems and operate an inventory-scanning device.Knowledge of a scanning system.Ability to obtain valid, company-issued vehicle licenses.Ability to push/pull/transport goods weighing up to 100 pounds, and manipulate loads weighing up to 250 pounds.Ability to stand or walk 100% of the time, as well as see/hear/speak/grasp/climb.Rewards:In addition to stable employments and weekly paychecks, our teams enjoy great benefits, including tuition reimbursement, profit sharing, dental & medical coverage, paid vacation & holidays, 401k, and family-appreciation day. Ashley Furniture is an Equal Opportunity Employer. M/F/D/V Ashley offers a drug-free workplace. Applicants must pass pre-employment and random drug screens."}