{"jobID": "2821016231", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.247.ai", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Nuance, RightNow Technologies"}, "estimatedSalary": "125000", "jobDescription": "[24]7.aiJob Title: Sr. Data Analyst Department: Data Science Group Location: San Jose CA What we do: TheData Sciences teamis responsible for building and implementation of state-of-the art predictive solutions that address consumer needs across the life cycle of their interactions with our clients. We are developing the science of intuitive consumer experienceusing machine learning, artificial intelligence, data mining, statistics, natural language processing and text mining.  We drive non-linear business outcomes for our clients using Data Science. Data Science is the business we are in!! Educational Qualification:Bachelors/Master degree in Computer Science/Computer applications/Machine learning/Statistics/Mathematics OREngineering degree with relevant analytics experienceKey Expectations:Understand client’s business to be able to articulate the business problem, create relevant solutions using technical knowledge and deploy the solutions to drive revenueWork independently with ownership to manage and drive outcomes on at least one account while working with teams and support on multiple accountsOwn and execute projects end to end independently keeping in mind standardization and scale across accountsCollaborate and work closely with several key stakeholders to drive revenue generation-account managers, sales, engineering, product, R&D;Experience & skills5+ years of relevant analytical experience in product/service companies-retail, telecom, hospitality and financial verticals preferred. Speech recognition and digital web experience preferred.Ability to code in SQL, R, Python, JAVA and do text miningWell-versed with Excel and UnixHands-on experience with the Hadoop technologies such as Hue/Ambari, HDFS and/or other large-scale distributed systemsStrong analytical background and proven ability to make data-driven decisionsGood working knowledge of predictive modelling and data mining. Machine learning knowledge a key differentiatorExcellent communication skillsAbility to work in unstructured environments and with multiple stakeholdersDelivery focusSelf-starter, high motivation to learn and growProficiency in a foreign language preferredAbout [24]7.ai [24]7.ai is redefining the way that companies interact with consumers. The company’s customer engagement platform assists several hundred million visitors across all channels, and engages in 1.5 billion conversations annually, most of which are automated. Using [24]7.ai solutions, many of the world’s largest and most recognizable brands are anticipating and acting on consumer intent to create more personalized customer experiences. This shift to an intent-driven engagement strategy results in an order of magnitude improvement in digital adoption, customer satisfaction, and revenue growth.  Learn More at www.247.ai. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. #LI-PS1"}