{"jobID": "2738291713", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Research Scientist, Data Analytics", "companyRating": "4.1", "companyInfo": {"Website": "www.celtra.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "150000", "jobDescription": " Do you always need to get to the bottom of how things work? Do you get heart palpitations when siphoning through great amounts of data? Do you live for the eureka moment when everything aligns and you find a clear story in the patterns? Then keep reading…  Creating great ads with a soul is not easy. Join our expanding product team in San Francisco to shape the next generation of our platform and help us change that.  You will have access to billions of data points and the chance to partner with senior leaders within our organization. Responsibilities:Design & implement new experiments or quasi-experiments, and develop new methods for causal inferencePartner with solutions engineers and Product to understand client needs and develop research or evaluation studies, rooted in experimental designChannel learnings back to product innovation and product designDesign and build data pipelines to support studies and analysis when neededRead academic papers and apply appropriate statistics and data science methods at CeltraRequirements:Ph.D. in Statistics (or other doctoral degree with a strong emphasis on statistical methodology (economics, political science, operations research, etc.); a Master’s degree or other degrees may be considered with substantial relevant experienceExperience with designing and analyzing experimental studies, familiarity with causal inference using Potential Outcomes Framework, multivariate quantitative analyses techniques, identifying heterogenous treatment effectsExperience conducting causal analysis for non-experimental designs (e.g. propensity score matching, regression discontinuity, instrumental variable design)Database experience including operational knowledge of SQLProficient in R and at least one other programming language (e.g. PHP, JavaScript, or Python, Java/Scala)Ability to access, munge, visualize, and model datasets with minimal engineering support, and communicate your results verbally and in writingNice to have:Familiarity with Apache SparkKnowledge of advertising industryAbout Celtra Celtra is the Creative Management Platform for digital advertising. Brand and performance advertisers use our fully self-service platform to create, distribute and optimize the highest quality, data-driven ads at scale, across all channels and screens with great efficiency and control. We power the best video, native and rich media ads for 2/3 of Fortune 500 brands.  If you have an interest in a company who’s interested in both your wellness and your wallet (medical, dental, vision, parental leave, education, fitness, commuter, 401k... you get the picture), you should apply. Celtra is headquartered in Boston (MA), with offices in New York City, San Francisco, London (UK), Singapore and Ljubljana (SI). For more information, visit Celtra at http://www.celtra.com or @CeltraMobile on Twitter."}