{"jobID": "2607470108", "jobLocation": "San_Francisco_CA", "jobTitle": "Regional Director", "companyRating": "4.9", "companyInfo": {"Website": "www.brightonjones.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Freestone Capital Management"}, "estimatedSalary": "92000", "jobDescription": "Are you hungry for more than just a career move? Wondering if it’s possible for work to be an extension of your own personal passion? Brighton Jones’ inclusive culture enables you to discover your potential and pursue your definition of a richer life.Brighton Jones is one of the country’s fastest growing, fee-only RIA wealth management firms. We are seeking an experienced, results-oriented, and energetic leader to drive the strategy and growth for our Bay Area office. If you are passionate about helping people live a richer life, are energized by growing teams and increasing revenues, and love inspiring others to do their best work, this may be the perfect opportunity for you.The Role Own and manage the P&L; for the regionDevelop and deliver on short- and long-term business plansInspire and motivate our talented team members to achieve shared goalsRepresent Brighton Jones in the region at community, industry, and other external eventsProactively attract and convert new prospects into clientsPartner with the service team to deliver an incredible client experienceRecruit exceptional new team membersEnhance a culture that engages and challenges employees to continuously learn and develop theirYour Experience Bachelors’ degree required; advanced degree preferred (MBA, JD, etc.)8+ years of proven experience and success managing a P&L;Entrepreneurial by nature; open to seizing opportunities, overcoming challenges, and thriving when dealing with complex and demanding situationsPrevious experience effectively managing a teamOutstanding analytical and problem-solving abilitiesUnquestioned ability to handle confidential information in a professional mannerDemonstrated success in attracting and retaining prospective clientsExcellent organizational, leadership, communication, interpersonal, and presentation skillsOur CultureAs a group of individuals who love what we do and enjoy who we work with, we know that the genuine relationships we build with each other positively affect our clients and their experience of working with us. We’re intentional in cultivating a culture that is inclusive, collaborative, and celebrates individual initiative.We are:Genuine - our unquestioned commitment to integrity is demonstrated in all of our personal and professional activitiesFocused – we work together to manage heavy workloads and time-sensitive projects - we thrive in a fast-paced environment that fosters continued growth and developmentApproachable – we enjoy interacting with each other and our clients, always projecting a professional, friendly and capable image in everything we doInvested – our commitment to our clients and each other means we are willing to maintain a flexible work schedule to address cyclical work periodsDriven - we possess good judgment, initiative and decision-making skills - able to anticipate problems, determine the appropriate level of response, and act accordinglyOur CompanyWe are a company that uses objectivity, creativity and passion to help our clients, colleagues and community members live richer lives. We eliminate the conflicts of interest in the financial industry by not selling products and sitting on the same side of the table as our clients.We are a nationally recognized wealth management firm with a strong talent focus. We offer a very competitive compensation and benefits package for our industry. In your cover letter, please describe your professional passions and ultimate career objectives.In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility form upon hire.Brighton Jones provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Brighton Jones complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has offices. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.Brighton Jones expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status. Improper interference with the ability of Brighton Jones employees to perform their job duties may result in discipline up to and including discharge."}