{"jobID": "2821593026", "jobLocation": "Millbrae_CA", "jobTitle": "Clinical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.nerinc.com", "Headquarters": "Minneapolis, MN", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This is a 3 YEAR CONTRACT ---- Near SFO --  (General info )  Disclosures group is part of wider Product Development group focusing on regulatory business operations. Disclosures group is responsible for implementation of Clinical data sharing policy by registering clinical trial protocols. Intact & Cross-Functional Teams Participates on-site/or regional Product Development Disclosure departmental meetings  Operate within a global organization with flexibility for early meetings (1-2 times per week)  Represents Disclosures and supports effective and efficient cross-functional PDR coordination, appropriate resources, and timely, thorough and compliant execution  As assigned, may act as a standing or ad hoc member of other teams for special or ongoing initiatives and projects Disclosures Continues to expand his/her knowledge base of laws, regulations and guidelines governing the development, licensure and marketing of drugs and biologics  Obtains and applies in-depth knowledge of Biotech and regulatory guidelines, procedures and best practices  As needed, provides Disclosures expertise to cross-functional teams and other groups  Contributes to development and maintenance of policies and/or Standard Operating Procedures (SOPs) on clinical trial registry and clinical trial results database processes  Identifies studies required for registry and results postings, including applicable trials for results postings on relevant external websites. Ensures that responsible PDR management and staff are aware of timelines, deadlines and other requirements  Tracks missing/late registry entries and Clinical Study Reports (CSRs) and liaises with PDR teams regarding dates of new product or line extension approvals  Liaises with project teams and affiliates to ensure they understand their responsibilities in relation to regulatory documentation disclosures  Submits protocol documents for preparation of registry entry and for quality control checks, i.e., consistency between registry and protocol, cross-protocol and franchise consistency. Similarly submits CSR document for preparation of results entries"}