{"jobID": "2796942563", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Economist", "companyRating": "3.6", "companyInfo": {"Website": "www.realtor.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Redfin"}, "estimatedSalary": "141000", "jobDescription": " realtor.com is seeking a Sr. Economist for the Economic Research team with very strong analytic and problem-solving ability, skills to extract information from large data, and expertise in delivering findings to the economics team, industry, media, and consumers. The purpose of this role will be to analyze customer, product and transaction data and deliver insights to the team and its stakeholders. The role will report directly to the Chief Economist or Director of Economic Research. Duties & Responsibilities:Work with other members of the Economics team and other company data teams to extract and present key trends impacting residential real estate, blending Moves proprietary data as well as data from the National Association of Realtors, government, and relevant demographic and economic third-party sourcesMonitor and digest key economic and housing data as well as policies that affect these data to inform Moves stakeholdersProduce and automate economic data series, indices, and ongoing reportsLead ad-hoc research/data projects, pulling and blending data, designing methodologies, and translating findingsExtract data, conduct complex analyses and communicate resultsLead short-fused research projects and deliver results under time constraintsContribute to the roadmap for economic insights and data products, publishing unique visual and interactive content and articles on realtor.com/research and driving ideas for future analysesPartner with Communication teams respond to media requests and build Realtor.coms share of voiceSpeak to media and to industry stakeholders on specific research studies, market statistics, and other unique insights and also occasionally on the latest market trendsPresent insights at industry events and support the realtor.com brandCollaborate with third party data and research teams on topical research projects to foster realtor.com position as an industry thought leaderEducation, Skills & Experience:Bachelor degree in statistics, economics, business, computer science or a related area. Masters degree or Ph.D. preferred.5+ years of hands-on experience in business/data analysis and economic research. Experience with real estate or housing research preferred.Strong quantitative orientation with excellent research and analytic skills that will support strong market analysis, forecasting experience preferred.Ability to assimilate large amounts of information and data and create a compelling story supported by the factsDeep knowledge of and experience working with housing and economic datasets (i.e. Census, Nielsen or similar demographic data, economic time series and forecast data such as Moodys Analytics)Experience with common statistical programs in an applied context required (R, SAS, SPSS, eViews, or Stata).Ability to use SQL and reporting tools such as Tableau or Microstrategy required.Programming and scripting skills strongly preferred (Python, Java, Scala, R)Experience extracting and analyzing big data is strongly preferred (AWS S3, AWS Redshift, PostgreSQL, Google BigQuery, Spark SQL, etc).Ability to work independently and in a team to develop innovative solutions.Ability to manage tasks/projects to required deadlines in a changing environment.Ability to partner with individuals and groups from multiple functions and organizations, especially ability to collaborate with other real estate analystsStrong communication skills, both written and verbal including:Comfort presenting to live audiences and articulating thoughts on the spotStrong media presence and large group presentation skills, with interest in further developing these skillsComfortable stage presence and ability to communicate appropriately and effectively to a consumer television or radio audience as well as a large in-person meeting of industry peersAbility to convey difficult subjects and ideas in sound bites that the average layperson can understand and attract media attention"}