{"jobID": "2820428913", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Lead Data Scientist/Machine Learning Programmer - FullTime - Basking Ridge, NJ & Philadelphia, PA", "companyRating": null, "companyInfo": {"Website": "www.stiorg.com", "Headquarters": "Princeton, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " One of our clients has an opening for a Data Scientist / Data Scientist Lead on FULLTIME for New Jersey OR Philadelphia locations If you are interested and looking for opportunities please review the job details given below and share your latest resume with Amrutha at amrutha.duddula@stiorg.com.  For more details please call or shoot an email. Title: Data Scientist / Data Scientist LeadDuration: FULLTIMELocation: Baskin Ridge/White Station, NJ or Philadelphia, PAMUST HAVE:Strong in Python & RStrong in SQLMUST have Lead experience for Data Scientist Lead roleConsultants from Insurance background are given preference.JOB ROLE: Client is someone with a strong background in software programming and statistics who is eager to tackle data challenges with large, complex datasets using machine learning, predictive analytics and the latest open source and cloud technologies. MUST Key requirements: Bachelor's degree in mathematics, statistics, computer science, economics or other quantitative field Proficient in SQL and advanced data manipulation techniques Knowledge of machine learning techniques such as clustering, decision tree, artificial neural networks, etc. Experience using statistical programming with at least one language such as Python, R, Scala Experience using machine learning libraries for Python (scikit-learn, pandas, scipy, numpy, etc) Experience in text mining using natural language processing, topic modelling, entity extraction, etc. Experience developing data visualizations using a tool such as matplotlib, shiny, bokeh, etc. Experience in command line and scripting languages Familiar working in parallel, distributed systems with technologies such as spark Ability to effectively present and explain complex concepts to a non-technical audience Actuarial background will be of advantage.RESPONSIBILITIES: Collaborate with stakeholders to carryout exploratory data analysis, design and development of advanced machine learning algorithms to  solving complex business problems that may be loosely defined  Collect and analyze data from diverse internal and external source systems and assess the effectiveness and accuracy of the data and data  gathering techniques  Develop data models and algorithms to apply to data sets for normalization  Develop A/B testing framework to test model quality  Coordinate with different functional teams to implement models and monitor outcomes  Develop processes and tools to monitor and analyze model performance and data accuracy  Provide architectural support by building proof of concepts & prototypes  Stay current with emerging technologies and industry trends If you have any questions, please feel free to reach me via email or phone.Thank you,Amrutha Duddula  Lead Talent Acquisition SpecialistSoftware Technology Inc (STI)100 Overlook Center, Suite 200Princeton, NJ 08540Email:amrutha.duddula@stiorg.comPhone : 732-664-8807www.stiorg.comwww.linkedin.com/in/amruthad/"}