{"jobID": "2823474595", "jobLocation": "Ne_Jersey", "jobTitle": "2220 - Associate Scientist -", "companyRating": null, "companyInfo": {"Website": "www.futransolutions.com", "Headquarters": "Princeton, NJ", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Associate Scientist - Devens, Massachusetts - United StatesPrimary SkillsCE,monoclonal antibodies and recombinant proteins,Separation techniques (LC,iCE),immunoassays,Biologics Process Developmen,upstream and downstream biologics processing.OverviewAssociate Scientist - PROCESS DEVELOPMENT ANALYTICS Description: Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. And driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment.  The Associate Scientist will be responsible for supporting a variety of analytical activities within Biologics Process Development (PD). The role will involve supporting in-process analytical testing, delivering results within customer and project timelines, operation and automation of analytical methodologies on Tecan, assay harmonization activities within the network groups, and evaluation of new analytical technologies. The successful candidate will have excellent knowledge and working experience in immunoassays, LC, CE and Electrophoretic techniques. A good understanding of upstream and downstream process development activities is highly desirable.  This role will be located in Devens, MA. The role will provide Analytical support within PD. The candidate will work closely with PDA team members and Process Development to deliver quality analytical data in a timely manner. Responsibilities:Develop, transfer and evaluate bio-analytical techniques for monoclonal antibodies and recombinant proteins to support Process Development.Assay support of Biologics Process Development activitiesSeparation techniques (LC, CE, iCE) and immunoassays (including HCP, residual Protein A and other impurities) to support Biologics Process Development activitiesOperate and automate routine assays on a Tecan or similar automation platformsWork closely with Process Development to support analytical needs and engage in long-term collaboration.Follow written scientific methods and experimental protocols, documents results, authors and reviews summary reports.Run tests and trend assay performances across the Network sites.Review PD design of experiments study protocols.Support manufacturing site investigations as required.Qualifications: The successful candidate will have A degree in Biochemistry, Biotechnology, Analytical Chemistry or a related discipline.MS or BS with 1+ years relevant experience in Biotech or Pharmaceutical industry, preferably in a fully or partially automated lab environment.A strong background in the areas of analytical chemistry/biochemistry, with the emphasis on experience and in-depth working knowledge of LC (UV/FL/CAD/MS) (including SEC and Titer), Caliper, CE, iCE and immunoassays (e.g. HCP, rProtein A, and Insulin ELISAs).Working knowledge of design of experiments and factorial design.Familiarity with upstream and downstream biologics processing.Knowledge of cGMPs as applied to process development and scale up.Development experience for both early- and late-stage molecules is highly desired.Excellent communication and interpersonal skills.Works independently and collaborates with other groups. Deliver results in line with project and team objectives."}