{"jobID": "2822986914", "jobLocation": "Hopewell_NJ", "jobTitle": "Scientist, Bioassay Development/ Analytical Team Lead - Bioassay Center of Excellence", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Description: Bristol-Myers Squibb is the world leader in Biotherapeutics for Immuno-Oncology. The Bioassay Center of Excellence is the global center for biological potency assay development, biological characterization and clinical lot release. To enable the continuous expansion of our biologics pipeline, we are looking for experienced professionals passionate about bringing recombinant therapeutics to patients to address significant unmet medical need.  The Scientist, Bioassay Development/ Analytical Team Lead has the opportunity to drive state-of-the art potency assay development that supports the companys portfolio of preclinical and clinical- stage biologics. The role calls for close collaboration with early discovery groups, process sciences groups, internal analytical functions, as well as with Manufacturing Sciences and Technology and the Quality Control organization. The role also offers an opportunity for analytical project management in an Analytical Team Lead function for Biologics. Responsibilities:Directly accountable for bioassay development for early and late stage development programs, development of fit-for-purpose biological characterization assays, assay qualification/validation, and strong collaboration with stakeholders in partner organizations.Responsible for experimental design, execution, data review and analysis/interpretation, document writing, and contributing to sections of regulatory submissions.Participates in development of the analytical control strategy (as it relates to potency) and anticipates and addresses technical, regulatory, and other business needs.Generate and thoroughly document results, and maintain instrumentation in a GMP-compliant environmentInspires innovation and operational excellence and fosters a continuous learning environmentTranslate analytical strategy into actionable objectives, and anticipate and address technical, regulatory, and other business needsCoordination of multiple functional area objectives to achieve program technical and business goalsQualifications: PhD in immunology, cell biology, molecular biology or equivalent field.Typically 0-2+ years directly applicable experience in biopharmaceutical development.Exceptional non-PhD candidates with significant relevant experience may also be consideredStrong organizational, interpersonal and communication skillsFlexibility and creativityExperience in cell-based in-vitro assays functionally related to clinical mechanism of actionExperience in ELISAsBIACORE or FACS experience would be advantageousMethodical, detail oriented and committed to high-quality resultsAwareness of regulatory and compliance guidelinesProject management/coordination experience for CMC projects in Biologics would be advantageous"}