{"jobID": "2834097380", "jobLocation": "Austin_TX", "jobTitle": "Business Analyst (data Analytics)", "companyRating": null, "companyInfo": {"Website": "www.adaptivestack.com", "Headquarters": "Daytona Beach, FL", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Adaptivestack Technologies Inc. is looking for an Business Analyst to support Data Analytics programs at the Department of Veterans Affairs (VA) in Austin, TX.  In this role, as a Business Analyst you will exhibit a keen understanding of both business value and systems capabilities to successfully deliver modernization of core enterprise systems. Critical to success is the ability to provide detailed support and develop relationships as a trusted advisor to the client supporting their high visibility programs focused on data analytics, business intelligence, software systems modernization, COTS implementation services, and related change management for the Department of Veterans Affairs (VA) in Austin, TX (must work onsite).  The expertise should be in support of developing applications to support healthcare and financial applications. Expertise in Modeling and Simulation, Data Analytics, Business Intelligence, Healthcare and Financial Industries is a required qualification for Business Analysts. They must have experience and deep knowledge of business, functional and technical areas/disciplines and be able to conduct research on special areas. Must have experience with proposing new solutions to problems in the areas of their functional expertise. Must be able to work and analyze both independently and as part of a team.  Additionally, the Business Analyst will support for customer/solution engagements and lead efforts to define design blueprints. Facilitate requirements elaboration workshops to gain understanding of current state processes and technology, and from that map out a future state that includes improved process definition as well as best-practice architecture and implementation of required existing product integration or new technology solution. Business Analyst Key Responsibilities: Work with a variety of stakeholders to gather requirements, manage implementation and drive delivery of agile projects to include planning and facilitating requirements elaboration sessions, and documenting the output. Gathers, analyzes, and documents business requirements for electronic interface development. Support program and project roadmap development, planning, scheduling, execution and reporting â communicating value vs. risk tradeoffs in support of strategic decisionsSupport Strategic Planning and PresentationsResponsible for conducting research and analysis of operational practices and deficiencies as part of business process re-engineering (BPR) initiatives, as well as BPR activities that drive IT product feature development, consolidation and/or training solutionsProvide consultation on concurrent projects and serves as a specialist in most phases of systems analysis. Considers the business implications of the application of technology to the current and future business environment. Coordinate ad hoc PMO/EPMO requests in support of complex enterprise IT projects and PMO processesWork with internal customers to, document and strategize process improvements for current processesDeliver high-quality requirements specifications in specified formats that enable ease-of-use for the intended audience/cross functional team members.Business Analyst Day to Day activities:Work with internal and external teams to understand requirements, approach and solution. Comfortable moving between project delivery methodologies (Agile) adapting style to the requirements of the projectDevelop, maintain, and execute project plans and integrated schedulesCreate, execute, and update the project plan and schedules/sprintsProject management and Project controls support, meeting facilitation, action tracking, writing and presentation preparationSupport task prioritization and execution, identifying and ensuring dependencies and deliverables are metPlan, monitor, and report team accomplishments, risks and issuesProvide status reports and deliver presentations to leadership and project stakeholdersBusiness Analyst Required Skills:Bachelor's degree required, AND a minimum of 5 years equivalent work experience. 8 years of additional relevant experience may be substituted for education. Track and report project issues. Monitor progress and key milestones. Identify and mitigate risks and advise senior management about project opportunities and risks. Support project requirements, scope, and change management issues. Identify and support implementation of key process improvements to help the team work more efficientlySolve a wide range of difficult problems in imaginative and practical ways, using professional concepts and project management best practices. Identify and communicate situations where leadership intervention may be required. Coordinate project management activities and communications between internal/external partners, operations teams, IT and others. Provide project leadership to manage meeting facilitation, action tracking, writing, presentation preparation, and ot"}