{"jobID": "2818409011", "jobLocation": "Pontiac_MI", "jobTitle": "Controls Hardware Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.leecontracting.com", "Headquarters": "Pontiac, MI", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Lee Contracting, Inc. is dedicated to client satisfaction. We provide the highest quality design and implementation services available. Lee Contracting, Inc. is at the forefront of innovative changes in process manufacturing, plant optimization, business operations, and overall performance. Our staff is comprised of hardworking, dedicated and ambitious employees and we welcome candidates of the same stature to join and grow with our team!We are proud to offer our employees:Health Insurance401k (20% match)Competitive WagesCatered LunchOn-site GymPaid VacationPaid HolidaysESOP – Employee Stock Ownership PlanJob ResponsibilitiesThe Controls Hardware Engineer is responsible for completing jobs relating to machine controls on-time, under budget, and to the satisfaction of customer needsResponsible for working with multiple departments from concept through release phase, with accountability for project executionProvide technical support of external and internal customersAssist in the development of electrical and controls system design solutions based on engineering principles and involvement in presentation of the solution to the customerHelp resolve operational problems related to projects and minimize delays or unexpected cost increasesPerform electrical hardware design of customized solutions including manufacturing automation and safety systems.Monitor project workflow and support resources to ensure timely delivery of projects at or below the allotted budgetAnalyze project requirements and perform technical design calculations including electrical requirements, robotic safety standards, and motor controlsExcellent customer communication, leadership and teamwork skillsKnowledge of presses and press automation is a big plusJob RequirementsPrefer a bachelor s degree in related field, or equivalent professional experience.Minimum 3-years of controls experience with increasing responsibility and dutiesStrong knowledge of controls systems, including electrical and pneumatic system design and its application in automated industrial designs including specification of vision, power, sensor, inspection, communication systems. Experience with presses and press automation is a big plus.Must be proficient with AutoCAD. EPLAN design software experience is a plus.Must be able to create a full controls hardware design package including, magnetics, I/O sheets, cable diagrams, control panel layouts, pneumatic diagrams and a full set of controls bill of materials.Exceptional communication skills and ability to work effectively with cross functional teamsProficient with MS Office and Excel applicationsProficient with PLC platforms, including but not limited to, Allen Bradley, Siemens, RS Logix5000, and Legacy platformsTechnical aptitude and understanding of industrial equipment and machineryAbility to work 45 to 50 hours per weekThis job description reflects management s assignment of essential functions, and nothing in this herein restricts managements right to assign or reassign duties and responsibilities to this job at any time.No Phone Calls Please - Position Will Require A Background Check - Only Qualified Candidates Will Be Contacted"}