{"jobID": "2831921422", "jobLocation": "Reston_VA", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Genuent is hiring for a Data Analyst. This position would be a contract to hire opportunity located in Reston, VA. If this is something you might be interested in, please send your updated resume to Mike Sabo: MSabo@genuent.com  Per our client's specifications, candidates are required to be hourly W2 employees with our firm. US Citizens, Green Card holders and all other parties authorized to work in the US are encouraged to apply. We are unable to provide H1 visa sponsorship at this time. Job Description:Responsible for performing the daily operational tasks and ensuring the data quality of the data and reporting deliverables coming out of the team.Responsible for gathering and assessing business information needs and preparing requirements for reporting products.Performs various ad-hoc data analyses as required by the customers. Uses data mining and data analysis tools.Reviews and validates data loaded into the data aggregates for accuracy. Interacts with user community to produce reporting requirements.Provides technical consulting to users of the various data repositories and advises users on conflicts and inappropriate data usage.Responsible for prototyping and developing reporting solutions, preparing test scripts, and conducting tests.Maintains knowledge of software tools, languages, scripts, and shells that effectively support the data environment on premise and on the cloud.Possesses working knowledge of Relational Database Management Systems (RDBMS), data warehouse concepts and tools.Performs professional level work. Develops solutions requiring analysis and research.Responsible for critical work and/or complex projects performed within a broader technical and business context.Generate analyses and provide concise, insightful summaries from business questions.Use the most efficient business intelligence or data management tools to provision data, analyze data, identify and document gaps, and enable self- service.Monitor and analyze trends with particular emphasis on those impacted by new product releases, operational changes and new data collection techniques.Support analyses using existing and new data sources, of both internal and external origin, and position them to be incorporated into enterprise platformsIdentify existing reports and/or processes for automation opportunities.Understand the needs of internal and external information stakeholders and identify opportunities to meet those needs as the Clients data capabilities and systems advance.Execute plans to perform user acceptance testing and quality control essential to the deployment of reports and business information solutions.Any other related activities as assigned.Required Skills:Possesses at least 2 to 5 years of work experience as Data AnalystVery strong SQL coding skills.Experience with procedural SQL languages such as T-SQL or PL/SQL.Ability to deliver quality products in a fast-paced team-oriented unitStrong analytical skills with demonstrated experience providing information, reports and analyses from unstructured and vague business questions and problemsKnowledge of System Development Life CycleStrong organizational skills and the ability to prioritize projects and informationExcellent oral and written communication skills, willing to communicate with business users to clarify requirements.Preferred Skills:Some experience with and open to learning new cloud-based technologies such as AWS Redshift and Apache Spark. Some experience with Data Analysis languages such as R and SAS.Some experience with Tableau or similar reporting tools.Education/Certifications: Bachelor's Degree in a relevant field of work or equivalent work experience. Other Comments to Vendors: Please only send well screened resumes. Please ensure that the candidate has top notch complex SQL writing skills and excellent communication skills.  Unfortunately at this time, The Client is unable to provide sponsorship. All qualified candidates must be eligible for conversion without the need for sponsorship  Business Travel Required?  No"}