{"jobID": "2814029107", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Intelligence Analyst(BI)", "companyRating": null, "companyInfo": {"Website": "www.astreya.com", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Milestone Technologies, Taos, GDH Consulting"}, "estimatedSalary": null, "jobDescription": "Company: Astreya Partners are at the cusp of the new way of working. We provide IT services and Managed Performance to some of the most exciting companies on the planet. Our delivery model helps our clients be Positively productive by matching exceptional people to on-site teams delivering world class IT service. With engineers in over 30 countries and 70 cities around the world we are a truly global company working with truly global clients. Your Main Duties and Responsibilities:Development, management, and maintenance of DashboardsKPI/SLA/SLO developmentPerform Data analysis, scrubbing, and reconciliationPoint of contact for developing reporting, monitoring and analysis toolsReview and validate product team’s data as it is collectedOversee the deployment of data to the product teamsDevelop policies and procedures for the collection and analysis of dataAssist in the creation or discover new data procurement and processing programsAssist with Hardware operations, logistics, and procurement process development, optimization and automationCooperate with our IT department to deploy new tools as necessaryRecommend upgrades to tools that make it possible for us to leverage big data use casesMonitor analytics and metrics resultsConsult company data architect to initiate and maintain data deploymentImplement new data analysis methodologiesReview customer files to ensure integrity of data collection and utilizationPerform data profiling to identify and understand anomaliesQualificationsExcellent documentation, writing, organization and verbal communication skillsLanguages/Platforms/Tools: SQL and Google Apps script, Google Drive Apps, Microsoft Office Suite, BigQuerry, Tableau, Google Data StudioStrong Excel/Google Docs and Spreadsheet skillsProject management experience, especially AgileExcellent multi-tasking skills and ability to adapt to rapidly changing development projectsCapable of managing high pressure, short timelines and willingness to be flexibleHighly collaborativeMust have excellent critical thinking skillsNeeds to be resourceful and proactive when problem-solvingKnowledge of logistics terms, international distribution, and shipping is a plusWhat can Astreya offer you?Working with some of the biggest firms in the world as part of the Astreya delivery networkEmployment in the fast growing IT space providing you with brilliant career options for years to comeIntroduction to the new ways of working and awesome technologiesCareer paths to help you establish where you want to goA company-wide mentoring program to advise you along the wayOnline training courses through CBT-nuggets to upskill youPerformance management system to provide you with meaningful, actionable feedbackDedicated management to provide you with a point of leadership and careInternal promotion focus. We love to build people from within.Numerous on-the-job perksPeer RecognitionMarket competitive rates and benefits Astreya Partners, Inc. is an equal employment and affirmative action employer. We evaluate qualified applicants on merit and business needs and not on race, color, religion, creed, gender, sexual orientation, national origin, ancestry, age, disability, genetic information, marital status, veteran status or any other factor protected by law."}