{"jobID": "2813125530", "jobLocation": "Dallas_TX", "jobTitle": "Senior Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.thoughtworks.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Accenture"}, "estimatedSalary": "127000", "jobDescription": "ThoughtWorks is a global software consultancy, made up of around 4,500 passionate technologists across 15 countries. We specialize in strategy, portfolio management and product design, combined with digital engineering excellence. As a Sr/Principal Data Scientist Engineer, here's what we'll be looking for you to bring:  Depth of knowledge in advanced analytics methods, including statistical methods and machine learning algorithms. Ability to design effective experiments to solve business and social problems. Ability to select appropriate analytical techniques based on the characteristics of a problem. Programming skills in languages like R or Python. Understand how to harvest complex data from a variety of sources. Consulting skills and the ability to communicate complicated technical information to non-technical audiences.Other desirable skills include:knowledge and experience in any other software technologies.2+ years of post academic experience Heres what youll do: There's no typical day or engagement for our Data Scientist!  Create advanced analytics models using statistical and machine learning methods. Work with software developers and solutions designers to deliver analytics driven solutions. Interact with clients in a variety of domains, solving a spectrum of challenging problems. Strong stakeholder management and interaction experience at different levels Attend and represent ThoughtWorks at various conferences and public meetings. Apply an agile delivery process to the evolutionary creation of value from data. Apply a lean learning approach to analytics that leads to building the right solution. Regardless of what you do at ThoughtWorks, youll always have the opportunity to:  Think through hard problems, and work with a team to make them reality. Learn something new every day. Work in a dynamic, collaborative, transparent, non-hierarchical, and ego-free culture where your talent is valued over a role title Travel the world. Speak at conferences. Write blogs and books. Develop your career outside of the confines of a traditional career path by focusing on what youre passionate about rather than a predetermined one-size-fits-all plan Be part of a company with social and economic justice at the heart of its mission.Not quite ready to apply? Or maybe this isnt the right role for you?Thats OK, you can stay in touch with AccessThoughtWorks, our learning community (tick 'contact me about recruitment opportunities' to hear about jobs in the future).#LI-NA #LI-NA"}