{"jobID": "2761902987", "jobLocation": "Addison_TX", "jobTitle": "Sr Scientist Product Safety", "companyRating": "3.9", "companyInfo": {"Website": "www.marykay.com", "Headquarters": "Addison, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " JOB PURPOSE  With minimal guidance, designs and executes projects that evaluate the safety of Mary Kay Inc. products and/or ingredients prior to consumer use. Oversees in vitro safety testing. May oversee outside vendor testing or conduct clinical safety testing. Analyzes and interprets safety study results. ESSENTIAL DUTIES AND RESPONSIBILITIESSubstantiates the safety of cosmetic product formulas and/or ingredients. 30&Prepares summaries of product or ingredient safety substantiation for regulatory authorities. 15>Contracts and/or conducts clinical safety testing, such as patch testing, safety-in-use studies, sunscreen efficacy studies, and/or sensory irritation testing. Analyzes and interprets results. Writes reports when applicable. 15&Contracts in vitro safety studies. Analyzes and interprets results. 10&Reviews Safety Data Sheets (SDSs) for ingredients and/or prepares SDSs for Mary Kay Inc. products. 10>Reviews non-cosmetic consumer items for product safety and regulatory compliance. 5>May lead, coordinate or heavily contribute to specialized projects relevant to the Product Safety Department. 15> In addition to the above, incumbent is expected to meet the required competencies for this position as defined in the competency profile.  KNOWLEDGE, SKILLS AND ABILITIES  Education BS/MS/PhD degree in a Biological Science or equivalent applicable experience.  Experience 5/3/2 years of product safety or other applicable experience. Must have ability to apply standard scientific principles, concepts and techniques to design and execute projects to evaluate the safety of ingredients, products and other items. Experience in the interpretation of toxicological studies is necessary.Must have excellent oral and written communication skills.Must be able to manage multiple projects with minimal guidance.Domestic / International overnight travel required approximately 5> of work time.Must be able to lift a minimum weight of 5 pounds.Must be able to stand, sit and/or walk for extended periods of time."}