{"jobID": "2654796099", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Development Representative", "companyRating": null, "companyInfo": {"Website": "www.ujet.co", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who We AreUJET makes it simple for any company to provide intuitive, modern-day support. We eliminate the frustration of customer service while helping companies deliver amazing brand experiences. Our customers benefit from a best-in-class ROI and significantly improve operational efficiencies. We are backed by leading VCs.OpportunityAfter spending 2 years in stealth mode, UJET has developed a disruptive enterprise-ready platform, and is looking to grow our go-to-market sales team. This isnt your typical account development position - youll be getting in on the ground floor, and have a tremendous opportunity to collaborate with multiple areas of the business (marketing, product, and the executive team), build foundational processes for a fast-growing sales team, and establish relationships with upper-management at our enterprise client companies. At UJET, we are results and merit driven - we are looking for highly-ambitious individuals that want to advance their sales career. This role will provide the potential to quickly move to a mid-market account executive or business development management role within 9-12 months. Responsibilities Perform industry, company, and persona-based research to identify best targets for UJETs technologyGenerate a strong outbound sales pipeline through phone, email, LinkedIn, and in-person at tradeshows and executive eventsBe the first point of contact for inbound leads and serve as the initial touch-point for any commercial conversationsWork closely with tenured sales, marketing, product, and executive teams to curate product messaging and go-to-market strategyQualificationsPrevious full-time or internship sales experience (preferably in high-tech/SaaS company)Tenacity - positive energy and drive to perform in a competitive team environmentEager to continuously refine skill set and conduct high-level conversations with senior executivesAbility to write crisp, targeted messages that convey our value proposition to prospectsStrong problem solving, organizational and time-management skillsBA/BS equivalentCompensationMarket leading OTE, uncapped with accelerators, extra commission for closed deals"}