{"jobID": "2829267417", "jobLocation": "Beverly_Hills_CA", "jobTitle": "Data Content Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.nbcuni.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1906", "Type": " Company - Public (CMCSA) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " **Job Number** 41305BR**Job Title** Data Content Analyst**Business Segment** Filmed Entertainment Group**Sub-Business** Film Fandango**Posting Category** Digital Media**About Us** At Fandango, we love movies. From showtimes and ticketing, to engaging content and innovations in movie going- we strive to deliver the perfect movie going experience?anytime, anywhere. And to be the go-to destination for moviegoers, we think it?s all about collaboration. Anyone can build a website or app, but it takes a special group across many disciplines to create an experience that can live across multiple platforms and connected devices. Thanks to an exceptional team, we?re working hard to make Fandango a little bit better every day. Our 30 million (and growing!) online and mobile monthly visitors can now buy movie tickets at over 25,000 screens nationwide and stay for exclusive trailers, our award-winning original video series, movie reviews, celebrity interviews and more. So, if you?re looking to inspire, be inspired and work at the intersection of entertainment and technology look no further than Fandango. Visit Fandango.com/careers for a behind-the-scenes look at Fandango and follow us on LinkedIn for the latest news and updates. Fandango is an NBCUniversal Company.**Country** United States**State** California**City** Beverly Hills**Responsibilities****Qualifications/Requirements**? BS or MS in Computer Science, Math, Physics, Engineering, or related quantitative field? 3+ years of quantitative or statistical analysis experience? Ability to initiate and drive projects to completion with minimal guidance? Ability to communicate the results of analyses in a clear and effective manner? Ability to use web analytics tools (Adobe Analytics, Google etc.) to generate actionable insights? Basic understanding of statistical analysis or machine learning (e.g. classification & clustering techniques, regression modeling, etc.)? Very strong proficiency with SQL? Proficiency with at least one of the following tools: Python, R, SAS? Self-starter and self-motivated with the proven ability to multi-task and deliver results in a fast-paced, high-energy environment? Works effectively both independently and as a member of a cross functional team? Must be available and willing to work extended hours as occasionally needed including weekends and holidays, to meet business needs? Able to exercise discretion and keep strictest levels of confidentiality? Must maintain regular and acceptable attendance at such level as is determined at the company?s sole discretion**Desired Characteristics**? Experience analyzing user behavior across digital, consumer-facing products (e.g. gaming, e-commerce, etc.)? Experience with AWS Redshift/S3, Apache Spark? Working knowledge of digital media, film, and e-commerce industries? Experience with experiment design and execution (e.g. A/B, multivariate testing)**Notices**NBCUniversal?s policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law. NBCUniversal will consider for employment qualified applicants with criminal histories in a manner consistent with relevant legal requirements, including the City of Los Angeles Fair Chance Initiative For Hiring Ordinance, where applicable."}