{"jobID": "2732031636", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Backend Engineer - Generalist", "companyRating": "4.8", "companyInfo": {"Website": "www.infoscout.co", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Nielsen, IRI, NPD"}, "estimatedSalary": "136000", "jobDescription": " InfoScout is looking for a passionate engineer with a deep desire to learn and excited around building web applications from the ground-up.  The ideal candidate for this role is comfortable across the stack knowing their way around server-side web frameworks, leveraging relational databases to get the job done, tweaking web servers, building cross-device UX & building scalable APIs in Python (or other web languages). We believe that mobile/web experiences are the future, and we're building a team that has deep engineering experience to take on some of the most ambitious projects.  To help accomplish this goal, you will have the environment to execute on your vision, the tools you need to rapidly iterate through your ideas and a dedicated team to help make you and your work better. In addition to writing quality software, we're looking for individuals who also enjoy the other aspects of building a new company: designing features, making good product decisions, programming at all levels of the stack, and the wearing of many hats. BS or MS in Computer Science or equivalent work experienceExperience with server-side development, especially PythonSolid understanding of REST and building scalable APIsSolid understanding of writing SQL and transactional databases (MySQL, Postgres)Experience developing, releasing, and supporting backend codeExperience with multithreaded programmingExcellent problem solving, critical thinking, and communication skillsExceptional candidates will have:High proficiency in pythonExperience working with modern web frameworks (Django, Tornado)Familiarity with message oriented architectures (Celery, RabbitMQ)Deployed environments in Amazon Web ServicesExperience working with high traffic web or mobile applications"}