{"jobID": "2817745182", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Data Engineer", "companyRating": "4.7", "companyInfo": {"Website": "www.afiahealth.com", "Headquarters": "Ann Arbor, MI", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " As a Data Engineer, you will become a key member of the Data Analytics team at Afia. This role will be responsible for the technical design, development and maintenance of the data warehouse, ETL processes, databases, and reporting and analytic applications for our customers. Additionally, the Data Engineer will translate our clients' objectives and requirements into robust Data Warehouse/Business Intelligence solutions that are scalable and address current needs while remaining flexible and extensible to adapt to future needs and requirements.  You will be advocating the power of data concepts and working with cross - functional teams to craft actionable insight across core business lines. You will identify skill and knowledge gaps needed to solve business problems and provide hands on machine learning experience solving major healthcare challenges.  We are looking for someone who is passionate about asking and answering questions utilizing large structured and unstructured data. It is critical to have exceptional interpersonal skills and the ability to make complex concepts simple and easy to understand. At Afia, our vision is that every healthcare decision will be powered by data in order to drive personalized, comprehensive care. * This position will be based out of our office in Ann Arbor, MIOther ResponsibilitiesPartner with clients, clinicians, data stewards, and other business and technology leaders to frame problem definition and influence solutionsRespect best practices for data creating and managing the data extraction, transformation and loading (ETL) frameworkCollaborate on plans for data collection, data analysis, and the project management processSupport development and validation required throughout the entire life-cycle of the data warehousing and business intelligence systemsDevelop data architecture, data modeling, and ETL mapping solutionsDesign and build Data Warehouse structures (databases and OLAP cubes)Lead exploratory data analysis, generate and test working hypotheses to uncover interesting trends and relationshipsMonitor the data warehouse and business intelligence system performance and integrity, and provide corrective and preventative maintenance as requiredRequirementsBachelor’s degree in business, finance, information technology, computer science, statistics, mathematics, analytics, related field or equivalent combination of education and experience.Minimum two years’ experience in data architecture and data modeling is required.Ability to work independently and exercise a high degree of independent judgment; demonstrated self-starterDeep experience in extracting, cleaning, preparing and modeling dataExperience with command-line scripting, data structures, and algorithmsWork with large amounts of data on a granular level, from structured and unstructured data sourcesExperience building enterprise-level ETL approaches with SSIS or other toolsPreferred QualificationsExperience working in an Agile Software Development environmentExperience with Microsoft SSISExperience with business intelligence tools such as SisenseExperience with healthcare dataExperience with behavioral health dataWho we Are We are a healthcare consulting firm based in Ann Arbor that works with organizations across the country to optimize healthcare delivery by deeply understanding their needs, implementing the best solutions to their problems, and checking whether they made a difference. The Perks We provide our employees with benefits including: medical coverage with employer paid deductible, dental benefits, 401(k) with a 3% employer contribution, paid vacation time, sick time, parental leave, adoption leave, and a flexible work atmosphere."}