{"jobID": "1827597765", "jobLocation": "Brea_CA", "jobTitle": "Lead Business Intelligence Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.avianaglobal.com", "Headquarters": "Brea, CA", "Size": "1 to 50 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " OpenSymmetry, Perficient, DataClarity"}, "estimatedSalary": "99000", "jobDescription": "DUTIES: Responsible for design, development and implementation of Business Intelligence solutions which includes all phases of the BI and IT systems development life cycle. Create data warehouse/ data mart/ Operational Data Source (ODS) databases. Create Metadata Models for enabling users for analysis to address a business problem. Review ETL scripts/ workflows/ schedules to load data into data warehouses, data marts, Operational Data Sources (ODS). Learn new software tools required for the job and update knowledge about emerging industry or technology trends. Create information communication procedures to be used by Aviana and clients during project execution. Develop applications, systems to ensure adequate security in analytical solutions. Document operational procedures or run books for maintaining the analytical applications. Guiding, Directing, and Motivating junior team members — Providing guidance and direction to junior team members in a project team, including setting performance standards and monitoring performance of up to 3 junior developers. Coordinating the Work and Activities of Others — getting members of a group to work together to accomplish tasks. Establishing and Maintaining Interpersonal Relationships — developing constructive and cooperative working relationships with others, and maintaining them over time. Review Jr. Developers work such as Dashboards, reports for quality assurance and establish technical support applications and maintenance process. Create work estimations and task level planning and deliverables for junior team members and clients.REQUIREMENTS: Bachelor’s degree in Computer Science, Computer Applications or related and 5 years of experience as Programmer Analyst, Software Engineer, Sr. Business Intelligence Developer or related.Special Requirements: SQL Server, Cognos, Crystal Reports, Oracle.WORK LOCATION:915 W. Imperial Highway, Brea, CA 92821. Position requires travel to various unanticipated client locations throughout the U.S. with expenses paid by employer.How to apply:Mail resumes to Aviana Global Technologies Inc.,Attn. L. Nastasi 915 W. Imperial Highway, Suite 100, Brea, CA 92821 Apply Now »"}