{"jobID": "2831455405", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst III", "companyRating": null, "companyInfo": {"Website": "www.techead.com", "Headquarters": "Richmond, VA", "Size": "51 to 200 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Aquent, Randstad, The Creative Group"}, "estimatedSalary": null, "jobDescription": "Follow TECHEAD on LinkedIn for the latest news, updates and job postings! Or visit us at www.TECHEAD.com to learn more!TECHEAD|10949|KO DATA ANALYST III MCLEAN, VIRGINIA - CONTRACT ROLE1-year contract (potential for extension conversion depending on project need)Must sit in McLeanTECHEAD is seeking a DATA ANALYST III to join our team. As a DATA ANALYST III your tasks will include but may not be limited to:Partner with consumers, business SMEs, and source system teams to analyze, internalize and translate business requirements and source data to develop:data requirements for upstream source systemssource to target mappingdata quality requirementsprocessing requirements (business rules, aggregation, transformation)user acceptance test casesnegative test scenarios Responsible for the design, development, and administration of transactional and analytical data constructs/structures and associated documentationIncluded in those responsibilities are the areas of data access and delivery technologies. Includes expertise in data quality, data organization, metadata, and data profiling. May provide technical support for data warehouse teams. Data set sizes are usually huge (in excess of hundreds of millions of records).Demonstrated ability to move from one sequential assignment to the next (work environment and priorities can change quickly depending on business needs).Demonstrated ability to move data between production systems and across multiple platforms Experience with major querying tools desired Ability to communicate strategies and processes around data modeling and architecture to cross functional groups and senior levelsAbility to influence multiple levels on highly technical issues and challengesStrong Agile, CI/CD delivery knowledge, and training and/or practical experienceEXPERIENCE: 5+ years experience with Financial Services clientsDesired business knowledge: familiar with regulatory rules, such as DLCR, 2052a, and NSFR, as well as Treasury productsDesired Common skill sets: Oracle, VB and UNIX 5+ years experience OLAP/SQL Tools, 5+ yrs experience with Teradata, AWSNice to have skill sets: Python, and experience with Oracle OFSAATECHEAD's mission is to make our on-site associates successful by placing them in the right environment so they can grow and prosper. How we treat and respond to our clients and employees is a reflection of who we are and makes us stand out from the rest. Keeping our business focused on building and maintaining relationships with our employees and clients is the key to our success. We won’t strive for anything less.TECHEAD provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. For more information on TECHEAD please visit www.techead.com. No second parties will be accepted."}