{"jobID": "2811557071", "jobLocation": "Washington_DC", "jobTitle": "Senior Strategist", "companyRating": "3.2", "companyInfo": {"Website": "www.yr.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Leo Burnett, BBDO, McCann Worldgroup"}, "estimatedSalary": "82000", "jobDescription": " OverviewThe Brief: The Senior Strategist turns Truths into Action and is a creative problem-solver; extracting novel and provocative insights from the brand, people and world around them. The Senior Strategist is responsible for impacting creative production via highly strategic insights and creative ideas.Responsibilities Seek out and gains knowledge of consumer preferences and relationships to ensure that the voice of the customer is integrated into communication strategyEnsure consumer relevance of the brand communication strategyFormulate, evolve and debate a POVDevelop creative briefs and provides clear persuasive briefings to Creative teamsDirect research that will aid in the consumer insight gathering and strategic planning processCreative problem solving in a modern marketing contextDistill and synthesizing qualitative/quantitative informationEstablish and maintain substantial and influential relationships with client senior managementSound understanding & application of agency (and client) tools – BAV, eXploring, etc.Interprets and monitors cultural and social trends relevant to client business and competitive landscapeBe prepared for other tasks as you may be assigned QualificationsWe’d love it if you:Have a Bachelor’s degree in related field; advanced degree a plusHave 5 or more years of related experience with at least two years of managerial experienceHave a deep knowledge of relevant product categories and strategic insights into consumer behaviorHave outstanding verbal and written communications skillsAre able to present ideas clearly and conciselyHave strong knowledge of primary and secondary research methodology, both qualitative and quantitativeAre a compelling story teller who is engaging with both the client and internal agency teams/partnersHave a comprehensive understanding of marketing practices and brand theoryAre an avid consumer of popular culture and creative artsWhat else you can expect: We’ve got a competitive benefits and compensation package, with vacation time that grows as you grow with us. We’re a global boutique, and as such, we have access to global discounts, perks, and offers.  We embrace diversity at Y&R.; In fact, we celebrate it. We have different backgrounds. Passports. Genders. Orientations. Beliefs. We have different skills, ambitions and talents. We’re fresh out of school and we have years of experience. We’ve come back from serving our country. We’re returning after starting our families.  We are inclusive. Full stop. Diversity enriches our culture, enhances our worldview and makes us better partners to our clients and better citizens of the world. Our differences add up to a stronger whole, because it takes all kinds of people to build all kinds of brands. We are Y&R.; And we Resist the Usual. Y&R; is an equal opportunity and affirmative action employer. Minority/Female/Veteran/Individuals with Disabilities/Sexual Orientation/Gender Identity. https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf  https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf"}