{"jobID": "2757697126", "jobLocation": "Arlington_VA", "jobTitle": "Research Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.cna.org", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1942", "Type": " Nonprofit Organization", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "125000", "jobDescription": " Job Title Research Scientist Organizational Unit CNA Corporation -> The Center Location Corporate - Arlington, VA 22201 US (Primary) Division Summary Job DescriptionCNA's Data Science Team brings data science expertise and support to the Department of the Navy. The team develops advanced analytics and algorithms, including machine learning and predictive analytics, that could have a transformative impact on the Navy’s competitiveness. Research Scientists have some relevant research experience and an increasing ability to operate independently. They typically lead smaller and/or less complex projects, playing a critical role as a team member on projects with specific technical/scientific expertise, or operating as a field rep. Scientists are expected to consistently produce high quality analysis. Research Scientists in the Data Science Team work on projects to help the Department of the Navy and other government agencies develop advanced analytics and algorithms for systems, sensors, networks, and platforms to ensure America’s defense in the 21st century. Scientists will learn CNA's unique approach to analytics that combines an understanding of the technical capabilities with insights gained from up close and current experience with real-world military operations.  1 Develop and apply creative and innovative analytic solutions to complex problems with assistance/support from more senior staff. Play a supporting role in the mentoring and training of new staff individually or as a member of a project team.  2 Develop and maintain deep, specific institutional knowledge and expertise of primary clients/sponsors; their culture, organization, and issues. Use that knowledge to support training & mentoring of new staff, to support on-going work, and to support development and shaping of new work for existing clients/ sponsors.  3 Support business development efforts and/or marketing activities by interacting with CNA managers and current clients/sponsors on securing follow on work (e.g., small grants, or above core projects), expanding or developing new ideas for future projects, and occasionally working with potential clients/sponsors on developing new project ideas. Occasionally serve as internal reviewer of technical proposals.  4 Interact regularly and independently with clients/sponsors and related parties. Typically interact at the \"peer equivalent\" level, and have some level of interaction at senior level. Effectively represent CNA as an organization.  5 Influence decisions by sponsors/ clients; provide sponsors/clients with implementable recommendations. Occasionally support efforts to enhance CNA's reputation via publishing and outreach activities.  6 Summarize and synthesize larger pieces of work into effective executive summaries/executive briefings. Effectively present work to more senior and larger audiences. Effectively communicate with & engage colleagues at all levels of the organization.  7 Work under limited direction and general supervision from division management. Lead projects of low to medium size and/or complexity, as well as significant tasks on large or more complex projects. Effectively manage all assigned projects, to include delivery of high-quality analytic products on-time, and on-budget.  8 Help train/mentor less experienced team members, and support other staff on projects as required. Regularly demonstrate initiative in pursuing improvements in the quality of our projects and analytic products. Participate in corporate initiatives when asked to do so, and make contributions to initiatives focused on making CNA a better place to work.  9 Perform other duties as assigned. Job Requirements1 Education: Minimum Master’s degree in a relevant field or equivalent experience, PhD preferred.  2 Experience: Typical minimum requirements 5+ years of experience in research and analysis.  3 Skills: Skilled in programming, statistics, machine learning, machine learning, and data visualization Ability to work on progressively more difficult projects/analyses, including directing portions of large research projects or small to medium projects under general supervision; Ability to operate independently and proactively in the execution of assignments; Ability to work in a multi-disciplinary environment; Strong critical thinking skills; Knowledge of research techniques; Strong planning and organizational skills; Excellent interpersonal skills; Strong and effective oral and written communication skills; Ability to interact directly and effectively with clients and influence their decisions.  4 Other: Ability to obtain and maintain an Active Secret Security Clearance. Job Family Research Requisition # CER00446.33 CNA is committed to providing equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, religion, color, sex (including pregnancy, gender identity, and sexual orientation), parental status, national origin, age, disability, family medical history or genetic information, political affiliation, military service, or other non-merit based factors. In addition to federal legal requirements, CNA complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. These protections extend to all terms and conditions of employment, including recruiting and hiring practices, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training and career development programs. For more information about EEO protections, please view the EEO is the Law poster. To be considered for hire, all individuals applying for positions with CNA are subject to a background investigation. For positions requiring access to classified information, U.S. citizenship is required. Individuals will also be subject to an additional government background investigation, and continued employment eligibility is contingent upon the ability to obtain and maintain an active security clearance."}