{"jobID": "2816412743", "jobLocation": "Southfield_MI", "jobTitle": "Data Analytics Manager (153017) with HRU Tech", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Are you someone who enjoys designing,  developing and implementing business intelligence solutions, then look no  further! As a global consulting, management and engineering services  company, we develop and implement innovative solutions to todays complex  technology challenges and industry changes that help our clients succeed at  every stage.  As a Data Analytics Manager, you will  work closely with our data engineers to help our customers solve complex  problems by analyzing terabytes of data. By taking initiative, you will help  drive technical prototypes and proofs of concept. This will include  understanding current client needs, identifying solutions, organizing a  strategy around customer outcomes and delivering value back to our  clients. A  Day in the Life: ·  Conduct  business development in the areas of data analytics and business intelligence  ·  Jointly  define data solutions with stakeholders by providing support and developing  project/solution proposals  ·  Manage the  global data delivery team for data visualization, processing and advanced  analytics related to projects working with terabytes of data  ·  Assist  data engineers in defining and implementing business use cases for new services  ·  Collaborate  with executive team to develop data practice competencies and growth  strategies What  You Have: ·  Masters  Degree in Computer Science, Engineering, Mathematics, or a related field is  preferred  ·  8+ years  of Data Analytics or IT implementation project experience is required  ·  4+ years  of experience using data platforms such as cloud and on-prem solutions  ·  Experience  with all data analytics (SAS, Hadoop, SPSS, SQL, Python and R), visualization  (Tableau, Power BI, Qlikview, etc.) and ETL solutions/software (SQL, RDBMS,  Cloudera, Mongo DB, etc.)  ·  2+ years  managing a Data Analytics Team or IT project is required  ·  Previous  business related or business development experience  ·  Automotive  industry experience is a must  ·  Strong  communication skills with the ability to initiate high level discussions with  the client What  you might also need: (optional/if applicable)  ·  Preferably  automotive IoT architecture and solution experience  ·  Displays  an entrepreneurial mindset and has the ability to work independently or within  a team  ·  Demonstrates  the ability to think critically and understand complex processes"}