{"jobID": "2832059652", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Analyst, Marketing", "companyRating": "4.8", "companyInfo": {"Website": "www.education.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " We are looking for an experienced data analyst for our Marketing team to develop analyses and insights that drive our marketing programs and investments. As a critical member of the team, you will work closely with SEO, Performance, CRM/Retention and Brand teams to propose hypotheses and drive strategic decisions across all of our marketing efforts. You should be well-versed in cutting edge analyses across attribution modeling, LTV, segmentation and lifecycle / cohort analysis. The ideal candidate has a passion for leveraging large scale data analysis to drive business impact.  Education.com is dedicated to helping children ages 3 to 12 learn core skills to succeed in school. We have over 16 million members – including both parents and teachers – who are responsible for over 100 million children worldwide. We are cash-flow profitable and growing quickly. Join our fun-loving, fast-moving team! Responsibilities:Ensure that we understand the value of our marketing activities across the funnel, including traffic acquisition, member conversion and retentionDevelop frameworks, reports and processes to ensure that data-driven insights drive our key business decisionsWork with Marketing leads to create growth hypotheses and iteratively design, execute, and interpret tests on a continuous basisEffectively communicate and evangelize business insights across Marketing, Product, Engineering and executives to drive business decisionsDevelop a deep understanding of our customer segments and their engagement patternsActively partner with Engineering & Data to optimize data capture, KPI definitions and reporting designBe a key contributor to marketing strategy by helping the team understand long term implications of marketing programsQualifications:3-7 years of experience in a large-data, high-frequency, multi-channel marketing environmentOutstanding communication skills and attention to detailHighly self-motivated to drive with a bias toward execution. Orientation to use analysis to drive to the “so what”High comfort driving insights with incomplete dataUnderstanding of attribution, cohort, segmentation, conversion, and path analysisExpertise writing complex SQL queries. Experience with scripting languages preferredExperience with data visualization and creating and maintaining reportsConsumer digital and subscription experience preferredPassion for improving educationPerks:Full medical, dental, and vision insurance401k with matchingOpen Vacation policyTransportation stipendShort walk to CaltrainDog-friendly officeYoga and Meditation twice per weekFully-stocked kitchen with snacks and drinksHappy hours, field trips, and team-building eventsVibrant downtown with great restaurantsEducation.com’s Team Culture Our platform has a powerful impact on people’s lives across the U.S. and the world. Education.com has grown organically to be a top U.S. education site- and we have done this while cultivating a company culture that we are very proud of. We take work-life balance seriously, and encourage mental and physical health through onsite yoga and meditation in office twice a week. Every team member is encouraged to come up with and contribute to project ideas. We love to learn and grow through employee-led tech talks and sponsored classes. All of this in our two modern, dog-friendly open offices in downtown San Mateo, California. We believe in teamwork and communication, and we believe in each other—every team member should have the confidence and flexibility to take a stab at new projects across the site. The products we make have a direct impact on millions of people. It's nice to feel good about the work you do. Come join us! Location: San Mateo, CA (Downtown near CalTrain)"}