{"jobID": "2731220342", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst, Business Initiatives", "companyRating": null, "companyInfo": {"Website": "www.alliedbenefit.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Data AnalystFLSA Status: Exempt Job Status: Full Time Reports To: Director Business  Initiatives Positions  Supervised: NoneWork Schedule: 40 HoursPOSITION SUMMARY:The purpose of this position is to assist with  various projects. The role will also act as a support function to assist the  Director of Business Initiatives to pilot and execute new processes or  improvements across all departments. The  Data Analyst will write and maintain process documents.ESSENTIAL FUNCTIONSCreate new automation tools to assist with  workflow.Assist in implementation of automation  processesWork on converting existing database tables  from Access to SQLMapping and documentation of files, queries,  tables and new procedures.Project Management  AssistanceTesting and support in project work.Creates custom reports using Excel, VBA and  accessReviews and addresses file data errors in  databases for ASO Finance.Develops recommendations for improvements to  existing systems and/or processesPOSITION QUALIFICATIONS Communication –  Communicates effectively both internally and externally, where applicable. Includes both written and verbal  communication.  Customer  Focus – Works well with customers/clients both internal and external, promotes  a positive image of the company and department, strives to resolve issues  raised by customers/clients.  Ethics  – Honest, accountable, and maintains confidentiality.  Initiative – Acts  independently, seeks new opportunities, and strives to see projects to  completion.  Innovation  – Creative, offers new ideas, risk taker and amenable to change.  Interpersonal Skills –  Builds strong relationships, is flexible/adaptable, works well with others, and  solicits feedback.  Job Knowledge –  Understands the facets of job, aware of duties and responsibilities, and keeps  job knowledge current.  Problem Solving –  Strives to understand contributing factors, works to resolve complex  situations.  Productivity – Manages  workload, works efficiently, and meets goals and objectives.  Quality – Strives to  eliminate errors, accurate work is a priority, seeks opportunities to improve  product/services  Self-Development –  Looks for opportunities to increase knowledge, works to increase responsibility,  strives to achieve personal goals and/or maintains licenses and other pertinent  requirements.  Teamwork – Accountable  to team, works to meet established deliverables, appreciates view of team  members, and respectful.  Technical Skills –  Maintains current understanding of technical process/equipment, uses technology  to increase performance/productivity; effectively uses online tools and  resources. Education Bachelor's degree (B.  A. or B. S.) from four-year College or University; or related experience and/or  training; or equivalent combination of education and experience. Experience Must have 2 years’ experience with Access and VBA. SKILLS & ABILITIES:  Proficiency in Microsoft Access  Proficiency in Microsoft VBA  SQL Knowledge a plus but not required  Ability to multi task  Intermediate Word  Outlook Certificates &  Licenses N/A Other Requirements N/A PHYSICAL DEMANDS: Sitting at computer for a good portion of the day. WORK ENVIRONMENT: Office Environment in Chicago high rise building"}