{"jobID": "2779006662", "jobLocation": "Atlantic_City_NJ", "jobTitle": "Clinical Bioinformatics Field Application Scientist", "companyRating": null, "companyInfo": {"Website": "www.qiagen.com", "Headquarters": "Hilden, Germany", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (QGEN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Apply with LinkedInPosition Description  This is an exciting field-based position in QIAGEN’s Clinical Genomics group that allows you to interact directly with a wide range of researchers and clinicians. You will work to support the implementation of NGS data analysis workflows and the decision support of sequence variants for clinical variant reporting.  You will work strategically with a dynamic team that involves Sales, Marketing, Customer Support, R&D; teams, and other Field Application Scientist teams to engage prospective hospital and NGS clinical test providers and dramatically change genetic testing with QIAGEN’s software solutions, QCI-Analyze and QCI-Interpret.  The responsibilities for this position focus on: Analysis of NGS example sequence data, variant calling and variant interpretation using QIAGEN’s Clinical Insight software.Delivering pre-sales product demonstrations and training workshops to clinical scientists and lab directors.Gathering customer requirements and project manage the software implementation of QIAGEN’s NGS clinical informatics solutions.  Position RequirementsEducation Required:Master’s Degree with experience in clinical genetics.Doctorate Degree (PhD) or equivalent, in molecular biology or genetics.Experience in clinical genetic molecular biology is highly desired.Experience with hands-on clinical NGS data analysis, highly desired.Other Requirements:This is a field-based role and candidates may experience travel periods up to 60%, although average travel percentage will be much less.Deliver scientific workshops on defined case studies to showcase the value and effectiveness of clinical software applications within the context of the prospect or customer's NGS workflow.Leverage deep scientific knowledge to identify customer challenges and map them to QIAGEN’s NGS and PHC products and services.Engage in scientific discussions with customers and cultivate relationships.Onboard new users from NGS product evaluation throughout the evaluation period.Develop the NGS clinical informatics workflow implementation from contract to successful completion.  Personal RequirementsExperience with precision medicine, clinical reporting, and/or companion diagnostics.Involvement working directly with clinicians and/or physicians in a support, consulting, or related role.Experience with and/or certified in regulatory environments such as CLIA, HIPAA, Safe-Harbor, ACGS, or other EMEA human genetics regulation is a plus.Fluency in English is a must.Experience with Next Generation Sequencing technologies and applications.The ability to use Bioinformatics software programs to analyze and Interpret NGS data in a translational and clinical setting.Demonstrated excellent written, presentation, and verbal skills including strong public speaking experience.Excellent interpersonal and relationship-building skills.Aptitude for understanding, communicating, and training scientific concepts, applications and methods.Evidence of strong analytical and problem solving skills.Ability to multitask a variety of assignments and proven ability to meet strict deadlines.Ability to be flexible and creative, and work in a fast-paced, high-growth environment.Fast, self-starter with the ability to handle and manage multiple tasks in a result-orientated commercial environment.Excellent project and network management skills and strong organizational skills.  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}