{"jobID": "2823923816", "jobLocation": "San_Francisco_CA", "jobTitle": "Area Manager - Northern California", "companyRating": null, "companyInfo": {"Website": "www.packsize.com", "Headquarters": "Salt Lake City, UT", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB DESCRIPTION: Area Sales Manager - Northern CA AreaPacksize International is looking for an Area Sales Manager to join our team as we develop innovative solutions to revolutionize a trillion-dollar industry. The position is full-time and based in Northern CA covering to central California.Job Summary:Packsize is a disruptive, fast-growth pioneer in the On Demand Packaging space. We are ferociously focused on Sustainability, Saving Forests, and lowering the Carbon Footprint of our Client Partners. Imagine a world where every box shipped downstream in a supply chain is exactly the right size for the product inside it. We arm our customers with the technology to do exactly that. As leaders in the technology space, we serve as a critical ally to companies looking to right size their packaging.We are looking for a motivated, rare-breed, self-starter to work as an Area Sales Manager who will be responsible for closing new Packsize accounts within a defined geography as well as growing business within current customers assigned. This is a high speed, technical sales position with tremendous responsibility and huge upside. This position will report to a Sales Area Director and will be responsible for all sales activities from prospecting through to close. In addition, you will develop and implement an agreed upon area plan which will meet the business goals of increasing sales to the customer base and improving customer satisfaction. The Area Sales Manager will also responsible for growing account profitability and hitting all sales targets on an ongoing basis.Essential Duties and Responsibilities:Oversee proposals, negotiate terms and conditions, and implement contractual agreements with accountability for delivering strong financial results.Conduct sales meetings to diagnose a prospects internal processes and evaluate if on demand packaging would be a solution for them.Proactively reach out to new prospects to set up initial meetings and/or presentations.Develop a deep understanding of customer needs, selling change and providing a diagnostic solution.Coordinate activities in support of the sales process including internal sales engineers, and interface with customers internal team.Close a determined amount of new business per year, primarily defined in revenue generatedGrow current account base a determined amount per year, primarily defined in additional revenue generated.Experience and Education Required:Bachelors Degree in marketing or business related field required, MBA preferred3-5 years successful track record in a complex selling environment to C-Level executivesQualifications(including Knowledge, Skills & Abilities):"}