{"jobID": "2722414049", "jobLocation": "Los_Angeles_CA", "jobTitle": "Computer Scientist - Artificial Intelligence", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "137000", "jobDescription": " The Information Sciences Institute (ISI) is home to over 100 researchers in artificial intelligence who carry out world-class research in a collaborative, academic environment. ISI is part of the University of Southern California (USC) and a sister to USC’s Computer Science Department, Electrical Engineering Department, and others in the Viterbi School of Engineering.  ISI scientists have the opportunity to spend the majority of their time doing the research they love. Projects are critically accelerated by research programmers and students at all levels, and USC/ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina del Rey, CA, one in Arlington, VA, and one in Waltham, MA. This position is located in Marina del Rey, CA The successful computer scientist candidate will be capable of generating research ideas and solutions to complex computer science problems, providing research support on problems of diverse scope, and executing research projects in collaboration with others. Applies computer science and other scientific principles and concepts in planning, coordinating and executing research objectives. Contributes to state-of-the-art technology and theories. Solves a wide range of research problems. Creates or modifies methods and techniques for obtaining solutions. Writes articles for publication. Interacts with peers. Makes presentations at conferences, and participates in workshops and collaborates in specific areas of research.  ISI welcomes applications from computer scientists in any of the following areas:  • Information Extraction  • Semantic Web  • Biomedical data integration and knowledge engineering  • Intersection of Neuroscience and Computing  • Information Integration  • Interactive Knowledge Capture  • Semantic eScience  • Machine Translation  • Natural Language Processing  • Robotics  • Social networks and Social Media Analytics  • Machine learning  • Data Science  The University of Southern California values diversity, and is committed to equal opportunity in employment.Minimum Education: Master's degree, Combined experience/education as substitute for minimum education  Minimum Experience: 3 years  Minimum Field of Expertise: Knowledge of research processes and computer science."}