{"jobID": "2659333654", "jobLocation": "Shelby_Township_MI", "jobTitle": "Driver, Parts - Part-time | Macomb", "companyRating": null, "companyInfo": {"Website": "www.michigancat.com", "Headquarters": "Novi, MI", "Size": "501 to 1000 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Alta Equipment"}, "estimatedSalary": null, "jobDescription": " ObjectiveMichigan CAT's Parts Drivers perform the important task of transporting parts required for service across a designated region safely, and in a timely manner.  The schedule for this position is Monday to Friday, 6:30AM to 11:30AM.ResponsibilitiesYour responsibilities will include, but may not be limited to the following: Operation of a motor vehicle to deliver parts to designated locations, on assigned schedulesMaintaining truck in a good condition for daily usageHelping loading and unloading of trucksCorrespond with Field Supervisor, Service Supervisor, Product Support Manager, Parts Department, and Customer to ensure full understanding of your location, as well as keeping information up to date as to where you are due nextEnsuring road safety at all timesSupport in Parts Department clean upQualificationsMust possess a valid Chauffeur's License, or a clean driving record to be able to get a Chauffuer's License prior to first day in the positionAbility to operate GPS application or to read a mapMust be able to work well in a group/teamA DOT Medical Card would be a benefitDisclaimer Any Duties and Responsibilities described within the Careers Page are not a comprehensive list, and the scope of the job may change as necessitated by business demands. Michigan CAT is an Equal Opportunity Employer Qualified applicants will receive consideration for employment without regards to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, or protected veteran status.  Equal Employment Opportunity is the Law  Equal Employment Opportunity is the Law – Poster Supplement"}