{"jobID": "2779742785", "jobLocation": "Fort_Sam_Houston_TX", "jobTitle": "Laboratory Staff Scientist", "companyRating": null, "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Updated: TodayJob ID: 213946Status: Full-TimeRegular/Temporary: RegularLocation: Ft. Sam Houston, TX, United StatesJoin the HJF Team! The Henry M. Jackson Foundation (HJF) is looking for a Laboratory Staff Scientistto support research and program objectives of the U.S. Army Institute of Surgical Research (USAISR) located on Fort Sam Houston. USAISR is dedicated to both laboratory and clinical trauma research. Research efforts will involve investigation of improved methods of hemorrhage control and hemostasis at the point of injury to treat severe bleeding, and to optimize far-forward physiologic resuscitation strategies for prolonged field care. This position will support research protocols within the Coagulation and Blood Research (CBR) Task Area. It will plan, conduct and coordinate the research of diagnostics and therapeutics to treat the Coagulopathy of Trauma, support resuscitation of critically injured patients, and mitigate multi-organ failure with safe and effective blood products and cellular therapies far forward of fixed medical facilities. ESSENTIAL JOB DUTIES: Support efforts to provide requirements driven innovations in combat casualty care to advance medical care for injured services members. Provide laboratory research to satisfy mission support requirements Collect and record experimental data, to include extensive use of computers and hemodynamic monitoring instruments, as well as creating and implementing new databases for new protocols. Perform data entry and database maintenance and manipulation. Perform appropriate statistical computations on raw data, and to be able to use software: Excel, Word, PowerPoint, JMP, Sigma Plot/Stat, and GraphPad Prism to organize and analyze data. Prepare photography, graphics, and image production, for study presentations and publications. Participate in interpretation of results and prepares manuscripts, reports, and presentations for publication. Maintain current knowledge of developments in the field of trauma, critical care and hemorrhagic shock research, and transfusion medicine. Culture a variety of cell types/lines under various environmental conditions. Assist others (lab assistants and postdoctoral associates) on the use of these procedures. Maintain experimental data in organized notebooks and electronic files. Participate in interpretation of results and prepares manuscripts, reports, and presentations for publication.Minimum Education/Training Requirements: Ph.D. in related scientific discipline with a minimum of 2 - 4 years of experience of related research experience Design and conduct studies optimizing platelet storage conditions (cold storage, additive solutions, and collection methodologies) to extend shelf life while preserving efficacy as assessed by endothelial interactions, aggregation profiles and biochemical, molecular, and metabolic characteristics.The Henry M. Jackson Foundation for the Advancement of Military Medicine, Inc. (HJF) is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or other status protected by law. Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Director of Human Resources."}