{"jobID": "2707341598", "jobLocation": "Los_Angeles_CA", "jobTitle": "Director of Data Science & Analytics", "companyRating": null, "companyInfo": {"Website": "www.beyondcurious.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Opportunity: Director of Data Science & Analytics  The BeyondCurious Director of Data Science & Analytics is responsible for orchestrating and delivering large, complex data science solutions for our enterprise clients. Working in tandem with internal multidisciplinary teams, external clients and partners, you will be responsible for delivering research driven, strategic solutions that challenge existing digital boundaries, introduce the latest technologies suitable for true, digital innovation and creating immediate impact and business value for our clients. The role will entail delivering advanced analytics and cognitive type solutions that will create value for our clients and help them gain a competitive advantage. Who is the Director of Data Science & Analytics? The BeyondCurious Director of Data Science & Analytics brings a dual competency of business and technology expertise to develop analytics-based solutions that create value for our wide range of clients including Fortune 500 brands in various industries. Working at the intersection of business and technology, you will help to build holistic solutions for clients across the analytics spectrum, from descriptive, predictive, prescriptive to cognitive, leveraging artificial intelligence and machine learning.  You are equipped with deep technical expertise across data discovery and analysis as well as mathematical modeling and coding to drive unique and strategic business insights. You are a well-seasoned strategic leader with the proven ability to effectively manage a successful team while building strong, long lasting relationships with clients.  You have the stamina to lead large and complex engagements to help our clients address their business imperatives. A results-driven, growth-minded individual with an entrepreneurial mindset, you will support the company to further build the practice and our offerings through regular thought leadership creation and best practice development.  You will be a leader, helping to build a rapidly growing company that is working with Fortune 500 companies to accelerate digital transformation of their business models, capabilities, customer experiences, and cultures. What is required of you?Travel: 80% to 100% (typically Monday through Thursday)Minimum 8 years of experience working on statistical modeling and machine learning algorithms for supervised/unsupervised learning with very large data setsMinimum 5 years of experience managing teams effectively including planning and structuring work, facilitating team workshops, and developing analytics-based solutionsMinimum 5 years of experience developing commercial solutions in Python, Scala, or RMinimum 5 years of experience developing commercial data science solutions leveraging one or more of the following: operations research, natural language processing, machine learning, deep learning, video/image analysis, or time-series analysisPassion for for being part of a fast-growing business that is changing the way companies think about digital transformationEnsuring and providing quality solutions that yield happy clients, and a thriving teamBuild, inspire, and nurture a strong, client-focused teamSupport and develop team members for optimal performance and growthPlay a role in the company vision-embody company values in voice and actionTeam player-even if it’s outside of your roleKnowledge/Skills/Abilities:Advanced Degree (PhD preferred) in Computer Science, Mathematics, Statistics, or other related field with emphasis in quantitative methodsExpertise with data analysis languages and tools such as Python, R SAS or SPSSStrong experience of open source big data technologies such as Spark, Hadoop, and RedisStrong knowledge of machine-learning/computational packages, e.g. numpy, scipy, and pandasKnowledge of cloud technologies, such as AWS, Azure, and/or Google Cloud.Hands-on experience constructing and manipulating JSON and XML documents and working with NoSQL databases such as MangoDB and CouchDBProven ability to work creatively and analytically in a problem-solving environmentExcellent written and oral communication, as well as interpersonal skillsExcellent leadership and management skillsBroad, diverse experience and knowledge of major technologies, legacy to emergingLeadership capabilities to attract, hire, motivate, and mentor high performance teamsWhat you can expect from BeyondCurious:Autonomy to define success and the ability to blaze your own trail for the good of clientsA responsive leadership team that will provide support and guidanceHigh caliber internal team that demands quality and client satisfactionHealthy and collaborative relationships with internal team, clients and partnersTurn-key operational support to manage the business and clientsCentralized marketing and sales support to grow the businessCollaborative and accessible cloud-based tools for internal and client needsHow is success measured?By company goals and objectives (Revenue, Profit, Utilization)By client happiness and measured by NPS (Net Promoter Score)By the team’s pride in the work they do every day and measured by PIP (Pride In Product)About BeyondCurious We make elephants run!  BeyondCurious helps large organizations accelerate digital transformation through breakthrough strategies, intelligent customer experiences and agile digital capabilities. BeyondCurious is a catalyst that unlocks innovation and growth, delivering clarity of purpose and certainty of outcomes. Our award winning portfolio includes work with leading brands such as Toyota, Lexus, Sonos, Kaiser, Emerson and Miami Heat. Learn more at BeyondCurious.com."}