{"jobID": "2835226644", "jobLocation": "Pasadena_CA", "jobTitle": "Speech Recognition Research Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.idealab.com", "Headquarters": "Pasadena, CA", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "Position at ObenObENSpeech Recognition Research ScientistAbout Oben:Founded in 2014, ObEN is an artificial intelligence company based in one of the world’s most successful incubators: Idealab in Pasadena, CA. We have developed a sophisticated speech technology that allows any Internet of Things to speak in any voice and in any language. Know more about ObEN: https://goo.gl/gxpxwT Your responsibilities: As a Speech Recognition Research Scientist at ObEN, you’ll be working on several proprietary and stealthy projects in the audio space. Your work will encompass the whole scope of application development, including speech research, voice interface design, application prototyping, and development of our proprietary speech recognition engine.  Currently, we are mainly interested in candidates with experience in ASR for Chinese language. Experience in English and/or Spanish is a big plus. You must have:PhD in Computer Science, Electrical Engineering or Mathematics with specialization in speech recognition, natural language processing or machine learning.Solid experience building ASR systems (Chinese) and/or a publication record in the area.Solid experience with Kaldi.Strong machine learning background and familiar with standard statistical modeling techniques applied to speech.Familiarity with linguistic phonetics.Proficiency in programming languages such as C/C++, Python, Java or Perl.Knowledge of basic digital signal processing techniques for audio.Enjoys a highly collaborative environment.Application Requirements:Detailed resumeLinks to any research/papers you have been an instrumental part of and are proud ofName of instructor/adviser, if any, along with link to their profileCover Letter identifying your five favorite apps on your phone"}