{"jobID": "2760398172", "jobLocation": "Rockville_MD", "jobTitle": "(Senior) Biologics Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.usp.org", "Headquarters": "Rockville, MD", "Size": "1001 to 5000 employees", "Founded": " 1820", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": " This is a hands-on, non-supervisory role that serves as the liaison between the biopharmaceutical industry, regulatory agencies, USP departments and USP Expert Committees. The Liaison facilitates the development of the USP documentary standards and reference standards used by the global pharmaceutical industry. In this role, the incumbent will provide expertise, leadership, and guidance to USP Expert Committees and Expert Panels by facilitating the exchange of highly technical information and working collaboratively to improve and promote public health. Roles and Responsibilities:Oversees and facilitates the development of standards and solutions to address analytical challenges associated with the next generation of biological medicines.Develop relationships and partnerships with key stakeholders, within the research, manufacturing and regulatory communitiesWrites general and specific subject correspondence pertaining to documentary standards, reference materials, and various USP policy issues. Evaluates and analyzes scientific reports and supporting validation data, and translates specifications and test methods into USP documentary standards.Plans and oversees necessary laboratory work for method development and verification, and reference standard evaluations as needed.Communicates and maintains working relationships with other USP departments regarding projects related to validation studies, methods development, reference standards, and other cross-cutting activities.Keeps abreast of current trends and developments in related scientific fields, particularly in the area of gene-editing for cell and gene therapy, therapeutic peptides and proteinsResponds to stakeholder inquiries pertaining to USP-NF documentary and reference standardsServes as representative of USP at professional scientific meetings organized by USP and other organizations. Gives public presentations on USP matters (as assigned).Prepares standards proposals and provides assistance, as needed, for the USP Expert Committees and Expert Panels of the Council of Experts – e.g, helps with the development of monograph proposals for decision, provides requested background information and coordinates laboratory work, as needed.Designs and oversees the execution of collaborative testing, once a candidate material has been sourced. Prepares data summary and analysis from collaborative studies.Develops reference standard candidate evaluation packages. Coordinates and submits candidate package to the approving expert committee.Basic Qualifications Science & Standards Liaison:  Ph.D. degree in Biochemistry, Biology, Pharmacy, or a related field and eight (8) years, or M.S. degree and ten (10) years of relevant experience in analytical development for biotherapeutics that includes at least 5 years in a regulated biopharmaceutical environment.  Senior Science & Standards Liaison:  Ph.D. degree in Biochemistry, Biology, Pharmacy, or a related field and ten (10) years, or M.S. degree and twelve (12) years of relevant experience in analytical development for biotherapeutics that includes at least 5 years in a regulated biopharmaceutical environment.  An equivalent combination of experience and education may be substituted. Preferred QualificationsExperience with reference materials development is a plus.Experience with pharmaceutical and biotechnology product development. Specific areas of interest recombinant therapeutic proteins and peptides.Experience with reference materials development.Ability to write technical reports related to material characterization, references standard evaluations, and method development.Experience in method development and characterization of products and impurities using a variety of physicochemical techniques and biological assaysKnowledge of the pharmaceutical industry and the associated regulatory framework is essential.Knowledge of national and international regulatory filings approaches. Familiarity with regulatory guidance documents from WHO, FDA, ICH and other international organizations.Able to establish and nurture relationships with individuals of varying backgrounds and learning styles.Able to operate independently where appropriate, yet understands when to escalate issues and how to establish effective working relationships.Strong presentation and communication skills (written and oral).Well-developed organizational, interpersonal communications, negotiation, writing, and strong listening skills.Practical experience in scientific, analytical techniques.Project Management skills. Must have ability to prioritize and manage multiple, concurrent projects with often long life cycles.Must be able to share technical information with non-technical or non-scientific staff, and to communicate effectively with representatives from pharmaceutical companies, government, and academic institutions. Ability to persuade corporations to collaborate with USP on various projects.Experience with, and knowledge of the USP-NF is preferred.Supervisory Responsibilities None  USP offers an impressive benefits package, including: Generous paid time off – 13 paid holidays, 10 sick days and 15 vacation days per year to startAn annual 401(k) contribution, beginning after 1 year of service, of 10% of pay (base and bonus) every pay period that vests immediatelyComprehensive individual and family healthcare plans with affordable premiums and low annual deductibles ($250/individual or $500/family) The U.S. Pharmacopeial Convention (USP) is a scientific nonprofit organization that sets standards for the identity, strength, quality, and purity of medicines, food ingredients, and dietary supplements manufactured, distributed and consumed worldwide. USP’s drug standards are enforceable in the United States by the Food and Drug Administration, and these standards are used in more than 140 countries.  Being a part of USP means belonging to a diverse culture made up of more than 1,000 talented professionals working together at five international locations. We share our expertise in science, IT, human resources, quality assurance, communications, administrative management, and more...all to support an overall mission dedicated to making a difference by providing standards and programs that help improve the quality of medicines, dietary supplements, and foods worldwide.  USP is proud to be an equal employment opportunity employer (EEOE) and affirmative action employer. Employment selection and related decisions are made without regard to sex, race, age, disability, religion, national origin, color, veteran status, sexual orientation, gender identity or any other protected class. We are committed to working with and providing reasonable accommodation to individuals with disabilities.  USP does not accept unsolicited resumes from 3rd party recruitment agencies and is not responsible for fees from recruiters or other agencies except under specific written agreement with USP.Required Skills Required Experience Job Location  Rockville, US-MD "}