{"jobID": "2815889895", "jobLocation": "Parsippany_NJ", "jobTitle": "Health Economics Modeling Scientist - REMOTE OPPORTUNITY!", "companyRating": null, "companyInfo": {"Website": "www.pelotonadvantage.com", "Headquarters": "Parsippany, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview: Peloton Advantage, LLC, is an industry-leading medical communications company located in Parsippany, NJ. Our medical and account teams provide strategic support to pharmaceutical company clients and produce high-quality journal articles, abstracts, posters, supplements, slide presentations, monographs, and other educational materials. Department Overview: The HEOR – Value Evidence Generation department is charged with designing, developing and/or conducting HEOR and real-world data (RWD) studies, models and analyses, strategic insights, abstracts/posters/publications and value communications tools throughout the product lifecycle with the goal of providing clients and their stakeholders with high-quality HEOR data to support decision-making. Position Overview: The Health Economics Modeling Scientist will have competencies in creating cost-effectiveness/utility models, budget impact models and disease transmission models using various approaches including, but not limited to, Decision Analysis, Markov Modeling and/or Discrete Event Simulation. The Health Economics Modeling Scientist will have proven abilities in model conceptualization and design using industry standard software (e.g., TreeAge), identification of health states, transition probabilities, expected outcomes (costs, life-years, QALYs, net cost, etc.), running the “base-case” and appropriate one-way, n-way and probabilistic sensitivity analyses and ensuring overall consistency and alignment with current methodological standards and recommendations of leading HTA agencies and Value Frameworks.  Whenever necessary, the Health Economics Modeling Scientist may be asked to serve as an external Subject Matter Expert (SME) from the department at client or industry meetings. The position is a Contractor position with the potential to evolve into a fulltime opportunity.Specific Duties, Activities, and Responsibilities:Lead all aspects of health economic models from conceptualization through model planning, model development, analysis and ultimately dissemination of results at scientific congresses and in peer-reviewed journalsCollaborate and partner on health economic models with external Scientific Leaders (SLs), Academic Research Organizations (AROs) and client HEOR TeamsProvide internal inter-departmental education on health economic modeling methodologies and techniques to improve proficiency in this area across teamsWork closely with writing staff to ensure accurate, high-quality, on-target messaging derived from the health economic modelsDevelop health economic modeling solutions for account team(s) based on product lifecycleServe as a role model for others with respect to professionalism and personal productivityProvide health economic modeling services to assigned accountsAttend status meetings as necessaryComply with company standardsProcure and maintain appropriate travel documentationMaintain consistent attendanceMaintain timely submission of time sheetsPosition Requirements: Education or Equivalent (minimum required to perform job): A doctoral degree in Health Economics, Health Services Research, Biostatistics, Epidemiology, Public Health or other comparable health-related area with a focus on economic modelingKnowledge/Skills Requirements:3+ years of relevant work experienceProven track record of developing high-impact health economic modelsExperience with writing health economic modeling plans and model user-guidesAbility to fully interpret and communicate all model results including sensitivity analysesKnowledgeable in newer and evolving methodologies such as multiple criteria decision analysis (MCDA)Ability to function as the Subject Matter Expert (SME) within the company with regard to health economic modelsExcellent collaboration and communication skills with internal and external stakeholders, collaborators and partnersAbility to meet deadlines while working on multiple parallel projectsAbility to work independently as well as in a team structure Business Environment:  Position is Remote  Hours 8:30am – 5pm  Travel: up to 20% domestic and/or international (including periodic travel to New Jersey HQ site and/or client sites)"}