{"jobID": "2799510364", "jobLocation": "Los_Angeles_CA", "jobTitle": "ALM Data and Modeling Analyst, Associate", "companyRating": "2.9", "companyInfo": {"Website": "www.mufg.jp", "Headquarters": "CHIYODA-KU, Japan", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (MTU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "Discover your opportunity with Mitsubishi UFJ Financial Group (MUFG), the 5th largest financial group in the world with total assets of over $2.4 trillion (as ranked by SNL Financial, April 2016) and 140,000 colleagues in nearly 50 countries. In the U.S., we're 13,000 strong, working together to positively impact every customer, organization, and community we serve. We achieve this by delivering on our values, putting people first, fostering long-term relationships built on honesty and mutual understanding, and inspiring the best in each other. This is all part of our inclusive, high-performing culture supported by Total Rewards that include our cash balance pension plan. Join a team that's working to fulfill its vision to be the world's most trusted financial group.Job Summary:Reporting to the Director of Asset Liability Modeling, the ALM Data and Modeling Analyst will primarily focus on the generation and extraction of data used in the systems measuring Interest Rate Risk (IRR). The data is also leveraged for periodic stress testing (CCAR and DFAST) and other risk measurements. In addition, the position will own the data governance and documentation as well as assist / support with ALM production activities.The position performs work that bridges financial and technical disciplines, is complex and varied by nature and includes a significant amount of attention to detail and flexibility to support management and regulatory reporting.Major Responsibilities:Own, manage and develop data processes associated the extraction of large data setsDemonstrate financial acumen by assisting with Interest Rate Risk related analysisContribute to the increased usage of the ALM framework through custom data compilation and extraction solutionsOwn the governance and documentation surrounding these processesWork with associated stakeholders to ensure processes meet and exceed bank standardsPartner with model developers / implementers to develop custom data extraction solutionsDevelop a deep understanding of the Bank's balance sheet and individual product characteristicsWork with management to craft strategies in the mitigation of Interest Rate Risk and other riskDemonstrate outstanding management, communication and presentation skillsBachelor's or Master's degree in Computer Science, Financial Engineering, Finance, Economics, Accounting, Mathematics or related disciplineExperience with Financial Database Systems such SQL Server or Oracle. Hyperion and SQL preferred1-3 year's work experience in a data and / or financial analysis capacity is highly preferredKnowledge and understanding of a bank's balance sheet and individual financial instruments and regulatory requirements is preferredCFA / FRM a plusKnowledge of MS Office Suite (emphasis on Excel, Word, PowerPoint and Visio) requiredQRM Enterprise Risk Framework experience desiredKnowledge of Python and VBA programming languages preferredThe above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified.We are proud to be an Equal Opportunity/Affirmative Action Employer and committed to leveraging the diverse backgrounds, perspectives and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate in employment decisions on the basis of any protected category.A conviction is not an absolute bar to employment. Factors such as the age of the offense, evidence of rehabilitation, seriousness of violation, and job relatedness are considered in all employment decisions. Additionally, it's the bank's policy to only inquire into a candidate's criminal history after an offer has been made. Federal law prohibits banks from employing individuals who have been convicted of, or received a pretrial diversion for, certain offenses."}