{"jobID": "2763853746", "jobLocation": "Washington_DC", "jobTitle": "Data Migration Analyst", "companyRating": null, "companyInfo": {"Website": "www.grantthornton.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1924", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Deloitte, KPMG"}, "estimatedSalary": null, "jobDescription": " Grant Thornton is seeking an Associate to join its Financial Management service line and take an active role in engagement execution, project management and key business development activities.  Grant Thornton Public Sector helps executives and managers at all levels of government maximize their performance and efficiency in the face of ever tightening budgets and increased demand for services. We give clients creative, cost-effective solutions that enhance their acquisition, financial, human capital, information technology, data analytics, and performance management. For more information, visit grantthornton.com/publicsector.  At Grant Thornton, our professional staff applies traditional, cutting-edge approaches and methods to a variety of analyses. As part of our team, the Associate will utilize various methodologies and models to execute client projects. ESSENTIAL DUTIES:Support migration of data from the legacy financial system application to the future financial system. The data migration process is divided into two parts extraction/transformation and loading.Anticipates at least (2) additional full mock/test data migration loads and several limited tests will be performed.Provide data migration support for tasks leading up to, and following, transition to the designated financial solution.Reviewing the existing Data Migration Strategy, recommend modifications (if required) and deliver an updated Data Migration Strategy document incorporating agreed upon changes.Support validation of extracted/transformed data by stakeholders and manage the plan prior to delivery of data for any mock migration or cutover activity based on the Test Plan.Meet or exceed targeted billing hours (utilization).Assist with business development activities, such as proposals, capture, account teams, whitepapers, conferences, and/or other thought leadership materials.Core development skills that include PL/SQL, SQL, UNIX/Linux, use of FND utilities, SQL*Loader, Oracle Application framework.The data migration analyst shall possess both functional and strong technical knowledge and shall have experience in one or more technology disciplines.Should have prior experience performing data conversion tasks, SQL test scripting, sampling for a Federal financial system implementation project.Two to five (2-5) years of work experience in Data with 1 or more technologies (BI, DA, DW, ETL, DBA, Data Conversion, SQL).Experience migrating/converting data from legacy applications to a new target application environment.Experience performing data conversion tasks for a Federal financial system implementation project that includes source applications (e.g., Oracle Federal Financials (OFF) Release 11, PRISM, FMS,) and knowledge of target applications (e.g., Momentum, OFF Release 12 Federal Financials, and Oracle CLM.)Experience in conversion requirements gathering, data mapping, data cleansing, data source gap analysis, conversion specifications documentation, designing conversion components, developing conversion standards, development and execution of SQL-based scripts, functions, and/or packages to support data analysis, developing end-to-end conversion test plans, executing conversion test cases, documenting conversion results, tracking and resolving conversion defects, validation and auditability etc.Bachelor’s Degree required from an accredited college or university in a related field.Ability to obtain and maintain certain job-related certifications if no job-related advanced degrees.U.S. citizenship may be required. Ability to work in the United States indefinitely required.Travel may be required.Ability to work overtime required on occasion.Ability to sit in an office environment for long periods of time.Ability to obtain and maintain a security clearance.Ability to communicate clearly in writing and verbally.Ability to obtain and maintain firm independence and abide by firm ethics requirements.Meet or exceed continuing professional education (CPE) requirements. Grant Thornton LLP is the U.S. member firm of Grant Thornton International, one of the six global accounting, tax and business advisory organizations. Grant Thornton’s Public Sector, based in Alexandria, VA, is a global management consulting business with the mission of providing responsive and innovative financial, performance management and systems solutions to governments and international organizations. Visit Grant Thornton’s Public Sector at www.grantthornton.com/publicsector.  It is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law. "}