{"jobID": "2606089945", "jobLocation": "San_Francisco_CA", "jobTitle": "CONSULTANT– DATA SCIENCE GROUP", "companyRating": "4.2", "companyInfo": {"Website": "www.opiniondynamics.com", "Headquarters": "Waltham, MA", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " CONSULTANT– DATA SCIENCE GROUPOpinion Dynamics seeks a new team member to join our Data Science group at the Consultant level. The ideal candidate is someone who enjoys an analytical challenge, relishes learning new things, and is excited to work with a multidisciplinary team of engineers, statisticians, and social scientists. In this role, you will work with the Opinion Dynamics’ Data Science group and staff around the country to solve complex research and energy policy questions such as how to effectively measure the impact of energy efficiency or demand response programs on the electricity grid.ResponsibilitiesThe successful candidate for this position is detail-oriented with demonstrated professional experience cleaning and manipulating large datasets (50,000+ records) using one or more statistical packages (Stata, R, SPSS, SAS, SQL, etc.). He or she has experience performing statistical analysis and drawing appropriate, and actionable inferences from data. The successful candidate will have a demonstrated track-record of thinking critically about their work, applying their judgement within a context of accountability, and clearly communicating with other project staff and managers about their work. The candidate will also have good time-management skills and will be able to accomplish project work within budget- and timeline constraints. These skills will enable the Consultant to become an essential part of multiple project teams at Opinion Dynamics, helping to deliver high-quality, transparent analysis and associated reporting across an array of analytical contexts in the energy field.QualificationsWe are looking for candidates with demonstrated experience conducting statistical or econometric modeling, strong critical thinking skills, impeccable detail-orientation, and a commitment to conducting their work with the highest level of integrity. Applicants should also be able to work effectively independently, as well as in teams. Specific requirements for the position include: Bachelor’s degree, Master’s degree, or Ph.D. in statistics, quantitative methods in social science, political science, sociology or a related fieldTwo or more years’ work experience in data analysis, ideally evaluating energy efficiency programs and/or performing other forms of longitudinal data analysisExperience cleaning and manipulating large datasets (50,000+ records) using one or more statistical packages (Stata, R, SPSS, SAS, SQL, …) and drawing well-supported conclusionsStrong statistical analysis and modeling skills preferably using Stata or RDemonstrated interest in the energy field, energy policy, or building scienceStrong persuasive and analytical writing skillsStrong verbal communication skillsAbility to juggle and prioritize multiple tasks and deadlines simultaneously and flexiblyBeneficial:Strong programming skills in one or more programming languages (R, python, JAVA, SQL, go, Scala, etc.)Experience analyzing equipment metering data to calculate demand response impactsExperience with databases (Relational: MS SQL Server, PostgreSQL, MySQL, etc.; Non-relational data stores: HBASE, NoSQL, Riak, etc.)Coursework and/or direct work experience in sampling methods and design, survey instrument design, Bayesian statistical methods, non-parametric methods, multi-level modeling, causal analysisKnowledge of types of data file formats and how to import/processExperience with model validation techniquesExperience with machine learning methodsDemonstrated aptitude with data visualization tools and techniquesNetworking skills for making new client contacts at conferences and eventsAbout Opinion Dynamics Opinion Dynamics advances knowledge to address emerging energy and social issues through sound and insightful research. Our inter-disciplinary team of consultants provides actionable research to support the needs of our clients, which include electric and gas utilities, regulators, and stakeholders. Our research and consulting services inform program planning and design, performance assessment, and optimization of energy efficiency, demand response, and renewable energy programs. Our company fosters innovative thought, collegiality and growth opportunities for our employees. The Data Science Group within Opinion Dynamics is especially focused on technical, quantitative aspects of our analysis services. How To Apply: To be considered for this position, please submit your cover letter (required) and resume with “Data Science Consultant” in the subject line. If contacted, please be prepared to provide data analysis and writing samples that clearly demonstrate your experience and aptitude in the areas outlined above, as well as two or more references who can speak to your experience, work orientation, and work ethic.  To be considered for this position, please send your cover letter and resume to: Careers: Consultant- Data Science Group  careersCA@opiniondynamics.comPlease submit a cover letter and resume to CareersCA@opiniondynamics.com.  No phone calls, please. Only those resumes accompanied by a cover letter will be considered. Opinion Dynamics will not provide sponsorship for work authorization for this position. Opinion Dynamics is an affirmative action-equal opportunity employer."}