{"jobID": "2787845824", "jobLocation": "Washington_DC", "jobTitle": "Financial Audit and Internal Controls Analyst", "companyRating": null, "companyInfo": {"Website": "www.morganfranklin.com", "Headquarters": "Mc Lean, VA", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Why Work Here? One word: opportunity. Our professionals embrace our \"Own Your Career\" philosophy sustained growth means creating new opportunities for experienced consultants at all levels of our organization. What Will You Do?Lead walkthrough meetings with process owners.Document business processes in narrative and risk control matrix format, according to OMB A-123 requirements.Perform analysis of business processes to identify key risks and internal controls.Develop test plans and test controls for operating effectiveness.Provide suggestions to management leaders and external clients to improve client internal controls.Develop corrective action plans to address related findings.Lead the implementation of corrective action plans and remediation of accounting issues.Identify opportunities to improve client internal controls, accounting procedures, financial statement and overall operational efficiency.Examine, analyze, and interpret federal financial statements and supporting accounting records.Prepare presentations and briefings, and lead the delivery of client meetings and day-to-day interactions.Advise on the implementation or use of systems for recording costs or other financial and budgetary data.Maintain relationships and communicate with key client personnel to understand business operations, processes, and functions.What Do You Need to Succeed?Minimum QualificationsBachelor's degree in Accounting, Finance, Information Technology or Business Management.2+ years of experience supporting internal controls, auditing, or other federal financial management and accounting activitiesKnowledge and experience with OMB A-123 or Generally Accepted Government Auditing Standards (GAGAS)Experience using Microsoft Office programs.Professional services experience and/or specific relevant industry experience.Must be a U.S. citizen with ability to obtain security clearance.Willingness to travel up to 20% of the time.Preferred QualificationsCPA, PMP, CISA, CGFM or CDFM.Masters Degree in Accounting."}