{"jobID": "2647162902", "jobLocation": "Alameda_CA", "jobTitle": "Senior Data Analyst - Healthcare", "companyRating": "3.3", "companyInfo": {"Website": "www.ascent-sys.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Please contact Meera Makam at 925 627 4935 or email mmakam@ascentsg.com for any questions  ?The Senior Healthcare Data Analyst is responsible for supporting the analytic needs of the client.  ?This?position requires an in-depth understanding of healthcare data (e.g. member, claims, clinical and  provider data) and operations coupled with an extensive knowledge of large data set development,  quantitative data analysis methodology and analytical tools for reporting. Principal responsibilities include: ?Develop complex end-to-end reporting processes to support a variety of functions.  ?Lead special projects, lending data expertise and actionable insights. Examples include?operational, data warehouse, and third party projects.  ?Identify and support areas of analytical focus for the organization's service?delivery/performance and evaluation of potential areas of opportunity and risk.  ?Identify and communicate operational impact of analytical findings/decision support.  ?Create data sets, extract and synthesize data; conduct and interpret quantitative and?qualitative analyses.  ?Develop exception reporting and conduct drill-down analysis to proactively identify?specific variances in medical costs and utilization.  ?Generate a quality work product, presentable for content and audience, in a timely?manner while maintaining strong attention to detail.  ?Manage and prioritize workload while meeting deliverables and expectations. Skills: ?In-depth knowledge of healthcare principles and data.  ?Strong technical skills.  ?SQL, Access, Excel and reporting software knowledge required.  ?Experience in working with relational databases, large data sets and multiple data?sources required.  ?Experience with validating and auditing data.  ?Experience with Business Objects, PowerPoint, and healthcare transactional systems?preferred.  ?Ability to manage projects, tasks, and deadlines.  ?Ability to multi-task, effectively manage competing priorities and ambiguity is essential.  Please contact Meera Makam at 925 627 4935 or email mmakam@ascentsg.com for any questions ? Company Description:About Ascent:  Ascent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.  If you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}