{"jobID": "2831757133", "jobLocation": "Jersey_City_NJ", "jobTitle": "Sr. Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.fractalanalytics.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Opera Solutions, Mu Sigma, LatentView Analytics"}, "estimatedSalary": "129000", "jobDescription": " Position Description:  Fractal Analytics is a strategic partner to Fortune 500 companies and enables them to discover how they can leverage the data that they generate using advanced and sophisticated algorithms from Artificial Intelligence and Machine Learning. Additionally, the AI/ML group is also involved in creating a rich and diverse IP portfolio within Artificial Intelligence, Machine Learning and Big Data.  The AIML group is looking for Data Scientists with the capability to perform independent statistical and machine learning research/ projects. As a data scientist, you will be involved in using state-of-the-art machine learning algorithms to solve challenging high-impact business problems. If you are a problem solver with curiosity for exploring new techniques and technologies in the AIML space, then this is a right opportunity for you.  Job Responsibilities Ability to understand a problem statement and implement analytical solutions & techniques independently with proactive thought-leadershipWork and collaborate with other teams to deliver and create value for clientsFast learner: ability to learn and pick up a new language/tool/ platform quicklyConceptualize, design and deliver high-quality solutions and insightful analysisConduct research and data and requirements gathering; solution scoping and architecture; consulting clients and client facing teams on advanced statistical and machine learning problemsAbility to deliver AIML based solutions across a host of domains and problems, example: Customer Segmentation, Propensity Model, Churn Model, Lifetime Value Estimation, Forecast, Recommender Systems, Modeling Response to Incentives, Marketing Mix Optimization, Price OptimizationAbility to manage and groom team members, independent client handling and project management skillsImplementing machine learning algorithm using Big Data stack Experience Required: Expert level proficiency in at least one of R or PythonAbility to discover efficient solutions to complex problems and strong skills in data-structures and algorithmsExperience of handling a project end-to-end: problem scoping, data and requirement gathering, modelling, insights and visualizationProblem-solving: Ability to modularize the problem into and implement of relevant techniques to derive meaningful insightIntermediate to advanced knowledge of machine learning, probability theory, statistics and algorithmsExperience with 3 or more: Regression, Bayesian methods, tree-based learners, SVM, RF, XGBOOST, Time Series Modeling, Dimensionality Reduction, SEM, GLM, GLMM, Clustering Good to Have: Expertise in either deep learning, NLP, image processing or recommender systemsExperience of working in one or more domains: CPG, BFSI, Healthcare and TelecomExperience in working with Linux computing environment and use of command line tools like Sed/AwkExperience with databases including RDBMS, NoSQL, MongoDB etc. Education Qualification: PhD preferredB.Tech / M.Tech in Computer Science / Mathematics / Signal Processing or related fields from one of the premier Institutes Some of the attractive pluses of the job are: An opportunity to work with a world class team of talented data scientists with strong background in machine learning who are extremely passionate about solving real-world business problems across various domainsA chance to expand your skill-sets by learning and using advanced approaches in machine learning and data mining with real world datasetsA fast-paced work-environment where you are expected to be self-motivated and are measured on your performance"}