{"jobID": "2832000480", "jobLocation": "Oakland_CA", "jobTitle": "Marketing Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "80000", "jobDescription": " The Data Analytic Consultant provides support in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and reporting data. These positions function both as a consultant and as a high-level data analyst. The position works with clients to develop the right set of questions/hypotheses, using the appropriate tools/skills to derive the best information to address customer needs.  This position works with several internal and external datasets to analyze and report on membership and market trends. Primarily functions includes data processing, reporting, and analysis to be shared with senior leadership. This role requires a great attention to detail to ensure accuracy and strong communication skills to tell the story behind the data. The ideal candidate would have a passion for data and the ability to work independently to gather insight. Essential Responsibilities: Assists in issue identification and design of analytic approaches.  Employs specified analytical methods and tools to access data to provide reportable information from KP information systems.  Provides support and point of contact for department clients requesting routine information, data summaries and or reports.  Applies specified analytical methods including assessing the significance of observed changes, identifying associations among measured quantities, forecasting trends, etc.  Contributes to written reports and presentation materials describing project or task objectives, methods, data, and results.  Implements specified QA procedures to ensure accuracy of project data, results and written reports & presentation materials. Basic Qualifications: Experience  N/A Education Bachelor's degree in related field, OR four (4) years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A Additional Requirements: Some knowledge of policies, practices and systems.  Limited use and/or application of basic principles, theories, and concepts.  Limited knowledge of industry practices and standards.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: One (1) year of work experience. "}