{"jobID": "2821605400", "jobLocation": "Houston_TX", "jobTitle": "Sap Master Data Finance Process Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.bakerhughes.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (BHI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " The SAP Master Data Finance Process Analyst takes a lead role in evaluating, maintaining and improving efficiency of internal financial reporting processes. Project manages the development and implementation of new procedures, policies, and systems to simplify and improve internal reporting. Simulates and tests improvements. Researches and analyzes best practices. In depth knowledge of the fields concepts, practices and procedures.  Essential Responsibilities  Analyze current SAP Master Data GL settings and recommends improvements  Responsible for the quality of the SAP Master Data  SAP Master Data enhancement requests  SAP Master Data change management  Monthly Master Data testing  Master Data validation, master data quality, master data profiling activities  Interface with SAP end users on business specific reporting needs and requests.  Develop content and deliver SAP end user training.  Handle special projects as assigned  Qualifications/Requirements  Bachelors Degree in Accounting, Finance, or relevant discipline with 7+ years of experience in Finance Processes, Principles, and Practices or Masters Degree in Accounting, Finance, or relevant discipline with 5+ years of experience in a Finance Process, Principles, and Practices.  Intermediate to advanced level experience with SAP Organizationules (FI/CO Master Data Technical Settings)  Intermediate to advanced skills in MS Excel  Project management and presentation experience  Desired Characteristics  SAP BW experience is highly desirable  Working knowledge of data integration principles  Experience with SAP Plant and/or Materials Masters  Knowledge of Oil and Gas industry / Oilfield services  Intermediate to advanced skills in MS Access  Ability to interact with all levels of management  Excellent communication skills (verbal/written) in English  Strong attention to detail  Ability to collaborate, strong emphasis on teamwork, customer focused attitude  Strong analytical and leadership skills"}