{"jobID": "2833235051", "jobLocation": "Plano_TX", "jobTitle": "Sr Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.suddenlink.com", "Headquarters": "Tyler, TX", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " Overview  Altice USA (NYSE: ATUS) is one of the largest broadband communications and video services providers in the United States, delivering broadband, pay television, telephony services, proprietary content and advertising services to approximately 4.9 million Residential and Business customers across 21 states through its Optimum and Suddenlink brands.  From high-speed broadband and ultra-HD video, to digital advertising solutions, local news and voice offerings, we are making connections possible around the country -- to businesses, to consumers, to communities, to schools, to hospitals, and everyone in between. Responsibilities The Sr. Data Analyst acts as a point of contact between the Business Intelligence (BI) group and other functional groups within the company fully engaged in requirements gathering, preparing related documentation, user acceptance testing, data troubleshooting, and Excel ad hoc reporting.  The position will determine and address the BI plans, projects, and responsibilities to meet the goals and tactics of Operations functions or associated Business Planning. It will directly oversee, guide and coordinate Programmer Analysts and outside consultants, as well as have significant daily interaction with all levels of functional personnel served by BI (Consumer Operations, Product Management and Marketing, Sales). It supports the Key Operating Metrics System (KOMS) through application and report enhancement.  This role will require excellent analysis and understanding of BI reporting and business analysis as this team works very closely with our department's internal team to develop consolidated reporting packages, trend analysis and customer insights. Candidate must be able to communicate to both technical and non-technical team members as well with all levels of the organization.  This person will ensure compliance with all Company policies and Customer requirements. Qualifications Bachelor's Degree required. 3 or more years of experience performing Business Analysis or relevant work experience.Ability to develop action plan, business requirements, templates from first hand analysis communicating with business users and developers to ensure the prescribed finished product meets expectations in purpose, functionality, and timelines.Ability to work independently with high attention to detail, and focused on the timely completion of deliverables assigned.Excellent written and oral communication skills: comfortable and effective in small group and large group presentations. Compelling and accurate writing skills for presentations and email communication. Experience documenting software requirements and using project planning tools.Ability to manage and resolve conflict and drive / achieve business resultsCollaborative and self-starter. Proven ability to work cross functionally and individually with periodic supervision to achieve overall project objectives.Strong analytical and problem solving skills working with a high degree of ambiguity.Self-motivated and directed, with keen attention to detail; ability to prioritize and execute tasks in a high-pressure, deadline-driven environment.Solid understanding and application of Project Management methodologies.Ability to be flexible, follow tight deadlines, organize and prioritize workPower User of Excel. Power Pivot and Visio a plus.Experience with various reporting methods and query toolsExperience with technical project documentation (BRD, FSD)Experience with developing reports (Excel, SharePoint)Experience with SQL to query databasesExperience with BI Tool (ie.. Microstrategy, Tableau, Business Objects)Flexibility and cooperation regarding the filling-in for coworkers and the assistance to other coworkers when requiredKnowledge of Altice's business practices and/or industry is desirable. We are an Equal Opportunity Employer M/F/Disability/Vet and maintain a drug-free and smoke-free workplace.SDL2017"}