{"jobID": "2813377406", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist – RCMI Molecular Biology Core", "companyRating": "4.0", "companyInfo": {"Website": "www.tsu.edu", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1927", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Posting Details  Title Information Security Sensitive Position? YesHours of Work 8:00 AM - 5:00 PM M-F Position Details  Position Information Posting Number TSU201941Official TSU Title Research Scientist – RCMI Molecular Biology CoreGrant Title Research Scientist – RCMI Molecular Biology CoreJob Description Summary / TWC SummaryUnder limited supervision, plans, implements and administers the day-to-day operations of Molecular Biology core facility funded by RCMI program through NIMHD/NIH. Directs personnel and manages fiscal activities of the core facility to ensure goals of the facility are addressed through operational and administrative compliance with relevant institutional, federal and state regulations and guidelines.Essential Duties SummaryEstablishes plans, objectives, policies and procedures to achieve goals and deliver services consistent with program funding and University requirements and guidelines. Responsible for maintaining cell culture and molecular biology resources and instrumentation to provide cell culture and molecular biology support services to the Texas Southern University (TSU) research community. Responsible for developing new protocols and improving existing protocols and assisting research community in experimental design, resources and data analysis/interpretation with the help of the core director. Provides assistance to pilot projects, hands-on training and manages instrumentation for research use. Manages a detailed itemized budget of Pharmacology Core within program guidelines. Prepares requisitions, monitors receiving and oversees the budgeted expenditures. Conducts research, analyzes the data, publishes publications and seeks external funding. Assist the director in evaluating the program performance and effectiveness and makes necessary modifications in priorities, schedules and activities according to the suggestions of the Molecular Biology Core director and the RCMI program director/principal investigator. Coordinates participant recruitment based on established selection criteria and eligibility requirements as defined by the funding source. Performs other job related duties as required.% FTE100%Hiring Range Commensurate with experience.EducationRequires a PhD in biological sciences.Required Licensing/CertificationLaboratory Standard Safety Training; Cell culture training; Animal trainingKnowledge, Skills, and AbilitiesN/AWork ExperienceRequires five (5) years of experience in various aspects of cellular and molecular biology-associated biomedical research tools and techniques including developing and improving methods, assays and analysis. Requires working knowledge of specialized practices, methods, procedures and equipment pertaining to cellular and molecular biomedical research.  Must have hands-on experience and working knowledge in the following areas: cell culture and bacterial culture models for experimentation; DNA, RNA and protein-related studies to identify genes and their encoded proteins to understand their structure, function, mechanism and regulation by various methods such as PCR, RT-PCR, Western blotting, immunostaining and immunoprecipitation, cloning, siRNA/shRNA-mediated gene knockdown, gene transfection and expression, signaling pathway analysis and ChIP assays and posttranslational modification of histones.Leadership/Supervisory ResponsibilitiesResponsible for overall functioning and support services of the Molecular Biology core facility. Responsible for maintaining cell culture and molecular biology resources and instrumentation to provide cell culture and molecular biology support services to the user community of the molecular biology core facility. Monitors the users of the facility and ensures proper procedures and policies of the Pharmacology Core facility. Provides hands-on training/technical instrumentation support to the users of the facility. This position typically reports to a senior executive, the director of Molecular biology core facility.Work Complexity/Budget AuthorityTasks are multiple and diverse, including: Maintaining the facility with cleanliness; managing and maintaining the facility with appropriate resources, tools and instrumentation; learn new evolving cellular and molecular biology methods and technologies; assist users of the facility with hands-on training, pilot project support, instrumentation and research resources; record and prepare report of Molecular biology core activities to assess the facility activity and to prepare annual progress report for the funding agency; conduct research and submit abstracts and publish papers; prepare research proposals and prepare orders and monitor the expenditure of the core facility.Independent Judgment/Decision Making/Problem Solving SkillsDevelops objectives and general procedures for a specific user project or for a methodology to promote molecular biology research; exhibits critical thinking, decision making and problem solving capabilities; Day-to-day work and decisions do not require direction or review by immediate supervisor. Frequently solves complex problems. End results are reviewed by supervisor. Strategic issues are referred to supervisor.Personal/Organizational ContactsRegular and substantial contact with others. Contacts usually involve discussions with users of the facility and with the supervisor, which is usually related to: operation of the facility for user-related research, project support or training; availability of resources; and operation of the equipment. It may also include interaction with the supervisor to work on research projects, paper or grant writing; getting quotes and negotiating with vendors.Customer Service RelationshipsAssesses and diffuses problem situations and requires influencing others to reach consensus. Requires tact and diplomacy to handle difficult user situations. Requires advanced interpersonal and communication skills to establish and maintain internal and external user community relationships. Explores alternatives and creative solutions to meeting the needs of the Molecular biology core facility users.Working/Environmental ConditionsWork is performed within laboratory environment with minimal exposure to hazardous or unpleasant conditions. Physical demands usually include: some walking to different labs in the same floor; sitting and standing in different locations of the same lab much of the time; some lifting or carrying objects of light weight may be required.Desired start datePosition End Date (if temporary) Posting Detail Information UA EEO StatementIt is the policy of Texas Southern University to provide a work environment that is free from discrimination for all persons regardless of race, color, religion, sex, age, national origin, individuals with disability, sexual orientation, or protected veteran status in its programs, activities, admissions or employment policies. This policy of equal opportunity is strictly observed in all University employment-related activities such as advertising, recruiting, interviewing, testing, employment training, compensation, promotion, termination, and employment benefits. This policy expressly prohibits harassment and discrimination in employment based on race, color, religion, gender, gender identity, genetic history, national origin, individuals with disability, age, citizenship status, or protected veteran status. This policy shall be adhered to in accordance with the provisions of all applicable federal, state and local laws, including, but not limited to, Title VII of the Civil Rights Act.  Manual of Administrative Policies and ProceduresClose DateOpen Until Filled (overrides close field) YesSpecial Instructions to Applicants Open to all applicants."}