{"jobID": "2834845596", "jobLocation": "Washington_DC", "jobTitle": "Structured Cable Technician", "companyRating": null, "companyInfo": {"Website": "www.outsource.net", "Headquarters": "El Segundo, CA", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Outsource is currently hiring Structured Cable Technicians with 1 to 3 years of experience in a commercial environment. Candidates apply ASAP for opportunities in the DC Metropolitan area. Interviews are currently underway.  Please send your resume to kevin@outsource.net for consideration. Job Description: Pulling and routing CAT 5 or CAT 6 cable in a new construction commercial environment  Terminating phone jacks and dressing and terminating distribution frames (66 or 110 blocks, patch panels)  Installing support structures such as ladders, racks, j-hooks Qualifications: Familiarity with BICSI, EIA, TIA, or NEC Standards  Experience running or bending conduit, with digital multi-meters, and testing cable  Troubleshooting networking issues  Rack and stack work, closet work, putting together server racks, patch panels  Fiber experience including Anaerobic Terminations, SC and LC Connectors, and Splicing a plus  Ability to read and understand schematic and line diagrams  Your own basic telecom tools including punch downs, snips, wire strippers, cordless drill, PPE (safety gear), etc.  Must consent to a pre-employment background and drug screen Compensation: Starting pay $16 or depending on experience  Weekly Pay  Referral Bonuses of up to $250 for referrals that result in a placement (Ask for details!)  Qualified candidates will send a resume to: kevin@outsource.net for review. About Outsource: Outsource is the Nations leading providers of Cable Technicians. We work EXCLUSIVELY in building wiring, and we have been placing technicians of all levels with the right companies since 1998 so we know a thing or two about making a good match."}