{"jobID": "2794552064", "jobLocation": "San_Jose_CA", "jobTitle": "MTS1 - Big Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.paypal.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (PYPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Square, Amazon, Apple"}, "estimatedSalary": "142000", "jobDescription": " Job Description Summary:PayPal Enterprise Data Services team is looking for an experienced Data Engineer to help develop new projects on Hadoop big data platform. PayPal EDS Team is responsible for delivering highly available, scalable and performance efficient data platform. This is exciting engineering work with a significant impact on delivering business goals.Job Description: JOB DUTIES: Design, develop, test, deploy and debug large scale complex platform using big data technologies. Create high performance client side applications. Develop applications and tools for the effective management and operation of PayPal’s big data platform. Analyze and improve stability, efficiency, and scalability of the platform. Collaborate with architects, engineers, and business users on product design and feature. Be able to work end-to-end development cycle independently and mentor other team members to achieve the high standard deliverables. EDUCATIONAL REQUIREMENT: Master’s degree, or foreign equivalent, in Computer Science, Engineering or closely related quantitative discipline or Bachelor’s degree, or foreign equivalent, in Computer Science, Engineering, or closely related quantitative discipline EXPERIENCE REQUIREMENT: with a Master’s degree: Three (3) years of experience in the job offered or three (3) years of experience in the field of software engineering or program analysis. With a Bachelor’s degree: Five (5) years of experience in the job offered or five (5) years of progressively responsible experience in the field of software engineering or program analysis. SKILLS REQUIREMENT:Strong object oriented design and development skillsHands on with Java/Scala programmingExperience on Big Data Technologies such as Apache Spark, Kafka, Hive and HBaseFamiliarity with Driud and ElasticsearchExperience with Unix/Linux and shell scriptingSQL development experienceExperience building RESTful APIsAI/ML experience is helpfulExcellent communication skills Subsidiary:PayPalTravel Percent:0Primary Location:San Jose, California, United States of AmericaAdditional Locations: We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities."}