{"jobID": "2780852991", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.ninthdecimal.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": "Data Scientist @ NinthDecimal. NinthDecimal continues to advance its position as a leader in the Marketing and Advertising industry. We deliver best-in-class Measurement, Insights and Analytics by deploying advanced data science methodologies on data sets of massive scale. Our new platform (called Location Graph) offers capabilities to create and target custom audience segments at scale. It is based on the history of past and present location data connected and matched to various 3rd party data sources. As a result, the platform can derive in real time (tens of thousands of requests per second) whether an ad request comes from a mom, a student, middle age male who is a business traveler and dozens of other profiles.?We deal with 10+ billions of signals from mobile devices every day. As a member of the Data Science team, you?ll be responsible for developing statistical and machine-learning models that deliver accurate and robust measurement of foot traffic metrics of interest to our advertising clients. You will work closely with other data scientists, the Product team, various business units, and other engineering teams. This is a great opportunity to work with real world data at scale and to help define and shape the measurement standards in a very dynamic and evolving industry. The responsibilities for this position include these activities: Develop and deploy data science methodologies and algorithms at scale to create high quality disruptive productsEstablish robust processes to insure the stability, accuracy, reproducibility and overall quality of all algorithms, processes, and the results they produceRepresent Data Science team in Product and Roadmap design sessionsParticipate in building reliable QA processes for both data and resultsCollaborate on key architectural decisions and design considerationsContribute to and promote good software engineering practices across the Engineering Department.Understand the current data sets and models and provide thought leadership by discovering new ways to enrich and use our massive data assetsQualifications Required:A true passion for data, data quality, research and a solid data science approachSolid understanding of probability and statisticsSolid understanding of research design, A/B and test-vs-control statistical testing frameworksLinear and Generalized Linear regression models ? including the ability to diagnose and correct problems.Solid understanding of unsupervised and supervised machine learning approaches including clustering and classification techniques.Solid understand of how to assess the quality of machine learning models ? including the ability to diagnose and correct problems.Experience working with multiple data types including numerical, categorical, and count data.Ability to manage competing priorities in a dynamic and fast paced business environment.Experienced/Advanced programmer in Scala, Python, or similar programming languagesExperienced/Advanced Programmer in Spark, SQL, and/or HiveExperience in developing algorithms based on multi-billion records data sizeAdvanced degree in Statistics, Economics, Operations Research, or similar quantitative fields is preferredFamiliarity with the digital media / advertising industry is a big plus3+ years? experience as a Data Scientist"}