{"jobID": "2832792718", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ascentsg.com", "Headquarters": "Concord, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Please note that this temp position is for 6 months, long term with the potential in 2019 to go from a Temp to Perm, based on Budget and Candidate Performance. No guarantees either way.All candidates being considered and submitted MUST have ADVANCED EXCEL SKILLS, for this role, i.e. (nested formulas, conditionals, vlookups, power query, etc.) This is not Preferred but a Requirement for this position. Without this experience, candidate will be rejected.The Reporting Analyst (Data Analyst III) is responsible for designing, creating and verifying data reports, metrics and visualizations of post market surveillance and sales data.The workflow is largely Business Objects reporting, followed by post processing in Excel.The work product supports management reviews and regulatory submissions, as well as other diverse areas of the business.The Analyst is responsible for project management of the reports, including defining and negotiating reporting requirements with various clients.A skilled analyst works in a highly collaborative manner, often educating clients on ways to address their data oriented problems. They document workflow, status, appropriate verification and approvals of reports.They also ensuring work product meets the requirements of clients, incorporating learning into future continuous improvement.The Analyst supports creation of aggregate safety reports, signal detection reports and presentations for various management reviews, including investigating safety signals, including use of statistical technique.The Analyst uses a wide variety of tools, especially Business Objects family of applications, advanced spreadsheet work and statistical packages.Support key business initiatives as required, providing statistical analysis, application design and interactive visualizations of data.MOST IMPORTANT is Business Objects experience and advanced Excel skills as listed below. Other platforms (listed below) instead of BO would be considered if we do not get BO experience.Education and Experience:Combination of Education and Experience to Satisfy one of the following three options: o Master’s degree in Computer Science (or equivalent) with 1+ years of experiences or  o Bachelor’s degree in Computer Science (or equivalent) with 1+ years of experience or  o Bachelor’s degree in sciences or engineering plus 1+ years of experience in report and query creation using database query or report tools. 2+ years of experience in the Device or Pharmaceutical industry highly preferredEssential Skills and Abilities:Experience in Business Object (BO is most preferred. Will consider candidates with other similar query and report tools such as DOMO, Tableau, Spotfire, MS Power BI, etc.) o Ability to design and create Business Object (or equivalent... BO preferred), queries and reports. Advanced ability with Excel spreadsheets such as Pivots, nested functions in formulas, vlookups."}