{"jobID": "2737816011", "jobLocation": "Chicago_IL", "jobTitle": "Principal Data Scientist - Core Maps - Building the new Map, in a new Way", "companyRating": "3.6", "companyInfo": {"Website": "company.here.com/here", "Headquarters": "Eindhoven, Netherlands", "Size": "5001 to 10000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Google, TomTom, Apple"}, "estimatedSalary": "137000", "jobDescription": "WhoAreWe? Ever checked in somewhere on social media? Ever tracked your online orders?” You might be using HERE Technologies every single day without even realizing it. You can find us everywhere: in vehicles, smartphones, drones or third-party apps. We believe that with the right people, we will continue to be a game-changer in the technology industry and improve the daily lives of people around the world. Find out more by clicking the video below or going HERE  At HERE Technologies in Core Map Engineering organization, we are looking for highly skilled, self-motivated, Principal Data Scientist who is passionate about innovating and developing machine learning and data analytics solutions to build our industry-leading map. We provide the opportunity to collaborate with an energetic and dedicated team that works on cutting-edge technology to create tools and services. The candidate will work with researchers, developers, architects, IT to develop, deploy, and maintain applications in multiple environments. What You'll Get?Challenging problems to solveOpportunities to learn cool new thingsWork that makes a difference in the worldFreedom to decide how to perform your workVariety in the types of projectsFeedback so you will know how well you are doingCollaborative, Supportive ColleaguesWhat's the role?Help design and build the next iteration of process automation in HERE Core Map processes employing a highly scalable Big Data infrastructure and machine learning as applied to global-scale digital map-making.Build and test analytic and statistical models to improve a wide variety of both internal data-driven processes for map-making data decisions and system control needs.Act as an expert and evangelist in areas of data mining, machine learning, statistics, and predictive analysis and modeling.Function as a predictive modeling or application team lead on Core Map projects.Who are you?MS or PhD in a discipline such as Statistics, Applied Mathematics, Computer Science, or Econometrics with an emphasis or thesis work on one or more of the following: computational statistics/science/engineering, data mining, machine learning, and optimization.Minimum of 5 years related, professional experience.Knowledge of data mining and analytic methods such as regression, classifiers, clustering, association rules, decision trees, Bayesian network analysis, etc. Should have expert-level knowledge in one or more of these areas.Proficiency with a statistical analysis package and associated scripting language such as Python, R, Matlab, SAS, etc.Programming experience with SQL, shell script, Python, etc.Knowledge of and ideally some experience with tools such as Pig, Hive, etc., for working with big data in Hadoop and/or Spark for data extraction and data prep for analysis.Experience with and demonstrated capability to effectively interact with both internal and external customer executives, technical and non-technical to explain uses and value of predictive systems and techniques.Demonstrated proficiency with understanding, specifying and explaining predictive modeling solutions and organizing teams of other data scientists and engineers to execute projects delivering those solutions.Preferred Qualifications:Experience in software development life cycle including coding standards, code reviews, continuous integration, testing, deployment and operational support, particularly of predictive analytics products.Experience working in an agile program management environment.Make HERE your destination, we are just getting started. Apply now! Equal Opportunity Employer: Race/Color/Sex/Sexual Orientation/Gender Identity/Religion/National Origin/Disability/Vets.  #LI-SA1"}