{"jobID": "2801264995", "jobLocation": "Washington_DC", "jobTitle": "Project Manager (Data)", "companyRating": "3.5", "companyInfo": {"Website": "www.rallyhealth.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " Do you enjoy helping build great teams and culture? Can you work in a fast paced environment solving complex problems? Join us and work for the purpose of improving millions of people's wellness and lifestyles. We're looking for an agile project manager to help us build high performing software teams that change the industry. Responsibilities: · Facilitate cross-functional coordination across project plans  · Manage work stream dependencies and the impact on downstream working groups  · Track updated accomplishments, milestones, key issues and/or change controls  · Establish and lead working group meetings. Create weekly project status and executive reporting Here's what you need: · BA/BS degree or equivalent practical experience  · ~5 years of progressively responsible experience in software development team or project management  · Ideal candidate is pro-active, willing to identify disorganization and bring the right stakeholders together to drive clarity of purpose  · Ability to communicate clearly and effectively, both verbally and in writing,  · Strives when working as part of a dynamic team  · Prioritizes typical job responsibilities in conjunction with ad hoc requests and team improvements  · Develops strong relationships built on mutual respect and a focus on continuous improvement And for bonus points: · Understands source data, familiar with data warehousing, ETL processes  · Experience working with other data scientists closely, as well as other functional organizations  · Familiarity with business challenges associated with managing complex data projects  · Experience managing Kanban, Scrum, and other project types as well as experience working with Atlassians JIRA, Confluence, and Google Apps  · Experience within a SaaS environment that operates with continuous delivery and Start-up/entrepreneurial experience is plus  · Certified Scrum Master (CSM) or equivalent experience with agile development methodologies  Rally Health is committed to ensuring that its workforce reflects Americas diverse population. Rally Health knows that such diversity will enrich us with the talent, energy, perspective and inspiration it needs to achieve its mission. Rally Health believes in a policy of equal employment and opportunity for all people based on merit and commitment to the principles of diversity. It is our policy to recruit, hire, train, and promote individuals in all job titles, and administer all programs, without regard to race, color, religion, national origin or ancestry, citizenship, sex, age, marital status, pregnancy, child birth or related medical conditions, personal appearance, sexual orientation, gender identity or expression, family responsibilities, genetic information, disability, matriculation, political affiliation, veteran status, union affiliation, or any other category protected by applicable federal, state or local laws. Individuals with disabilities and veterans are encouraged to apply. Applicants who require an accommodation related to the application and/or review process should notify Talent Acquisition (recruiting@rallyhealth.com).  Individuals with disabilities and veterans are encouraged to apply. Applicants who require an accommodation related to the application and/or review process should notify Talent Acquisition (recruiting@rallyhealth.com).  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}