{"jobID": "2627125030", "jobLocation": "Washington_DC", "jobTitle": "Lead Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.business.gwu.edu", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1821", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " The mission of the GW Milken Institute School of Public Health Department of Health Policy and Management is to prepare students for advanced careers in health policy through rigorous teaching, research and practice, and to advance health policy scholarship in a cross-cutting context.  The Department of Health Policy and Management is seeking a Lead Research Scientist to work on projects related to accountable health initiatives and new strategies for advancing and supporting public health. Work will involve policy analysis and writing, contributing to project deliverables, consulting with and convening experts on priority topics, and working with funders and others on shared goals. The Lead Research Scientist will play an integral role in conceptualizing and designing project deliverables, developing written products, and building consensus-driven processes. This position will report to the projects' PI. Responsibilities Include:Developing policy analyses related to accountable health initiatives and the future of public health funding.Conceptualizing and designing workshops and other shared learning forums for funders, evaluators, and program staff on accountable health and other public health initiatives.Managing the development of research, case studies, and other products to advance various project goals.Providing support for the management of projects and deliverables.Conducting quantitative analysis using major publicly available data sets. Designing, conducting and analyzing surveys.Interpreting data and writing policy briefs and peer review journal articles.Reviewing draft reports to ensure their policy-relevance and quality.Providing support in the management of projects, including supervising, training, and mentoring research staff.Perform other related duties as assigned. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position."}