{"jobID": "2833116551", "jobLocation": "Dearborn_MI", "jobTitle": "260996 - Data Scientists Modeling", "companyRating": "4.0", "companyInfo": {"Website": "www.rgbsi.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Kelly Services, TEKsystems, Randstad US"}, "estimatedSalary": "80000", "jobDescription": " RGBSI, a leader in the staffing industry, is dedicated to providing the highest quality of services to our clients and employees. We are proud to be the primary staffing partner to top companies in the automotive, aerospace, IT, media & entertainment, sports, energy, and finance industries. As a result of our clients' continued growth, we are looking for energetic, personable professionals to partner with these leading US companies. Position Description:Global Data, Insight & Analytics organization is looking for a highly skilled applied econometrician to assist in providing regulatory support relating to customer willingness-to-pay (WTP), involving the measurement of trade-offs between key vehicle attributes, through the application of advanced quantitative methods.The econometrician will have responsibility for all levels of econometric model development, evaluation, and deployment.The econometrician must be skilled in applying economic theory from multiple perspectives including the consumer as an optimizing economic agent, as well more recent advances in behavioral economics wherein rational consumer behavior is bounded by complex market settings.Skills Required: Skilled in applying advanced econometric modeling techniques including; Discrete choice analysis methodsMarket segmentation/cluster analysisConjoint analysis modelingPredictive modeling and Systems estimation methods / optimizationBayesian modelsStochastic modelsSocial network models2+ years of experience in at least two of the following languages: R, Python, MATLABSkills Preferred:Good oral and written communication and presentation skillsAbility to work in a team-oriented environment that places a high priority on delivering collaborative work products for our business partnersExperience Required:3+ years of quantitative modeling experience in advanced market research techniques at both theoretical and practical levels; identify, collect, and synthesize research on consumer willingness-to-pay, market structure, market participants, and competitive outcomes construct and validate econometric analytic models, including logit, nested/multinomial logit models, blending consumer optimization with behavioral influences, for use in prediction and scenario analysis, and develop market solutions for automotive business applications.Experience Preferred:2+ years of post-graduate work experience (in a business or post-doc setting) involving complex econometric modeling and analysisDemonstrated skills in manipulation and data mining / pattern recognition of large structured and unstructured data setsPrevious experiences (>= 1 year) working in a regulatory setting is a +plus.Education Required:Ph.D. in a quantitative field such as Applied Economics/Econometrics, Applied Mathematics, Quantitative Social Science, or Quantitative Finance We offer attractive, competitive compensation and benefits including, medical, dental, vision, longevity bonus, holidays, 401k, Short Term Disability, AD&D; and Tuition Reimbursement. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more.  RGBSI is a Multi-National Corporation headquartered in Troy, MI with branches throughout the USA, Canada, China, Germany, Mexico, Singapore, UK, and India."}