{"jobID": "2662845356", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Entry Level Treasury Accountant", "companyRating": null, "companyInfo": {"Website": "www.rhp-properties.com", "Headquarters": "Farmington Hills, MI", "Size": "501 to 1000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Are you interested in a challenging position with a growing property management company? If you are ready to start your career as an entry level Treasury Accountant, this could be the opportunity for you! RHP Properties* (www.rhp-properties.com) is a growing, privately held national Property Management Company. Headquartered in Farmington Hills, Michigan, we own and operate over 200 manufactured home communities in 23 states.We are presently seeking an individual who will perform treasury functions while focusing on property taxes and replacement and completion reserves.As a Treasury Accountant, you will:Coordinate the Replacement/Completion escrow processes.Correspond with lenders to confirm payment of real property tax statements; perform reconciliations of real estate tax escrows.Coordinate payment of real and personal property taxes for all communities and manufactured homes; coordinate preparation of personal property tax returns. Administer the corporate credit card program.File monthly, quarterly and annual sale and use tax returns.Administer tax exemptions to residents at New York communities. Maintain Property Tax DatabaseProvide back up to Senior Treasury Accountant to ensure all mortgages and other debt is received, processed and paid timely.Prepare surety/utility/abandonment bonds for filings/renewals.Process Electronic Fund Transfers including phone checks timely.Process & maintain resident ACH’s for RV resorts.Process third party W-9 requests.Provide backup to process lien waivers for reserves, insurance, and corporate use.Maintain & audit vehicle database.Provide back up to issue checks.Process Flood Insurance policies.Complete monthly insurance reporting – COR, CONR, Notes, Heavy Equipment, etc.Perform other duties as assigned.Minimum Requirements A minimum of 1 year of accounting experience.Associates or Bachelor’s Degree in Accounting or related field preferred.Chart of account knowledge.Strong analytical, and communication skills.Proficiency with the Internet and MS Office specifically Word, Excel, and Outlook.Detail oriented, the ability to multitask, and be a team player in a fast-paced environment.Compensation:This is a full-time opportunity with competitive compensation. Benefits include medical, dental and vision insurance; short-term and long-term disability; life insurance; paid time off and holidays; flexible spending; and 401K. *As is typical in this industry, the employees working at the properties in RHP Properties' portfolio are employed through a separate entity, RHP Staffing Company. Thus, though there are references here to RHP Properties, please understand that your employment relationship will be with RHP Staffing."}