{"jobID": "2685273312", "jobLocation": "South_Plainfield_NJ", "jobTitle": "Staff Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.terracon.com", "Headquarters": "Olathe, KS", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Kleinfelder, URS Corporation, PSI"}, "estimatedSalary": "46000", "jobDescription": " Staff Scientist  04-May-2018 Service Line Environmental Job DescriptionGeneral Responsibilities: Conduct environmental site investigations, assessments and surveys to sample, measure and analyze air, water, material, and soil. Identify, evaluate and recommend risk and remediation strategies/designs to ensure compliance with federal, state and local regulations. Prepare applicable permit applications, risk assessments and technical documents including proposals, reports and regulatory agency correspondence. Design systems and environmental protection plans. Projects may include Phase I/II environmental site assessments, ecological and natural resource field surveys, tank closure assessments, asbestos abatement, storm water management, and site planning and permitting. Essential Role and Responsibilities:Follow safety rules, guidelines and standards for all projects. Participate in pre-task planning. Report any safety issues or concerns to management.Be responsible for maintaining quality standards on all projects.Proficient scientific professional responsible for conducting site testing and making recommendations for systems design on smaller projects of minimal complexity.May assist more senior scientists/engineers on large, more complex projects.Performs site visits, field observations and field data collection or assignments.Implements technical requirements to complete client projects by directing and supervising field staff to sample, test and collect data and/or document site activities.Responsible for developing written proposals to clients for approval by senior level professionals.Evaluates moderately complex laboratory and field data and assembles in written reports.May serve as team member and participate in meetings and communications with client pertaining to specific projects/tasks.May oversee work performed by lower level scientists/engineers and Technicians.Requirements:Bachelor’s degree in Environmental Science or related science field and 1-3 years’ related experience. Or, in lieu of a degree, a minimum of 5-7 years’ related experience.Master’s degree preferred.Certification in field of expertise required.Valid driver’s license with acceptable violation history.Exemption Exempt Requisition ID8804BRPosting Title Staff Scientist Employment Type Regular, Full Time City, State (Office Location) South Plainfield, NJ About Terracon Terracon is a 100 percent employee-owned consulting engineering firm providing quality services to clients. Since 1965, Terracon has evolved into a successful multi-discipline firm specializing in environmental, facilities, geotechnical, and materials services. Terracon currently has more than 3,500 employees in 130 offices with services available in all 50 states. Terracon’s growth is due to valued employees exceeding expectations in client service and growing their careers with new and exciting opportunities in the marketplace. EEO Statement Terracon offers an excellent compensation and benefits package including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays.  Terracon is an EEO employer. We encourage qualified minority, female, veteran and disabled candidates to apply and be considered for open positions. We do not discriminate against any applicant for employment, or any employee because of race, color, religion, national origin, age, sex, sexual orientation, gender identity, gender, disability, age, or military status. Job Category Scientist "}