{"jobID": "2817655897", "jobLocation": "Kenilworth_NJ", "jobTitle": "Global Medical Information Scientist - Neuroscience", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Global Medical Information Scientist - Neuroscience - MED******  Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R & D expertise to create breakthrough science that radically changes the way we approach serious diseases.  Neuroscience US and Global Medical Information (GMI):Identify relevant scientific information to help develop Medical Information deliverables that meet customer's needs. Contribute to the creation and maintenance of comprehensive and accurate standard response documents with guidance from GMI Senior Scientist / Scientific Director. Respond to unsolicited professional information requests from healthcare providers in writing and/or verbally with guidance from GMI Senior Scientist/Scientific Director based on complexity. Scientific Review of US and Global Promotional Materials: As a member of a cross - functional US and Global Promotional Review Team, collaborate with GMI Senior Scientist/Scientific Director based on complexity of the review of promotional materials from internal GHH teams and external partners, to help ensure a balanced presentation of scientifically accurate, relevant content that is consistent with all applicable company policies, local regulations, and department SOPs.Medical Education and Training:Collaborate with internal stakeholders to determine educational objective of training materials and identify training gaps. Contribute to the development/creation and delivery of scientific training materials to the Merck National Service Center, Sales Representatives, and US Medical Affairs field based employees with guidance from the GMI Senior Scientist / Scientific Director.Additional Information:The GMI Scientist, in collaboration with GMI Senior Scientist / Scientific Director, helps to explain scientific information and works with GMI Neuroscience Team to support business needs.The GMI Scientist makes decisions within guidelines and policies which impact a range of routine client / customer, operational, and project activities.The GMI Scientist, with their advanced scientific background, brings a new perspective to existing problems and helps find solutions.The GMI Scientist, with their advanced scientific background, is a resource within their therapeutic area for the global core functions of Medical information, Promotional Review, Medical Education / Training.The GMI Scientist aspires and has potential to manage and prioritize the global core functions of Medical Information, Promotional Review, and Medical Education / Training to meet internal / external customer needs.QualificationsRequired:PharmD or Ph.D degree - OR - Master's Degree in Life Science with Med Info experienceStrong knowledge of medical literature and drug information databasesStrong ability to evaluate and communicate scientific data, including well developed Medical Writing and effective presentation skillsAbility to work effectively in a cross - functional team environment.Preferred:Experience in Medical InformationTherapeutic Area experience in Neuroscience, relevant to the position description noted above.Understanding of the Regulations pertaining to pharmaceutical productsProject management and organizational skills, specifically ability to identify problems and opportunities and find and deliver effective solutions Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to . Search Firm Representatives Please Read Carefully: Merck & Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  For more information about personal rights under Equal Employment Opportunity, visit:  Job Medical Affairs Generic  Primary Location NA-US-NJ-Kenilworth  Other Locations Regular  Employee Status Yes, 15 % of the Time  Number Of Openings N/A  Categories Sales / Business DevelopmentHealthcareBiotechnology / Science"}