{"jobID": "2789017433", "jobLocation": "San_Diego_CA", "jobTitle": "6628 Research Analyst and Data Consultant (Research Technician I", "companyRating": "4.0", "companyInfo": {"Website": "www.calstate.edu", "Headquarters": "Long Beach, CA", "Size": "10000+ employees", "Founded": " 1962", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "CSU Job Listing Details Printable version E-Mail this listing Campus: San DiegoJob ID: 6628Job Title: 6628 Research Analyst and Data Consultant (Research Technician IAppointment Type: TemporaryTime Base: Part-Time Date Posted: May 23, 2018Closing Date: Open until filledLink to Apply Online: http://bfa.sdsu.edu/hr/jobs/job-opportunities.aspxCampus Employment Homepage: http://jobs.sdsu.eduDescription: OverviewSan Diego State University is seeking applicants with demonstrated experience and/or commitment to teaching and working effectively with individuals from diverse backgrounds and members of historically underrepresented groups.Initial review of applications will begin on June 6, 2018. To receive full consideration, apply by June 5, 2018. The position will remain open until filled. The online application should be completed in detail. Completion of the online application is required for consideration; a resume alone will not suffice. For more information on San Diego State University, please click here.Position InformationThis is a part-time (0.5 time-base), benefits eligible, temporary position anticipated to end on or before one year from date of hire, with the possibility of reappointment and/or permanency. This position is designated exempt under FLSA and is not eligible for overtime compensation. Standard SDSU work hours are Monday – Friday, 8:00 a.m. to 4:30 p.m., but may vary based on operational needs.The primary purpose of the Research Technician III position is data analysis, reporting and user consultation and support. This includes designing visualizations, conducting analyses, meeting with users, overseeing ASIR’s user consultation process, and responding to internal requests from university decision-makers. It also includes assimilating, managing and validating data from various sources including SDSU’s student information system and campus departments. This position will also support the Statistical Modeling Group with data preparation and validation as well as statistical analysis and requires consultation with campus users, conducting training sessions and presenting results of analyses to key stakeholders. This position requires strong attention to detail, deep understanding of institutional data and processes, ability to work independently, awareness and application of higher education issues and SDSU academic policies specifically. Under the general supervision of the ASIR Director, this position requires the ability to translate complex institutional data into usable information for university decision-makers. Other related duties as assigned. Strong analytical, statistical, communication and technical skills are essential.For more information regarding Analytic Studies and Institutional Research, please click here.Compensation and BenefitsStarting salary upon appointment not expected to exceed $3,333.50 per month. CSU Classification Salary Range: $2,238 - $3,816 per month. Salary placement is determined by the education, experience, and qualifications the candidate brings to the position, internal equity, and the hiring department's fiscal resources. San Diego State University offers a rich benefits package that constitutes a major portion of total compensation. For more information regarding SDSU benefits, please click here. QualificationsMinimum Qualifications Experience: Three years of progressively responsible technical research or statistical experience including or supplemented by one year in the interpretation and graphic presentation of data. Graduate study in the social sciences, economics, mathematics, statistics, public or business administration or engineering may be substituted for the required experience on a year-for-year basis.Education: Equivalent to graduation from a four-year college or university. (Additional qualifying professional experience may be substituted for the required education on a year-for-year basis).Preferred Qualifications and Specialized Skills Advanced proficiency with Microsoft Excel.  Must be experienced with statistical software such as R or SPSS and/or database tools such as SQL or Access and have strong technical and analytical skills.  Master’s degree or higher in relevant field (i.e., social sciences, economics, mathematics, statistics). 5+ years of experience in institutional research and/or higher education experience. Strong technical skills, including experience with SQL Server, R, SPSS, and Tableau.Application ProceduresTo apply for this position, please click on the \"Apply Now\" button on this page. You must submit your application by clicking on the \"Submit\" button. If you need assistance completing your application, please click here.Applicants with disabilities requiring assistance may call (619) 594-7099.General InformationThe person holding this position is considered a ‘mandated reporter’ under the California Child Abuse and Neglect Reporting Act and is required to comply with the requirements set forth in CSU Executive Order 1083 as a condition of employment. A background check (including a criminal records check) must be completed satisfactorily before any candidate can be offered a position with the CSU. Failure to satisfactorily complete the background check may affect the application status of applicants or continued employment of current CSU employees who apply for the position.SDSU is a smoke free campus. For more information, please click here.SDSU is an equal opportunity employer and does not discriminate against persons on the basis of race, religion, national origin, sexual orientation, gender, gender identity and expression, marital status, age, disability, pregnancy, medical condition, or covered veteran status."}