{"jobID": "2769350522", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.wonderschool.com", "Headquarters": "San Francisco, CA (US), CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As the a senior data scientist at Wonderschool you will be the first data scientist on the team. We're looking for a senior data scientist to identify, strategize execution, and execute on solving problems at Wonderschool that requires statistical analysis and predictive algorithms.  Some projects that you could immediately work on: Analyze current Director base and build systems to identify strong potential DirectorsUse market data, demographic data, and actual marketing data in our database to build a predictive tuition model for Wonderschool programs on a real time basisWork with the marketing team to identify which channels are driving the best parent inquiries and Director leads to further invest and build automated solutions to continue to drive investment This is a full time job based in San Francisco, CA. We are not looking for remote team members. You will report to Arrel, the CTO and Co-founder of Wonderschool. ABOUT YOU The best candidate for this role is energized and passionate about working at a very early-stage mission driven startup were you can influence how we collect and store data.  The primary skill sets we are looking for in this role are leadership, communication, and data engineering.  You have worked on a data science team with 5+ data scientists and have grown to be a senior individual contributor or manager and you are looking to take your skills and implement that a startup.  You are looking to work hard on problems that move the needle for our entire business in a fast paced, highly rewarding environment amongst a small team of talented engineers and operations people. RESPONSIBILITIESStart projects from scratch, design, implement, ship it to users, get their direct feedback, and iterate from there.Work cross functionally with the engineering and operations team. We have engineering and data scientist mentors that you will have access to work with as well.Design our data scientist culture and play a significant role in growing and managing future data scientists.Make product decisions that define our roadmap and experience first hand how your work is impacting our users.Start projects from scratch, design, implement, ship it to users, get their direct feedback, and iterate from there.RequirementsIndependent, proactive, quick to act with minimal supervisionDeep understanding in a set of analytics and machine learning tools like Python, SQL and the Pydata stack (Numpy, Pandas, Scipy, Scikit-Learn), or a similar set of toolsRobust skills in statistics, probability, and/or machine learningStrong leadership and communication skillsExperienced data engineerStrong machine learning background2+ years experience with programming languages3+ years with relational database and querying languages (e.g. SQL)Comfortable working in an AWS environment with strong Linux keyboard skillsHave full stack experience in data collection, aggregation, analysis, visualization, productization, and monitoring of data science productsBenefits Wonderschool invests in our people and our culture. We provide our employees with top of the line full medical, vision, and dental benefits, option to contribute to a 401K plan, life insurance, and stock options. We offer a “take it as you need it” vacation policy. We a bright office in the middle of the Mission District and Hayes Valley neighborhoods in San Francisco. We anticipate a salary of $120K for this role."}