{"jobID": "2809049804", "jobLocation": "Washington_DC", "jobTitle": "Lead Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.qedgroupllc.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " The QED Group, LLC, is a full-service international consulting firm committed to solving complex global challenges through innovative solutions. We are determined to provide all our clients with best-value services so they increase their efficiency, learning capacity, and accountability to the public in an ever more complex and interconnected world. Through Monitoring, Evaluation, and Learning and Knowledge Management practice areas, QED is working to maximize our clients' return on investment through accountability, continuous learning, and sound management.  QED is seeking a Lead Data Analyst to serve on the Feed the Future Knowledge, Data, Learning and Training (KDLT) project. The purpose of KDLT is to improve the USAID Bureau for Food Security’s (BFS) capacity for and quality of knowledge-sharing, data management and analysis, organizational learning, and training, in support of adaptive management of Feed the Future in alignment with the Global Food Security Strategy (GFSS). KDLT will serve as BFS’s primary tool for capturing, analyzing, sharing, and adapting good practices around agriculture-led economic growth, nutrition, and resilience to ensure that Feed the Future’s technical leadership and project implementation continue successfully.  One of the results under this activity is expanded capacity for on-demand, accurate data analysis and visualization to support learning and adaptive management of Feed the Future. The Lead Data Analyst will provide support under this result and for overall data management during the contract period of performance. ResponsibilitiesFacilitate and conduct data analysis, mapping and visualization to determine and share results from Feed the Future programming.Oversee data collection system, train staff on its use, and continually improve the platform.Conduct on-demand quantitative and qualitative analyses of the Monitoring System data, internal performance management materials, external data sets, and USAID surveys and evaluations to provide context and inform potential program actions.Provide input to strategic planning, policy development, performance monitoring and reporting.Champion, develop and document open data best practices and USG requirements’.Work with the BFS/MEL Division to produce guidance on performance analysis by missions as part of annual review processes.QualificationsBachelor’s degree (Master’s degree preferred) in Statistics, Data Analysis or a related area.4+ years of experience in data analysis in the international development sector.Demonstrated qualitative and quantitative analytic skills.Demonstrated ability to organize and effectively communicate research results to a variety of audiences.Experience managing projects and staff in a complex environment.Basic social science research skills and basic statistics, including strong data visualization skills.Experience with data entry and cleaning.Experience with database development and management.Knowledge of issues related to agriculture, food security, and resilience.Previous USAID experience is a plus. To apply for this position please follow the following steps: Complete the online application.Attach your resume.Click on the link: Biodata AID1420-17, fill out the form, sign it, and attach/upload it to your application. You may also include other documents such as cover letter and/or a work sample.Submit your application, resume, completed biodata, and any additional documents. Please note that applications submitted by other means; or without resume and/or biodata will not be considered.  Only finalists will be contacted. No phone calls please.  Reasonable accommodation requests will be considered on a case-by-case basis. The QED Group, LLC is an Equal Opportunity Employer. Women and Minorities are encouraged to apply. AA//V/D."}