{"jobID": "2831012570", "jobLocation": "Pasadena_CA", "jobTitle": "SQL - Data Consultant, BSR", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "86000", "jobDescription": " Under general supervision, this position exists to assist the organization in making strategic data-related decisions by analyzing, manipulating, tracking, internally managing and eporting data. This position functions both as consultant and as a high-level SAS programmer. Essential Responsibilities: Designs and enhances databases.  Designs menu systems that are effective and user-friendly.  Develops reports with accurate, easy to read, useful information.  Designs and generates tracking and monitoring tools.  Participates in the development of outcomes and process measures, including technical specifications, to enable population measurement, guideline implementation, and evaluation.  Builds and maintains complex statistical SAS routines using macros, vendor software, and software written by self and others.  Tests and maintains data integrity across multiple databases (internal SAS, DB2, VSAM; external: Adobe, Excel, SAS parsing routines, COBOL).  Builds sophisticated statistical models and forecasting tools using these databases.  Defines and frames complex multi-dimensional healthcare issues and develops time tables/processes for decision making.  Translates needs, issues, and ideas into effective strategies and action plans.  Formulates specific implementation plans and evaluates the effectiveness of actions/programs implemented.  Develops creative alternative solutions.  Works closely with IT and outside partners (and physicians for SCPMG departments).  May coordinate team/project activities and schedules.  May assist in the determination of goals and priorities with team, clients, or project management sponsors.  May provide leadership to multi-disciplinary project teams.  Communicates results/recommendations to project sponsors, clients, and various senior level audiences (including physicians for SCPMG departments). Basic Qualifications: Experience  N/A. Education Bachelor of Arts degree in economics, finance, health care administration, public health administration, statistics, mathematics, operations research, or four (4) years of experience in a directly related field required.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A. Additional Requirements: Experience with analytical manipulation and interpretation of large databases required.  Broad familiarity with medical practices, especially population management and process and outcomes measurement preferred.  Knowledge of JCL strongly preferred. Microsoft Office skills preferred.  Very strong analytic and critical thinking skills, writing skills, communication skills, consulting skills, and ability to work within a team.  Ability to express complex analytical and technical information to senior management or to audiences with clinical training.  Must be an independent self-starter.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: Minimum three (3) years programming in SAS, R, SQL, Python or equivalent preferred.  Minimum three (3) years of related analytical consulting experience, healthcare experience preferred.  Experience with SQL, macros, AF, and SASGRAPH, PROC Report and statistical procedures in SAS preferred.  Project management experience strongly preferred.  Experience with MVS/TSO operating systems preferred.  Master's degree preferred. "}