{"jobID": "2837766739", "jobLocation": "Hopewell_NJ", "jobTitle": "External Data Specifications Manager (eDSM)", "companyRating": null, "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This is a Wallingford role that will be located in Central New Jersey. Department Title and Description: Data Management, which is part of Global Development Operations, is accountable for the verification, validation and quality control of data gathered (both external and clinical) during the conduct of Phase I-IV clinical trials for ECTR, GDO and MDO. The data collected forms the basis of subsequent safety and efficacy analysis and must adhere to regulatory requirements and guidance. Purpose/Objective of the job: The ePDM position supports the collection and management of externally sourced data from study maintenance through database lock and submission to ensure efficiency and quality throughout the life of the clinical trial. Key Responsibilities and Major Duties: ·Coordinates all collection and review activities related to external vendor laboratory or modality data. Serves as liaison between BMS and vendor data management teams.  ·Provides scientific and technical expertise in developing data and transfer requirements for a wide variety of specimen results.  ·Demonstrates a strong understanding of the overall project goals. Develops project plan. Evaluates potential problems and risks. Communicates deliverable strategies and timelines to stakeholders to ensure objectives are met.  ·Reviews transferred data for quality and validity. Proactively resolves data, vendor and investigative site issues. Assures complete sample collection and metadata accuracy.  ·Effectively uses available tools (e.g. JReview, Study Management Tools, eDM, RAVE, SQL,TOAD, Spotfire) to gather information needed to manage study activities.  ·Drives quality through partner vendor workshops, process improvement and best practice initiatives.  ·Manages concurrent projects in a rapidly change environment.  ·Participates as an active member of cross functional teams or initiatives.  ·Provides on-going training and mentoring to team members through a mentoring process using informal and/or formal presentations. Supervisory Responsibility: NA Key Stakeholders/Contacts: Clinical teams, statisticians, scientists (Biomarkers, PK/PD,...), Central Clinical Laboratories and other 3rd party service providers. Qualifications: ·Two to four years of data management, programming or regulatory experience in a pharma research or central clinical lab organization.  ·B.S, Medical Laboratory Scientist (MLS), Medical Technologist (MT) or other scientific discipline preferred.  ·High level of competence using computer systems and applications such as Oracle Clinical, RAVE,SAS, SQL, J-Review, Spotfire.  ·Comprehensive understanding of clinical drug development process, including PK, PD and Laboratory testing terminology. Strong analytical skills to facilitate detecting and resolving data problems.  ·Experience in management of multiple simultaneous projects in a matrix environment."}