{"jobID": "2574281141", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Scientist/Scientist, Nonclinical", "companyRating": null, "companyInfo": {"Website": "www.audentestx.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Public (BOLD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Avalanche Biotech, BioMarin Pharmaceutical, Sangamo Therapeutics"}, "estimatedSalary": null, "jobDescription": "Senior Scientist/Scientist, NonclinicalAbout Audentes Therapeutics Audentes Therapeutics (NASDAQ:BOLD) is a biotechnology company committed to the development and commercialization of innovative new gene therapy treatments for people with serious rare diseases. We are a focused, experienced and passionate team driven by the goal of improving the lives of patients.  We currently have four products in development, AT132 for the treatment of X-Linked Myotubular Myopathy (XLMTM), AT342 for the treatment of Crigler-Najjar Syndrome, AT307 for the treatment of CASQ2-related Catecholaminergic Polymorphic Ventricular Tachycardia (CPVT), and AT982 for the treatment of Pompe disease.  Audentes takes pride in strong, global relationships with the patient, research, and medical communities, and we take equal pride in carefully selecting our colleagues. If you believe you match what we're looking for, we'd love to hear from you. Our compensation philosophy embodies what you'd expect from an innovative life sciences employer competing for the best talent available.  Listed below is a current opening for which we are seeking smart, driven, experienced, and just plain nice people to join us in realizing Audentes' mission. The Role and Responsibilities Reporting to the Director, Nonclinical, and as an integral member of the Development Group, the Scientist/Sr Scientist, Nonclinical Development will play a critical role in developing, implementing and executing the nonclinical strategy for Audentes' nonclinical development programs. Leveraging and harnessing Audentes' core competencies in AAV gene therapy, the role is responsible for executing translational capabilities in orphan indications including inherited muscular disorders, cardiovascular disorders, liver disease and potentially other disease areas and targets.  This position closely works with Research, Immunology, BioAnalytical Development, Regulatory Affairs, and Core team members providing nonclinical pharmacology and toxicology expertise for early and late stage development programs.  Specific responsibilities include but are not limited to: S/he will be responsible for overseeing, managing, and contracting all non-GLP and GLP outsourced nonclinical development studies with Contract Research Organizations, expert consultants and academic laboratoriesReview, edit, and finalize GLP and non-GLP nonclinical study protocols, amendments, and study reports ensuring that documents meet global regulatory and compliance requirements and project timelines.Write, edit, and finalize nonclinical sections of regulatory documents and filings and play a key role in interactions with global health authorities.Analyze, interpret, and summarize nonclinical safety data and present data to internal project and senior management teams and to global health authorities.In close collaboration with scientists in Process Development, Immunology and Research, develop and assess safety biomarkers and PK/PD/safety analyses into overall nonclinical development plan for Audentes' programs.Develop, and write, position papers on safety, pharmacology and mode of action to support product developmentDevelop safety-related issue mitigation or resolution plans and coordinate execution of the experimental plan as requiredMaintain a current understanding of pharmacology and toxicology literature and methodology, as well as the scientific literature related to the specific drug discovery projectsReview and summarize pharmacology and toxicology literature as well as databases in support of development projects and safety assessments.Required Skills and ExperiencePhD, MS or DVM with 5 years of pharmaceutical or biotechnology industry experience in a similar roleExpertise with animal models and designing experiments for biologics that closely correlate with clinical outcomes and predicted safety and efficacy.Familiarity with worldwide nonclinical testing guidelines to support clinical development and registrational filings.Familiarity with product quality, bioanalytical assay development and validation.Familiarity in developing IND testing programs and in preparing IND and BLA/MAA filings.Excellent oral, written presentation and communication skills.Ability to travel and monitor outsourced studies.Preferred Education, Skills and ExperiencesExperience in translational medicine.Experience with genetically based animal models of disease, including establishment of novel lines and developing colonies of animals for use in research studies.Robust understanding of gene therapy concepts and methodology, in particular as it relates to nonclinical study design and analytics.Board certification in toxicology. (ref. 11020)"}