{"jobID": "2737958438", "jobLocation": "Flint_MI", "jobTitle": "Healthcare Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.diplomat.is", "Headquarters": "Flint, MI", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Public (DPLO) ", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "Education/Experience: Bachelor’s degree (B.A./B.S.) from four-year college or university required. Two plus years of experience in business and data analysis. Proficiency with application of statistical tests and data visualization. Experience in pharmacy, healthcare, quality, or the pharmaceutical industry preferred. Experience with Report Builder and Tableau preferred. Duties and Responsibilities include the following. Cleans, analyzes, and distills data as it relates to clinical management programs (CMPs), quality initiatives and education and training.Assists in the development and monitoring of quality indicators.Performs root cause analysis and suggests action items for quality improvement based on review of quality indicators.Provides support for data-driven decision making in the Clinical Oversight Committee (COC) and Quality Management Committee (QMC).Updates key stakeholders with service level target deficiency alerts.Tracks and trends data sets over time, establishing control limits, as appropriate and collaborating on action plans for improvement based on analyses.Documents and reports on contractually obligated clinical metrics (e.g., MPR).Supports strategic plan development as needed.Handles troubleshooting and manages multiple projects.Maintains appropriate levels of communication and presents findings of data analyses to team and relevant stakeholders.Participates in team-based initiatives to implement solutions based on data.Collaborates with stakeholders to ensure data integrity and system support for collection of relevant data.Facilitates data collection and analysis activities for complex data sets, interprets complex data requests, designs data capture tools, and develops analytical reports and dashboards.Provides in-depth analysis on internal and external surveys, such as patient and prescriber satisfaction surveys.Serves as a subject matter expert on analytics tools relevant to the education and quality department.Obtains and uses benchmarks where necessary in reports.Validates data elements and leads activities to improve accuracy.Provides statistical and analytical support and education to team, including residents and interns, for applicable research/quality projects.Contributes to complex projects by proposing appropriate tools for data management and activity facilitation.Performs other duties and responsibilities as assigned.Qualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are a representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Language Ability: Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, business correspondence, and procedure manuals. Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public. Math Ability: Ability to comprehend and apply principles of modern algebra and advanced statistical theory while analyzing data and generating reports. Reasoning Ability: Ability to apply principles of logical or scientific thinking to a wide range of intellectual and practical problems. Ability to deal with nonverbal symbolism (formulas, scientific equations, graphs, etc.) in its most difficult phases. Ability to deal with a variety of abstract and concrete variables. Computer Skills: To perform this job successfully, an individual should have knowledge of Microsoft products and Tableau. Knowledge, Skills and Other Abilities:Good time management and organizational skillsOral and written communication skillsWorkplace professionalismDetailedKnowledge of quality assurance best practices and methodologiesProficiency with application of statistical methods and data visualizationData analysis, data verification, and problem-solving skillsAbility to take initiativeKnowledge of the organization’s goals and objectivesAbility to communicate ideas in both technical and user-friendly languageAbility to prioritize and execute tasks in a high-pressure environment to meet deadlinesAbility to work well with various personalities within a teamAbility to maintain confidentiality and work independentlyWorking knowledge of Tableau, Report Builder, Excel, Access, LMS and other reporting toolsPhysical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee is regularly required to talk or hear. The employee is frequently required to walk; sit and use hands. The employee is occasionally required to stand."}