{"jobID": "2746631881", "jobLocation": "San_Jose_CA", "jobTitle": "Applied Deep Learning Scientist", "companyRating": null, "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": null, "jobDescription": "Job Description we live in a moment of remarkable change and opportunity. Data and technology are transforming industries, society, and even the workplaceby creating professions that did not exist before the emergence of data, cloud, social, and mobile. As the largest technology and consulting employer in the world, IBM is a leader in this global transformation and just the place to continue your career.  Position will support existing team of specialists working on enterprise use-cases, specifically tasked with the transformation of IBMs internal business practices to be more AI centric. Secondary role will be that to move certain derivative works to product and work with existing enterprise clients on their own journey.  Required Technical and Professional Expertise Bachelor degree in computing science, comp engineering, stats, mathematics or other relevant field1-5 yrs experience in applying machine learning to applied use-cases Preferred Tech and Prof Experience PhD in computing science, comp engineering with focus on Machine Learning, Deep Learning, Search, OptimizationFundamental understanding of Machine Learning with relevant publications in AI, ML, DLProductization experience, i.e. movement of research to product or new product designenterprise use-cases and applying ML & DL techniques EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}