{"jobID": "2781970844", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Quality Improvement", "companyRating": "3.8", "companyInfo": {"Website": "www.rush.edu", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1837", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " Rush University Medical Center is looking for Data Analyst  The Data Analyst is responsible for supporting inpatient and ambulatory quality improvement initiatives with applicable data, information and insights. This includes data management, data analysis, report generation and education of staff. Exemplifies the Rush mission, vision and values and acts in accordance with Rush policies and procedures. Principal Duties and Responsibilities:Performs analysis of the quality and performance initiatives throughout the medical center as assigned.Organizes and analyzes clinical and administrative data from multiple sources and synthesizes results into meaningful reports and presentation.Creates audience appropriate data interpretation and detailed Power Point presentations with an audience ranging from senior management, department leadership, hospital administration, and clinical department and staff.Prepares complex quality analyses utilizing benchmark data from a number of sources as appropriate. Identifies and compiles data from multiple sources to produce and distribute reports to support the QI process.Validates externally reported data with internal source data.Works with databases for clinical outcomes and performs statistical analysis to evaluate clinical quality performance and opportunities for improvement.Assists the Performance Improvement Consultants in the development of metrics to support the quality improvement plan.Establishes relationships with various departments in the hospital to obtain and validate quality data.Collaborates with Information Services, Knowledge Management or designee to extract and analyze complex data/information requests.Partners with Finance Decision Support to incorporate financial data with clinical/quality information.Performs clinical abstraction from the medical record as needed for report validation.Supports the education of clinical and management staff in the use of risk-adjusted outcomes data.Maintains the confidentiality of all internal correspondence as well as with external entitiesOther relevant DutiesKnowledge, Skills and Abilities:Bachelor’s degree required, Master’s degree preferredTwo or more years of relevant experience requiredIn-depth knowledge of statistical concepts in the development of methodology, data collection, and analyses required Extensive knowledge of the domain of clinical quality data and outcomes, including risk adjustment methodology Extensive knowledge of medical record coding processes and medical record terminology.Data management experience requiredKnowledgeable in database rules, writing queries, and relational database creation and management (create, query, relate) Knowledge of the patient care process requiredCompany Highlights:Rush's new 14-story hospital is the cornerstone of the Rush Transformation, an ongoing effort to build new facilities, renovate existing buildings and adopt new technology.Rush University Medical Center is a three time Magnet facility located in Chicago, IL - www.rush.eduLeading academic medical center, acute care hospital w/ 676 licensed beds. Rush University Medical Center is an Equal Opportunity Employer that welcomes and encourages all applicants to apply regardless of age, race, sex, religion, color, national origin, disability, veteran status, sexual orientation, gender identity and/or expression, marital or parental status, ancestry, citizenship status, pregnancy or other reason prohibited by law."}