{"jobID": "2753230765", "jobLocation": "San_Rafael_CA", "jobTitle": "80% FTE- Class B Driver", "companyRating": null, "companyInfo": {"Website": "www.villa-marin.com", "Headquarters": "San Rafael, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "FULL-TIME 80% FTE – 32 hours per week. CLASS B DRIVER W/ PASSENGER ENDORSEMENT FOR SENIOR CONDOMINIUM/HEALTHCARE COMMUNITY Senior Retirement Condominium/Healthcare Community in San Rafael is seeking a Full-Time, 80% FTE 32 hours per week, Class B w/ passenger endorsement to join our team. The right candidate for this position must be available to work Monday through Friday, with the flexibility to include some evenings and weekends for scheduled special activities throughout each month. Previous experience working with Senior citizens a plus.  SCHEDULE: Monday Through Thursday-6 hour shifts, Friday-8 hour shift. 32 hours per week and the flexibility to include some nights and weekends for scheduled special activities throughout each month. Rate of pay $18.00 per hour plus stipend for Class B license KNOWLEDGE/SKILLS: Must have a California Class B driver license with passenger endorsement and clean driving record to drive vehicles carrying 10 or more passengers. Knowledge of DOT (Department of Transportation) regulations a plus. A class B license is necessary for driving commercial vehicles with a gross vehicle weight rating (GVWR) of 26,001 pounds or more. Passenger endorsement required. Driver needs to be familiar with the areas between and including San Rafael and Sausalito. Driver also needs to be familiar with the San Francisco area. Ability to safely operate wheelchair lift and knowledgeable of safety procedures for securing wheelchair in bus. Ability and strength to lift and/or seat passengers who are disabled. Ability to be flexible within the existing schedule for emergencies. Transport residents on various trips, tours, medical visits, bank run, shopping days, and errands within the county and city in the agency's class B and non-class B vehicles. Keep open communications with doctor's offices in case of emergencies or problems in appointments. Schedule regular minor maintenance service on facility vehicles. Weekly cleaning of vehicle to include windows, vacuuming of floors, and dusting. Maintain records on vehicle operations. Tact and accuracy in dealing with senior residents and visitors under sometimes trying conditions. Patience and understanding of the elderly. Ability to read and follow basic written and verbal instruction. Physical skills and ability to perform work that requires continual standing, walking, stooping, bending, sitting, and lifting. Knowledge and understanding of and ability to comply with work safety practices and guidelines.  QUALIFICATIONS:  Minimum of two years driver experience with school or seniors. Class B license with passenger endorsement. Must be capable of performing the essential functions of the job, with or without reasonable accommodations. Must meet health assessment requirements as regulated by the California Department of Social Services, including TB testing and fingerprint clearance required by Community Care Licensing through the State of California Department of Justice background check bureau. Must be able to communicate in English, both verbally and in writing, and/or possess sufficient communication skills to perform the tasks required. This Full-time, 80% FTE position offers a rich employee-benefit package: Medical insurance, Dental insurance, Long Term Disability insurance, 401K Retirement Plan with Employer Contribution, Employee Assistance Program, Life Insurance, Paid Vacation, Paid Sick Time & Paid Holidays, and more. If you're interested in applying, please fax your resume and cover letter with the job title \"Full-Time/80% FTE Driver\" in the subject line to (415) 499-1061 or e-mail or mail to Human Resources Department at 100 Thorndale Drive, San Rafael, CA 94903  NO PHONE CALLS PLEASE.  Villa Marin is an Equal Opportunity EmployerPrincipals only. Recruiters, please don't contact this job poster.do NOT contact us with unsolicited services or offers"}