{"jobID": "2805428968", "jobLocation": "Orange_CA", "jobTitle": "Business Data Analyst - Entry Level", "companyRating": "3.3", "companyInfo": {"Website": "www.chrobinson.com", "Headquarters": "Eden Prairie, MN", "Size": "10000+ employees", "Founded": " 1905", "Type": " Company - Public (CHRW) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Whats the opportunity? We are seeking an intelligent, creative and motivated individual to help drive positive growth using data, insight and innovation. The Business Analyst will be responsible for creating solutions to empower decision makers and support key job functions across a wide range of business categories. The role will have a high degree of office interaction as well as coding, analytics, and automated process development. This individual will be challenged daily to juggle and prioritize multiple initiatives, with an emphasis on accuracy and completeness. Most importantly, they will be in a highly visible role with opportunity for personal development and career advancement. An ideal candidate should supplement technical and quantitative acumen with a desire to learn, apply, create and innovate. What will you be doing?Reporting:Create reports from multiple data sources to support the businessBuild ad-hoc reporting as needed by the businessImprove reporting suite and process for maximum utility and effectivenessEfficiency:Support objectives to improve efficiency within various teams in the business through the use of data, process changes and basic programmingWork with teams and leadership to drive automation in our execution servicesPricing:Support the office pricing team and strategy through a data management function, pricing function, and develop automation to improve the efficiency of our pricing process where applicableAudit:Be accountable for daily, weekly and monthly financial auditsCore Competencies:Develop and actively support strategic office initiativesExtract and interpret data to answer ambiguous questions working directly with personnelInvolved in business process review and execution consultation across various rolesCreate unique reporting perspectives to empower decision makersPursue and deliver an efficient reporting platform for usersTrain and mentor colleagues to understand and apply the available information tools and resources to drive a culture of analytics and assure fact based decision makingWork closely with Regional Analyst and EBAOngoing training in the area of report development and analytical techniquesServe as subject matter expert on the reporting and analyticsExplore best practices and solutions intended to make improvement to office performanceManage multiple priorities at one time successfullyCapable of developing quantitative metrics to score the results of key business initiativesUnderstand and promote core tools delivered in Navisphere AnalyticsProvide feedback to EBA for Navisphere Analytics enhancementsWhat are we looking for?BA/BS degree highly preferredStrong system aptitude:Advanced knowledge and skills with Microsoft products required, especially in Excel and AccessVBA, Power Pivot and SQL experience preferredExperience in assuring data and process governance and data quality preferredExperience using various reporting and analytical tools preferredKnowledge and programming skills in Python, Java, Auto Hot Key or similar preferred"}