{"jobID": "2795240336", "jobLocation": "Sunnyvale_CA", "jobTitle": "Lead Data Scientist - Haskell", "companyRating": "3.4", "companyInfo": {"Website": "www.target.com", "Headquarters": "Minneapolis, MN", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (TGT) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Description:Target is looking for engineers and  data scientists to work on supply chain optimization. This includes designing mathematical  models, writing simulations, and engineering systems that operate on a national  scale.  You should apply if you are  interested in some combination of functional programming, mathematical modeling  and data science. Domain expertise in supply chain optimization isnt  necessaryyou will learn about supply chains on the job. Our team has deep experience  in a wide range of areas and we emphasize both learning and teaching within the  group. You will:Develop optimization  algorithms and heuristics as well as simulation models that impact  day-to-day operation in Targets supply chain network.Identify and solve  complex problems in inventory control, warehouse operation, transportation  optimization and vendor ordering.Work closely with  business units to understand and help design Targets supply chain  operations.Develop and deploy  services that operate in production environments at scale.Requirements:Interest in  learning skills across different fields: mathematics, physics, machine  learning, data science, econometrics, and/or operations research.Familiarity with  functional programming and denotational design in Scala and/or Haskell.Strong data  analysis and problem-solving skills.Bonus:Experience  designing, deploying, and scaling production Haskell services.Programming  language design and compiler development experience.Strong understanding  of computer systems: distributed systems, cluster computing, operating  systems, etc.About Supply Chain Optimization at Target: Were a multi-disciplinary team of experts in statistics,  optimization, machine-learning, operations research, distributed systems,  compilers, and functional programming. We work closely with business and  infrastructure teams to build systems that manage and optimize operations across  Targets entire supply chain: purchasing, inventory management, warehouse operation and transportation.Qualifications:"}