{"jobID": "2790120384", "jobLocation": "San_Francisco_CA", "jobTitle": "Customer Service Representative", "companyRating": "3.6", "companyInfo": {"Website": "www.sfhp.org", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "22", "jobDescription": " OverviewPOSITION SUMMARY The Customer Service Representative (CSR) is responsible for serving San Francisco Health Plan customers, providing timely, appropriate and linguistically competent information to all inquiries. The CSR works with the specialist and supervisor to complete assigned tasks and achieve departmental goals. This is a temporary assignment for 4-6 months. The core work schedule is Monday to Friday from 8:30 AM to 5:30 PM.WHAT YOU WILL DOCall members to complete Health Risk Assessment (HRA), Health Information Form (HIF), and Member Evaluation Tool (MET) assessments and log the assessments data.Prepare reports.Conduct member outreach.Process returned mails.Compile and enter electronic data.Perform assigned administrative duties.Respond to customer requests, questions, concerns, and complaints in a timely, respectful, caring and competent manner.Answer telephone calls promptly and minimizes delays that may lead to abandoned calls.Verify member eligibility.Complete all training programs as required.Provide coverage of all areas under the responsibility of Customer Service.Assist members in contacting business partners or other entities related to customers' covered or non-covered services.Perform other duties/tasks as assigned.WHAT YOU WILL BRINGExperience in customer service, call center, or related field.Prior experience in health care and knowledge of managed care Medi-Cal preferredEquivalent professional experience in health plan administration or healthcare operations acceptableA bilingual language skill in English and Spanish (Cantonese/Mandarin) requiredExcellent communication skills with a high degree of professionalism, including discretion in working with confidential informationExemplary interpersonal and customer service skillsDemonstrated professionalism, poise, tact, and diplomacy in interactions with others, and with people of diverse backgrounds.Ability to work effectively and efficiently in a team environment.Independence with minimal supervision in a diverse and performance based environment where productivity is measured.Computer literate in an MS Office environment, customer management and managed care system applications.Strong motivation and dependabilityExcellent attendance record.BA/BS Degree is preferred; can be substituted by two years of work experience related to customer service, or related fieldSan Francisco Health Plan is an Equal Opportunity Employer (EOE) M/F/D/VPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.ABOUT US Established in 1997, San Francisco Health Plan (SFHP) is a an award winning, managed care health plan whose mission is to provide affordable health care coverage to the underserved low and moderate-income residents in San Francisco county. SFHP is chosen by eight out of every ten San Francisco Medi-Cal managed care enrollees and its 145,000+ members have access to a full spectrum of medical services including preventive care, specialty care, hospitalization, prescription drugs, and family planning services. SFHP was designed by and for the residents it serves, and takes great pride in its ability to accommodate a diverse population that includes young adults, seniors, and people with disabilities."}