{"jobID": "2816126883", "jobLocation": "Saint_Louis_MI", "jobTitle": "Senior Scientist", "companyRating": "2.7", "companyInfo": {"Website": "www.sensient.com", "Headquarters": "Milwaukee, WI", "Size": "1001 to 5000 employees", "Founded": " 1882", "Type": " Company - Public (SXT) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " International Flavors & Fragrances, McCormick & Company, D. D. Williamson"}, "estimatedSalary": "118000", "jobDescription": "Job Summary Sensient Technologies is seeking an experienced agronomist to join our Worldwide Supply Chain team. We only handle small crops of several hectares and specialties. The position is located in St Louis, Missouri area.The role will manage a program of laboratory-based crop development in vegetable, flowers, and other crops with the objective of delivering innovative solutions to natural color and foodstuff challenges. The ideal candidate will combine a thorough understanding of crop agronomy /physiology with experience in designing and executing experiments to test and develop novel technologies to deliver improved color yield and quality whilst optimizing productivity.Through external research partnerships and in-house projects this person will deliver knowledge and insights on the target crops which will directly address business challenges in productivity, quality, and safety. This role requires a unique combination of hands-on science and project experience working across the Company’s worldwide operations.The position reports to the Senior Agronomist.ResponsibilitiesConducts elicitor and other pigment enhancement experiments under controlled environment conditionsConducts pollination and population development under controlled environmentImplements field trials to validate results of controlled environment experiments and reduce it to practice under field conditionCoordinates validation of controlled environment experiments in the field with regional agronomistsImplements germplasm adaptation trials, preliminary and advanced yield trials of breeding materials in North AmericaManages and maintains the global seed bank for Sensient botanical colorants and coordinates with regional seed bank managersAssists in the establishment of regional seed banks for Sensient botanical colorantsCollects, analyzes, and summarizes dataWrites timely and accurate monthly and annual reportsAmenable to 15\" combined domestic and international travelEducation & ExperienceBS/MS (Agronomy or related plant science.20 years experience in agricultureThe ideal candidate will combine a fundamental understanding of crop agronomy with hands-on experience in designing and executing field experiments to test and develop new technologiesExpertise in experimental design of field and lab based experiments, data management and statistical interpretation is required. Experience in crop modeling an advantage.Demonstrated ability to explain complex crop physiology concepts to other scientists and to non-technical business partners.Visionary, entrepreneurial, and innovative attitude and out of the box thinking strongly preferred.Demonstrated ability to execute projects within a project management framework and a large degree of independence.Ability to balance need to deliver aggressive business innovation goals with scientific excellence.Familiar with organic plantations.Understanding how to influence the active ingredients of a plant.Familiar with harvesting methods of specialty crops like flowers, herbs, etc. and able to develop new methods together with partners.Contacts to farmers and processors in the US preferred small scale or pharmaceutical herbsAble to manage and drive cross functional projects globallyAbout Sensient ColorsSensient Color Group is a leading developer, producer and supplier of natural and synthetic color systems for customers around the globe. The Company's high-performance products play a central role in the manufacture of foods and beverages, cosmetic and pharmaceutical colors and coatings, inks for commercial and consumer printers, and colors for agricultural uses, household cleaners and paper products. The Color Group is located in St. Louis, Missouri.About Sensient Technologies CorporationSensient Technologies Corporation is a leading global manufacturer and marketer of colors, flavors, and fragrances. Sensient employs advanced technologies at facilities around the world to develop specialty food and beverage systems, cosmetic and pharmaceutical systems, inkjet and specialty inks and colors, and other specialty and fine chemicals. The Company's customers include major international manufacturers representing most of the world's best-known brands. Sensient is headquartered in Milwaukee, Wisconsin.As a dynamic and diversified global leader, we offer an excellent salary and comprehensive benefits package. For more information, visit our website at http://www.sensient.com.Equal Opportunity Employer#LI-JBRO"}