{"jobID": "2673616917", "jobLocation": "Los_Angeles_CA", "jobTitle": "Lead Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.rechargepayments.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " With over 10,000 Shopify merchants launching subscriptions and over 1,000,000 subscribers powered by ReCharge, we have a lot of data to crunch. Thats why were looking for our next great data expert!  In this critical role, youll help US develop a deeper understanding of the metrics that make our website and platform successful, along with how they should be modeled and reported on.  Youll be the first person to drive our analysis and dive into our massive data set to provide as much data-driven insight into all aspects of our own business and our merchants business. Youll need to be amazing at coming up with new, meaningful metrics to measure the success of ReCharge core product. Does this sound like you?You are self-driven and comfortable with ambiguity.You are diplomatic. You use your talents to build consensus among your peers by getting them talking and helping to reach a common goal.Youre resourceful. While you'll be reporting to the CEO, you'll be working closely with Marketing and Development teams across the company and will need to allocate your time accordingly.You are equal parts technical and functional (and both are exceptionally strong), and you are equally comfortable and effective at presenting to technical or business leaders.You have a passion for problem solving. You come up with hypotheses and often have strong opinions around their conclusions.You limit your commitments to tasks that are aligned with your highest priorities.Responsibilities:Drive strategy-level discussions with the CEO, CTO and Head of Growth.Develop new reports, frameworks, dashboards, and other tools for the growth and product teams.Build new weekly and monthly reports that indicate trends within the business.Build and analyze new data models that map vital aspects of merchants business such as churn rates and average order value by vertical.Requirements:5+ years of experience with SQL; proven track record using data analysis to drive better business outcomes.Experience managing core datasets for a B2B SaaS platformStrong proficiency with at least one language for data analysis, such as R or PythonVisualization: Mode Analytics (preferred), Matplotlib or TableauComfortable working closely with a development team and executive leadershipAbout ReCharge: We have two missions at ReCharge: make it easy for people to sell subscription products online, and make our company an amazing place to work. The first mission began as three people working out of a small apartment, trying to solve one of the biggest problems facing Shopify merchants: recurring payments. Now were at the forefront of recurring billing software, empowering thousands of entrepreneurs to sell their products as subscriptions, and processing tens of millions of dollars in sales every week.  Our culture is remote-first and we stay connected every day using Slack and video chat. Being part of a small, fast-growing company is exciting: the opportunities to grow and take ownership at ReCharge are endless and well make sure you have everything you need to do your best work and make a big impact. ReCharge is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}