{"jobID": "2613607938", "jobLocation": "Arlington_VA", "jobTitle": "Info Syst Training Specialist", "companyRating": "2.9", "companyInfo": {"Website": "www.chenega.com", "Headquarters": "Anchorage, AK", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " ASRC Energy"}, "estimatedSalary": "65000", "jobDescription": "TIME SOLUTIONS, LLCCompany Job Title:Info Systems Training Spec-DEAChenega Job Title:Analyst II, TrainingClearance:SecretLocation:Arlington, VAReports To:Project ManagerFLSA Status:Regular, Full-time, Hourly, Non-ExemptPrepared Date:12/14/2017Approved Date: 12/14/2017Summary: Time Solutions, LLC is seeking an Information Systems Training Specialist to provide support and leadership for the Drug Enforcement Administration (DEA) Firebird project.Essential Duties and Responsibilities: (Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of this position)· Coordinate with Program Managers to develop course objectives and training requirements.· Produce, revise, and maintain all necessary training materials. Training materials to include, but not limited to, Instructor Guide, Training Manual, Reference Guide, Functional Handout, and course critique form, shall be available in electronic format, Portable Document Format (PDF), and paper forms.· Instruct classes with varied time frames, curricula, and student knowledge levels.· As requested, travel to Field Offices to provide onsite assistance to users in support of DEA applications.· Provide field training support to DEA staff and agents on recently deployed software and devices.· Conduct basic training sessions attended by up to thirty (30) students per session.· Set up temporary classrooms using Firebird workstations or DEA’s Mobile training classroom when needed.· Maintain an up-to-date inventory of all training equipment in an electronic format.· Respond to assigned Service Manager work tickets for job related tasks.· Provide on-site staff assistance to the service desk for service calls pertaining to Firebird applications.· Manage multiple schedules, milestones, and deadlines with little supervision.· Develop and maintain relationships with the client and provide customer service.· Work with the subject matter experts to define course content.· Demonstrate correct training techniques as established by the client.Non-Essential Duties:· Other duties as assigned.Supervisory Responsibilities: · None.Minimum Qualifications: (To perform this job successfully, an individual must be able to perform each essential duty satisfactorily.) · Bachelor’s Degree in applicable field of study and minimum of one year of training experience.· Active secret clearance or the ability to obtain a secret clearance is required.Knowledge, Skills and Abilities:· Ability to work independently, as well as with a team.· Ability to write and speak clearly and informatively.· Skilled at editing work for spelling and grammar and varying writing styles to meet needs.· Ability to gather and analyze information effectively.· Ability to prioritize and plan work activities; uses time efficiently.Diversity: · Shows respect and sensitivity for cultural differences; Educates others on the value of diversity; Promotes a harassment-free environment; Builds a diverse workforce.Ethics: · Treats people with respect; Keeps commitments; Inspires the trust of others; Works with integrity and ethically; Upholds organizational values.Physical Demands: · The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.· While performing the duties of this Job, the employee is regularly required to sit and talk or hear. The employee is frequently required to walk; use hands to finger, handle, or feel and reach with hands and arms. The employee is occasionally required to stand; climb or balance and stoop, kneel, crouch, or crawl. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision.Work Environment:· The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job.· The employee will normally work in a temperature-controlled office environment, with frequent exposure to electronic office equipment.· During visits to areas of operations, may be exposed to extreme cold or hot weather conditions. Is occasionally exposed to fumes or airborne particles, toxic or caustic chemicals, and loud noise.Chenega Corporation and family of companies is an EOE. Equal Opportunity Employer Minorities/Women/Veterans/Disabled/Sexual Orientation/Gender Identity Native preference under PL 93-638. We participate in the E-Verify Employment Verification Program.M#Minimum Qualifications: (To perform this job successfully, an individual must be able to perform each essential duty satisfactorily.) · Bachelor’s Degree in applicable field of study and minimum of one year of training experience.· Active secret clearance or the ability to obtain a secret clearance is required."}