{"jobID": "2825686198", "jobLocation": "Westwood_CA", "jobTitle": "Compliance Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.uclahealthcareers.org", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cedars-Sinai Medical Center, Loma Linda University Medical Center, Harbor Hospital"}, "estimatedSalary": "65000", "jobDescription": "ResponsibilitiesDrive excellence in data analysis in support of critical compliance efforts. Play an important role with a world-class health system. Take your professional expertise to the next level. You can do all this and more at UCLA Health.  As a Compliance Data Analyst, you will be responsible for independently gathering data as well as providing analysis, and reporting of risk and compliance data. You will also manage, configure, and design our Governance, Risk, and Compliance (GRC) software tool - Compliance 360. Your key duties will include:  Participating in the design, development, testing, installation and configuration of new GRC system implementations, upgrades and maintenance.  Making recommendations for improvements to GRC and reporting requests.  Working directly with GRC vendor to analyze and resolve technical issues.  Gathering, analyzing and evaluating risk and risk related data.  Creating reports using SQL, Tableau and other technologies.  Delivering actionable analytical results.  Writing SQL queries and creating end-user reports.  Performing data scrubbing, trouble-shooting, quality checking, and usability analysis.  Maintaining and updating the OCS website  UCLA Health is a world-renowned health system with four award-winning hospitals and dozens of primary care practices, specialty practices, urgent care centers and other ancillary locations throughout metro Los Angeles. Through the efforts of our outstanding people, we have become Los Angeles' trusted provider of exceptional, compassionate patient care. If you're looking to experience greater challenge and fulfillment in your career, you can at UCLA Health.QualificationsWe're seeking a tech-savvy professional with a strong understanding of databases and data analysis procedures. You must have:  Expert knowledge of SQL, relational and dimensional data modeling.  Working knowledge of SQL Server Management Studio (SSMS) and SQL Server Integration Services (SSIS).  Demonstrated knowledge of business intelligence tools, including Tableau, Crystal Reports, or SQL Server Reporting Services.  Proficiency with Excel, Word, PowerPoint, Visio, and Adobe Acrobat Professional.  Ability to work unusual hours to resolve critical problems.  Strong communication, documentation, presentation and troubleshooting skills.  Ability to perform effectively with frequent interruptions and distractions.  Experience with Compliance 360 or other GRC tool preferred.  CHC, CHPC certification a plus.  Knowledge of HTML5, JavaScript, CSS, web design fundamentals highly desirable."}