{"jobID": "2646434426", "jobLocation": "Chicago_IL", "jobTitle": "Product Development Scientist I", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Product Development Scientist I (CPG / Natural Food / Baking / Manufacturing)COMPANY DESCRIPTION Simple Mills is a rapidly-growing Chicago-based company on the forefront of the clean food movement, transforming center store grocery aisles with products made from simple, whole food, nutrient dense ingredients. In the company’s short four-year history, Simple Mills has become the #1 bestselling natural baking mix, the #1 bestselling natural cracker, and the #2 bestselling natural cookie.  Distributed in 12,000+ grocery stores nationally from Whole Foods to Target and Meijer, the brand has also earned broad recognition ranging from a Chicago Innovation Award and a “Fab Five” rating on Instacart as one of the top trending food products in 2017, to product awards from Good Housekeeping, Prevention, Self, Clean Eating, Delicious Living, Paleo Magazine, Yoga Journal and more. In addition, company founder and CEO Katlin Smith has been recognized in the Forbes 30 Under 30, Inc. 30 Under 30, and Progressive Grocer Top Woman in Grocery competitions.  The company’s mission is to provide simple, wholesome, convenient foods that taste great; eliminate processed, artificial, GMO, high-carbohydrate, nutrition-empty ingredients; and both support and encourage healthy eating habits. It’s that Simple. ROLE DESCRIPTION The Product Development Scientist I will be a critical role in helping to develop Simple Mills’ products. The position will report to the R&D; Manager and will work on both new and existing Simple Mills products. Responsibilities will include: Partnering with the R&D; Manager to develop new Simple Mills recipes, identify iterations, and solve potential recipe challenges.Channeling creative ideas and solutions from across the organization to improve the flavor, texture, nutrition, quality, or cost profile of Simple Mills products.Partnering with the R&D; Manager to commercialize new products or make modifications to existing products in the manufacturing facilities.Working with the Procurement Manager to source and test unconventional natural ingredients to help solve for product parameters.Identifying and partnering with outside food scientists to gain additional expertise as necessary.Requirements1 - 3 years’ experience in food science or a related position, working with similar product lines (baked items, cookies, crackers, etc.)BS Degree or equivalent (ideally in food science, engineering, or related field)Advanced Excel proficiency (ability to structure data, utilize advanced formulas, analyze data, manipulate and cross-reference different sheets)Structured thinking processes to methodically test sets of variablesA passion for natural food and healthy eating as well as a desire to change the way we think about ingredient labelsA strong attention to detail, tenacity, and a strong sense of urgencyThe position requires 20 – 40% travelBenefitsHave a direct impact on a brand experiencing explosive growthGain exposure to areas of the business beyond your functional area as everyone on our team wears many different hatsBe a part of a talented team driven by a mission to make healthy, tasty food broadly available, positively influencing the way America eatsEnjoy competitive employee benefits including health, dental, vision, disability, FSA/DCA account options, Commuter Reimbursement Plan, and a 401(k) plan We are seeking high-energy individuals who are motivated by challenges, thrive in a fast-paced environment, and have a desire to make a positive impact on the food industry. Compensation will be competitive for the ideal candidate. The position is for an immediate start in Chicago. In your cover letter, we’d like to know why you want to join Simple Mills, any relevant skills for the position, what foods we would find in your house if we paid you a surprise visit, and two food brands you admire most (and why).  Simple Mills is an Equal Opportunity Employer."}