{"jobID": "2788812944", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.capitalgames.com", "Headquarters": "Sacramento, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "147000", "jobDescription": " Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets.  The Data Scientist position is part of the Data Science team within the Global Analytics and Insights group in Electronic Art’s Global Marketing Organization. A successful candidate will use his or her expertise in applied machine learning to drive critical decisions in a cross-functional environment. For a more senior candidate there will be opportunities for project management and mentoring of junior data scientists. ResponsibilitiesResearch, design, implement and validate models and cutting edge algorithms to analyze diverse sources of data.Use big data technologies to scale predictive models to millions of players.Manage and deliver business-driving analytical projects.Develop tools and libraries for the broader analytics group.Communicate actionable results and findings derived from data throughout the organization in a clear, concise wayCollaborate with other areas of the business on long-term projectsLearn, implement and share new methodologies.AttributesEager to use data for insights and has a demonstrated passion for applying data science to make business critical decisions and recommendations.Hypothesis driven – uses data to test ideas rigorously and objectively.Able to create compelling communication for executives.Strong programming skills and a passion for data science.Flexible and adaptable while maintaining positive attitudeSelf starter with passion, energy, enthusiasm to drive results and affect meaningful changeViews challenges as opportunities; tenacious and focusedSolution oriented, creative problem solverA team player who is able to work collaboratively within the group and across business units/functionsAbility to execute multiple projects and drive key business results under tight deadlines.BackgroundMaster’s degree required, preferred in Computer ScienceDemonstrated experience applying Data Science methodologies to real world problems.Experience in scaling up smaller projects and sharing work collaboratively across a wider team.Expert status in analyzing extremely large, complex, multi-dimensional data sets with a variety of tools Strong programming experience in a system programming language such as C/C++ or Java.Familiarity with at least one scripting language: R, Python, or Scala.Experience using SQL to query databases.Experience with any of the following is a big plus: Big data technologies such as Hadoop, MapReduce, Hive, PigModel production in SparkApplication deployment using AWS, Virtual Machines, or DockerSufficient data warehouse and non-relational data techniques knowledge to work effectively with engineering partners.Ability to communicate insights using PowerPoint, Word and Excel to technical and non-technical audiencesWhat’s in it for you? Glad you asked! We love to brag about our great perks like comprehensive health and benefit packages, tuition reimbursement, 401k company match and, of course, many other perks! And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives off of creativity and individuality. At EA, we live the “work hard/play hard” credo every day.  More about our location: https://www.ea.com/careers/careers-overview/redwood-shores  Contact our Recruiter: Andrew Courtemanche - acourtemanche@ea.com EA is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status or veteran status. We will also consider for employment qualified applicants with criminal records in accordance with applicable law."}