{"jobID": "2831965997", "jobLocation": "Ne_Jersey", "jobTitle": "Business / Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.rbc.com", "Headquarters": "Toronto, Canada", "Size": "10000+ employees", "Founded": " 1869", "Type": " Company - Public (RY) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Barclays, Morgan Stanley, TD"}, "estimatedSalary": null, "jobDescription": "Job Description What is the opportunity?  Perform business analysis and independently manage deliverables on assigned projects related to Data Governance, to ensure US Data Office strategic goals and objectives are accomplished.  What will you do?  Business Analysis & Documentation Work with Subject Matter Experts and stakeholders to understand business problems and create user stories and business requirements.Translate business requirements and user stories into functional use cases for tool implementation.Define acceptance criteria and create test data for IT solutions by considering all possible outcomes of the use cases.Analyze large data sets to identify underlying data patterns and structuresDefine Data Quality rules and identify Data Quality issues through comprehensive data analysisCreate process maps and Data flow diagrams using tools such as MS VisioDocumentation of requirements, processes and rules.Seek out industry trends and organization knowledge to understand alternative approaches / solutions.Function as a liaison between stakeholders and the project team on assigned issues.Ensure traceability of requirements to deliverables.When assigned, walk stakeholders through requirements and manage expectations regarding scope.Seeks innovative or improved methods to get the work done and implement best practices.Contributes content for end user documentation and training.Recommends business solutions that satisfy sponsor/stakeholder needs continually exploring and assessing options for value-add to clients. Testing When assigned, assists with the development of high level plans for completion of Requirements and Acceptance phases of projects, improving in the level of detail and accuracy of estimates over time.When assigned, contributes to the development and execution of testing, including coordinating system and acceptance testing.Reviews defects arising from testing, including User Acceptance Testing, and works with stakeholders to resolve them.Provides guidance with the definition of a defect as a Change Request or bug. Relationships & Communication Effectively communicates and builds rapport with team members, stakeholders and business partners using a variety of techniques and collaboration from initiation to close.Facilitates small to medium size group meetings and conducts small cross- functional interviews.Prepares and delivers presentations to business partners.Resolves minor conflicts/issues and escalates others as appropriate. Development & Coaching Continually enhances skills and builds knowledge in all aspects of the organization, the business and information systems. What do you need to succeed?  Must-have Undergraduate Degree6 years of experience in relevant industry/function Nice-to-have  Process Knowledge (P) Requirement analysis: interviewing, facilitation, gap analysis, data analysis, business process mapping, and user interface design and mock-up(D) Understanding of Data Quality concepts and processes(B) Understanding of functional and control areas in financial services(D) Knowledge of application test planning and execution(D) Knowledge of data warehousing and business intelligence/rules design concepts and toolsets(P) Knowledge of SDLC: Agile and Waterfall(P) Written and Verbal communication skills(D) Presentation skills (ability to effectively explain the analysis steps and results in the form of a slide deck) Business Knowledge (P) Knowledge of Banking and Capital Markets Products(P) Understanding of front-to-back data flows and processing in Banking and Capital Markets(P) Knowledge of Banking and Capital Markets Regulations such as CCAR, FRTB etc. Technical Knowledge (P) Data Analysis using common tools such as MS Excel, MS Access(P) Data Analysis using analytics tools such as Tableau(D) Understanding of RDBMS concepts and SQL(D) Process/Workflow mapping tools such as MS VisioSkills Reuirement Level Scale:"}