{"jobID": "2830880703", "jobLocation": "Chicago_IL", "jobTitle": "Research Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.uchicago.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1890", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " Department86771 Globus  About the Unit  Job Information Job Summary: The Research Scientist professional works on high-performance computing and data models for the department and implements model-driven, quantifiable and model-based predictions. Works on multi-disciplinary, multi-institutional projects to develop next-generation models that address complex global issues. Responsibilities:Manage multi-scale/sector/model biophysical impact modelingDevelop protocol development for model inter-comparisonProvide principal contributions to scientific or intellectual modelsFacilitate and promote a research projects and contributes to the scientific direction of current research model-based prediction modelsManage research projects including the development of protocols for model inter-comparisonsDevelop and designs workflow automation models Additional Requirements Education and Experience:Education:Required: Ph.D. in PhysicsExperience:Required: A minimum of five years experience researching model-driven data and analysis.Experience facilitating and promoting a research projectExperience contributing to the scientific direction of a research resource and publicizing research resultsRequired Documents:ResumePublication listNOTE: When applying, all required documents MUST be uploaded under the  Resume/CV  section of the application  Benefit EligibilityYes  Pay FrequencyMonthly  Pay Range  Depends on Qualification  Scheduled Weekly Hours37.5  UnionNon-Union  Job is Exempt?Yes  Drug Test Required?No  Does this position require incumbent to operate a vehicle on the job?No  Health Screen Required?No  Posting Date2018-06-26-07:00  Remove from Posting On or Before2018-12-26-08:00 Posting Statement: The University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.  Staff Job seekers in need of a reasonable accommodation to complete the application process should call ************ or submit a request via Applicant Inquiry Form.  The University of Chicago's Annual Security & Fire Safety Report (Report) provides information about University offices and programs that provide safety support, crime and fire statistics, emergency response and communications plans, and other policies and information. The Report can be accessed online at: *********************************** Paper copies of the Report are available, upon request, from the University of Chicago Police Department, 850 E. 61st Street, Chicago, IL 60637."}