{"jobID": "2724987467", "jobLocation": "Santa_Clara_CA", "jobTitle": "Computer Vision Engineering Manager", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "173000", "jobDescription": " NVIDIA is looking for elite and smart, do-it-all software engineers and engineering managers with a Computer Vision background to join the VR Software team. As a member of the VR team, you will work on the VRWorks SDK as well as software development supporting our broad family of GPUs.  Are you an extraordinary Computer Vision Software Engineer or Engineering Manager looking to develop software that solves the toughest challenges in computer vision? Are you passionate about GPU acceleration? Are you comfortable leading and managing a group of top engineers? If so, you could be a great fit for our group! What you’ll be doing: We are currently seeking an experienced software engineer with strong Computer Vision fundamentals and robust C++ skills to manage and lead the development of features in VRWorks - a comprehensive suite of APIs, libraries, and engines that enable application and headset developers to create amazing virtual reality experiences on the Nvidia GPU. You will manage and work alongside brilliant engineers on core technologies, and implement and optimize software to solve challenging computer vision problems, e.g., high-quality 360 Video stitching on NVIDIA GPUs in real timeWe'll give you exposure to the rapidly evolving space of 360 videos, volumetric capture, and light fields, and work on many other groundbreaking features and applications that are transforming our industry.We will see features go through the whole cycle - from proof-of-concept to productionTogether we will communicate with multiple teams in our company, as well as our partners and customers.What we need to see:You'd bring solid understanding of computer vision fundamentals related to camera calibration, depth estimation, structure from motion, object detection, tracking, and SLAM techniquesAlong with your experience with CUDA programming for acceleration on multiple GPUs, you'd have a real passion for uncovering root causing bottlenecks and optimizing performancePossessing strong software engineering and design fundamentals, particularly related to the development of SDKsYou are proficient in C++ with strong software development and debugging skills.With your familiarity with software lifecycle based processes, you are dedicated, fast to act, and self-motivated with excellent analytical skills.You'd be excited to deploy your strong communication skillsYou have a Bachelors in Electrical Engineering or Computer Science (Masters degree preferred).You have 5+ years of experience developing and debugging systems software on Windows. Extraordinary engineers with less experience may be considered.You have 2+ years of experience with leading and managing small teams of engineersWays to stand out from the crowd:Experience with video processing pipelinesYou have experience with at least one graphics library (Direct3D, Vulkan , OpenGL)Implemented one or more virtual reality applications; if you have used NVIDIA’s VRWorks features, it is a significant plusDemonstrated experience of collaborating with geographically diverse cross-functional teamsYou have been responsible for a successful product introduction as an engineering manager NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}