{"jobID": "2795304215", "jobLocation": "San_Francisco_CA", "jobTitle": "Owner's Engineer/Project Engineer - Electric Vehicle", "companyRating": "4.7", "companyInfo": {"Website": "www.ampirical.com", "Headquarters": "Mandeville, LA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Dashiell, Burns & McDonnell, Black & Veatch"}, "estimatedSalary": "81000", "jobDescription": " Job Description  Ampirical is an electrical transmission and distribution engineering company that provides comprehensive customer support, from project conception to design engineering, project management, and construction.  Ampirical is seeking a Owner’s/Project Engineer. This engineer will be responsible for representing Ampirical as an owner’s engineer within the Electric Vehicle Charge Network (EVCN) Department of our client, where they will assist in the management and installation of 7500 level 2 EV charging stations over a three-year period.  The EVCN Project/Owner’s Engineer reports to the Chief Engineer of EVCN and is responsible for providing engineering, quality, and technology aspects of the EVCN deployment, including but not limiting to, reviewing and approving all project drawings by EPC contractors, creating and reviewing EVCN engineering and construction standards, assisting to create standardize major equipment, etc. The candidate should have practicable engineering knowledge and experience with an equivalent of a journey or senior level engineer.  The candidate should have some understanding of how the EV charging stations will impact the electric grid in distribution and transmission level. The candidate may assist Chief Engineer to provide technical advices to other organizations, such as Grid Integration & Innovation (GII), Customer Care and Energy Procurement, on all EV related activities.  RESPONSIBILITIES: Attend project site walks (equivalent to Substation walkdown) to ensure EPC contractor is performing the collecting all the necessary information for the design. 2-3 site walk per week.Review and accept the project design drawings (To the Meter & Behind To Meter) produced by EPC contractorsAssist Chief Engineer to manage, review, approve, and maintain all engineering and construction standards related to EVCN programAssist Chief Engineer to develop, maintain and continue improve the standard drawing template for typical projectAssist Chief Engineer to develop, qualify, and standardize major equipment that are being used in EVCN programTravel to client sites/field/vendor facilities as needed. QUALIFICATIONS: Bachelor’s Degree in Electrical Engineering, Civil Engineering, or Mechanical Engineering or a related technical discipline from an ABET accredited school. Master’s Degree in Engineering and/or MBA strongly preferred.Demonstrated some knowledge in all aspects of engineering and design.Current California PE licenseSome renewable, EV charger, and other technology knowledgeUtility experience in electric transmission, substation, and distribution system is a plusKnowledge in NEC codes, building codes, and ADA codesKnowledge in permitting implication under various Authority Having Jurisdiction (AHJ)Some knowledge in transmission and distribution grid integration plan and strategyKnowledge in renewable and frontier EV technology trendsKnowledge in state and federal regulatory and policy trendsGood communication and interpersonal skill WORK LOCATION:  Client Office in San Francisco  COMPENSATION AND BENEFITS:  Ampirical offers an excellent benefit package including medical, dental, vision; STD, LTD, 401K; life insurance, gym stipend, tuition reimbursement, 10 paid holidays; two weeks’ vacation; flexible work schedule (to possibly include every other Friday off) and more.  Interested in Engineering Power-ful Solutions? Take a look at link below to see why working at Ampirical is much more than a job...  https://youtu.be/ilneslhRWWY"}