{"jobID": "2812526206", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Intelligence Analyst, Sr.", "companyRating": "3.8", "companyInfo": {"Website": "jobs.chla.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1901", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " Give your career the best treatment.  Ready to be part of the first and largest pediatric hospital in Southern California? This is Children's Hospital Los Angeles. A place where you can make a real difference in the lives of our patients and their families. A big responsibility? Absolutely. But if youre up for the challenge, were on the lookout for amazing professionals to join our elite teams talented individuals who can continue our high level of care.  The Business Intelligence Analyst, Sr, under the direction of the Administrator and Director, individual will lead core Strategic and Financial performance processes and analytics. This includes, but is not limited to, business plan development, financial statement analytics, budgeting and forecasting, and supporting business optimization projects. The individual also be responsible for developing and training the junior staff.  Minimum Education: Masters degree in business or healthcare administration with a finance/accounting background required.  Minimum Experience: 3 - 5 years experience in financial planning and analytics. Healthcare experience preferred. Knowledge, Skills and Abilities Required: Expresses oneself clearly and effectively when speaking and/or writing to individuals or groups; listens attentively, ensures that information is understood by all parties; shares information in a timely manner using the appropriate method; presents well-organized information in a group setting.  Is organized and has the ability to manage multiple tasks at one time. Organizes work, sets priorities, and determines resource requirements; determines the necessary sequence of activities needed to achieve goals.  Generates creative approaches to addressing problems and opportunities; identifies and weighs options; makes sound decisions after reviewing all relevant information; anticipates and plans for potential problems; takes calculated risks; recognizes the impact of solutions.  Develops the ability of others to perform and contribute to the organization by providing ongoing feedback and by providing opportunities to learn through formal and informal methods.  Acts professionally and calmly at all times when interacting with others; consistently demonstrates concern and courtesy towards colleagues and customers; treats all people respectfully; takes personal responsibility for correcting problems; follows-up with individuals to ensure satisfaction with the level of service they received.  The ability to efficiently and accurately identify and locate relevant sources of information followed by a capacity to synthesize and analyze data of various complexity and importance.  Has the ability to openly and effectively share subject-matter information with others; supports a continuous learning environment by preserving and compiling intellectual capital which can be used by others within his/her workgroup, department and the organization, as appropriate.  The ability to effectively utilize available time for the completion of necessary job tasks."}