{"jobID": "2827250819", "jobLocation": "Chicago_IL", "jobTitle": "Data Modeler", "companyRating": "3.4", "companyInfo": {"Website": "www.morningstar.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (MORN) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Thomson Reuters, FactSet, Bloomberg L.P."}, "estimatedSalary": "86000", "jobDescription": "Job DescriptionOur Team: One of the challenges Morningstar is facing is to preserve the data knowledges we've accumulated over our 30+ years' history and share them using one standard language. These data knowledges currently either reside in the brains of senior employees or hidden in the development specifications of the technical solutions we've implemented. A Data Modeler in Data Governance team is responsible for producing conceptual and logical data models to preserve the data knowledge independent of any specific solution. We use widely adapted data modelling tools to preserve and publish data knowledge in sustainable formats. The data model documents can also be reused by developers to build physical data models for a specific solution. The Role: In this role, you will be working closely with data subject matter experts (SMEs) from various data domains, including but not limiting to investment, finance, and information technology to fully understand the semantics, taxonomy, cardinality of data and translate them into appropriate data models by following established documentation standards. Part of your work requires the ability to read and understand research and methodology documents and to extract the information you need for data modeling by doing data analysis on large amount of data. Responsibilities: o Design logical data model  o Assist in creating data domain conceptual model  o Participate in defining data architecture document standard  o Publish and provide training to new physical data modelers, business analysts and developers on how to utilize data architecture documents Key Qualifications: o Love working with data  o Ability to extract data characteristics through research and analysis on data  o Strong ability in logical and abstract thinking  o Good understanding of database design concepts and data structure  o Strong communication skill and good documentation habits  o Fluent at using query languages  o Knowledge of R or scripting languages such as Python a plus  o Bachelor's degree  o Degree in MIS, Statistics and knowledge in investment data preferred  Morningstar is an equal opportunity employer.  001_MstarInc Morningstar Inc. Legal Entity  Morningstar and its subsidiaries are an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, religion, sex, national origin, age, disability, protected veteran status, marital status, sexual orientation, genetic information, citizenship, gender identity, parental status, or other legally protected characteristics or conduct."}