{"jobID": "2834333602", "jobLocation": "El_Segundo_CA", "jobTitle": "Ionospheric Scientist", "companyRating": null, "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requisition ID: 40885All Locations: El Segundo, CA (California)  A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning government to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation&apos;s space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?Responsibilities Join Space Sciences Department of The Aerospace Corporation to conduct fundamental and applied space science research to solve hard problems in effects of the space environment on space system design and operation. We are looking for a creative and motivated researcher with expertise on the ionosphere to test and implement methods for applying near-real-time space weather data for space system operations; research mission impacts from space weather; and to inform our customers of mission-appropriate solutions. If you join our team you will be in a unique position to work with our nation's space systems, to provide new insights into the role of space environment interactions and to apply the required space weather expertise in satellite design and operations. Our group develops scientific and application results through flight experimentation, data analysis, and modeling. We report our results with direct interactions with customers, participation in scientific conferences, and through peer-reviewed publications. Key FunctionsConduct ionospheric science research and disseminate results through scientific conferences and peer-reviewed publicationParticipate in the analysis and interpretation of space-science data setsWrite proposals to NASA and NSF for research fundingSupport NSS program offices through the application of the results of space science research and the resulting knowledge baseThis position can be filled as a Member of Technical Staff or a Research Scientist.QualificationsRequiredPh.D. in Space Science or closely related field with two or more years of experience in conducting ionospheric researchExperience writing peer-reviewed publications and giving technical conference presentationsThis position requires the ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance.PreferredExperience with design, building and testing of space science instrumentationExperience working with contractors and/or program officesCurrent and active SCI clearanceRequired for Research ScientistPh.D. in Space Science or closely related field with five or more years of experience in conducting ionospheric researchExperience writing peer-reviewed publications and giving technical conference presentationsExperience with design, building and testing of space science instrumentationThis position requires the ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance.Preferred for Research ScientistExperience working with contractors and/or program officesCurrent and active SCI clearanceTranscript Requirement Transcripts are required for this position. Additional Requisition DetailsSystem Job Title: MEMBER-TECH STF Clearance Requirement: Secret Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company Statement The Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.  From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world. Equal Opportunity Commitment The Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.  You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement."}