{"jobID": "2285643636", "jobLocation": "Addison_TX", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.sstech.us", "Headquarters": "Tampa, FL", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Job Description: -The Expense Automated Processing team, within the broader Expense Reimbursement department, is focused on the bulk processing of vendor claims through various manual and automated channels. They seek an analyst to fill two key functions. First, this analyst will take the lead in building and enhancing a suite of dashboards and analytics tools used to monitor key aspects of the team’s operations, which include volumes and task statuses. Second, they will work alongside other members of the team in the execution of daily bulk processing tasks. The knowledge gained here will provide the foundation for the analytics work as well as highlight opportunities for process improvement within the operational workflow itself.Skills & Qualifications-Expert Oracle SQL & TOAD skills—ability to write complex, clean queries against Oracle databases-Expert Tableau skills—ability to take data out of source systems and represent it effectively and efficiently in dashboards that sit atop multiple systems (including Sharepoint via OData connections)-Intermediate to Expert R skills—ability to efficiently process, integrate, and analyze large amounts of data from multiple source systems via script-Intermediate to Expert SAS skills-Expert knowledge of Microsoft Office suite (PowerPoint and Excel especially)-Excellent communication and internal customer interaction skills (this role from time to time may be asked to report metrics to senior leaders)-Strong data visualization skills and strong attention to detail (experience with Tableau isn’t enough—the ability to effectively simplify and represent data visually is key)-Experience writing and interpreting business requirements-Need to have 5+ years of relevant experienceEducational Background-Bachelor’s degree required-Master’s degree preferredCall notes: 3 main skills: SQL, Tableau and SAS, strong analyticsTeam is hybrid operational / analytics.-Operational (process claims in bulk), must be comfortable with Data running SQL.-Analytics, working in a few databases systems running quires, validation scripts, analysis dash boards.Needs someone who is comfortable in ops role and analysis.In terms of skills to pull that off, someone strong in Oracle SQL, navigate complex oracle systems. Pulling data form separate systems, merge together, understand different structures and hot they store data. R / SAS (R is an 0pen source version of SAS that FNMA is begging to embrace). Former candidate had more R than SAS experience. If they do not have R experience they can learn R in this roleSomeone who is comfortable in tableau, be ball to build specific things in tableau, strong design / style / abstract style. Take tableau and put on top of Sharepoint (tableau and Sharepoint don’t work well together, tough to do).Communicate well, internal / director client facingFeatures of R that the candidate will need? Used a lot like SAS, a lot of data engineering piece, pulling data form separate resources, pull into data frames, merging and doing a certain level of analysis.If no R, what type of SAS experience are you looking for? SAS, more for ETL tool, hit different data sources and turn into 1. Team doesn’t get super deep in statistical work. Comfortable in UnixTeam size / culture: teams gets along well,"}