{"jobID": "2802501290", "jobLocation": "Washington_DC", "jobTitle": "Principal Enterprise Engineer", "companyRating": null, "companyInfo": {"Website": "www.predictivetechnologies.com", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Back to job listingDutiesEnsure APT’s software systems are well designed and interact through predictable, verifiable API’s over APT’s internal network. Engage in long-term technical planning to properly maintain services. Design modular systems with appropriate mix of unit and regression tests. Contribute to different aspects of code base, including implementing business requirements, API, and library code that supports business aspects and other infrastructure code. Identify necessary updates and develop infrastructure improvements. Monitor unit and regression testing, creation and improvement documentation, and release management. Mentor junior team members.RequirementsMaster’s degree in Engineering, Computer Science, Information Systems Management, Mathematics, Physics or a related field + 2 years software engineering experience. Bachelor’s degree in Engineering, Computer Science, Information Systems Management, Mathematics, Physics or a related field + 5 years of progressive, post-Bachelors software engineering experience also accepted. Prior experience must include 2 years experience in each of the following: working with Enterprise software and a hosted software solution; hands-on experience using service-oriented architecture, Microservices, and Web API’s in a commercial environment; long-term technical planning, agile development methodologies on a cross-functional team, and continuous delivery in a business environment; Transact-SQL; coding with C# 6, ASP.NET MVC, and Javascript; testing applications using automated unit and regression testing software. Up to 5% domestic travel required for meetings.To ApplySend resume identifying position to: J Gladden, Applied Predictive Technologies, 4250 Fairfax Drive, Floor 11, Arlington, VA 22203. No calls.APT is an equal opportunity employer that values diversity and inclusion. Applicants will be considered and treated without regard to gender, gender identity, race, color, ethnicity, national origin, religion, sexual orientation, veteran or disabled status, or any other characteristic protected by applicable law. Apply Now  Learn more about the Engineering team  Interview Resources Share this Job FacebookTwitterLinkedIn"}