{"jobID": "2830885898", "jobLocation": "Monmouth_Junction_NJ", "jobTitle": "Machine Learning Engineer", "companyRating": null, "companyInfo": {"Website": "www.mindparabole.com", "Headquarters": "Monmouth Junction, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " . Please contact ******************** if you need further instruction on how to do that.  Machine Learning Engineer  Engineering | Monmouth Junction, NJ | Full Time, Part Time, Contract, Temp to Perm, and Internship Job DescriptionAbout Us: At Parabole, we believe enterprise knowledge should be centrally and digitally available to all stakeholders in an organisation-for everything from powering business intelligence to data analytics to building the next-gen intelligent applications in banking and financial services.  That's why the team here at Parabole is building a smart machine that can read and analyze any unstructured content and transform them into actionable insights and are looking for those who want to join us in this journey.  Machine Learning Engineer  Engineering I Princeton I NJ I Full Time  We're looking for machine learning engineers with a unique area of expertise in NLP, Topic Modelling, LDA and LCA clustering techniques that can be applied to improving the performance and capabilities of our knowledge automation engine. Responsibilities:The candidate will drive the development of Machine Learning algorithms for building automation software for regulatory compliance and risk management domain for banking and financial services.Requirements:An ideal candidate would be currently a senior/ master's student or a recent graduate in Computer Science with a concentration in Machine Learning, Mathematics/ Statistics and Computer Science.Exposure to Machine Learning and Cognitive algorithms (classification, categorization, feature engineering, information retrieval, knowledge discovery, and topic modelling) would be preferred.He/She will have a strong exposure to Data structures, writing algorithms, NLPStrong ability to create quick prototype, handle ambiguity, strong ability for co-development and learnPreferred Skills:Knowledge of Java, Python, C++R/Matlab and PythonGood knowledge of Linear algebra, random process, statistical analysisTo apply, please submit:Resume / LinkedIn / homepageA short self-introduction (Skills and area of interest) Return to PARABOLE"}