{"jobID": "2824390143", "jobLocation": "Irving_TX", "jobTitle": "Data Query Analyst", "companyRating": null, "companyInfo": {"Website": "www.ameritconsulting.com", "Headquarters": "San Ramon, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company Overview: Creating value by bringing together the right people to achieve results is our motto. Our clients and employees say they choose to work with us because of how we work with them - with service that exceeds their expectations and a personal commitment to their success.  Our client, one of world's largest distributors of Healthcare systems, Medical supplies & Pharmaceutical products, seeks accomplished Data Query Analyst. *************************************************************************************************************************** Candidate must be authorized to work in USA without requiring sponsorship ****** Possibility of conversion to FTE ***Description: The Data Analyst is a key role in supporting organizational readiness, performance and the overall success of services within the company.This is an exciting and challenging role that directly supports the organization's Business Intelligence function through monitoring of business unit performance, assessing opportunities for process improvement and supporting the implementation of strategic initiatives.Query SQL databases and/or data warehouse to create daily, weekly, monthly, quarterly contractual reporting external clients.Deliver contractual reporting requirements in adherence to the outlined schedule, format and delivery method.Provide final-line manual Quality Control for reports going to clients and third-party vendors.Provide ad hoc reports based on client and internal business needs while meeting an agreed upon deadline.Format visual output of data analysis for external customer review.Assist in creating visualization frameworks in SSRS and/or Tableau to provide internal recipients insights into productivity.Interpret data, analyze results to proactively provide performance feedback to business units within the organization.Lead ongoing analysis and reporting related to business unit performance recommended courses of action.Requirements:Bachelor's degree in applicable field, computer science, business, or equivalent experience related to healthcare operations.The ideal candidate possesses a strong working knowledge of the healthcare and pharmaceutical industry, understands key service level and success measures and demonstrates a keen financial acumen.1-3 years of previous experience in healthcare preferred.Database query language experience (simple and complex queries).Proficiency in Microsoft Office Suite, SQL and T-SQL, SSRS, Tableau.************************************************************************************************************************ I'd love to talk to you if you think this position is right up your alley.  If you're looking for rewarding employment and a company that puts its employees first, we'd like to work with you. We're driven, people driven. Satwinder SinghLead Technical Recruiter Tel: 925-297-6495  Email: NOTE: Candidates that are offered a position are required to pass pre-employment drug and background screening. Qualified candidates with criminal histories, are considered in a manner that is consistent with local, state and federal laws."}