{"jobID": "2815308092", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist/Statistician - Manager Level", "companyRating": "3.8", "companyInfo": {"Website": "www.gm.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1908", "Type": " Company - Public (GM) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " FCA Fiat Chrysler Automobiles, Ford Motor Company, Toyota North America"}, "estimatedSalary": "100000", "jobDescription": " The Global Product Planning Advanced Analytics team proactively leverages data and tools to drive decisionmaking in the GPP organization by coordinating existing and new analyticsprojects across GPP. The Data Scientist will execute small to midsize focusedad hoc projects and manage larger engagements within the GM Analyticsorganization. Merge pockets of existing analyticswithin GPP and link to broader analytics communityCollaborate with IT Advanced Analyticsfor major analytics projects and leverage additional capabilities to helpmanage GPP effortPerform peer reviews on analyticsdeliverablesProvide technical training, asneeded, to Advanced Analytics staffDevelop appropriate analyticsmethodsCollaborate with business teams toenable integration of tools and analysis into business decision making processManage stakeholder needs across the organization andinfluence without formal authorityKnowledge:Long-Term Forecasting, Planning, and Market ResearchprocessesGVDP deliverablesPlanning (GM3PD), Forecasting(GFS), and Volume databases(GSRA)GM vehicle and powertrain portfolioCompetitive IntelligenceAutomotive industry knowledge, including policies,competitor activities, and industry trendsForecasting related data - third party forecast houses,historical data sources, research data sourcesSetting priorities and alignment of project prioritieswith business strategyManaging complex projectsLeading small direct and cross-functional teamsProposing solutions and strategiesto business challenges that drive business impactBreaking down complex problems and projects intomanageable goalsInfluencing people, skilled in communicating the benefitsof data analysis to business line professionals to create a value propositionBuilding trust, respect and cooperation among teamsBuilding predictive models andmachine-learning algorithmsAnalyzing large amounts ofinformation to discover trends and patternsMonitoring and sustaining modeleffectivenessPresenting complex information usingdata visualization techniquesRequired Technical Background:4 Year College Degree/Master'sdegree preferred in Economics, Mathematics, Statistics, Computer Science,Operations Research, Engineering, or other quantitative field with emphasis on statisticalanalysis, econometric modeling and/or forecastingProficient in one or more coreanalytical tools/suites/languages such as SAS, Python, R, Spark Scala andunderstand their limitationsProficient in one or more analyticalmethodologies such as numerical optimization, econometric modeling andforecasting, and machine learningPreferred:Preferred - 5-9+ years' experience creating data productsQuantitative Master's degree preferred Apply on Company Website  Job ID: GENEA*********  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  General Motors  General Motors is pioneering a new era in the automotive industry, harnessing cutting-edge technologies and developing initiatives to change the way people think about mobility. And we're gathering the best and brightest talent to help shape and bring our vision to life. Because we're made for more. Together, we thrive in a culture of curiosity and tenacity, where we respond to every challenge with 'What if?' From vehicle electrification and automation to connected cars and urban mobility solutions, we're defying the limits of imagination. Our employees enjoy the resources and support they need to broaden their skills, achieve their goals, and set even higher ones. We're creating extraordinary products and services that delight our customers around the world, and we're doing it with a commitment to strengthen our communities and preserve our planet. The opportunities at General Motors have never been more exciting. Are you made for more? Contact Info Detroit, MI"}