{"jobID": "2555528188", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.earnin.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Earnin: Our financial system is fundamentally unfair for people who live paycheck to paycheck. People shouldnt have to wait weeks to get the pay theyve already earned. This wait forces them to spend more than $100 billion a year on short-term credit products, late fees and overdraft fees.  Earnin helps people overcome this unfairness by giving them real-time access to their money as soon as they have worked -- without fees or interest.  Our team is bound together by a desire to level the financial playing field. Our investors, Andreessen Horowitz, Ribbit Capital, Felicis Ventures, Matrix Partners and March Capital believe we will change the world.  You can help make a difference. Join us. About the Team: Were looking for a talented and motivated Data Scientist to collect and process data across our business to aid Earnins mission in giving the world access to their pay as soon as theyve earned it.  Data Scientists are the central node to every team within Earnin. As a Data Scientist, youll be interfacing with Analytics to gain insight, our Risk team to evaluate areas where we can protect and improve our business model, and our engineering team to advance our product utilizing machine intelligence.  Every decision made at Earnin is backed by data; our company trajectory is defined by the systems, tools, and analytics powered by our exceptional team. We integrate multifaceted data streams such as rapidly changing market data, customer data based on app activity and feedback, and financial banking operations data to perfect our processes and workflows. Improving these systems and maintaining scalability across a growing user base (X million and counting) is thrilling, particularly on a team of 4. What Set Us Apart:We care more about the thought process, perseverance, tenacity in solving really difficult problems (rather than checking off all the technology boxes)Solving unique problems in the financial payments industryHelping people on a human levelAs a Data Scientist you will:Productionize machine learning algorithms, augment engineers to make the Earnin product smarter by building, deploying, and maintaining predictive models using Python, R, ScalaBuild robust distributed systems to process large scale data streams into useful applicationsEngineer fast, real-time data pipelines to process data from across the financial markets and our internal event streamsImplement risk monitoring systems to improve tracking and mitigation of several risks including money laundering, financial fraud and margin exposureWork closely and collaborate with backend and frontend engineers to build products for gathering timely insights about customer behavior, etcCreate monitoring systems to track of the quality of data and the health of our systemsSome skills we consider critical to being a Data Scientist:Experience building data pipelines from scratch data to productionA MS or PhD in Computer Science, Physics, Statistics, Applied Mathematics, or any quantitative disciplinesStrong SQL abilities and experience.Proficient in Python, Numpy, Scipy, Scikit-learn, Pandas3+ years industry experience in data mining, machine learning, statistical analysis, and modelingExcellent communication - are you comfortable/able to explain complex scientific topics to non-tech audiencesNice to have:Familiarity with MapReduceFamiliarity with neural networks (deep learning)Technologies we use:AWS SuiteSQLPython, Numpy, Scipy, Sci-kit learn, Pandas"}