{"jobID": "2835286258", "jobLocation": "Northbrook_IL", "jobTitle": "Business/Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.genzeon.com", "Headquarters": "Exton, PA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Hi ,  Genzeon is looking to fill Data/Business Analyst position for one Healthcare client for Northbrook, IL. Location: Northbrook, IL.Duration: 2+ Months Contract. The Campaign Targeting Analytics Analyst is responsible for performing database list pulls for strategic initiatives to support communications to PBM members primarily relating to formulary and benefit plan designs. This position is expected to: • Execute structured SAS-SQL Teradata code to synthesize large amounts of relational data to optimize complex member communications products to key audiences.  • Perform quality assurance on list pulls Qualifications Bachelor’s degree in Mathematics, Computer Science, MIS, Economics or related field (or related experience) along with a minimum of 1-2 years of working knowledge and experience in successfully leveraging sophisticated database management platforms such as Teradata, Oracle, SQL-server or structured programming. Must be proficient with SQL experience. Candidates must have superior analytical skills and problem-solving skills with a high level of independent judgment and initiative required. The ideal candidate will have the ability to communicate effectively in a manner that is clear, logical and consistent. Excellent interpersonal skills, including the ability to interact and influence at all levels of the organization. This position requires strong of attention to detail and the ability to manage multiple projects simultaneously, adjusting priorities as needed and meeting deadlines. Experience in database or direct marketing is heavily preferred. Education Bachelor’s degree in Mathematics, Computer Science, MIS, Economics or related field (or related experience). Experience Minimum of 1-2 years of working knowledge and experience in successfully leveraging sophisticated database management platforms such as Teradata, Oracle, SQL-server or structured programming. SAS Experience is preferred, but not required.  If you or your colleagues/friends are interested, please connect with us ASAP. Your prompt response with an attached resume would allow us to reciprocate quickly.  Regards,  Brad Komar RecruitingSenior Recruiter Direct : 484 713 8976- provided by Dice  SAS SAL Teradata oracle business data"}