{"jobID": "2594041221", "jobLocation": "Washington_DC", "jobTitle": "Project Director & Senior Attorney - Opportuity to Learn", "companyRating": "2.8", "companyInfo": {"Website": "www.advancementproject.org?", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " 1999", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Advancement Project’s National Office seeks a seasoned creative attorney, strong community advocate, and an experienced and innovative program administrator to serve as Program Director & Senior Attorney of the Opportunity to Learn Program. This position is based in Advancement Project’s National Office in Washington DC, and executes program plan initiatives under the supervision of the Executive Office.  Advancement Project is a next generation, multiracial civil rights organization. Rooted in the great human rights struggles for equality and justice, we exist to fulfill America’s promise of a caring, inclusive, and just democracy. We use innovative tools and strategies in conjunction with strong community alliances to strengthen social movements and achieve high impact policy change. We combine law, communications, policy and technology to create workable solutions and achieve systemic change. We change the national discourse on race to provide opportunities for breakthroughs on racism. We aim to inspire and strengthen movements that expand opportunity for all. DESCRIPTION OF ROLE The Program Director & Senior Attorney of the Opportunity to Learn Program will lead a dedicated team of professionals from multiple disciplines working to secure equitable public education opportunities. This position will address “Quality Education for All” and “Ending the School-to-Prison Pipeline,” namely the overuse of punitive school discipline policies and practices that are disadvantageous towards students and push – especially students of color – out of school and into the juvenile and criminal justice systems. Advancement Project has been a pioneer in reforming school disciplinary models to prevent the push out of young people. Through state and local campaigns with grassroots partners, we have reduced suspensions, expulsions and the criminalization of young people of color leading to improved educational outcomes. We have also done groundbreaking work to challenge school closings in communities of color and privatization efforts that exacerbate education inequity. The strategies and tactics of the Opportunity to Learn Program are carried out within the broader goal of racial justice. The Program Director & Senior Attorney will be expected to supervise staff, build relationships and work closely with partnering grassroots organizations. This position will use a variety of legal, policy, communications, and coalition-building strategies to assist our community partners in achieving an equitable educational system. ADDITIONAL FUNCTIONSSTRATEGIC MANAGEMENT Offer a strategic vision that addresses key human rights issues while leading, building, and motivating an energetic, innovative team to identify and eliminate structural inequity in schools serving children of color.  Manage the education team, tools, resources, and activities, to ensure goals are accomplished.  Develop and implement national strategies to build public will for dismantling the School-to-Prison Pipeline and strengthening public education for all  Oversee implementation of 10+ local and state-level advocacy campaigns in partnership with community-based organizations across the country  Cultivate and manage strategic multiracial relationships, coalitions, and partnerships with stakeholders to build power in communities of color and create a diverse constituency of support for reform.  Work in collaboration with management to create project goals and work plans that create systemic change and deliver impact.  Utilize metrics and reporting to track progress towards goals, and to keep the leadership team apprised of successes and challenges.  Work collaboratively with Executive Director, leadership team and project staff to develop plans and articulate goals/objectives related to the initiative.  Assist the Development Department with budgets, fundraising and reporting related to program initiatives.  Seek and participate in external events and networking opportunities RESEARCH & POLICY Litigate lawsuits and/or administrative challenges to education injustice.  Research and challenge current state laws, practices and procedures that are disadvantageous to youth through education reform.  Assist Co-Directors and other Program/Project Directors cross functionally in managing investigations and litigation respective to other internal programs/projects. COMMUNICATIONS Persuasively articulate the mission, goals and program/project priorities of Advancement Project’s national office in written and oral presentation.  Develop presentation materials, including research, slides, scripts, talking points and proposal collateral for prospect meetings.  Works in collaboration with communications team to develop and align strategic messaging related to the  Program.  Reviews the teams work products to ensure the consistent production of high quality work products and advocacy materials related to educational topics. ADMINISTRATION Manage the Program’s budget effectively and adjust expenditures as necessary.  Supervise team, provide timely feedback and support growth of members.  Lead, build and motivate an energetic, innovative and responsive team to systemic issues.  Foster individual and team member growth and promote team goals/objectives.  Maintain collegial work relationships across the organization.  Periodically supervise department interns and/or volunteer staff.  Represent department as a member of various organizational committees. MINIMUM QUALIFICATIONS -A demonstrated commitment to racial and social justice required.  -Bachelor’s degree required, Master’s degree preferred.  -Juris Doctorate required with state bar membership or ability to waive into the DC Bar.  -Seven to ten years of post JD experience with emphasis on litigating and conducting policy and legislative  advocacy in the area of education law required.  -Knowledge of legal and policy issues surrounding education including school discipline and school  privatization.  -Supervisory experience including mentoring and training junior staff.  -Prior experience working with grassroots organizations and/or in non-profit environments required; specific organizing and advocacy campaign experience strongly preferred.  -Track record of getting results, handling a heavy workload and developing strong working relationships with and among a diverse group of people.  -Fundraising, budgeting and planning experience desired.  -Prior project management experience is necessary and strong technical skills are highly desired.  -Must possess strong interpersonal, research, analytical and writing skills.  -Superior oral communications skills.  -Bilingual ability preferred with fluency in Spanish.  -Previous work in a cross-functional or matrix team environment strongly preferred.  -Willingness to travel on a reoccurring basis required.  Advancement Project seeks a goal-oriented, creative, energetic, and committed professional to occupy this role in our progressive, multi-racial non-profit environment. This position is based in Advancement Project’s National Office in Washington D.C. and operates under the direct supervision of the Executive Director. TOTAL REWARDS Salary commensurate with experience. Generous benefits package included. HOW TO APPLY Advancement Project is an Equal Employment Opportunity Employer  Interested applicants should submit a cover letter with salary expectations, their resume, two writing samples, and a list of three references to jobs@advancementproject.org. Reference “Program Director & Senior Attorney - Opportunity to Learn ” in the subject line."}