{"jobID": "2759516889", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "127000", "jobDescription": "Data Scientist Job Number: 113709336Austin, Texas, United StatesPosted: Jul. 2, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming outstanding products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  Apple's Strategic Data Solutions (SDS) team is looking for a talented individual who is passionate about crafting, implementing, and operating analytical solutions that have direct and measurable impact to Apple and its customers.  As an SDS data scientist, you will employ predictive modeling and statistical analysis techniques to build end-to-end solutions for improving security, fraud prevention, and operational efficiency across the company, from manufacturing to fulfillment to apps and services.  Apple's dedication to customer privacy, the adversarial nature of fraud, and the enormous scale of the business present exciting challenges to traditional machine learning and data science techniques. On this team, you will push the limits of existing data science methods while delivering tangible business value.Key Qualifications Practical experience with and theoretical understanding of algorithms for classification, regression, clustering, and anomaly detectionWorking knowledge of relational databases, including SQL, and large-scale distributed systems such as Hadoop and SparkAbility to implement data science pipelines and applications in a general programming language such as Python, Scala, or JavaAbility to comprehend and debug complex systems integrations spanning toolchains and teamsAbility to extract meaningful business insights from data and identify the stories behind the patternsExcellent presentation skills, distilling complex analysis and concepts into concise business-focused takeawaysCreativity to engineer novel features and signals, and to push beyond current tools and approaches Description- Engage with business teams to find opportunities, understand requirements, and translate those requirements into technical solutions Design data science approach, applying tried-and-true techniques or developing custom algorithms as needed by the business problemCollaborate with data engineers and platform architects to implement robust production real-time and batch decisioning solutionsEnsure operational and business metric health by monitoring production decision pointsInvestigate adversarial trends, identify behavior patterns, and respond with agile logic changesCommunicate results of analyses to business partners and executivesResearch new technologies and methods across data science, data engineering, and data visualization to improve the technical capabilities of the teamEducation- Ph.D. in Computer Science, Machine Learning, Statistics, Operations Research or related field; orPh.D. in Math, Engineering, Economics, or hard science with data science fellowship; orM.S. in related field with 3+ years experience applying data science to real business problems Apple is an equal opportunity employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}