{"jobID": "2776951305", "jobLocation": "Northridge_CA", "jobTitle": "Engineering Manager, Data Science & Algorithm Development (DSP)", "companyRating": "3.7", "companyInfo": {"Website": "www.medtronic.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1949", "Type": " Company - Public (MDT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Johnson & Johnson, Boston Scientific, Stryker"}, "estimatedSalary": "134000", "jobDescription": "Careers That Change LivesThis role will be responsible for the management of an R&D; group responsible for data analytics and algorithm development pertaining to Medtronic’s glucose sensors. In this role, the individual will help establish and drive the strategic direction of the team, and will be responsible for all analytics efforts spanning research through to development. A successful candidate will have management experience (people or program) and sufficient knowledge of signal processing methodologies and software development tools so as to make informed technical decisions. Preference will be given to candidates with direct experience in the software and algorithm development lifecycle.DiabetesThe Diabetes Group is working with the global community to change the way people manage diabetes. Together, we will transform diabetes care by expanding access, integrating care, and improving outcomes; so people with diabetes can enjoy greater freedom and better health.A Day in the Life• You will manage a technical team with focus on algorithms and data analytics. Establish a structure for this team that can address organizational needs• You will lead algorithm development projects from investigation through to productization• We will ask that you actively search for best-in-class technologies and develop innovation roadmap• Identify and implement systems and tools to facilitate the algorithm development life cycle• Collaborate closely with other managers and project leads and establish infrastructure to support cross-functional analytics needs• Participate in meetings and share technical information and \"best-practices” across the Sensor R&D; organization• Develop individuals assigned to the team, promote engagement and ensure job satisfaction of individual team membersMust Have: Minimum Requirements To be considered for this role, please ensure the minimum requirements are evident on your resume.• Bachelor’s or advanced degree in Electrical engineering, Computer engineering, Computer science, or related discipline and 5 years of industry experience OR • Masters Degree in Electrical Engineering, Computer Engineering, Computer Science or Related Discipline and3 years of industry experience • Industry experience in program management, people management or in a technical lead position • Signal processing & analytics experience in industry settingNice to Have• Direct people management experience• Experience in a regulated industry and exposure to regulatory submissions; we’d love if you had experience in biosensor signal processing• Experience interacting with a multi-disciplinary, cross-functional team• Direct experience working with and implementing advanced analytics and algorithm methodologies• Demonstrated ability to work and lead within a team-based project environment• Ability to effectively communicate technical information through presentation and through the preparation of technical documentation and/or manuscripts• Ability to read, analyze, and interpret common scientific and technical journalsAbout MedtronicTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be. We want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.Physical Job RequirementsThe above statements are intended to describe the general nature and level of work being performed by employees assigned to this position, but they are not an exhaustive list of all the required responsibilities and skills of this position. The physical demands described within the Day in the Life section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.• While performing the duties of this job, the employee is regularly required to be independently mobile. • The employee is also required to interact with a computer, and communicate with peers and co-workers.• Travel up to 15%EEOIt is the policy of Medtronic to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, Medtronic will provide reasonable accommodations for qualified individuals with disabilities.This employer participates in the federal E-Verify program to confirm the identity and employment authorization of all newly hired employees. For further information about the E-Verify program, please click here: http://www.uscis.gov/e-verify/employees"}