{"jobID": "2832812525", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist I or II", "companyRating": null, "companyInfo": {"Headquarters": "Caracas, Venezuela", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " To support its optofluidic platform technology development, Fluxus Inc. is seeking a highly motivated, interdisciplinary research scientist with relevant, hands-on experience and proven track record of innovative science at the intersection of photonics, materials science, and biological applications. She/He will be part of Fluxus’ innovative research team and work closely with other teams to design, develop, and test a growing suite of optofluidic solutions comprised of integrated biochips, proprietary reagents, and custom instrumentation. Activities will involve a variety of biochemical assays at the single-molecule detection level. Development of single-molecule detection technology will involve novel reagents and fluidic cartridges, as well as instrumentation for detection, sample preparation and corresponding software. The successful applicant will work within a multidisciplinary team of engineers, scientists, and manufacturing personnel. Part of the activities might be conducted in a BSL2 laboratory area and could involve the handling of human biological materials such as blood samples. Other activities might be conducted in a cleanroom setting.  Fluxus, Inc. is an innovator in single-molecule detection and ultra-high sensitivity platforms based on its expertise in optofluidics, assay development, system integration, and microsystem technologies. The Fluxus product development infrastructure and suite of proprietary technologies are ideally suited for the robust development of advanced sensing technologies and diagnostic equipment. Principal duties and responsibilitiesSupport diverse aspects related to the early-stage development of a bio-chip based, optofluidic diagnostics platform. Applies intensive and diversified knowledge of design principles, practices, and implementation in complex systems and assignments.Design, optimization, testing, and validation of optofluidic chips, optical/fluidic interfaces, sample processing technology, and instruments, in collaboration with other groups and external suppliers.Conduct optical simulation of chips and systems with proper tolerancing, convergence, boundary, etc. optimizations.Independently design and fabricate microfluidic prototyping chips using tools such as CAD software, simulation software, and various types of microfabrication procedures.Develop, evolve, and maintain custom optoelectronic systems used for testing and characterizing optofluidic systems.Merge understanding/experience of biological sample preparation, handling, and testing with optofluidic prototyping environments.Analyze and present data of various types including images, time traces, assay flows, optical spectrums, etc.Support all aspects of technology transfer to and from internal and external partnersInterface with internal resources and external vendors to design, test and validate equipment.RequirementsPh.D. Degree in bio-, mechanical-, electrical- or chemical engineering, chemistry, physics, biochemistry, or related discipline, with 3-5 years hands-on R&D; or engineering experience.Interdisciplinary and inventive mindset with proven experience bridging the fields of photonics/optical engineering, microfluidics/lab-on-a-chip, and biochemistry assay development. Candidates with expertise in optofluidics are preferred.Hands on experience with standard biochemical laboratory equipment and working with biological or biochemical analytes (e.g. proteins, nucleic-acids, cells and/or bio-organic molecules).Experience in designing, building, utilizing, and maintaining optical systems (free space and chip based) using simulation software: ray tracing software for system design and FEM/FDM/BPM/etc. for chip design.Proficiency in CAD design (e.g. 2-D: AutoCAD, LEdit, etc. and 3-D: Inventor, Solidworks, etc.), statistical analysis (e.g. Python, Matlab, etc.) as well as instrument-oriented programming language(s) (e.g. Python; LabView).Ability to rapidly prototype (concept-to-device) microfluidic/optofluidic devices using techniques such as soft lithography, injection molding, laser writing, etc.Knowledge of standard CMOS processes.Experienced in using diverse, analytical instruments such as - or similar to - oscilloscopes, DAQ interfaces, UV-VIS spectrometers, scanning electron microscopes (SEMs), fluorescence microscopes, etc.Independent thinker/learner/doer with the ability to create.Excellent organizational abilities as well as English verbal and written communication skills.Ability to develop custom equipment by collaborating with external vendors and/or internal engineering resources.Self-starter, detail-oriented, motivated, thoughtful, and with a strong work ethic.Ability and willingness to quickly learn and apply new skills, procedures, and approaches.Proven ability to work collaboratively in a team-based environment.Proven ability to handle multiple competing priorities in a fast-paced work environment.Candidates must be able to work in the US for any employer at this time.ONLY CANDIDATES PROVIDING A POSITION SPECIFIC COVER LETTER WILL BE CONSIDERED!Other beneficial skill setsHands on ability to work-with/manipulate/couple optical fiber and respective componentsProficiency with digital/analogue signals and systemsExperience simulating in Multiphysics environments (e.g. Comsol)Circuit design and simulation experienceMachining experience (e.g. CNC, welding, etc.)Experience in building and operating automated and robotic systemsExperience in industrial process verification and validationBSL2 Certification Fluxus Inc. is an early-stage biotech company developing and commercializing biochip-based, optofluidic, single-molecule detection platforms for ultra-high sensitivity diagnostics and biosensor applications. The company is located in Santa Clara, CA, USA. At Fluxus we are innovative, disruptive, passionate, and open; we look forward to adding the candidate’s skillsets and values to the team! Fluxus is an Equal Opportunity Employer."}