{"jobID": "2831729404", "jobLocation": "Boise_ID", "jobTitle": "Reliability Modeling Engineer (PERM)", "companyRating": null, "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": null, "jobDescription": " Hiring Manager: Alessandro Calderoni  As a Reliability Modeling Engineer at Micron Technology, Inc., you will be focusing on Emerging Memory and evaluating technologies that enable further memory scaling. You will be responsible for targeting a range of technologies, such as phase change memory, resistive memory, spin torque transistor memory, three dimensional memories, Crosspoint, etc., both for non-volatile, and volatile memories. Additionally, you will be responsible for the development of reliability models for customer usage, acceleration factor modeling, detection methods, qualification methods, etc. Further, you will assimilate data from multiple groups (design, process, reliability, product engineers, probe and test, etc.) to develop the reliability models. Your responsibilities will include, but are not limited to:  CMOS Reliability modeling, including:  Design reliability experiments and coordinate their execution;  Develop concepts for reliability testing of new mechanisms;  Analyze and model array reliability for single mechanisms and combining multiple mechanisms;  Develop methods of acceleration factors;  Develop a predictive model for failure mechanisms combining customer usage models and a comprehensive failure model.  Minimum Qualifications:  Knowledge or experience with device physics and CMOS including: process and integration challenges of scaled devices, non-ideal characteristics, electrical characterization.  Knowledge or experience with solid state device physics, including: MOSFETs, Tunnel FETs and Steep Slope devices.  Thorough understanding of mainstream memory technologies such as dynamic random access memories (DRAM), NAND, NOR, and static random access memories acquired through significant industry experience.  Knowledge of Thin-Oxides failure mechanisms and models.  Basic understanding of semiconductor process technology such as thin film deposition like CVD and PVD, wet processing, implant, reactive ion etching, Chemical mechanical polishing etc,.  Knowledge or experience in semiconductor characterization like MOSFETs, MOSCAPs using parametric analyzers such as 4156, 4284 etc,.  Knowledge of memory related product operation, timings, datasheets, testing, etc.  Understanding of cutting-edge emerging memory cells.  Knowledge or experience with failure modes related to transistors and memory cell related reliability mechanisms including: bias temperature instability (BTI), hot carrier injection (HCI), stress induced leakage currents (SILC).  Strong understanding of fundamental chemistry and physics related to reliability failure modes.  Very strong skills associated with reliability modeling including data analysis, design of experiments, and associated software such as (JMP, R, etc.).  Strong experience in statistical data analysis with understanding of statistical hypotheses testing such as Student’s t-test, ANOVA, and Tukey HSD.  Must be willing to work evenings or weekends, if necessary.  All job offers will be contingent upon a successful drug screening and background check.  Work Location: 8000 S. Federal Way, Boise, ID 83716  Hours of work: Usually 8 a.m. to 5 p.m., Monday through Friday- also must be willing to work nights and weekends when necessary  Degree Required: PhD or equivalent foreign education  Academic Discipline(s): Electrical or Electronics Engineering, Physics or Mathematics  Experience Required: One year of experience We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices. Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters. To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748). Keywords: Boise || Idaho (US-ID) || United States (US) || Technology Development || Experienced || Regular || Engineering || Not Applicable ||"}