{"jobID": "2691222322", "jobLocation": "Carpinteria_CA", "jobTitle": "Senior Data Analyst", "companyRating": "4.8", "companyInfo": {"Website": "www.procore.com", "Headquarters": "Carpinteria, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " Were searching for a data-driven individual who is passionate about transforming numbers into impactful insights and actions. Reporting to the Director of Strategic and Corporate Development, you will play a key role in unlocking data at all levels of the organization to inform Strategy. This is a highly cross-functional role, so you will be helping all departments transform processes, scale more efficiently and uncover new opportunities. What you'll do:Transform data to help inform strategic and tactical business decisions across all teams.Help define and track company-wide KPIsProvide transparency into our data via dashboards and reporting.identify and communicate trends and find new ways to utilize our data to benefit the business.Support implementation of strategic business initiatives and major projects by performing additional assignments upon request from management.What we're looking for:3+ years in a data analytics or strategy roleAdvanced experience with SQL, Excel and PowerPoint; Experience with Looker, Tableau or similar BI tool a plusAbility to draw insights from large data sets, and translate that into next stepsExcellent verbal and written skills with the ability to present strong data-driven storylines and content to both general and senior audiencesExceptional attention to detail and ability to thrive in a fast-paced environment with multiple projects and prioritiesBachelors Degree in an analytical field (e.g. Computer Science, Business, Engineering, Mathematics, or Statistics)About Us Procore Technologies is building the software that builds the world. We provide cloud-based construction management software that helps clients more efficiently build skyscrapers, hospitals, retail centers, airports, housing complexes and more. At Procore, we have worked hard to create and maintain a culture where you can own your work and are encouraged and given resources to try new ideas. Check us out on Glassdoor to see what others are saying about working at Procore. Our headquarters is located on the bluffs above the Pacific Ocean in Carpinteria, CA, with growing offices worldwide. To learn more about our team, click here.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Perks & Benefits You are a person with dreams, goals, and ambitionsboth personally and professionally. That's why we believe in providing benefits that not only match our Procore values (Openness, Optimism, and Ownership) but enhance the lives of our team members. Here are just a few of our benefit offerings: competitive health care plans, unlimited paid vacation, stock options, employee enrichment and development programs, and friends & family events."}