{"jobID": "2568787303", "jobLocation": "Monrovia_CA", "jobTitle": "Scientist I", "companyRating": "2.9", "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " Scientist I Organization  Eurofins Eaton Analytical, Inc. Location  CA, Monrovia Job Code 10195Apply NowEurofins Eaton Analytical, Inc. is the largest potable water testing laboratory in the US, with over 100,000 combined square feet of laboratory space and nearly 200 qualified staff at our California and Indiana facilities. We also maintain service centers in Washington, Arizona, Colorado, North Carolina, Pennsylvania, and Florida. We recognize water quality to be critical to public health protection, whether in water supplies or as a component of food and beverages. With our continued investment in emerging contaminant analyses and the ability to meet ever more stringent standards, Eurofins Eaton Analytical provides clients with a trusted laboratory partner that can respond to their needs 24/7 from multiple locations.:  Eurofins Eaton Analytical is searching for a Scientist I in Monrovia, CA. Scientist I responsibilities include, but are not limited to, the following: ·Responsible for conducting basic chemical analyses, and tests which require technical knowledge and techniques of a GC system  ·Follows standard operating procedures  ·Performs basic instrument maintenance and troubleshooting  ·Utilizes independent judgment within defined parameters to determine an appropriate approach  ·Conduct MDL/IDOC study and SOP review.  ·Other duties as assigned The ideal candidate would possess: ·Strong computer, scientific, and organizational skills  ·Excellent communication (oral and written) and attention to detail  ·Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude  ·Contributes to a team under general supervision of an experienced professional or manager  ·As the employee gains knowledge and experience, the work reviews, checks, and supervision may be reduced.  ·Prior laboratory experience is a plus  ·Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Basic Minimum Qualifications: ·Responsible for own work within specified area  ·Ability to understand the application of data qualifiers  ·Contributes to the development and improvement of concepts, techniques and procedures  ·Requires judgment or initiative in resolving issues and making recommendations  ·Minimum BS degree in chemistry or other related science field.  ·Must be available to work overtime including weekends  ·Must be capable of lifting 15 pounds  ·Authorization to work in the United States indefinitely without restriction or sponsorship  Position is full-time, Monday-Friday, 8 a.m.-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of Monrovia, California are encouraged to apply.  As a Eurofins employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options. To learn more about Eurofins, please explore our website www.eurofinsus.com.Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer.In 1987, Eurofins Scientific was founded in Nantes, France, with four employees to market the SNIF‑NMR technology. During the past 30 years, Eurofins has grown to be a world leader in laboratory testing services with a network of 375 laboratories across 41 countries in Europe, North and South America and Asia-Pacific and over 30,000 staff.Eurofins is the world leader in the food, bio/pharmaceutical product testing. It is also number one in the field of environmental laboratory services and one of the global market leaders in agroscience, genomics, discovery pharmacology, and central laboratory services."}