{"jobID": "2625361717", "jobLocation": "Princeton_NJ", "jobTitle": "Computer Scientist, Vision & Robotics", "companyRating": "3.5", "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": "118000", "jobDescription": " From image capture to situational understanding, SRI’s Center for Vision Technologies (CVT) offers end-to-end vision solutions that translate into real-world applications. Our scientists’ pioneered real-time, real-world computer vision with the early development of pyramid/wavelet processing that enabled analysis with unprecedented speed and precision. They continue today with a broad array of advances in visual navigation, 3D scene modeling, and object and activity recognition.  The Vision & Robotics group in CVT is currently searching for a Computer Scientist to join their group of cutting edge researchers. This position will involve leading and participating in the development of algorithms, software and systems for visual navigation, augmented reality and 3D reasoning. You will help develop algorithms, software and applications in areas such as Autonomous Robotics, Augmented Reality, Video Geo-registration and 3D modeling. Responsibilities of the position include:Ability to provide technical lead with innovative ideas and algorithms.Work effectively in a team to achieve the goals of projects and deliver software and systems to external clients.Write proposals, work as a team to actively seek funding from various government and commercial agencies.Maintain and enhance visibility at the individual, group and company level amongst worldwide academic, research and commercial institutions.Give technical and business presentations to external clients, academic and government/industry audiences and to internal staff and management.PhD in Computer Science/Electrical Engineering or related fields with a focus on Computer Vision, emerging talent welcome to apply. Or a Masters with at least three years of experience in Computer Vision or a related field.Technical excellence, leadership and proven track record in:Video motion analysis for Navigation and localization methodsBackground in vision based scene understanding methodsGeneral Computer Vision algorithmsReal-time systems for video analysis and understandingApplications areas such as Security & Surveillance, Autonomous Robotics, Video DatabasesAbility to lead projects and people, as well as skills to work as a part of a team to achieve technical and project goals.Desired Qualifications:US Citizenship/Permanent Residency is preferred, clearances are a plus. Exceptional candidates in non-immigrant status will be considered"}