{"jobID": "2838084137", "jobLocation": "Dallas_TX", "jobTitle": "HMDA-CRA Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.everbankcenter.com", "Headquarters": "Jacksonville, FL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The HMDA-CRA Data Analyst is responsible for the oversight of the Home Mortgage Disclosure Act (HMDA) and Community Reinvestment Act (CRA) data management activities. Responsibilities include building monitoring controls and oversight program that ensures the bank operates in compliance with HMDA, HMDA Plus and CRA policies and procedures as well as applicable regulations and laws. The role is accountable for all aspects of the process including, but not limited to, ensuring completeness and accuracy of HMDA/CRA data reported; timely reporting to management and regulators; report generation for the bank's leadership team; promoting organizational awareness and assisting the CRA Officer in regulatory training. This position will also work to conduct periodic data integrity reviews, communication findings/recommendations with line of business, file geocoding, data scrubbing and validation of reportable data. The HMDA / CRA Data Analyst will assist in regulatory exams, internal or external audits facilitating HMDA and CRA file documentation requests. This is a high impact job that is responsible for the execution of a critical lending regulatory function reporting directly to the Bank CRA Officer. ESSENTIAL FUNCTIONSEffectively and constructively lead change in an organization, introducing continuous improvement and implementing practices that mitigate compliance, regulatory and legal risk surrounding the HMDA and CRA regulations in a large bank environment.Assist in the capturing, maintaining, review and in-depth analysis of HMDA, HMDA Plus and CRA data, interpreting it to monitor trends, regulatory requirements and identify possible risks.Assist in the annual regulatory submission of HMDA and CRA data to ensure accurate and timely filings.Establish strong partnerships and collaboration with relevant line management and deliver results in a complex matrix reporting structure to drive decision making through a consensus building approach.Assist in the data validation and remediation process on loan applications to ensure HMDA and CRA data is complete and accurate and validate all errors identified are remediated.Provide subject matter expertise with respect to HMDA, HMDA Plus and CRA reporting requirements and stay abreast of all changes in regulations.Interpret performance analysis reports, documenting the factors that are impacting the bank's performance, and helps develop corrective strategies where needed.Assist in maintaining the Banks CRA Public File including hard copy and electronic versions.Assist in the development of the operational oversight strategy and ongoing data quality monitoring.KNOWLEDGE, SKILLS, AND ABILITIES REQUIREMENTSProven ability to analyze, communicate verbally or in writing and make recommendations regarding complex laws and regulations to line personnel and management.Proficient with CRA WIZ, RATA, Compliance Ease or other regulatory reporting software for CRA and HMDA submissions is preferred.Significant MS Excel and full Office Suite skills desired.Strong ability to build collaborative relationships with various business unit managers to improve operational processes associated with regulatory reporting requirements.Ability to interface with all levels of employees and managementTRAINING AND EXPERIENCEBachelor's degree plus 3-6 years of HMDA /CRA data integrity management experience with a mortgage or lending institution is required. If no degree, then 5+ years of HMDA/CRA data integrity management experience with a mortgage or lending institution is required.Knowledge of data elements and requirements for all channels of lending (retail, correspondent, third party originations, etc.) and general operations management experience required.Proven analytical and problem solving abilities using innovative thinking when tackling principles, theories and concepts relating to wide scope of issues.Pre-Employment Screening May Include:Credit CheckCriminal Background CheckFingerprintingDMV CheckPast Employment VerificationSocial Security Verification Note: The above statements are intended to describe the general nature and level of work being performed by people assigned to this job. They are not intended to be an exhaustive list of all duties, responsibilities, and skills required of personnel so classified, and they may change at any time.  TIAA, FSB is an equal opportunity employer. No associate or applicant for employment will be discriminated against on the basis of race, creed, ethnicity, color, age, religion, sex, sex stereotype, pregnancy (including childbirth, breastfeeding or related medical conditions where applicable), sexual orientation, gender, gender identity, gender expression, transgender, marital status, national origin, ancestry, physical or mental disability, requesting a reasonable accommodation based on mental or physical disability, medical condition (as defined by applicable law), genetic history and information, citizenship status, military or veteran status, or any other status protected by federal, state, or local law or ordinance or regulation.  TIAA, FSB is not seeking assistance or accepting unsolicited resumes from search firms for employment or contractor opportunities. Regardless of past practice, all resumes submitted by search firms to any employee at TIAA, FSB via e-mail, the Internet, or directly to hiring managers at TIAA, FSB in any form without valid written search agreements executed by the VP, Talent Acquisition for that specific position will be deemed the sole property of TIAA, FSB, and no fee will be paid in the event the candidate is hired by TIAA, FSB as a result of the referral or through other means.  TIAA, FSB will not discharge or in any other manner discriminate against associates or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another associate or applicant. However, associates who have access to the compensation information of other associates or applicants as a part of their essential job functions cannot disclose the pay of other associates or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by TIAA, FSB, or (c) consistent with TIAA, FSB legal duty to furnish information. "}