{"jobID": "2831784547", "jobLocation": "Arlington_VA", "jobTitle": "Cyber Security Analyst-Network Data & Forensics Analytics", "companyRating": null, "companyInfo": {"Website": "www.phiatech.com", "Headquarters": "Fairfax, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "OVERVIEW phia LLC is seeking a skilled Cyber Security Analyst to support a large Federal Security Operations Center (SOC) and its 24x7 SOC mission. This team focuses on Network Data & Forensics Analytics. DUTIESTechnical analysis of network activity; the analyst monitors and evaluates network event data, signature-based IDS events and full packet capture (PCAP) data.Triage IDS alerts; collect related data from various network analysis systems, review available open and closed source information on related threats & vulnerabilities, prepare initial summary reports.Monitor and analyze signature-based IDS alerts and associated packet (PCAP) dataAnalyze network flow data for anomalies and to correlate reporting with enterprise-wide network activityDocument key event details and analytic findings in an incident management systemProvide oversight and assessment of incident response and triage actions across a large enterpriseIdentify & extract network indicators from incident reporting and published technical advisories/bulletinsPerform incident correlation & escalationRecommend new IDS signatures and detection strategies.Produce final reports and review incident reports from other analysts.Communicate and collaborate with analysts from other SOC organizations to investigate cyber events.Assess cyber indicators/observables and collaborate in the development of IDS signatures and detection mechanisms.Monitor and report on trends and activity on network sensor platforms.Provide technical assessments of cyber threats and vulnerabilitiesFuse open-source threat & vulnerability information with data collected from sensors across the enterpriseDevelop, maintain and update standard operating proceduresProvide routine status updates for ongoing projects, trouble tickets, incidents, and other related tasksMaintain awareness of major events and trends in the cyber security landscapeResearch and evaluate emerging capabilitiesEnsure that all alerts are monitored, interpreted, analyzed, and investigatedUtilize external reporting tools for threat intelligenceMonitor all security-relevant logs and alerts for signs of compromise, attack, or system misuse and policy violationsInnovate new methods to use existing tools and data sources, and identify and obtain new data sources, to detect cyber intrusionsWrite detailed incident reportsCollect incident and investigation metrics and trending data, identify key trends, and provide situational awareness on these trendsMonitor all-source threat reportingRequirementsKEY REQUIREMENTSBachelor’s degree5- 10 plus years of relevant work experienceActive Top Secret Security Clearance with ability to obtain a DHS SCI, as well as obtain and maintain a favorably adjudicated DHS background investigation (EOD) for continued employment.Experience in planning and/or directing projects/operations in a 24x7 SOCExperience providing metrics and reports from a SIEMDemonstrated proficient knowledge of industry standards and best practices within Intrusion DetectionExperience with researching and fielding new and innovative technologyExperience managing IT systemsDESIRED QUALIFICATIONSDODD 8570 Level II certification (SANS certifications, CISSP)Experience leading and managing within SOC/NOC operationsFamiliarity with Kill Chain for incident responseFamiliarity with malware analysisFamiliarity with forensicsFamiliarity with incident response products and best practicesExperience with database (e.g. MS Access, SQL) and/or portal administration (e.g. SharePoint)Customer service experienceWORK SCHEDULE: Core Business Hours (Schedule is flexible but must be between the hours of 6AM-6PM M-F) TRAVEL: N/A TELEWORK ELIGIBILITY: N/A SECURITY REQUIREMENT: Active SSBI Benefits PHIA LLC  phia LLC (\"phia\") is a Northern Virginia based, 8a certified small business established in 2011 with focus in Cyber Intelligence, Cyber Security/Defense, Intrusion Analysis & Incident Response, Cyber Architecture & Capability Analysis, Cyber Policy & Strategy, Information Assurance/Security, Compliance, Certification & Accreditation, Communications Security, Traditional Security, and Facilities Security. phia also provides cyber operations support functions such as: Program and Process Management, Engineering, Development, and Systems Administration that allows for Cyber Operations to efficiently integrate our customer’s missions and objectives. phia supports various agencies and offices within the Department of Defense (DoD), Federal government, and private/commercial entities.  phia offers excellent benefits to enhance the work-life balance, these include the following:  · Medical Insurance  · Dental Insurance  · Vision Insurance  · Life Insurance  · Short Term & Long Term Disability  · 401k Retirement Savings Plan with Company Match  · Paid Holidays  · Paid Time Off (PTO)  · Tuition and Professional Development Assistance  · Parking Reimbursement"}