{"jobID": "2817503957", "jobLocation": "Plano_TX", "jobTitle": "Wealth Management - CWM Operations, Data and Reporting Analyst", "companyRating": null, "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Apply Now  Wealth Management - CWM Operations, Data and Reporting Analyst  Req #: 180030467  Location: Plano, TX,US  Job Category: Asset Management Job Description: JPMorgan Asset&Wealth; Management, with client assets of $2.4 trillion, is a global leader in investment and wealth management. Its clients include institutions, high-net-worth individuals and retail investors in every major market throughout the world. The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. For individual investors, the business also provides retirement products and services, brokerage and banking services including trusts and estates, loans, mortgages and deposits. Our Business: Wealth Management Operations supports the JPMorgan Private Bank and Chase Wealth Management in JP Morgan's Asset Wealth Management line of business.  The Private Bank is the world's premier service provider for ultra and high net worth individuals. Our goal is to help these affluent individuals across the globe optimize their wealth, after taxes and across generations. Wealth Management Operations provides end-to-end support for all aspects of the client experience, working closely with client service, fiduciary, product specialty groups, third party vendors and other internal groups.  Chase Wealth Management encompasses our Chase Private Client (CPC) and Chase Investment Services businesses. Through a dedicated team of a banker and J.P. Morgan Advisor, Chase Private Client brings our affluent clients concierge banking from Chase and access to the investment expertise from J.P. Morgan. Chase Investment Services provides investment solutions to a broad range of Chase customers through Chase Investment Advisors. The J.P. Morgan Securities Client Service Center's mission is to create a great client experience and help individuals across all 50 U.S states to save and invest wisely. The group works in a team environment to assist clients with service over the telephone and serves as experts on our online platform, such as Chase.com The Role: The Workforce Planning Data Analyst II is part of the Operations Workforce Management (WFM) Team for Chase Wealth Management (CWM). The position is responsible for meeting the organization's need for management information, reporting, and analysis. You will leverage internal databases, external sources, and other tools to support the development and production of contact center and WFM performance reporting and analytics. Partnering with contact center managers, functional areas, and other members of the WFM team, you will interact with senior management across the organization and focus on the important issues through advanced analytics, data modeling, and report production. You will be a key resource in identifying business optimization and tracking performance of related initiatives. Duties:Strategic analyses (performance, forecasting, employee projections, etc)Communicate and collaborate with internal operations, analytics resources, technology, and other functional areasIdentify ongoing opportunities to improve efficiencies within the contact center(s)Quantify impact of business optimization initiatives and uncover new targetsPerform advanced root cause analysis to identify areas of opportunity and make strategic recommendations to leadershipEngage with other business functions to discuss recommendations and execute changes (eWFM, Routing, Leadership)Analysis of customer behavior and data in support of contact center planning and performance reportingTie data across disparate systems (e.g. EDW, Aspect eWFM, Avaya, etc)May participate in projects and provide subject matter expertiseSupports process improvements and best practice identificationAd hoc duties as assignedMay lead a team of employeesStrong skills in MS Excel, Access, and PowerPointAnalytical/Data Mining Systems (i.e., Tableau, SQL)Excellent written and verbal communication skillsStrong experience in business analysis, reporting and data review, root cause analysis and resolutionAbility to partner collaboratively with key stakeholdersDemonstrated ability to work fluidly with people at a variety of levels internally and externallyAbility to influence peers, colleagues, and internal customersAbility to handle multiple complex tasks simultaneouslyWork with and influence cross-functional teams and projectsQualifications:5+ years Financial Services Contact Center experience preferredBA/BS degree requiredWorking knowledge of telephony/call routing and workforce platformsProven experience leading or supporting project initiatives"}