{"jobID": "2792350019", "jobLocation": "Milpitas_CA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.bourntec.com", "Headquarters": "Schaumburg, IL", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": "Bourntec is currently seeking Data Scientist to join our client team inMilpitas, CA.  Role: Data ScientistLocation: Milpitas, CA Expert in cleansing data, removing anomalies, selecting features, reducing dimensions, building/optimizing classifiers, correlating hard business / technology generated data with social media data (like tweets / blogs / posts / etc.) to discover hidden or unseen data or trend from vast amounts of data by applying various data mining techniques, statistical analysis and thus building high quality prediction systems.  Excellent understanding of machine and deep learning concepts / techniques like k-NN, SVM, Decision Forests, linear regression models, gradient descent, K-means, RFM modelling, etc.  Strong Experience in using data science tools like Python, Py-Spark, Scala-Spark  Knowledge of NoSQL databases such as MongoDB, Cassandra, Hbase, etc.  Experience with using GCP / AWS cloud services  Knowledge of Hadoop stack, Spark, Map-Reduce, Hive, Pig, Shell Scripting and familiarity Unix/Linux OS.  Good understanding of relational databases with ability to write/ modify complex SQL queries to generate required datasets and tune query performance.  Understands dimensional data model, logical data model and physical data model for analytics and reporting. Understands data design that supports integration of data and information flow across various applications, systems and platforms.  Strong analytical and problem solving skills. Should provide solutions to complex problems without known solutions.  Excellent communication skills and capability to effectively work with both Business and Technology teams.  Qualification – Degree in applied math, statistics, engineering, computer science or other quantitative field required. PhD or MS/MTech preferred.  3+ years of technology experience as a Data Scientist  Bourntec Solutions is an innovative provider of Information Technology turnkey solutions and services, with four major lines of business. These include Strategic IT Services, Managed Services, Professional Services and the Public Sector. Our offerings span Custom Application Development, Software Quality Assurance, Maintenance and Support, Infrastructure Management, Value-Added Consulting and Resource Mobilization across a wide range of focused industry verticals.  As a pioneer in building innovative IT solutions across industries, Bourntec is always been in the forefront, providing customized solutions and services that focus on providing strategic differentiation and operational superiority to clients.  Founded in 1994 and Headquartered in Schaumburg, Illinois, we have offices in Washington, Maryland, Virginia, Texas, Florida and Michigan.  Visit www.bourntec.com for more information about our current assignments and contracts.- provided by Dice  Data Scientist, Py-Spark, ScalaGCP / AWS, Hadoop"}