{"jobID": "2683657689", "jobLocation": "San_Diego_CA", "jobTitle": "Data Engineer", "companyRating": "4.7", "companyInfo": {"Website": "www.classy.org", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Blackbaud, Network for Good, RallyBound"}, "estimatedSalary": "113000", "jobDescription": "Position Description: We want you to help us establish Classy as THE thought leader in social impact and fundraising. Help us build our dataset and leverage it to publish reports that support awesome organizations achieve their goals to do good.  Were looking for a data engineer who understands that the key to great analytics and machine learning is a clean, diverse dataset, and has experience building great datasets from challenging and varied sources: Accessing / querying a variety of data sources (relational databases, no-SQL databases, Salesforce, csvs, JSON APIs, web scraping).Filtering and transforming such data to dedupe records and clean the individual data fields.Cross-referencing data with public datasets or paid APIs, to augment the dataset.Ability to use AWS tools, such as Lambda (via serverless), Cloudformation, and Redshift. You will work on a small, talented team of web developers, data analysts, and data scientists to help build the best dataset possible to guide our business and help guide our customers in online fundraising. With this dataset, well aim to answer questions such as: What charities are most likely to succeed on our platform?What factors predict whether a fundraising campaign is successful?How do we identify top fundraising users as early as possible?Can we automatically score how good a users text and images are for fundraising?Much, much more! You will have chances to leverage your existing skills while learning new ones, in a fast-paced startup environment. You will be among the first to work with our unique in-house dataset, to help discover new insights in how Classy can best support organizations and their supporters to do good in the world. Who You Are: Basic requirements: 2+ years of work experience in programming, data scraping, and data querying (preferably all three).Prefer individuals who have completed one or more self-led data science projects, from data aggregation to publishing text and visualizations (the more diverse the data sources, the better!).Great attitudeEagerness to learnMotivated self-starterExcellent communicator Desirable traits also include: Ability to query such data to build analytic reports (e.g. MySQL, MongoDB, Pandas/Python, Node/Javascript).Using appropriate statistical / machine-learning methods to analyze the dataPublishing insights (visualizations and text, internal presentations & blogging)Prototyping tools (via web programming) to expose these insights internally and/or externally (to non-profit organizations)Our awesome perks!New expansive office in downtown San Diego overlooking Petco Park baseball stadium and the ocean29 days off annually including vacation + holidays10 half-day Fridays a year20 hours paid volunteer time offMonthly parking pass, public transit pass, or ride-share allowanceEmployee health benefits available day onePet friendly office (woof!)Compensation will be competitive and commensurate with experience in a SaaS company backed by prominent technology investors, including JMI Equity, Mithril, Salesforce Ventures, and Bullpen Capital. Classy has raised $53 million to-date in growth capital. For more information, visit www.classy.org or follow Classy on Twitter: @Classy.About Classy"}