{"jobID": "2699325852", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Director of Marketing Operations", "companyRating": "3.7", "companyInfo": {"Website": "www.methodhome.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "167000", "jobDescription": " We are people against dirty® (PAD), and we’ve always done things differently. We are fearless thinkers, mad scientists and adventurous designers who believe that making soap leads to brave ideas, bold inventions and beautiful bubbles.  We are small, but we have big plans to make the world a cleaner, greener, more colorful place. And we invite everyone to join us as we pioneer a future where doing business is doing good for all  THE ROLE  The Marketing Operations Director is responsible for connecting all the brand experience workstreams and bringing them to life. This person will work across PR/communications, creative, social media, and customer channels to deeply understand and ensure detailed work plans are in place. This is a hands-on role where leadership, initiative and energy level will make a difference within the brand experience (BE) team and the larger method organization. The role works closely as the CMOs right hand and partners with all BE teams to define and align the marketing plans and track and measure progress and outcomes. AREAS OFRESPONSIBILITY The connector will: Provide strategic and operational rigor to fully integrate marketing messages across all channels, including digital, social, creative, traditional media, and consumer functionsUnderstands“who” we are talking to,“what” we are saying and“why” as it relates to brand planningLeads medium-term planning and engagement across teams to accomplish objectivesHas the ability to project manage through multiple connected workstreamsLead weekly BE cross functional team meetings to report on progress against plansDevelop and consolidate overall annual marketing roadmap in partnership with BE leadersDevelops annual marketing budget and tracks progress in partnership with CMO + BE leadersBuild relationships, collaborate and integrate with PAD general managers and product teamsCreate standardized tools for regular tracking + reporting marketing measurementIdentify systems and tools as needed to continually create efficienciesWork reception once a month* *we are not joking. at people against dirty, everyone in the San Francisco office takes a spin as receptionist. costumes welcome. EXPERIENCE:Knowledge of all core marketing functionsProven experience working on large scale project managementDeep experience with project management tools for marketing teams across initiativesSuccessful collaborator across teams and organizationsProven track record of managing marketing budgetsREQUIREMENTS: 7-10 years of experience in marketing/brand management/project management at a consumer products companyA fast-paced, multi-tasker with cross-functional project management capabilitiesSomeone with both strong analytical skills and an ability to simplify the complexA high energy individual who is passionate about, and has shown success in influencing othersA team player, comfortable with ambiguity and deadline pressuresOutstanding communication skills– both oral and writtenEDUCATION: Bachelor’s degree required PAD PERKS: Our values are at the heart of everything we do. Here are a few of the ways we Care like a Mother for every person against dirty: Rockstar health insurance benefits packageCompetitive vacation bundle + 3 Care Days (a.k.a. Volunteer Time-Off) a yearGenerous retirement match + pre-tax savings optionsGlobal Ping Pong Tournament + Prom...you heard that right! FURTHER INFORMATION  LOCATION: San Francisco  HOURS: exempt, salaried  REPORTS TO: CMO"}