{"jobID": "2756320940", "jobLocation": "Torrance_CA", "jobTitle": "Architectural Entry Level Job Captain-Retail", "companyRating": "4.0", "companyInfo": {"Website": "www.menemshasolutions.com", "Headquarters": "Torrance, CA", "Size": "51 to 200 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "Firm Profile Menemsha architecture is a full -service architectural firm providing a full array of architectural services to some of the most successful fortune 1000 companies throughout the United States.  We are a fast moving, design-focused practice looking to expand our talented team in our Torrance office. Our office culture is highly collaborative, the work ethic highly professional, the spirit youthful and ambitious, and the opportunities great. We are seeking architects who aspire to excellence in all aspects of our work.  With a national reputation for our architectural branding services and tenant improvement rollouts, the firm is quickly moving into other design spheres, including ground-up corporate offices and headquarters, banking and finance, and other challenging typologies.  One of the first architectural firms to fully embrace Building Information Modeling and Integrated Project Delivery systems, our various architectural studios employ state of the art BIM software to bring our cutting-edge designs to life. Job Description Menemsha is seeking motivated individuals to join our practice who possess the core qualities of enthusiasm, strong character, high intellect and strong interpersonal skills.  In particular, we are seeking recently graduated architecture professionals who will be responsible for preparing architectural documents, assisting in coordinating engineering documents, and collaborating with the design team in all aspects of the preparation of construction documents.  A qualified individual will be expected to perform a variety of architecture related tasks and work with the design team for timely completion of deliverables. Job RequirementsProficiency in AutoCAD, REVIT & Microsoft office a must.Proficiency in rendering software preferred.Ability to work in a fast-paced, highly collaborative environment.Strong time management and organizational skills.A self-starter and able to handle multiple projects simultaneously.Experience in any of the following areas is a major plus: Retail tenant improvementRetail ground upA Degree in Architecture from an accredited university.Actively seeking IDP and professional license preferred.Menemsha Offers The Following Employee Benefits:MedicalDental401KPaid Time Off & HolidaysDisability BenefitsLife InsuranceVacationParental LeaveEmployee Perk ProgramDirect Deposithttp://www.menemshasolutions.com/career-opportunities/"}