{"jobID": "2827412321", "jobLocation": "Fairfax_VA", "jobTitle": "Data scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " US Citizen only, must have US Government Security Clarence or ability to obtain. Mine and analyze databases to drive optimization and improvement of product development, analytics techniques and business strategies.  · Assess the effectiveness and accuracy of new data sources and data gathering techniques.  · Develop custom data models and algorithms to apply to data sets.  · Use predictive modeling to increase and optimize customer experience.  · Develop processes and tools to monitor and analyze model performance and data accuracy. Qualifications · Strong problem solving skills with an emphasis on product development.  · Experience working with and creating data architectures.  · Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications.  · Excellent written and verbal communication skills for coordinating across teams.  · A drive to learn and master new technologies and techniques.  The ideal candidate is adept at using large data sets to find anomalies and queries identified as data of interest. They must have strong experience using a variety of data mining/data analysis methods and data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must have a proven ability to drive business results with their data-based insights. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes. Preferred Qualifications: The candidate should have five-seven years of experience manipulating data sets and building statistical models, hold a Master’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field, and be familiar with the following software/tools:  · Coding knowledge and experience with several languages: C++, Java, JavaScript, etc.  · Experience querying databases and using statistical computer languages: R, Python, SLQ, etc.  · Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.  · Experience with distributed data/computing tools: Map/Reduce, Hadoop, Spark, Impala, MySQL, etc.  · Experience visualizing/presenting data for stakeholders using Periscope, Business Objects, D3, ggplot, etc. Education Master’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field."}