{"jobID": "2836366394", "jobLocation": "San_Diego_CA", "jobTitle": "Bioinformatics Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "116000", "jobDescription": "Bioinformatics ScientistWhy is one person more likely to develop a disease, like cancer, than someone else? Why would one person respond differently to treatment than another? Illuminas technologies are helping researchers and clinicians around the world to answer these questions and others, on a scale not even possible a few years ago.Illumina is the only life sciences company developing genome-wide technologies for genotyping, gene expression and sequencingthe three cornerstones of modern genetic analysis. By enabling studies of thousands of patient samples at once, our products set genetic discovery on fast forward. Within our growing Oncology Business Unit, we are striving to develop technologies that will transform basic cancer research and deliver products that will enable personalized treatments for cancer patients.SummaryAt Illumina we have a large number of Bioinformatics Scientist positions open and were scaling as we continue to grow. As a Scientist in Illuminas Clinical Genomics Group, you will work as part of a multi-disciplinary team to develop innovative solutions at the interface of bioinformatics and cancer biology.Our group is focused on tackling some of the most challenging problems in cancer genomics spanning diverse research and clinical applications. If you are an expert in one or more of the following areas, we would like to hear from you.ResponsibilitiesAlgorithm development develop algorithms for analysis of vast amount of studies across various data types and platforms for translational research and clinical applications.Data analysis apply best practice statistical/computational methods to analyze large-scale biological data, such as gene expression, copy-number, mutation, methylation, next-generation sequencing, etc. in a fast-paced product development environment.Pipeline development design and develop pipelines to address novel analytical challenges and to automate established analysis so that thousands of studies can be analyzed in a robust mannerDesired Skills and ExperiencePh.D. in Bioinformatics, Computational Biology, Biostatistics, Computer ScienceExtensive experience working with both DNA and RNA data for immuno-oncology applicationsExpert knowledge on current bioinformatics/genomics/proteomics resources available at NCBI, Ensembl, UCSC, Broad Institute, etc.Strong experience in data analysis and pipeline developmentExpert in Perl or Python, R, shell scripting, and/or C/C++/C#; Python highly preferredAbility to contribute independently and collaboratively, and to excel in a fast-paced environmentBackground in oncology or clinical experienceMust be very detailed orientedSuperior written and verbal communication skillsEOE / Minorities / Females / Veterans / DisabledAbout IlluminaHeadquartered in San Diego, California, Illumina (NASDAQ: ILMN), is a leading developer, manufacturer, and marketer of next generation life science tools and integrated systems for large-scale analysis of genetic variation and biological function. These systems are enabling studies that were not even imaginable just a few years ago, and moving us closer to the realization of personalized medicine. With the innovative advances in our sequencing technologies, we are rapidly impacting the clinical market in areas such as reproductive health and oncology. The expanding Illumina oncology portfolio of next- generation sequencing NGS and microarray technologies is revolutionizing cancer genomics research. Our customers include a broad range of academic, government, pharmaceutical, biotechnology, and other leading institutions around the globe.Illumina has experienced phenomenal growth from $10 million in revenues in 2002 to over $1.4 billion in 2013. Forbes named Illumina #1 on the 2009 list of 25 Fastest-Growing Technology Companies in the United States, the second time over a three year period that Forbes ranked Illumina #1 on its list of rapidly growing technology companies. Illumina was also named #1 smartest company in the world as part of MITs 2014 Technology Review. As of August 2014, the company had a $24 billion market capitalization.Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}