{"jobID": "2788913523", "jobLocation": "Detroit_MI", "jobTitle": "Fraud, Waste and Abuse Data Analyst - Pharmacy", "companyRating": "2.5", "companyInfo": {"Website": "www.mhplan.com", "Headquarters": "Detroit, MI", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " OverviewWho we are: Meridian is a family-owned, family-operated company of passionate leaders, achievers, and innovators dedicated to making a difference in the lives of our members, our providers and in the healthcare industry.  We provide government-based health plans (Medicare, Medicaid, and the Health Insurance Marketplace) in three different states (Michigan, Illinois, and Ohio).  Our employees work hard, play hard, and give back. Meridian employees enjoy: Happy hours, special events, company sports teams, potlucks, Bagel Fridays, weekly Executive Lunches, and volunteer opportunities. A Day in the Life of a Fraud, Waste & Abuse Data Analyst Utilize data analysis techniques to detect aberrancies in Pharmacy claims data. Perform evaluations and analysis of potential fraud cases and requests for information using claims information and other sources of data. Proactively seek out and develop leads and cases received from a variety of sources including CMS and OIG, fraud alerts, and referrals from other government and private sources.Responsibilities Work with FWA staff to proactively apply knowledge of current FWA schemes, coding guidelines and medical policies to identify areas of risk for Fraud, Waste or AbuseProactively research, interpret, and communicate all new and existing legislative and regulatory requirements for all states and lines of business, in a timely and efficient mannerDevelop database tools, models, and methods to extract, validate, analyze, track, trend, and report Fraud, Waste and Abuse dataPerform advanced and in-depth data analysis, of provider profiling, member, provider, and pharmacy trends, claims data review, etc. to determine Medicaid recovery opportunities from fraudulent, abusive or erroneous claim payment activities and provide recommendations to reduce future occurrencesAssist in and track all activities related to recovery of inappropriate payments discovered as a result of fraud, waste and abuse analysis, audit, or investigationUtilize data mining, advanced statistical analysis techniques, and statistical modeling, to review and analyze data (e.g., authorization, claims, encounter, pharmacy, member, vendor, and provider files) to determine provider-billing patterns and trends, and to detect potential fraudulent or abusive billing practices or vulnerabilities in Medicaid program and initiate appropriate actionConduct post-audit monitoring of providers to determine if coding compliance is achievedDevelop probe and statistical random samples and project potential overpayments based on the probe or statistical random sampleDevelop, generate, and revise routine and ad hoc detail and summary level reports, including written interpretation of analytic results and report automation.Develop comprehensive and detailed analyses on erroneous or fraudulent Medicaid billing activities in order to support the revenue collection and reconciliation process.Provide support to and assist FWA Staff as neededIdentify opportunities for improvement through the audit process and provide recommendations for system enhancement in order to augment investigative outcomes and performanceComplete thorough data analysis reviews including, but not limited to: historic pharmaceutical data review, ER utilizations, medical and pharmacy claims data, etc.Partake in preparation for internal and external audits, collect necessary data, create reports and documentation as requiredIdentify noncompliance issues, collaborate with the FWA team for potential solutions, escalate issues to management as necessary QualificationsWhat you can bring to Meridian:Bachelor’s degree is requiredMaster’s degree is preferredStrong interest in Pharmacy, Medicare and Medicaid Fraud, Waste and Abuse investigationOther certifications a plus: Certified Pharmacy Technician (CPhT), Certified Fraud Specialist (CFS), Accredited Healthcare Fraud Investigator (AHFI) and Certified Fraud Examiner (CFE)Pharmacy experience helpfulRetail pharmacy experience a plusWhat Meridian can offer you:Our healthcare benefits include a variety of PPO plans that are effective on the first day of employment for our new full-time team members.Opportunity to work with the industry’s leading technologies and participate in unique projects, demonstrations, conferences, and exclusive learning opportunities.Meridian offers 401k matching that is above the national average.Full-time Meridian employees are eligible for tuition reimbursement towards Bachelor’s or Master’s degrees.Meridian was named Detroit's #1 Fastest Growing Company by Crain's Magazine, so it is a great time to get involved with Meridian. Equal Opportunity Employer  #MSTR"}