{"jobID": "2837034037", "jobLocation": "Houston_TX", "jobTitle": "Institute Associate Scientist I - In-Vitro Pharmacology", "companyRating": null, "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " MD Anderson is known for providing cancer patients with exceptional care, which includes early access to innovative new treatments through clinical trials. The Institute for Applied Cancer Science (IACS) is a new hybrid model that uniquely combines the drug discovery capabilities of the biopharmaceutical industry and the extensive knowledge of biology found in academia with the expertise of MD Anderson's top clinicians. IACS has the singular goal of rapidly developing novel, effective and safe therapeutics that improve patient health. IACS executes programs with the highest probability of clinical success in a rigorous, goal-oriented, data-driven manner.  We are seeking a highly motivated and team-oriented individual to join our in vitro Pharmacology group to support our fast-paced drug discovery programs. Ideal candidate will have laboratory experience obtained from an internship or work experience in addition to required education.  Salary range: Min $30,400 - Mid $38,000 - Max $45,600 KEY FUNCTIONSUnder direct supervision, conduct laboratory experiments to develop, optimize, validate, and implement biochemical, biophysical, and cell-based assays for medium and high-throughput screening to support small molecule drug discovery projects. Under direct supervision, assist with managing the IACS chemical compound collection. This consists of maintaining and updating a library of barcoded vials of samples, tracking sample  inventory in an electronic database, preparing microtiter plates of the compounds, and providing  compound samples to IACS researchers for experiments. Execute screening and counter screening funnels for drug discovery programs.Monitor assay quality and troubleshoot issues with assay performance.Interact closely with other biologists and medicinal chemists on discovery-based project teams.Analyze data and prepare written and oral reports to project teams.Employ safe laboratory practices.Maintain research records and laboratory notes.Participate in integrated drug discovery research teams.Education Required: Bachelor's degree in Biology, Biochemistry, molecular biology, cell biology, enzymology, pharmacology, chemistry or related field.  Preferred: Bachelor's degree in Biochemistry, Pharmacology, Chemistry or related field from an accredited university. Master's degree in science from an accredited university.  Experience  Required: No experience.  Preferred: Research experience in a drug discovery setting. Prior experience with biochemical and cell-based assay development, as well as experience in the use of these assays for small molecule  library screening.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}