{"jobID": "2001396734", "jobLocation": "Los_Angeles_CA", "jobTitle": "SUPERVISING CLINICAL LABORATORY SCIENTIST III", "companyRating": "3.7", "companyInfo": {"Website": "www.lacounty.gov", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1850", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "44", "jobDescription": " Position/Program Information DEPARTMENT OF HEALTH SERVICESFILING DATES: 11-01-2016 at 8:00 A.M. PSTUntil the needs of the service are met and is subject to closure without prior notice.EXAM NUMBER: Y4905I TYPE OF RECRUITMENT - DEPARTMENT PROMOTIONAL OPPORTUNITYRestricted to permanent employees of the Department of Health Services who have successfully completed their initial probationary period.  Current employee in the unclassified service who meet the following criteria also qualify to participate in this exam:Unclassified employees who have attained permanent County status on a classified position by successful completion of the initial probationary period, with no break in service since leaving the classified service. Full-time employees in the unclassified service with at least six months of full-time experience in the unclassified service at the time of filing or by the last day of filing.NO WITHHOLDS OR VERIFICATION OF EXPERIENCE LETTERS / OUT-OF-CLASS EXPERIENCE ARE ALLOWED FOR THIS EXAMINATION.  DEFINITION:Exercises technical and administrative supervision, through subordinate laboratory scientist supervisors, over a multi-unit, multi-shift clinical laboratory organization. Essential Job Functions Directs the work of Supervising Clinical Laboratory Scientists assigned to various units and shifts, conferring with them on personnel and other administrative as well as technical problems; evaluates workloads and redistributes personnel as necessary. Evaluates the performance of subordinate Supervising Clinical Laboratory Scientists and reviews their evaluations of clinical laboratory scientists and ancillary personnel; counsels subordinates on steps they may need to take to improve performance. Inspects laboratory operations in all units on all shifts to assure continuing conformance to established quality and safety standards; takes immediate action to correct any deficiencies which may be noted. Serves as the laboratory organization's representative or liaison with other hospital / ambulatory care facility disciplines or staff service departments when coordinated effort is required to assure the effective management of patient care. Functions as a resource for subordinate supervisors; consults with and guides them in the selection of alternative solutions to varied administrative and technical problems including personnel problems. Assists supervisor in the development, modification, and implementation of policies and procedures necessary for the effective operation of a multi-unit, multi-shift laboratory and the establishment of uniform standards and other criteria according to which individual employee and unit performance can be evaluated. Assists supervisor in the preparation of the annual budget for a multi-unit, multi-shift laboratory, recommends new or additional personnel and equipment, evaluates the recommendations of subordinate supervisors, gathers statistical data, and writes justifications to support requests. Confers with staff physicians regarding the frequency of and their need for test procedures not currently performed in-house; collects and analyzes data on available alternatives and comparative cost factors, and develops recommendations for supervisor. Requirements SELECTION REQUIREMENTS:Two (2) years of experience as a Supervising Clinical Laboratory Scientist I* in the service of the County of Los Angeles. LICENSE:**Clinical Laboratory Scientist's issued by the California State Department of Health Services.PHYSICAL CLASS II - Light: Light physical effort which may include occasional light lifting to a 10 pound limit, and some bending, stooping or squatting. Considerable walking may be involved.SPECIAL REQUIREMENT INFORMATION*Supervising Clinical Laboratory I in the County of Los Angeles is defined as: provides technical and administrative supervision for a single shift of an in-hospital or ambulatory care facility clinical laboratory unit performing standardized tests within a specialty or across specialty lines.**Applicants must attach a valid legible photocopy of their license to practice as a clinical laboratory scientist issued by the State of California Department of Health Services to the application at the time of filing, or you must fax to (323) 869-0942 or email it to the exam analyst, within fifteen (15) calendar days of filing online. **The required license and certificate MUST be current and unrestricted; conditional, provisional, probationary or restricted licenses and/or certificates will NOT be accepted. Additional Information Examination Content:This examination will consist of two (2) parts:PART I - An evaluation of training and experience based upon application information weighted 60%.PART II - An appraisal of Promotability which will evaluate Knowledge & Skills, Adaptability, Dependability, Productivity and Supervision weighted 40%.Candidates must achieve a passing score of 70% or higher on each weighted part of this examination in order to be added on the eligible register.ELIGIBILITY INFORMATIONApplications will be processed on an \"as received\" basis and those receiving a passing score will be promulgated to the eligible register accordingly.The names of candidates receiving a passing grade on the examination will be added to the Eligible Register in the order of their score group for a period of twelve (12) months following the date of promulgation.No person may compete in this exam more than once every twelve (12) months.VACANCY INFORMATIONThe resulting Eligible Register will be used to fill a vacancy at the Department of Health Services as they occur.SPECIAL INFORMATIONAppointees my be required to work any shift, including evenings, nights, weekends and holidays.Available Shift: AnyAPPLICATION AND FILING INFORMATIONAPPLICATIONS MUST BE FILED ONLINE ONLY. APPLICATIONS SUBMITTED BY U.S. MAIL, FAX OR IN PERSON WILL NOT BE ACCEPTED.  Apply online by clicking on the green \"Apply\" button at the top right of this posting. You can also track the status of your application using this website.All information is subject to verification. We may reject your application at any time during the examination and hiring process, including after appointment has been made. Falsification of any information may result in disqualification or rescission of appointment. Utilizing VERBIAGE from Class Specification and Selection Requirements serving as your description of duties WILL NOT be sufficient to demonstrate that you meet the requirements. Doing so may result in an INCOMPLETE APPLICATION and you may be DISQUALIFIED. This examination will remain open until the needs of the service are met. Application filing may be suspended at any time with or without advance notice.  Fill out your application completely. The acceptance of your application depends on whether you have clearly shown that you meet the REQUIREMENTS. Provide any relevant education, training, and experience in the spaces provided so we can evaluate your qualifications for the job. For each job held, give the name and address of your employer, your job title, beginning and ending dates, number of hours worked per week, description of work performed, and salary earned. If your application is incomplete, it will be rejected. Applications electronically received after 5:00 p.m., PST, on the last of filing will not be accepted. NOTE: If you are unable to attach required documents, you must fax them to (323) 869-0942 or e-mail the documents to the exam analyst, within 15 calendar days of filing online. Please include the exam number and the exam title.  SOCIAL SECURITY NUMBER: Please include your Social Security Number for record control purposes. Federal law requires that all employed persons have a Social Security Number. COMPUTER AND INTERNET ACCESS AT PUBLIC LIBRARIES: For candidates who may not have regular access to a computer or the internet, applications can be completed on computers at public libraries throughout Los Angeles County. NO SHARING OF USER ID AND PASSWORD: All applicants must file their application online using their own user ID and password. Using a family member's or friend's user ID and password may erase a candidate's original application record.DEPARTMENT CONTACTAni Shaboyan, Exam Analyst(323) 914-8251AShaboyan@dhs.lacounty.govADA COORDINATOR PHONE(323) 869-7124CALIFORNIA RELAY SERVICES PHONE800-735-2922"}