{"jobID": "2820520794", "jobLocation": "Washington_DC", "jobTitle": "Inside Enterprise Territory Manager (French-Speaking)", "companyRating": null, "companyInfo": {"Website": "www.tableau.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Company - Public (DATA) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Cognos"}, "estimatedSalary": null, "jobDescription": " **What youll be doing******The Inside Enterprise Territory Manager is responsible for driving newbusiness sales of Tableau products within a specified geographic territory ofEnterpriselevel accounts, while continuing to support the growth of existingcustomers, exceeding sales objectives. This role manages all aspects of thesales process including prospecting, lead management, qualification, productdemonstrations, evaluation, close and account care. This is a quotacarryingsales position that plays an integral role in the success of the overall salesteam. Fluency in French is required for this role.**Some of the things youll be doing include** * Define and execute territory sales plans and then meet and exceed sales goals (quotas) through prospecting, qualifying, managing and closing sales opportunities within the assigned geographic territory. * Develop and manage sales pipeline prospect and assess new sales potential while moving a large number of transactions simultaneously through the sales pipeline. * Manage and track customer and transactional information in a CRM system. * Coordinate resources throughout the sales cycle, including product support and sales engineering. * Provide initial product demonstrations and general support to prospective customers. * Nurture and expand the companys relationship within customer accounts. * Provide regular reporting of pipeline and forecast through the CRM system. * Keep abreast of competition, competitive issues and products. * Practice effective, excellent communication with management, customers and support staff. * Participate in teambuilding and companygrowth activities including strategy setting, sales training, marketing efforts and customer care. * Travel to customer locations in support of sales efforts.**Who you are** * **Experienced. **3-6 years of software sales experience, including managing and closing complex sales campaigns to sizeable clients delivering 6-figure wins. * **Domain Expertise. **Experience with analytics, data, databases, predictive modelling, or business intelligence preferred. * **Relentlessly High Standards. **Consistent overachievement of sales goals, including quotas, with high transactional volume and activity levels (calls, demos, meetings, etc.) * **Detail oriented. **Nothing gets overlooked when it comes to you. * **Go-Getter. **Desire to bring new customers into the Tableau franchise and maximize revenue. Willing to go the extra mile with a strong work ethic; self-directed and resourceful. * **Excellent Communication. **You know what to say and more importantly, how to say it. * **Technically Savvy. **Proficiency in Microsoft Windows, Word, Excel, Outlook, Internet Explorer required. Working knowledge of Salesforce.com or equivalent preferred Bachelor's Degree with a technical or business focus preferred. * **You are a Recruiter! **Tableau hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring onboard to help us continue to build one of the best companies in the world!Tableau Software is a company on a mission. We help people see and understand their data. After a highly successful IPO in 2013, Tableau has become a market-defining company in the business intelligence industry. Our culture is casual and high-energy. We are passionate about our product and our mission and we are loyal to each other and our company. We value work/life balance, efficiency, simplicity, freakishly friendly customer service, and making a difference in the world!Tableau Software is an Equal Opportunity Employer."}