{"jobID": "2608341046", "jobLocation": "San_Francisco_CA", "jobTitle": "Legal Secretary", "companyRating": "3.4", "companyInfo": {"Website": "www.chapman.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1913", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " McDermott Will & Emery, Mayer Brown, Katten"}, "estimatedSalary": "74000", "jobDescription": " The San Francisco office of Chapman and Cutler LLP is seeking a Legal Secretary with strong document production and client service skills to join its finance-focused legal practice. The candidate must be able to interact with coworkers and clients in a professional, approachable manner, be independently motivated and embrace ownership of day-to-day responsibilities. Responsibilities will include, but are not limited to the following: Assisting attorneys with preparation and collection of correspondence and documentation required for financial transaction closingsWord processing, editing, proof reading and distribution of legal agreementsOrganizing, assembling and distributing electronic and paper closing setsPreparing and editing presentations and other tasks related to attorney marketing initiativesAssisting with administrative tasks when requested (including preparing expense reports, making travel arrangements, answering phones, scheduling events, entering attorney time, etc.) At least three years of document production experience is required; prior law firm experience is highly advantageous. Also important are attention to detail, the ability to prioritize effectively, juggle multiple deadlines and handle confidential and sensitive information. The candidate must have strong computer skills (including proficiency in Microsoft Word, PowerPoint, Excel and Outlook, and various document storage and management systems), enjoy problem solving and client service, and be a team player. The candidate will be expected to work both independently and as part of a larger team depending on the nature of the projects assigned.  To apply, please submit a cover letter and resume. All applicants will be considered; however, the hiring decision will be based on qualifications for the position. Chapman and Cutler LLP is an Equal Opportunity Employer M/F/D/V/SO."}