{"jobID": "2837116255", "jobLocation": "Alexandria_VA", "jobTitle": "Computer Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.uspto.gov", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1790", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " * DutiesHelp## Duties### Summary**Come work for the USPTO, we have been ranked as one of the Best Places to Work in the Federal Government!**The U.S. Patent and Trademark Office (USPTO) has been serving the economic interests of America for more than 200 years. We are responsible for granting US intellectual property rights for patents and trademarks. Our efforts have provided inventors exclusive rights over their discoveries. It's an effort that continues to contribute to a strong global economy, to encourage investment in innovation and to cultivate an entrepreneurial spirit for the 21st century. The USPTO is headquartered in Alexandria, Virginia, and has over 12,000 employees, including engineers, scientists, attorneys, analysts, IT specialists, etc. all dedicated to accomplishing the USPTOs mission, vision, strategic goals and guiding principles. For more information about the USPTO, please visit the USPTO Careers Website.The Chief Information Officer (CIO) is the principal advisor to the Under Secretary and Director of the United States Patent and Trademark Office (USPTO) on the application of information technology (IT) to support and improve the Agencys business processes. The Office of Organizational Policy and Governance (OPG) provides the management and oversight of enterprise Information Technology (IT) strategies, guidance, policies, and agency-wide cybersecurity. The Software Quality Assurance Division is responsible for monitoring and executing software development testing standards for OCIOs coding, source code control, code reviews, testing, release management, and product integration within an established software development life cycle. The Software Test Branch (STB) serves as a gatekeeper for all USPTO-developed applications and infrastructure projects.* **A probationary period may be required*** **A recruitment incentive may be authorized****This vacancy is also being announced under the USPTOs Merit Promotion Program, the Job Announcement Number is CIO-2018-0115. Please review that announcement to determine if you are eligible for consideration under the Merit Promotion Program.**The following links provide information on various hiring authorities that do not fall under competitive examining procedures as this announcement; however, they may enable you to apply through merit assignment procedures, or be eligible for a non-competitive appointment.* VRA* VEOA* 30% or more disabled veteran* Persons with disabilities* CTAP* ICTAPLearn more about this agency### ResponsibilitiesThe position serves as a software, information technology, hardware, and computer expert and architect on all computer science and associated matters related to the assigned software prototypes, products, technologies and initiatives under the Office of Policy and Governance. This position is responsible for:* Developing advanced concepts of automation and information processing display, control, and transfer.* Staying abreast of emerging developments and capabilities in software engineering, system design, testing and simulations.* Conducting analyses to determine the feasibility of various advanced scientific approaches for future programs or to resolve major controversial problems in current programs, and conducts research on the feasibility of developing new products and/or theories pertaining to new applications of existing products.* Coordinating and providing technical software/hardware program guidance and direct technical support to the employees engaged in the development of system and subsystems to ensure system integrity and compatibility with other support activities.* Appling principles, methods and techniques of software engineering with in-depth knowledge of test automation architecture, computer theory, algorithms, database design, data structures, programming concepts, modeling and simulation technology to support the analysis, design and development of mission critical software applications.* Determining adequacy of software, computer, and product/system design and capabilities; and writes diagnostic programs, designing, and writing code for operating systems and software to ensure efficiency.### Travel RequiredNot required##### Supervisory statusNo##### Promotion Potential14### Who May Apply#### This job is open toApplications will be accepted from all United States Citizens and Nationals.Questions? This job is open to 1 group.* #### Job family (Series)1550 Computer Science#### Similar jobs* Architects, Computer Systems Software* Computer Systems Software Architects* RequirementsHelp## Requirements### Conditions of Employment* You must be a U.S. Citizen or National.* Your resume and question responses must demonstrate the job-related KSAs.* You must meet the definition of specialized experience.* Required to pass a background investigation and fingerprint check.* Must be registered for Selective Service, if applicable (www.sss.gov)* Suitable for Federal employment..### QualificationsYou must meet the following United States Office of Personnel Management's (OPM) qualification requirements for the advertised position. OPM's prescribed Group Coverage Qualification Standard for Computer Science Seriescan be found at** Qualification Standard**.** **You must meet all qualification requirements by the closing date of the job announcement.**Specialized Experience**: is experience that has equipped you with the particular knowledge, skills and abilities to perform successfully the duties of the position, and that is typically in or related to the position to be filled. To be creditable, specialized experience must have been equivalent to at least the next lower grade level in the federal service.Candidates for the GS-14 grade level must have at least 52 weeks of specialized experience equivalent to the GS-13 grade level in the Federal service.Specialized experience for this position includes:**Skill Set 1** Conducting software and infrastructure research to determine testing strategies for software application and infrastructure-related projects; AND**Skill Set 2** Performing analysis on software development test standards and compliances to ensure that the software performs in accordance to the business unit requirements; AND**Skill Set 3** Conducting analyses to determine the feasibility of various testing approaches for future.Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.### Education**Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus**.Special Instructions for Foreign Education: Qualifying education from colleges and universities in foreign countries must be evaluated in terms of equivalency to that acquired in U.S. colleges and universities. Applicants educated in whole or in part in foreign countries must submit sufficient evidence, including transcripts, to an accredited private organization for an equivalency evaluation of course work and degree. A listing of these accredited organizations can be found on the Department of Education's website - US Department of Education. Another listing of services that an perform this evaluation is available at the National Association of Credential Evaluation Services (NACES). You must provide a copy of the letter containing the results of the equivalency evaluation with a course by course listing along with your application. Failure to provide such documentation when requested will result in lost consideration.NOTE: Only education and experience acquired before the filing deadline will be considered. Report only attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.### Additional informationApplicants applying for this position must be a United States Citizen.If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System. If you are exempt from registration under Selective Service Law, you must provide appropriate proof of exemption. Please visit the Selective Service System website for more information.This is a bargaining unit position.A recruitment incentive may be authorizedThis is a Public Trust position and has a risk level designation of moderate.Background Investigation - If selected for this position, you may be required to complete a Declaration for Federal Employment (OF-306), which includes a fingerprint and credit check, to determine your suitability for Federal employment and to authorize a background investigation.The USPTO participates in E-Verify. For more information on E-Verify, please visit the Department of Homeland Security Website.Probationary Period- If selected, you may be required to complete an initial one-year probationary period.All Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choice.Relocation Expenses are not authorized and will not be paid.CTAP and ICTAP candidates will be eligible for selection priority if it is determined that they have exceeded the minimum qualifications for the position by attaining at least a \"well qualified\" rating of 85 out of 100. Information about CTAP and ICTAP eligibility is on the Office of Personnel Managements Career Transition Resources website at: http://www.opm.gov/ctap. CTAP/ICTAP documentation requirements are listed in the \"Required Documents\" section of this announcement.**More than one selection may be made from this announcement** if additional identical vacancies in the same title, series, grade, and unit occur within 90 days from the date the certificate was issued.All application materials become the property of the United States Patent and Trademark Office.*The United States Patent and Trademark Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factors. If you believe that you have been discriminated against and would like to file an EEO complaint, you must do so within 45 days of the date of the alleged discriminatory act. Claims of employment discrimination must be submitted to the attention of the USPTOs Office of Equal Employment Opportunity & Diversity via email (oeeod@uspto.gov) or phone (571-272-8292).*Read more### How You Will Be EvaluatedYou will be evaluated for this job based on how well you meet the qualifications above.Your resume, optional cover letter and supporting documentation will be reviewed to determine if you meet the minimum qualifications for the position. If you meet the minimum qualifications stated in the job opportunity announcement, we will compare your resume, optional cover letter and supporting documentation to your responses on the self-assessment questions (True/False, Yes/ No, Multiple Choice questions) and place you in one of three pre-defined categories. These categories are gold, silver, and bronze. Your resume and/or optional cover letter must support your responses to the scored occupational questionnaire, or your score may be lowered. Candidates placed in the gold category will be identified for referral to the hiring manager and may be invited for an interview.How you will be evaluated for preference eligibility: Within each category, those entitled to veterans preference will be listed at the top of the pre-defined category for which they are placed.The scored self assessment questions in the job announcement will evaluate you on the following competencies; please do not provide a separate written response:KSA 1 - Skill in applying advance computer science, software engineering or architectural theories, principles, concepts, standards, and methods sufficient to apply theories and/or new applications.KSA 2 - Knowledge of web-based software development.KSA 3 - Knowledge of leading edge software design tools, approaches, design, and implementation of large-scale software testing solutions.KSA 4 - Ability to manage a diverse program of work consisting of multiple projects requiring establishment and dynamic adjustment of priorities and milestones, ensuring customer needs are met with robust and credible tools.For more information on category rating, please go to: http://hr.commerce.gov/s/groups/public/@doc/@cfoasa/@ohrm/documents/content/prod01009474.pdfPlease note that a complete application is required for consideration. (Please review the Required Documents section of this job announcement to see what must be included in a complete application).**To preview questions please click here.**Read more### Background checks and security clearance##### Security clearancePublic Trust - Background Investigation##### Drug test requiredNo* Required DocumentsHelp## Required Documents**A complete application consists of:****1. A resume or any other written format you choose to describe your job-related qualifications; optional cover letter:** Your resume should indicate your citizenship and should list your educational and work experience including job titles, salary, employment dates, duties and accomplishments, experience and how it relates to the KSAs in the job announcement. Please Note: Responses to job questions that are not fully supported by the information in your resume may result in adjustments to your rating. Any experience claimed in a cover letter should be substantiated by information contained in your resume.**2. Transcripts**: (for Individual Occupational Requirements and/or Substitution of Education for specialized experience): You **MUST** submit copies of your college transcripts for verification of the education requirements. Unofficial copies are acceptable, however, if selected you will be required to furnish official transcripts. It is your responsibility to provide adequate proof that you meet the above educational requirements. Inadequate or illegible information could result in non-qualification and loss of consideration.**Supporting Documents:**PLEASE NOTE: Applicants who meet the minimum eligibility and qualification requirements for this position may be contacted within 7 business days of the closing date of this announcement to submit follow-up supporting documentation if applicable. Applicants claiming veterans preference entitlement or CTAP/ICTAP eligibility who fail to submit supplemental documentation within 5 business days of receiving the request will not lose consideration for this position, however they will not be entitled to special or priority consideration.**Supporting documents that may be requested of applicants after the closing date of this announcement are**1.** Veterans Preference Documentation:** If you are a veteran with preference eligibility, you will be asked to submit a copy of your DD-214 containing your discharge disposition, dates of service, and rank. If you are a preference eligible claiming a service connected disability of 10 percent or more, you will be asked to submit documentation (i.e. a letter dated 1991 or later from the Department of Veterans Affairs or from a branch of the Armed Forces) certifying to the veterans present receipt of compensation. Veterans must include dates of military service within the automated application process, and submit a copy of each Certificate of Release or Discharge from Active Duty, DD-214. For more information, please visit Special Appointing Authorities for Veterans.**2. Career Transition Assistance Program (CTAP) or Interagency Career Transition Assistance Program (ICTAP) documentation:** Applicants will be asked to submit:(1) A copy of your specific RIF notice, written notice of your expected separation or other documentation of priority consideration status;(2) A copy of your latest SF-50 noting current position, grade level, and duty location;(3) A copy of your last performance appraisal including your rating; and(4) Any documentation from your agency that shows your current promotion potential.You can choose **ONE** of the following methods to submit Supporting Documents:1) You can upload your documents when you register or update your information on the Department of Commerce application site which you access through the USAJobs site.OR2) You can fax your documents to 571-258-4254 using the system generated fax cover sheet.**Your application and all required documentation must be received by 11:59 p.m. Eastern Time on the closing date of this job announcement.**NOTE: The preceding documentation requirements are based on job requirements and individual applicant eligibility. Not all documents are applicable to all applicants--if you are unsure which documents apply to you, contact the HR Specialist listed on this announcement.Review your resume and responses carefully. Responses to job questions that are not fully supported by the information in your application package may result in adjustments to your rating. A Human Resources Representative will validate the qualifications of those candidates eligible to be referred to the hiring official.#### If you are relying on your education to meet qualification requirements:Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.* BenefitsHelp## BenefitsA career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits.**Reasonable Accommodation Policy Statement**Federal agencies, including the United States Patent and Trademark Office (USPTO), must provide reasonable accommodation to applicants with disabilities where appropriate. USPTO Job Applicants requiring reasonable accommodation for any part of the application and hiring process should request accommodation(s) from the USPTO at http://www.uspto.gov/accommodation. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.Review our benefitsEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered.* How to ApplyHelp## How to Apply**Personally Identifiable Information (PII)**Personally Identifiable Information (PII) is defined as information that can be traced back to a specific individual and potentially compromise their security or privacy. Examples of PII include: date of birth, Social Secur"}