{"jobID": "2795793710", "jobLocation": "Los_Angeles_CA", "jobTitle": "Lead Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Lead Data Scientist DATE 30 Jun LOCATION Los Angeles COMPENSATION $130,000.00 KEY SKILLS DESCRIPTION Job description The client is a Tier 1 Financial Services Institution that is in search of a highly skilled individual that can fill their Lead Data Scientist role on their Advanced Analytics team. As a technical lead, you will be expected to oversee the entirety of the model development process with minimal supervision. Specifically, you will provide and head individual contributions and establish/execute Design of Experiments roadmap, as well as writing/testing computer programs in model-building platforms. With a fast track expectation to a management role, the Lead Data Scientist should expect to communicate with business leadership often; this individual is responsible for bringing new, innovative ideas regarding analytics as an application to business measures. This individual will also act as a liaison between analytics and IT efforts. Working primarily in an R/Python environment, the client welcomes experienced individuals that are proficient in SAS and SQL on a day-to-day basis that are willing to learn new languages. Finally, using SQL and distributed computing frameworks (Spark, Hadoop, MapReduce, Impala), the Lead Data Scientist will write complex queries and establish connections between large datasets for analytic applications. This individual will utilize large sets of structured and unstructured data for the purpose of creating/designing complex analytic models – this will require experience in data mining technologies. The following technology may be utilized: Python, Perl, SQL, VB, numerical and statistical packages (SAS, R, Matlab, Statistica, Scikit-Learn). Desired Skills and Experience - STRONG STATISTICAL BACKGROUND OR MACHINE LEARNING  - 10+ years of professional experience, preferably in software development  - Master’s Degree in quantitative science field required (mathematics, statistics, computer science, engineering, operations research, etc) – PhD preferred  - 3-5 years of hands-on data science work  - 4+ years of mathematical/statistical application to business problems  - Proficiency in database programming languages (SQL/pl-SQL preferred)  - Proficiency in statistical analytical software (Matlab, Statistica, SAS, R preferred)  - Proficiency in at least one of the following programming languages: Python, Java, Perl, SQL  - Superior communication skills While a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an  agent please contact one of our regional offices. Utmost confidentiality and discretion is assured."}