{"jobID": "2775024321", "jobLocation": "Reston_VA", "jobTitle": "Senior Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.peoplentech.com", "Headquarters": "Vienna, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " Background: Data Analysis is the art of collecting and analyzing data so that FEP can use said data to address gaps in operational capabilities and support analytics and reporting projects. The Senior Data Analyst/Modeler is a highly trained professional who will become an expert in our source data and lead the data mapping effort to migrate the data into our new enterprise data platform. The Senior Data Analyst/Modeler will use his/her technical expertise and work closely with source system experts to perform data research, run advanced queries, assess data quality and integrity issues, determine data definitions, and define data mappings. Tasks: Candidate will support the implementation of a Data Integration/Data Warehouse for the Informatics Teams  : Data Cleaning - identify erroneous data and determine appropriate resolution  : Analyze and assess the quality and integrity of the data  : Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality  : Understand the meaning/business context of data  : Acquire data from internal or external data sources and maintain mapping documents of the files, databases/data systems.  : Perform data analysis and data modeling to create source to target mappings.  : Evaluate risk from statistical information to determine risk to operations or non-compliance.  : Perform gap analysis of data requirements versus current data sources.  : Work closely with business analysts and source data experts to develop data requirements.  : Assess current data and assist in the resolution of data anomalies.  : Interpret data, analyze results using statistical techniques and provide ongoing reports and feedback  Required Qualifications  : Candidate must be able to convert to FEPOC Full Time Employee (does not require a sponsorship)  : 5+ years demonstrated experience as Data Analyst  : Strong Structured Query Language (SQL) skills  : Demonstrated ability to perform complex queries, assess data quality and develop data mappings.  : Working knowledge of U.S. Healthcare Industry  : Experience with multiple data warehousing and analytics development projects  : B.S. in Mathematics, Engineering, or Computer Science  Preferred Qualifications  : Master of Science in Mathematics, Engineering, or Computer Science  : Working knowledge of HEDIS, Fraud, Waste & Abuse  : Working knowledge of ETL  : Experience with Hadoop and Big Data technologies  : Working knowledge of ALM  : Working knowledge of COBOL"}