{"jobID": "2829656660", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Engineer, Senior Associate", "companyRating": "3.8", "companyInfo": {"Website": "us-jobs.kpmg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1987", "Type": " Subsidiary or Business Segment", "Industry": " Accounting & Legal", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " PwC, Deloitte, EY"}, "estimatedSalary": "83000", "jobDescription": "Business Title: Machine Learning Engineer, Senior AssociateRequisition Number: 33523 - 30Function: Business Support ServicesArea of Interest: Data AnalyticsState: ILCity: ChicagoDescription:Innovate. Collaborate. Shine. Lighthouse - KPMG's Center of Excellence for Advanced Analytics - has both applied data science, AI, and big data architecture capabilities. Here, you'll work with a diverse team of sophisticated data and analytics professionals to explore solutions for clients in a platform-diverse environment. This means your ability to find answers is limited only by your creativity in leveraging a vast array of techniques and tools. Be a part of a high-energy, diverse, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. For you, that translates into the chance to work on a wide range of projects - covering technologies and solutions from AI to optimization - and the power to have a real impact in the business world. So, bring your creativity and pioneering spirit to KPMG Lighthouse.  KPMG is currently seeking a Senior Associate to join our KPMG Lighthouse - Center of Excellence for Advanced Analytics.  Responsibilities: Rapidly architect, design, prototype, and implement architectures to tackle the Big Data and Data Science needs for a variety of Fortune 1000 corporations and other major organizationsWork in cross-disciplinary teams with KPMG industry experts to understand client needs and ingest rich data sources such as social media, news, internal/external documents, emails financial data, and operational dataResearch, experiment, and utilize leading Big Data methodologies, such as Hadoop, Spark, Redshift, Netezza, SAP HANA, and Microsoft AzureImplement and test data processing pipelines, and data mining / data science algorithms on a variety of hosted settings, such as AWS, Azure, client technology stacks, and KPMG's own clustersTranslate advanced business analytics problems into technical approaches that yield actionable recommendations, across multiple, diverse domains; communicate results and educate others through design and build of insightful visualizations, reports, and presentationsDevelop skills in business requirement capture and translation, hypothesis-driven consulting, work stream and project management, and client relationship development Qualifications: Bachelor's degree from an accredited college/university in Computer Science, Computer Engineering, or related field and minimum four years of big data experience with multiple programming languages and technologies; Master's with 2 years of relevant experience; or PhD with 1 year of relevant experienceFluency in several programming languages such as Python, Scala, or Java, with the ability to pick up new languages and technologies quickly; understanding of cloud and distributed systems principles, including load balancing, networks, scaling, in-memory vs. disk, etc.; and experience with large-scale, big data methods, such as MapReduce, Hadoop, Spark, Hive, Impala, or StormAbility to work efficiently under Unix/Linux environment or .NET, with experience with source code management systems like GIT and SVNAbility to work with team members and clients to assess needs, provide assistance, and resolve problems, using excellent problem-solving skills, verbal/written communication, and the ability to explain technical concepts to business peopleApplicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future and the ability to travel up to 80% at times KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service, genetic information, personal appearance, family responsibility, matriculation or political affiliation, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please.GL: 5GF: 15304"}