{"jobID": "2758094858", "jobLocation": "Raritan_NJ", "jobTitle": "Senior Scientist, Bacterial Vaccines Clinical Read-Outs", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": "Janssen Research & Development, LLC, a member of Johnson & Johnson's Family of Companies, is recruiting for a Senior Scientist, Bacterial Vaccines Clinical Read-Outs located in Raritan, NJ.Johnson & Johnson's Family of Companies are dedicated to addressing and solving the most important unmet medical needs of our time, including those in oncology, immunology, neuroscience, infectious disease, and cardiovascular and metabolic diseases. Driven by our commitment to patients care, we develop sustainable, integrated healthcare solutions by working side-by-side with healthcare stakeholders, based on partnerships of trust and transparency.We are seeking an exceptional candidate to join the Bacterial Vaccines group at Janssen Research & Development. You will report to the Clinical Readouts Scientific Director, Raritan, and your main responsibility will be to manage a team conducting analysis of vaccine-mediated immune responses in clinical samples by ELISA assays under GCLP conditions.You will:Lead an established team delivering accurate immunological data as required by clinical study plansSummarize and analyze dataWrite SOPS, Study Plans and ReportsParticipate in research planning and evaluation of new technologies as neededThriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, Janssen Research & Development, LLC is proud to be an equal opportunity employer.BE VITAL in your career. Be seen for the talent you bring to your work. Explore opportunities within the Johnson & Johnson Family of Companies.QualificationsA Ph.D. with post-doctoral experience in microbiology, cell biology, immunology or a related discipline is required.Minimum 2+ years of experience in pharmaceutical industry is requiredA high level of laboratory proficiency, including hands-on experience working with ELISA assays and related immunological assays is requiredA proven record of high productivity in academic or industrial setting is requiredSkills in prioritizing, efficient coordination of resources and collaboration are requiredMust be a highly organized group leader and great teammate, who performs well in a dynamic, deadline-driven development environmentThis position is located in Raritan, NJ and will require approximately 5-10% international travelFamiliarity with high-throughput and multiplex assays, including the use of 384-well and MSD technologies is strongly preferredExperience in clinical assay testing is strongly preferredExperience with vaccine-associated clinical assays is strongly preferredExperience with GCLP processes and internal/external audits is strongly preferredAssay Qualification and Validation experience is strongly preferredFamiliarity with laboratory management software such as LIMS is strongly preferredPrimary Location United States-New Jersey-Raritan Organization Janssen Research & Development, LLC. (6084) Job FunctionR&D;Requisition ID9762180424"}