{"jobID": "2747000982", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist (ID Analytics)", "companyRating": "4.4", "companyInfo": {"Website": "www.idanalytics.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": " ID Analytics is a leader in credit and fraud risk solutions with patented analytics, proven expertise and up-to-the-minute insight into consumer behavior. Founded in 2002, with a vision to think differently about how institutions solve the problem of verifying consumers’ identities, we now solve a full range of identity challenges, including assessing credit risk and improving online customer experience. Our tools help our clients protect themselves and their customers from identity risk and fraud. Our solutions are all powered by analytics, but it’s our access to data unseen by other bureaus that differentiates our solutions. ID Analytics is a Symantec company.  We are looking for a Data Scientist to join our team. Overview: The Data Scientist is part of a team that develops and refines data-driven models that power ID Analytics’ products and services, improves data technology infrastructure, and communicates ongoing research and analysis to stakeholders. The Data Scientist implements statistical algorithms and machine learning models, explores and understands new data sources, and regularly works with out-of-memory data sets.  This position requires working knowledge of business needs and the ability to work independently to design solution paths that achieve the needs of the customer. Depending on the assignment, frequent client interaction may be required to complete deliverables. Responsibilities:Analysis, design, development, test, troubleshooting, and documentation of complex data systems that may involve one or more of the following: predictive score models, feature extraction, data-driven analysis, application of machine learning algorithms, decision making, and related utilities.Completing written documentation and reports of results in the form of business reports, internal technology white papers, and statistical system documentation.Independent resolution of problems or coordinating score model design architecture, as well as designing solution approaches to complex applied problems.Devising new approaches to solve difficult statistical modeling problems. This includes new model concepts and designs, such as different targets and objective functions, and new or different uses of data sources.Critical reviews of data experiments to ensure accuracy, completeness, and feasibility.Identifying and deploying new algorithms or combinations of algorithms in creative ways to achieve performance improvement.Other duties as assigned.Qualifications:PhD in a relevant technical discipline. Master’s degree in a relevant technical discipline (Math, Engineering, Computer Science, Statistics or similar field) with at least 3 years of job experience or Bachelor’s degree in a relevant technical discipline with 5-7 years of job experience. or a.2 years of experience with mainstream programming languages such as Java, Python, and Scala.Strong mathematical and statistics skills.Strong interpersonal and communication skills (both written and oral): Ability to communicate complex technical or statistical concepts to a non-technical audience.Work as part of a team and collaborate with colleagues while maintaining highest levels of respect and positive team spirit.Establish and maintain cooperative working relationships with colleagues at all times.Preferred Skills:Credit risk management industry experience in developing scoring models will be a strong plus for this position.Identity Fraud industry experience is a strong plus.Prior experience using machine learning to build predictive models that solve real-world problems.Experience using cloud or distributed computing frameworks such as Hadoop, AWS/EMR, BigQuery, etc.Demonstrated ability to apply modern data exploration and visualization techniques to deliver actionable insights.Experience in collaborative projects using software development best practices such as version control and testing.Experience with statistical and scientific computing.Experience with Unix/Linux system architecture and command line tools.Experience with scripting languages. ====================​====================​  Symantec is an equal opportunity employer. All candidates for employment will be considered without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, state or local law.Apply"}