{"jobID": "2668961908", "jobLocation": "Menlo_Park_CA", "jobTitle": "Advanced Natural Language Computer Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": "118000", "jobDescription": " SRI’s Speech Technology and Research (STAR) Lab seeks a self-motivated, team-oriented, experienced researcher and innovator to perform natural language processing research in cutting-edge projects including machine translation, natural language understanding and dialog systems. Projects may address short- and long-term needs of the government and of commercial markets.  The STAR Lab engages in leading-edge research in speaker characterization, speaker and language identification, machine translation, natural language processing, audio processing, speech recognition, and other areas of speech/language technology. With a multidisciplinary research staff supported by excellent software engineers, we offer opportunities from basic research to prototyping, productization, and widespread deployment, as well as contributing technology and ideas to new ventures supported by SRI. STAR is a leader in both core research and system delivery, with hundreds of research publications, dozens of patents, and fielded products. Characteristics of STAR staff are enthusiasm, self-motivation, initiative, passion for learning, taking ownership, thriving in a flat organizational hierarchy, and a desire to control their own career paths. Opportunities are available for both recent graduates and more senior researchers.  SRI International is a premier nonprofit research organization based in Silicon Valley, California, with more than 2300 employees worldwide and with a mission to create world-changing solutions making people safer, healthier, and more productive. SRI is the best of all worlds, encompassing everything from basic research to delivered systems, government and commercial work and spinning off successful companies like SIRI. You will work in the heart of Silicon Valley, the world’s center for innovation and technology. SRI is a “bottom-up” organization where individual initiative is cherished and leadership opportunities abound. We work on flexible, cross-laboratory teams that dynamically form to solve specific problems spanning multiple disciplines, as well as being part of a core group, the STAR Laboratory. A PhD degree or equivalent in speech/language technology, computer science, or a related disciplinePrior experience in at least one of the following areas: natural language understanding (NLU), dialog systems, information extraction, machine translation, machine learning (especially deep learning for NLP).Strong implementation skills (Python, C/C++, Java, MATLAB or other prominent programming language) Familiarity with UNIX/Linux operating system is required."}