{"jobID": "2749083736", "jobLocation": "Washington_DC", "jobTitle": "Data Science Lead", "companyRating": null, "companyInfo": {"Website": "www.caqh.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data is CAQH’s most critical asset and you will change how we understand it. CAQH is seeking a hands-on leader for our Health Data Science team. The Data Science Lead will take the prime role in analyzing, driving and delivering results based on large health care databases – from CAQH, from member plans and from third parties. The successful candidate will have experience in health plan performance and quality measurement and/or comparative effectiveness analysis. As a senior member of the Solutions team, the individual will be expected to contribute to business development activities, and mentor the research staff. The successful candidate can understand content area, determine what the data means, define analysis plans, select appropriate statistical methods, conduct quantitative analysis, program solutions in statistical or other programming languages, ensure an effective quality analysis plan, and communicate with internal and external clients. This is a highly technical and applied leadership position that requires experience with data science, algorithm engineering, software development, programming, and large-scale databases.  This role is full-time exempt position and reports to the Director, Technology. Specific Responsibilities: • Set the direction and development of CAQH’s research and performance measurement activities by generating research ideas, investigating data and developing data design and data structures related to the projects.  • Build, lead and mature a Data Science team to support the breadth of CAQH needs. Work within the data team and across our products and the company on design, execution, and reporting of projects to ensure highest rigor. Engage the data team to enhance their intellectual curiosity and technical skills.  • Advance the company’s reputation as a leading provider of quality assured provider data.  • Study the data from multiple angles, determine what the data means and recommends the best possible way to analyze it. Spot trends and patterns, determine what is noise and what is good data and convey that understanding to others.  • Develop analytical plans for research and other projects including: algorithm selection (data mining, machine learning etc.), advanced probability & statistics, predictive modeling, machine learning, relational database design, program design, selection of statistical methods, creation of project timelines, and development of formats for presenting results to meet customer needs. This includes the preparation of memos and close out reports to contribute to knowledge management and documentation.  • Conduct programming tasks and statistical analyses including preparation and cleaning of data, implementation and refinement of statistical methods, preparation of results, creation of databases and other outputs, and verification of the accuracy of results. Participate in quality assurance processes and review code, output tables and charts.  • Lead, design, plan, and execute programming approaches to support various development projects. Code at an expert level in applications such as SAS, R, Python. Drive relational database design as well as the use of MongoDB and Hadoop/HDF.  • Present analytic results to customers, CAQH staff and other researchers incorporating descriptions of methods, relevant literature, and other background material to provide context for the results.  • Represent CAQH to scientific audiences. Enhance CAQH reputation for scientific leadership in performance measurement through public speaking, publications, etc.  • Leading technical (econometric modeling/statistics) reviews of health-related proposals and deliverables. Skills: • Strong quantitative skills, including random assignment evaluation, quasi-experimental design, and mixed method evaluation strategies. Skilled at developing and applying univariate and multivariate modeling techniques, hypothesis testing.  • Proficiency in statistical software packages strong programming skills in other languages such as C#, Java or Python required. Certification a plus.  • Excellent ability to communicate complex technical material, both orally and in writing with the ability to explain complex models and analysis in layman terms.  • Preferably an extensive knowledge of one or more of the following areas: Medicare, Medicaid, quality of care, comparative effectiveness, aging, long-term care, or disability.  • A track record of publications is a plus. Experience: • Five+ years of experience delivering algorithm innovation into commercial software-based products.  • Three or more years of experience analyzing large datasets.  • Three or more years as a lead with experience in managing a team. Education: Master’s degree (PhD preferred) in Mathematics or Computer Science with experience in health services research, applied statistics or a combination of education and experience which demonstrates the necessary skills and abilities.   "}