{"jobID": "2795292464", "jobLocation": "Torrance_CA", "jobTitle": "Business Systems Analyst (IS Governance/Compliance/Data Privacy)", "companyRating": null, "companyInfo": {"Website": "www.calance.com", "Headquarters": "Buena Park, CA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " MATRIX Resources"}, "estimatedSalary": null, "jobDescription": " FOR IMMEDIATE DETAILS ABOUT THIS POSITION, contact ANY of us direct, referencing the job# below: Kindest Regards:LINDSEY YOUNG: (949) 860-4713 ADAM WEBB: (949) 860-4711 KIANA AREVALO: (949) 860-4703 JOANNE SMITH: (949) 860-4720 SUMIT KUMAR (949) 860-4718EMAIL: Recruiter.key@calance.com ==============================================================================* LOCAL CANDIDATES ONLY (Southern California Only) **Position: Business Systems Analyst (IS Governance/Compliance) JOB REF#: 31345Duration: 12+ Months (On-going Contract) Location: Torrance, CA 90501 (on-site only) Rate: Open, depends on exp level (W2/INC/C2C) * We WILL accept Incorporated (INC), W2, or Corp to Corp (C2C) candidates for this position, MUST BE LOCAL ** A global company is seeking to hire an experience Business Analyst Information Technology III for a long-term, on-going contract. Although this is a contract role, the average consultant has been with this client between 6-9 years. If you are looking for a long-term stable opportunity, that offers medical/dental benefits and paid sick time, than this position is for you. All work will be performed on-site and you MUST be available for a face to face interviews. RESPONSIBILITIES INCLUDE: Execute daily IS Governance activities, which include following up on status of activities, developing status reports, and refining existing processes to gain efficiencies.  Coordinate IS Governance programs across North America.  Meet with program participants at other affiliated companies to assist in their achievement of IS Governance compliance.  Assist affiliates with identification of countermeasures and remediation items to increase compliance levels via online meetings and when possible face to face.  Execute additional tasks as needed by management to ensure successful completion of IS Governance/Compliance activities.  Assists with facilitating project governance and corporate priorities.  Gathers, refines, and validates complex business requirements, interdependencies, potential risks and issues.  Analyzes business partner's operations to understand their strengths and weaknesses to determine opportunities to automate processes and functions.  Assists in the business process design or redesign and documentation as needed.  Translates high level business requirements into functional specifications and manages changes to such specifications.  Facilitates communication and gains commitment between business units to align solutions with business strategies.  Develops complex business cases.  Works on multiple projects as a project team member, at times as a project leader. REQUIRED SKILLS/EXPERIENCE: (Resume must reflect this experience)  5+ years of experience as Business Systems Analyst, gathering/defining business requirements, business cases, business process design and documentation  Advanced understanding of IS Governance/Compliance data privacy regulation activities.  Understanding of IS Governance/Compliance best practices, specifically within the areas of data privacy and international data privacy regulations (E.g., NIST, ISO, COSO, COBIT,  PCI, GLBA and EU GDPR)  Experience working with IS Governance/Compliance activities, reports, and documenting processes  Advanced ability to gather/refine complex business requirements recommend or make decisions on business requirements/interdependencies.  Advanced ability to develop complex business cases.  Advanced ability to create impact analysis to make recommendations.  Must have a stable work history, working in a similar role for a large environment  Excellent written and oral communication skills Education: Bachelor's Degree in Computer Science, Information Systems, Business Administration, or other related field or equivalent work experience. DESIRED SKILLS:Certifications: CISSP, CISM, CGEIT, CISRM certification. CALANCE Consultants are offered the following benefits: Medical/Dental/Vision benefits  401K Retirement program  Paid Bi-Weekly/Direct Deposit  Flex Spending Plan  Voluntary Life, AD&D;, STD or LTD plans Recruiter: Calance Recruiters Phone: (800) 732-4680 - provided by Dice  IS Governance / Compliance, Data Privacy"}