{"jobID": "2757295411", "jobLocation": "Foster_City_CA", "jobTitle": "Sr Research Scientist II, Fibrosis", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "191000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionOverview We are seeking an exceptional scientist to lead efforts to discover and validate new therapeutic targets for fibrosis. This is an exciting opportunity to join an established fibrosis team dedicated to pipeline development and translational research for chronic fibrotic and metabolic diseases including non-alcoholic steatohepatitis (NASH) and diabetic kidney disease (DKD).  Gilead Sciences is a world leader in liver disease research having developed small molecule compounds that have revolutionized the treatment of HCV and HBV. Over the last 5 years, Gilead has significantly broadened its scope to encompass unmet medical needs in chronic fibrotic diseases including non-alcoholic steatohepatitis (NASH) and diabetic kidney disease (DKD). Gilead has developed a pipeline of investigational compounds which are currently in late-stage clinical trials for NASH. Our research team is intensively engaged in the discovery and development of additional small molecule and antibody therapeutics and combination therapies for patients with advanced liver and kidney fibrosis. This position represents a high-impact leadership opportunity to support the growth of these new therapeutic areas. Essential Duties and Job Responsibilities:Reports to the Senior Director of Fibrosis BiologyDevelops strategic direction of fibrosis pipeline and leads discovery and validation efforts for new anti-fibrotic targetsManages a group of high performing scientists that discovers new targets, supports existing fibrosis projects and evaluates combination therapiesSupports evaluation of external licensing opportunitiesManages external collaborations with academic and industry partnersWorks collaboratively with research, biomarker and early clinical development projects teams with opportunity to lead project teamsParticipate as an engaged member of a highly interactive biology departmentKnowledge, Experience and Skills:Applicants must have a PhD or equivalent degree and at least 10 years of directly relevant biotechnology or pharmaceutical industry experience.Expertise in fibrosis, metabolic disease and/or inflammation with a strong track record of scientific accomplishments, demonstrated by peer-reviewed scientific publications in well recognized journals and/or by advancement of drug candidates in these fieldsExperience leading projects (or key project initiatives) from early stage through preclinical development (IND). In depth understanding of target discovery and validation approaches, drug development, and generation of pharmacology regulatory reports. Experience in pharmacodynamic biomarker identification and validation strategies is desired.Broad experience in target identification strategies through use of genomics, tissue-based analysis and transcriptomics/proteomics, and/or phenotypic screeningPreference will be given to candidates with direct expertise in identifying and validating molecular targets that contribute to the pathophysiology of fibrotic and metabolic diseases including NASH and/or kidney disease.Experience with both small molecule and antibody therapeutics is a plusExperience managing a team of scientists and working successfully in a cross-functional team settingProven scientific/leadership expertise (working in teams, managing people/projects). Candidate must be detail-oriented with excellent record keeping and organizational skills.Must be a highly flexible, results oriented, independent self-starter who enjoys working in a fast paced dynamic environment.Ability to synthesize complex scientific and business problems into strategy and tacticsBasic understanding of IP, contracting terms and provisions.Strong written and oral communication skills with an ability to communicate and scientifically engage individuals across a large breadth of levels #LI-KW1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}