{"jobID": "2809123149", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.premiseinc.com", "Headquarters": "Clearwater, FL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": " Premise is Growing! We are hiring a Senior Data Scientist in San Francisco, CA to infuse our team with drive, technical and intellectual horsepower, and diverse perspectives. In this role you get to work with novel and diverse data sets to extract interesting, actionable insights and meaning.  Premise is a worldwide network and predictive analytics platform bringing visibility to the world's hardest-to-see places. We enable global decision-makers to move faster and make smarter decisions by employing local, on-the-ground contributors to observe and collect real-time data. Our current clients include the United States Agency for International Development (USAID) and United States Department of State (DOS). A $66M Series C Venture Capital organization, we are backed by Google Ventures, SocialCapital, and Andreessen Horowitz, among others, and our board and advisors include thought leaders such as Larry Summers and Rajiv Shah. Learn more about us at www.premise.com; or follow us at @Premise.com. Our Team: We are a passionate, tight-knit team that moves fast, appreciates candor, and deeply values the diversity of our backgrounds. Our diversity mirrors the global nature of our work: we've lived in 30 countries, speak 14 languages, and believe in the value of life experience that an unconventional background inherently brings. What unites us is our innate curiosity and collective ambition to build technology that ultimately has a measurable human impact. What you get to do:Design and build models and algorithms to improve the targeting, quality and accuracy of data collection, including:Anomaly detection and automated quality checks for text, image and geospatial dataAutomated fraud detectionRecommendation and assignment systems for distributing data collection \"tasks\" to our usersUnique place identification from crowd-sourced location check-ins and imageryDevelop data products from our unique internal data sets including economic data and other conditions that impact citizens and their quality of lifeEvaluate off-the-shelf solutions for their applicability to our businessClearly communicate findings to internal partners including engineers, product managers and business analystsOwn data science problems from ideation, EDA and prototype through production implementationCollaborate with a diverse, cross functional team to achieve company goals and meet customer needsYour background likely includes:MS or PhD in Statistics, Computer Science, Applied Mathematics, Operations Research, Physics or other quantitative fieldsFluency in Python and working knowledge of SQLA keen sense of what is important and what isn't when performing open-ended statistical analysisA love for problem solving and seeing your solutions have an impactExperience working with real, complex data including EDA, feature generation and visualizationSustained attention to quality and detail, goal-oriented, strong programming and excellent communication skillsBonus points:Prior startup experience (preferably in an analysis-oriented engineering or data science role)Experience with machine learning or statistical models for geospatial or temporal data, or optimization techniquesExperience designing, developing and maintaining your own data flowsTrack record of building and maintaining production data science models, services, pipelines or data storesPress: Washington Post: These smartphone photos can help shape national policy  Wired: Photos are creating a real-time food index  TechCrunch: Premise raises $50 million to outsource the collection of economic data  The New York Times: Lawrence Summers to join Board of hyperdata startup  BuzzFeed: Introducing the 'Trillion dollar business that's waiting to be destructed'SDL2017"}