{"jobID": "2807691340", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.uchicago.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1890", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " Department23300 SSD-Administration  About the UnitConsistently ranked among the top ten social science research universities in the world, the Division of Social Sciences is at the vanguard of inquiry and impact. Whether through the field-defining scholarship of the Chicago Schools in Sociology and Economics, the path-breaking impact of the first graduate international affairs program in the U.S., the creation of interdisciplinary programs in the Department of Comparative Human Development and the John U. Nef Committee on Social Thought, or many other pivotal milestones, the Division has repeatedly transformed the social sciences since its founding in 1930. The Division offers PhD degrees in nine disciplines and Master of Arts degrees in five interdisciplinary fields. The Division also offers a number of joint degrees, and these collaborative initiatives uniquely position the Division to pioneer creative modes of thinking about societys most complex issues.  Job Information Job Summary: Data Scientist will provide support and leadership on multiple ongoing research projects linked to the Urban Resiliency Initiative at the University of Chicago. They must have strong experience using a variety of data mining/data analysis methods, including statistical analysis, building and implementing models, using/creating algorithms and creating/running simulations. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for using a variety of different data sets and methods to address specified research questions, and working with other team members and stakeholders to maximize the quality of project deliverables. Responsibilities:Identify data analysis/visualization needsDevelop visual representations of data to communicate findings to project leadershipDevelop and implement data collection strategies in support of multiple projectsBuild and maintain secure data storage solutionsDevelop and adhere to data quality assurance and quality control (QA/QC) processesApply machine learning, natural language, and statistical analysis methods, such as classification, sentiment analysis, topic modeling, regression, statistical inference, and validation methods, to structured and unstructured dataAnalyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analysesOversee the creation of visual representations of data for project deliverablesEnsure all project artifacts and documents are safely archived following project completionIn tandem with the PI and operations manager, coordinate IRB/Research Administration process for projects from inception to conclusionCompetencies:Excellent organizational skills and attention to detail requiredAbility to manage multiple projects simultaneously and meet tight deadlines requiredAbility to use Microsoft products for project tracking, budgeting and resource management (e.g. understands how to use vlookup function) requiredAbility to work both independently and as a team member requiredAbility to work discretely with sensitive and confidential data requiredStrong written and verbal communication skills requiredStrong project management skills required Additional Requirements Education, Experience or Certifications:Education:Master's degree, preferably in sciences, social sciences, public policy, business or another relevant field required.Doctoral degree in the sciences, social sciences, public policy, business, or another relevant field preferred.Experience:2+ years of project management or consulting experience required.2+ years of analyzing structured and unstructured data in a team environment using any combination of R, Python, SQL, etc preferred.Technical Knowledge or Skills:Experience implementing machine learning algorithms such as support vector machines, decision trees, logistic regression, clustering, neural networks, graphical models etc.Experience utilizing and applying into projects knowledge of Python based data science tools such as Pandas and NumpyExperience developing data science analytic models and operationalizing these models to run in an automated context requiredProven ability with NLP and text based extraction techniques requiredKnowledge of software engineering methodologies and best practicesRequired Documents:ResumeCover LetterReference Contact InformationNOTE: When applying, all required documents MUST be uploaded under the  Resume/CV  section of the application.  Benefit EligibilityYes  Pay FrequencyMonthly  Pay Range  Depends on Qualification  Scheduled Weekly Hours37.5  UnionNon-Union  Job is Exempt?Yes  Drug Test Required?No  Does this position require incumbent to operate a vehicle on the job?No  Health Screen Required?No  Posting Date2018-06-06-07:00  Remove from Posting On or Before2018-12-06-08:00 Posting Statement: The University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.  Staff Job seekers in need of a reasonable accommodation to complete the application process should call ************ or submit a request via Applicant Inquiry Form.  The University of Chicago's Annual Security & Fire Safety Report (Report) provides information about University offices and programs that provide safety support, crime and fire statistics, emergency response and communications plans, and other policies and information. The Report can be accessed online at: *********************************** Paper copies of the Report are available, upon request, from the University of Chicago Police Department, 850 E. 61st Street, Chicago, IL 60637."}