{"jobID": "2817375351", "jobLocation": "San_Bruno_CA", "jobTitle": "Sr. Technical Data Analyst - Online Media and Advertising Operation", "companyRating": "3.6", "companyInfo": {"Website": "www.redolentech.com", "Headquarters": "Newark, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " We have following urgent role with our DIRECT client TITLE: Sr. Technical Data Analyst - Online Media and Advertising Operation LOCATION: San Bruno, CA  DURATION: 6+ months - CONTRACT TO HIRE - Option available  Compensation: Competitive ( DOE )  The Client's eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better.  The Analyst will work as part of a larger pod or sub-team and be willing to take on a number of role with the focus of driving advertiser or customer satisfaction.Duties The analysts primary objective is to drive the entire workflow for our self-service customers which include: Providing technicalsales support to many advertisers and customersProviding training and guidance to those who are utilizing our platform for the first time.Creating documentation and helping to troubleshoot ad campaigns when issues arise for advertisers.Optimize campaigns and monitor them daily to ensure there are no performance issues and we generate high return on advertising spend.Assisting with trafficking ad campaigns and help with designing or providing recommendations to the client.Knowledge of Flash, HTML, and JavaScriptRequired Qualifications:Experience in 4+ years of Ad Operations, Ads Engineering, or Marketing / Media Buying.Own the process of ad traffic optimization using proprietary tools, providing support for the Sales and Account Management team, and conducting deep client analysis focusing on growth.Experience with third-party ad-serving systems: Doubleclick, Mediaplex, DG MediaMind, Atlas.Experience with rich media solutions: Doubleclick RM, Mediaplex RM, DG MediaMind, Pointroll, Flashtalking, etc.Leverage data using SQL to quickly troubleshoot any issues that arise and impact the performance of the campaign for advertisers.Evaluate and make decisions on campaign spend rates, user quality, creative performance, and marketplace opportunities. • Expertise in Microsoft Excel, Tableau or any dashboarding tools like Tableau, Thoughtspot, or Domo. Dive into investigations and communicate outcomes to management and leadership teams.Bachelors degree in Computer Science, Software Engineering.Great communication & presentation skills."}