{"jobID": "2817601888", "jobLocation": "Los_Angeles_CA", "jobTitle": "Clinical Laboratory Scientist", "companyRating": null, "companyInfo": {"Website": "www.soliant.com", "Headquarters": "Tucker, GA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are currently looking for a Clinical Laboratory Scientist. If you enjoy working as a Clinical Laboratory Scientist, and would like to advance and gain more responsibility and autonomy in the field, you can move into a technologist position. A lab technician works in a laboratory assisting scientific and technical staff in day-to-day duties. The work is varied and rewarding with plenty of scope for career progression. Job Description: Clinical Laboratory Scientists are the mainstay of the scientific research lab. They perform tests to produce reliable and precise data to support scientific investigations. They often work in research and development facilities in areas as diverse as hospitals, clinics, pharmaceutical companies, food manufacturers, diagnostic labs and chemical companies where they help to create or improve processes, techniques, equipment, products or materials. Quality assurance technicians work with food and drink, pharmaceutical, colour technology and agrochemical companies to ensure every stage of the manufacture process meets rigorous standards. Job Detail:Employment Type: Direct HireClient: Community HospitalLocation: Los Angeles, CAEmployment Type: Permanent- Full-Time CLSShift: Night | 3 x 12- hour shifts | 6:00 pm - 6:00 am (Wednesday-Friday night)Required Skills:Client is seeking a Permanent- Full-Time CLS. Prefer Local Candidates that already live in California.Must have Blood Banking experience.Must have some Micro experience and Microscan.Must have experience with all or most of our major equipment. Vitros 350, Siemens EXL, Abbott Ruby, Sysmex CA 540 or 620 a plus! At Soliant Healthcare, we firmly believe that our travelers are the heartbeat of our organization and we are happy to offer the following benefits: Competitive Pay & weekly paychecksHealth, dental, vision, and life insurance401(k) savings planContinuous professional and clinical trainingBenefit eligibility is dependent on employment status. APPLY BELOW TO BE SUBMITTED IMMEDIATELY  Please contact me directly to hear about all our Fulltime and Perm Contract Positions throughout the U.S. Feel free to send over your resume/references and complete the following checklist www.soliant.com/skillschecklist Please also reference my name on the checklist- Alex Roberson - I look forward to hearing from you soon.Alex Roberson  Sr. Account Executive  Soliant Healthcare  Local: (770) 776-2096  alex.roberson@Soliant.com"}