{"jobID": "2776094141", "jobLocation": "Washington_DC", "jobTitle": "Cyber Security Lead", "companyRating": null, "companyInfo": {"Website": "www.prosphere.com", "Headquarters": "Alexandria, VA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewProSphere is seeking a Cyber Security Lead with experience supporting federal government initiatives in Washington, DC. The qualified candidate will complete tasks designed to ensure security of the customer's systems and information assets. He/She will protect against unauthorized access, modification, or destruction and will work with end users to determine needs of individual departments; implement policies or procedures; and track compliance through the organization. This is a full-time position located in Washington, DC. Veterans are encouraged to apply.Responsibilities Provide information security expertise and leadershipCoordinate with organizational security teams to ensure program consistency and compliancePerform monitoring and threat analysis on network, systems, and applicationsPerform web application penetration testingAnalyze logs/trafficIdentify potential IT security incidentsAssess threat and vulnerability informationDevelop mitigation and remediation plansDevelop plans to safeguard systems using countermeasuresWith the Information Security Office, perform surveillance of user, software and network assets for appropriate use and enterprise wide protectionMonitor current reports of computer virusesDocument computer security and emergency measures policies and testsQualificationsBachelor’s degree or equivalent work experienceAt least eight (8+) years of related experienceExperience leading a security teamExperience establishing security controlsExperience performing advanced analysis of SOC systemsExperience with incident identification/analysis and escalation proceduresExperience with federal cybersecurity initiatives, including but not limited to: Compliance, Federal Initiatives from DHS and Continuous Diagnostics and Mitigation (CDM), Information Assurance, FISMA, FedRAMPKnowledge with the following to prevent, detect and remediate threats: LAN/WAN, routing/switching, firewalls, ACLs, TCP/IP, DNS, SMTP, SNMP.Implement, manage, maintain, and upgrade security tools: IBM Proventia, NetIQ, Websense, McAfee Endpoint Protection, Nessus Vulnerability ScannerOne or more preferred certifications: Cisco, GISP, GCIA, ASIA, CCSP, CISSP, ACSA, SSCPTravel may be requiredAbility to work overtime required on occasionAbility to sit in an office environment for long periods of timeRemote and on-call responsibilities may be required It is ProSphere’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law."}