{"jobID": "2776384689", "jobLocation": "Irving_TX", "jobTitle": "Professional, Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.corelogic.com", "Headquarters": "Irvine, CA", "Size": "5001 to 10000 employees", "Founded": " 2010", "Type": " Company - Public (CLGX) ", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Join the team that powers the global real estate economy - CoreLogic is an innovative, future focused company whose vision is to deliver unique property-level insights that power the global real estate economy.  We are a $1.95 billion in sales company with more than 6,000 employees globally serving the financial services and insurance industries. We are evolving at a rapid pace and the clients we serve are challenged from every direction, which means we are growing and innovating to help drive their success. Working together, and differentiated by our superior data, analytics and data-enabled solutions, we empower our clients to make smarter business decisions through data-driven insights. We take initiative, are fully accountable, build respect and trust, make transparency a must - and engage, include and collaborate at every turn.  We take pride in our work and believe in cultivating a work environment that supports and values our greatest asset: our talented employees. Job Duties: Responsible for the ongoing production of customized data for specific client requests with a focus on residential property transactions. Perform data research and quality review to ensure data fulfillment is performed within SLA. This role is process/production oriented and needs an understanding of public record data, systems, and data operations processes. Perform quality audits on client request data prior to moving into production.Understand, query and manipulate varying data and file formats to ensure data quality before data goes into next production step.Monitor automated processes for customized client data sets and produce client output.Interact with customers and resolve their data issues.Identify data quality problems and directly resolve or coordinate solutions.Maintain documentation of processes and procedures.Develop strong business relationships to ensure successful implementation and support project efforts.Education, Experience, Knowledge and SkillsBachelor's degree required2+ years of related experience with a background in real estate/public record dataDemonstrated experience in operations and continual process improvementStrong knowledge of SQL and ExcelStrong interpersonal skills, with customer-facing experienceStrong knowledge of MS office applicationsAbility to work under tight deadlinesUnderstanding of database processing techniques and concepts including flow charting, file documentation, data analysis, and relational database principlesExcellent written and oral communication skills CoreLogic offers an empowered work environment that encourages creativity, initiative and professional growth and provides a competitive salary and benefits package. CoreLogic is an Equal Opportunity/Affirmative Action employer committed to attracting and retaining the best-qualified people available, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, disability or status as a veteran of the Armed Forces, or any other basis protected by federal, state or local law. CoreLogic maintains a Drug-Free Workplace. We are fully committed to employing a diverse workforce and creating an inclusive work environment that embraces everyone's unique contributions, experiences and values. Please apply on our website for consideration."}