{"jobID": "2815613279", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Project Manager", "companyRating": "4.2", "companyInfo": {"Website": "corp.kixeye.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": " We are currently seeking a Senior Project Manager to work on one of KIXEYE's most successful titles - Battle Pirates. This role requires strong leadership skills, cross-discipline communication, organization, and direction to achieve business objectives. You are responsible for determining needs, coordinating schedules, prioritizing tasks, mitigating risks, communicating progress, and improving processes. What you get to do every day:Manage the entire development cycle from spec brief, kick-off, task breakdown to feature complete. Coordinate with discipline leaders to allocate appropriate resources and define time costsManage short term and long term roadmap planning and prioritization with product and tech.Manage JIRA tickets by releases and produce burn-down reports, triage tickets to responsible disciplines.Report release status in a timely manner, create release checklist and follow up on sign offSchedule events and previews on admin panel, maintain live-ops schedule docCoordinate live issues with engineers and other disciplines to make sure game is up running.What you bring to the role:A demonstrable track record of leadership, communication, and deliveryUnderstand development dependencies, be able to work with different discipline teams like engineering, QA, artists, product managers, and game designers.Anticipate blind spots, breakdowns in communication, and gaps in expectations and proactively seek to correct themMotivate, coordinate, and manage the activities of personnel to achieve project goalsFacilitating communication between engineers, product manager, designers and artistsQualifications:BA/BS degree or equivalent work experienceMinimum 5 years of project management/producer experienceExperienced in Agile software development processes, and tools such as JIRAExtremely strong communication skills, able to communicate effectively with engineering, management, customers, and business personnel"}