{"jobID": "2827851753", "jobLocation": "Chicago_IL", "jobTitle": "Unit Manager Analytics Consulting", "companyRating": "3.2", "companyInfo": {"Website": "www.hcsc.com/careers/index.html", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1936", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " UnitedHealth Group, Aetna, Humana"}, "estimatedSalary": "69000", "jobDescription": " Description: BASIC FUNCTION:This position is responsible for managing and controlling the activities of a team of analysts supporting Enterprise Quality and Accreditation activities related to reporting, operations of healthcare provider reporting and testing of business intelligence solution as a subject matter expert on advanced analytics, programming of data processing; analyzing complex business problems and issues using data from internal and external sources; bringing expertise or identifying subject matter experts in support of multi-functional efforts to identify, interpret and produce recommendations and plans based on company and external data analysis; ensuring that policies and procedures align with corporate vision; selecting, developing and evaluating personnel ensuring efficient operation of the function. JOB REQUIREMENTS:*Bachelor Degree in Math, Actuarial Science, Business Statistics, Accounting or Finance OR 4 years experience.*4 years experience in data analysis and information reporting relating to healthcare data, including pharmacy OR 4 years experience interfacing with external clients, large employers, brokers, or consultants OR 4 years experience in presenting analytic results to both internal and external audiences *Experience interfacing with external clients, large employers, brokers, or consultants.*Experience managing multiple client relationships.*Knowledge of Healthcare benefits, terminology, and concepts and insurance economies.*Knowledge of quantitative and qualitative standards and measures and statistical measures and concepts.*Interpersonal and team-building skills.*Verbal and written communication skills, including presentation skills.*Self-starter and ability to work with minimal supervision to meet deadlines.*Leadership, organizational, planning, and analytical abilities.*Ability to interact with all levels of the company.*Ability and willingness to travel including overnight stays.PREFERRED JOB REQUIREMENTS:* Experience with several of the following areas: 1) data analysis and relational-style query languages; 2) machine learning and/or statistical modeling; 3) data visualization; 4) a high-level programming language; 5) distributed computing; 6) understanding of healthcare; 7) working with large databases or data warehouses,* 5 years experience with the following technologies: SQL, R, Tableau. * Experience with Python/NumPy, Linux, Hadoop/Hive, TeradataThis position is based in Chicago, IL or Naperville, IL. Relocation will not be provided for this position. Sponsorship will not be provided for this position. Location: IL - Chicago  Activation Date: Wednesday, June 20, 2018  Expiration Date: Saturday, July 21, 2018 "}