{"jobID": "2764575028", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.scalefactor.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "If you love the fast-pace and high energy of the Austin start-up scene and you are looking for a role that allows your work to have a direct impact on a company’s success, come talk to us. We are looking for aData Scientist to add to our expanding engineering team!ABOUT US: ScaleFactor is working to pioneer big change in our industry, and we need people that enjoy venturing into uncharted territory and blazing a trail with innovative solutions. We are a high-growth organization that combines trusted experts with intuitive software to solve businesses’ accounting and finance needs. Our trusted experts review businesses’ monthly financial statements to ensure accounts are accurate and healthy so owners and operators can focus on running their businesses. Our in-house team draws on their vast experience to provide skilled solutions to help business owners conquer their most complex financial needs. ABOUT YOU: You possess the entrepreneurial drive & spirit to thrive in a fast-paced, evolving environment. As a Data Scientist at ScaleFactor, your role is to deliver the information your business partners need to build products in the business. You will assist product teams in drawing insights from our data to build the next version of products. You are someone who wants to see the impact of their work and make a difference every day. You know what it takes to deliver quality reporting and business intelligence solutions to the organization for new products. Responsibilities:Work with a team of software engineers, QA engineers, and Product ManagersPerform data collection, preprocessing, feature engineering, data visualization and analysisBuild automation of data collection and preprocessingPassion to answer Product/Engineering questions with dataBuild models to address business problemsEngage with lines of business, users and analysts to explore and prototype opportunities and use-cases exploiting data and the application of cognitive and machine learning technologiesDesign, develop, test and support new data products being created in the fintech space with financial & operational dataQualifications: Ph.D. or M.S. in a quantitative field such as Computer Science, Statistics, or Mathematics 3+ yrs relevant experienceExperience in any of the following is highly desirable:Modern, object-oriented or functional programming experience, (Java, C++, Python, Scala, SQL, R)Data Science and Machine Learning Frameworks (“R”, Apache Spark / MLlib, TensorFlow, Scikit-learn, etc…)Natural Language Processing (NLTK, CoreNLP, Gensim, Spacy, etc..)Experience with Big-Data technologies and cloud (AWS, Redshift, Hive, MapReduce, etc.)Relational databases (Oracle, PostgreSQL, MySQL, etc.)Agile development methodologyBonus points:Worked in any Financial Tech IndustryPERKS:Come work at one of Austin’s Best Places to Work in 2017 - Amazing culture, dynamic office, and work alongside the best and brightest in the industryCompetitive salary based on experienceHealth, dental, and vision benefits packageUnlimited vacation, flexible hours & optional work offsite daysStock optionsUnlimited cold brewsDog and cat friendly offices located in hip East AustinJOIN US! If this role describes you, we look forward to receiving your complete application online! Your resume highlighting skills and credentials required for this position"}