{"jobID": "2836416079", "jobLocation": "Washington_DC", "jobTitle": "American University Student Services Advisor", "companyRating": null, "companyInfo": {"Website": "www.shorelight.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us The International Accelerator Program (IAP) is a partnership between American University (AU) and Shorelight Education. In support of the university's strategic plan goal of bringing the world to AU and AU to the world, the mission of the program is to immerse first-year international students (graduate and undergraduate) in the academic and cultural life of the university, help them integrate into campus life, and provide the support that increases their academic successes and likelihood of obtaining their degrees at AU. Job Overview Student Services Advisors (SSAs) help develop and support student service programs for international students. Reporting to Student Services Director, SSAs are responsible for collaborating with the SSD to support students’ academic engagement, social integration, and cross- cultural development in their new academic and social environment.  The Student Service Advisor is an energetic team player who can successfully execute support services catered to international students. The primary responsibility of the SSA is to deliver high-quality cocurricular and extracurricular support experiences for program students, as well as hands-on academic support, guidance, and mentoring. The SSA has excellent customer service skills, and the ability to focus his/her attention on individual students as they are guided through the program. The SSA also possesses the interpersonal and intercultural skills necessary to work closely with students, parents, program staff, and university administration. Essential FunctionsStudent ServiceGuide, prepare and motivate students to a successful undergraduate or graduate experience and degree completionDeliver exceptional student services, beginning with pre-arrival processes, airport transfers, orientation programming, on-going student services support, and student acculturation into the universityContribute to the design and delivery of services that provide a strong foundation for the student's academic successProvide mentorship, training, and coaching to support student skill development in areas including but not limited to goal setting, strategic planning, cultural competency, problem solving, and interpersonal relationshipsAssist in the development, promotion, and implementation of programs to support student retention and socialization/acculturation; assist in the design and implementation of orientation programmingTeach or coach first year transitional programming as assignedRelationship ManagementSupport key relationships at the university and at the partnership, including Academic teams, International Student Services, Campus Housing, Dining Services, Student Development & Enrollment Services, Office of Student Involvement, Office of the Registrar, and various other departmentsTechnologyMaintain accurate records and reporting for assigned cohort of studentsContribute to student services operations to ensure that systems and procedures are followed and technology is used to streamline systems and procedures; as relevant, assist in the creation of new processesAssist with the coordination of student satisfaction surveys and associated analysis, with an eye towards improving the student experienceMinimum QualificationsMaster’s degreeAbility to thrive in a fast-paced environment, take initiative, and maintain a high energy levelDemonstrated flexibility and interpersonal communication skillsProblem-solving, decision-making, and creative-thinking abilitiesExcellent organizational skills and strong attention to detailProven customer service skillsAbility to work evening and weekend hours as neededEligibility to work in and travel freely to and from the United States without sponsorshipPreferred QualificationsExperience in higher education advising, student services, or hospitalityExperience working with international students or customers in an administrative or academic capacity desiredExperience planning and organizing eventsExperience working successfully with non-native English speakersKnowledge of Spanish, Mandarin, Arabic or Hindi is preferredApplication Process To apply for this position, please visit the Shorelight Careers page to submit an application with a resume and cover letter.  The International Accelerator Program at American University is an Equal Opportunity Employer"}