{"jobID": "2803665714", "jobLocation": "Moorestown_NJ", "jobTitle": "Data Scientist", "companyRating": "4.7", "companyInfo": {"Website": "www.tabularasahealthcare.com", "Headquarters": "Moorestown, NJ", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "Tabula Rasa Health Care? TRHC is a family of companies that leverages technology to improve healthcare. TRHC works with providers and insurers to identify multi-drug interactions and to reduce risk of medication-related problems. We have developed the first multi-drug interaction tool that identifies risk across a variety of safety factors and presents meaningful opportunities to mitigate that risk. This technology can be used to assess safety at the individual patient-level or to stratify medication risk at the population-level, and can be embedded within any EMR or other healthcare IT system.Tabula Rasa Health Care is looking for a Data Scientist to work with business stakeholders, IT, analysts and application developers to advance in-house data-science capabilities and develop solutions to business challenges. The Data Scientist will be responsible for using analytical, statistical, and programming skills to collect, analyze, and interpret data sets. This position requires that the Data Scientist have substantial expertise over a wide range of technical competencies including search, machine learning, programming, databases, reporting technologies and statistics, and can develop creative workable solutions for a wide range of internal customers.Primary Functions:Design and implementation of self-service analytics toolsInitiating data enrichment efforts including the supplementation of company data with third party sources when neededGuiding data collection procedures as needed to support the required analytic systemsContributing to the processing, cleansing, and verification of the integrity of data used for analysisPerform ad-hoc analysis and presentation of resultsCreating automated anomaly detection systems and constant tracking of its performanceWorking with key stakeholders to ensure integrity and proper integration for all sources of enterprise dataData mining using state-of-the-art methodsSelecting features, building and optimizing classifiers using machine learning techniquesDevelop algorithms to support and drive discovery of clinical conditions and metrics based on healthcare claims dataQualifications:Education, Experience & Training:Bachelor?s degree in Computer Science, Bioinformatics or related field10+ years? working in OLAP including experience in ?big-data? environments using columnar data stores and Hadoop.Prior experience designing and deploying self-service healthcare analytics environments across business, clinical, financial and research stakeholdersExperience with healthcare data analytics including Medicare/Medicaid Claims analysis, working with healthcare stakeholders, and familiarity with healthcare coding standards including both ICD10 and SNOMED CT.Experience in validated system environmentsSpecific Skills: Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.Experience with common data science toolkits, such as Jupyter, R, Weka, NumPy, etcExcellent communication skills, both written and verbalExperience with data visualisation tools, such as D3.js, Tableau, ggplot, etc.Exceptional database skills (both relational and noSQL)Excellent scripting and programming skillsGood understanding of statistics including distributions, statistical testing, regression, etc.Competencies:Overall competency in business and technologyExcited & motivated to work with large datasets covering many members over multiple yearsSense of urgency to attend to IT leadership demandsResponsive and prompt communicationCustomer-service orientedExcellent time managementExcellent verbal and written communication skillsSelf-motivated, team player, highly organizedAttention to detail and accuracy of facts and documentationAbility to manage multiple priorities and work independentlyAbility to problem-solve and ability to follow through on tasks"}