{"jobID": "2711681633", "jobLocation": "Troy_MI", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.delphi.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 2017", "Type": " Company - Public (DLPH) ", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Tesla, General Motors, Ford Motor Company"}, "estimatedSalary": null, "jobDescription": " Title Data Scientist EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law. DescriptionMake a Delphi Technologies Difference on your first day.  At Delphi Technologies, we are dreamers who do. Our ideas inspire change. Our actions produce change. We collaborate, innovate, and execute with excellence, working hard to deliver a better drive today. And a better future, tomorrow.  At Delphi Technologies we’re about the art of the possible. We make it possible to solve our customers’ toughest challenges. And now we are taking bold steps to do even more. We recently announced that Delphi will spin-off its Powertrain segment, which includes our Aftermarket business, into an independent company by March 2018. Delphi Technologies will be a Top 50 - Tier 1 automotive supplier with $4.5B in annual revenue, over 20K employees, with operations in 17 countries and doing business with customers in over 150 countries. Powertrain provides integration of full end-to-end gasoline and diesel engine management systems including fuel handling, fuel injection, combustion, electronic controls, test and validation capabilities, electric and hybrid electric vehicle power electronics, aftermarket and original equipment services. Powertrain designs solutions to optimize powertrain power and performance, while helping customers meet new emissions and fuel economy regulations.  As a standalone company, we will be better positioned for continued growth, with the ability to develop more focused and distinct business models, and with more flexibility to pursue their different strategic plans to capitalize on industry trends.  Join the Delphi Technology team as we embark on this exciting transition and become an independent company with a passionate focus on innovative technologies and a commitment to make green possible.  Currently we are hiring aData Scientistat our Troy, MI location. Responsibilities:Generate meaningful insights by mining and analyzing data from a variety of sourcesCommunicate insights to leadership in a clear mannerArchitype and implement processes for data standards, data storage and report generation in a sustainable wayDevelop and prioritize standardized reports and dashboards using Salesforce Einstein, Excel and AccessEnsure data and report accuracy through creation of validation protocols and process documentationComplete ad-hoc analysis and present results as requested Position RequirementsBasic Requirements:Bachelor's degree: Mathematics, Statistics, Business, Marketing, Computer Science or Economics5 plus years of experience in MS Excel3 plus years of work experience identifying and articulating insights and trends across multiple data setsPreferred Qualifications:Able to multitask, prioritize and manage time effectively1 plus years Salesforce Einstein or Analytics Studio1 plus years of experience with Access, SAP and statistical modelingCommunicate insights to leadership in a clear mannerDelphi Technologies Rewards and Advantages:Competitive compensation with bonus potentialCompetitive health benefits401K with matching contributionLearning and development opportunitiesDiscount programs with various manufacturers and retailersRecognition for Innovation and ExcellenceOpportunities to give back to the communityMeaningful work that makes a difference in the worldDynamic, global career experiencesWork alongside the best and brightest in the IndustryRelocation assistance (if applicable)  Candidates for positions with Delphi must be legally authorized to work in the United States on a permanent basis. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.  RSR Location Troy Offices & Customer Center Req Number BUS-18-00004 About the Organization Delphi Technologies is a technology company whose people focus on solving emissions and fuel economy challenges for the world's leading automotive original equipment manufacturers and provides leading aftermarket service solutions. Headquartered in London, U.K., Delphi Technologies operates technical centers, manufacturing sites and customer support services in 24 countries. Visit delphi.com.This position is currently accepting applications.Apply Now"}