{"jobID": "2728738304", "jobLocation": "San_Francisco_CA", "jobTitle": "Sales Development Representative (SDR)", "companyRating": null, "companyInfo": {"Website": "www.appdirect.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About the TeamThe Sales Development team is a critical component to our growth and culture at AppDirect. Every member of the team embodies our core values, especially intensity and ownership. We drive tremendous value as a global team by building awareness of AppDirect, driving adoption of our platform and contributing revenue to our company growth.About YouAppDirect is rapidly expanding and looking to bring on a passionate and driven Sales Development Representative in San Francisco. As a member of the team, you will be at the forefront of critical new relationships with cloud service provider partners around the world. You will expand our business, nurture partnerships and work closely with our sales, marketing, and product teams. We love entrepreneurial spirit and those who bring experience from established organizations. You are highly communicative, a lover of new technology with a passion for discovering new opportunities.What you'll do and how you'll make an impact:Generate new business opportunities from a targeted list of potential AppDirect partnersResearch accounts, identify key players, generate interest and develop accounts to drive opportunityRespond to inbound interest and qualify fit for the AppDirect platform through discovery callsWork with Product and Marketing teams to convey feedback on prospect requirements and drive product strategyManage, track, and report on all activities and results using SalesforceStay up-to-date on industry trends and competitionWhat you'll need:University degree requiredAbility to work in a high-energy sales team environment; team playerProfessional phone presentation, excellent listening skills, and strong writing skillsPassion for learning and working with the latest technologies and industry trendsProficient in using Salesforce, LinkedIn, and other leading sales automation toolsExperience with our ecosystem of ISV partners1-2 years of experience exceeding quota in Sales Development, Lead Generation, Sales, and/or Marketing at a SaaS or Cloud companyExperience with Service Provider and cloud organizationsAbout AppDirect:AppDirect is the only end-to-end commerce platform for selling, distributing, and managing cloud-based products and services to succeed in the digital economy. The AppDirect ecosystem connects channels, developers, and customers through its platform to simplify the digital supply chain by enabling the onboarding and sale of products with third-party services, for any channel, on any device, with support. Powering millions of cloud subscriptions worldwide, AppDirect helps organizations, including Jaguar Land Rover, Comcast, ADP, and Deutsche Telekom connect their customers to the solutions they need to reach their full potential in the digital economy. We believe that the unique contributions of all AppDirectors is the driver of our success. To make sure our culture continues to incorporate everyone's perspectives and experience, we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. #LI-LW1"}