{"jobID": "2778125754", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.cibc.com/us", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (PVTB) ", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " OverviewCIBC provides tailored commercial, wealth management, personal, and small business financial solutions in the United States through 46 offices in 18 states, as well as cross-border banking services to clients with North American operations. Learn more at cibc.com/US.  CIBC is a Toronto-based, global financial institution with a 150 year history, serving 11 million personal and business clients. We invest in our businesses, our clients, our people and our communities to deliver consistent and sustainable earnings to our shareholders.  CIBC delivers access to career and development opportunities, safe and healthy workplaces, effective training, and positive work-life balance – so that employees are able to perform at their best, contribute to their communities and focus on cultivating deeper relationships with our clients.  Every year, CIBC is recognized for its business success, community commitment and employee initiatives. We are proud of this success and are committed to creating an inclusive workplace and an environment where all employees can excel.  CIBC Bank USA is an Equal Opportunity Employer M/F/Disability/VeteranResponsibilitiesMotivated Data Analyst comfortable working with colleagues throughout all areas of a dynamic and rapidly growing financial institution. Analyst will be responsible for building and maintaining a positive client experience by interacting with the Bank's Business Partners to understand requests, business problems, and provide solutions. Manage the Bank's Client Profitability Model and associated data sources including modifications to meet regulatory needs and provide support to business users. Lead impact analysis of requests across all systems to ensure data quality and adherence to enterprise data policy. Skills programming in SQL and VBA desired as is the ability to work effectively across all functional areas including Technology Services, Product partners and Risk Management. Necessary skills and experience include strong analytical and problem solving with the ability to effectively resolve moderately complex situations and issues.QualificationsLooking for approximately 5-7 years experience in related field."}