{"jobID": "2836949805", "jobLocation": "Santa_Clara_CA", "jobTitle": "Apple Music - Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Apple Music - Data Scientist Job Number: 113358318Santa Clara Valley, California, United StatesPosted: May. 15, 2018Weekly Hours: 40.00 Job SummaryApple is seeking a confirmed Data Scientist to join the Apple Media Analytics and Data Products team. This team seeks to promote productivity and innovation through diverse hiring.  In this role, your objective is to drive growth and engagement by analyzing the product and content experience. You’ll work closely with our partners and leadership team to understand analytics needs, independently tackle problems, and communicate insights.Key Qualifications Well-versed in SQL languages andWell- versed in exploratory data analysisUnderstanding of machine learning techniques and algorithms: k-NN, Naive Bayes, SVM, Clustering, Regression (OLS, Logistic, MNL), Decision Forests, Linear and Nonlinear Optimization Proficiency in Hadoop ecosystem (HDFS, Hive, Spark, Map Reduce)Familiarity with at least one development language (Python, Scala, Java, C#)Ability to translate key findings from code into a visual presentation that is clear, concise, and actionable for a variety of audiencesLeadership skills to influence and work across product and marketing teams as a partnerAbility to work on a complementary team or with a diverse range of peopleAbility to initiate and deliver a project independentlyUnderstanding of media domain, content, and/or subscription business model is useful Description- Develop & deliver analysis to understand drivers of customer retention and test business hypotheses - Partner closely with product, content, and design teams to analyze user experience Evaluate newly launched features and marketing channels to determine growth impact Provide insights and data to product, engineering, editorial and marketing teams to refine and evaluate their goals, strategy, and roadmap  Help grow emerging products with a daring trajectory in the visionary streaming media landscape. Demonstrate your analytics domain expertise for partners throughout the organization, guiding decisions on customer experience, and strategic opportunities. You love building narratives backed by data and demonstrate a strong dream to continually improve the customer experience.  This is a full-time position in Apple Media Products and is located in our Cupertino, CA office.EducationIdeally, Masters or PhD in Computer Science, Statistics, Data Science, Data Engineering, Machine Learning, Mathematics, or relevant field."}