{"jobID": "2805459215", "jobLocation": "Palo_Alto_CA", "jobTitle": "Business Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.pinkerton.com", "Headquarters": "Ann Arbor, MI", "Size": "1001 to 5000 employees", "Founded": " 1850", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "JOB SUMMARY: The Business Data Analyst will support the intel team manager to ensure that the full life cycle of various business aspects are reinforced efficiently. The Analyst will provide leadership and support mainly focused on the management of data and information centered on the teams work products.  The Analyst is responsible for the process of inspecting, cleaning, validating, transforming and modeling data with the goal of discovering useful information, suggesting conclusions and supporting decision making focused on growth and attainment of goals. Essential Functions:The functions listed describe the business purpose of this job. Specific duties or tasks may vary and be documented separately. The employee might not be required to perform all functions listed. Additional duties may be assigned, and functions may be modified, according to business necessity.All assigned duties or tasks are deemed to be part of the essential functions, unless such duties or tasks are unrelated to the functions listed, in which case they are deemed to be other (non-essential) functions.Employees are held accountable for successful job performance. Job performance standards may be documented separately, and may include functions, objectives, duties or tasks not specifically listed herein.In performing functions, duties or tasks, employees are required to know and follow safe work practices, and to be aware of company policies and procedures related to job safety, including safety rules and regulations. Employees are required to notify superiors upon becoming aware of unsafe working conditions.All functions, duties or tasks are to be carried out in an honest, ethical and professional manner, and to be performed in conformance with applicable company policies and procedures. In the event of uncertainty or lack of knowledge of company policies and procedures, employees are required to request clarification or explanations from superiors or authorized company representatives.The Essential Functions Include:Represent Pinkerton’s core values of integrity, vigilance, and excellence.Support team manager in overall database case management process, procedures and requirements.Lead and support data driven projects including; Data entry.Database case management audits.Data and gap analysis.Database query configuration.Conduct User Acceptance Testing (UAT).Provide business data analysis and identify technical solutions to challenges that impact the business.Handle approved requests for data audits, metrics and report generation.Manage and oversee BI Dashboard activities, projects, requests and tasks.Draft data queries, reports and metrics and obtain approvals prior to publishing.Provide support to the manager in implementing data driven projects by performing project proposal reviews.Conduct business data analysis, gather data requirements, draft project plan and obtain approvals.Utilize, update and manage project tool to represent the current status of projects.Conduct project coordination, implementation, and supervision as well as provide project status updates and communications to the manager.All other duties, as assigned.Minimum Hiring Standards: Additional qualifications may be specified and receive preference, depending upon the nature of the position. Must have a High School Diploma or GED.Must be willing to participate in the Company’s pre-employment screening process including drug testing and background investigation.Must be at least 18 years of age.Must have a reliable means of communication (i.e., email, cell phone).Must have a reliable means of transportation (public or private).Must have the legal right to work in the United States.Must have the ability to speak, read, and write English.Education/Experience: Bachelor’s degree with three to five years of related experience or an equivalent combination of education and experience sufficient to perform the essential functions of the job, as determined by the company. Competencies (As Demonstrated Through Experience, Training, and/or Testing): Strong analytical and problem-solving skills.Able to carry out responsibilities with little or no supervision.Attentive to details and accuracy.Able to work in a fast paced environment under multiple deadlines and competing priorities.Strong written and verbal communication skills.Able to analyze complex situations and recommend solutions.Serve as an effective team member.Strong customer service and results orientation.Computer skills; Microsoft Office.Working Conditions (Physical/Mental Demands): With or without reasonable accommodation, requires the physical and mental capacity to perform effectively all essential functions. In addition to other demands, the demands of the job include: Must undergo and meet company standards for background and reference checks, drug testing, and behavioral selection survey.Maintain composure in dealing with authorities, executives, clients, staff, and the public occasionally under conditions of urgency and in pressure situations.Exposure to sensitive and confidential information.Regular computer usage.Ability to handle multiple tasks concurrently.Must be able to see, hear, speak, and write clearly in order to communicate with employees and/or customers.Manual dexterity required for occasional reaching and lifting of small objects and operating office equipment.Close and distance vision and ability to adjust focus.Evenings and weekends, as required, to ensure the successful completion of work assignments.Travel, as required. EOE/M/F/Vet/Disabilities"}