{"jobID": "2786770803", "jobLocation": "Dallas_TX", "jobTitle": "Data Integrity Analyst II - Supply Chain", "companyRating": "3.5", "companyInfo": {"Website": "www.bswhealth.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Texas Health Resources, Seton Healthcare Family, UT Southwestern Medical Center"}, "estimatedSalary": "54000", "jobDescription": " The Supply Chain Management (SCM) Data Integrity Analyst II creates and maintains a clean, accurate, and standardized item master to support timely and efficient supply chain operations. This position requires a level of experience and expertise with relational data management, data mining, and routine Item Master audit to ensure that master data is accurate and synchronized with strategic solution providers, trading partners and providers of third party enrichment data. With general direction and latitude for initiative and judgement, SCM Data Analyst II will be responsible for the daily analysis of price files, price file uploads to ERP system, item adds, and item conversions.  WHAT IS EXPECTED (ESSENTIAL FUNCTIONS) Manages the analysis for Price File and the upload to the ERP system. Provide research and analysis to all aspects of data elements. Identify patterns of incomplete or incorrect data and identifying solutions for acquiring good data. Manages any new Item Adds and Item Conversions to ERP system Audits Lawson Item Master Data for accuracy and initiates appropriate corrections and changes. Selects, recommend and applies appropriate analytic and statistical methodologies and techniques to execute against an analysis plan or research objectives Responsible for providing regular data recommendations to stakeholders and identifying areas of improvement. Coordinate communication and appropriate actions with GPO, Distributors, and Vendors to ensure contracts are synchronized and no variances exist between Lawson and Supplier Systems. Train others team members to serve as backup to process Price Files, Item Adds, and Item Conversions Handle escalated issues from the Data Integrity Analyst I Assist with Item Master Cleanup and Maintenance Assist with correcting purchase order exceptions such as price, part number, and unit of measure Assist with vendor consolidation process The information contained in this job description is intended to describe the essential job functions required of those assigned to this job. It is not intended to be an exhaustive list of all responsibilities, duties, knowledge, skills, and abilities needed to perform the job. Please note that management retains the right to assign or reassign duties and responsibilities to this job at any time. The ability to competently perform all the essential duties of the position, with or without reasonable accommodation, demonstrated commitment to effective customer service delivery, integrity, and the ability to work productively as a member of a team or work group are basic requirements of all positions at Baylor Scott & White Health  KNOWLEDGE, SKILLS AND ABILITIES Super user ability with Lawson ERP System and Lawson Add-ins Expert-level skills with Microsoft Excel and Microsoft Access Database (ODBC) Strong data analysis skills Working knowledge of Healthcare Supply Chain processes Ability to quickly learn new software and applications  Location: Baylor Scott and White Health - Bryan Tower Bldg. 27th Floor, Dallas, TX.  Department: Supply Chain - Data Integrity  Hours: Monday thru Friday from 8:00 AM to 5:00 PM.  * Benefits - Our competitive benefits package includes*:  * Immediate eligibility for health and welfare benefits and time off  * 401(k) savings plan with dollar-for-dollar employer match  * 457(f) savings plan with employer contribution  * CME reimbursement and paid time off  * Excellent Relocation Assistance packages  *Note: Benefits may vary based upon position type and/or level. #LI-CSS Baylor Scott & White Health (BSWH) is the largest not-for-profit health care system in Texas and one of the largest in the United States. With a commitment to and a track record of innovation, collaboration, integrity and compassion for the patient, BSWH stands to be one of the nation's exemplary health care organizations. Our mission is to serve all people by providing personalized health and wellness through exemplary care, education and research as a Christian ministry of healing. Joining our team is not just accepting a job, it's accepting a calling! QualificationsMINIMUM REQUIREMENTS ADDENDUM Experience Equivalencies:  Minimum Education: Bachelors degree or equivalent experience  Minimum Experience: 3 years of experience.  MINIMUM REQUIREMENTS ADDENDUM Experience Equivalencies: Bachelors degree and 3 years of experience Associates degree and 5 years of experience High School Diploma/GED and 7 years of experience.  SKILLS REQUIREMENTS ADDENDUM: Experience  Advanced Skills in Access and Excel - Candidates will be tested."}