{"jobID": "2766131528", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist – Cardiovascular Disease\\/In Vivo Biology", "companyRating": null, "companyInfo": {"Website": "www.novartis.com", "Headquarters": "Basel, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (NVS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Posting Title Scientist – Cardiovascular Disease/In Vivo Biology  08-May-2018 Job ID240852BRJob Description A global healthcare leader, Novartis has one of the most exciting product pipelines in the industry today. A pipeline of innovative medicines brought to life by diverse, talented, performance driven people. All of which makes us one of the most rewarding employers in our field. Under the umbrella of the Novartis Institutes for Biomedical Research (NIBR), the Genomics Institute of the Novartis Research Foundation (GNF) located in San Diego, California, has the support of a broad collaboration with the entire Novartis research organization, while maintaining the independence to initiate and drive independent research programs.  We are seeking a highly-motivated and results-driven cardiac in vivo scientist to join the Drug Discovery Biology Group at the Genomics Institute of the Novartis Research Foundation (GNF). The ideal candidate will possess extensive in vivo experience, with a preferred focus on rodent cardiovascular disease surgical models, including myocardial infarction and heart failure. Primary responsibilities will include the design, execution and support of in vivo studies for driving the progress of active drug discovery projects, new target validation and indication evaluation. In this regard, the successful candidate will be expected to possess familiarity and technical expertise in areas such as: Rodent cardiac surgery and disease models (e.g. I/R & LAD occlusion, TAC, HFpEF)Echocardiography, data capture and analysisWhole-animal pharmacology, survival bleeding and dosing methodologiesTissue-based assays, e.g. histology, IHC, microscopyAdditional experience with in vitro cell culture and standard molecular/cell bio techniques is a plus The technical capability to conduct and lead cardiac in vivo studies is essential to this position, requiring detailed knowledge of animal physiology and an ability to excel in a fast-paced, goal-oriented environment. The candidate is expected to work both independently and collaboratively, as an integral member of the Heart Failure Team. Ideal applicants will possess excellent communication and organizational skills, critical problem-solving abilities and a commitment to excellence. Minimum requirementsBS/MS in a life sciences discipline2-3 years of work experience in an industrial or academic settingExcellent communication, organization, planning and record keepingBackground in cardiac physiology and disease models preferredExperience with writing and maintaining IACUC protocols desirableJob Type Full Time CountryUSAWork Location San Diego, CA Functional Area Research & Development DivisionNIBRBusiness UnitGNFEmployment Type Regular Company/Legal Entity Novartis Inst for Fun Gen inc EEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. "}