{"jobID": "2781611623", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Data Engineer, Salesforce Marketing Cloud", "companyRating": "3.3", "companyInfo": {"Website": "www.roku.com", "Headquarters": "Los Gatos, CA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Public (ROKU) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "185000", "jobDescription": "Senior Data Engineer, Salesforce Marketing Cloud Do you enjoy working with savvy, experienced engineering and marketing teams who love leveraging data in new and interesting ways? Does the phrase Big Data excite you? If you find yourself doing the same thing three times, is your immediate thought I need to automate this.? If so, read on and get in touch with us; youre our kind of person!  Our Marketing Data Team provides a bridge between Rokus Big Data and marketing platforms, which are used to engage our users regularly. These systems handle batch and real-time data processing over 10s of terabytes of data ingested every day with a petabyte-sized (and growing) data warehouse.  What you will do:Build data structures to support multi-channel campaign reporting between email, on device ads, mobile app, and future customer touch pointsParticipate in architecture discussions, influence roadmap, and take ownership and responsibility over new projectsMaintain and support existing platforms and evolve to newer technology stacks and architecturesImport target lists from Roku (DMP and custom queries from Rokus big data platform, or BDP) into Salesforce Marketing Cloud.Build email campaigns using those targets using batch and automated send rulesBuild and monitor data flows for email engagement data passing back to Roku BDPSupport reporting needs to drive insights about email campaigns, programs, and audiencesCollaborate with cross-functional teams of marketers, developers, data scientists, QA and operations to execute deliverables.What you've done and what you bring:Experience working with data structures and systems to support marketing programs.Strong Experience with SQLAn enjoyment of using Python or bash to solve problemsA passion for improving best practices in developmentBe self-driven, take complete ownership of initiatives and make pragmatic technical decisions3+ years professional experience as a data or software engineerBS in a technical discipline; Computer Science preferredNice-to-haves include experience with any/all of these tools and technologies:Salesforce Marketing Cloud or Exact TargetAirflow #LI-PP1"}