{"jobID": "2689002304", "jobLocation": "Washington_DC", "jobTitle": "IT Analyst Infrastructure, Application, Data, Coding", "companyRating": "2.1", "companyInfo": {"Website": "www.engenderhealth.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 1943", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "EngenderHealth’s vision is a world where sexual and reproductive health rights are respected as human rights, and women and girls have the freedom to reach their full potential. To achieve transformational change leading to true social and economic progress, EngenderHealth partners with diverse organizations across sectors with the shared goals of highlighting women’s value to sustainable development. JOB SUMMARY: The Technology Analyst provides application development recommendations, provides advanced support for standard software, and manages EngenderHealth’s application infrastructure, data applications, custom scripts, and coding/application development functions under the supervision of Director of Technology.  Location: Washington, DC 20004  This is a senior advisor level union position under EngenderHealth’s collective bargaining agreement with the Office and Professional Employees International Union (OPEIU) Local 153, AFL-CIO and subject to union dues.​ REQUIREMENTS:Must possess the following requirements with or without a reasonable accommodation.Bachelor’s degree in technology or related field.Four (4) years of experience in an application development/support position.Fluency in English, which includes the use of accurate grammar.Technology Requirements:Five (5) years of experience: Supporting, maintaining, and administering Virtualization Infrastructure (VMWare preferred); andConfiguring, deploying, maintaining and administering hardware: desktop and laptop system configuration, network (infrastructure, servers, switches, wireless access points, routers, firewalls, VPN), and troubleshooting.Three (3) years of experience with Exchange Enterprise Administration and troubleshooting techniques.Microsoft Office Word skills to develop a formatted document for technical and end-user documentation.Microsoft Office Excel skills for recording data, analytics, and data import/export.Experience in supporting desktop network systems and teaching technical information to non-technical individuals.Windows 7 and 10 operating systems with the ability to create system images, patches, and perform system updates.Worked with cloud-based systems, including Microsoft Azure, Office 365, software as a service, communications, and Virtual Private Network (VPN) access. ESSENTIAL SOFT SKILLS: Interpersonal skills to build credible relationships quickly.Ability to work as an effective team member and collaboratively with other team members.Ability to work on projects with moderate supervision to prioritize tasks, follow and meet established timelines, and follow budget constraints. PREFERRED SKILLS, ABILITIES, AND FUNCTIONS: Fluency in French.Experience supporting site offices internationally.Experience troubleshooting web-based access and Citrix/VPN in outlying rural country areas.Supported human resource applications, such as applicant tracking system (ATS), payroll, timekeeping, and/or HR information system (HRIS). Disclaimer  The above statements describe the general nature and level of work being performed by the person(s) assigned to this job. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities as needed and assigned.  EngenderHealth provides equal employment opportunities (EEO) to all employees and applicants for employment, without regard to race, creed, ancestry, citizenship, religion, color, gender, gender identity, gender expression, age, national origin, political belief, sexual orientation, genetic information, status as a victim of domestic violence, marital status, disability or any other protected characteristic or status under applicable federal, state and local laws.  EngenderHealth complies with applicable federal, state and local laws governing non-discrimination in employment in every location in the United States in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training."}