{"jobID": "2724001021", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Financial Analyst (Revenue Forecasting / Data Science)", "companyRating": "4.0", "companyInfo": {"Website": "www.twitter.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Public (TWTR) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Facebook, Google, Pinterest"}, "estimatedSalary": "128000", "jobDescription": " Senior Financial Analyst (Revenue Forecasting / Data Science) San Francisco, CAWhoWeAre:Sales Finance provides insight into Twitter’s business using financial models built on positive relationships. We engage directly with both senior management and front-line sales to understand the drivers of Twitter’s revenue, and how to optimize that revenue. The person in this role will work closely with our data science teams to develop, interpret and explain statistical models of Twitter’s advertising revenueWhatYou’llDo:Use predictive modeling and analytics to forecast Twitter’s revenue, identify growth opportunities, influence business partners, and drive effective decision-makingDevelop strong collaborative relationships with key partners in Sales, Finance and across the company, with a specific focus on our Data Science and Forecasting teamsPartner with Product, Engineering and Operations teams to help resolve broader business problems, build revenue growth plans, establish financial and operating targets and determine optimal resource requirementsDesign, develop & deliver robust and scalable reportingSimplify complex problems & huge data sets, to extract non-obvious insightsBe part of a great team, but capable of operating independently - maintaining relationships, deliverables and expectations with your business partnersBe personable, compassionate and able to connect with each and every person on the team and throughout the businessCraft and deliver impactful presentations that tell a story passionate about insights, not just dataRemain detail-oriented while working across a broad range of projectsWhoYouAre:An expert in financial modeling and quantitative analysis, who enjoys solving complex and unstructured problemsA deep understanding of statistics and predictive modeling, and experience using these techniques in a demanding environmentProven ability to work collaboratively across different functions and effectively influence senior business partnersExperience with advertising market (especially digital) a strong plusRequirements:Bachelor's degree with strong academic recordAt least 4-7 years of work experienceSuperior financial modeling skillsExperience with SQL and a statistical programming package is required. We use R, but are willing to train candidates with experience in other languages (eg Python)Possess a demonstrable grasp of Twitter and our business model We are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, ethnicity, color, ancestry, national origin, religion, sex, sexual orientation, gender identity, age, disability, veteran, genetic information, marital status or any other legally protected status.SanFranciscoapplicants:Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}