{"jobID": "2824631141", "jobLocation": "Montvale_NJ", "jobTitle": "R&D; Associate / Product Development Scientist Dettol", "companyRating": "3.3", "companyInfo": {"Website": "www.rb.com", "Headquarters": "Slough, United Kingdom", "Size": "10000+ employees", "Founded": " 1823", "Type": " Company - Public (RB) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": ". A fantastic opportunity is available for an R&D; Associate / Product Development Scientist Dettol to join our Research&Development; team.  The R&D; Associate / Product Development Scientist will work with technical product development on key projects for the Dettol Surface Care - Laundry Category R&D; team.  Key Responsibilities Formulate and develop new products and technologies based on relevant consumer insights in support of brand initiatives.Lead key projects through the product development process as R&D; representative.Work cross-functionally and be R&D; lead on project teams to achieve key milestones and objectives.Collaborate with Marketing to develop, prioritize and execute project portfolio.Lead and advance multiple projects through front-end product development.Foster strategic growth in innovation processes and systems across team and organization.Develop technical product strategies to support product development and short-term and long-term innovation.Foster personal development growth with continuous coaching and feedback on career development as per the Corporate Core Values.Deliver projects to launch on time, budget and to the appropriate performance standards, quality and cost.Responsible to ensure all required technical work is performed on time and according to the required standards, performing the required lab work and providing guidance to assistants /technicians if applicable.Builds detailed technical knowledge of respective areas of the product portfolio/ technologies and leverage this within day-to-day activities.Work with outside suppliers/teams to help deliver pipeline needs.Supervise direct report with responsibility for ensuring their development. Is this You? BS/BA degree in a related science and 3-5 years' experience or MS degree in a related science and 3 years' experience.Experience and/or proven track record of successful delivery of technical projects in a FMCG company. Proven track record of results turning functioning prototypes into finished products. Experience with laundry is desired.Strong understanding of the product development process from concept ideation to launch.Proven Project Management skills including timely execution of multiple project objectives within established timelines, coordination of key stake holders, and timeline management.Strong formulation knowledge and understanding of chemical interactions.Understanding of Intellectual Property, Licensing, and Competitive Intelligence.Excellent planning and organizational skills essential.Strong interpersonal skills to nurture teamwork and foster an environment of achievement.Ability to display a degree of flexibility and adapt effectively to change.Excellent networking and communication skills.Proven people management and people development skills.Technical expertise and curiosity with the ability to develop technologies across categories. Ability to become the RB 'expert' in product implementation and launch areas as needed.Self -motivated with a bias for action, results, and ownership. Extremely focused to ensure that experimental programs meet objectives. The ability to overcome obstacles by seeking support from others to accomplish objectives and strong problem-solving skills.Good communicator coupled with excellent analytical and interpersonal skills, and ability to analyze data and solve complex technical issues.Interpersonal skills with the ability to influence and work in a team oriented environment, including cross-functional Project Teams involving R&D; functions and non-R&D; functions such as Marketing, Supply, Manufacturing.Ability to work independently within a multi-disciplinary project team.Proven track record of working successfully with outside suppliers.Understanding of regulated products under regulatory bodies (BPR).Proactive mindset fitting with RB Core Values and able to exhibit entrepreneurial attributes.Proficient with common software, including MSOffice. The position is based in Montvale, NJ  Why RB? Fast paced. Tired of having to jump through endless hoops to get things done? Not here. We move fast and deliver.Growth. Frustrated by the lack of growth opportunities in your current company? Not here! RB takes pride in the development and continued growth of our employees through steady rotations and promotions.Autonomy. RB empowers you to OWN what you do.Iconic Global Brands. http://bit.ly/RBNABrands Take a look. You'll be surprised at how many you already have in your home.Feel good about the company you work for! RB is committed to making the world a better place through betterbusiness. http://bit.ly/rbsustainabilityPassport Stamps. Does working Internationally interest you? Perform well and Global doors can open for you at RB.Work with smart people. We have a talented workforce that believes in sharing ideas to help each other, and the company succeed.Vacation. We offer 4 weeks' vacation, 9 core Holidays and 4 floating days.16 weeks paid Maternity leave.Competitive base salaries and bonuses.Tuition reimbursement. In Return RB offer very competitive salaries with excellent benefits and the chance to progress your career within a truly Global organisation.  Apply Now for a chance to really change the game!  RB is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}