{"jobID": "2764500538", "jobLocation": "Ne_Jersey", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.axelon.com", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "This position will be converted to FTEWill support the Business Management Office  Data Analyst (not senior)  Drive day to day internal processes  Will work closely with off shore teams  Managing and Reconciling data; Developing reportsLooking for a candidate with data analysis and manipulation with a business management background and experience with excel and powerpoint. Best fit candidates will have strong people / client relationship skills and be analytical in their approach.  Individuals in this role will be responsible for managing and maintaining data that drives the AD BMO processes on a monthly and quarterly basis, enabling consistent forecasting, actuals vs budget reportingThe role will require analytical capabilities to explain financial variances and develop modeling to support resource strategy and spending pattern changes in relation to established targets.  This role will require managing AD-wide services that benefit all domains and are foundational to the BMO function. These services include Long Range and Quarterly Forecasts, development of monthly metrics scorecards and reporting, FTE and Contractor requisition processing and monthly accrual validation. In order to be successful, the specialist must be capable of working in a highly collaborative environment, partnering with Finance, the OCIO and Business & IT Management. Maintain BMO resource management and financial metadataManage Quarterly Forecast processManage monthly accrual reconciliation with FinanceAssist OCIO in development of business cases supporting foundational Business or IT initiativesTraining and Expense Management"}