{"jobID": "2826785314", "jobLocation": "Dallas_TX", "jobTitle": "Data Support & Solutions Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Why this role? This individual will have responsibility for ensuring availability and correctness of underlying data for analytical reports on the performance of physicians, hospitals, and other health care providers, etc. Primarily, this will entail understanding and improving the flow of data through the Episode Connect Care management platform. In that capacity, this individual will have to marry business analytical, and technical expertise to ensure that the appropriate logic is built into EC, and subsequently understood by the analytical and technical staff who need to leverage it. Are you right for this job?Bachelors degreeMinimum of 1 year of experience working in a healthcare settingMust be knowledgeable and able to understand medical terminologyPassionate about healthcare and affecting change in the current healthcare environmentDemonstrates strong proficiency in computer software navigation; data entry and data cleansingExhibits fundamental knowledge of MS OfficeStrong verbal and written communication skills; able to communicate clearly and accurately within healthcare professionDemonstrated ability to work effectively as a member of an interdisciplinary team, displaying good judgment and decision-making skillsStrong problem solving skills; able to identify problems and escalate when appropriateExcellent organizational skills and ability to multi-taskAbility to thrive in a fast paced environmentOther duties as assigned or requestedWhat will you do?Proactively identify issues and opportunities regarding data methodologies within Remedys proprietary software platformAccountable for accurate tracking of program volume and metrics relevant to healthcare utilization and performance.Proactively identify data quality and integrity issues that affect the accuracy of reportingAdvise of, and oversee the implementation of new metrics to the reporting data warehouseTarget opportunities in position that will positively impact functional/business objectivesSupport Partner Services staff on day to day operational needsAnticipate and identify innovative processes to drive business excellenceOther duties as needed or assignedMakes decisions that promote the ethics and values of Remedy PartnersTo learn more about our company, mission and history: Please visit our website, www.remedypartners.comRemedy Partners is an equal opportunity employer and Remedy Partners considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability or any other basis prohibited by federal, state or local law. In addition, Remedy Partners provides reasonable accommodation to individuals with a disability in accordance with applicable laws."}