{"jobID": "2824716623", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Scientist for Precision Optics", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Provide technical leadership and problem solving capabilities to the Instrumentation group within the R&D; department at Rigaku Innovative Technologies Inc. in Auburn Hills, MI in the areas of optical substrate manufacturing. The main areas of responsibility are in high-precision CNC polishing of optical substrates and their surface metrology. Develop new fabrication processes for optical surface finishing.Develop new surface metrology processes.Operation and maintenance of surface-measuring interferometers, surface profilometers, and atomic force microscope (AFM). Develop and maintain operating procedures and calibration procedures. Maintain calibration records and quality documentation.Operation and maintenance of polishing equipment. Develop and maintain operating procedures.Develop training material and support training of employees for operation of polishing and metrology equipment.Interface metrology data with CNC polishing equipment including data processing with custom scripts or programs.Lead and manage continuous improvement in the field of CNC polishing and surface metrology.Lead and manage the effort to comply with quality control processes.Working with others in the R&D; department and manufacturing department.Strong knowledge of optical surface metrology methods and data analysis. Experience with operation of surface-measuring interferometers, surface profilometer. Experience with AFM desired.Knowledge and experience with computer programming related to metrology data processing. Capable of writing software routines to process data formats used by leading metrology instruments.Strong knowledge of manufacturing processes for optical substrates. Experience with substrate polishing.Knowledge of computer controlled deterministic surface figuring processes.Knowledge of inspection of optical parts for surface defects such as pits, scratches and chips, in accordance to MIL & ISO standards.Familiarity with Microsoft Office.Experience with CAD/CAM software is desired.Degree in optical science, physics or related field, either master degree or Ph.D.Good knowledge in physics and mathematics.Ability to manage and prioritize multiple projects.Goal oriented work habits.Fast learner and self-motivated.Strong communication skills.Enthusiastic, cooperative and positive behavior. Rigaku is an EEO/AA Employer Disabled/Veteran."}