{"jobID": "2741270093", "jobLocation": "Houston_TX", "jobTitle": "SAP Master Data Finance Process Analyst - Houston, Texas", "companyRating": null, "companyInfo": {"Website": "www.bhge.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (BHGE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Role Summary: About Us:Baker Hughes, a GE company (NYSE:BHGE) is the worlds first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain.BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company deploys minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own.With operations in over 120 countries, the companys global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com. Role Summary:Baker Hughes, a GE company is hiring a SAP Master Data Finance Process Analyst based in Houston, Texas.The SAP Master Data Finance Process Analyst takes a lead role in evaluating, maintaining and improving efficiency of internal financial reporting processes. Project manages the development and implementation of new procedures, policies, and systems to simplify and improve internal reporting. Simulates and tests improvements. Researches and analyzes best practices. In depth knowledge of the field's concepts, practices and procedures. Essential Responsibilities:Analyze current SAP Master Data GL settings and recommends improvementsResponsible for the quality of the SAP Master DataSAP Master Data enhancement requests SAP Master Data change managementMonthly Master Data testingMaster Data validation, master data quality, master data profiling activitiesInterface with SAP end users on business specific reporting needs and requests.Develop content and deliver SAP end user training. Handle special projects as assignedQualifications/Requirements:Bachelor's Degree in Accounting, Finance, or relevant discipline with 7+ years of experience in Finance Processes, Principles, and Practices or Master's Degree in Accounting, Finance, or relevant discipline with 5+ years of experience in a Finance Process, Principles, and Practices.Intermediate to advanced level experience with SAP modules (FI/CO Master Data Technical Settings)Intermediate to advanced skills in MS ExcelProject management and presentation experienceDesired Characteristics:SAP BW experience is highly desirableWorking knowledge of data integration principlesExperience with SAP Plant and/or Materials MastersKnowledge of Oil and Gas industry / Oilfield servicesIntermediate to advanced skills in MS AccessAbility to interact with all levels of managementExcellent communication skills (verbal/written) in EnglishStrong attention to detailAbility to collaborate, strong emphasis on teamwork, customer focused attitudeStrong analytical and leadership skillsLocations:Houston, TX Baker Hughes, a GE company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Learn moreLocations:  United States; Texas; HOUSTONGE will only employ those who are legally authorized to work in the United States for this opening."}