{"jobID": "2829284005", "jobLocation": "Santa_Clara_CA", "jobTitle": "Staff Scientist - Biocompatibility", "companyRating": null, "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.  Job Description SummaryProvide input and support for execution of biocompatibility strategy and testing for Abbott Vascular products in order to ensure compliance to ISO 10993 Responsibilities: + Provide input to the biocompatibility strategy to assure compliance to ISO 10993 standards for Abbott Vascular products.  + Evaluate and provide impact assessment on biocompatibility for developing product or for any material/process changes of existing product.  + Execute biocompatibility tests to ensure all products and processes comply with the regulatory standards.  + Liaison with external contract laboratories for conducting biocompatibility tests which include but not limited to planning, scheduling, test method verification, protocols/reports generation and completions.  + Provide assist for regulatory filing of biocompatibility of the product.  + Provide biocompatibility expertise during internal and external suppliers? audits.  + Ensure biocompatibility documentations are well organized and updated with most current regulations, standards, and industry practices.  + Provide assistance in preclinical research projects and willingness to learn to perform laboratory duties at the direction of management. Requirements: + Bachelor or Master Degree in any sub-field(s) of Biology with 9+ yrs industry experience (medical device industry preferred).  + Direct industry experience with ISO 10993, 21-CFR, PART 58 regulations  + **Experience with Biocompatibility AND ISO 10993 is REQUIRED to be considered for this position.**  + Demonstrated ability to draft protocol/report and perform statistical data analysis.  + Proven experimental laboratory skills  + Excellent communication skills  + Excellent computer skills  + Excellent digital file organization skills NO RELOCATION ASSISTANCE IS AVAILABLE FOR THIS POSITION.OPEN TO CONSIDER CANDIDATES AT A LOWER LEVEL. An Equal Opportunity Employer  Abbot welcomes and encourages diversity in our workforce.  We provide reasonable accommodation to qualified individuals with disabilities.  To request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}