{"jobID": "2747794420", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.elevateservices.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "138000", "jobDescription": "Help us shape the future. Elevate Services is changing the way legal support services are delivered and we are looking for creative, innovative people who can help. If you are a client-focused professional who wants your creative and innovative ideas to make a difference, Elevate's team of highly regarded legal service experts could be the right fit for you.  Elevate Services is hiring a Data Scientist for modeling complex dataset, discovering insights and identifying opportunities through the use of statistical, algorithmic, mining and visualization techniques in the legal industry. The position will be based in San Jose, CA. You Might be the Right Person if you…..Enjoy working in a fast-paced, entrepreneurial environment.Have five years of professional experience working as a Data Scientist.Have experience with command-line scripting, data structures and algorithms and ability to work in a Linux environment, processing large amounts of data in a cloud environment.Have a Master’s degree or PhD from an accredited college/university.Specifically, you will….Build AI/ML capabilities on all Cael products.Extract data from documents using natural language processing.Analyze and model structured/unstructured data using advanced statistical methods and implement algorithms and software needed to perform analyses.Auto-extraction of contract clauses for validation/review and prediction of risk based on contract terms.Auto-comparison of newly uploaded document versions, Auto-identification and recommendation of relevant/similar strings of text to verify based on initial selection.Predictive billing loss prevention and spend analysis.Auto construction of matter plans based on pattern recognition, Predictive matter and budget analysis.Cluster large amount of content and process data in large-scale environments using Amazon EC2, Storm, Hadoop and Spark.Perform machine learning, natural language, and statistical analysis methods, such as classification, collaborative filtering, association rules, sentiment analysis, topic modeling, time-series analysis, regression, statistical inference, and validation methods.Drive client engagements focused on Big Data and Advanced Business Analytics, in diverse domains such as product development, marketing research, optimization, and risk management; communicate results and educate others through reports and presentations.Perform explanatory data analyses, generate and test working hypotheses, prepare and analyze historical data and identify patterns.Skills for SuccessStrong knowledge in the following fields: machine learning, data visualization, statistical modeling, data mining, or information retrieval.Strong data extraction and processing, using MapReduce, Pig, and/or Hive preferred.Proficiency in analysis (e.g. R, SAS, Matlab) packages, programming languages (e.g. Java, Python, Ruby) as well as the ability to implement, maintain, and troubleshoot big data infrastructure, such as distributed processing paradigms, stream processing and databases such as Hadoop, Storm, SQL and Solr.Experience3 years of professional experience working as a Data Scientist.Experience with command-line scripting, data structures and algorithms and ability to work in a Linux environment, processing large amounts of data in a cloud environment.QualificationsMaster’s degree or PhD from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Bioinformatics, Physics, Operations Research, or related fields, with a minimum of two years of relevant experience (strong mathematical background with ability to understand algorithms and methods from a mathematical viewpoint and an intuitive viewpoint).Elevate is the law company. We provide consulting, technology and services to law departments and law firms. Our global team of lawyers, engineers, consultants and business experts improve efficiency, quality and outcomes for customers worldwide. Elevate’s achievements and distinctions include: Ranked on the Inc. 5000 list of Fastest-Growing Private Companies two years in a row.Ranked as a top Global Services Provider by Chambers & Partners three years in a row.Lead Partner of the FT Innovative Lawyers Awards. At Elevate we live our core values: We Deliver. We are careful about the commitments we make to our customers and each other. We do what we say we will.We Innovate. We celebrate creativity. We challenge the status quo and continuously ask ourselves, and each other how can we improve.We Care. We listen to our customers’ needs and help them solve their business problems. Our work is a positive influence on our personal lives and the lives of our families."}