{"jobID": "2804622852", "jobLocation": "Chicago_IL", "jobTitle": "Senior Business Intelligence Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.arrivelogistics.com", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Arrive Logistics is seeking a highly-motivated Business Intelligence Analyst to join our team. Our strong data-driven culture offers a unique opportunity for a BI Analyst looking to make an immediate impact across all functions and at all levels of the organization. As the fastest growing logistics brokerage in history, we are seeking someone who will thrive in a fast paced and evolving environment. In this role, you will: Develop an understanding of the logistics industry as well as Arrives core business functions and processes.Work closely with key business stakeholders to identify analytical and reporting needs and document requirements.Support business needs by leveraging analytical and reporting tools to gather, interpret and present data into an easy to understand format.Create and maintain dashboards, reports and reporting capabilities in an evolving production data environment.Support the design and development of new data and data structures to facilitate reporting and analytical capabilities.Quickly resolve discrepancies and bugs that result from data quality or data integrity issues when they arise.Respond to ad hoc requests for analysis and reports.Maintain awareness of emerging technology trends and conduct product evaluations.The ideal candidate is/has:Bachelors Degree in Computer Science, Engineering, Mathematics, Business or equivalent relevant experience.3+ Years of experience in Business Intelligence, Data Analysis or Information Management.Expert with Excel, SQL, SSRS and Power BI or other data visualization tools.Experience delivering BI and analytics solutions that involve statistical modeling and machine learning programs such as R and Python.Strong written & oral communication skills and an ability to present effectively to stakeholders of all levels.Strong analytical and creative problem-solving skills.An \"LFG\" attitude - once you meet us, you'll see what we mean! Why Arrive? Make an immediate impact with a growing startup.Work in the heart of downtown Chicago IL!Earn a competitive salary.Collaborate alongside experts in the logistics industry and leaders in technology.Take advantage of excellent benefits, including health, dental, vision, and life coverage.Invest in your future with our matching 401K program.Leave the suit and tie at home; our dress code is casual.Eat for free on Fridays...lunch is on Arrive!Sweat it out in our on-site gym.Recharge your batteries at our fully-stocked caffeine bar.Soothe aches and pains with our monthly in-office massages!"}