{"jobID": "2827463762", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Manager: Publisher Partnerships", "companyRating": null, "companyInfo": {"Website": "www.stanza.co", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Hundreds of millions of pageviews, natural language processing, real-time user analytics, header bidding these are just a few of the challenges we face at Stanza. To the consumer, Stanza is a seamless calendar integration, allowing users to sync their favorite interests and events such as concerts, sporting events, movie releases, esports, etc. With partners such as Warner Brothers, NBC Sports, Fox Sports, NFL, NBA, NHL, NCAA, and many more, Stanza is becoming the default way to embed and share calendars on the web.  We are redefining the purpose of a calendar with one core value in mind: Your Time Matters. This leads us to a larger vision to redefine the calendar as a dynamic service that helps you automatically find, remember and act on the things that you truly care about spending your time on. We provide intelligent recommendations for Stanza calendars based on the content of articles and pages across the web aligning with interests, utilizing advanced analytics.  If you would like to take this journey and make a difference, please read on.  Stanza is backed by top-tier venture investors and is headquartered in San Francisco.  Were looking for a talented Account Manager to join our growing team. The primary goal of this role is to maintain and grow an ongoing relationship with our strategic publisher partners, such as NBC Sports, Fox Sports, Perform Group and LMC (Local Media Consortium).  This position must be located in San Francisco. Responsibilities:360-degree Account Management of Stanzas top publishing partners to foster account retention and revenue growthTroubleshoot Stanza platform and help solve client problemsWork with the internal stakeholders to help create and refine presentations to publisher clients and prospectsConduct Quarterly Business Reviews for top clientsQualifications:3+ years of account management experience3+ years of high volume partner managementSalesForce experience a plusKnowledge of digital publishers and large media companies a plusStartup experience a plusAbility to speak Spanish is a plusWhat else:Exciting startup environment with a competitive salary with equityCommuter reimbursementsCatered lunches several times a weekMedical, vision and dental benefits"}