{"jobID": "2788759305", "jobLocation": "Chicago_IL", "jobTitle": "Wealth Management, Analytics & Data Remediation Hub Business/Project Analyst", "companyRating": null, "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "J.P. Morgan Asset & Wealth Management, with client assets of $2.4 trillion, is a global leader in investment and wealth management. Its clients include institutions, high-net-worth individuals and retail investors in every major market throughout the world. The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. For individual investors, the business also provides retirement products and services, brokerage and banking services including trusts and estates, loans, mortgages and deposits.J.P. Morgan Private Bank is a global wealth management leader that delivers the highest quality advice, service, capabilities and products to Ultra High Net Worth (UHNW) individuals and families around the world. We deliver highly customized and comprehensive solutions to help clients with the many complexities they face by leveraging the commercial and investment banking capabilities of the firm.Private Banking is involved with every facet of wealth management, including investments, wealth structuring, philanthropy, liquidity and credit management, and tax and estate planning. Our business model focuses on deep client relationships, an integrated team structure and a platform of depth and breadth.About Client ReportingThe Client Reporting Team is comprised of highly dedicated individuals who are responsible for all aspects of the client reporting for Private Banking accounts. Teams include: Statements (Quality & Corrections), Suitability Hub, Regulatory Client Communications, Special Services, Audit Confirmations, Documentation Management and Fiduciary Safekeeping Services. The newly established Analytics & Data Remediation Hub supports client and account level data remediation initiatives. This team performs a number of functions including project/scoping analysis, data and/or documentation analysis, data entry and verification, and identification, reporting, and cleanup of data discrepancies. Additionally, part of this team is located in Hyderabad, India. As such, this role will have regular interaction with this team and may lead, oversee, and coordinate activities related to their work assignments.Key ResponsibilitiesLearn and understand the various processes and procedures performed within the Data Remediation TeamProvide subject matter expertise both from a project and remediation perspectiveDiagnose, communicate, and facilitate resolution of key obstacles or risksIdentify, track and escalate issues and follow through to resolutionCreate documentation, procedures, presentations, and provide status updates as neededSupport the Analytics & Data Remediation team members with data extracts, data mining, and subsequent analysis as neededEnsure timely and concise communication with key business partners and senior managementDevelop strong relationships; gain the confidence of peers and colleaguesRegularly collaborate and communicate with team members and global partnersBe a leader in unstructured situations and ensure an optimal client experienceExcellent written and verbal communication skillsTeam player with excellent organizational, multitasking and prioritizing skillsStrong attention to detail and ability to work independentlyResults oriented - execute tasks and initiatives effectively and efficientlyStrong relationship Building / Partnership skillsAbility to think strategically and execute a strategic planAbility to multi-task in a fast paced environmentStrong analytical and problem solving skillsAbility to work comfortably with large amounts of dataAbility to think creatively and recommend/implement process improvementsAbility to adapt to a rapidly changing business and technology environment and to utilize the tools which are currently available to service clients efficientlyStrong organizational skills to successfully manage multiple tasks at one timeProficient PC skillsCommitment to quality and controlMinimum of 2 years of experience in the Financial Services and/or Banking industry preferredExperience with several of the systems of record used within Private Banking is preferred"}