{"jobID": "2802138141", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Business Solutions Analyst - 135310 with Strategic Staf", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with San Antonio Interviews but with Strategic Staffing Solutions (S3)  San Antonio Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job DescriptionSTRATEGIC STAFFING SOLUTIONS HAS AN OPENING! Keywords: SAS SQL Tableau  Data Business Solutions Analyst - 135310  Leading Financial Services Firm  Metro San Antonio, TX  W2 Contract Only; No c2c  Pay DOE  What are the responsibilities that this resource will have on a day to day basis:  Decomposing user developed applications mostly written in SAS or Excel and to help develop a solution to retire those processes.  Top technology tools that this resource must have knowledge using:  SAS (Statistical Analysis System) SQL Tableau is a plus  Top skills in the order of importance:  Read the SAS code(1-2 years),  Read/write complex SQL(5-6 years),  Analytical / Process engineer/ Solution Engineer(1-2 year)Company DescriptionStrategic Staffing Solutions (S3) is an international, woman-owned, over $300 million IT and business services corporation based in Detroit. With a composite average annual growth rate of 19%, S3 is fiscally sound and debt free. S3 has had $3.3 Billion in sales since its inception with $1.2 billion of those sales occurring in the last 5 years. It is ranked 16th among the largest staffing firms in the US by Staffing Industry Report and is one of two companies nationally certified as a Charter Partner with Staffing Industry Analysts. S3 is also ranked as the sixth largest diversity staffing firm in the US by Staffing Industry Analysts and one of the top 25 among woman-owned businesses in the nation by Women’s Enterprise USA Magazine.  S3 provides staff augmentation, direct hire recruiting, workforce programs, and outsourced solutions with global industry expertise in energy/utility, healthcare services, insurance, communications, and financial services. It has more than 3,000 direct consultants in 49 out of 50 states in the U.S. and 15 countries including Europe and the Americas.  Apply"}