{"jobID": "2599736807", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.paloaltonetworks.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2005", "Type": " Company - Public (PANW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Check Point Software Technologies, Fortinet"}, "estimatedSalary": "188000", "jobDescription": "The Mission: Our daily fight with cyber bad guys requires us to collect and analyze a lot of data. a LOT of data! And, as our customer base continues its rapid growth, we must look at faster and more robust tools to help us and our customers make the best decisions possible.  With your knowledge of Hadoop and Big Data technologies, you will add your tools-building superpowers to a small team tasked with building out a DevOps automation environment, one that will step up our Business Intelligence game and help us protect our customers from cyber intruders  We offer the chance to be part of an important mission: ending breaches and protecting our way of digital life. If you are a motivated, intelligent, creative, and hardworking individual, then this job is for you! The Job:As a Big Data Engineer, you will be an integral member of our Big Data & Analytics team responsible for design and developmentPartner with data analyst, product owners and data scientists, to better understand requirements, finding bottlenecks, resolutions, etc.You will be an SME for all things Big Data as well as mentor other team members.Design and develop different architectural models for our scalable data processing as well as scalable data storageBuild data pipelines and ETL using heterogeneous sourcesYou will build data ingestion from various source systems to Hadoop using Kafka, Flume, Sqoop, Spark Streaming etc.You will transform data using data mapping and data processing capabilities like MapReduce, Spark SQLYou will be responsible to ensure that the platform goes through Continuous Integration (CI) and Continuous Deployment (CD) with DevOps automationExpands and grows data platform capabilities to solve new data problems and challengesSupports Big Data and batch/real time analytical solutions leveraging transformational technologies like Apache BeamYou will have the ability to research and assess open source technologies and components to recommend and integrate into the design and implementationYou will work with development and QA teams to design Ingestion Pipelines, Integration APIs, and provide Hadoop ecosystem servicesThe Skills:8+ years of experience with the Hadoop ecosystem and Big Data technologiesAbility to dynamically adapt to conventional big-data frameworks and tools with the use-cases required by the projectHands-on experience with the Hadoop eco-system (HDFS, MapReduce, Hbase, Hive, Impala, Spark, Kafka, Kudu, Solr)Experience with building stream-processing systems using solutions such as spark-streaming, Storm or Flink etcExperience in other open-sources like Druid, Elastic Search, Logstash etc is a plusKnowledge of design strategies for developing scalable, resilient, always-on data lakeSome knowledge of agile(scrum) development methodology is a plusStrong development/automation skills. Must be very comfortable with reading and writing Scala, Python or Java code.Excellent inter-personal and teamwork skillsCan-do attitude on problem solving, quality and ability to execute Degree in Bachelor of Science in Computer Science or equivalent  Learn more about Palo Alto Networks here and check out our fast facts"}