{"jobID": "2827927516", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.cps.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1883", "Type": " School / School District", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " The Chicago Public Schools (CPS) has set ambitious goals to ensure that every childin every school and every neighborhoodhas access to a world-class learning experience from birth, resulting in graduation from high school college- and career-ready.  Within the Office of Diverse Learners Supports and Services, the Data Analyst will be responsible for managing the collection and evaluation of data to ensure that our Diverse Learner resources are on-track, being provided the proper professional development. The Data Analyst will be held accountable for the following responsibilities: Perform analysis on complex data sets to provide meaningful information.Evaluate data for structural integrity and consistency.Understands data and extract information to meet business requirements.Identify trends/anomalies in the data collected to understand the source of data inaccuracies.Summarize metrics and produce visualizations as a proof of concept for the Dashboard.Work with the business and subject matter experts to identify additional data needs.Ensure that resources that are paid with Diverse Learning funds are performing only duties consistent with their job descriptions. In order to be successful and achieve the above responsibilities, the Data Analyst must possess the following qualifications: Type of Education Required: Graduation from an accredited college or university with a Bachelor's Degree in a Finance, Math or Business is desired.  Type of Experience and Number of Years:  1-2 years of data mining and data analysis experience Knowledge, Skills, and Abilities:Ability to bring projects to a close with minimal supervisionAbility to work in a fast paced environment, respond immediately to multiple constituencies and meet continuous critical deadlinesKnowledge of SAS, Python, SQL or R is desirableExpert user of Microsoft and Google office suitesAbility to write advanced queries, produce reports and strong analytical, organizational and communication skills requiredFamiliarity of CPS data systems is also a plus'194760"}