{"jobID": "2835015084", "jobLocation": "Jersey_City_NJ", "jobTitle": "Sr. Data Analyst/Entry", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Sr. Data Analyst/Entry Kick start your career in Financial Services. Eclaro is looking for a Sr. Data Analyst/Entry for our client in Jersey City, NJ.  Eclaro’s client is a full-service bank providing a wide spectrum of corporate, commercial, retail banking, and wealth management solutions with offices across the United States. If you’re up to the challenge, then take a chance at this rewarding opportunity! Position Overview: Visually reviews and identifies checks for specific type i.e. Cashier Orders, Travelers Check, Money Orders and other Monetary Instruments. Once identified, must populate ABA, Account Number on Excel Spreadsheet. Needs to cross check against accounts already populated on spreadsheet. Responsibilities:Typically reports to a supervisor or manager.Computer data entry and Excel processing skillsSpecial assignments/projectsExperience and exposure in Check ProcessingQualifications:Requires a high school diploma or its equivalent with 1-2 years of Check Processing experience in the field or in a related area.Has knowledge of commonly-used concepts, practices, and procedures within a particular field.Relies on instructions and pre-established guidelines to perform the functions of the job.Works under immediate supervision.Primary job functions do not typically require exercising independent judgment.If hired, you will enjoy the following Eclaro Benefits:401k Retirement Savings Plan administered by Merrill LynchCommuter Check Pretax Commuter BenefitsEligibility to purchase Medical, Dental & Vision Insurance through Eclaro Interested in applying? Contact Anne Amorsolo at Anne@eclaro.com or 201-375-9082 now. Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status. "}