{"jobID": "2797721340", "jobLocation": "Saginaw_MI", "jobTitle": "VBA Programmer", "companyRating": null, "companyInfo": {"Website": "www.saginawcontrol.com", "Headquarters": "Saginaw, MI", "Size": "201 to 500 employees", "Founded": " 1963", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "VBA Programmer Saginaw Control and Engineering - Saginaw, MI  Full Time with BenefitsSaginaw Control & Engineering is a successful, growing company that has specialized in the production of metal electrical enclosures for over 50 years. Our IT department is responsible for hardware troubleshooting, software design and programming, which is all handled in house. We are looking for an experienced VBA programmer that can design, write, document and optimize database applications using Microsoft Access, Visual Basic for Applications (VBA) and Structured Query Language (SQL). Experience applying programming concepts is the more important than specific knowledge of VBA. We are looking for someone with a positive attitude that wants to aide in the continuous improvement of our IT department. Full Time PositionCreate, debug, and test programs to update and improve our current ERP  system which includes:Develop and manage Inventory Management and Distribution algorithmsDevelop and manage Material Procurement algorithms and infrastructureDeveloping automated systems to convert CAD data into Machine instructions Optimization of Machine sequences and tracking Work in ProcessDeveloping work flow algorithmsMaintaining and developing Time and Attendance and Accounting SystemsWebsite design and maintenance for internet and intranet useEducate and assist users on how to interact with the software We offer 100% employer paid health insurance with single and family coverage, 401(k) with company matching funds, dental insurance, paid vacation time and paid holidays.Please complete an application online by clicking apply now and being redirected back to our application page."}