{"jobID": "2641633206", "jobLocation": "Santa_Clara_CA", "jobTitle": "Search Applied Scientist", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description Applied Scientist for SearchJob Location: Santa Clara, CA Job Type: Full-time Department/ Team: Search and Big Data Responsibilities: Include but not limited the following three main directions: Develop C++-based runtime system to provide better user experience to our customers;Implement prototypes of the algorithms and models in C++/PythonIdentify appropriate metrics to measure the performance of search system.Qualifications:Master or Ph.D. in Computer Science, Electrical and Computer Engineering, Statistics, or equivalent;5+ years industry programming experience in C++;3+ years industry experience on search or recommendation systemKnowledge in machine learning and data mining. Experience with machine learning, data mining, statistical analysis and quantity modeling;Knowledge of Hadoop, MapReduce, Pig, Hive, Spark;Knowledge of NLP is a plus;Knowledge of Deep Learning is a plus.About JD Search Team JDs search team is responsible for research and development of the search algorithms for all JDs search products. Search is the main entrance to JDs online retail business - the core business of JD.COM, and smart device business. The quality of search results plays a very important role to the online shopping experience of our customers, thus adding significant values to the success of the JDs online retail business. With the hundreds of millions of customers and items JD has, even a small improvement on the search algorithm may have great impact on the business and peoples everyday life. By leveraging the state of the art machine learning/deep learning algorithms, we strive to understand the intent and behavior of our customers and to present the most relevant and personalized search results, allowing customers to make an informed purchase decision. We are recruiting talented experts to join our team to create the next generation of innovative and intelligent search products for JD.COM. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}