{"jobID": "2677977634", "jobLocation": "Santa_Monica_CA", "jobTitle": "Scientist, Translational Medicine", "companyRating": "4.1", "companyInfo": {"Website": "www.kitepharma.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " For Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this jobJob DescriptionWe are seeking a highly motivated individual to join us as a Scientist within the Department of Translational Sciences. You will work with the Translational Sciences team in supporting the clinical development of Kite’s novel Chimeric Antigen Receptor (CAR) programs. The successful candidate will be expected to design biomarker and operational strategies to support Kite’s ongoing clinical trials. A demonstrated ability to analyze results, communicate findings both internally and externally and work with cross-functional teams is highly desired. You will also be asked to perform other duties as required. RESPONSIBILITIES: (include, but are not limited to):  Design program specific biomarker strategy  Identify and establish agreements with contract research organizations  Serve as Translational lead on cross-functional clinical development team(s) to execute biomarker strategy in support of Kite clinical trials  Support the preparation of data packages for publication, presentation and/or submission to regulatory agencies  Work with Clinical Data Management and Biometrics to confirm data acquisition and aid in interpretation of analyses  Oversee development, qualification, and execution of innovative assays for clinical biospecimen monitoring  Support the transfer of novel methods to contract-testing labs  Write, review, and edit technical documents including SOPs, development/qualification of protocols and drafting of reports  Contribute to company-wide and external scientific discussions and engagement with key opinion leaders in the field  Other duties as applicable REQUIRMENTS: Ph.D. Degree in immunology, cancer biology or a closely-related field and at least 2 plus years of industry experience.  Familiarity in the areas of cellular based therapy, immunology, immuno-oncology and cancer biology  Understanding of basic CAR-T cell pharmacokinetic and pharmacodynamic studies  Previous clinical trial experience in the setting of translational biology desirable  Experience with relevant diagnostic technologies with an emphasis on flow cytometry (BD Fortessa and BD FACSCanto preferred), immunoassays (ELISA, Luminex, and MSD), and polymerase chain reaction  Microsoft office (Word, Excel, and PowerPoint) skills are required  Knowledge of scientific applications such as GraphPad Prism, FlowJo, BD FACSDiva are desirable  Experience with clinical sample testing, assay development and qualification preferred  Knowledge of LIMS and electronic record keeping (ELN)  Strong organizational and record-keeping skills  Experience in molecular biology techniques including DNA/RNA isolation and PCR (ddPCR and qPCR)  Hands-on expertise with sterile technique and culturing cell lines/primary cells (co-cultures of human T cells and/or PBMCs highly desirable)  Excellent interpersonal, verbal and written communication skills are essential in this collaborative work environment  Comfortable in a fast-paced environment and able to adapt to changing priorities  Self-motivated and ambitious candidate with a strong work ethic  IND123  Kite is a biopharmaceutical company engaged in the development of innovative cancer immunotherapies with a goal of providing rapid, long-term durable response and eliminating the burden of chronic care. The company is focused on chimeric antigen receptor (CAR) and T cell receptor (TCR) engineered cell therapies designed to empower the immune system's ability to recognize and kill tumors. Kite is based in Santa Monica, CA. For more information on Kite, please visit www.kitepharma.com. Sign up to follow @KitePharma on Twitter at www.twitter.com/kitepharma.For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}