{"jobID": "2685974040", "jobLocation": "Washington_DC", "jobTitle": "Principal Systems Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.mantech.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (MANT) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": "Req ID 96792BR Business Title Principal Systems Engineer Group MCIS Location USA DISTRICT OF COLUMBIA Washington Clearance Level Needed Top Secret Category Systems Development Job Duties and ResponsibilitiesBecome an integral part of a diverse team that leads the world in mission, cyber, and intelligence solutions. At ManTech International Corporation, you will help protect our national security while working on innovative projects that offer opportunities for growth and advancement.  ManTech is looking for a well-rounded Lead Systems Engineer to be a performer on a small team of three IT professionals. This team will implement and maintain a technical refresh of a secure information sharing system utilized by a program management office (PMO) and its customer sites. . Responsibilities include, but are not limited to:Identify and diagnose complex performance, security, and technical issuesDevelop and implement solutions across a wide range of technologiesSupport the development of cyber security, NIST 800 series paperworkImplement and maintain DISA STIG requirementsMaintain physical back-end and virtual serversMaintain virtual desktop infrastructure (Microsoft VDI via RDS)Maintain Cisco infrastructurePosition requirements:Bachelor’s degree in an IT related field and 7-9 years of IT related experienceCurrent CCNA Security certification requiredExperience with Windows Server 2012 R2, Hyper-V, Active Directory, SAN,SQL 2008 or 2012Understanding of HP data storage (HPE StoreVirtual, iSCSI)Experience maintaining teleconferencing infrastructure (Cisco)Ability to work earlier customer hours (e.g., 0700-1500) at primary site in NW DCAbility to travel to CONUS secondary sites, should not exceed 10% annuallyPosition pluses:Other current DoDD 8140/8570 IAT Level II certifications or higher (e.g., Security+, GICSP, GSEC, SSCP, or higher)Experience with Windows Server 2016, SQL 2016, SharePoint 2016,and other related technologiesExperience supporting Risk Management Framework (RMF) and InTrustExperience developing IT checklists, SOPs, guides, etc.Experience supporting IT acquisitions and logisticsSecurity Requirements:US citizenship with an Active TS clearanceValid US driver’s license Qualifications Requires Bachelors degree (in Computer Science, Math, Electrical Engineering or related field) and seven to nine years of related experience. Degrees See Qualifications Years of Experience 11-13 years w/High School Diploma  05-07 years w/Bachelors Degree  See Qualifications Position Type Full-Time Shift Day Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies."}