{"jobID": "2771332419", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Engineer / Architect", "companyRating": null, "companyInfo": {"Website": "www.sidecarhealth.com", "Headquarters": "El Segundo, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Sidecar Health:At Sidecar Health, we're on a mission to change the health care system for the better. Our focus is on tackling one of the biggest problem plaguing the system - transparency. Our members know exactly what their health care services cost, and what they will have to pay vs. the traditional model of receiving care and getting the bills months later. Our personalized and affordable plans empower individuals to choose the coverage they need that fits within their budget.We are a passionate group of people developing a health insurance product that works the way we think health insurance should work.Job Description: Sidecar Health is looking for a hands-on data engineer with a start-up mindset that wants to join a dynamic team that is disrupting the healthcare industry. Our ideal candidate will be working very closely with our engineering and business stakeholders to propose and roll out a data strategy for the organization.  We are a startup, and everyone here wears multiple hats, and so will this hire. As we continue grow our business, and our appetite for data insight increases, this role will also continue to expand.  To begin with the applicants should be a strong hands-on developer with programming experience in languages like SQL, Python, Java and R and collaborate with our product and engineering team in the design and implementation of data engineering tasks.  The candidates should also have in-depth understanding of real-time data harvesting, parsing, storing and modeling for reporting purposes, and will be responsible for architecture and design of Enterprise Data Hub, Data Lake and Data Catalogs, that are integrated into a converged data landscape to support our business operational objectives. Responsibilities: The candidate will be hands-on engineer and work alongside engineering and business stakeholders in designing and architecting our data infrastructure from the ground up, to be scalable and secure.  Implement pipeline and processing jobs for collecting and storing data from disparate systems  Work with real-time data streams from multiple internal/external sources  Ensure smooth ongoing operations of various data platforms with high availability while making continuous improvements  Provide scalable solutions to manage large imports and implement operations procedures as necessary.  Design robust enterprise data resource management policies including security, backup and recovery, performance monitoring and tuning and high availability  Participate in peer code reviews and be comfortable in writing high quality documentation about their work  Evangelize BI team roadmap and help promote insights-driven culture; Bridge-building between analysts, business end users, and tech  Delivery of solutions that are designed for performance, reporting, and analysis What we expect: Willingness and ability to work in a fast-paced startup environment  A Developer to Architect, the whole 9 yards. From making the data query able to be driving the data development activities: Engaging with product and business stakeholders in understanding their data needs, design code and test. This is the latitude and freedom of execution you will be getting from this role!  Demonstrate experience working in large-scale data environments which includes ETL, real-time and batch processing requirements  Strong data modeling skills (relational, dimensional and flattened) and analytical SQL skills, with attention to detail  Deep understanding of the importance of data security and compliance (HIPAA, PCI, PII) and use that experience and knowledge in designing and delivering large scale, 24-7, mission-critical data pipelines and features using modern big data architectures  Has strong interpersonal communication skills; effectively communicates in verbal and written form  BA/BS in related field, or equivalent experience Nice to have: Architected secure, scalable, cloud-based solutions that are HIPAA and/or PCI compliant  Experience integrating data from multiple data sources and file types such as JSON, XMS, CSV and non-traditional data structures  Knowledge of Java, Node JS, Python  Hands-on experience with Spark and Athena  Experience in technologies like Amazon Redshift, PostgreSQL, Hadoop, SQL Server, or advanced analytics tools is a plus  Knowledge working with GIT or any other version control system.  Experience working in a fast paced/startup environment  Masters in CS, Analytics or other related advanced degree program Position location: El Segundo, California To apply for this position: Send your resume tocareers@sidecarhealth.com. NO AGENCIES PLEASE"}