{"jobID": "2593140178", "jobLocation": "San_Diego_CA", "jobTitle": "Hadoop Data Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.rockstargames.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " Rockstar is seeking a Data Engineer with experience in Big Data technologies to join a team focused on building a cutting edge Game Analytics platform and tools to better understand our players and enhance their experience in our games.  The ideal candidate will be skilled in developing complex ingestion and transformation processes with an emphasis on reliability and performance. In collaboration with other data engineers, database administrators and developers, the candidate will empower the team of analysts and data scientists to deliver data driven insights and applications to company stakeholders. RESPONSIBILITIESETL Development – Safely and securely ingesting large volumes of data from high traffic production environments, auxiliary services, and various structured/unstructured data sources into our Hadoop and Vertica ecosystems.Warehouse Development – Assisting the team in tasks of data modelling on a massive scale, using Big Data tools and platforms to deliver high performance data sets.Data Quality Management –Troubleshooting and correcting quality issues with source data, as well as implementing auditing and alerting procedures to ensure data accuracy.Operational Support – Assisting in the day to day maintenance of Hadoop and Vertica clusters; assist in troubleshooting and bug fixes for daily processes.Analysis Support – Collaborating with stakeholders, analysts and data scientists to ensure that high quality data is available to answer any business needs.QUALIFICATIONSExperience with Hadoop Ecosystem (Map Reduce, Spark, Oozie, Impala, HBase, Scala, etc.).Experience with Big Data Ecosystems (Kafka, Cassandra, etc.).2+ years of work experience in a similar position requiring ETL, Data Modeling, and Data Science architectures to be designed and developed.Deep understanding of data warehouse design and data modelling standards.Expert in at least one SQL language such as T-SQL or PL/SQL.Experience in understanding the underlining requirements to translate them into data models.Experience working in a Linux environment.Good communication skills.Dynamic team player.A passion for technology - we are looking for someone who is keen to leverage their existing skills and seek out new skills and solutions.PREFERREDExperience with Vertica.Experience with Python and shell scripting.Experience with Tableau administration.Knowledge of the Video Game Industry and video games."}