{"jobID": "2812859177", "jobLocation": "Glenview_IL", "jobTitle": "HCI Research Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.gnresound.com", "Headquarters": "Ballerup, Denmark", "Size": "1001 to 5000 employees", "Founded": " 1943", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Sonova, Oticon"}, "estimatedSalary": "76000", "jobDescription": " HCI Research Scientist  GN Hearing, a leading manufacturer of Hearing Health devices, is looking for a Human-Computer Interaction (HCI) Research Scientist focused on addressing interaction problems in hearing healthcare by drawing from recent advancements in fields such as bio-sensing or machine learning. As part of the Research team you will investigate novel interfaces/experiences via prototyping and user studies to support evidence based solutions. You will be expected to work with a cross functional team supporting translational and applied research efforts. Areas of responsibility:Be a user advocate within a research team, applying HCI-driven methodologies to assess and define solutions.Conduct systematic literature reviews, and synthesizing evidence to influence design decisions.Drive the creation of conceptual models and usability objectives aligned with user-centered design goals and tasks.Design and develop hardware and software prototypes for proof-of-concept and feasibility studies to formulate evidence based solutions.Coordinate and manage projects across a multi-disciplinary team of scientists.Qualifications: Education: Ph.D. or equivalent experience in one of the following disciplines: Human-Computer Interaction, Human Factors Engineering, Design Science, or Computer Science.  Experience: 1 - 2 years of research experience in HCI or equivalent graduate level research. User-Centered Design Skilled in creating solutions from user research and iterative design process.Rapid prototyping using hardware platform such as Arduino and Raspberry Pi, as well as software tools such as Matlab, Axure, Sketch etc.Designing, conducting and analyzing human participant studies.Experience with bio-sensing or novel input methods a plus.Knowledge of web and mobile platforms or coding experience a plus.Experience with machine learning a plus.Experience coordinating input from stakeholders in multiple disciplines.Why GN Hearing: The Hearing Healthcare industry provides you the grounds for creativity to help our end-users with innovative solutions. Our multi-disciplinary research team carries out applied research in a wide range of disciplines, including acoustics, signal processing, neuroscience, human-computer interaction, artificial intelligence, audiology, hearing science, and multiple fields of engineering.  This job ad is intended to be a general guideline for applicants. It is not to be construed as an exhaustive list of all duties, expectations or qualifications.  GN offers a competitive full compensation package and flexible work environment. This position currently does not offer a relocation package."}