{"jobID": "2836805220", "jobLocation": "Fort_Meade_MD", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.feddata.com", "Headquarters": "Linthicum, MD", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DescriptionPerforms and manage the activities of Contractor principal engineering personnel.  Responsible for providing program management and technical personnel with technical direction for the design or development of software or hardware techniques that are on the cutting edge of technology.  Provides team and technical leadership while ensuring the application of sound system engineering concepts.  Devises strategies to extract meaning and value from structured and unstructured data.  Leverages analytic models, scripting, and programming to characterize data.  Analyzes and develop requirements to support the characterization and ingestion of new and existing data types.  Collaborates with customer teams to understand mission needs. Develops and implement ingest processing and approval workflows.Basic QualificationsMinimum eighteen (18) years experience in technical roles for Government or Industry customer.  Twelve (12) years experience as a systems, software, or hardware engineer in programs that encompassed: System architecture development; Performing requirements analysis, management and control; multiple activities with multiple vendors; large systems engineering efforts totaling more than $15M/year, or Management and evaluation of business processes and implementation strategies.  Minimum three (3) years direct experience with an intelligence community or signals intelligence activity.  Holds a BA/BS Degree in a technical discipline related to the experience requirements as stated herein (such as: Computer Engineering, Computer Science, Electrical Engineering, Information Systems). The Data Scientist is required to have the following experience/skills: – Experience in a broad range of knowledge, including information technology, requirements, architecture development, and functional and systems analysis.  –Experience in the following areas: Implementing systems providing knowledge/information sharing capabilities including the following disciplines: System design, Integrating COTS products and technologies into cohesive customer capabilities; System production; System integration; System test; Transition of systems into operations; Web services implementation; Web interfaces; J2EE; Web portal technologies.  – Experience in providing technical leadership and direction in supporting the application of sound system engineering concepts.  – Experience employing combination (2 or more) of analysis, computer science, mathematics, and software engineering skills to devise strategies for extracting meaning and value from large datasets  – Experience with predictive analytics, machine learning, and data mining  – Skilled with data flows, Pig scripting, Hadoop MapReduce, and various analytic tools  – Skilled working with development and SE teams, other stakeholders agencies, and leadership  – Knowledge of data indexing and analytic development– Has strong communication skills. Preferred Qualifications– Experience working with cloud service providers and data stewards  – Demonstrates experience in network metadata processing, manipulation, and analysis in support of intelligence analysis.– Holds an Advanced Degree in a related technical field, i.e., Electrical Engineering, Computer Science, etc EOE/M/F/Veteran/Disability"}