{"jobID": "2837211563", "jobLocation": "Summit_NJ", "jobTitle": "Sr Scientist, Biologics Analytical Development", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.Senior Scientist Biologics, Analytical Early DevelopmentSummit, NJDEPARTMENT Analytical Development Biologics PREREQUISITES Ph.D. in Biochemistry, Analytical Chemistry or related discipline and minimum of 5 years relevant experience; or  MS degree with 8 years or a BS degree with 12+ years of relevant experience.  The successful candidate will be highly motivated to work within a science focused, collaborative, multidisciplinary drug substance and drug product development environment to achieve the companys aggressive drug development targets. As part of Employers Biologics team, this Sr. Scientist will play an important role throughout the development of new drug candidates from discovery to commercialization, contributing to the advancement of new therapeutics in the areas of hematology, oncology, inflammation & immunology. Responsibilities will include, but are not limited to, the following: The Senior Scientist position will be responsible for the end-to-end analytical development to support IND/IMPD filing for biologic drugs in early development. The Sr. Scientist should work with minimal supervision and forge multi-functional collaborations to ensure successful IND filings. Work closely with other functions to ensure complete physiochemical and biological characterization of biologics prior to IND filing.Collaborate with other functions for evaluating developability of new molecules and identify CQAs for early development.Responsible for setting Ph I specs to support early developmentCharacterization of protein primary structure, carbohydrate structure of biologics using mass spectrometry based techniques.Act as an analytical lead and represent analytical department in cross functional team meetingsReview analytical data for completeness and correctness.Support drug substance and drug product impurity characterization and identification.Serve on and lead departmental, interdepartmental and project teams.Report and discuss analytical results and conclusions, both orally and in writing.Maintain lab notebooks in a compliant manner, draft study protocols, reports and SOPs for inclusion in regulatory filings.Ensure that all facilities, equipment, and personnel are and remain in compliance with applicable regulatory requirements, appropriate SOPs and corporate policies.Skills/Knowledge required:Background in Analytical Chemistry or a Scientific Discipline with demonstrated analytical capabilities.Hands on experience in filing IND and IMPDs to regulatory agencies.Knowledge and experience in biologics characterization with mass spectrometry based techniques is required.Knowledge and experience in physiochemical characterization of biologics with separation techniques including SEC, CE-SDS, icIEF.Hands-on laboratory experience with LC and LC/MS methods for protein (or glycoprotein) characterization is a plus.Knowledge / Experience in impurity testing techniques.Demonstrated ability for critical thinking, problem solving and innovationStrong problem-solving and troubleshooting skills.Strong capabilities in experimental design and execution.Ability to work independently and in cross functional team environment.Experience working in GLP/GMP environment is requiredStrong verbal and written communication skills.Skills/Knowledge in the following areas are a plus:Knowledge and experience in comparability, CQA assessment and forced degradation characterization is preferred.Experience with development, qualification and validation of biochemical protein characterization methods is preferred.Understanding of biologics development is preferred and experience working with monoclonal antibodies is a plus.The ideal candidate will also have experience in interacting with CROsModern laboratory automation. Employer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}