{"jobID": "2605444101", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Engineering Lead", "companyRating": "4.7", "companyInfo": {"Website": "www.buildzoom.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "129000", "jobDescription": " Does this look like your next challenge?  1. Architect and implement BuildZoom's next-gen data processing framework.  2. Mentor our data engineering team and drive strategic projects.  3. Directly influence the company's data strategy.  BuildZoom is a data company at heart. We ingest vast volumes of construction and real estate data to gain deep insight into the marketplace. Our sophisticated ingestion framework has helped us accumulate one of the most complete and timely data sets in the industry.  On top of this unique data, we deploy NLP and ML algorithms to develop a nuanced view of millions of construction companies. When a homeowner asks for help in remodeling their home, our recommendation engine ranks relevant contractors across dozens of dimensions to identify the best possible fit.  As our Lead Data Engineer, you will work alongside our two founders and VP of Engineering to transform our \"startup quality\" data pipeline into a world-class system that will further accelerate BuildZoom's rapid growth. You will ultimately grow and lead our talented data engineering team to help execute your vision.Our technologies include Python, Ruby on Rails, Redis, Aurora, MySQL, Postgres, Redshift, Elasticsearch, AWS.On your first day:Meet colleagues and set up your desk with the hardware and peripherals of your choiceOne-on-ones with company execs to accelerate your understanding of business challenges and opportunitiesDeploy code to productionWithin three months:Propose a data pipeline architecture that connects existing processes and sets the stage for all data processing at BuildzoomDevelop metrics and monitoring solutions to evaluate the quality of our ingestion and analytics processesPropose new ways to use data to drive business decisionsWithin one year:Build a world-class data processing systemDevelop machine learning algorithms to glean insights from unstructured dataPropose strategies to scale data ingestion from thousands to hundreds of thousands of sourcesGrow the data engineering teamWork with our Chief Economist to power our statistical models (e.g., www.buildzoom.com/blog/solar, https://www.fastcompany.com/40487403/what-happens-when-land-is-more-expensive-than-the-buildings-on-top)Awesome things about this position:BuildZoom is a data company. As an engineering leader, you will play a pivotal role in setting and executing our core strategyWe expect you to understand the business and participate in top-level strategy discussions with the executive teamWe expect you to help us evaluate and introduce modern data technologies for streaming, queueing, processing, and storing dataOur compensation philosophy includes generous equity grants to give you tangible financial upside BuildZoom is doing incredibly well and growing quickly but much of the most challenging work remains to be done. We doubled our revenue last year and aim to grow 10x next year. Prominent investors like Y-Combinator, 8VC, and Founder's Fund provide invaluable support but it's up to us, the employees, to build this company. If you're serious about doing your life's work and pouring your creativity into solving tangible real world problems for the $1.3 trillion construction industry, come join us!  See more here: https://www.buildzoom.com/careers"}