{"jobID": "2684035489", "jobLocation": "Mountain_View_CA", "jobTitle": "Causal Inference and Applied Economics Scientist / Senior Scientist / Principal Scientist", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JD.com is Chinas largest online retailer and its biggest overall retailer, as well as the countrys biggest Internet company by revenue. JD.com sets the standard for online shopping through its commitment to quality, authenticity, and its vast product offering covering everything from fresh food and apparel to electronics and cosmetics. Its unrivalled nationwide fulfillment network provides standard same- and next-day delivery covering a population of more than 1 billion - a level of service and speed that is unmatched globally. In 2017, JD had 292.5M annual active consumers and net revenue of US$55.7B. JD.com is currently on pace to become Chinas largest B2C e-commerce platform by 2021. JD.com is listed on the NASDAQ under the ticker JD. In 2014, the year of its listing, this was the largest IPO on the NASDAQ. JD.com was the first Chinese Internet company to be included on the Fortune Global 500 List.  JD plans to strengthen its leadership position as a technology-driven company over the next 10+ years, with a focus on big data, AI technology and smart logistics, and to become the dominant e-commerce platform in China. To achieve these goals, we aim to more deeply understand consumer behavior in China, better understand what drives purchases, how to forecast demand, and how to target promotions, advertising and other efforts across the whole range of technologies available to sophisticated Chinese consumers today. As global brands enter China and as China in turn becomes more globalized, we will provide innovative ways for these brands to deliver new products, help drive new monetization strategies and provide solutions for brand safety and product authenticity. In addition, we are constantly evolving our already state-of-the-art ad-serving platform to serve digital ads across all of China. For this platform, we are developing sophisticated analytics around attribution, return and exposure. To drive this exciting agenda forward, we are looking for people with strong social science, quantitative, statistical and machine learning skills who can partner with our team in Mountain View and in Beijing to leverage the vast data and computational assets of JD (which now involves collaboration and data sharing with Baidu, NetEase, Quihoo, Sogou, Toutiao and WeChat. This powerful consortium combines the largest search, gaming, mobile-security, news-aggregation and social network companies in China).  The ideal candidate for this position will be quantitatively trained (advanced masters or PhD) with expertise in quantitative and econometric methodologies, and with a demonstrable understanding of causal inference methods. Individuals who are interested in more deeply understanding consumer behavior, \"firm\" behavior, and competition and who have a passion for solving complex business problems through the combined use of data, technology and strategy will thrive in our environment. They will also be comfortable working cross-functionally and thrive in a fast-paced organization. Interest in e-commerce and in economics/quantitative marketing/business-analytics is a plus.Responsibilities"}