{"jobID": "2768740366", "jobLocation": "Princeton_NJ", "jobTitle": "Data Scientist Think Team", "companyRating": "3.6", "companyInfo": {"Website": "www.otsuka-us.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " ResponsibilitiesThink Team works on building academic and industry collaborations with a primary goal to drive innovation at Otsuka. The team comprises of a group of research scientists, postdocs, and data scientists focusing both on scientific and technology innovations in healthcare.  The data scientist will support translational research and/or technology development for drug discovery and clinical development, clinical trial operational efficiencies, digital assessments and health products, and other intelligent scientific/innovation information management tools. Responsibilities: Support translational research in the CNS and oncology disease areas on the identification of prognostic and predictive digital/molecular/imaging biomarkers, characterization of disease and its progression, and identifying/development of new assays towards diagnostics/algorithms that enable personalized/precision medicine by guiding targeted, individualized use of therapies to the patients that will benefit the most.Develop innovative AI/machine learning/NLP/Signal Processing/Logic/statistics and mathematical modeling methods to provide therapeutic insights by leveraging internal, external and real world data sources. Experienced in graphical modeling (Bayesian networks, Hidden Markov modeling) and/or deep learning.Guide evidence based product development by extracting market intelligence from such real-world data sources through knowledge representation and pattern recognition. QualificationsRequired Must have been awarded or working towards an advanced degree (PhD/Masters or advanced Bachelor students) either in Quantitative/computational fields (Computer Science, Computational Linguisics, Math, Physics, Statistics, Psychometrics, Engineering, Operations Research or similar fields) or in life sciences fields (Medical Informatics, Statistical genetics, Population genetics, Bioinformatics, Computational Biology, Genomics Sciences, Biophysics, Chemical Biology, Systems biology) using next generation sequencing technologiesDemonstrated knowledge and experience of application of AI/Machine learning/Robotics/Signal Processing/Scientific Computation/Human Computer Interface/Logic tools, Graph and Network algorithms and Semi-/Non-Parametric Statistical methods and software tools to real world data problems that are multi-scale, longitudinal and heterogeneous in natureMust be agile to grow in new directions, work with a team of scientists and practitioners from different functional areas to solve problems in pharmaceuticals. Must be able to bring insights to stakeholders with ability to extract therapeutic intelligence by leveraging internal, external and real world data sources.Demonstrated ability to use knowledge of recent techniques, and develop new methodologiesExcellent software development skills, esp. in rapid prototypingEstablished publication record in peer reviewed journals/conference proceedings.Good programming skills in R/Python/MATLAB/Julia and C++/Java/Scala/Clojure/GO, etc.Knowledge of and experienced in working with public databases and real world databasesProficient in cloud technologies AWS/Google cloud/Azure or Openstack - Hadoop, Pig/Hive, Spark distributed computing platforms/analyticsProficient in Visualization tools like D3.js and othersStrong knowledge of SQL and NoSQL databases is helpfulExperienced in version control systems (SVN, GIT, Mercurial)Experienced in Unix/Linux operating systemsExcellent communication skills Plus Healthcare and Life Sciences experience is not mandatory. In fact, experience in gaming, human-computer interaction, AI/Machine Learning applied to various industries is highly desirable.Strong knowledge of CNS and Oncology disease areas is highly desirableExcellent knowledge of programming patterns and different types of programming languages like functional, declarative, rule, event, real-time, reactive etc., is highly desirable. OverviewOtsuka Pharmaceutical Development & Commercialization, Inc. (OPDC) is an innovative, fast-growing healthcare company that discovers and develops new compounds that address unanswered medical needs and advance human health. With a strong focus on neuroscience, oncology, and cardio-renal treatments, OPDC is dedicated to improving the health and quality of human life. For more information, visit www.otsuka-us.com. OPDC is a subsidiary of Otsuka America, Inc. (OAI), a holding company established in the U.S. in 1989. OAI is wholly owned by Otsuka Pharmaceutical Co., Ltd. The Otsuka Group employs approximately 42,000 people globally and its products are available in more than 80 countries worldwide. Otsuka welcomes you to visit its global website at https://www.otsuka.co.jp/en/."}