{"jobID": "2800746206", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": " Leverage a wide range of data analysis, machine learning and statistical modeling algorithms and methods to solve business problems.  Evaluate the current operational environment and identify opportunities to leverage advanced analytics.  Apply critical thinking skills and perform advanced analytics with the goal of solving complex and multi-faceted business problems.  Generate deep insights through the analysis of data and understanding of operational processes and turn them into actionable recommendations.  Perform advanced quantitative and statistical analysis of large datasets to identify trends, patterns, and correlations that can be used to improve business performance.  Become a subject matter expert and trusted advisor in the analytics discipline.  Demonstrate excellent organization skills throughout the development of analytical solutions (data analysis documentation, hypothesis documentation, code management, etc.).  Build and deploy prototype solutions to demonstrate ideas and prove concepts.  Effectively communicate with project team members and sponsors throughout the project lifecycle (status updates, gaps/risks, roadblocks, testing outcomes, etc.).  Develop presentations to summarize and communicate key messages to senior management sponsors and colleagues.  Work independently and collaboratively (as needed) within the team to achieve the desired outcomes of an analytical project.  Actively contribute to the continuous learning mindset of the organization by bringing in new ideas and perspectives that stretch the thinking of the group. Education: M.S. or Ph.D. in Statistics, Engineering, Computer Science, Mathematics, Economics or related quantitative field Experience and Technical Skills: 10+ years experience developing predictive models, forecasting models and/or machine learning algorithms in a large-scale, corporate environment with 5+ years in financial services  Hands-on experience with a wide variety of predictive modeling, machine learning, data mining, time series forecasting and optimization algorithms  5+ years experience working with a variety of database environments (SAS, Oracle, Teradata, etc.)  Must have with 8+ years of experience with demonstrated ability to code complex programs in Python, SAS and SQL  Must have demonstrated experience working with production-type applications and full knowledge of the code development lifecycle (Dev, Test, Prod)  Must have demonstrated experience in large scale data environments and ability to work efficiently with very large datasets  Proven ability to strategically manage complex, highly-visible analytical projects from concept through implementation  Proven experience leveraging job automation applications and environments (e.g., CRON, Control-M)  Demonstrated ability to effectively manage all facets of the analytical project lifecycle (data exploration, hypothesis testing, code development, testing/validation, model deployment, etc.)  Superior Analytical Skills  Outstanding critical thinking and problem solving skills  Has an “engineering mindset”  Self-starter mentality with the ability to delegate/collaborate with others  Ability to translate ambiguous business problems into a conceptual analytical and technical architecture  Passion for continuous learning and professional development  Deep curiosity, creativity and imagination"}