{"jobID": "2738485903", "jobLocation": "Washington_DC", "jobTitle": "General Manager", "companyRating": "4.2", "companyInfo": {"Website": "www.kimptonhotels.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Joie de Vivre, Thompson Hotels, Two Roads Hospitality"}, "estimatedSalary": "109000", "jobDescription": " At Kimpton, our mission is to be the Best Loved Hotel & Restaurant Company so regardless of position, we look for individuals who are passionate about providing genuine heartfelt care to our guests and employees.  What you get to do: Provide restaurant guests with friendly and professional service, excellent food quality, strong price value and consistency of execution in an attractive, well-maintained environment. Development of an annual marketing plan to penetrate new sales opportunities and maximize use within existing markets. Providing proper guest service requires and employee staff that is thoroughly trained in service sequence, product knowledge while making every effort to meet and exceed the expectations of each and every guest. Your day-to-day: It is the Restaurant GM/ Director of Food and Beverage's responsibility to lead service education and continuously offer a Best Place to Work through: Daily line-ups and regular department meetings;New server, host and bartender training programs;Ongoing development and training;Daily evaluation of restaurant service performance;Employee discussion and performance management including timely completion of performance evaluations;Coordination of timely food production.Provide direct oversight of property-wide Banquet and Catering operations. Work closely with sales on booking groups (preliminary menus and diagrams to make sure group fits). Review all F&B; minimums and selling guidelines. Work closely with catering to get events When groups are contracted with sales, work on groups (intro letter, BEO's, billing, guest room blocks, group resumes). Support Banquets in all aspects of room set, functionality and flow. Work directly with clients who are in-house and contracted to connect and create repeat guests.Develop long term and short term catering sales strategyGuide Catering Sales initiatives to completion and report resultsDirectly oversee banquet operations including developing and maintaining managerial and captain oversight of all operations, schedule and train banquet staffDaily walk through of event set upsProduce and track internal sales goals and incentives for sales and cateringOrganize and participate in BEO meetingsDevelop Catering Marketing Strategy directly with director of salesThe Restaurant GM/ Director of Food and Beverage will partner with the Executive Chef to provide \"excellent quality and presentation\" of all food to the guests. The Restaurant GM/ Director of Food and Beverage will partner with the Executive Chef to have final approval of all banquet and catering menus and pricing. The Restaurant GM/ Director of F&B; participates in the evaluation of food product, front-of-the-house employee performance, and development of product consistent with our market position. Further responsibilities include selection and pricing strategy of all liquors and wines, and supervision of their procurement.The Restaurant GM or Director of Food and Beverage participates in creating the financial objectives of the restaurant and Event space on an annual basis through the budget process. It is the Restaurant GM/ Director of Food and Beverage's responsibility to meet the financial targets in the sales area by executing and enhancing the annual marketing plan, reacting quickly to new opportunities, running consistently high operation standards, and effective utilization of marketing funds. It is also the Restaurant GM/ Director of Food and Beverage's responsibility to meet budget in all areas of cost control with consistent focus on cost of sales and payroll. The Director of Food and beverage is responsible for identifying talent and providing the necessary training as positions open. Further responsibilities include filling any open positions with candidates who are qualified and understand the \"standards of excellence\" required of them. The Restaurant GM/ Director of F&B; in conducting ongoing training programs for new and existing management and hourly staff.Responsibility for the daily cleanliness of all areas of the restaurant, Event and Pre-Event spaces both internally and externally. Coordination of kitchen cleanliness with the Executive Chef. Coordination of service area maintenance with floor management, employees and any outside services. Ongoing maintenance of the physical asset through capital planning as required in the budget process.Manages all subordinate supervisors in the Restaurant. Is responsible for the overall direction, coordination, and evaluation of this restaurant's employees. Carries out supervisory responsibilities in accordance with Kimpton' s policies, procedures and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding and disciplining employees; addressing complaints and resolving issues or concerns.Specific experience we're seeking: Minimum 3 years as a Restaurant GM, Director of Food and Beverage in a luxury hotel environment or combination of both experience with proven experience with all aspects of restaurant/banquet/catering operations, and sales including budgeting, expense management, inventory, payroll and labor costing, staffing, marketing, owner relations and P&L; management. BA/BS in Hospitality/Restaurant Management, Business or equivalent field required.Proven systems knowledge and experience with Aloha/Avero, Micros and ADP/eTime payroll or combination of these systems required.QUALIFICATION REQUIREMENTS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  EDUCATION and/or EXPERIENCE: Prior experience required. Depending on the role degree may be required.  LANGUAGE SKILLS: Ability to read, write, and verbally communicate effectively and professionally with other business departments, guests, and vendors. Ability to diplomatically deal with difficult situations and people, while exhibiting a consistent level of professionalism.  PHYSICAL DEMANDS: While performing the duties of this job, the employee is regularly required to stand, walk, and talk or hear. The employee frequently is required to use hands to finger, handle, or feel objects, or telephone. The employee must regularly lift and/or move up to 10-25 pounds and frequently lift and/or move up to 50 pounds."}