{"jobID": "2825810701", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data & Applied Scientist 2", "companyRating": null, "companyInfo": {"Website": "www.microsoft.com", "Headquarters": "Redmond, WA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MSFT) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Amazon, Apple"}, "estimatedSalary": null, "jobDescription": " We are the Bing Core Revelance team responsible for retrieving and ranking organic results for given search queries from hundreds of billions of indexed web documents. On top of that, we are also aggressively evolving Bing search engine from key word search centric system to a set of more general intelligence (AGI) capabilities that can help solve broader intent fulfillment, knowledge retrieval and task completion problems.  Are you looking for opportunities to deliver innovations to tens of millions of users every month that impact their daily life? Do you want to be part of a fast-cycle, high visibility and hardcore search team with ambitious goals and intensive competitions? We are hiring extremely talented, highly motivated and productive developers with expertise in information retrieval, AI, machine learning, natural language processing, data mining and large scale distributed computation. *Responsibilities** Our goal is to delight our users by satisfying their intent expressed through their queries. Our core drivers are large scale machine learning, including DNN and RNN based technologies, along with analyzing, inferring and experimenting with truly big data. As part of the team, you would be driving relevance projects through their entire life-cycle from idea creation through implementation, experimentation and finally to shipping. Bing core relevance team have offices in multiple worldwide locations, including Bellevue Washington, Silicon Valley, Germany, China and India, also closely collaborate with Microsoft Research on many joint innovations. We are looking for strong, motivated, results-oriented applied scientists and software engineers to help drive the design and implementation of the next wave of relevance improvements and Bing search engine innovations. *Qualifications** + MS/Ph.D. in CS/EE or related areas is required  + 2+ years? experience in the areas of machine learning, information retrieval, natural language processing or data mining.  + Software design and development experience with C++/C#/Java, or similar programing languages  + Experience in areas such as massive database applications, parallel or distributed processing, high performance computing, large scale data mining.  + Experience with Hadoop, Dryad, or similar distributed systems.  + Experiences in the areas of online services such as search, online advertisement, recommendation systems, are strong pluses.  + Strong ability and effectiveness working in a significant technical problem domain, in the term of plan, design, execution, continuous release and service operation.  + Strong software engineering fundamentals, including coding, problem solving and data analysis skills.  + Passionate and self-motivated.  + Ability to effectively work in collaborative multiple project team environment and ship production features in a fast-paced startup environment.  + Good communication skills, both verbal and written.  + Customer/end result/Metrics driven in design and development.  + Strong ability in self-learning, entering new domain, managing through uncertainty in an innovative team environment  Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form at https://careers.microsoft.com/us/en/accommodationrequest .  Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work."}