{"jobID": "2832486649", "jobLocation": "Arlington_VA", "jobTitle": "Sr Specialist Asset Management", "companyRating": "3.5", "companyInfo": {"Website": "www.electric.coop", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1942", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": " .footer-wrapper { display: block; width: 96vw; padding: 1.2rem 0; margin: 0 auto; } .footer-wrapper a { color: #35bbc3; text-decoration: none; } .footer-wrapper a:hover { color: #208e95; text-decoration: underline; } All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity, religion, national origin, disability, veteran status, or other legally protected status.Reasonable Accommodation Requests NRECA is committed to working with and providing reasonable accommodation to individuals with physical and mental disabilities. If you need special assistance or an accommodation while seeking employment, please e-mail humanresources@nreca.coop or call: 703-907-5992 - NRECA Arlington Human Resources. Please call 402-483-9275 - NRECA Lincoln Human Resources, for Lincoln, NE employment opportunities. We will make a determination on your request for reasonable accommodation on a case-by-case basis.EEO is the Law The law requires NRECA to post a notice describing the Federal laws prohibiting job discrimination. For information regarding your legal rights and protections, please click on the following link: EEO is the Law and EEO is the Law Supplement.Pay Transparency Non-Discrimination NRECA will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay. Please see the Pay Transparency Nondiscrimination Provision for more information.E-Verify As a Federal Contractor, NRECA is required to participate in the E-Verify Program to confirm eligibility to work in the United States. For information please click on the following link: E-Verify"}