{"jobID": "2817133027", "jobLocation": "Houston_TX", "jobTitle": "Quality Data Analyst (Full Time)", "companyRating": "2.5", "companyInfo": {"Website": "www.chistlukeshealth.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "Baylor St. Luke’s Medical Center A quaternary care facility that is home of the Texas Heart® Institute, a world-class cardiovascular research and education institution founded in 1962 by Denton A. Cooley, MD–consistently ranked as one of the nation’s best in Cardiovascular Services & Heart Surgery.  The first hospital in Texas and the Southwest designated a Magnet® hospital for Nursing Excellence by the American Nurses Credentialing Center, receiving the award four consecutive times. Baylor St. Luke’s is home to three freestanding community emergency centers (Holcombe, Pearland, and San Felipe) offering adult and pediatric care–treating more than 51,000 patients annually. The hospital holds a collaborative partnership with Baylor College of Medicine and affiliations with The University of Texas Medical School at Houston, The University of Texas Medical Branch (Galveston), Houston Baptist University, and Prairie View A&M; University. POSITION SUMMARY Collects and evaluates clinical data as a  part of the Performance Improvement Program. MINIMUM QUALIFICATIONS MINIMUM EDUCATION AND LICENSURE REQUIRED:*Associate's Degree in Nursing -or-  Master's Degree in Healthcare related field (MPH, MHA) MINIMUM EXPERIENCE*Three (3) years of related work  experience MINIMUM KNOWLEDGE, SKILLS, AND ABILITIES*Computer keyboarding skills,  knowledge of basic Word, Excel and Power  Point, knowledge and understanding of  medical terminology and familiarity  with medical records, ability to interact  effectively with healthcare providers  of all disciplines, excellent time  management and organizational skills. POSITION RESPONSIBILITIES1. Develop and maintain expert  knowledge of measure and indicator specific  inclusion and exclusion criteria for  assigned measure sets2. Abstraction of both electronic  and paper patient records based on  established tools3. Data entry into web tools of  required data elements as specified by  assigned national data bases and/or  clinical registries4. Conduct quality control audits  of data entry via the web tool to assure  accuracy of data entry5. Correct or assist in resolution  of data quality errors and transmission errors  prior to upload of  data6. Participate in activities  related to CMS validation audits7. Participate in internal  reliability studies on data abstraction8. Participate in CPT meetings by  providing education to hospital staff keeping  the team apprised of changes or  pending changes to measurement  requirements9. Assist in problem solving and  formulation of performance improvement  strategies related to compliance with  measurement specifications"}