{"jobID": "2682135424", "jobLocation": "Holmdel_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.spirent.com", "Headquarters": "Crawley, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1936", "Type": " Company - Public (LSE: SPT) ", "Industry": " Telecommunications", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Ixia, Anritsu"}, "estimatedSalary": "146000", "jobDescription": "Job Title: Senior Data Scientist Requisition Number:4128Exempt/Non-Exempt (US Only): Exempt Job Category: Engineering Country: United States Job Location: Holmdel, NJ  Job Overview:The Telecom Analytics organization within Spirent is an exciting software division, providing innovative solutions for the telecommunications industry. Leveraging the latest technologies in big data, machine learning and data mining, Spirent provides state-of-the-art software products for communication service providers. With a friendly, informal culture, and substantial growth opportunities, the analytics division provides an ideal environment for a talented data scientist. The position is located in Holmdel, NJ.  In this role, you will investigate new applications of machine learning and big data analytics for improved operations of telecom network providers. Define new product capabilities and execute special customer studies to demonstrate business value of various algorithms, visualization, machine learning and data analytics ideas. Working with the latest big data, artificial intelligence and predictive analytics technologies, you will partner with a team of high caliber software engineers to bring these new, high value capabilities to market.Responsibilities: Investigate and analyze large data sets to identify unique patterns and determine potential business value of new data mining proposals.Leverage a rich data warehouse to engineer/develop new features for use in predictive algorithms.Conduct special studies with telecommunication companies, applying machine learning to large data sets to confirm business value of proposed analytics.Define new, innovative data visualizations to help understand complex data sets.Work with business analysts to define new system functionality related to data mining, machine learning or other big data capabilities.Remain current on the latest big data research and development in the areas of Hadoop, maching learning and big data algorithms.Work with product marketing to help position Spirent as a leader in the area of applying advanced analytics for improved operations of telecommunications businesses.Job Requirements:Bachelor's Degree in Computer Science, Statistics, Mathematics or equivalentMinimum of 8 years of related work experienceProven track record working on large, multi-person big data/machine learning projects is requiredKnowledge of machine learning, predictive analytics, Hadoop/Spark, time series analysis and neural networks are all requiredTelecommunications OSS experience, commercial DB experience, mobile technologies knowledge, a familiarity with open source resources and Java are all preferredExperience with the following programming languages: R, Python, SQLFamiliarity with Python libraries (pandas, scikit-learn) is preferredFamiliarity with Hadoop machine learning libraries (Mahout, MLib) is a plusExperience with neural networks, specifically, TrensorFlow or equivalent is preferredExperience with Javascript is a plusExperience with time series analysis, specifically, ARIMA models, forecasting is preferred"}