{"jobID": "2731118422", "jobLocation": "Rockford_MI", "jobTitle": "Estimator", "companyRating": "3.5", "companyInfo": {"Website": "www.totalplastics.com", "Headquarters": "Kalamazoo, MI", "Size": "201 to 500 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Laird Plastics, Cope Plastics, Inc., Piedmont Plastics"}, "estimatedSalary": "49000", "jobDescription": " Your Day-To-Day ResponsibilitiesThis position will be responsible for developing, evaluating and improving estimating methods by gathering information and analyzing metrics. • Personally practices good safety habits, works to improve safety culture, and wears appropriate Personal Protective Equipment (PPE).• Analyzes and estimates material requirements, and all pertinent internal and external requirements necessary to provide estimates from RFQ’s. • Confers with planning and design staff concerning product design and tooling to ensure efficient production methods.• Estimates production times, staffing requirements, and related costs to provide information for management decisions. • Confers with manufacturing, engineering, purchasing, and other staff regarding manufacturing capabilities, production schedules, material pricing, and other considerations to facilitate bid process. • Assists in research and cost justification of new equipment. • Identifies, researches and cost justifies areas for automation and productivity improvements. Helps troubleshoot and correct manufacturing inefficiencies to ensure profitability of estimates. • Prepares materials both for internal and external bids. • Calculates all pertinent figures to ensure a profitable, competitive quote in a timely manner. • Establishes and maintains files and history of specified quote projects. • Provides completed estimates for inside and outside sales reps in a timely manner. • Confers with sales and customers as required to obtain necessary information to process quotes. • Compares estimates to actual costs to determine accuracy of quotes.• Reviews work order and procedural manuals to determine critical dimensions of design.• Configures drawings from customer prints, CAD/CAM data, samples or sketches to facilitate estimating and part programming. • Maintains blueprint control to current company quality standards.• Orders tools and ensures timely delivery. • Ensures all files are backed up per company policy• Creates job routing data and shop routings. • Other duties may be assigned.Is this opportunity right for you?To perform this position successfully, you must be able to complete each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Associate's degree in a technical-related discipline, or equivalent combination of education and experience, and three – five years of previous experience. The ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations is required. As well as the ability to write reports, business correspondence, and procedure manuals. The ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public is mandatory. The ability to calculate figures and amounts such as discounts, interest, commissions, proportions, percentages, area, circumference, and volume is preferred.While performing the duties of this job, you will regularly be required to stand; use hands to finger, handle, or feel; reach with hands and arms; and talk or hear. You will frequently be required to walk and occasionally be required to sit; climb or balance; and stoop, kneel, crouch, or crawl. You must regularly lift and/or move up to 10 pounds and frequently lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception, and ability to adjust focus.Important information you should know:Aftech is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please let us know. "}