{"jobID": "2817714981", "jobLocation": "San_Jose_CA", "jobTitle": "Application Engineer - Metrology / Lithography / Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.asml.com", "Headquarters": "Veldhoven, Netherlands", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (ASML) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Applied Materials, KLA-Tencor, Lam Research"}, "estimatedSalary": "108000", "jobDescription": " Location San Jose - CA, US Level Master Experience 5-10 Experienced Available since 4/13/2018 Functional area Background Reference req2303 Introduction ASML/HMI brings together the most creative minds in science and technology to develop lithography & metrology machines, as well as computational lithography & control software that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world's leading chipmakers - to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Wilton, CT, Chandler, AZ and San Jose, CA. We are proud of bringing together the brightest minds all over the world to tackle the most challenging problems in making faster and smaller chips. As part of our team, you will have the opportunity to go beyond yourself in developing more advanced techniques and push the technology boundaries. ASML San Jose, CA is an industry leader in computational lithography for integrated circuits. Our Tachyon platform enables capabilities that address chip design, photomask making and wafer printing for semiconductor manufacturing and the LithoTuner platform enables lithography optimization for ASML's leading photo lithography tools, known as 'scanners'. Job Mission ASML/HMI is hiring an Applications Engineer. In this role you will support a leading customer with their current and future challenges in defect inspection and control. You will identify strategies to stretch the equipment, software and associated processes beyond their specification to deliver the customer required product performance. You will cooperate with and drive the applicable ASML and HMI organization in order to define and implement solutions that meet the customer's need. As an Applications Engineer you will also be responsible for communication with Customer engineers as well as ASML/HMI engineers in the respective headquarter offices. Job Description -Insight into leading-edge chipmakers' needs in terms of software, data analysis tools and control strategies -Knowledge of optical physics, imaging and semiconductor process technology -Interact and develop a solid working relationship with the customer to help understand and develop valued solutions to their fabrication issues -Work with account team and marketing organization at the field site, in San Jose and The Netherlands to define the scope of the package that meets customers' requirements -Demonstrate technical leadership through problem solving, training and presentations -Own a broad technical knowledge of lithography, metrology and defect inspection -Give strategic guidance to junior engineers -Own the day to day project management activities and drive a technical team towards integration of solutions with goal to meet customer requirements -Willingness to travel up to 30% is required Education ****. and above in Electrical Engineering, Physics, and/ or Chemical Engineering, IC manufacturing, semiconductor process technology, and related fields or equivalent experience. Experience -5 or more years of experience in engineering in semiconductor environment with a strong emphasis on lithography, defect metrology, and/or semiconductor process -Technical background in at least 2 relevant competences Hands on experience with lithography, metrology, simulation, and analysis tools required -Script level programming skills; Matlab, Python or R -Data analysis and visualization (JMP/Spotfire) Personal skills -Must able to work independently and also effectively as a member of a team -Strong interpersonal skills, able to quickly build credibility with customers and internally, goal-oriented, drives to results Context of the position PHYSICAL DEMANDS AND WORK ENVIRONMENT This position primarily works in an office environment. It requires frequent sitting, standing and walking. Daily use of a computer is required. May stand for extended periods when facilitating meetings. The physical demands of the position described herein are essential functions of the job and employees must be able to successfully perform these tasks for extended periods. Reasonable accommodations may be made for those individuals with real or perceived disabilities to perform the essential functions of the job described."}