{"jobID": "2570614828", "jobLocation": "Hamilton_NJ", "jobTitle": "Research Scientist", "companyRating": "2.3", "companyInfo": {"Website": "www.genesisbiotechgroup.com", "Headquarters": "Trenton, NJ", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Requisition Number 17-0360  Post Date 2/15/2018  Title Research Scientist  City Hamilton  State NJ  Company Medical Diagnostic Laboratories LLC  Description Medical Diagnostic Laboratories, LLC (MDL) is a CLIA certified clinical laboratory with multiple state licensing, specializing in state of the art, automated DNA based molecular analysis of a variety of chronic and infectious illnesses.ONCOVEDA Cancer Research Center at MDL has an opening for a PhD level immuno-oncology specialist to complement its existing drug-discovery effort in this new and expanding area. The successful applicant will become a core member of a small team of senior and junior scientists with expertise in immunology, drug-discovery, pharmacology, assay design, cytokine biology, immunogenetics, tumor biology and human cancer. This position is based entirely in the laboratory.Job Duties:Develop, validate, and implement biochemical and cell based assays Develop and maintain cell lines Enter and analyze data using software such as Microsoft Excel and GraphPad Prism Write reports and presentations on research data Program and operate microplate readers Perform related job duties as required  Requirements Job Requirements:As a successful applicant, is a scientist who has experience in innate immunology, specifically, cGAS-STING axis and induction of type I interferons (IFNs) or related IFN experience. Strong bench skills in several of the following areas are required: mammalian cell culture; cell line engineering, cell based assay development, enzymatic assay development, protein purification, and standard molecular and cellular techniques. Some expertise in flow cytometry, immunology based techniques, or high throughput screening is a plus. A strong publication record. Excellent written, spoken and presentation skills to specialists and non-specialists. Excellent interpersonal skills. We OfferMedical, Dental & Vision Insurance Short and Long Term Disability Life Insurance Dependent Care Flex Spending Account Voluntary Policies (Accident, Hospital Indemnity, Critical Illness & Supplemental STD) Legal Plan & Identity Theft Protection 401(k) Plan Paid Vacation & Holiday Business Casual Environment Visit us at www.mdlab.comMedical Diagnostic Laboratories, LLC is an equal opportunity employer"}