{"jobID": "2828488875", "jobLocation": "San_Francisco_CA", "jobTitle": "Showroom Sales Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.waterworks.com", "Headquarters": "Danbury, CT", "Size": "201 to 500 employees", "Founded": " 1979", "Type": " Company - Public", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Kohler, Walker Zanger, Ann Sacks Tile & Stone"}, "estimatedSalary": "58000", "jobDescription": "Waterworks - inspiring great design, and great people. Join the Nation’s leading luxury brand for bath and kitchen as a Waterworks Sales Consultant. The Sales Consultant role at Waterworks is a combination of inside and outside sales driving growth and market share while building strong relationships with architects, the design community and retail clients. The right candidate will combine their passion for sales and luxury design within a structured sales environment that provides Consultants the tools they need to be successful.  As a Waterworks brand ambassador, Sales Consultants model the Waterworks values of leadership, fearless sales strategies, a customer-centric approach, and a passion for the Waterworks products.  True to Waterworks roots, we value and cultivate long-standing relationships with our clients and our associates. We work in a highly collaborative, creative environment that values each associate’s contribution toward delivering beautiful, innovative, luxury products while providing superior customer service. We offer our associates training on all three brands under the Waterworks umbrella, career growth opportunities, competitive salaries, bonus potential, and a comprehensive benefits package including 401k. Key accountabilities include:Cultivate and grow relationships within the design communityProvide superior customer service to enhance long-term relationships, brand loyalty, and market shareActively identify and develop new business and relationshipsMeet or exceed sales and marketing quotas and goalsManage all phases of client projects (initial meeting, product specifications, quoting and beyond)Manage client relationships through use of Company CRM system Required SkillsIdeal candidates must possess the following:2-5 years of inside/outside sales and/or business development experience in the high-end, luxury brand environmentProven track record of consistently meeting or exceeding sales and marketing quotas and goalsSales \"hunter\" who enjoys finding an developing new businessExceptional communications skills, both verbal and writtenAbility to listen and translate client’s needs into salesStrong persuasion skills and the ability to influence othersSelf motivated and possess the ability to manage multiple tasks and projects simultaneouslyPlumbing and/or tile industry experience preferredWorking knowledge of Microsoft Office SuiteRequired Experience Job Location  San Francisco, US-CA "}