{"jobID": "2788762275", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.stanleyblackanddecker.com", "Headquarters": "New Britain, CT", "Size": "10000+ employees", "Founded": " 1843", "Type": " Company - Public (SWK) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": "Title Data Scientist  23-May-2018 Business US - SSS - Corp State / Country / Province Texas Job Description This position will be part of the new Data Analytics team at Stanley Black and Decker. The Data Analytics team at Stanley Black and Decker is creating a new set of analytics products and services for the company. These analytics products and services will be used by our customers to help them better monetize the data they capture from Stanley Black and Decker’s security assets such as the electronic access control systems, monitoring systems, cameras, alarms, etc.  This is a great opportunity to work in a startup setting within a large and established company with a tremendous brand.  The Data Scientist will be responsible for: Use Case Definition (both based on currently available data as well as the art of the possible)Data Architecture and ModelingData Extraction, Preparation and ScrubbingTesting of various analytical models using training and test data sets using statistical and machine learning modelsDerivation of business insights and preparation of recommended actionsPreparation of executive level reports and readout to executive level stakeholdersQUALIFICATIONSRequired:Bachelor’s Degree in Analytics2+ years of experience with data analytics and business intelligence projects2+ years of knowledge in data modeling1+ year of knowledge in machine learning2+ years of knowledge of relational databases and SQL2+ years of experience with Python and R programming experiencePreferred:Master degree in Computer Science is preferredKnowledge in data architectureExperience with R programmingExperience with Web developmentPrior Consulting Experience with both business and technology stakeholdersSBDCSSRequisition Number54707BRCity Austin EEO Statement All qualified applicants to Stanley Black & Decker are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, veteran’s status or any other protected characteristic. "}