{"jobID": "2816763768", "jobLocation": "Austin_TX", "jobTitle": "Compliance Quantitative Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.tsys.com", "Headquarters": "Columbus, GA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (TSS) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " First Data, Elavon, Bank of America Merchant Services"}, "estimatedSalary": "71000", "jobDescription": " Every day, the people of TSYS® and Netspend® improve lives and businesses around the globe through payments. We make it possible for millions of people to move money between buyers and sellers using our payments solutions including credit, debit, prepaid and merchant services. We are \"People-Centered Payments\", and our team has the unique opportunity to help create a world in which payments make people's lives easier and better. This is both a tremendous honor and an important responsibility for those who accept the challenge. If you are looking to make a valuable difference for people everywhere and for yourself we may have the right place for you.  The Compliance Quantitative Data Analyst plays a critical role developing and supporting the Netspend Compliance Departments data needs, specifically including Anti Money Laundering (AML), Customer Identification Program (CIP), Compliance Testing, and Distributor Due Diligence (DDD). The Compliance Quantitative Data Analyst will play a key role in the following: AML Customer Risk ScoringAML Risk AssessmentAML, CIP, DDD, and Compliance Testing Data & Data ModelsCompliance Data Storage and ReportingCustomer Due Diligence Data AnalysisDDD Risk Assessment & Risk ScoringModel Risk Management and ValidationOFAC, Sanctions, and Negative News Name Matching Fuzzy Logic The job demands include data mining, data aggregation, and development of models that highlight compliance and AML risk, providing recommendations for AML risk management strategy and monitoring rules. Analytical requirements also include analysis of business processes to maintain efficiencies; analysis of compliance with regulatory requirements; bench mark analysis of expected customer behavior, as well as, producing sample data for internal testing and developing ad hoc reporting as requested from the Compliance department. This position reports to the Director of AML/BSA Compliance. Responsibilities:Develop/Test/Monitor/Validate/Rationalize Rules to Monitor Customer and Distributor Transaction Activity Develop, test and deploy monitoring rules in transaction monitoring system. Evaluate feedback from analysts, bank partners and auditors to tune and optimize alert rules, policies and procedures.Test and validate the performance of alert rules and false positive ratios (FPR) and provide recommendations for rule enhancements.Document all rule changes and procedures surrounding the decisions to create or modify monitoring rules.Generate and monitor team member performance metrics.Interface with Netspend business owners, bank partners, auditors to validate business requirements, share knowledge, and manage expectations related to changes in policy, process, procedure or requests for analysis.Data analysis: Build requested data sets to facilitate: Identify trends, patterns, rules associated with financial crimes.Provide complex data analysis to identify, troubleshoot, resolve and/or escalate trends that will impact transaction monitoring.Utilize data mining techniques to identify AML Risks.Analyze business process flow and identify areas of abuse, misuse, waste, inefficiency.Provide reporting and analysis of regulatory compliance for internal and external auditors and partners, as well as, adherence to internal policies and controls.Generate reporting and analysis to provide baseline levels of customer behavior and set upper and lower bounds on suspicious or unusual behavior.Develop ad hoc reporting to answer immediate business needs.Develop recurring and automated dashboard reporting.Document and present analytical methodologies used.Present clear and concise solutions/results to business leaders and management.Interface with Compliance business owners to validate business requirements, share knowledge, manage expectations related to changes in policy, process, procedure or requests for analysis.Create predictive and other analytically derived models for assessing AML risks.Quantifies value of new data sources, data elements, and alternative modeling approaches.Identifies and recommends new modeling and analytics opportunities.Translates high level business objectives into quantifiable analysis tasks.Data analysis for millions of accounts per year and millions of transactions per day.Skills/Education/Experience:Advanced degree (Masters or Ph.D.) in Mathematics, Statistics, Economics, Computer Science or related field preferred;Advanced experience with statistical modeling tools (R, SAS, STATA, etc);Advanced experience with regression analysis, decision trees, clustering and network modeling;Advanced SQL coding skills required; ability to develop new functions and procedures and automate processes highly preferred;Solid understanding of relational databases and confident extracting data and building data sets from relational database;Able to extract, transforms and load (ETL) datasets from various sources;Experience with graphical reporting tools (Tableau/Qlik) a plus;2-3 years of experience working as a data analyst. Experience in prepaid, credit or banking industry a plus.Able to work with little direct supervision once ownership of a project or task has been assigned;Able to execute multiple analytic projects at high level of quality on tight business timetable;Able to work effectively on cross-functional business team composed of people with diverse backgrounds, some of whom are non-technical;Strong presentation development and writing skills (e.g. proficient in Microsoft Excel, PowerPoint and Word, especially creating summary tables, charts and pivot tables with Excel) Advanced technical and business critical writing skills a plus;As provided in NetSpend's Background Check policy, eligible candidates may be subject to drug, criminal history, and credit checks, which will be conducted and used in accordance with applicable local, state, and federal laws.Not Ready to Apply? Join Our Talent Community!!"}