{"jobID": "2791211022", "jobLocation": "Los_Alamitos_CA", "jobTitle": "Risk Analytics Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "118000", "jobDescription": " Industry & Technical Expertise ,Minimum 3 years of Risk Analytics experience within the Banking, Capital Markets and/or Insurance industries. Experience should include: o,Credit, market, liquidity and/or operational risk analytics (e.g., model development, strategy and framework, scorecard development, model documentation, model validation, model governance, model implementation, integration and automation, etc.) o,Retail, commercial, and/or Capital Markets portfolios, including commercial lending, asset-based lending, treasury services and investment banking. Exposure to insurance, wholesale/retail lending, deposits, etc. desirable ,Demonstrated experience with risk regulatory trends, principles, and practices (e.g., CCAR, DFAST, Internal Capital Reporting, Capital Planning, Risk Weighted Assets, etc.), including any combination of the following: back testing, stress testing, sensitivity testing, benchmarking, capital calculations, reporting standards, etc. ,Hands-on experience with SAS or Matlab. Exposure and/or proficiency to other analytical tools such as R, SQL, C++, VBA, Murex, Calypso, Numerix, etc., desirable ,Model development/quantitative skills should include any combination of the following: multivariate regression models, transition matrices, stochastic processes, econometric models, neural networks, Monte Carlo, etc. ,Demonstrated experience with credit/market risk type models (e.g., CVA, ALLL, PD/LGD, Roll Rate, VAR, SVAR, etc.) ,Minimum of a Bachelor's Degree in a quantitative discipline such as: Mathematics, Statistics, Econometrics, Economics, Engineering, Quantitative Finance or other quantitative discipline. An Advanced Degree in one or more of these disciplines is highly desirable Management Consulting / Business Development Expertise ,Minimum 7 years of current Management Consulting experience focused on Risk Analytics and the Financial Services industry required. ,Project management experience including: defining scope, set*,Experience within the model risk or model development team of a universal bank, wholesale bank or rating agency ,Data management experience (e.g., extracting, aggregating and structuring large volumes of data, etc.) in the context of analytics ,Strong understanding of front and back office operations desirable*,Excellent communication (verbal and written), facilitation and interpersonal skills, including the ability to clearly communicate complex problems and solutions in a simple, logical and impactful manner, both internally and externally ,A strong desire to deliver to a high standard and ability to develop creative and breakthrough solutions ,Demonstrated ability to concurrently manage dynamic large consulting workstreams and/or projects ,Demonstrated track record of delivery as part of a project team, including the ability to meet deadlines, overcome challenges, manage stakeholder expectations, and produce project deliverables ,Ability to navigate unstructured processes and to simultaneously manage multiple workstreams ,Demonstrated team management and leadership skills; desire to lead and motivate teams in a dynamic and challenging environment ,Strong analytical, problem solving, and troubleshooting skills with the ability to exercise mature judgment and structured decision-making ,Demonstrated leadership and time management skills ,Ability to work collaboratively and independently while managing multiple projects, assignments and/or responsibilities ,Highly motivated with the ability to thrive in a fast-paced, high energy, and demanding team-oriented environment ,Strong problem-solving and troubleshooting skills with the ability to exercise mature judgment and structured decision-making ,Results-oriented, self-directed, inquisitive, and entrepreneurial ,Ability to inspire and motivate others"}