{"jobID": "2837782278", "jobLocation": "Pasadena_CA", "jobTitle": "Speech Research Scientist (Speech Synthesis)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Description: ObEN is an artificial intelligence company that is building a decentralized AI platform for Personal AI (PAI), intelligent 3D avatars that look, sound, and behave like the individual user. Founded in 2014, ObEN is a K11, Tencent, Softbank Ventures Korea and HTC Vive X portfolio company and is located at Idealab in Pasadena, California. Come see what its like to take on extraordinary transformations every day, in an environment buzzing with smart people (including our team of world class scientists in areas of speech, NLP, and computer vision) who understand and respect what you do. In addition, we encourage publications to top conferences and journals.  As a Speech Research Scientist focusing on Speech Synthesis, youll be working on improving ObENs speech synthesis technology. This will include the improvement of our current voice model and development of new speech generation approaches based on deep generative models.  Responsibilities: Develop and extend ObENs glottal source model, in view of improving the quality, flexibility and control (e.g. voice quality, expressivity) of ObENs speech and singing voice synthesis system; Develop new speech generation approaches based on deep generative models (e.g. wavenet) with reduced amount of data and better control. Requirements: PhD with strong experience in Speech Synthesis demonstrated by publications in top Speech Journals and Conferences (Icassp, Interspeech, etc); Expertise in signal processing in particular in the design of voice models (glottal source model, ) allowing a fine control of the characteristics of the synthesized voice (speech and singing voice); Experience in deep generative model of raw audio (wavenet) and Generative Adversarial Network (WGAN); Fluent in Python and C++, and good knowledge of deep learning packages (TensorFlow, Theano, Keras, etc); Familiarity with linguistic phonetics; Knowledge of basic digital signal processing techniques for audio. Application requirements: Please send the following to  careers@oben.com Detailed resume and/or LinkedIn profile Links to any research / papers you have been an instrumental part of and are proud of Name of instructor / adviser, if any along with link to their profile Cover Letter identifying your five favorite apps on your phone Introduction to ObEN:  https://goo.gl/gxpxwT Interview process: STAGE 1: Phone Interview  STAGE 2: In-person Interview at Idealab (we cover travel expenses for the day)  STAGE 3: We require a sample project submission and a candidate proposal submission(To know more about what an ObEN candidate proposal is, click here)  STAGE 4: Spend a day at our office and participate in all team activities.  STAGE 5: Offer Letter"}