{"jobID": "2835290174", "jobLocation": "Pleasanton_CA", "jobTitle": "Data Warehouse Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.1stunitedcu.org", "Headquarters": "Pleasanton, CA", "Size": "51 to 200 employees", "Founded": " 1932", "Type": " Other Organization", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Job Description: At 1st United Credit Union, we are committed to improving the quality of life for our members and communities we serve across the East Bay and Tri-Valley areas.  The Data Warehouse Analyst be involved in the design and development of our data warehouse as well as providing timely and accurate reports and dashboards. The Data Warehouse Analyst will work with all levels and departments of the organization. Strong SQL and data analysis experience is a must. Major Duties and Responsibilities:Develop and maintain KPIs/Metrics reports and dashboards allowing the business to clearly see where improvement is necessaryWrite ad-hoc queries for day to day data requests; workspaces and business rulesEffectively influence and work comfortably across all levels of the organization, inspire trust and respect, and maintain excellence in written and verbal communicationEnsure accuracy and integrity of data provided to internal and external partnersPerforms other job related duties as assignedMinimum QualificationsThree to five years of T-SQL development, SSIS and experience developing reports with SSRSSQL Server development skills; writing stored procedures and table/scalar value functionsExperience with system/data integration and automationExposure to other database applications (MySQL, DB/2, etc.)Background in data warehousing and data modelingDevelop and implement technical best practices for data movement, data quality, data cleansing, and other ETL related activitiesExperience with C# or other OOP languageAbility to interact effectively with internal and external customersStrong organizational and prioritization skillsStrong written and verbal communication skillsAbility to multi-task and work independentlySelf-motivated and strong attention to detailPreferred QualificationsExperience with PowerBIBasic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3Experience with TDDVisual Studio/TFSSalary: $75,000 to $90,000 depending on experience. 1st United Services Credit Union is an Equal Opportunity Employer /AA-M/F/D/V  PI103086400 - provided by Dice"}