{"jobID": "2753251049", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.castlighthealth.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (CSLT) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " This role fulfills two major functions within the Data Management team.  As a Data Analyst, you are primarily responsible for gathering systems data requirements and drawing out the objectives and scope of systems solutions through systematic analysis of business needs. The Data Analyst should have solid understanding of system development methodologies, familiarity with web services integrations and an excellent grasp of database concepts, data specification, data rules and data quality metrics. You should have strong SQL experience to analyze the issue thoroughly. You will also be expected to complete tasks and activities related to Customer launches, maintenance efforts, production supports to ensure alignment with projects, departments and overall organizational goals. Customer launches includes coordination and facilitation of technical discussions with vendors and external partners in setting up and configuring Single-Sign-On (SSO), bank integrations, data file exchange specifications and other Castlight-specific system integration with external entities.  The ideal candidate is someone who is excited to develop partner relationships, with a keen focus on operational excellence. Wearing a customer hat is paramount, as is having and developing technical fluency around data requirements. This person will have strong communication skills and the ability to lead projects from beginning to end. The responsibilities of this position may change over time—this role requires flexibility and the ability to adapt to the evolving needs of the organization. The candidate should be familiar with healthcare, insurance, provider and benefits data; should bring insights and best practices in managing data acquisition and data cleansing routines. Project management, leadership, initiative and technical skills including some software development experience are integral. Candidate will be required to work non-standard hours at times and will partner with all technology disciplines.  This is a full-time position at our San Francisco headquarters.  Castlight Health is built on the core pillars of Castlight Code: “We are one team on a mission making things happen”. The ideal candidate for this role will represent the best of each of these pillars. They will demand excellence in all aspects of their work, have a passion for learning the ins and outs of data integrations at Castlight and its stakeholders, and will be committed to contributing to the Castlight community. Essential Duties and Responsibilities:Acts as the liaison among Professional Services, Customer Success, External Healthcare Payer/Carrier, Customers, Product and Engineering teams) to thoroughly understand data quality requirements and the impact of high/low data quality and get customers launched on time and troubleshoot any open issuesServes as an operational point of contact when onboarding new data partnersPerforms functional testing on assigned modules/tasks to ensure it meets data specificationsConducts data architecture analysis and develops data flows aligned to enterprise data architecture visionUnderstands and considers the business implications of data, and communicates with impacted groups as necessary.Implements appropriate processes for defining data requirements with external and internal partnersCoordinates internally & externally to define, document, and execute the setup, quality, cadence, and method of delivery of data filesOperationalizes data onboarding and data maintenance related to the functional area of healthcare payer/carrier data or other customer datasetsUnderstands the custom Castlight data models, products, and internal tools that support the data onboarding and maintenance processesCompletes assigned Customer launch projects and its related activities including but not limited to setting up configurations, troubleshooting and fixing data issues and web services integrations, and acting as technical contact with third party vendors, carriers/payers or customersTroubleshoots and problem-solves technical/data-related issues identified through requirements gathering, testing, and/or user-reported escalations. Supports post-production implementations, coordinates or implement data fixesCommunicates with internal stakeholders regularly to provide status updates and ensures project timelines and scopes are being managed appropriatelyEscalates as appropriate to the Data Management Managers, Engineering and Product Managers, Implementation Managers, Account Executives, and/or Directors on any critical risks or issues that may negatively impact delivery of client requirements and/or client expectationsEnforces and adheres to organizational processes and standardsStrong SQL Experience is a mustQualificationsBachelor’s degree required, preferably in Mathematics, Computer Science, Information Technology or Data Science or equivalent job experienceStrong verbal, written and interpersonal communicationAbility to work well in a team and lead when neededEnergetic, creative, flexible and self-motivatedAbility to handle fast-paced work flowDetail-oriented and accurateAbility to develop and recommend solutions to problems.Ability to discover insights from dataAdaptive and open to frequent changes in work environment and prioritizationAble to successfully manage multiple competing deadlinesAbility to demonstrate ownership over tasks and assignmentsWorks on problems of limited to diverse scope involving task specific or cross-functional teamsAbility to analyze business processes, best practices, data lifecycles, and standard operating proceduresApplied experience in secure file transfer protocol (sFTP), web services integrations, Salesforce, and JIRA is preferredExperience with SQL required"}