{"jobID": "2619515183", "jobLocation": "Lansing_MI", "jobTitle": "Service Technician |", "companyRating": "4.5", "companyInfo": {"Website": "www.michigancat.com", "Headquarters": "Novi, MI", "Size": "501 to 1000 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Alta Equipment"}, "estimatedSalary": "22", "jobDescription": " ObjectiveMichigan CAT Service Technician is the heart of our business. You will work on and at times will be leading service and maintenance tasks of our customer and rental fleets, while continuing to learn as well as looking out for self and others' safety at the work place.  You will maintain a high standard of customer service, while continuing your development to building a lasting career at Michigan CAT.ResponsibilitiesYour daily tasks will include, but will not be limited to some of the following activites: Diagnose problems with equipment/engines, using a variety of methods and toolsPerform Preventive Maintenance work on Customer Products, as well as Internal Rental FleetService/Repair work on items diagnosed, ranging from mechanical to electrical workIdentify and source any parts required for repair or serviceComplete a detailed service report to provide to Service Coordinator and Service SupervisorCleaning and painting of equipment as necessary to complete jobWelding and boring QualificationsTo be considered for a position as a Michigcan CAT Service Technician, you should have: Minimum 3-5 years of Heavy Construction/Agricultural and Farming Equipment repair experience3-5 years Diesel Engine diagnosis and repair experienceHighly skilled in welding and boringExcellent understanding of electrical diagnosisHighly motivated and able to learn new tasks, processes, and policiesMust possess maturity to manage own time and work with minimum supervision, but also capable to help out and work in a team oriented environment Preferred qualification: Certified WelderPrior experience using CAT ET or similar electronic diagnostics toolExperience writing up detailed service reports on internal/external customer equipmentHigh School Diploma or Vocational College degree in some of the following areas:Diesel TechnologyHeavy Equipment RepairWelding TechnologyDisclaimer Any Duties and Responsibilities described within the Careers Page are not a comprehensive list, and the scope of the job may change as necessitated by business demands. Michigan CAT is an Equal Opportunity Employer Qualified applicants will receive consideration for employment without regards to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, or protected veteran status.  Equal Employment Opportunity is the Law  Equal Employment Opportunity is the Law – Poster Supplement"}