{"jobID": "2657222512", "jobLocation": "Sunnyvale_CA", "jobTitle": "Research Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " The Yahoo Gemini marketplace empowers advertisers with insightful data, brand-safe premium content and advanced technologies to deliver engaging search and native advertising campaigns that drive results.Research Scientist, Advertising Insights and Optimization Advertising Science of Yahoo Research at Oath is pioneering the new sciences underlying online advertising. We deliver scientific leadership through new technologies powering the company's advertising products across multiple devices and channels. We solve the most critical and challenging problems in online advertising, and set the course for the future of the field. We specialize in deep, creative thought on the hardest technical problems, apply novel ideas in practice, and stretch the limits of theory. We hire amazing research scientists and engineers who serve as the most effective problem solvers and forward-looking thinkers. Job Responsibilities:Contribute to the exploration and creation of new scientific understanding by initiating, proposing and executing unique and promising projects, and developing innovative technologies.Gather and perform statistical analyses on large data sets, and identify problems.Conceive, devise, prototype, and evaluate complex algorithms and models that can be integrated into the advertising platform.Design and conduct offline simulation and online experimentation, and evaluate the results to extract insightful information.Work closely with business, product and engineering teams to gain acceptance of proposed policies and designs, and realize models and algorithms in production-ready systems.Generate intellectual property with patent applications and publications at relevant forums.Stay current on published state-of-the-art techniques for online advertising and related fields.Required Skills/Experience:Ph.D. in Computer Science, Electrical Engineering, Statistics, Operations Research, Applied Mathematics, Economics or a similar field.Strong research experience in one or more of the following areas: machine learning, data mining, time-series analysis, forecasting, optimization, marketplace, pricing and revenue management.Strong ability to execute end-to-end development efforts: problem analysis, data collection, model building, algorithm design and performance evaluation.Hands-on skills in cleaning, manipulating, analyzing, visualizing and modeling large data sets.Proficient in one or more programming languages, such as Java, C++, R, Matlab, Python or Perl.Strong oral and written communication skills.Preferred Skills/Experience:Familiarity with online advertising.Knowledge of Hadoop programming environments. Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for all employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process by contacting us at hr-benefits@oath.com, or call us at 1-866-772-3182.  Submission of this information is voluntary and refusal to provide it will not subject you to any adverse treatment.  Currently work for Oath? Please apply on our internal career site. ​"}