{"jobID": "2614517485", "jobLocation": "Washington_DC", "jobTitle": "Science Test Developer", "companyRating": null, "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": null, "jobDescription": " The Assessment Program at AIR is a well regarded organization that is growing rapidly. We focus on providing our clients with customized assessments that not only measure student achievement against state standards, but also provide meaningful score reports that can help students, parents and educators address any areas of student weakness. Our environment is fast-paced and requires people at all levels who are willing to roll up their sleeves to get the work done on time while maintaining high quality.  We are currently seeking a Science Test Developer/Item Writer to join the Assessment Programs Science Content Team in the Washington, DC office (relocation assistance is available). The Science Content Team is responsible for the creation of all science test materials, products, and services for state and other assessment programs.  The Science Test Developer will work within one of the science teams to develop test items for online and paper-pencil state assessments. Duties for this position include:Writing, revising, and reviewing test items based on scientific accuracy and grade-level appropriateness, with an eye toward fairness and project specificationsReviewing and revising internal and vendor-created items to meet internal and external deadlinesLeading or assisting the leading of client and committee meetings in which stakeholders review the scientific content, fairness, and grade-appropriateness of test itemsLeading or assisting the leading of constructed-response scoring activities to identify exemplar student responses, monitor scorer training, and audit scoring sessionsLeading or assisting with the leading of constructed-response rubric validation activities with stakeholders to ensure that item rubrics are functioning as intendedDeveloping machine-scored items of various typesHelping to resolving client feedback on test items, test forms, and test blueprintsAssembling and reviewing field test and operational test formsHelping to design and resolve client feedback on test specification documents, style guides, test blueprints, and specific student aidsMasters degree in a science discipline or science education with 1+ years of relevant professional experience.Research experience in a scientific discipline, as demonstrated through peer-reviewed publications and conference presentations, is highly desirable.Excellent, specific science subject area knowledge is required. A background in physics, biology, or earth science is preferred.Experience in assessment is desirable.Classroom instruction experience is desirable.Must be comfortable with and interested in learning new skills .Excellent verbal and written communications skills are required.An ability to pay strict attention to detail is essential.An ability to deal diplomatically with clients and stakeholders is essential.An ability to prioritize tasks and meet tight deadlines is essential.An ability to work collaboratively with a team is essential Required travel for this position ranges from 1 week to upwards of 6-8 weeks per year. Candidates should be able to travel as required for 1 to 2 weeks at a time, especially in the summer. However, travel will not be limited to the summer months. LI-DG1"}