{"jobID": "2837384024", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst Specialist", "companyRating": "3.5", "companyInfo": {"Website": "www.disys.com", "Headquarters": "Mc Lean, VA", "Size": "1001 to 5000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Job DescriptionFortune 500 Mortgage Company local to the McLean, VA area is looking for a Data Analyst Specialist This position will work closely with Engineering team members, business partners, and IT teams to support a range of small- to medium-sized projects. Looking for a self-motivated leader who can provide system analysis and project management support.  Competitive hourly rate and initial 6 month contract with potential for extension or perm. placement Scope of Work/Tasks:Create business requirement documentsCreate UAT test cases and any related artifactsDocument test results and training materialsCoordinate deployments by creating pre- and post-deployment tasksWork with developers to ensure defect fixes and issue resolutionTrack project status and report to senior managementDevelop and troubleshoot SQL queries; support creation of DDL scriptsDevelop solutions using tools like Dataflux, Python, and shell scripts.Preferred Skills:Strong data and financial analytical skillsKnowledge of fixed income products, especially mortgagesExperience with databases (Sybase, DB2, SQL Server, Oracle)Previous experience supporting multiple concurrent efforts/projects in various capacitiesApplication development and support experienceExperience with tools likeDataflux, Python, and Schell scripting.Excellent interpersonal, team, verbal, written and listening skills This position does not provide visa sponsorship. No C2C* Job Requirements  Digital Intelligence Systems, LLC. is an Equal Opportunity Employer, M/F/D/V. We do not discriminate against any employee or applicant because they inquired about, discussed, or disclosed compensation. Email recruitinghelp @ disys.com to contact us if you are an individual with a disability and require accommodation in the application process.Digital Intelligence Systems, LLC. is an Equal Opportunity Employer, M/F/D/V. We do not discriminate against any employee or applicant because they inquired about, discussed, or disclosed compensation. Email recruitinghelp @ disys.com to contact us if you are an individual with a disability and require accommodation in the application process."}