{"jobID": "2835272622", "jobLocation": "Jersey_City_NJ", "jobTitle": "Senior Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.teksystems.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Adecco, Apex Systems, Robert Half Technology"}, "estimatedSalary": null, "jobDescription": "** No 3rd Party Vendor*****Client wil not Sponsor***Job Description: Technical Analyst required to work within the Global Markets Regulatory Disclosures Technology group and perform functional/data analysis and formulate solution design for a complex rules based strategic platform. Job functions include complex product analysis of Equity Linked and Credit Risk data in order to develop compliance solutions using data originating from the front office trading and risk platforms, and additional functional changes required to the systems to process, and transform this data. Requirements:5+ years' Experience in business analysis and extensive product knowledge within Global Markets.Experience in business driven projects impacting trading platforms /transaction managers / finance sub-ledgers platforms / regulatory reporting platforms / risk platformsExtensive experience in playing a key role in complex high volume data processing and migrations within/between systemsExcellent written and verbal communication skills and capable of producing high quality, clear business friendly design specifications that can also be easily interpreted by technology peersProficient in SQL for data analysis related activities Technically Capable - Strong appreciation of how software is designed and developed, tested and released end to end (SDLC) About TEKsystems:Join TEKsystems®, a leading IT staffing, IT talent management and IT services firm, and get your career on the fast track. We have more than 100 offices worldwide, and we partner with over 6,000 clients and place over 80,000 consultants per year. At TEKsystems, we seek to understand our consultants' skills, goals and interests, allowing us to present targeted job opportunities on a contract, contract-to-hire or direct placement basis. TEKsystems' leadership in the market stems from our sincere and personal commitment to driving the success of our customers, consultants and each other. - provided by Dice  Senior Business Data Analyst"}