{"jobID": "2829251071", "jobLocation": "Princeton_NJ", "jobTitle": "Senior Business Data Analyst (Abbott Point of Care)", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. *Abbott Point of Care develops, manufactures and markets critical medical diagnostic and data management products for rapid blood analysis. The** **_i-STAT System_** **is an advanced, portable diagnostic tool that provides real-time, lab-quality results within minutes to accelerate patient-care decision-making. The** **_i-STAT System_** **has the industry?s most comprehensive menu of tests in a single, with-patient platform, including tests for blood gases, electrolytes, chemistries, coagulation, hematology, glucose, and cardiac markers.***POSITION SUMMARY** The Senior Business Data Analyst will play an integral role in the development, implementation and execution of key strategies that drive activities leading to overall success of the APOC business. The Analyst will work with both IT and business to propose, design, implement and integrate key tools that drive commercial excellence. This position reports into the APOC Head of IT. *LOCATION** The position is located at Abbott Point of Care (APOC) US Commercial Headquarters in Princeton NJ. No relocation assistance is available. *POSITION RESPONSIBILITIES** + Review requirements, design and propose solutions using tools based on CRM, CLM, and variety of analytics tools for sales processes.  + Understand commercial KPI requirements and propose reports and analysis capabilities for the US Commercial Organization.  + Gathers and publishes information related to historical, current and future performance.  + Gather requirements and design sales reports/custom sales analysis tools to meet sales management business objectives.  + Analyze data on historical sales and trends to forecast future trends.  + Create daily, weekly and monthly performance reports and calculate key performance indicators.  + Create sales reports to address areas of focus for monthly forecasting, Annual and Quarterly Area Business Reviews.  + Use business intelligence tools to query sales information from the data mart Marketing.  + Create dashboards to measure launch strategy success and provide sales analysis to highlight areas of opportunity.  + Partners with field sales and US Commercial Marketing to understand their needs and help them make the best possible strategic decisions.  + Collaborate with Commercial Marketing to track/manage Sales and marketing promotional activities.  + Collaborate on identified ad hoc business problem-solving requests.  + Understand and comply with applicable EHS policies, procedures and guidelines.  + Responsible for implementing and maintaining the effectiveness of the Quality System.  + Adhere to and promote Abbott Code of Business Conduct *JOB REQUIREMENTS** + Bachelor?s Degree in Business, Accounting or Finance.  + Advanced degree preferred.  + 5+ years of combined experience in business, accounting, or finance.  + Advanced Excel, Salesforce.com and PowerPoint knowledge is mandatory.  + Knowledge on analytics tools (e.g., QlikView, Power BI).  + Level of analysis requires advanced understanding of data and utilization of advanced mathematical formulas and Business Analytics in reports. *KEY COMPETENCIES INCLUDE** + Be self-disciplined and self-directed - Ability to develop strong networks  + Aptitude to overcome obstacles - Maintain high work ethic  + Manage within specified budget - Operate with openness and honesty  + Consistently meet commitments - Use good business judgment and negotiation skills  + Set high personal and professional standards - Prioritize and manage time effectively  + Network and leverage resources across company and industry  + Lead/facilitate problem-solving  + Develop clinical champions for product - Overcome objections from key areas  An Equal Opportunity Employer  Abbot welcomes and encourages diversity in our workforce.  We provide reasonable accommodation to qualified individuals with disabilities.  To request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}