{"jobID": "1355825949", "jobLocation": "Cranbury_NJ", "jobTitle": "Sr. Scientist - Upstream Process Development", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " SUMMARY We are currently seeking a candidate with 2 - 4years with hands-on experience in microbial recombinant protein expression; including expression system construction and fermentation process development. The applicant must have strong interpersonal skills and the desire to work in a high pace biotech environment. RESPONSIBILITIES This position will directly report to the Associate Director of Upstream Process Development with responsibilities including but not limited to: Cell and Molecular Biology -Evaluate various Prokaryotic strains for optimal localization and expression of recombinant proteins. -Have a working knowledge and ability to construct microbial expression systems (promoters, secretion systems, induction systems, etc.) -Sequence verification -PCR, primer design, DNA extraction from bacteria -Restriction digests, ligations, transformations -Large-scale DNA preparation Fermentation Process Development -In this role you will be responsible for the running of microbial fermentations (primarily E.coli) in shake flasks and 10-L fermenters for the expression of recombinant proteins (with CHO cell culture experience a plus). -Define and design experimental processes and protocols, operates (or directs others in operation) bioreactors/fermentors and/or recovery equipment. -Must possess working knowledge of standard production process methods i.e. batch and fed-batch fermentation methodology. -Develop research strategies, approaches and plans for fermentation projects and manage day to day fermentation research operation to meet project goals and timelines -Manufacture recombinant protein (0.5 - 2 g) to support early discovery POC models. -Compile and analyze experimental data in order to develop, optimize and monitor process performance. -Apply the latest knowledge of microbial physiology, secondary metabolism and biosynthetic pathways to media design, process optimization and strain improvement. -Collaborate with scientists, engineers, and technicians in discovery and other departments. -Evaluate fermentation options, technical feasibilities, and costs for new projects. Desired Key CompetenciesAbility to understand and execute on the company’s mission and values.Provides supports to the grouplead to meet project timelines in a fast-paced team environment.Maintain a high degree of accuracy and attention to detail.Well organized and capable of clear communication through technology.CultureFoster a strong cross departmental team interactive culture.Support business development and strategies activities as required.Support solutions for new innovation and collaboration with peersin company.Follow all company best practices to minimize cost and meet budgetary requirements while maintaining quality."}