{"jobID": "2837131134", "jobLocation": "Burbank_CA", "jobTitle": "(Voice) Data Analyst No C2C", "companyRating": null, "companyInfo": {"Website": "www.imssvs.com", "Headquarters": "Huntington Beach, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Client seeking a (Voice) Data Analyst for a Contract position in the Glendale, CA area.  No Corp to Corp Qualifications:Data Analyst experienceAdvanced Excel SkillsExcellent communication skillsSAI experiencePrefer CALL Manager (system) experience (similar experience of where all phones in a company are connected).Description:Perform data analysis via spreadsheet / data base queries report and provide additional insightIdentify patterns in the data and formulate classification rulesReconcile data entries between systems and identify ways to automateManage discrepancies/corrections from users and update systemConfirm discrepancies remain accurate month over monthCreate new reporting for users to confirm data in a consumable fashionCommunicate with multiple stakeholders and break down issues This person will be working with 2 systems. Call Manager system and the SAI system. When a phone is requested they go through ATOS. This request goes into the Call Manager system. They get reimbursed by the department for phones using their SAI System. Right now there is a discrepancy between these two system; essentially they may have more phones out there than they are billing for. This person will be responsible for reconciling this data and coming up with a process to make sure these two systems are in sync. They need to understand VOICE, but these two systems may or may not be common in the market and therefore they will have assistance in exporting this information into excel documents. The main thing they will be doing is reconciling these reports. They will be in communication with departments informing them that they have X amount of phones and that X amount of dollars will need to be collected for them etc.  If qualified and interested in this opportunity, please reply to JO#5974 with current resume, with hourly contract requirements"}