{"jobID": "2791266151", "jobLocation": "Folsom_CA", "jobTitle": "Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "Job DescriptionProvide expertise on database management/design to drive integration of business data, functions, and systems. Establish standards, guidelines, procedures, and other infrastructure necessary to support the objective of integration of data. Resolve performance problems. Plans and schedules daily tasks, uses judgement on a variety of problems requiring deviation from standard practices. Inadequacies and erroneous decisions would cause moderate inconvenience and expense. QualificationsYou must possess the below minimum qualifications to be initially considered for this position. Qualifications listed as preferred or additional will be considered a plus factor for applicants. Minimum Qualifications:This U.S. position is open to U.S. Workers Only. A U.S. Worker is someone who is either a U.S. Citizen, U.S. National, U.S. Lawful Permanent Resident, or a person granted Refugee or Asylum status by the U.S. Government. Intel will not sponsor a foreign national for this position.BS, MS or Advanced degree with expertise in analytics.Minimum of 1 year of experience developing complex queries in a variety of SQL languages MS SQL, Impala, MySQL and the ability to design complex visualizations to generate understanding from large datasets.Minimum of 1 year of experience in Linux.Preferred Qualifications:Knowledge of C++ / C, along with python & perl. Comfortable with data regression, classification, and outlier detection. DBA knowledge of query optimization, database optimization, indexing and backup. Knowledge of commercial tools used for model development or content creation.Inside this Business GroupAs the world's largest chip manufacturer, Intel strives to make every facet of semiconductor manufacturing state-of-the-art -- from semiconductor process development and manufacturing, through yield improvement to packaging, final test and optimization, and world class Supply Chain and facilities support. Employees in the Technology and Manufacturing Group are part of a worldwide network of design, development, manufacturing, and assembly/test facilities, all focused on utilizing the power of Moores Law to bring smart, connected devices to every person on Earth Other Locations US, California, Santa Clara;US, Oregon, HillsboroPosting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}