{"jobID": "2829641463", "jobLocation": "Forestville_MD", "jobTitle": "Physical Therapist Assistant - Full time", "companyRating": "3.1", "companyInfo": {"Website": "www.atipt.com", "Headquarters": "Bolingbrook, IL", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AthletiCo, Novacare Rehabilitation, U.S. Physical Therapy"}, "estimatedSalary": "33", "jobDescription": "Physical Therapy Assistant  ATI Physical Therapy is currently seeking qualified physical therapy assistant candidates to join our dynamic team and be remarkable with us. As an ATI physical therapist assistant, working under the guidance of a physical therapist, you’ll be part of the winning team providing exceptional care that yields remarkable results. In this role, you’ll assist with patient treatment, including following an individualized plan of care and providing treatment through all phases of physical therapy. You’ll ensure each patient receives red carpet care through a comprehensive, thorough and customized physical therapy regimen. Your professional communication skills and team approach will help foster a friendly and encouraging environment for your patients, resulting in remarkable outcomes.  Join the industry leader today and enjoy highly competitive benefits including best-in-class continuing education, performance based incentives, residency/fellowship sponsorship, robust in-house research opportunities, career advancement potential and complete insurance coverage including medical, vision, dental and life.  Job Description: 1. Ensure every patient receives a thorough and comprehensive customized physical therapy regimen, while receiving a unique experience. 2. Ensure fluid treatment progression via ongoing scheduling of patients. 3. With assistance of physical therapist, develop and implement physical therapy treatment programs based on each patient's particular needs. 4. Assist patients with all phases of physical therapy treatment and techniques. 5. Discuss treatment with patients and record patient conditions and responses to treatments in charts after each visit. 6. Complete daily patient care notes, progress notes, discharge notes and other required forms as requested by treating physicians or insurance, co-signed by physical therapist. 7. Provide continuous communication with referring physicians, physical therapists and athletic trainers regarding patient therapy and equipment. 8. Operate and apply knowledge of standard physical therapy equipment. 9. Ability to comply with ATI standards of operations and adhere to the core values of the company. 10. Perform other duties as assigned by management.  Required Skills  Associates Degree in physical therapist assistant program from an accredited physical therapy program and appropriate state licensure, certification or registration (per state requirements), current, and in good standing.  Required Experience  No experience required; new graduates are welcome to apply"}