{"jobID": "2790366185", "jobLocation": "Washington_DC", "jobTitle": "Principal Information Assurance Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.kingfishersys.com", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Government", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": "Principal Information Assurance Analyst, Pentagon, Arlington, VA Kingfisher Systems, Inc. specializes in providing a full range of Information Technology, Cybersecurity, Intelligence, and support services to the U.S. Government. Kingfisher Systems core competency is technology-enabled services, with a specific focus on national security. Since 2005, Kingfisher has established itself as a recognized and trusted mission partner whose mission is safeguarding sensitive information, operations, and programs for our Federal customers and warfighters. Position Description: Kingfisher seeks an exceptionally qualified Principal Information Assurance Analyst to join a very successful team supporting the Headquarters Department of the Army Office of the Deputy Chief of Staff G2. A successful candidate will possess a wide array of experience with Information Assurance /Information Management and Technology to include use and securing of operating systems, network infrastructure, software applications, web servers, and databases. The successful candidate must have experience with Authorization and Assessment of systems: As DoDIIS Certifier, the contractor must possess knowledge of Information Assurance regulations and instructions for the Department of Defense and the Intelligence Community to include the DOD 8510.01, ICD 503, AR 25-2, CNSSI 1253, NIST 800 Series, among others.Working Knowledge of Linux, UNIX, Windows, Virtual Machine, Networking, Database, Cloud Technologies.Audits networks and systems for vulnerabilities using Security Technical Implementation Guides (STIGs), ACAS/Nessus vulnerability scanner, and DISA SCAP to determine, analyze and mitigate findings for technologies listed above.Executes Risk Management Framework to ascertain information systems' security posture utilizing IA control validation activities and coordinated security testing.Reviews, analyzes, system security packages (i.e., SSP, SRTM, risk assessment, hardware and software lists, network diagrams, data flows, system change proposals, Nessus scans, test reports, POA&M;), configuration management and continuity plans. Develops, updates, maintains, and recommends authorization decision documentation based upon review and analysis of system packages for multiple networks at different levels of classification.Manages the system accreditation packages for each assigned information system and provides recommendations for their authorization.Position Requirements: The successful candidate analyst joining our very successful team will have experience and requirements meeting expectations below: Must possess certifications meeting IAM Level III in compliance with DoD 8570.01-M.Must have current Top Secret SCI clearance.Must have experience building and/or managing security authorization packages through the authorization process (DCID 6/3, DIACAP, RMF). Shall possess a wide array of experience with Information Assurance /Information Management and Technology to include use and securing of: Operating systems, network infrastructure, software applications, databases, and web servers, both physical and virtual.Required qualifications: IAM Level III Certification specifically CISSP Security Clearance:**Candidates must have an active TS/SCI **APPLY ONLINE AT:http://www.kingfishersys.com/search-current-job-openings/Kingfisher Systems, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, among other things, or status as a qualified individual with a disability."}