{"jobID": "2768997378", "jobLocation": "El_Segundo_CA", "jobTitle": "Associate Scientist I, Product Development", "companyRating": "2.9", "companyInfo": {"Website": "www.beachbody.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Beachbody, the leader of in-home fitness programs and nutritional products, is on the lookout for top-notch talent. We’re an equal-opportunity employer who offers competitive compensation, incredible benefits and perks, not to mention a laid-back office filled with smart, friendly people and positive energy. We also provide free Shakeology, onsite gyms, flexible work hours, and cool product discounts. Are you ready to help us achieve our goal of helping people live healthy fulfilling lives? Why is the Research & Development team important to Beachbody? As Beachbody continues to experience explosive growth, the R&D; team actively drives business and product advancements. We apply our food science training to stay on the cutting edge of nutrition/fitness while delivering impactful products that positively influence the lives of our consumers. What will you be doing at Beachbody as the Associate Scientist I?Execute the development of new and improved products, including prototype development, experimentation, product testing, data analysis, documentation and reporting.Organize raw materials and maintaining ingredient inventory and keeping lab area and equipment operationalDevelop specifications in PLM system for raw materials, formulas and finished productsConduct shelf life studies and analytical testing on prototypes, raw materials and finished products, including sensory evaluation, data analysis, and reportingCollaborate with Operations on ingredient qualifications, commercialization and manufacturingWe’d love to chat if you have…Bachelor’s degree in Food Science and Technology or equivalent2 years of product development experienceStrong attention to detailBackground knowledge of food science including ingredient functionality, health and nutrition, food manufacturing processes, microbiology, quality assurance principles, and market research practices Beachbody, LLC is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, citizenship status, religion, creed, age, physical or mental disability, sex, gender (including pregnancy, childbirth, breastfeeding or related medical conditions), sexual orientation, gender identity, gender expression, medical condition, genetic information, marital status, military and veteran status, or any other characteristic protected by federal, state, or local law.  To all recruitment agencies: Beachbody does not accept unsolicited agency resumes. Please do not forward resumes to our jobs alias, Beachbody employees, or any other company location. Beachbody is not responsible for any fees related to unsolicited resumes."}