{"jobID": "2829650030", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Senior Scientist I, Assay Development (ADC Discovery)", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": " Oncology is a key therapeutic  area for AbbVie, with a portfolio consisting of three marketed products  Imbruvica, Venclexta, and Empliciti and a pipeline containing multiple  promising new molecules that are being studied in nearly 200 clinical trials in  19 different types of cancer.  AbbVie is expanding its oncology  hub on the West Coast, with three sites in the San Francisco Bay Area (Redwood  City, South San Francisco, and Sunnyvale) focused on the discovery and  development of novel oncology therapies. More than 1,000 AbbVie scientists,  clinicians, and product developers with strong entrepreneurial roots work  across these three sites. They combine their expertise in immuno-oncology, stem  cells, and cell-signaling with their knowledge of bispecific antibodies,  antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to  discover and develop novel cancer treatments. This position is based at  Stemcentrx, AbbVie's South San Francisco, CA location. Description: Senior Scientist I ADC Discovery/Assay  Development  As part of a talented and  multi-disciplinary team advancing exciting new approaches to drug discovery and  development, AbbVie Stemcentrx is looking for a highly motivated scientist with  experience in small molecule and ADC screening and development. The successful candidate  will drive discovery work to understand small molecule potency and how it  relates to ADCs. Responsibilities will  include generation and review of small molecule cytotoxicity and mechanistic  data, coupled with analysis of subsequent ADC data to identify ideal  characteristics for ADC warheads.  Responsibilities: Lead efforts  to understand potency and mechanism of action of novel small molecules used as  warheads on antibody drug conjugates Work  cooperatively with multidisciplinary team to present results and guide strategySupport small  molecule (low/medium throughput) screening efforts by independently performing  assays to evaluate potency of compounds with diverse mechanisms of actionDevelop  biochemical assays to measure compound activityPlan and  execute in vitro targeted drug combination studiesIdentify trends  between ADCs and corresponding small moleculesMay include  cell imaging and ADC internalization and trafficking studiesProactively  seek out and incorporate novel ideas in line with the groups strategy to  better characterize our antibody targets, toxins and ADCsDraft IND  and patent documents and occasionally present at scientific conferences  and symposiumsQualifications:Ph.D in a relevant area, or MS or equivalent education with 8+ of experience, or BS or equivalent education with  10+ years of experience.Experience in small molecule screening, preferrably in ADCs, is required.Highly motivated, goal oriented  and independent scientist with proven technical expertise in small molecule screening  (cell and biochemical assay formats).Prior experience with ADCs and  working knowledge of bio-conjugation chemistry a plus.Experience with cell imaging  systems and flow-cytometry a plus.Proven management skills with track record of direct reports or  guiding and teaching scientific staff.Excellent oral and written  communication skills and a proven track record of working effectively in a  dynamic, collaborative, team-oriented setting.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}