{"jobID": "2824954743", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Who we are:Calico is a research and development company whose mission is to understand the biology of aging, and to help people to lead longer and healthier lives. We aim to combine the best biomedical science with cutting edge technology and computing. We are building a new and unique culture of true partnership between the best biomedical and computational scientists, within a company that is both a nimble startup but also has a firm financial footing.Position description: Biology is rapidly becoming a data science due to the exponential growth in high-quality biological and medical data. These data are transforming our understanding of biology and disease, but deriving valuable scientific insights requires careful analysis and interpretation of data done in close collaboration with computational and life scientists. Calico is seeking to expand our group of Data Scientists who are exploring diverse questions from a computational perspective; and who are developing methods which facilitate a deeper understand of data. As a data scientist, you will work cross-functionally with other individual contributors within computing, as well as researchers at Calico, on collaborative research projects which may be centered around biological questions, analytical methods, or engineering. We are seeking exceptional data scientists to join the group regardless of the specific research questions they have faced in the past. However, we are particularly interested in individuals with domain experience and interest in several specific data modalities and problems of interest to Calico:Using genomics to understand basic science questions in diseaseImproving methods for characterizing the metabolome, lipidome or proteome using mass spectrometryDeveloping causal models using high-frequency longitudinal measurements or observational health dataPosition requirements:Ph.D. in Bioinformatics, Computational Biology, Statistics, Biological Sciences, Genetics, Genomics, Computer Science, or equivalent preparation and experience6+ years of experience in data analysis, including at least 3 years of hands-on work experience with real data (either in an academic environment or in industry)Experience in high-quality software development, including familiarity with at least one relevant programming language (Python, R, C++, etc.) and with SQL databases, including in distributed and cloud environmentsSignificant experience with the application of statistical and machine learning methods, such as: regularized GLMs, Bayesian modeling, time series analysis, modern neural network architectures, and moreTrack record of effective cross-functional collaboration on complex projects involving people with very diverse backgrounds"}