{"jobID": "2809049936", "jobLocation": "Moorestown_NJ", "jobTitle": "Data Analyst - ON SITE", "companyRating": "3.5", "companyInfo": {"Website": "www.suntechnologies.com", "Headquarters": "Alpharetta, GA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "Job Code10569Job Title: Data Analyst - ON SITERequired Skills: R, SAS, Python, Matlab, SQL, Hive, Pig, SparkLocation: Moorestown, 08057,NJPay Rate: DOEDuration: 12 MonthsJob Description· To perform these duties, the Data Scientist will: design and develop methods, processes, and systems to consolidate and analyze structured and unstructured, diverse sources including big data sources.  · Develop and use advanced software programs, algorithms, querying and automated processes to cleanse, integrate and evaluate datasets and models complex business problems.  · Works with cross-discipline teams in order to ensure connectivity between various databases and systems. Identifies meaningful insights and interprets and communicates findings and recommendations.  · May develop information tools, algorithms, dashboards, and queries to monitor and improve business performance.  · Maintains awareness of emerging analytics and big-data technologies.  · Requires knowledge of various technical domains to including systems coding, various software programming languages, and deep mathematical calculation and algorithms to provide intricate analytic solutions to meet end user needs.  · Has various tool knowledge with both software development and engineering research to create models of relevancy.  · Experience designing efficient algorithms with programming languages and tools for data manipulation and statistical analysis.  · Experience designing efficient data mining and text mining frameworks with related tools.  Mandatory Skills:  · Previous experience in applying data science against open source media to support intelligence collection and data fusion.  · Bachelors in Mathematics, Statistics, Computer Science or equivalent  · Must have strong problem solving skills, business acumen, and demonstrated excellent oral and written communication skills.  · Preferred languages: R, SAS, Python, Matlab, SQL, Hive, Pig, Spark  · Able to work in a team environment  Desired Skills:  · Applying data science against open source media to support Intelligence collection and data fusion.  · Predictive Modeling  · Story-Telling and Visualization  · Distributed Computing  · Cloud - AWS and/or OpenStack  · Web Services/API knowledge (REST, GraphQL)  · Common data transport formats (e.g., JSON, XML, Parquet, Avro, Proto Buf)  · Basic understanding of Data Science concepts  · Experience with Agile development processes  · An interest and capacity to learn new skill sets  · Experience with Hadoop Ecosystem (e.g., MapReduce, Hive, Pig, Spark, HBase, Kudu, Impala, HDFS)  · Experience with Java and/or Python programming  · Experience with both SQL and NoSQL databasesRequired DetailsExperience: 2+ YearsTravel Required: NoClearance Required: NoContact DetailsContact Person: Asha BhatPhone: 678-203-2701Email: ashakb@suntechnologies.comURL: www.suntechnologies.com"}