{"jobID": "2710162162", "jobLocation": "Washington_DC", "jobTitle": "Director, Internal Oversight and Performance Assurance", "companyRating": null, "companyInfo": {"Website": "www.pcaobus.org", "Headquarters": "Washington, DC", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Nonprofit Organization", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0028  Post Date 3/29/2018  Title Director, Internal Oversight and Performance Assurance  Division Office of Internal Oversight and Performance Assurance  PT/FT Full Time  City Washington  State DC  Description Our MissionThe Public Company Accounting Oversight Board is a nonprofit corporation established by Congress to protect investors and the public interest by promoting informative, accurate, and independent audit reports and to oversee the audits of public companies and broker-dealers.Job DescriptionInternal Oversight and Performance Assurance (IOPA) provides internal auditing and examination of the operations of the Public Company Accounting Oversight Board (PCAOB) to help ensure the internal efficiency, integrity, and effectiveness of those operations and to detect and deter any waste, fraud, and abuse. The Director of IOPA leads and manages the IOPA team in carrying out all aspects of IOPA’s charter. The Director reports directly to the PCAOB Board. To foster independence and accountability this position has a five-year term limit.ResponsibilitiesPlans and directs a program of internal audits, reviews, and inquiries consistent with IOPA’s charter, Board priorities, the PCAOB’s Mission and Strategic Plan, and ongoing assessments of risk. Establishes and implements IOPA operating policies and procedures consistent with applicable guidance; including the Sarbanes-Oxley Act, PCAOB rules and bylaws, the PCAOB code of ethics, and professional standards. Conducts and/or oversees internal audits, reviews, and inquiries to help assure the efficiency, integrity, and effectiveness of PCAOB programs and operations and to detect and deter any waste, fraud, and abuse. Establishes policies and procedures to ensure that IOPA audits, reviews, and inquiries are conducted in accordance with professional standards. Prepares written and oral reports for the Board on the results of IOPA audits, reviews, and inquiries. Prepares an annual risk assessment of PCAOB programs and operations. Prepares and executes an annual internal audit plan, approved by the PCAOB Board, based on its annual risk assessment and reports to the PCAOB Board on the deficiencies and weaknesses and makes recommendations for remediations and enhancements. Establishes and periodically updates a strategic plan for IOPA that sets forth goals, performance metrics, and milestones consistent with IOPA’s charter. Prepares an annual report on IOPA’s activities and the results of IOPA’s assessment of major management challenges facing the PCAOB. Directs and supervises IOPA Staff, including goal setting and performance management. Coordinates with administrative offices to recruit and retain skilled staff and other resources to fulfill IOPA’s mission. Performs other duties consistent with IOPA’s mission and charter. Reports to the Board, and upon the direction of the Board to the SEC and other governmental authorities, on the status and results of its performance and quality assurance reviews and inquiries.  Requirements Qualifications15 or more years of relevant experience, including five or more years of significant executive or senior manager experience focused on professional and/or public accountability. Examples may include a corporate office of internal audit, a federal government office of inspector general, or equivalent. Advanced degree or certification in public administration, business, law, accounting, or other related fields is required. Knowledge of professional internal auditing standards, including Government Auditing Standards (“The Yellow Book”) and/or the Institute of Internal Auditors’ International Professional Practices Framework. Proven skills and in-depth experience in gathering sufficient, appropriate evidence to support audit objectives and performing relevant analysis to make appropriate judgments and conclusions. Familiarity with conducting internal inquiries and investigations. An ability to clearly articulate a position and support same with sound logic, appropriate evidence, and objectivity. Able to effectively represent the organization to a variety of both internal and external constituencies. A hands-on style and attitude as well as the ability to operate independently or in a team. Moreover s/he must be able to function effectively in a technologically sophisticated environment. Experience in the area of financial regulation and strong communication, writing, and interpersonal skills. Proven leadership skills that include the ability to deal effectively with people, maintain confidentiality and personal discretion, make decisions and find solutions to encourage and support change, and maintain a nimble regulatory approach that proactively identifies new and emerging issues that put investors and the public interest in the preparation of independent audit reports at risk. Able to uphold the mission and vision of the Board in all of his/her duties, maintain the highest standards of integrity and professionalism, and possess unimpeachable ethics. A self-starter able to administer a number of open, ongoing reviews and assignments at any one time, where some assignments are routinely unstructured, requiring autonomy and independent judgment. Our ValuesThe PCAOB encourages a spirit of cooperation and teamwork, and fosters an environment of professional growth where employees can exercise their leadership ability, creativity, technical competence, and public interest focus in helping the PCAOB fulfill its mission.Equal Employment OpportunityAll PCAOB employees are entitled to equal opportunity and a professional work environment, free of discrimination and harassment. A workplace free of discrimination is fundamental to professional success and to the PCAOB's mission. The PCAOB will consider for employment all qualified applicants with criminal histories in a manner consistent with applicable law. #LI-DD1-R .ButtonClassNavigation, .ButtonClassDataModification, .ButtonClassTools, .ButtonClassFormReset { width: 150px; } .ButtonClassNavigation:hover, .ButtonClassDataModification:hover, .ButtonClassTools:hover, .ButtonClassFormReset:hover { width: 150px; } .ButtonClassNavigation:active, .ButtonClassDataModification:active, .ButtonClassTools:active, .ButtonClassFormReset:active { width: 150px; }  Send This Job to a Friend This site is operated by UltiPro. http://www.ultimatesoftware.com. Use of this site is governed by Ultimate Software Group’s policies and practices, including its Privacy Policy, which can be found at http://www.ultimatesoftware.com/Privacy-Policy."}