{"jobID": "2824642049", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.sweetgreen.com", "Headquarters": "Culver City, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Chopt Creative Salad Company, CAVA, Tender Greens"}, "estimatedSalary": "58000", "jobDescription": "About sweetgreen: sweetgreen is on a mission to build healthier communities by connecting people to real food. We passionately believe that real food should be convenient and accessible to everyone. Every day in each sweetgreen, our 3,500 team members make food from scratch, using fresh ingredients and produce delivered that morning. And in our local communities, were committed to leaving people better than we found them. Were in the business of feeding people, and were out to change what that means.  We are building our data science team to deliver thoughtfully designed, data-driven customer experiences and first-class internal operations.  We are seeking an Data Analyst to provide critical support to the business as we undergo a wholesale digital transformation. The opportunity to facilitate a fast-growing companys consumption of internal and external data all for the mission of feeding more people better food should excite you. You will use your comprehensive analytical skillset to guide and unite the organization in its consumption of quality data-driven insights, helping to deliver our strategic goals. Responsibilities: The Data Analyst is responsible for providing data tools and analysis-based insight that promote data adoption across the company. From our customer-facing digital team to our back of house operations team, you will create data solutions that make easy the search for actionable business insight and the creation of essential operational tools. This role is for you if you love collaboration, excel at end-to-end analysis, and have the business acumen and technical skills to make the two line up. Wrangle data from disparate sources to develop in-depth understanding of our internal operations and customers, identify areas of opportunity, and execute projects to produce efficiencies on the business side and loyalty on the customer sideProvide internal stakeholders with data-driven stories of both our operators and customers to drive strategic decision makingWork collaboratively across the company to build data tools (aggregated views, automated reports, ad hoc analyses, etc) that provide actionable insightHelp create a high-functioning and healthy data ecosystemDemonstrate database technical proficiency in the areas of performance, reliability, and functionalityDevelop data models for applications, metadata tables, views or related database structuresCollaborate with program manager, data platform engineers, analysts, leadership, and key stakeholders to understand business requirementsDesired Experience:1 or more years in quantitative analysis roles; experience with predictive modeling a plus1 or more years using statistical software (R, Python, SAS, etc)SQL proficiency, especially with Amazon Redshift, a big plusTableau proficiency a plusAbility to think strategically about business, product, and technical challengesInterest and dedication to the healthy food revolution a huge plusWhat you'll get:Competitive pay + bonus plan granted based on performanceHealth, dental + vision insuranceFlexible PTO, because we respect the need for work/life harmonyAn opportunity to make a real impact on the people around you, both by growing them and by connecting them to real foodTo live the sweetlife and celebrate your passion + purposeA collaborative family of people who live our core values and have your backA clear career path with opportunities for development, both personally and professionallyOur annual Impact Retreat offsiteFree sweetgreen swagComplimentary sweetgreenCome join the sweetlife! sweetgreen provides equal opportunities for everyone that works for us and everyone that applies to join our team, without regard to sex or gender, gender identity, gender expression, age, race, religious creed, color, national origin, ancestry, pregnancy, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, any service, past, present, or future, in the uniformed services of the United States (military or veteran status), or any other consideration protected by federal, state, or local law."}