{"jobID": "2820009695", "jobLocation": "Washington_DC", "jobTitle": "Regional Human Resources Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.pandacareers.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Summary of Job Scope and Expectations: The Regional HR Manager position is responsible for serving as a strategic HR partner to Operations leadership (VPO/RDO/ACO/MUM) in assigned region(s), developing and coaching Operations management, partnering in People Planning, developing and executing staffing plans, and providing training courses to leadership and associates as required. This position also facilitates resolution of associate relations issues. This position is typically responsible for 80 – 120 stores. Essential functions: The essential functions in this job description are not all-inclusive of this job’s duties and responsibilities. Reliable and dependable attendance is required.  Descriptions  • Partners with Operations leadership (primarily VPOs, RDOs, ACOs, and MUMs) in assigned region(s) in the facilitation of People Planning involving the development and coaching of Operations management; evaluates internal candidates for vacant/new positions and identifies high potential associates; participates in panel interviews to build alignment. Conducts field visits and interviews to identify opportunities for improved retention. 30%  • Coaches Operations leadership on associate relations to achieve problem resolution without litigation; conducts timely and thorough investigations involving associate complaints and disputes and prepares documentation of issues; resolves simple issues but involves Field HR Directors in achieving resolution of complex associate relations issues or refers issues to the Office of Dispute Resolution in the Support Center. 35%  • Assists Operations leadership in development and execution of Regional Strategic Plan to ensure both an internal and external pipeline of candidates; forecasts staffing needs to fill vacant Operations management positions on a timely basis to support company growth; Participates in Open House events, and career fairs, supported by Recruiters at the Support Center. 5%  • Advises Operations leadership on conducting effective associate performance evaluations and on assisting associates with career and personal development.10%  • Follows up with new hires thru Keep In Touch Program to promote an understanding of Panda’s Mission, Vision, Values, and Culture. Follows up with new hires to ensure adequate and appropriate training opportunities and encourage their participation. 5%  • Assists/coordinates with the Decentralized Learning Manager, who provides a variety of local training and development sessions for Operations management to enhance their capabilities, including 7 Habits, Sexual Harassment, Interviewing Skills, Conducting Effective Performance Reviews, Creating Individual Development Plans, etc. 15%#LI-PA1Bachelor's degree required, business and/or HR majors preferred.Minimum seven years of HR experience, with a minimum of five years HR Generalist experience in associate relations, training and development, recruiting, and people management or equivalent.Successful completion of annual store training.Knowledge, Skills, and Abilities:• Knowledge of a broad range of HR functions (training and development, associate relations, staffing, performance management) Knowledge of HR laws and regulationsAbility to partner with and coach/advise Operations leadership (VPO/RDO/ACO/MUMAbility to collaborate with Operations leaders and associates to facilitate win-win problem resolutionHands-on experience addressing an organization’s capabilities in a field environment, ability to work remotely and independentlyComputer proficiency, including Microsoft Office Suite and the Taleo systemStrong critical/analytical thinking, communication, listening, and assessment skillsAbility to demonstrate and teach Panda’s Mission, Vision, Values, and CultureCompetencies:Developing Direct Reports and OthersMotivating and Inspiring OthersBuilding Effective TeamsCaring about Direct Reports and OthersBusiness AcumenHiring and StaffingCommand SkillsSelf KnowledgePeer RelationshipsListeningIntegrity and Trust  Success Measures:  • Feedback from Operations leadership (VPO/RDO/ACO/MUM) on effective partnering to develop and retain talent (360 reviews, feedback through Field HR Directors)  • Improved AIM survey results for Operations associates  • Region fully staffed, especially at management level  • Reduction of associate relations issues and litigation Potential Career Progression:  The following job titles or job categories are examples of potential career opportunities and are not intended as a guarantee of promotion. These career paths can change at any time.  • Senior Regional HR Manager or Support Center HR Manager  • Support Center HR Specialist (Staffing or Learning & Development)  • Operations management  · Travel and store environment, 75%-plus (local and overnight), varies by region(s)"}