{"jobID": "2806276756", "jobLocation": "Parsippany_NJ", "jobTitle": "R&D; Technical Scientist", "companyRating": null, "companyInfo": {"Website": "www.pinnaclefoods.com", "Headquarters": "Parsippany, NJ", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (PF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " General Mills, Conagra Brands, The J. M. Smucker Company"}, "estimatedSalary": null, "jobDescription": " At Pinnacle Foods we are at the top of our game and the key to our success is clear. Everything we do is driven by our purpose: unleashing brand potential, dynamically evolving and improving our already beloved products to bring more convenience, taste, nutrition, and joy to today's consumers.  The results? Our well-recognized products are found in 85% of American households and are leaders in their respective categories, holding the #1 or #2 market share position in 10 of the 14 categories in which we compete — and we're just getting started. We are committed to adding value through strategic growth that synergizes our portfolio of \"Leadership\" and \"Foundation\" brands and plays to our strengths in R&D;, consumer insights, and senior management experience. SCOPE OF POSITION: A R&D; Technical Scientist responsible for assisting plant teams with technical guidance in both product and process improvements for existing products by developing project scope, providing technical recommendation / solves and troubleshooting as needed. This position will report into the Sr. Director of Technical Service, R&D.; ESSENTIAL DUTIES AND RESPONSIBILITIES:Manage plant improvement projects as needed across all categories.Develop project scope, design, assumptions and data driven success criteria.Conduct trials at both production facilities and pilot plant as needed.Interpret results and develop an understanding of how to translate to possible solutions.Write technical reports and maintains accurate and complete technical records.Optimize process / product and publish troubleshooting guide.Learn and utilize the online Technical Documentation System.Utilize in-depth knowledge and problem solving skills of food manufacturing to achieve results.Work in collaboration with cross functional team membersEnsure compliance with regulatory, quality and product safety.SKILLS & EXPERIENCE:3-5 years of Food Product Development experienceDemonstrated ability to function effectively in fluid, fast-paced situations, with the personal leadership to influence and positively motivate others. Creative problem solving skills.Experience in development and commercialization of new products and /or support of operations strongly desired. Retail launch of sauces, meals, salad dressings, and low acid foods is preferred.Demonstrated technical competence in the areas of ingredient functionality and food formulationExperience in testing or commercializing food products at manufacturing plant.Ability to communicate and clearly write technical information.Strong technical/analytical skillsAbility to interact with others in both manufacturing, and office environmentGood time management and multitasking skillsComputer skills that include Word, Excel, PowerPoint, StatisticsSUPERVISORY RESPONSIBILITIES:NoneEDUCATION:S. / M.S. Food Science or Chemical Engineering or related field.TRAVEL:Travel 50-75% Pinnacle Foods is an Affirmative Action/EEO Employer – qualified applicants will be considered for employment without regard to protected veteran or disability status, race/color, religion, gender, national origin, age, sexual orientation, gender expression, gender identity or any other legally protected basis. #LI-BN1#GLDR2018"}