{"jobID": "2815453819", "jobLocation": "Chicago_IL", "jobTitle": "Data & Analytics Manager", "companyRating": "4.1", "companyInfo": {"Website": "www.kirkland.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1909", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": "About Kirkland & Ellis Kirkland & Ellis LLP is a preeminent, full-service law firm with offices around the world and a staff as diverse as the practice areas we support. Our clients range from Fortune 100 companies to medium and small corporations, financial institutions, and private equity firms. Known for our commitment to excellence, Kirkland strives to provide superior service to our clients as well as our fellow employees. From Information Technology to Human Resources, Paralegal Services to Business Development, Kirkland offers non-attorney professionals challenging careers in a variety of functional areas. Whether starting or growing your career, Kirkland can offer a performance-driven culture filled with bright and innovative teams of co-workers. Essential Job Functions As a member of the Firmwide (FW) Legal Recruiting and Development Department, the Data & Analytics Manager will develop and provide analytics that answer critical questions for the firm, extrapolate trends, and tell a story. This role will partner with Legal Recruiting and Development Department (“LRD”) team members to provide key leaders within the firm with insightful visibility that allows for informed business decision-making.  The Analytics Manager will have the opportunity to shape and define the overall talent management analytics and data strategy/roadmap with the goal of providing firm leadership with understanding to answer key strategic questions. In this role, the Manager will be responsible for selecting and implementing advanced statistics, methods, and tools that enable a new level of clarity into metrics and trends by gathering data across multiple sources within all Legal Recruiting & Development channels (Recruiting, Training, Professional Development, Alumni Engagement, and CareerLink).  Key questions for the person in this role include What are best practices in the area of Human Resource (HR) Talent Management (TM), and Learning & Development (L&D;) analytics?What is the best strategy to automate the collection of talent data across various sources?What innovative talent analytic tools, technology, and templates will take the firm and LRD Department to the next level of visibility and data-driven decision making?How and what metrics will build an introspective storyline to help solve evolving business challenges and drive key initiatives forward to improve the firm’s productivity and results?How will we present workforce data models and metrics in a visually appealing format that is easily digestible by firm leadership (dashboards, reports, etc.)?How will/should we integrate analytics as a feed into larger enterprise/firm data?What is the level of frequency at which we will report, measure, and inform with a standard analytical dataset?ESSENTIAL FUNCTIONSDevelop predictive modelling and trend analysis tools using advanced statistics that anticipate firm needs and answers, and provide real-time answers to those questions.Develop insightful dashboards and tools that management can use to produce informed business decisions. Leverage reporting/metrics dashboards, presentations, graphics & reports to give visual representation to key LRD business data.Develop and automate data sets for the purpose of data mining and analysis, leveraging exploratory data analysis, predictive analytics, and data visualization.Understand and extract meaning from complex data relationships and develop reports to enable effective use of the resulting knowledge.Import, cleanse, transform, validate, aggregate, and analyze data from various sources with the purpose of making conclusions about industry trends and best practices.Stay abreast of innovation, trends and best practices surrounding the suite of HR, TM, and L&D; analytics.Look for key trends and opportunities within LRD data - design projects, goals, and outcomes to drive key initiatives forward to improve firm results. Focus on automation of current processes to scale for the future.Effectively communicate findings and complex analytical solutions effectively to upper management using presentations or dashboards that tell the story of findings from analytics. Conduct analysis, summarize key findings and trends, and produce data sheets, graphics and presentations.Function as an integrator between business needs and technology solutions and help create technology analytics and metrics solutions.Drive deep data, statistical, and predictive analytics and ensure analytical excellence across the team.OTHER FUNCTIONSPerform business analysis tasks to determine business needs, and translate them to conceptual and technical system requirements.Become subject matter expert in all the data processes and workflow.Communicate resource plans and issues to management on a regular basis and as directed or requested, to keep management informed on the progress of project(s).Any other functions/duties as assigned by management.Qualifications & RequirementsEducation, Work Experience, SkillsBachelor’s degree required, Master/MBA preferred. Concentration in math, statistics, computer science, information management, or equivalent experience in a related field. Require 7-15 years of analytical experience in similar setting, law firm or professional services strongly preferred.Candidates must have strong interpersonal and communication skills, project management and change management experience, and the ability to thrive in a fast-paced environment. Skilled in getting things done and overcoming obstacles to reach the goal. The ability to work effectively with all levels of management, and across all Kirkland departments and offices, is required.Significant skills in advanced data analytics and statistic tools (SSRS and otherwise), data query languages including SQL, and Microsoft Office. Broad exposure to navigating the aggregation of various large data sets for purpose of analysis.Strong ability to pull data from numerous sources and to create presentations for all levels of management. Ability to use data mining and analysis to compile and creatively display data. Ability to leverage presentation skills and visual tools to extract data and tell a story at various levels or audiences.Ability to extrapolate big ideas from data analysis, identify the “why” in their work, serve as a subject matter expert, partner across internal teams, and have a natural ability to lead.How to Apply Thank you for your interest in Kirkland & Ellis LLP. To complete an application and submit your resume, please click \"Apply Now.\" Equal Employment Opportunity All employment decisions, including the recruiting, hiring, placement, training availability, promotion, compensation, evaluation, disciplinary actions, and termination of employment (if necessary) are made without regard to the employee’s race, color, creed, religion, sex, pregnancy or childbirth, personal appearance, family responsibilities, sexual orientation or preference, gender identity, political affiliation, source of income, place of residence, national or ethnic origin, ancestry, age, marital status, military veteran status, unfavorable discharge from military service, physical or mental disability, or on any other basis prohibited by applicable law. Closing Statement The www.kirkland.com job postings and recruiting mailbox are for candidates only. If you are a recruiter, search firm or employment agency, and do not have a signed contract with Kirkland & Ellis LLP (\"K&E;\") and have not been asked specifically to submit candidates, you will not be compensated in any way for your referral of a candidate even if K&E; hires the candidate. Direct contact with K&E; employees in an attempt to present candidates is inappropriate and will be a factor in determining any future professional relationship with the Firm."}