{"jobID": "2758531675", "jobLocation": "N_o_n_e", "jobTitle": "Quantitative Research Analyst", "companyRating": null, "companyInfo": {"Website": "www.invesco.com", "Headquarters": "Atlanta, GA", "Size": "5001 to 10000 employees", "Founded": " 1935", "Type": " Company - Public (IVZ) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Vanguard, BlackRock, Fidelity Investments"}, "estimatedSalary": null, "jobDescription": "Quantitative Research Analyst(Job Number: 20747)DescriptionInvesco is a leading global asset management firm with more than $917.5B* in assets under management. We provide our retail and institutional clients a diverse and comprehensive range of investment capabilities to help people get more out of life. Invesco is publicly traded on the New York Stock Exchange (IVZ) and has about 7,000 employees in over 20 countries.  (*As of September 30, 2017) Job Purpose (Job Summary): The Quantitative Analyst is responsible for conducting quantitative and statistical analysis on investments of various assets classes and can convey this research to internal clients in a practical, concise manner. The Analyst will focus on our portfolios and client base in Canada as his primary responsibility. Key Responsibilities / Duties:Generates new ideas and investment concepts for research that impact the investment processPerform quantitative and statistical analysis of current and potential holdings in multiple asset marketsWorks with portfolio management team to assess securities within investment objectives and fund restrictions for the retail and institutional portfolios.Design, construct, test and implement tactical and strategic allocation models and expand strategic forecasts coverageResearch various topics including stock selection, macro forecasting and multi-asset allocation models.Follow, update and incorporate academic research into the portfolio management and asset allocation processDesign and maintain procedures and tools that make data management and investment research more efficient.Develop and maintains routine quantitative reports on an as-neededHandle daily trades and quarterly rebalances of Invesco Global Solutions’ product suite.QualificationsWork Experience / Knowledge:A minimum of two years experience in the quantitative analysis of multiple asset classes in an asset allocation framework or educational equivalent.Experience in strategic / tactical asset allocation analysis at a reputable retail/institutional investment firm is a plus.Ability to comprehend and apply statistical and quantitative methodologiesAbility to combine accounting and financial principles, investment fundamentals, and quantitative toolsStrong programming skills in R or MatlabExperience in working with large data to perform statistical and quantitative analysisExperience in building and maintaining a research database (preferably SQL)Skills / Other Personal Attributes Required:Ability to communicate effectively with a variety of individuals and range of investment backgroundsEffective written and verbal communication skillsSuperior organization skills and prove ability to attend to detailsAbility to prioritize work and allocate time effectively to maximize impact to investment processAbility to concentrate on detailed information for up to 50 - 75% of the work timeFormal Education: (minimum requirement to perform job duties) Advanced degrees in quantitative disciplines such as finance, financial engineering, or econometrics is required.PhD is strongly preferred but not required.License/Registration/Certification: (minimum requirement to perform job duties) Some progress toward CFA designation or interest shown in the designation is required.FLSA (US Only): Exempt  The above information on this description has been designed to indicate the general nature and level of work performed by employees within this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The job holder may be required to perform other duties as deemed appropriate by their manager from time to time.  Invesco's culture of inclusivity and its commitment to diversity in the workplace are demonstrated through our people practices. We are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, creed, color, religion, sex, gender, gender identity, sexual orientation, marital status, national origin, citizenship status, disability, age, or veteran status. Our equal opportunity employment efforts comply with all applicable U.S. state and federal laws governing non-discrimination in employment.North America-United States-Texas-Houston-11 Greenway Plaza"}