{"jobID": "2814311076", "jobLocation": "Union_NJ", "jobTitle": "Pre-Clinical Scientist", "companyRating": null, "companyInfo": {"Website": "www.crbard.com", "Headquarters": "New Providence, NJ", "Size": "10000+ employees", "Founded": " 1907", "Type": " Company - Public (BCR) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewBD Interventional’s Surgery worldwide business unit, located in Rhode Island, is a leading developer, manufacturer, and marketer of innovative, life-enhancing medical technologies. For the past 40 years, we have stood out as the market leader in providing solutions in soft tissue reconstruction including products for hernia repair, specialized surgical procedures, fixation and biologic implants. In addition to this extensive suite of products, our BioSurgery business is delivering a growing line of enhanced sealants and hemostatic products to complement surgical techniques across, thoracic, cardiovascular and other surgical specialties.  Our company has a strong tradition of developing our employees to learn, grow and excel. We are continually building our team with qualified, team oriented individuals to enhance the success of our company.  The Surgery business unit is situated in a central location, surrounded by a scenic coastline with easy access to T.F. Green Airport, AMTRAK Train Stations and Route 95, a major highway connecting to Providence, Connecticut, Boston and New York City within a short amount of time. Overview: Lead the Global commercialization of new products via the Regional marketing teams by defining and implementing commercialization strategies, including product pricing, positioning, value proposition and message development, and promotion. Provide product management support to drive the overall success of products currently commercialized globally.Summary of Position with General ResponsibilitiesThis position reports to the Manager, Pre-Clinical Affairs, and is responsible for providing scientific expertise in the coordination/execution of biomedical animal research studies to aid in the design and development of medical devices.Essential Job Functions Integrally involved with all aspects of Pre-Clinical Affairs animal study execution including familiarity with surgery/immunology fundamentals, protocol development, study coordination, scheduling, implementation, data analysis/interpretation, and report writing.Leading the Pre-Clinical Affairs efforts of several project teams simultaneously.Interfacing with internal Scientists/Engineers, and acting as the Sponsor Study Director at external animal research laboratory facilities.Coordinating the preparation/sterilization of appropriate test/control articles for implantation.Involvement with Pre-Clinical Affairs study quoting and budgeting as necessary.Reviewing scientific literature in order to stay current as needed in the industry.Special projects as assigned. Basic Qualifications For Scientist I- BS in veterinary/animal science, biology, physiology, or related field, with a minimum of 2 yrs hands-on experience in either an academic, industrial or CRO laboratory setting./MS in veterinary/animal science, biology, physiology, or related field, with a minimum of 1 yrs hands-on experience in either an academic, industrial or CRO laboratory setting.For Scientist II-BS in veterinary/animal science, biology, physiology, or related field, with a minimum of 3 yrs hands-on experience in either an academic, industrial or CRO laboratory setting/MS in veterinary/animal science, biology, physiology, or related field, with a minimum of 2 yrs hands-on experience in either an academic, industrial or CRO laboratory setting.Familiarity with surgery/immunology fundamentals as evidenced by successful animal study execution within the medical device industry.Previous experience as a Pre-Clinical study director/coordinator.Experience with analysis/interpretation of medical device histopathology.Statistical / Analytical capabilities and familiarity with the use of statistical software.Familiarity with anatomy and physiology fundamentals.Familiarity with the biological aspects of wound healing.Knowledge of Good Laboratory Practices (GLP).Must be able to trouble-shoot and problem solve to support successful animal study execution.Excellent organizational skills Excellent verbal and written communication skillsAdditional Desirable Qualifications Skills and Knowledge* Determination of level will be based upon years of experience and demonstrated knowledge/skills.  BD Interventional and Becton Dickinson are Affirmative Action/Equal Opportunity Employers, M/F/D/V. VEVRAA Federal Contractor.  #LI-CC1"}