{"jobID": "2758295470", "jobLocation": "San_Diego_CA", "jobTitle": "#93343 Statistician/Research Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.ucsd.edu", "Headquarters": "La Jolla, CA", "Size": "10000+ employees", "Founded": " 1960", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": "This position will remain open until a successful candidate has been identified.UCSD Layoff from Career Appointment: Apply by 5/3/18 for consideration with preference for rehire. All layoff applicants should contact their Employment Advisor. Eligible Disability Counseling and Consulting services (DCC) or Special Selection clients should contact their Vocational Rehabilitation Counselor for assistance.DESCRIPTIONThe Study of Latinos - Investigation of Neurocognitive Aging (SOL-INCA) is directed by Principal Investigators in the Department of Neurosciences and the Shiley-Marcos Alzheimer’s Disease Research Center at University of California, San Diego. The research team is investigating Latino health and aging and neurocognitive aging and disorders.  Under the supervision of the Principal Investigator and Co-Investigator, the analyst will conduct programming support, data management, and statistical analyses. The successful candidate will work at the Altman Clinical Translational Research Institute, which offers a stimulating and multi-disciplinary environment in La Jolla, California. Major responsibilities include: Creating and maintaining databases for various studies; quality control and preparation of data for analysis (e.g. merging, cleaning, coding, consistency checks); conducting statistical analyses and implementing statistical models; data visualization; and post analyses production of reproducible tables and graphs for manuscripts and grants applications.  Works on research data reporting assignments that are of moderate diversity in scope. Exercises judgment within generally defined practices and policies in selecting methods and techniques for obtaining solutions.MINIMUM QUALIFICATIONS Bachelor's degree in related area (biostatistics, bioinformatics, data science, or quantitative epidemiological, psychological or social sciences) and/or equivalent experience/training.Two (2) or more years of statistician and/or research data analysis experience.Working knowledge of research function.Working skills in statistical analysis, systems programming, database design and data security measures. Demonstrated experience with statistical programming and the use of statistical software including Stata and R.Working skills in analysis and consultation.Skills to communicate complex information in a clear and concise manner both verbally and in writing.Effective communication and organization skills as well as the ability to work independently and as part of a team.Ability to be open to learning new techniques and methods, be highly motivated, enthusiastic, and detail-oriented. Time-management, multitasking and the ability to work under pressure in a fast-paced research program are essential.Demonstrated working experience with statistical methods and models incorporating a broad range of study designs and traditional and modern statistical approaches.PREFERRED QUALIFICATIONSBilingual in English and Spanish.Computer programming experience in Python and C++.Experience with methodology and terminology used in neurosciences and neurocognitive research.Experience with complex survey design data.Experience with statistical analysis of MR imaging data.Experience with genetic data analysis.SPECIAL CONDITIONSEmployment is subject to a criminal background check."}