{"jobID": "2833521121", "jobLocation": "Ridge_NJ", "jobTitle": "Assoc Dir Clinical Safety Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Join a Legacy of Innovation 110 Years and Counting! Daiichi Sankyo, Inc. is the U.S. subsidiary of Daiichi Sankyo, Co., Ltd. The Company currently markets therapies in hypertension, dyslipidemia, diabetes, acute coronary syndrome, thrombotic disorders, stroke risk reduction, opioid-induced constipation, IV iron therapy and metastatic melanoma.Job Summary Position independently handles aspects of signal identification, evaluation, and risk mitigation across therapeutic areas. This position proactively creates communication plans for important safety topics and identified risks. Additionally, this position may serve as primary author for certain safety documents and regulatory submissions and reviews protocols and ICFs. Additionally, this position project manages larger Phase 3 or 4 SMTs and supervises junior scientist project managing smaller SMTs. This position works closely with CSPV staff, SMT members, and occasionally IPT members and other functions. Finally, this position works on the most complex problems and makes decisions regarding project management work within CSPV. This position will be the mentor for the Manager, Safety Scientists. ResponsibilitiesRisk Management (Signal identification, evaluation, mitigation): Is a key participant in developing, and possibly implementing, the risk management strategy for assigned products/ TAs. Demonstrates familiarity with PV/Epi related literature. Assists CS physician in developing key documents such as Safety Monitoring Plan, Risk Management Plans (CRMP, EU-RMP, REMS), Signal Detection/Assessment Reports, and assessing new signals. May independently integrate and analyze safety data from multiple sources on a range of safety issues including those with high levels of complexity to deliver comprehensive conclusions. This person becomes the escalation point of the most complex problems that the scientists handle. Safety Communication: Develops strategy for communicating safety information internally and externally with CS physician. May first author safety communications. Documentation: Documents meeting discussions, decisions, action items, and SMT activities independently. Ensures the appropriate archiving of the team meeting documentation and SMT activities independently. Maintains a current signal tracking log independently. Project Management: Serves as PM for SMTs devoted to larger Phase 3/4 products and ensures adherence to project timeline. Serves as PM for adhoc SMTs addressing urgent and/or complex issues. Independently identifies gaps in safety surveillance plans/RMPs and escalates appropriately. Coaches, mentors, and influences junior scientists and team members. Qualifications: Education and Experience Possesses strong medical or TA and drug development knowledge5 years of experience with an advanced degree; 7 years of experience with a Bachelor's degreeBachelor's degree at minimum required; PharmD, PhD or MSN or higher nursing degree preferred Daiichi Sankyo, Inc., is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law. "}