{"jobID": "2555033245", "jobLocation": "Chicago_IL", "jobTitle": "Customer Care Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.merieuxnutrisciences.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1967", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Covance, Food Safety Net Services, Eurofins Scientific"}, "estimatedSalary": "17", "jobDescription": " Title Customer Care Scientist EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.  Mrieux NutriSciences welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. Category Customer/Client Service Description  Looking for college grads with science experience and interest in joining a corporate customer service environment! Overview Be the primary interface for customers. Is responsible for a select group of accounts with responsibility for properly setting up and welcoming them, ensuring proper and timely communications are in place, and timely resolution of issues. Acts as the liaison between Customers and our labs, Technical Sales Managers and other functions as needed and assist in identifying new opportunities with existing customers and ensure new leads are properly routed to the Sales function. Job DutiesProvide exceptional Customer Service while following Merieux NurtriSciences’ policies and best practices.Build and maintain productive collaborative relationships within the department and across the organization to effectively support the customer.Plan, organize, and ensure proper execution of the welcoming and on boarding process in a consistent, professional, and timely manner for all assigned accounts. Accountable for accurate account setup and responsible for setting up programs and testing information in the laboratory information management system (LIMS) / CRM / ECN /myMXNS and any other system set ups critical to customer management.Answer customer phone and e-mail inquiries, identify customer requirements, provide results and additional information that meets or exceeds the customer’s expectation, and follow up with solutions.Assists in communication/resolution of billing issuesContact customers with information regarding test results that will be late or are out-of-specification and document all customer interactions in the customer relationship management (CRM) system.Effectively communicate customer requirements and coordinate projects with internal departments not limited to Customer Care, Sales, and Laboratory operations.Review first sample Certificate of Analysis (COA) and invoice with the customer to verify that appropriate tests and reporting format are as requested.Assist in customer complaint handling and investigation of customer complaints in accordance with company Quality policy and SOPs. This position has the responsibilities and authority to identify departures from the quality systems or procedures and document in accordance with SOPs in the global complaint system.Provide support to the Sales teams and other CCR team members. This may include customer visits or back up support for other team members.Maintains Customer information in Merieux NutriSciences databases ( LIMs and CRM)Identify cross selling and/or other customer intelligence that may be useful in creating new opportunities for existing customers.Field incoming leads and ensure they are transferred to the correct TSMParticipate in annual training certification to maintain working knowledge of tools required to perform the job; not limited to the Laboratory Information Management System (LIMS), CRM, and Standard Operating Procedures (SOPs).Support corporate quality and proactively participate in continuous improvement initiative in the department.Perform other related duties as needed. Position Requirements  Three (3) plus years experience in a Customer Service food or beverage industry with a BS/BA degree or equivalent work experience will be considered. A general knowledge of food testing methods or scientific process obtained from a degree in Food Science, Microbiology, Chemistry or direct relevant laboratory experience is preferred to provide support to the clients of the company. The incumbent must be able to communicate information related to testing methods and results to clients. A general knowledge of LIMS and CRM software systems are required to complete data entry and result searches for the client. Some exposure to food processing or quality assurance is beneficial in this role. General knowledge of personal computer operation is necessary including spreadsheet, word processing and relational database experience. Interpersonal skills are required for this position in order to build and maintain relationships within the organization and with external clients. This position requires exceptional, verbal and written communication skills to interact with clients and colleagues. Multi tasking, prioritization, superior follow up skills and attention to detail are also required for success in this role. Full-Time/Part-Time -unspecified- Position Customer Care Representative - Select Number of Openings 1 Location Chicago, IL About the Organization Mérieux NutriSciences is dedicated to improving food safety and quality through nutritional research, scientific excellence and innovation at every step of the food supply chain. This position is currently accepting applications."}