{"jobID": "2771474515", "jobLocation": "Fort_Worth_TX", "jobTitle": "Research Scientist Senior", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "93000", "jobDescription": "Description: This position is for a senior engineer in the Low Observables (LO) engineering section of the Integrated Fighter Group Special Technologies team. The selected candidate will develop specialized software to support LO signature materials development and testing activities. The candidate will support Radio Frequency (RF) signal processing algorithm development, data analysis, and exploitation associated with RF sensing activities, and will collaborate with aircraft design, maintenance, and special material experts to identify new approaches to Low Observables Technology as applied to IFG aircraft. The candidate will also work with System Effectiveness subject matter experts to identify approaches for improved aircraft survivability.  Must be a US Citizen or legally authorized to work in US as a permanent resident. Must have current F-22 program clearance and a minimum of Final Secret clearance. Desired Skills: -Ability to create software algorithms from physical descriptions of phenomena. Knowledge of the principles of radiometry and photometry.Familiarity with the physics of Electro-optical and Infrared (EO/IR) observables and sensors,Familiarity with techniques for analytical/numerical solutions of complex systems of equations.Broad software experience, including familiarity with Java, Visual Basic, C/ C++/C#, Database manipulation, Linux / Windows Operating Systems and Visual Studio / Eclipse/ GNU Make/CATIA Software.BASIC QUALIFICATIONS:Technical programming experience.Basic knowledge or experience in mathematical modeling of physical systems.Knowledge of signal processing for Electromagnetic and Infrared systems.Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. As a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  Join us at Lockheed Martin, where were engineering a better tomorrow."}