{"jobID": "1937858690", "jobLocation": "Dearborn_MI", "jobTitle": "SQL Developer/Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.theivantagegroup.com", "Headquarters": "Brighton, MI", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SQL Developer/Data Analyst, Dearborn, MI, 8/10/16, Contract to Hire  Overview  iVantage Group which is one of Michigan’s fastest growing Staffing and Direct Placement firms is currently searching for qualified Job Posting Title with experience in the following: Bachelor’s Degree (B.A.) or equivalent from four-year College or technical school; at least 7 years related Data Architect/PL SQL Development experience and/or training; or equivalent combination of education and experience.Languages: Hadoop, Unstructured and Structured Data experience, Hive, SQL, PL/SQL, UNIX-Shell programming, Big Data Position: Job Posting Title  Industry: Information Technology  Employee Benefits: Comprehensive Benefit Plan  Responsibilities / Job Description:  This role focuses on development of stored procedures, functions and SQL scripts for data quality and analysis in multiple environments. The developer will spend time on analysis and translation of business requirement into data requirements. Responsibilities include analysis, design, coding, testing, debugging and documentation. Ad-hoc data query for various analyses. Provide detailed analysis of data issue and development of recommendations.  Skills Experience designing, coding, testing data structures through rigorous query development using SQL in both structured and unstructured data environments.Strong data and business analysis skills with attention to detailExcellent verbal and written communication skillsMotivated by satisfying customer needsExperience in master data management conceptsExperience analyzing and profiling dataExperience meeting with user community, ability to drive data analysis meetings for data migration from external data sources, and documenting data conversion requirementsExperience translating requirements into technical specifications to be created using Hadoop, Teradata, Oracle, PL/SQL and SQLDriven self-starter who can work both independently and as a team memberKnowledge of data validation concepts, and advanced SQL writing skills. Contact Travis Provenzola: tprovenzola@theivantagegroup.com or 810-991-4482  About iVantage Group  iVantage Group is a nationally recognized provider of staffing services and project based solutions located in Brighton, Michigan. Recipient of Crain’s Detroit Business “Best Places to Work” award along with being one of Inc. 500’s Fasting Growing Firms in the United States. Certified as a Minority & Women Owned Business Enterprise we excel at finding exceptional talent that can’t be found. Our 24/7/365 real time recruiting engine is state of the art and has allowed our organization to obtain elite vendor status at local clients such as BCBSM, HAP, General Motors, OnStar, Flagstar, Comerica, Delta Dental, Consumers Energy, Jackson National Life, and Carhartt. We provide our consultants with long term Contract, Contract-to-Hire and Permanent Placement services. Simply put – we will take your career to the next level!  For more information on iVantage Group please visit us at www.theivantagegroup.com ."}