{"jobID": "2803854216", "jobLocation": "Rockville_MD", "jobTitle": "Database Architect Lead/Lead Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.variq.com", "Headquarters": "Rockville, MD", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " VariQ is seeking a Database Architect/Lead Data Scientist for a long-term contract with a Federal client in Rockville, MD. The candidate will be part of a large DevOps team working on modernizing an enterprise-scale system with national security significance. The Sr. Developer will actively collaborate with government Product Owners, Enterprise Architects, external vendor teams, and internal VariQ team members to create high-performance, scalable, cloud-native solutions based on stakeholder needs. Additional Information:Location: Rockville, MDSalary: Dependent upon experienceSecurity Clearance: must be able to obtain a DHS/USCIS EOD Public Trust clearanceAvailable: within 30 daysRequired Skills: At a minimum, possess a Bachelor’s degree in Computer Science, Information Technology Management or Engineering, or other comparable degree or experience.  A minimum of ten (10) years’ experience in the IT field focusing on enterprise data architecture  A minimum of ten (10) years’ experience in Relational and Dimentional data modeling  A minimum of eight (8) years' experience in conceptual/logical/physical data modeling  Strong understanding and experience in AWS architecture (EC2, S3, Redshift), including modeling solutions in AWS  Strong understanding and expderience in BI/Data Warehouses, Data Marts and Data Lakes  Penchant for working in fast-paced, collaborative environments with a strong affinity for innovation.  Strong Agile/Scrum fundamentals and experience  Communication and leadership skills. Tech Stack - Required:Environments: AWS, Linux Database: Oracle, SQL Server, NoSQL, PostgreSQL, AWS RDS, Data Cubes Testing: Rspec Data Tools: R, R Studio, Object relational mapping, Hadoop, Big Data, ETL, Python, Pandas, NumPy, SciPy Tech Stack - Desired:Code: .net, JAVA Environments: Azure  Message Queing  VariQ is an equal opportunity employer."}