{"jobID": "2832770655", "jobLocation": "Los_Gatos_CA", "jobTitle": "Senior Data Scientist - Content Delivery Network", "companyRating": "3.8", "companyInfo": {"Website": "www.netflix.com", "Headquarters": "Los Gatos, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (NFLX) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "228000", "jobDescription": " Netflix is the world's leading internet entertainment service with 125 million memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. On the internet, that translate to tens of terabits per second flowing out of Open Connect, our distributed global Content Delivery Network (CDN) serving 100% of Netflix video and over a third of downstream internet traffic at primetime in North America.  Open Connect is a complex and critical system providing robust, high quality video around the globe to a wide range of devices and networks. By predicting content demand and caching content on servers throughout the internet, Open Connect can provide video streams to users from nearby network locations, optimizing storage and network efficiency and providing maximum quality of experience to our subscribers.  Our CDN Science and Analytics team is responsible for building models and algorithms to power this system. Our work lies at an exciting intersection of user behavior, content popularity, streaming technology, optimization, and network science - many of our most important research areas are new and unexplored. Example projects are: predicting demand for new types of content (mobile-optimized, 4k, etc.), improving content pre-positioning algorithms by predicting local demand for video streams, and optimizing caching algorithms for efficient use of hardware resources.  To learn more about our research and analytics work, you can visit our research page here.  We are seeking a Senior Data Scientist with curiosity and passion to join this new team and make a big impact under the hood of the world's best internet video service."}