{"jobID": "2804484879", "jobLocation": "Laurel_MD", "jobTitle": "GPS / GNSS Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.jhuapl.edu", "Headquarters": "Laurel, MD", "Size": "5001 to 10000 employees", "Founded": " 1942", "Type": " Nonprofit Organization", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " MIT Lincoln Laboratory, Lockheed Martin, Northrop Grumman"}, "estimatedSalary": "84000", "jobDescription": "GPS / GNSS Data Analyst-17816Position DescriptionThe Johns Hopkins University Applied Physics Laboratory (APL), a national leader in scientific research and development, located midway between Baltimore and Washington, DC, is seeking a motivated and goal-oriented GPS / GNSS data analyst to join our team of GPS / GNSS experts. Job Summary: Analyze GPS / GNSS data from various Department of Defense (DOD) projects that are critical to ensuring our nation's preeminence. Typical tasking includes analyzing GPS / GNSS measurements from missile-mounted GPS translators and receivers to enable high-accuracy evaluation of the nation's nuclear deterrent; identifying, investigating, and resolving anomalies in GPS / GNSS measurements; analyzing and understanding positioning, navigation, and timing (PNT) data, and developing and implementing enhancements to analysis software.Duties:Analyze GPS / GNSS data from large-scale flight tests to enable evaluations of the system's accuracy and present results to sponsor (40%)Lead studies to increase understanding of tracking results from GPS and other GNSS signals, including measurement uncertainty. Studies include both analytical and hardware-in-the-loop (HWIL) simulations (30%)Define and develop enhancements to existing analysis and tracking software (25%)Travel to provide field support for missile, aircraft, and ship tests as well as sponsor briefings (5%)Note: This job summary and listing of duties is for the purpose of describing the position and its essential functions at time of hire and may change over time.Qualifications: Required Qualifications:B.S. in Math, Physics, Electrical Engineering or other related technical discipline3+ years of relevant experience using MATLAB for analysis and programmingStrong written and oral communication skillsAbility to work in a multi-disciplinary environment with small teamsAbility to work independently and/or in small groupsAbility to multitask across multiple tasks.Strong analytical skillsDesired Qualifications:M.S. or Ph.D. in Math, Physics, or Electrical Engineering4 to 7 years of relevant experienceUse of MATLAB for object-oriented programmingFamiliarity with software development for scientific applicationsFamiliarity with the Global Positioning System (GPS) measurements and processing techniquesSpecial Working Conditions: Working in closed areas. Security: Secret Clearance is required to perform essential functions of the job. Applicant selected will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship. Benefits: APL offers a comprehensive benefits package including a liberal vacation plan, a matching retirement program, significant educational assistance, a scholarship tuition program for staff with dependents, and competitive salaries commensurate with skills and experience. For more information about our organization, please visit our web site at www.jhuapl.edu. Equal Employment Opportunity: Johns Hopkins University/Applied Physics Laboratory (APL) is an Equal Opportunity/Affirmative Action employer that complies with Title IX of the Education Amendments Acts of 1972, as well as other applicable laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, disability, or protected Veteran status.Primary Location *United States-*Maryland-*LaurelSchedule Full-time -"}