{"jobID": "2837170045", "jobLocation": "Summit_NJ", "jobTitle": "Scientist I, Cell Line Development - Biologics Development &", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.Scientist I, Cell Line Development - Biologics Development & ManufacturingSummit, NJDEPARTMENT Biologics Development and Manufacturing PREREQUISITES PhD in Biological Sciences, Molecular Biology, Biochemical Engineering, or relevant discipline over 1 years relevant industrial cell line development experience, MS with over 6 years relevant experience.  This Scientist position in our Biologics Cell Line Development group will be responsible for generating high producing cell lines. Reporting to the head of Cell Line Development, the successful candidate will focus on the development of mammalian cell lines for the production of monoclonal antibody and other types of recombinant proteins, including fusion protein, antibody drug conjugates, and bi-specific antibody, for clinical and commercial manufacturing. Responsibilities will include, but are not limited to, the following:Perform key activities associated with production cell line development including transfection, selection, single cell cloning, high throughput screening, characterization of clonal cell lines using scale-down models, cell banking, and cell line stability studies.Evaluate new protein expression platform and innovative technologies for improving CLD processPerform and develop assays to support cell line development. These include Octet assay, ELISA, flow cytometry analysis, and other required immunoassays.Perform cell lines genetic characterization using methods like real-time PCR, Southern blot analysis, and NGS sequencing.Work closely with Upstream process development, Protein purification, and Analytical development team to support preclinical, and clinical stage development activities.Maintain an accurate eletronic notebook, create written technical reports, and presents data in cross-function project team meeting.Prerequisites:PhD in Biological Sciences, Molecular Biology, Biochemical Engineering, or related life science discipline, with at least 1 years of relevant industrial experience, MS with over 6 years of relevant industrial experience, BS and 8 years. Preferred.Hands-on experience with generating high producing mammalian production cell line is required.Experience with DNA cloning, vector construction and design, and genetic characterization of production cell banks is required.Experience with high throughput immunological assays such as Octet or HTRF assay.The candidate must be well organized and have excellent oral and written communication skills.Ability to work independently to design, execute experiments, and interpret dataAbility to perform well in a team oriented and fast paced environment to meet project timeline. Employer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}