{"jobID": "1674317624", "jobLocation": "Raritan_NJ", "jobTitle": "Scientist III - Microbiology", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " -Conduct routine and non-routine microbiological testing according to established procedures or approved protocols. -Act as a technical lead in laboratory investigations and nonconformance’s and has the proficiency and knowledge to lead projects and train others. -Work closely with technical associates, Product Support, raw material suppliers, Operations, QRC, and Franchise teams to ensure alignment of business priorities and effective resource deployment. -Provide technical input for multi-disciplinary technical projects and assist in their completion. Provide outputs that contribute to reduce manufacturing cycle times and provide a thorough and comprehendible understanding of technical issues. -Independently conducts investigations for OOS results and nonconformance’s. -Prepare and review final reports and protocols for technical projects. -Lead and coordinate method transfer activities and may schedule work for others. -Performs data reviews and release inspection lots in SAP. -Lead calibration activities for laboratory equipment. -Perform routine and non-routine microbial testing as necessary. -Provide leadership for training and technical support for other team members. -Perform trend analysis including recommendations for appropriate action. -Independently write/revise procedures and protocols. -Possess a thorough understanding of scientific theories, principles and practices associated with microbiological control of our biological products and manufacturing environment. -Make independent decisions regarding the design and execution of experiments and protocols and the data generated from these experiments or analysis of data provided by others. -Record and document work to levels required by Good Manufacturing Practices (GMP). -Participate in cross-functional decisions related to product risk analysis and material quality. A minimum of a Bachelor’s degree with a minimum of 5-7 years of experience. An educational focus in a Life Science, Biological, Biochemical, Chemical, Molecular, Engineering and/or other similar discipline will be preferred.Must be able to synthesize complex ideas for effective problem solving.Must be able to rapidly acquire and maintain in-depth product knowledge.Excellent written/verbal communication and computer skills are essential.Candidate should be familiar with regulations and guidelines of all applicable regulatory agencies, such as FDA (QSR/cGMP), OSHA, ISO (including ISO14001), and OCD Health, Safety and Industrial Hygiene.Strong Process Excellence, Design of Experiments, and Six-Sigma skills would be very helpful. "}