{"jobID": "2800288883", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Staff Environmental Engineer/Geologist/Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.geiconsultants.com", "Headquarters": "Woburn, MA", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "GEI Consultants, Inc. is a leading consulting engineering and environmental firm ranked #102 in the ENR top 500 (2017). We serve hundreds of government, energy, industry and institutional clients, and have completed 50,000 project engagements throughout the United States, Canada, and more than 20 other countries.  GEI, a privately held employee owned company, was founded nearly 50 years ago by five engineering pioneers. GEI now consists of over 800 employees in multiple offices throughout the U.S. and Canada. Our technical experts are involved in dozens of specialty services emanating from our core solutions in water, energy, buildings, infrastructure and industrial. Our technical experts are some of the most innovative and leading subject matter experts in their respective fields. We continue to grow and expand in our solutions, expertise and geography to ensure we can continue providing valuable solutions to our clients.  Our culture is one where we encourage employees to respectfully and thoughtfully challenge current practices for continual improvement. We believe this constructive engagement helps us evolve in an ever-changing business environment and will strengthen our organization in the future. Our practices reflect our commitment to a collaborative teaming approach, encouraging diverse perspectives which lead to innovation and value added solutions that fuel our success. Our committed employees work hard for our clients and in support of one another. In return we invest in a culture with engaging learning and career development opportunities, a competitive total rewards package, recognition, and the opportunity for some fun along the way. Essential Responsibilities & Duties: Under supervision of senior staff, candidates will work on a variety of environmental projects throughout the region. Responsibilities includes conducting environmental site assessments, overseeing the advancement of test borings and the installation of monitoring wells, and performing aquifer testing and environmental sampling. The role also involves environmental compliance and permitting opportunities.  Assist senior engineers with design of site remedies including excavation, in-situ solidification, in-situ remediation, subsurface barrier walls, and pump-and-treat systems.  Perform data management and analysis, prepare reports, and assist with preparation of technical presentations for delivery to clients and regulators.  Outline, compose, and present written arguments based on site-specific data and scientific judgment. Clear, concise, persuasive writing is a core requirement for this role.  Responsible for soliciting bids from subcontractors, coordinating work, providing technical oversight to subcontractors, both in the field and remotely, including review of invoices and work proposals.  Able to support proposal development and cost estimate development.  Must be willing to quickly learn new analytical methods, various graphical presentation tools, and integrating the information to support scientific conclusions.  Collaborate with various team leads locally and nationally to support various program initiatives and needs.  This position has a field component. Travel, including overnight travel, is required. Candidates should be prepared to work in inclement conditions, year-round. Minimum Qualifications: B.S. in Civil or Environmental Engineering, Geology, or Environmental Science (Master s degree a plus).  0 to 3 years of progressive experience in the environmental field with hands on experience in groundwater modeling, field investigation methods, and analytics with a demonstrated safety culture.  MS Office Suite, especially Word, Excel, and PowerPoint. Proficiency with GIS and database management platforms a plus.  Excellent written and verbal communication skills.  Willing and able to travel on short-term and long-term assignments as needed.  Valid U.S. Driver s license. Preferred Qualifications: M.S. in Civil or Environmental Engineering, Geology, or Environmental Science.  Experience with and/or willing to learn GINT, GIS, CAD, and 3D visualization software.  40 hr. HAZWOPER. BenefitsMarket-Competitive CompensationComprehensive Benefits Program, including Medical, Dental, Vision and MoreContinuing Education Assistance and Tuition ReimbursementProfessional Development and Opportunities for AdvancementPaid Holidays and Paid Time OffRewards and RecognitionGEI-Funded Profit Sharing and 401(k)And More…Physical Job RequirementsSedentary  Light  X  Medium  OtherActivity Level Throughout WorkdayPhysical Activity Requirements Occasional (0-35% of day) Frequent (33-66% of day) Continuous (67-100% of day) Not ApplicableSitting  (1-2 hrs)Standing  (6-8 hrs)Walking  (3-5 hrs)Climbing  (0-1 hrs)Lifting (floor to waist level) (in pounds) (0-30 lbs)Lifting (waist level and above) (in pounds) (0-10 lbs)Carrying objects  (6-8 hrs)Push/pull  (0-1 hrs)Twisting  (1-2 hrs)Bending  (3-5 hrs)Reaching forward  (1-3 hrs)Reaching overhead  (0-1 hrs)Squat/kneel/crawl  (2-4 hrs)Wrist position deviation  (1-2 hrs)Pinching/fine motor skills  (2-3 hrs)Keyboard use/repetitive motion  (1-2 hrs)Taste or smell (taste=never)  (1-2 hrs)Talk or hear  (6-8 hrs) Accurate 20/40 Very Accurate 20/20Not ApplicableNear Vision  XFar Vision  XYesNoNot ApplicableColor Vision (ability to identify and distinguish colors)  XSensory RequirementsMinimalModerateAccurateNot ApplicableDepth perception  XHearing  XEnvironmental RequirementsOccupational Exposure Risk PotentialReasonably AnticipatedNot AnticipatedBlood borne pathogens  XChemical  XAirborne communicable diseases  XExtreme temperatures  XRadiation  XUneven surfaces or elevations  XExtreme noise levels  XDust/particular matter  XOther (exposure risk):Usual workday hours:  X  8  X  10  12  Other work hoursGEI is an EEO/AA/M/F/Vet/Disability employer"}