{"jobID": "2787987271", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.goguardian.com", "Headquarters": "El Segundo, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Join us in our mission to provide students with a safe and stimulating learning environment! At GoGuardian, youll get to work with interesting and motivated people and solve challenging problems in a great environment. Youll be a joining a fluid, talented, and innovative engineering team with a highly capable data infrastructure focus. At GoGuardian, we pride ourselves on bringing the very best talent to empower millions of student lives in the most impactful way.We are hiring a highly motivated Data Scientists at varying levels to help us reshape the student learning experience. This is a hands-on, dynamic opportunity that will require building production quality models for cutting edge educational technology products. This means being part of a team that will enable GoGuardian to deliver crucial insights to students, teachers, counselors, and parents about a students educational journey.Here is what youll help us with: Collaborating across teams to develop data products driven by business needsExtracting and transforming data in a reliable, repeatable mannerEmpirical exploration striving to identify and isolate signal from noiseBuilding machine learning models and deploying them as production services at scaleBuilding tooling to support such efforts such as unit testing, automated deployment testing, model performance tracking, etc.Communicating methods and findings in written reports, presentations, and dashboardsBuilding the best data science team in LA (as a start...)Making nerdy jokes about the android from Star Trek Next GenerationAbsolute Must Haves Before Applying:2 or more years prior experience as a data scientist and a record of delivering data science products to production. Senior Data Scientist roles are available for highly qualified candidates.An advanced degree in a quantitative field (math, statistics, engineering, science, etc.)An outstanding ability to communicate complex findings in a clear and simple manner with excellent written and oral communication skillsAdvanced skills in either R or PythonProven self-learner with either the drive or talent to learn very quicklyExperience using AWS or GCPPlenty of experience with traditional statistics and ML approachesExperience extracting data from a variety of sources in a variety of formatsKnowledge of best practices in coding/scientific projectsBonus Points:A PhD in quantitative fieldPublications in peer-reviewed journals demonstrating experimental design and analytics analysis excellenceExperience using Docker in productionNLP and RNN/LTSM experience"}