{"jobID": "2638998342", "jobLocation": "San_Mateo_CA", "jobTitle": "QA Automation Engineer - Software Engineer in Test", "companyRating": "4.6", "companyInfo": {"Website": "corp.roblox.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unity Technologies, Valve Corporation, Facebook"}, "estimatedSalary": "87000", "jobDescription": "Roblox, QA Automation Engineer - Software Engineer in Test -San Mateo, CAWHY ROBLOX? Robloxs Imagination Platform is ushering in the next generation of entertainment, enabling kids of all ages to imagine, create, and play together in immersive 3D worlds. Powered by a global community of millions of developers and creators, Roblox allows anyone to build, publish, and monetize any experience imaginable.  comScore ranks Roblox as one of the top online entertainment platforms for audiences under the age of 18 based on average monthly visits and time spent. In addition, Roblox has been named one of Americas Fastest-Growing Private Companies on the Inc. 5000 for the past two consecutive years.  Work with the most passionate, team-oriented, visionary, crazy-smart people youll ever meet. The engineers at Roblox are working on the hardest problems in tech today -- distributed systems, real time communication, 3D co-experience, massive data processing, social networking, rendering, physics, and more. As a Roblox engineer, you will have real ownership and impact across one or more of these domains.  As a Sr. QA Engineer for the Studio Team, you will take a prime role in building an outstanding product used by 2 millions users every month around the world. Your teams mission is to advance Roblox Studio, the flagship IDE behind 29 millions games built on Roblox platform. You will completely own the release pipeline, including early stage testing, design, implementation and maintenance of automation framework, full stack product quality verification, from end user to deep, whitebox testing levels. You Are:Stirring about making great product for people of all agesA Pro, with a 5+ years experience in owning complex automated testing solutions. Bachelors degree in Computer Science or equivalent experience will help you thunder on the jobHands-on with a scripting language. Javascript or Lua will make the lightning for your thunderIn love with design, implementation, deployment and maintenance of complex test automation systemsA guru when asked about QA standards, best practices and patternsA Sherlock Holmes when investigating flaws in softwareYou Will:Build the world's best professional application for massively multiplayer game developmentWork as an integral part of software engineering team on challenging projects, like building the IDE that is smooth like Google Docs and powerful like Autodesk 3ds MaxFind bugs and help engineers do their dishes, sometimes at whitebox levelDesign, develop and maintain automated test framework for pest controlOwn the release pipeline. Keep an eye on product quality metrics and blow the whistle when they nose dive. Shape up product verification and release processes as needed.You'll Love:Excellent medical, dental, and vision coverageA rewarding 401k programFlexible vacation policyFree catered lunches five times a week and several fully stocked kitchens with unlimited snacksOnsite fitness center and fitness program creditAnnual CalTrain Go PassA super-cool Roblox Admin badge for your avatarRock star status with our communityRoblox Powering Imagination. [ID778]  #LI-PD1"}