{"jobID": "2792437682", "jobLocation": "Union_Beach_NJ", "jobTitle": "Sr. Manager - Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.iff.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 1889", "Type": " Company - Public (IFF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Givaudan, Firmenich, Symrise"}, "estimatedSalary": "175000", "jobDescription": "IFF Summary: IFF is a leading creator of flavors and fragrances used in a wide variety of consumer products and packaged goods. Consumers experience these unique scents and tastes in fine fragrances and beauty care, detergents and household goods, as well as beverages, confectionary and food products. The Company leverages its competitive advantages of brand understanding and consumer insight combined with its focus on R&D; and innovation, to provide customers with differentiated product offerings. IFF is a member of the S&P; 500 Index. We have sales, manufacturing and creative facilities in over 30 countries worldwide. For more information, please visit our website at www.iff.com.Sr. Manager - Data Scientist is an leadership role focused on various data science initiatives and willing to learn and dabble in different technologies to move the organizational data science and advanced analytics capabilities forward. As the organization is moving towards becoming a leading digital organization, data and analytics are key capabilities that provides insights and decision making. Are you a Data Scientist ? Would you like to build new products using machine learning algorithms Responsibilities Define key metrics for data science team Use statistics tools to analyze data to understand and model the relationship between different metrics and identity key insights Collaborate with Product Managers, Business teams to identify opportunities to build data science products Consult with other engineers to help them run and analyze A/B tests Work with leadership to identify key new product initiatives to drive growth Skills Expert level knowledge in SQL Strong experience in programming languages like Python or Java Strong experience in statistics, machine learning models and mathematical theory Strong passion for learning new technologies fast MS or PhD in Computer Science or related fieldsRequired SkillsREQUIRED SKILS:Provide high quality technology solutions that address business needs by engineering Big Data Platform and toolsets for data sceince and advanced analytics capabilitieCreate model with a Strong hands-on programming experience in R, Python, Java (Scala a plus) and extensively leverage building models using R and Python based ML and deep learning libraries. Experience using Apache Spark 2.0 (core, SQL, ML) a huge plusImplement best practice tools and processes for ensuring data science is production scalable, strong background to support data identification, Feature creation by working closely with the BI/Advanced Analytics teams on delivering Intelligence and Insights on raw data with Machine Learning, Artificial Intelligence, Forecasting, Advanced Search, Statistical Modeling capabilities, etc. 2+ years in ML algorithmic design, predictive modeling, and recommender systemsSupport system integration of diverse data sources and technologies used in the design, construction, testing, deployment and operations of BI solutionsProven experience designing, developing and implementing information solutionsProvide architectural expertise and long-term vision to build scalable business intelligence platform. Familiarity with deep learning tools and technology - provided by Dice Data Scientist, R, PHD, Machine Learning, python, Hadoop, Spark, scalaDocument success criteria and monitor solution effectiveness, including system performance, adoption and other key metrics. Work on Systems integration, including design and development of APIs and AdaptersCertified in Apache Spark and Apache Hadoop is plus Work with Application teams to build data science capabilities. Top-down thinker, excellent communicator, and great problem solverKnowledgeable in SQL, Oracle, and/or similar database languages is a plusExperience with BI tools and predictive analytics solutions a plusSolid understanding of statistical analysis, experiment design, and common pitfalls of data analysisRequired ExperienceMS degree in Computer Science, Information Technology, Engineering, Statistics, Economics, Mathematics, or quantitative fields5-7 years of data analysis, preferably with a technology company Job Location  Union Beach, US-NJ "}