{"jobID": "2787611123", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.kemper.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Insurance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Requisition Number KCS-186185SD Post Date 5/22/2018 Title Data Engineer City Chicago State IL Description Position Summary:  Kemper Corporate Services has an immediate need for an experienced Data Engineer to work from our downtown Chicago office.  This position will be responsible for implementing business solutions utilizing all aspects of the system development life cycle. Strong analysis, design, organizational, and communication skills are required You must have the ability to work well with a team  in a fast paced environment, meet deadlines, and communicate effectively and professionally with employees at all levels. Position Responsibilities:Develop efficient applications primarily utilizing PythonAdhere to coding and testing standardsCreate and maintain documentationUtilize the system development life cycle to take projects from inception through implementationStrong analytical and problem solving skillsShare knowledge, communicate effectively and professionallyPosition Qualifications:3+ years’ experience with Python development or 5+ years’ experience in a development environment and some Python proficiencyCompetence with SQL a plusOur employees enjoy great benefits:Qualify for your choice of health and dental plans within your first month.Save for your future with robust 401(k) match, Health Spending Accounts and various retirement plans.Learn and Grow with our Tuition Assistance Program, paid certifications and continuing education programs.Contribute to your community through United Way and volunteer programs.Balance your life with generous paid time off and business casual dress.Protect what you love with discounts on home and auto insurance products.Get employee discounts for shopping, dining and travel through Kemper Perks. Kemper at a glance  With $8 billion in assets, Kemper is one of the nation's leading insurers. The Kemper family of companies specializes in home, auto, life, health and valuables insurance products for individuals, families and businesses.  Kemper’s underwriting companies* are rated A- (Excellent) by A.M. Best Company, the leading insurance industry rating authority. Kemper services six million policies and ranks among the top 25 personal lines property and casualty writers and the 2016 Ward’s  50 Top Performers list of life insurance companies. Alliance United Insurance Company is not rated. We value diversity and strive to be an employer of choice. An Equal Opportunity Employer, M/F/D/V MO +CB -LJ -GD -IN -MSJ -PT"}