{"jobID": "2794582955", "jobLocation": "Washington_DC", "jobTitle": "Journal Marketing Manager", "companyRating": "2.7", "companyInfo": {"Website": "www.cas.org", "Headquarters": "Columbus, OH", "Size": "1001 to 5000 employees", "Founded": " 1907", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Elsevier, Thomson Reuters, Google"}, "estimatedSalary": "91000", "jobDescription": " ACS Publications OverviewACS Publications is the publishing branch of the American Chemical Society (ACS) and works to support the ACS’ goal to be the most authoritative, comprehensive, and indispensable provider of chemistry-related information. ACS Publications products include more than 55 scholarly journals, C&EN; magazine, and ACS eBooks. ACS Publications is based in Washington, D.C., and has offices and remote employees throughout the world. ACS Publications Sales, Marketing, and Digital Strategy Department Overview The ACS Publications Sales, Marketing, and Digital Strategy Department is responsible for developing and implementing marketing and sales strategies for ACS Publications product lines. Inherent in this is analyzing results and recommending future directions for the marketing and positioning of ACS Publications products within the chemical/scientific community marketplace.  The marketing team is committed to building a better digital, purchasing, and reading experience, as well as improving the scholarly research and communications environment for both customers and end users. Key constituents include institutional librarian administrators, corporate librarians, authors, reviewers, ACS members, editors, and readers.  A critical subset of the marketing team is the content marketing team, which works with editors and managing editors to promote journals, eBooks, and other digital products. The content marketing team is tasked with developing ongoing conversations and strengthening relationships to instigate positive brand recognition, attract authors and readers, and ultimately increase sales and revenue.Position SummaryThe Marketing Manager is responsible for planning and executing marketing strategies for a portfolio of scholarly journals. This includes managing each journal’s marketing budget, analyzing marketing campaign data, and collaborating with other members of each journal’s editorial and production teams. She or he is also responsible for collaborating with colleagues on other related marketing strategies and campaigns as required.  The Marketing Manager works within a collaborative, team-based environment with the collective goal of expanding the overall market influence of ACS journals and other products. This includes working with an editorial counterpart to create integrated strategic plans for each product line within their remit. It also includes working with graphic designers, event planners, a marketing blog editor, a marketing automation strategist, video professionals, web developers, and other stakeholders to create the elements needed to execute successful marketing campaigns.  This position is based in Washington, D.C., and reports to a Senior Marketing Manager under the Director, Journal and Content Marketing, both of whom are based in Washington, D.C.Position Responsibilities Develop positive, effective, and collaborative working relationships with colleagues across the organization, with a particular focus on marketing colleagues, editorial colleagues, and editors-in-chief.Serve as the marketing leader and expert for a suite of scholarly journals. Provide marketing advice and explanations to colleagues whose expertise is in science, not business.Take primary responsibility for developing and executing marketing strategies for the assigned suite of scholarly journals. Focus marketing efforts on reaching past, current, and prospective authors, readers, and reviewers with the ultimate goal of increasing manuscript submissions and published article usage year-over-year.Manage integrated marketing campaigns that include content marketing, social media marketing, email marketing, SEO, event marketing, direct mail, and media buys related to the assigned suite of journals.Create well-written, effective blog posts, emails, brochures, and other marketing materials.Develop email marketing campaigns using Eloqua marketing automation software.Work to increase subscriptions to ACS Publications email marketing lists and e-Alerts.Collaborate with colleagues to create engaging multimedia content, targeted to ACS Publications readers, with the intent of promoting ACS journals and products.Launch new journals or ACS Publication products as the need arises. Use customer insights and market research to drive strategy. Monitor competitor activity to inform business intelligence.Assist in planning and marketing ACS Publications trade show exhibits, symposia, forums, and other events.Work with the purchasing department and outside vendors to procure giveaways, brochures, signs, and other marketing materials.Periodically travel outside of the Washington, D.C., area to attend meetings, meet with colleagues, and represent ACS Publications at events. Travel will include some weekend and overnight stays.Work with managers and colleagues to establish and improve marketing workflows and other departmental processes as needed.Communicate goals, initiatives, and results of marketing campaigns with marketing colleagues and others across the organization.Required Experience Required Experience A college degree in a relevant field or equivalent experience is required.7+ years of related experience. Preferred Experience An advanced degree in a relevant field or equivalent experienceSTM institutional or publications marketingInternational marketing experienceExperience working within a large marketing teamExperience working with geographically and culturally diverse teamsExperience using marketing automation a plusEEO/Minority/Female/Disabled/VeteranJob Location  Washington, District of Columbia, United States  Position Type  Full-Time/Regular"}