{"jobID": "2836045093", "jobLocation": "New_Brunswick_Pennsylvania", "jobTitle": "Manager of Data Engineering, Data Sciences & Analytics", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "145000", "jobDescription": " Johnson & Johnson is recruiting for a Manager of Data Engineering, Enterprise Data  Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Science team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. The primary location for this position is New Brunswick, NJ and may require up to 50% domestic and international travel. Consideration will be given to other areas in New Jersey, Pennsylvania, California, and Jacksonville, FL and may require domestic and international travel of up to 60%.  Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world.  With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen.  Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J&J; is proud to be an equal opportunity employer.  We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune Worlds Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson.  The Manager of Data Engineering is an important, integral part of the transformation within J&J; Enterprise Data Analytics team. This role will be responsible for expanding and optimizing our data collection, flow and pipeline in support of major data science initiatives. The ideal candidate is an experienced data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support Data Scientists on POCs and use case algorithm construction and optimization. The Data Engineer will also support industrialization of analytics solutions and the data strategies required to deliver them as a business process (vs. a one time use case). The candidate must be self-directed and comfortable supporting the data needs of multiple projects in different phases of development (POC vs. industrialization), and proactively optimize or even re-design our data science data architecture and infrastructure. The right candidate will be excited by the prospect of working as a Data Engineer, with the potential to take on increasing Data Science responsibilities and projects over time.  Key Responsibilities  • Create, optimize and maintain optimal data collection, flow and pipeline for data science POCs and industrialized solutions  • Assemble, cleanse, integrate and transform large, complex data sets into model ready data  • Identify, design, and implement internal process improvements, including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.  • Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS big data technologies.  • Build data cleansing, management and visualization tools that provide actionable insights into data features that might be relevant for POCs and industrialized solutions  • Create data tools for Data Science and other analytics team members that assist them in building and optimizing POCs and industrialized solutions  • Work with stakeholders including Data Scientists, Data Architects, commercial and other stakeholders to assist with data-related technical issues and support their data infrastructure needs.  • Keep data separated and secure across national boundaries through multiple data centers and cloud based instances.  • Work with data and analytics experts to strive for greater functionality in our data systems.  Johnson & Johnson is recruiting for a Manager of Data Engineering, Enterprise Data  Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Science team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. The primary location for this position is New Brunswick, NJ and may require up to 50% domestic and international travel. Consideration will be given to other areas in New Jersey, Pennsylvania, California, and Jacksonville, FL and may require domestic and international travel of up to 60%.  Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world.  With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen.  Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J&J; is proud to be an equal opportunity employer.  We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune Worlds Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson.  The Manager of Data Engineering is an important, integral part of the transformation within J&J; Enterprise Data Analytics team. This role will be responsible for expanding and optimizing our data collection, flow and pipeline in support of major data science initiatives. The ideal candidate is an experienced data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support Data Scientists on POCs and use case algorithm construction and optimization. The Data Engineer will also support industrialization of analytics solutions and the data strategies required to deliver them as a business process (vs. a one time use case). The candidate must be self-directed and comfortable supporting the data needs of multiple projects in different phases of development (POC vs. industrialization), and proactively optimize or even re-design our data science data architecture and infrastructure. The right candidate will be excited by the prospect of working as a Data Engineer, with the potential to take on increasing Data Science responsibilities and projects over time.  Key Responsibilities  • Create, optimize and maintain optimal data collection, flow and pipeline for data science POCs and industrialized solutions  • Assemble, cleanse, integrate and transform large, complex data sets into model ready data  • Identify, design, and implement internal process improvements, including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.  • Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS big data technologies.  • Build data cleansing, management and visualization tools that provide actionable insights into data features that might be relevant for POCs and industrialized solutions  • Create data tools for Data Science and other analytics team members that assist them in building and optimizing POCs and industrialized solutions  • Work with stakeholders including Data Scientists, Data Architects, commercial and other stakeholders to assist with data-related technical issues and support their data infrastructure needs.  • Keep data separated and secure across national boundaries through multiple data centers and cloud based instances.  • Work with data and analytics experts to strive for greater functionality in our data systems. Qualifications• Masters in STEM or related discipline, e.g. statistics,operations research, informatics, computer science, mathematics and 5 years of relevant work experience in data engineering or data analysis, (Data analyst or Scientist), OR Ph.D. in STEM related field and 2 years of relevant work experience is required  • Working knowledge of and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases is required.  • Experience in Commercial Analytics is preferred.  • Experience in the Healthcare industry is preferred.  • Experience building and optimizing big data data pipelines, architectures and data sets is required.  • Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement is required.  • Strong analytic skills related to working with structured and unstructured datasets are required.  • Experience building / optimizing processes supporting data transformation, data structures, metadata, dependency and workload management is required.  • A successful history of manipulating, processing and extracting value from large disconnected datasets is required.  • Working knowledge of message queuing, stream processing, and highly scalable big data data stores is required.  • Strong project management and organizational skills are required.  • Experience supporting and working with cross-functional teams in a dynamic environment.  • Experience using one of more of the following software/tools is preferred:  • Big data tools such as: Hadoop, Spark, Kafka, etc.  • Relational SQL and NoSQL databases such as: Postgres and Cassandra.  • Data pipeline and workflow management tools such as: Azkaban, Luigi, Airflow, etc.  • AWS cloud services such as: EC2, EMR, RDS, Redshift  • Stream-processing systems such as: Storm, Spark-Streaming, etc.  • Open Source, object-oriented/object function scripting languages such as: Python, Java, C++, Scala, etc.  • The primary location for this position is New Brunswick, NJ and may require up to 50% domestic and international travel. Consideration will be given to other areas in New Jersey, Pennsylvania, California, and Jacksonville, FL and may require domestic and international travel of up to 60%. Primary Location United States-New Jersey-New Brunswick Other Locations North America-United States-Pennsylvania, North America-United States-New Jersey, North America-United States-California, North America-United States-Florida-Jacksonville Organization Johnson & Johnson (6067) Job Function Info Technology Requisition ID00001D5T"}