{"jobID": "2786661964", "jobLocation": "Lubbock_TX", "jobTitle": "Project Scientist", "companyRating": null, "companyInfo": {"Website": "www.terracon.com", "Headquarters": "Olathe, KS", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Kleinfelder, URS Corporation, PSI"}, "estimatedSalary": null, "jobDescription": " Project Scientist  21-May-2018 Service Line Environmental Job Description Our Lubbock, Texas office is continuing to grow! As a result, we are seeking a new Asbestos Project Scientist who will work with clients and lead project teams. We have a great team, so we are looking for someone who has a great \"team first\" mentality!  In this role you will need to learn or already understand the Texas asbestos regulations. Our client base includes some of the premier up- and mid- stream oil and gas clients. In addition to oil and gas projects, we also work with both large and small commercial clients, local governments, as well as health care and educational institutions, where you will have the opportunity to build lasting relationships by delivering responsive and resourceful solutions in a reliable manor General Responsibilities: Conduct environmental site investigations, assessments and surveys to sample, measure and analyze air, water, material, and soil. Identify, evaluate and recommend risk and remediation strategies/designs to ensure compliance with federal, state and local regulations. Prepare applicable permit applications, risk assessments and technical documents including proposals, reports and regulatory agency correspondence. Design systems and environmental protection plans. Projects may include Phase I/II environmental site assessments, ecological and natural resource field surveys, tank closure assessments, asbestos abatement, storm water management, and site planning and permitting. Essential Role and Responsibilities:Follow safety rules, guidelines and standards for all projects. Participate in pre-task planning. Report any safety issues or concerns to management.Be responsible for maintaining quality standards on all projects.Career level, fully competent scientific professional responsible for planning, scheduling, conducting or coordinating detailed phases of work for part of a major project or total of a project of moderate scope and complexity.May devise new approaches to problems encountered.May serve as a team leader in medium projects and mentor junior level scientists/engineers.Performs scientific analyses on projects of own discipline.May attend on and off-site client meetings.requirements to complete client projects by directing and supervising field staff to sample, test and collect data and/or document site activities.Responsible for developing written proposals to clients for both small and large projects including quality control review of proposals written by others.Evaluates complex laboratory and field data and assembles in written reports.General Responsibilities:Asbestos inspectionsAsbestos project monitoringMold assessmentsIndoor air quality assessmentsLead-based paint and PCB samplingPreparation of proposals and summary reports"}