{"jobID": "2569218807", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Machine Learning Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.instacart.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": " Instacart is building the best way for people anywhere in the world to shop for groceries. Since Instacart started in 2012, weve launched same-day delivery in 200 US markets. We are laser focused on delivering groceries from your favorite stores right to your door. We now cover over 60% of US households and aim to have 80% coverage by the end 2018that's 90 million households! From a technology point of view, the platform is complex, rapidly scaling and processing millions of transactions in real-time all of the time. Our technology coupled with operational expertise enables Instacart to deliver fresh groceries in as little as an hour. This is a difficult problem to master and we are making it happen. Every day, we solve incredibly hard problems to create an experience for our customers that is absolutely magical.  We're looking for experienced machine learning engineers to join our fast moving team. We work on a range of interesting and challenging problems, from making sure deliveries are efficient and on-time to helping customers decide what to buy. Machine learning is at the heart of this effort and an essential ingredient in Instacart's aggressive growth plan and vision for the future.  We love machine learning engineers who are motivated not only by researching new solutions, but by owning the problem end to end. There is tremendous opportunity in front of us, and joining now gives you a chance to grow your career and interests as we succeed. ResponsibilitiesYou will be dedicated to a small cross-discipline product team, with tremendous ownership and responsibility for managing things directly.You will be an active member of an internal community of data scientists, operations research scientists and machine learning engineers sharing learnings, best practices and research across many domains.You will ship high quality solutions with a sense of urgency and speed.You will work closely with engineers, product managers, other teams, and both internal and external stakeholders, owning a large part of the process from problem understanding to shipping the solution.You will have the freedom to suggest and drive organization-wide initiatives.Requirements3+ years of industry experience using machine learning to solve real-world problems with large datasetsA graduate degree in artificial intelligence, machine learning or equivalent self study and experienceSelf-motivation and a strong sense of ownershipA blend of data engineering, machine learning and product innovation skills that let you jump into a fast paced environment and contribute from day oneStrong programming skills in Python and fluency in data manipulation (SQL, Spark, Pandas) and machine learning (scikit-learn, XGBoost, Keras/Tensorflow) toolsAn ability to balance a sense of urgency with shipping high quality and pragmatic solutionsExtensive experience building scalable machine learning systems and data-driven products working with cross functional teamsDesirableExpertise in machine learning for search optimization, discovery driven recommendations, or advertising optimizationExpertise in natural language and/or image processing for e-commerce catalog quality, enrichment and optimizationExpertise in combining machine learning and operations research to solve optimal routing or inventory management problemsExpertise with deep learning methods and their practical application at scaleBenefitsTalented and collaborative coworkers who will both push and support youMarket competitive salary, equityMedical, dental, vision benefits and 401(k) retirement planTake what you need vacation (and we really mean it)16 weeks maternity leave / 8 weeks paternity leave so you can truly bond with your childComplimentary Instacart express membershipResourcesTech BlogLife at InstacartTeam Stories #LI-PRI"}