{"jobID": "2730031052", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.kornferry.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1969", "Type": " Company - Public (KFY) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About UsAs the single source for leadership and talent consulting services to empower businesses and leaders to reach their goals, Korn Ferry can offer you the perfect environment in which to reach yours as well.  We currently employ more than three thousand professionals operating in forty countries and serving clients all over the globe. As one of them, you will have endless opportunities to innovate, make an impact, and work with the best. You will also have plenty of freedom to chart your own course, as you grow and develop with our business.  Talent matters at Korn Ferry. So we have created a colleague-centric culture where everyone has the opportunity to make an impact – on our business, on our clients' businesses, and on their own careers. Some of the things that make our culture special: Creativity – We look to one another to generate innovative solutions, not only for our clients but also forCollaboration – We work in an open environment with a borderless mentality, sharing the expertise of our team members around thePerformance – We are committed to exceeding client expectations, so high performance levels are aInclusivity – We encourage everyone to contribute to the success of the business; there is no role at Korn Ferry that isIntegrity – We believe that how you go about business is as important as businessAgility – We work in a fast-moving, dynamic industry where change is the only constant and flexibility is key to our successThe Roleseeking a Data Scientist with a desire to join a new and growing company focused on cutting-edge machine learning and deep learning technology. We provide our customers with immediate business impact through technology solutions that are tailored to their data and business needs. You will work with a dynamic team of researchers and data scientists, collaborating on new machine learning algorithms and their application to multiple fields, including bioinformatics, natural language processing, image recognition, and business intelligence. We are looking for individuals who are excited about being exposed to new problems and challenges while working in a flexible and versatile environment.Skills & ExperienceDeveloping and evaluating statistical models, machine learning algorithms, and data processing techniquesApplying deep learning techniques to large datasets through GPU-accelerated processingProcessing, characterizing, and managing business-critical dataDeveloping tools and libraries that support processing and analysis of datasets Candidates must have the following characteristics: Ability to identify and design solutions to data-driven problems, evaluate and interpret results, and determine next stepsAbility to develop and prototype solutions efficiently and accuratelySelf-motivated with a strong desire to learn new technologies in a fast-moving fieldAbility to collaborate and communicate effectively with researchers, developers, and customers Preferred candidates will meet many of the following qualifications: Advanced degree in a relevant quantitative field (statistics, computer science, applied mathematics, etc.)3+ years experience in machine learning, data science, data engineering, and/or computational software development2+ years development in Python, including libraries such as NumPy, SciPy, pandas, scikit-learn, matplotlib, TensorFlow, NLTKKnowledge of machine learning theory, implementation, and applicationExperience with deep learning models, including CNN and RNN architecturesExperience working with large datasets, including NoSQL and relational databasesExperience with LinuxExperience with cloud computing and Amazon EC2OtherSo why not learn more about everything we have to offer? Top industry clients in the industry, innovative solutions, talented colleagues, continued growth… you will experience all of this and more at Korn Ferry Futurestep. Korn Ferry Futurestep is an Equal Employment Opportunity/Affirmative Action Employer. APPLY NOW JOIN TALENT NETWORK"}