{"jobID": "2730192804", "jobLocation": "San_Mateo_CA", "jobTitle": "Sr Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "corp.roblox.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unity Technologies, Valve Corporation, Facebook"}, "estimatedSalary": "151000", "jobDescription": "Roblox,Sr. Data Scientist, San Mateo, CAWHY ROBLOX? Robloxs Imagination Platform is ushering in the next generation of entertainment, enabling kids of all ages to imagine, create, and play together in immersive 3D worlds. Powered by a global community of millions of developers and creators, Roblox allows anyone to build, publish, and monetize any experience imaginable.  comScore ranks Roblox as one of the top online entertainment platforms for audiences under the age of 18 based on average monthly visits and time spent. In addition, Roblox has been named one of Americas Fastest-Growing Private Companies on the Inc. 5000 for the past two consecutive years.  Work with the most passionate, team-oriented, visionary, crazy-smart people youll ever meet. The data team at Roblox is working on the hardest problems in tech today -- distributed processing of live data streams, social network / graph theoretic analysis, machine learning, and more. As a Sr. Data Scientist, you will have real ownership and impact across one or more of these domains.You Are:Passionate about data:Continuously learning new techniques and tools to extract value from data. You have a degree in Statistics, Economics, Computer Science or other similar field.A strong communicator: You understand that analysts must be able to present their findings in meaningful ways and engage in spirited discussions about the findings.A capable statistician:You understand the value of characterizing data by its distribution. Covariance, bias, and conditional probability are concepts that you rely on every day.A expert with SQL: Querying an RDBMS is like breathing for youStrongly motivated to become proficient in the state-of-the-art tool set for accessing and crunching massive volumes of data, for instance, Spark, Flink, and Drill.Experienced in developing models to draw insights from data. You will use regression techniques, data mining, and statistical techniques to create new, scalable tools to solve difficult business problems.Uncomfortable with high-level commercial tools tools that limit your access to data and that constrain what you can do with it. You prefer the low-level open-source stack of the expert--eg, R over SAS, Excel, or Tableau.Relentlessly curious with an insatiable appetite for learningYou Will:Acquire new skills and refine the ones you have in twice-weekly Team training workshopsAccelerate product and engineering development through your understanding of the underlying data and your ability to partner with leaders to provide insights that drive growth.Access raw data, and then transform it, analyze it, and render it in a compelling way--all using a custom analytics toolkit built from state-of-the-art open-source libraries.Encode your work in dynamic dashboards and publish them to your internal customers.Influence how Roblox interacts with its players and its platform developersYou'll Love:Excellent medical, dental, and vision coverageA rewarding 401k programFlexible vacation policyFree catered lunches five times a week and several fully stocked kitchens with unlimited snacksOnsite fitness center and fitness program creditAnnual CalTrain Go PassA super-cool Roblox Admin badge for your avatarRock star status with our communityRoblox Powering Imagination. #LI-CT1  [ID840]"}