{"jobID": "2837747581", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "125000", "jobDescription": "Position DescriptionWe are seeking Full Stack Software Development Engineers to be part of this new team. In this role you will build and operate highly scalable and highly reliable services while also developing ground breaking voice experiences for our end users. You will be working closely with product managers, engineers, NLP and machine learning scientists as well as business teams. As part of this team you will get to experiment and innovate on behalf of our customersMinimum Qualifications* Must have hands-on programming experience in one of following languages: C, C++, Java, Scala or Python. 2 to 5 years of practical experience in applying statistical modeling/machine learning, search/information retrieval and/or NLP to solve complex problemsStrong knowledge in data structures and algorithms.Experience with storage technologies such as MySQL, MongoDB, ElasticSearch, Hive, Cassandra, Hadoop and KafkaStrong attention to detailBS or higher degree in Computer ScienceAdditional Preferred Qualifications* Previous experience solving problems in NLP like Question Answering (QA), Search, Spoken Language Understanding (SLU) etc.Previous experience with deep learning frameworks such as Tensorflow, Keras, PyTorch, MXNet, DyNet, and Chainer.Experience with tools and techniques used to deal with unstructured data, including building and leveraging Knowledge Bases, Ontologies, etc.Self-starter, Quick learner, Keen observer, eye for detail and someone who relishes challenges MS or PhD in Machine Learning, NLP, Information-Retrieval or related fields.Strong research and publication record in the areas of Machine Learning, NLP, Information-Retrieval or related fieldsCompany SummaryWalmart Global eCommerce is comprised of Walmart.com, VUDU, SamsClub.com, and our technical powerhouse @WalmartLabs. Here, innovators incubate next gen e-commerce solutions in real-time. We integrate online, physical, and mobile shopping experiences for billions of customers around the globe. How do we do it? We continuously build and invest in new technology including open source tools and big data innovations. Data scientists, front and back-end engineers, product managers, and web and UX/UI teams collaborate alongside e-commerce experts to envision, prototype, and bring revolutionary ideas to life in a dynamic, flexible and fun work culture.Position SummaryVoice Commerce Data Scientist: As the Walmart Voice Commerce team we are building completely new capabilities to allow our customers to shop by seamlessly interacting with their connected devices using spoken language. This team is part of the Growth organization and will build new voice experiences both in-house and in collaboration with strategic partners. Voice as a medium for shopping is still in its infancy and as part of this team you will get to work on industry leading solutions and be at the forefront of this emerging platform. You will get to part of defining how customers shop in everyday lives. "}