{"jobID": "2729704025", "jobLocation": "Austin_TX", "jobTitle": "Clinical Data Analyst - Austin, TX (Work at Home", "companyRating": "3.4", "companyInfo": {"Website": "www.humana.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1961", "Type": " Company - Public (HUM) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cigna, Aetna, UnitedHealth Group"}, "estimatedSalary": "59000", "jobDescription": "Role: Clinical Data AnalystAssignment: MedicareLocation: Austin, TX preferred or work at home nationwideHumana’s dream is to help our members and our own associates achieve lifelong well-being. Use your clinical experience to work with patients and providers in a nontraditional environment where your knowledge will make a difference. Our associates know their work is vitally important; we strive to ensure we provide perfect service with one-on-one member interactions as a coach, personal nurse, or clinical advisor. Humana’s Perfect Service® means getting the basics done right, delivering value and quality, providing guidance on needs, and being engaged with our members. We want to help our members make the right choices to live life fully. We begin that process by connecting our members with an associate who cares.Assignment CapsuleAs a Clinical Data Analyst you will collect multi-faceted data from multiple sources, analyze the information, present the information and make recommendations which drive decision making. You will be working with Clinical Associates in day-to-day operations that drive metrics to meet targets. Ideal SkillsetPreferred applicants will have excellent computer skills which includes all Microsoft Office programs, a background working in data analytics, highly motivated, prior experience working in healthcare with a general knowledge of medical terminology, a real team player and the ability to manipulate data into a format that is easily translatable by others, and the ability to not just run existing reports but the ability to create reports using SQL. A strong background and knowledge of SQL is highly desired. Must possess excellent verbal and written communication skills and the ability to work in a fast paced environment.Responsibilities include:Work with Regional Analysts, Corporate Analysts, and IT to enhance warehouse data content.Ability to Identify, Investigate, and Report issues within data systems for resolution.Ability to anticipate future needs and provide the data to support the operations.Work with the clinical areas to develop more automated reports for customer reporting and operational reporting.Develop knowledge of Humana’s clinical programs in order to support these areas through reporting.Role EssentialsDegree in Business, Health Administration, Accounting or related field.Prior experience working in a system analytics and/or data warehousing environment is required.Team Player with experience working with Clinical AssociatesExcellent programming skills desired.Experience with SQL which includes the ability to create reports from scratch and also run existing reports.Excellent organizational skills required.Independent self-starter requiring minimal supervision.Excellent written and oral communication skills required.Excellent PC skills (including MS Word, Excel, PowerPoint and Access) required.Must have accessibility to high speed DSL or Cable modem for a home office (Satellite internet service is NOT allowed for this role); and recommended speed for optimal performance from Humana systems is 10Mx1MAbility to provide a designated workspace; free from distractions with the ability to secure any protected information.Role DesirablesExperience in business writing or creative writing desired.Experience with PL (procedural language)Experience with QlikviewExperience in managed care or health care administration desired.Experience with Microsoft Visual StudioExperience with VBAExperience writing queriesExperience with SharePoint AdministrationReporting Relationships You will report to a Clinical Manager. This area is under the leadership of the SVP & Chief Operations Officer. Additional Information Humana is an organization with careers that change lives—including yours. As an innovator in the fast-paced industry of healthcare, we offer our associates careers that challenge, support and inspire them to use their passion for helping others and to lead their best lives. If you’re ready to help people achieve lifelong well-being, and be a part of an organization that is growing and poised to make an impact on the future of healthcare, Humana has the right opportunity for you.Interview Format As part of our hiring process for this opportunity, we will be using an exciting interviewing technology called Montage Voice to enhance our hiring and decision-making ability. Montage Voice allows us to quickly connect and gain valuable information from you pertaining to your relevant skills and experience at a time that is best for your schedule. If you are selected for a first round interview, you will receive an email correspondence (please be sure to check your spam or junk folders often to ensure communication isn’t missed) inviting you to participate in a Montage Voice interview. In this interview, you will listen to a set of interview questions over your phone and you will provide recorded responses to each question. You should anticipate this interview to take about 15 to 30 minutes. Your recorded interview will be reviewed and you will subsequently be informed if you will be moving forward to next round of interviews."}