{"jobID": "2760809304", "jobLocation": "Birch_Run_MI", "jobTitle": "Driver - OTR/Regional (Class A) $70-75K", "companyRating": null, "companyInfo": {"Website": "www.hollandregional.com", "Headquarters": "Holland, MI", "Size": "5001 to 10000 employees", "Founded": " 1929", "Type": " Subsidiary or Business Segment", "Industry": " Transportation & Logistics", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Con-way Freight, Dayton Freight, Saia LTL Freight"}, "estimatedSalary": null, "jobDescription": " OverviewWith nearly 90 years’ experience, Holland knows how to take care of our customers while providing a solid work environment for our employees. Discipline to its core values of Hard Work, Integrity, Respect, Excellence and Safety has allowed Holland to grow into a company with over 8,000 employees and more than $1 Billion in annual revenue, while being honored as a Quest for Quality award winner for 30 consecutive years! With a track record of long term employees, Holland offers more than a job, we offer the opportunity for a career. Come discover your direction with Holland and join the recognized leader of next-day delivery in the less-than-truckload industry!ResponsibilitiesHolland is hiring Class A CDL Regional (over the road) drivers at our ____ terminal. Our Regional drivers are dispatched throughout our Midwest footprint and are home every weekend! If you are seeking a new opportunity that offers great pay and benefits this is the opportunity for you. Full- time driver benefits include:An average of $70,000-$75,000 annually with NO DEDUCTIONS FOR HEALTH CARE PREMIUMSNEWER EQUIPMENT - 100 NEW TRACTORS FOR REGIONAL DRIVERS JUST PURCHASED!Company paid Health InsuranceVacation, Holiday and Sick payPension Benefits AND 401kDirect Deposit5% Wage Increase after 1 year, 2 years, and 3 yearsAnnual Cost of living increases are included in contractConsistent work - Reputable and Financially strong companyResponsibilities:Safely and efficiently operate commercial motor vehicles in urban, suburban, and rural areas in all weather conditions to transport freightLoad, unload, and move materialsComply with company policies and federal, state and local regulationsFollow company procedures for safely loading and unloading freightTake and verify dispatch instructionsOperate a tractor-trailer combination (vans)Load and unload freight in varying weather conditions at the company and customer facilitiesSafe operation of equipment and on-time movement of shipmentsConduct pre-trip and post-trip inspectionsMaintain electronic logs according to state and federal regulations QualificationsQualified Drivers should have: Valid Class A CDL and safe driving record/history.Minimum one year or 50,000 miles verifiable driving experience in the most recent 5 yearsHazardous Materials and Tanker endorsementNo major accidents in the last 3 yearsMust pass a DOT drug test, DOT physical and Physical Abilities TestDUI/DWI in the last 3 years not permittedMust be able to read, write and speak EnglishMust be at least 21 years oldAbility to lift up to 50 lbs. frequently, greater than 75 lbs. occasionally Holland, a part of YRC Worldwide, is an Equal Opportunity/Affirmative Action Employer Minorities/Females/Persons with Disabilities/Protected Veterans.  #CB#"}