{"jobID": "2813085637", "jobLocation": "Alexandria_VA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.element84.com", "Headquarters": "Alexandria, VA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist 210 N Lee St, Alexandria, VA 22314, USAFull-timeCompany Description Element 84 is a team of talented individuals that are leading innovation in several different areas, ranging from growing video streaming services to NASA projects that interact with petabytes of Earth data. The team is continuing to grow as we are taking on some of the toughest challenges in the industry. Every member of Element 84 is invested in one another to deliver reliable products that benefit our world.Job DescriptionElement 84 is looking for a passionate Data Scientist who can work with our team of talented engineers and designers to help us build out a Data Analytics practice. Element 84 works with systems that archive, manipulate, and display massive amounts data and we are looking forward to growing our expertise in this area. Our projects involve a wide variety of remote sensing data, medical logging data, and video streaming giving you the opportunity to work in several different domains.  Primary Responsibilities Interpret data, analyze results using statistical techniques and providing ongoing reportsProvide ideas and suggestions on ways to improve KPIs for a subscription video service based on dataDesign and assemble large, complex datasets that meet functional / non-functional business requirementsWork with the latest technologies in Big Data to deliver highly scalable solutions, such as Big Query, Redshift, Hadoop, etc.Utilize Business Intelligence tools to deliver data through visualizations of business performance metrics that can be analyzed by various stakeholdersDiscover new ways to combine complex datasets that answer questions for the businessAssist in the continual growth of the product by coming up with innovative ways to view and interpret dataContribute to process-improvement initiatives in an effort to maximize velocity for the data science teamFoster teamwork and a spirit of collaboration among team members and business partners while acting as a driver for strategy and opportunities informed by the business data.Remain current with new technologies in order to drive innovation and continue to grow the product and teamContribute to the team’s success through analysis, solution design, development, and delivery Qualifications3+ years of proven work experience as a data analyst or business data analyst for subscription video servicesExperience implementing data systems using some of the following technologies/concepts: Tableau, Domo, or similar Business Intelligence platformsUnderstanding of KPIs that drive subscription servicesWorking knowledge in programming languages such as Python, SQL, RDemonstrate skills or familiarity with Big Data technologies, preferably AWS, Azure and/or Google Cloud servicesAbility to work collaboratively in cross-functional teamsAbility to be self-directedStrong analytic skills related to working with unstructured datasets Additional InformationPaying attention to who we are -- as a company, as people, as family members, friends, and colleagues, is probably the biggest part of who we are. There are lots of ways to run a company and you have probably experienced more than your share. For us, it's wanting to come to work, being around people we enjoy, taking on big things with people you trust, and sharing our achievements as a team. You’ll get credit when things go right and we’ll have your back when things go wrong.We only take on work that is challenging and right for us. There are projects we will turn down and the team has a say.We may be a small company, but we have big company benefits meant to support the idea that we're here for the long term and that happiness comes from much more than just where you work, including 401k, health & dental insurance, life & disability insurance, flexible schedule, cell phone stipend, flexible spending accounts for transportation and dependent care and a generous PTO policy. Plus, a little happiness where you work too -- cinema displays, an award-winning candy bowl, amazing restaurants, and a brand new office. We have an extraordinary retention rate because we only hire extraordinary people. We hope that’s you.Job LocationI'm interested"}