{"jobID": "2822555229", "jobLocation": "Fort_Worth_TX", "jobTitle": "Junior Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.pmg.com", "Headquarters": "Fort Worth, TX", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "ON A WEEKLY BASIS, YOU WILL BE RESPONSIBLE FOR:Driving the advancement of PMG data infrastructure by designing and implementing the underlying logic and structure for how data is set up, cleansed, and ultimately stored for organizational usage.Defining, documenting, and evangelizing data usage and best practices across PMG.Scoping points of failure and creating alerts to ensure continual data cleanliness and accuracy.Creating scripts to connect to APIs for Google, Facebook, SimilarWeb, etc., pulling and storing data for organizational use.Interfacing with Data Innovation, Analytics, and Account Services teams to scope new use cases for structural data development.Helping guide the development of feature improvements to our suite of proprietary data-intensive tools.YOU'LL BE SUCCESSFUL IN THIS ROLE IF:You have 3-5 years of experience working with back-end data systems to create clean data structures for use across the organization.Organization and structure bring you joy. You enjoy the process of seeing everything fit into a nice orderly system.You love solving good challenge. Taking a large problem, deconstructing it to make a plan of attack, and ultimately executing on that plan is something that excites you.You have an interest in learning more about the intricacies of how search, social, and display work from a data-oriented perspective, or you have previous experience in these areas.You’re comfortable communicating and presenting complex topics and plans to people in the organization, regardless of their technical skill level.You’re a pro at writing complex SQL queries to manipulate data. Window functions and nested subqueries are second nature to you.You’re proficient at writing scripts with Python, PHP, or Javascript. (Python preferred)You feel at home with the AWS infrastructure, including the use of Redshift, Lambda functions, and S3 buckets. About PMGPMG is a digital agency that seeks to inspire people and brands that anything is possible. Driven by shared success, PMG uses strategy, creative, media, and insights to deliver against its mantra of Digital Made for Humans (TM). Founded in Fort Worth, Texas and with offices in Austin, Los Angeles, and London, PMG's work for brands like Apple, Beats by Dre, Sephora, Cirque du Soleil and OpenTable runs across 50+ countries globally and has received top industry recognition from Cannes Lions to Adweek Media Plan of the Year.  Ranked by Deloitte, Inc., and Entrepreneur as one of the fastest growing companies in the nation, PMG has grown because of its commitment to continuous improvement, business integrity, and cultivating dynamic relationships. That's why the agency has retained 90% or more of its clients over several years, and why Ad Age ranked PMG #5 in its annual Best Places to Work list two years in a row."}