{"jobID": "2831306398", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist III", "companyRating": "3.7", "companyInfo": {"Website": "www.ga.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1955", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Northrop Grumman, Raytheon, Lockheed Martin"}, "estimatedSalary": "84000", "jobDescription": " Scientist III  28-Jun-2018 Company General Atomics Job SummaryGeneral Atomics (GA), and its affiliated companies, is one of the world’s leading resources for high-technology systems development ranging from the nuclear fuel cycle to remotely piloted aircraft, airborne sensors, and advanced electric, electronic, wireless and laser technologies.  We recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply.  We have an exciting opportunity for an experienced Environmental Scientist to join our Environmental, Health & Safety (EH&S;) team. This person must have experience in soil chemistry and chlorinated solvent remediation. DUTIES AND RESPONSIBILTIES:Performs chlorinated solvent and other investigations with primary focus on collection, analysis, and evaluation of air, soil, soil gas, and groundwater samples.Performs soil, groundwater and indoor air testing for levels of chlorinated solvents and other contaminantsMay coordinate segments of a complex environmental compliance and site remediation projects that involve indoor air quality issues, chemicals in soil, and chemicals in ground water.Under general supervision with limited review, this position is responsible for determining and developing effective approaches for resolving a wide range of challenging environmental science and regulatory compliance problems.Supports operations or specific projects by researching and developing effective solutions to resolve a wide range of challenging environmental science problems including, but not limited to, regulatory compliance, environmental site assessment, and environmental remediation.Prepares scopes of work and other required materials for requests for proposal, evaluates bids, selects winning proposals, and monitors technical aspects and schedule of environmental consultants’ work.Conducts environmental research/investigations, creates documents and reports, and makes technical presentations as required, e.g., to explain conclusions and suggested resolutions.Performs, or directs the performance of, Phase I and II environmental site assessments to meet due diligence requirements for real estate transactions.May have frequent inter-organization and regulatory agency contact on technical issues.May direct the collection of environmental data through air, soil, water, and other material samples, including specifying the protocols for analyzing the samples and interpreting the analytical results, creating documents and reports, and making technical presentations re: conclusions recommendations.May direct the activities of environmental consultants, technicians and the organization’s less experienced professional staff.Review and analyze environmental documentation issued by the federal, state, and local regulatory agencies, some of which may be highly complex. Determines impact on company operations, and develops compliance strategies and requirements. Make recommendations to senior management on actions to be taken.Maintains the strict confidentiality of sensitive information.Perform other duties as assigned or required. LI-GAJob ID#15359BRJob Category Safety, Scientists Travel Percentage Required0% - 25%Full-Time/Part-Time Full-Time Salary State California City San Diego Clearance Required? No Title Environmental Scientist Job QualificationsTypically requires a Bachelor’s degree, Master’s degree or PhD in scientific or related technical field and progressively complex scientific experience as follows: four or more years’ experience with a Bachelor’s degree and two or more years’ experience with a Master’s degree. Equivalent scientific experience may be substituted in lieu of education.Degree in Environmental Science/Engineering or Soil Chemistry is strongly preferred.Recent experience with remediation involving chlorinated solvents is strongly preferred.Must have; (1) a complete understanding of environmental science concepts, principles, and theory; (2) experience demonstrating a broad application of those concepts; (3) soil chemistry and, (4) an expanding knowledge of principles, concepts, theory, and practices in related specialties such as hydrogeology, indoor air quality, groundwater monitoring, and environmental site assessment.Knowledge of, and experience with, current groundwater, soil, soil vapor, and air sampling methods and analytical techniques is strongly preferred.Knowledge of, and experience with, relevant federal and state environmental regulations and means of compliance are strongly preferred.Must possess the ability to; (1) understand new concepts quickly; (2) apply them accurately throughout an evolving environment; (3) organize, schedule, and coordinate work phases; and, (4) determine the appropriate approach at the task level or the project level to provide solutions to a range of complex problems.Must have strong written and verbal communication skills, computer, documentation, presentation, and interpersonal skills; ability to work independently and as part of a team; able to perform complex tasks in related scientific areas; and, lead a team of less experienced professional employees on semi-routine tasks.Able to occasionally work extended hours, off-hours, and weekends, and travel as required.Chemistry background and experience with dealing with Volatile Organic Compounds (VOCs) a plus.Vapor intrusion assessment experience required."}