{"jobID": "2834565287", "jobLocation": "Seal_Beach_CA", "jobTitle": "SCIENTIST", "companyRating": "3.9", "companyInfo": {"Website": "www.defense.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1947", "Type": " Government", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Duties Help  Help  Duties  Summary The selectee for this position will serve as a SCIENTIST in the Naval Surface Warfare Center, Corona Division (NSWC Corona).  All qualified applicants will be referred to management for selection consideration in Veterans' Preference order, followed by all qualified non-veteran applications. If there are a sufficient number of qualified applicants with veterans' preference, only those veterans will be referred to the hiring manager.Learn more about this agencyResponsibilities Duties and responsibilities will require the application of at least one of the following professional scientific educational disciplines: 1310 - Physics Series: This series covers professional positions advising, administering, supervising or performing research or other professional and scientific work in the investigation and application of the relations between space, time, matter, and energy in the areas of mechanics, sound, optics, heat, electricity, magnetism, radiation, or atomic and nuclear phenomena. 1320 - Chemistry Series: This series covers professional positions involving work that requires full professional education and training in the field of chemistry. This work includes the investigation, analysis, and interpretation of the composition, molecular structure, and properties of substances, the transformations which they undergo, and the amounts of matter and energy included in these transformations. 1515 - Operations Research Series: This series covers professional positions that manage, supervise, lead, or perform scientific work that involves designing, developing, and adapting mathematical, statistical, econometric, and other scientific methods and techniques. The work also involves analyzing management problems and providing advice and insight about the probable effects of alternative solutions to these problems. The primary requirement of the work is competence in the rigorous methods of scientific inquiry and analysis. 1520 - Mathematics Series: This series covers professional positions that manage, supervise, lead, or perform scientific work that involves: conducting research on basic mathematical principles, methods, procedures, techniques, or relationships; or developing mathematical methods to solve a variety of scientific, engineering, economic, and/or military problems where precise specification of the relationships, rigor and economy of mathematical operations, and logical deduction are the controlling considerations. 1529 - Mathematical Statistics Series: This series covers professional positions that manage, supervise, lead, or perform scientific work that involves: designing, developing, and adapting mathematical methods and techniques to statistical processes; or research that relates to the basic theories and science of statistics. 1530 - Statistics Series: This series covers professional positions that manage, supervise, lead, or perform scientific work or provide professional consultation in applying statistical theories, techniques, and methods to gather, analyze, interpret, and/or report quantified information. 1550 - Computer Science Series: This series includes professional positions which primarily involve the application of, or research into, computer science methods and techniques to store, manipulate, transform or present information by means of computer systems. The primary requirements of the work are (a) professional competence in applying the theoretical foundations of computer science, including computer system architecture and system software organization, the representation and transformation of information structures, and the theoretical models for such representations and transformations; (b) specialized knowledge of the design characteristics, limitations, and potential applications of systems having the ability to transform information, and of broad areas of applications of computing which have common structures, processes, and techniques; and (c) knowledge of relevant mathematical and statistical sciences. Travel RequiredOccasional travel - You may be expected to travel for this position. Supervisory statusNo Promotion Potential4 Job family (Series)1310 Physics  1320 Chemistry  1515 Operations Research  1520 Mathematics  1529 Mathematical Statistics  1530 Statistics  1550 Computer Science Requirements Help  Help  Requirements  Conditions of EmploymentMust be a US Citizen.  Must be determined suitable for federal employment.  Must participate in the direct deposit pay program.  New employees to the Department of the Navy will be required to successfully pass the E-Verify employment verification check. To learn more about E-Verify, including your rights and responsibilities, visit www.dhs.gov/E-Verify/  These positions are being filled under the Naval Sea Systems Command, Warfare Centers Distinguished Scholastic Achievement Appointment Authority. Positions may be filled as permanent with a full-time work schedule. Pay will vary by geographic location.  This position has promotion potential to the ND-04 (equivalent to the GS-12/13) grade level. If selected below the full performance level, incumbent may be noncompetitively promoted to the next higher grade level after meeting all regulatory requirements, and upon the recommendation of management. Promotion is neither implied nor guaranteed.  All qualifications requirements must be met by the closing date of this announcement and clearly documented in your application package.  Must be able to obtain an interim and/or final (e.g., confidential/secret/top secret, etc.) security clearance prior to entrance on duty AND must be able to maintain the required level of clearance while employed in the subject position. Failure to obtain and maintain the required level of clearance may result in the withdrawal of a job offer or removal. Successful completion of a pre-employment drug test may be required. A tentative offer of employment will be rescinded if the applicant fails to report to the scheduled drug test appointment. Incumbents of drug testing designated positions will be subject to random testing. Drug test results will be provided to the employing activity/command.  Position may require successful completion of a physical examination.  Positions may be covered under the Defense Acquisition Workforce Improvement Act (DAWIA) and require additional education, training and experience. All DoD personnel filling acquisition positions have 24 months to achieve the certification standards (career field/path and level) assigned to the position. If you possess DAWIA Certification, please indicate your Certification Level and Career Field information in your resume. NOTE: Notices of Results (NORs) will not be sent to applicants who apply to this announcement. Qualifications In order to qualify for this position, your resume must provide sufficient experience and/or education, knowledge, skills, and abilities, to perform the duties of the specific position for which you are being considered. Your resume is the key means we have for evaluating your skills, knowledge, and abilities, as they relate to this position. Therefore, we encourage you to submit a thorough resume that directly relates to this position.  Applicants must meet the following positive education qualifications requirements of the Office of Personnel Management (OPM) Qualifications Standards Manual for series, 1310/1320/1515/1520 /1529/1530/1550:For the 1310 (Physics) series: Successful completion of a full four-year professional curriculum (or will complete within 9 months) leading to a bachelor's degree that includes at least 24 semester hours in physics, from an accredited college or university. For the 1320 (Chemistry) series: Successful completion of a full four-year professional physical sciences, life sciences, or engineering curriculum (or will complete within 9 months) leading to a bachelor's degree that included 30 semester hours in chemistry, supplemented by course work in mathematics through differential and integral calculus, and at least 6 semester hours of physics, from an accredited college or university. For the 1515 (Operations Research) series: Successful completion of a full four-year professional curriculum (or will complete within 9 months) leading to a bachelor's degree in operations research; or related bachelor's degree that included at least 24 semester hours in a combination of operations research, mathematics, probability, statistics, mathematical logic, science, or subject-matter courses and at least 3 of the 24 semester hours must have been in calculus, from an accredited college or university. For the 1520 (Mathematics) series: Successful completion of a full four-year professional curriculum (or will complete within 9 months) leading to a bachelor's degree in mathematics or a bachelor's degree in an equivalent major that included at least 24 semester hours in mathematics, from an accredited college or university. For the 1529: (Mathematical Statistics) series: Successful completion of a full four-year professional curriculum (or will complete within 9 months) leading to a bachelor's degree that included 24 semester hours of mathematics and statistics, which at least 12 semester hours were in mathematics and 6 semester hours were in statistics, from an accredited college or university. Courses acceptable toward meeting the mathematics course requirement must have included at least four of the following: differential calculus, integral calculus, advanced calculus, theory of equations, vector analysis, advanced algebra, linear algebra, mathematical logic, differential equations, or any other advanced course in mathematics for which one of these was a prerequisite. For the 1530 (Statistics) series: Successful completion of a full four-year professional curriculum (or will complete within 9 months) leading to a bachelor's degree that included 15 semester hours in statistics (or in mathematics and statistics, provided at least 6 semester hours were in statistics), and 9 additional semester hours in one or more of the following: physical or biological sciences, medicine, education, or engineering; or in the social sciences including demography, history, economics, social welfare, geography, international relations, social or cultural anthropology, health sociology, political science, public administration, psychology, etc., from an accredited college or university. For the 1550 (Computer Science) series: Successful completion of a full four-year professional curriculum (or will complete within 9 months) leading to a bachelor's degree in computer science or a bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours were in a combination of statistics and mathematics that included differential and integral calculus, from an accredited college or university. In addition to the basic entry qualification requirements above, applicants must meet the following minimum qualifications:DISTINGUISHED SCHOLASTIC ACHIEVEMENT MINIMUM QUALIFICATIONS:ND-02: Successful completion of (or will complete within 9 months) of a professional scientific curriculum leading to a bachelor's degree from an accredited college or university in physics, health physics, chemistry, operations research, mathematics, statistics, computer science or other bachelor's degree appropriate to the position being filled. Selective Placement Factors: These positions have two Selective Placement Factors (screen-out) which will be used to determine minimum qualifications for the position. Applicants not possessing BOTH Selective Placement Factors WILL be found ineligible for the position. Possession of the selective placement factors must be verifiable via your resume AND the assessment questionnaire. 1) SELECTIVE PLACEMENT FACTOR - Educational Discipline: Successful completion of a Bachelor's degree in at least one of the following scientific disciplines (or will successfully complete within 9 months): Physics (1310) - Bachelor's Degree in Physics;Chemistry (1320) - Bachelor's Degree in Chemistry;Operations Research (1515) - Bachelor's Degree in Operations Research;Mathematics (1520) - Bachelor's Degree in Mathematics;Mathematical Statistics (1529) - Bachelor's Degree in Mathematical Statistics;Statistics (1530) - Bachelor's Degree in Statistics;Computer Science (1550) - Bachelor's Degree in Computer Science.2) SELECTIVE PLACEMENT FACTOR - Grade Point Average (GPA)Your qualifying Bachelor's degree must reflect a cumulative GPA of 3.5 or better in one of the defined scientific curriculums above. Additional qualification information can be found from the following Office of Personnel Management web site: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=Group-Standards Individual Occupational Requirements:IOR: Physics Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/physics-series-1310/ IOR: Chemistry Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/chemistry-series-1320/ IOR: Operations Research Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/operations-research-series-1515/ IOR: Mathematics Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/mathematics-series-1520/ IOR: Mathematical Statistics Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/mathematical-statistics-series-1529/ IOR: Statistics Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/statistics-series-1530/ IOR: Computer Science Series: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1500/computer-science-series-1550/  Please follow all instructions carefully. Errors or omissions may affect your rating and/or appointment eligibility. EducationFor positions requiring positive education requirements, or if you are using education to meet all or part of the qualification requirements, you must submit a copy of your transcripts or an itemized list of college courses which includes equivalent information from the transcript (course title, semester/quarter hours, and grade/degree earned) in your resume. See OPM's General Policies for information on crediting education.  Education completed in foreign colleges or universities may be used to meet the qualification requirements if the applicant can provide documentation indicating that the foreign education is comparable to that received in an accredited educational institution in the United States. It is the responsibility of the applicant to provide such evidence when applying for further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html.  See the Office of Personnel Management's General Policies for information on crediting education."}