{"jobID": "2760212369", "jobLocation": "Springfield_VA", "jobTitle": "Data Analyst, Senior", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "85000", "jobDescription": "Job Number: R0025833 Data Analyst, SeniorKey Role:  Analyze a variety of information and intelligence relevant to threats facing the systems, assets, and resources critical to the nation, and develop relevant research studies and recommendations. Lead or participate in approved studies analyzing historical strategic and tactical data from multiple sources. Develop metrics that depict the performance of enterprise systems and that can be integrated into analytical reports. Gather meaningful patterns from historical information, transforming large sets of data into actionable results for GEOINT customers. Apply statistical analysis and machine learning to derive analytical recommendations.  Basic Qualifications:  -Experience with Excel for data manipulation  -Experience with the GEOINT domain  -Knowledge of scripting or programming language, including R, Python, or Java  -Ability to identify disparate data sources and manipulate this data in a Hadoop or other data architecture  -Ability to manipulate data for analytical purposes  -Ability to create briefing slides that visualize data and provide analytical results  -Ability to create mathematical and statistical models  -TS/SCI clearance  -BA or BS degree  Additional Qualifications:  -Experience in machine learning  -Experience with using Elasticsearch and Hadoop or Hive  -Experience with using ArcGIS for spatial analysis  -Experience with developing applications using API functionality  -Knowledge of the GEOINT TCPED process  -Ability to create queries using SQL or query language  -MA or MS degree  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance is required.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}