{"jobID": "2738523423", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist, Transportation Finance", "companyRating": "4.0", "companyInfo": {"Website": "www.sabelsystems.com", "Headquarters": "Gainesville, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " Requisition Number 18-0059 Post Date 4/19/2018 Sub Title Data Scientist, Transportation Finance City Arlington State VA Description Sabel Systems requires a Transportation Finance (Second Destination Transportation [SDT]) Programs and Initiatives Lead to provide analytical and technical expertise in the area of transportation billing, metrics, and data analysis to a headquarters-level  Department of Defense agency. The position requires a strong knowledge of the Transportation Of Things (ToT) program, standardized Defense Transportation System (DTS) Over-Ocean Transportation (OOT) billing via both USTRANSCOM Transportation Working Capital  Fund (TWCF), commercial movements, as well as knowledge of DoD and Marine Corps logistics policies. The successful candidate possesses knowledge of Marine Corps Transportation Finance Policy related to the Defense Transportation System, Third Party Payment  System (billing platform for commercial transportation service providers), Marine Corps Air Clearance Authority, and Transportation Financial Improvement and Audit Readiness. A highly qualified candidate has the ability to provide research and development,  data analysis, transportation billing and finance Subject Matter Expertise (SME), technical evaluations of finance systems, and the ability to conduct in-depth data mining, extrapolation and synthesis. Desired skills include excellent written and verbal communication,  problem solving, analytical thinking, inter-service coordination, and time management. The candidate will oversee and manage related websites and SharePoint sites. He/she will be required to participate in the planning, management, and reporting of a high-visibility  Service-level Financial Independent Audit Readiness (FIAR) compliance project. The candidate will assist through drafting recommended policy guidance, the preparation of memorandums, letters, papers, briefings, and other documents regarding transportation  budget related issues. The position will be located in the Washington D.C. metro area with some travel required. ResponsibilitiesOn-site Transportation Finance (Second Destination Transportation [SDT]) Programs and Initiatives Lead will identify source systems for supply, transportation, and billing metrics data to facilitate an end-to-end distribution pipeline cost analysis, conduct  data mapping, and develop a data collection plan, which optimally centralizes all of this data into a single data mining report (commonly referred to as ‘Lift Data’) Identify potential enhancements to metrics gathering and reporting processesWill make all source billing data available for additional data analysisPrepare for and attend SDT budget and funding inquiry meetings in a non-decision making roleSolicit and gather the yearly Transportation Account Codes (TACs) and Lines of Accounting (LOA) dataMonitor the SDT budget execution and, through the application of quantitative methods, statistical modeling, and computer programming, provide execution forecasts with an emphasis on data visualization, create financial metrics reportsMaintain and develop custom data processing algorithmsMust possess domain expertise relating to Transportation of Things (ToT) audit readiness and assist in the audit sampling response processAssist with reconciling SDT Military Interdepartmental Purchase Request (MIPR), TWCF, and Commercial generated commitment, obligation, expense, and liquidation postings in SABRSAttend other integrated process teams, working groups, councils, etc.Perform other non-decision making, non-policy making transportation financial budget duties as assigned to include: responding to queries from field activities and other DOD, OSD, Joint Staff, Federal/external agencies, and commercial entities.Perform SDT non-decision making budget development, data research, and financial support duties as assigned and respond to all inquiries regarding these program areasAssist Sabel and/or Government lead in overall program management activities, as requested Essential Duties and Responsibilities: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of this position  Personal / Team Development Demonstrates the Sabel Values through own behaviors; sets clear priorities and aligns all activities; sets/achieves high personal standards for performance/conductCommunicates effectively in all directions; creates team structure and process ; encourages innovationRecognizes and celebrates accomplishment; helps the team lead and/or adapt to change; encourages teaming/networking across the companyManages a small team who are responsible for driving service lines within the solution area.Assists with defining project team requirements for projects within solution area Client Management Demonstrates expertise in a functional, technical and/or industry specific area through comprehensive problem solvingMaintains a high level of functional/technical expertise and is expected to be an expert with all aspects of core competencies and methodologies and risk management as it relates to their field of expertise.Delivers timely and quality services or products that meet or exceed team manager’s and client’s expectationsDemonstrates high level of commitment to client success while responding to changes in client expectations; monitors and uses client feedbackKnowledgeable of critical success factors for the client and clients industry Business Development Provides proposal inputs and technical approach informationAbility to positively represent the company to different clients and supports the marketing and promotion of solution area within and outside of organizationSupports sales and marketing activities for solution offeringCoordinate and maintain vendor relationships within the solution offering Other duties as assigned Requirements Requirements:Master of Science Degree in a quantitative field such as Analytics, Computer Science, or Applied StatisticsFour (4) years of experience in time series analysis and forecastingFour (4) years of experience in creating/maintaining algorithms10 years of experience supporting the DoD and/or the Intelligence CommunityDemonstrates thorough understanding of Financial Improvement and Audit Readiness (FIAR)Proficient in Cognos, Report StudioProficient in the Standard Accounting, Budgeting and Reporting System (SABRS) and SABRS Management Analysis Reporting System (SMARTS)Demonstrates knowledge of the funding, accounting, and policies of the HQMC, SDT programDemonstrates knowledge of the Transportation Working Capital Fund law, policies, and proceduresDemonstrates a proven track record of designing and implementing successful data analysis solutions which include data aggregation, data cleansing, statistical analysis, and data visualizationAbility to conduct large scale projects and research through all stages: concept formulation, definition of metrics, determination of appropriate statistical methodology and/or programming logic, research evaluation, and final research reportProficient in Python and RStrong interpersonal skills and ability to handle multiple demands and competing prioritiesExcellent written and verbal skillsExhibits routine and complex problem solving skills Minimum Qualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Problem Solving - Identifies and resolves problems in a timely manner; gathers and analyzes information skillfully; develops alternative solutions; works well in group problem solving situations; uses reason even when dealing with emotional topics.Written Communication - Writes clearly and informatively; edits work for spelling and grammar; varies writing style to meet needs; presents numerical data effectively; able to read and interpret written information.Diversity - Demonstrates knowledge of EEO policy; shows respect and sensitivity for cultural differences; promotes a harassment-free environment; builds a diverse workforce.Ethics - Treats people with respect; keeps commitments; inspires the trust of others; works with integrity and ethically; upholds organizational values.Strategic Thinking - Develops strategies to achieve organizational goals; understands organization's strengths & weaknesses; analyzes market and competition; identifies external threats and opportunities; adapts strategy to changing conditions.Planning/Organizing - Prioritize and plans work activities; uses time efficiently; plans for additional resources; sets goals and objectives; organizes or schedules other people and their tasks; develops realistic action plans.Professionalism - Approaches others in a tactful manner; reacts well under pressure; treats others with respect and consideration regardless of their status or position; accepts responsibility for own actions; follows through on commitments.Innovation - Displays original thinking and creativity; meets challenges with resourcefulness; generates suggestions for improving work; develops innovative approaches and ideas; presents ideas and information in a manner that gets others' attention.Qualifications - To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be  made to enable individuals with disabilities to perform the essential functions. Language Skills - Ability to read, analyze and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, proposals, business correspondence, and procedure manuals. Ability to  effectively present information and respond to questions from groups of managers, clients, customers, and the general public. Mathematical Skills - Ability to apply concepts such as fractions, percentages, ratios, and proportions to practical situations.Reasoning Ability - Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to question activities and issues in all functional areas and make sound business decisions based on that data.Physical Demands - The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to  perform the essential functions. While performing the duties of this Job, the employee is regularly required to sit, talk, type or hear. The employee is frequently required to walk; use hands to finger, handle, or feel and reach with hands and arms.Work Environment - The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job.The employee will normally work in a temperature-controlled office environment, with frequent exposure to electronic office equipment.During visits to areas of operations, may be exposed to extreme cold or hot weather conditions. Is potentially exposed to fumes or airborne particles, caustic chemicals, and loud noise. Sabel is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, disability, sex, sexual orientation, gender identity, national origin, or protected veteran  status. We participate in the E-Verify Employment Verification Program."}