{"jobID": "2762993603", "jobLocation": "Irving_TX", "jobTitle": "Strategic Planning and Data Analytics Senior Analyst", "companyRating": null, "companyInfo": {"Website": "www.citibank.com", "Headquarters": "Sioux Falls, SD", "Size": "5001 to 10000 employees", "Founded": " 1812", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "127000", "jobDescription": "About CitiCiti, the leading global bank, has approximately 200 million customer accounts and does business in more than 160 countries and jurisdictions. Citi provides consumers, corporations, governments and institutions with a broad range of financial products and services, including consumer banking and credit, corporate and investment banking, securities brokerage, transaction services, and wealth management. Our core activities are safeguarding assets, lending money, making payments and accessing the capital markets on behalf of our clients.Citi’s Mission and Value Proposition explains what we do and Citi Leadership Standards explain how we do it. Our mission is to serve as a trusted partner to our clients by responsibly providing financial services that enable growth and economic progress. We strive to earn and maintain our clients’ and the public’s trust by constantly adhering to the highest ethical standards and making a positive impact on the communities we serve. Our Leadership Standards is a common set of skills and expected behaviors that illustrate how our employees should work every day to be successful and strengthens our ability to execute against our strategic priorities.Diversity is a key business imperative and a source of strength at Citi. We serve clients from every walk of life, every background and every origin. Our goal is to have our workforce reflect this same diversity at all levels. Citi has made it a priority to foster a culture where the best people want to work, where individuals are promoted based on merit, where we value and demand respect for others and where opportunities to develop are widely available to all.The Strategic Planning and Data Analytics Senior Analyst will be primarily responsible for the end-to-end management of the Client Segmentation, which ensures portfolio integrity of the CCB. This position is the key to all downstream systems in providing an accurate view for CCB senior management decision making concerning financial investment, incentive compensation and staffing growth. In addition, will also be responsible for providing technical expertise and leadership to provide tools and solutions to increase team and banker productivity and effectiveness.  Objectives:Manage End-to-end account segmentationLead SP & DA Team for ad hocs, tool building and process automationManage the datasets that drive US Based Cash Management ReportingProvide technical expertise to bridge the gap between mainframe operations, SAS, and MS SQL serverKey Responsibilities:"}