{"jobID": "2801659006", "jobLocation": "El_Segundo_CA", "jobTitle": "GPS Configuration and Data Management Analyst", "companyRating": null, "companyInfo": {"Website": "www.perspecta.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2018", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Every day at Perspecta, we enable hundreds of thousands of people to take on our nation’s most important work. We’re a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nation’s most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselves—to respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.  Perspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many ways—not only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.  Perspecta’s talented and robust workforce—14,000 strong—stands ready to welcome you to the team. Let’s make an impact together.  Perspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categoriesResponsibilities The Global Positioning System (GPS) Systems Engineering and Integration (SE&I;) team is seeking qualified CM/DM analysts. The GPS SE&I; team provides systems engineering, test, analysis, transition, and operations support to SMC/GP. The GPS program is exciting, fast-paced and critical to military/civil applications. REQUIRED: Current active DoD SECRET clearance required or held at least a DoD clearance within the last 2 years. Support Air Force Global Positioning System (GPS) Program Office’s Systems Engineering (SE) Configuration Management (CM) in support of creating/managing the GPS specification and interface control documents. Reviews specifications, and interfaces to determine documentation and material requirements, ensure compliance with engineering specifications, and to ensure engineering changes reflect latest requirements. Analyzes proposed changes in product design to determine effect on documents such as specifications, Interface Control Documents (ICDs) and ensures all documents have required approvals. Compiles release packages ensuring all documentation is present. Notifies appropriate departments of any new or updated data. Maintains audit trails. Researches and resolves inconsistencies with change request records. - Plans and coordinates preparation of project documentation, such as Request For Change (RFC), production specifications and schedules, and contract modifications, to ensure customer contract requirements are met - Reviews contract to determine documentation required for each phase of project, applying knowledge of engineering and manufacturing processes - Analyzes proposed changes to the Technical Baseline to determine effect on overall product and system - Establishes change request and prepares for change authorization and documentation - Reviews and analyzes released engineering change data and coordinates changes with engineering - Manages discrepancy reports resulting from test activitiesQualifications CLEARANCE; SECRET OR HIGHER Requires 2 to 5 years with BS/BA or 0 to 2 years with MS/MA/MBA or 8 to 10 years with no degree. Secret Clearance Required"}