{"jobID": "2519972395", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - Risk", "companyRating": "2.9", "companyInfo": {"Website": "www.postmates.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "147000", "jobDescription": " Postmates runs one of the largest marketplaces in the country, connecting consumers, merchants, and couriers in real-time. Building high powered intelligence atop our large-scale datasets is a serious challenge and we’re looking for candidates who are ready to dig in. Postmates isn’t just another ad platform or mobile app for delivering static content: We have real customers paying real money for a real service. What does this team do? Postmates enables hundreds of millions of dollars in local commerce every year. Our uniquely flexible platform facilitates the delivery of virtually anything from anywhere in over 60+ U.S. cities and we’re set to expand both our transaction volume as well as geographic footprint even further. Safeguarding this success takes work and that’s where the Postmates Risk Team comes in.  The Risk Team at Postmates builds systems to assess risk in real time and protect the platform from fraud. Our infrastructure aggregates, stores, and retrieves mission critical data. It supports statistical model creation and deployment. And it houses a real time graph database that provides a highly detailed picture of the entire Postmates ecosystem. Through the tools we build, the features we deploy, and the policies we put in place, we ensure the platform can continue to scale without succumbing to the threat of bad actors. What will you do? As a Senior Risk Data Scientist, you’ll help pioneer the future of on-demand fraud prevention and actively contribute to creating Postmates’ risk mitigation strategy. You’ll use your full toolkit -- statistical modeling, machine learning, data mining, and software engineering -- to understand the unique characteristics of bad actors and how they differ from the general population of legitimate customers. You’ll help safeguard the platform from financial fraud, evaluating risk as it happens and working with operations to head it off at the pass. You’ll use your expertise to help us make the tradeoffs necessary to move the business forward. And you’ll share your experience as you mentor other members of the team. REQUIREMENTS5+ years (or 3+ post Ph.D.) of experience applying theoretical ideas in machine learning, graph theory and statistics to solve real world problems, as well as designing and deploying production grade machine learning models.2+ years experience building predictive fraud models in the on-demand or digital payments spaceA Master’s degree (or higher) in a technical field (Statistics, Operations Research, Math, Physics, Engineering, etc).Extensive experience with data tools -- Python (Pandas, scipy, numpy, scikitlearn etc), R, SQL, Octave.Ability to own your modeling work from model development all the way to production deployment and beyondAbility to approach questions with a scientific rigor, with a willingness to execute pragmatically -- the simplest solution may often be the best.Strong communication skills. Explaining complex technical concepts to product managers, support, and other engineers shouldn’t be a problem for you.You are scrappy. You understand the challenges, nuances, and details of working with messy data and if the data doesn’t exist, you go build it.You love it when things work, you understand that things break, and when things do fail, you dive in to determine the root causes and fix whatever’s broken.BONUS POINTSPrevious production grade software engineering experienceExperience with distributed / large scale machine learningExperience in small start-up environmentBENEFITSCompetitive salary and generous stock option planMedical, dental and vision insuranceWe'll provide equipment you need to work efficiently and creativelyPaid parental leave, vacation time and sick timeCatered lunches and open snack barImpact-first work environment (no politics, no pandering)Huge company vision (we need you to build the future, not just maintain the status quo)Full support to contribute to open source projectsAwesome office located in Financial District just minutes from BART, Muni, AC Transit, and SamTrans"}