{"jobID": "2705069543", "jobLocation": "Palo_Alto_CA", "jobTitle": "Sr. Data Scientist - Advanced Analytics (Palo Alto)", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "179000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Data Science Driver Team The Driver team at Uber is focused on accelerating driver growth, engagement, and retention across 300+ cities worldwide. Data Scientists on Driver play a central role in guiding product development and strategy through the discovery of insights from data. In this position, you will offer a data-driven perspective and work closely with product, engineering, and marketing. You will be on the forefront of analysis and leverage our data sources to propose new ideas related to every area of our product, including developing predictive models of driver behavior, studying market balance and developing a growth model in the context of a two-sided market, and creating experiment designs for product changes with difficult constraints (e.g. extensive product network effects). Our team's autonomy gives us the flexibility to focus on the highest-impact projects in this adaptive and challenging role as we bring increasing numbers of riders and drivers onto the Uber platform.What you could be doing:"}