{"jobID": "2829221730", "jobLocation": "N_o_n_e", "jobTitle": "Data Modeler", "companyRating": null, "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": null, "jobDescription": "Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.  The Air Force Education and Training Command is creating a new Chief Data Officer function to help manage the learning experience for over 70,000 learners, educators, and administrators. Be a part of a technical support team who would build and manage a new learning services ecosystem that will help bring the command’s learning environment into the digital age. This would include engaging with educators and vendors to learn about needs and existing solutions, creating a new technical backbone for the command, and helping develop a modern data strategy that ties it all together. Working on this project is an opportunity to get in on the ground floor of an exciting new program and function that will only grow into other parts of the Air Force the future. It will also give team members a broad set of skills, experience, and understanding of learning solution providers and their technical architecture. Roles and Responsibilities: Responsible for developing data models for large enterprise data domains. The Senior Data Modeler will work closely with resources from development, data architecture, and the business units to create an integrated model spanning multiple lines of business and subject areas within the operational database and data warehouse. The data modeler will design, build, and maintain the logical and physical data models to support the business.  Minimum/General Experience: 4+ years of industry experience. Minimum Education: Carries industry certifications such as a Bachelor’s Degree in associated discipline area. ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/ Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) For a listing of other career opportunities at ICF, please visit our Career Center at www.icf.com/careers/ Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf  Texas Client Office (TX88)"}