{"jobID": "2802089443", "jobLocation": "Chicago_IL", "jobTitle": "Data Marketing Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.usbank.com", "Headquarters": "Minneapolis, MN", "Size": "10000+ employees", "Founded": " 1863", "Type": " Company - Public (USB) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " U.S. Bank is seeking a Data Marketing Analyst, who will play an integral role in developing and executing marketing campaigns. He/she is specifically responsible for campaign management, works with multiple business lines across the company to gather campaign requirements, builds campaigns using Adobe and SAS tools, and collaborates with various internal and external partners. He/she must be able to work independently with strong analytic, communication, and project management skills. Additional responsibilities are as follows:  + Interprets business requests into campaign data requirements;  + Builds and executes marketing campaigns;  + Performs campaign data quality control to verify expected result(s) and campaign requirements are met;  + Collaborates with internal and external partners;  + Collaborates with Analytics/Reporting team to confirm campaign reporting/tracking objectives are built into campaign;  + Optimizes process, campaigns, and workflows to improve efficiency and increase output;  + Interfaces closely with internal teams for project management and scheduling;  + Coordinates campaign deliverables to internal and external end users; and  + Maintains marketing campaign schedules and negotiate priorities. *Qualifications:** Basic Qualifications  + Bachelor?s degree in Computer Science, Marketing Analytics, Business, Statistics, or other related studies, or equivalent work experience  + Five-plus years of Marketing Campaign Operations, Marketing Analytics, or related field of experience  + Prior Adobe Campaign, SAS, SQL, or related coding experience  Preferred Qualifications  + Analytic and problem solving skills with an attention to detail  + Financial Services experience  + Experience extracting data from multiple source systems and relational databases  + Ability to multi-task under tight deadlines  + Project management experience and ability to lead project from inception to completion  + Excellent written and oral communication skills  + Demonstrated ability to work in a fast-paced, team-oriented, and collaborative environment *Job:** Marketing / Communications*Primary Location:** Minnesota-MN-Richfield*Shift:** 1st - Daytime*Average Hours Per Week:** 40*Requisition ID:** 180013775*Other Locations:** United States U.S. Bank is an Equal Opportunity Employer committed to creating a diverse workforce.  U.S. Bank is an equal opportunity employer committed to creating a diverse workforce. We consider all qualified applicants without regard to race, religion, color, sex, national origin, age, sexual orientation, gender identity, disability or veteran status, among other factors."}