{"jobID": "2825180908", "jobLocation": "Anaheim_CA", "jobTitle": "Executive Director, Data Engineering & Operations", "companyRating": "3.4", "companyInfo": {"Website": "www.providenceiscalling.jobs", "Headquarters": "Renton, WA", "Size": "10000+ employees", "Founded": " 1855", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "183000", "jobDescription": " We are seeking an Executive Director, Data Engineering and Operations to be accountable for the iterative design, build and deployment of analytic data solutions for the organization. Working in conjunction with partners within Information Services, technology vendors, and solution providers, this role will blend proven information management processes with emerging technologies and iterative deployment processes to drive the data as a service model. Sets the standard practices and DevOps model for data solutions. Ensures that data products meet the requirements for service quality, usability, scalability, and time to market. Actively manages the portfolio of products to maximize value for internal customers. Plays a lead role in data product design for the wider marketplace, with an eye towards revenue generation. Applies an engineering mindset to complex data and analytic problems—goes beyond the traditional business intelligence playbook. Builds and maintains a high functioning engineering team with operational capabilities, including 24x7 support.  Essential Job Functions:  Drive the information management data product approach, from formulation through engineering to operations, leveraging big data and data warehousing, cloud computing, enterprise search and semantics, data movement/integration, business intelligence, master data management, metadata, data quality and configured EMR reporting assets.  Advance the data architecture, SDLC, and iterative development programs.  Create, build, sustain and improve high performing technical teams.  Be a knowledgeable and trusted partner to business, clinical and operational leaders.  Be a champion for a data-driven decision-making culture.  Drive the information management platform portfolio towards a revenue-generating service provider model.  Ensure stability, resiliency, and availability of the portfolio. Partner with Enterprise Risk, Privacy and Legal to maintain appropriate data security.  Implement and drive data product optimization strategies, new systems designs and other ad-hoc projects.  Effectively execute business strategies by aligning human resource strategies with business needs, by recruiting and developing a high-performing team, and by developing a climate which builds employee commitment and reinforces high-performance standards.  Maintain an operating culture which is disciplined, accountable, consistent, cost-effective, and collaborative, and ensures that patient well-being and safety are paramount.  QUALIFICATIONS:  Required qualifications for this position include:  Bachelor’s degree in Computer Science or related field.  More than 10 years in technology roles.  9 years’ experience of leading and/or supervising staff.  Domain expertise running big data technologies  Preferred qualifications for this position include:  Master’s Degree.  10 years of healthcare industry experience in positions of increasing responsibility  Cloud computing, Linux, Hadoop, MapReduce, Spark, Hbase,Kudu and NoSQL platforms in general; Apache Solr and LuceneJava, Scala, C#, Python, shell scripting and/or similarlanguagesRelational database platforms, database design, and SQLAPIs, JSON, REST and other relevant W3C open standardsExperience in commercial product development or managementconsulting a plus"}