{"jobID": "2659632818", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Engineer - ETL", "companyRating": "4.2", "companyInfo": {"Website": "www.consumertrack.com", "Headquarters": "El Segundo, CA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " ConsumerTrack™ is unique in the digital marketing and media industry - we combine marketing, digital, content and fintech. Our performance based approach increases brand awareness and generates targeted audience engagement on our internal web properties and partner sites.  Learn More About What We Do  The CTI Data Engineering team is responsible for designing and developing the enterprise database, data warehouse, reporting solutions, and near-term machine learning and predictive analytics. We’ve got big growth plans ahead and we’re looking for a rockstar Data Engineer to help us build a world class data platform. If you have a solid track record of designing, developing and supporting enterprise-level data warehousing and reporting platforms, we want you to join our team! You will play a vital role in building our Data Warehouse and developing real time ETL processing to support our analytical reporting systems. Your contribution will help drive decision making across the company!  Responsibilities: Build, test, and refine dimensional data models and custom frameworks / documentDesign, develop, implement, and deploy of the new data warehouse ETL processes using Pentaho Data Integrator and custom scripting.Create ETL processes to support systems integrations, data acquisition, data enrichment, staging, and aggregation.Perform ongoing monitoring to ensure data quality and consistency, automation of alerts, and refinement of reports and BI solutionsOptimize and tune performance, set coding standards, and document data flowsWork closely with analytics, product managers, engineers and business stakeholders to help define and document business requirements for new metrics and reportsTranslate business requirements into technical requirements and data architecture for the underlying data warehouse, provide mapping documents and data flowBecome a source data expert, provide analysis, and resolve data issues; communicate solutions and contribute to process reviewsDeliver reliable data, supporting analysts with ad-hoc SQL queries for analysis and reportingCollaborate with subject matter experts across different business units to design, implement and deliver insightful analytic solutions.Perform end-user training and ensure adoption of the data warehouse and reporting platformImprove and maintain data access for our BI tools.Requirements Basic Qualifications: 3-5+ years hands-on experience in Relational Databases, Dimensional Data Modeling, ETL development, and Data Warehousing.Proficiency in Redshift, Snowflake or other MPP databases.Expert experience in SQL and strong SQL performance tuning skills, writing scripts, stored procedures, and ad-hoc SQL queriesExperience with scalable architectures, large data processing, and cloud computingExperience with BI systems (Tableau, Periscope etc).Excellent troubleshooting and problem solving skills.Experience with writing SQL that is able to transform, pivot, and stitch big data sets togetherStrong desire to thoroughly learn the business and be able to communicate with usersAbility to multi-task and prioritize Preferred Qualifications: Experience with Pentaho.Experience with Hadoop and/or other tools in the ecosystem.Exposure to AWS ecosystem, hands-on experience with S3Experience with non-structured data and marketing analytics.Scripting experience in PythonLinux/Unix operating systemUndergraduate degree / BS in Engineering, Computer Science or MathBenefitsCompetitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity, and passion.Awesome medical, dental and vision plans with heavy employer contribution.Paid vacation, holidays, and sick days.401k- We match 3% of employee’s salary after the first year of employment.In-office gym and weekly fitness and yoga classes.Fully stocked kitchen with snacks and beverages.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}