{"jobID": "2808766957", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Regulatory/Database Scientist", "companyRating": null, "companyInfo": {"Website": "www.dunnedwards.com", "Headquarters": "Vernon, CA", "Size": "1001 to 5000 employees", "Founded": " 1925", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Sherwin-Williams, BEHR, PPG Paints"}, "estimatedSalary": null, "jobDescription": "GENERAL PURPOSE OF JOB: Manage and maintain all Dunn-Edwards Raw Material and Formulation data and serve as Product Development Lab’s key point person for formulary system and regulatory information/reports.  Dunn-Edwards is an Equal Opportunity Employer, M/F/D/V. ESSENTIAL DUTIES AND RESPONSIBILITIES:Develop an understanding of the plant(s) and formulations at Dunn-Edwards.Manage principal formulation software functionality, raw material, and formulation data.Train lab personnel on the use of the formulation software and document all processes for formulation and raw material management of data.Evaluate current processes used for managing formulation database and implement new processes as appropriate with the approval of management.Manage all formula recipes for conformance to established manufacturing protocols.Manage all incoming raw materials to ensure all data needed is gathered and keep proper documentation from raw material vendors.Develop and maintain reports as needed to support Product Development, Manufacturing, Marketing and/or Regulatory.Explore and outline possible enhancements of software to management for prioritization of opportunities, so that efficiencies and other modules of system can be leveraged.Manage the Implementation of enhancements approved by management to allow better utilization of key functions of software, so that it can be leveraged.Manage all regulatory processes and documents for raw materials in both physical and electronic formatting.Perform such routine or non-routine tasks as may be assigned.Maintain good records.Interact with Raw Material Suppliers in a professional manner.Participate in safety inspections and develop safe handling practices for new raw materials.SUPERVISORY RESPONSIBILITIES: There are no subordinate supervisors reporting to this job. There are no non-supervisory employees who report to this job. EDUCATION and/or EXPERIENCE: Bachelor's degree (B. A.) from a four-year college or university; and at least 10 years related coatings experience; or equivalent combination of education/training and experience. LANGUAGE SKILLS: Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, business correspondence, and procedure manuals. Ability to effectively present information and respond to questions from groups of managers, clients, customers, and the general public. MATHEMATICAL SKILLS: Ability to apply advanced mathematical concepts such as exponents, logarithms, quadratic equations, and permutations. Ability to apply mathematical operations to such tasks as frequency distribution, determination of test reliability and validity, analysis of variance, correlation techniques, sampling theory, and factor analysis. REASONING ABILITY: Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. ADDITIONAL INFORMATION: Must have a minimum of ten years of extensive coatings laboratory experience. A broad in-depth knowledge of paint raw materials, processing equipment, paint market needs. Moderate interaction with other departments, including Manufacturing, Quality Control, Regulatory, and/or Marketing to address specific needs is required. SAFETY CONCERNS AND POSSIBLE HAZARDS:Always wear proper personal protective equipment.Observe all safety procedures.Report any unsafe condition to the Production Supervisor or Plant Manager at once.HEALTH& SAFETY TRAINING REQUIREMENTS:Health& Safety Training:HMIS Training (i.e., Hazard Communication: 29 CFR 1910.1200 and GISO 5194).Personal Protective Equipment (i.e., Level A through D: GISO 3382, 3384 and 3385).Emergency Response& Evacuation (i.e., 29 CFR 1910.120 and GISO 5192)."}