{"jobID": "2813460083", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.genesis10.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Project Overview:You will be working with Android Partner Engineering and Technical Program Management team, which is responsible for supporting all of our Android ecosystem Partners (OEMs, Carriers, System-on-a-Chip providers, etc). We are looking for a strong Data Analyst to support and grow partner.android.com/metrics, our partner-only metrics sharing portal. You will be responsible for translating data into meaningful interpretations and recommendations and, where relevant, implement process improvementsTop 3 Daily Responsibilities:-Enhance and expand the partner metrics dashboards-Enhance and expand the data processing pipelines: complex workflows of chained SQL scripts-Triage bugs and follow up with internal and external teams, which will often lead to tracking down and explaining and/or fixing data anomalies.Required Skills:-BA/BS with a strong academic record and at least 3 years of work experience, preferably as analyst or in highly analytical role. In lieu of degree, must have 6+ years of experienceData Analysis:-PRIMARY: SQL involving large data sets, analytic functions, and advanced transformations.-PRIMARY: Data transformation, normalization, and anomaly detection-Ability to learn new tools and technologies.-Expectation of complete confidentiality (per-partner metrics are very sensitive)Dashboard Creation/Enhancement:-SQL querying, transformation, partitioning-JavaScript and light Web-UI debugging-(More) ability to learn new tools and technologies.Bug Handling:-Experience in technical support and bug triage-Proficiencies working with MS Office and/or Google Docs & bug tracking systems.-Ability to manage, prioritize and deliver on conflicting priorities.-Excellent verbal and written communication skills to create documentation.-Attention to details with excellent follow-up, high moral standards and great team player.Nice to Have Skills/Not Required:-The ideal candidate will have already worked with Google before and is familiar with Google tech like #plx, GoogleSQL, and Alkali.-Create and maintain anomaly detections (R, AutoFocus, Contour, DasNav, or other).-Project management experience."}