{"jobID": "2814614931", "jobLocation": "Los_Alamitos_CA", "jobTitle": "CLINICAL LAB SCIENTIST PER DIEM ROTATE", "companyRating": null, "companyInfo": {"Website": "www.tenethealth.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (THC) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "GAINSCO Auto Insurance markets non-standard private passenger automobile products through retail agencies, in Texas, New Mexico, Arizona, Oklahoma, Florida, Georgia, South Carolina, Virginia, Tennessee, and Utah. GAINSCO Auto Insurance has fully integrated insurance capabilities, including marketing, underwriting, customer service and claims handling. Our operations are bilingual (English/Spanish). Job Purpose: To investigate, evaluate and settle claims, applying technical knowledge and human relations skills to effect fair and prompt disposal of claims and to contribute to a reduced loss ratio Essential Job Results:% of TimeResults Expected and Duties Performed80%  Maintains workflow by running daily reports on salvage pieces; ensuring that proper documents are received for salvage sales; coordinating with third-party salvage vendors to ensure that salvage processes are adequately followed; processing and sorting daily salvage mail; processing invoices to ensure proper payment to 3rd party vendors; processing and posting proceeds of payments from 3rd party vendors; supporting Claims Adjusters with ad-hoc support tasks20%  Maintains quality service by proactively communicating with claims personnel and other departments as necessary.Required behaviors for all positions: Communicate with co-workers, management customers, vendors, and others in a courteous and professional mannerConform with and abide by all Company codes, regulations, policies, values, work procedures and instructionsRegular attendanceJob Requirements:Education: High School Diploma or equivalent. Experience: Minimum 1 year general office, data entry and clerical experience required. Insurance background preferred. Skills and Abilities: Excellent verbal and written communications skills. General office skills: basic math, data entry, typing. Ability to effectively manage own time and coordinate various tasks simultaneously. Knowledge of administrative and clerical procedures and systems such as transcribing, word processing, managing files and records, designing letter templates. Other: Bilingual (English/Spanish) preferred but not required. Compensation: Competitive salary based on experience. Excellent benefits package: medical, dental, vision insurance, life insurance, short term and long term disability insurance, 401K, Paid Vacation and Holidays.  GAINSCO is an Equal Employment Opportunity Employer"}