{"jobID": "2780708578", "jobLocation": "Washington_DC", "jobTitle": "Data Analytics Business Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.jrcisi.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Career Overview JRC Integrated Systems is an award-winning workplace and recognized as one of Greater Washington’s Best Places to Work as well as a Top Work Place in 2014, 2015, 2016, and 2017. Headquartered in Washington, DC with operations in Alabama, California, Florida, Georgia, Indiana, Massachusetts, New York, and Virginia – JRC is a leading provider of scientific, engineering, management and technical support to the Department of Defense and other federal agencies. Since its inception in 2003, JRC has supported numerous federal initiatives by providing the expertise necessary to provide programmatic support in areas of program management, systems engineering, data analysis, strategic business planning and business operations. Position Description This position will support JRC’s Enterprise Information Management business area supporting the Navy’s Strategic Systems Programs (SSP) and a team of employees in Washington, DC. The candidate will provide knowledge of operations analysis to build business processes for SSP. Currently, the information is located in multiple databases and difficult to find the authoritative version. The project seeks to standardize information creation/capture, create metadata linkages across multiple platforms, and eliminate redundant/conflicting files. The analyst will perform the following: Responsibilities Design, develop, and implement optimal solutions to integrate, store, process and analyze data sets Perform process documentation and value stream mapping improvement analysis Visually display results using Operational Views and Work Flow Processing tools Document existing business rules and proposed rules which would lead to process performance Pre-defines points at which data can be extracted for reporting purposes Coordinates with Architecture, IT teams, Programmer/developer, Program Manager and Project Manager Evaluate and align Business Requirements Documents with Technical Requirements Documents Bachelor’s Degree or equivalent years of experience. Proficiency in Microsoft Office suite of tools. Experience with handling large datasets across multiple database systems Excellent analytical and quantitative skills with strong attention to detail Experience facilitating Joint Application Development (JAD) sessions Strong Knowledge of IT PLC (Project Life Cycle) and Good knowledge of SDLC (Waterfall) Ability to interpret and analyze Business requirements from a Management and IT delivery perspective. Good understanding of IT Swim lanes and Business Capabilities delivery swim lanes. Proof of US citizenship is required. Must have the ability to obtain and maintain a security clearanceJRC Integrated Systems, Inc. is an equal opportunity/affirmative action employer"}