{"jobID": "2809014324", "jobLocation": "Burbank_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sagaftraplans.org", "Headquarters": "Burbank, CA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As a Data Analyst, you will engage with business teams to define business questions, prepare and model data, and perform analyses with the purpose of understanding or drawing conclusions from the data. This role will join the Analytics Team and will work closely to build, deploy and administer self-service analytics across business units. In this role, you will utilize the Plans diverse analytics tools to turn data into actionable insights with the goal of creating a data-driven culture across the organization. Essential Job Functions:Engage business teams to understand business challenges, define analytics questions and apply analysis techniques to generate data products including interactive reports and dashboards.Work closely with Analytics Team to deliver on key analytics projects. This will include data provisioning, exploratory data analysis, data visualization and in some instances, machine learning and statistical modeling.Champion the analytics process– from business understanding, data understanding, data preparation, data modeling, evaluation, and deployment; lead by example and by training business stakeholders with varying technical and non-technical backgrounds.Design, enable and maintain trustee reporting, executive scorecards and cross-functional tactical reports on the Plans enterprise analytics platform.Drive the adoption self-service analytics through the analytics platform for operational reporting across multiple departments including Finance Accounting, Participant Services, Eligibility,Claims and Pension departments.Become front-line support the analytics platform and to handle related questions, issues and requests.Build and maintain relationships with external partners including vendors and consultants and establish periodic touchpoints to assess progress and obtain updates on projects.Understand data requirements required by consultants and provision the data in an efficient, traceable and secure manner.Coordinate with consultants on research and analysis workload to build indepth understanding of projects and analysis outcomes; validate approach used and evaluate outcomes. Continuously advance your skills and those of others on the team through discussions, work assignments, training and mentoring. Knowledge, Skills, & Abilities: Strong ability to blend and wrangle data, create logical data models to be used as a basis for analysis.Proficiency in using enterprise analytics platforms, data visualization tools– Tableau, Alteryx, ThoughtSpot, Business Intelligence solutions or equivalent.Knowledge of relational DBMS, specifically Oracle, and ability to script and execute SQL queries.Understanding of the principles and tools of statistical analysis and machine learning is a plus.Ability to frame unstructured, complex analytical problems.Competencies:Customer focus - Gains insight into customer needs; identifies opportunities that benefit the customer; builds and delivers solutions that meet customer expectations; establishes and maintains effective customer relationships.Decision quality– Makes sound decisions, even in the absence of complete information; relies on a mixture of analysis, wisdom, experience, and judgment when making decisions; considers all relevant factors and uses appropriate decision-making criteria and principles; recognizes when a quick 80% solution will suffice.Communicates effectively– Is effective in a variety of communication settings: one-on-one, small and large groups, or among diverse styles and position levels; attentively listens to others; adjusts to fit the audience and the message; provides timely and helpful information to others across the organization; encourages the open expression of diverse ideas and opinions.Ensures accountability– follows through on commitments and makes sure others do the same; acts with a clear sense of ownership; takes personal responsibility for decisions, actions, and failures; establishes clear responsibilities and processes for monitoring work and measuring results; designs feedback loops into work.Instills trust– follows through on commitments; is seen as direct and truthful; keeps confidences; practices what he/she preaches; shows consistency between words and actions."}