{"jobID": "2796299100", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Sr. Program Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.bissell.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 1876", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " SHARK, TTI, Dyson"}, "estimatedSalary": "105000", "jobDescription": "Job Title: Sr. Program Manager Job Number:1800106Job Description:The Sr. Program Manager is accountable for leading strategic projects across multiple product categories. This associate will work closely with the product category teams, and other key stakeholders, to define new product opportunities for the markets BISSELL competes in, then lead cross functional teams through the development and market launch of selected products.(Major duties, accountabilities, and responsibilities)Communicate and coordinate within all functions of the organization, as well as with key suppliers, vendors and sometimes customers. Must be able to successfully influence internal and external contacts regarding highly complex and sensitive topics. Ensure that program team members and other support functions own and use BISSELL's Global product development process.Own and lead multiple-product initiatives. The Sr. Program Manager will use informal leadership to drive cross-functional teams for program success. Programs managed will mostly be product-oriented, but could include process and people initiatives that are highly visible and strategic. Projects likely will involve global resources.This individual is the one voice for his/her assigned programs and requires collaborative integration within the organization. The person in this role will have ultimate responsibility for meeting key program schedule milestones, cost objectives, budget objectives and design guide criteria from cradle to grave.Facilitates and leads the scoping of new projects including technical requirements, resource needs, and launch timing targets.Creates and maintains project schedules, tracking progress toward objectives and resource levels compared to what was planned.Advocates on behalf of the project to creatively solve problems affecting project delivery.Guards against changes that may affect the project budget or timing, scoping the impact of any necessary changes and presents change orders to leadership for decision.Ensure that program team members and other support functions own and follow BISSELL's Global Development process.Accountable for the capture of knowledge/lessons learned associated with these new projects for future reference."}