{"jobID": "2310469082", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.6", "companyInfo": {"Website": "www.grandrounds.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "204000", "jobDescription": "The Role:Data Scientists at Grand Rounds work on problems that are core to the companys mission. Major challenges include developing systems and models to identify the highest quality doctors in the country as well as methodologies to uncover the subtle differences between each physicians clinical expertise. Additionally, patient-level modeling allows us to understand the specific healthcare needs of every person. With a high fidelity understanding of both patients and physicians we are able to route patients to both appropriate and high quality care.In addition to developing the companys core technologies, data scientists provide decision support analysis for many teams across the organization including product development, sales, marketing, and strategy. Data scale ranges from small data sets that fit on a single laptop to large multi-terabyte clinical information in distributed database systems.About Us:Grand Rounds vision is to create a path to great health and health care, for everyone, everywhere. Founded in 2011, the company provides an employer-based platform that delivers improved outcomes for patients and their families. It does this through an end-to-end solution that connects patients with care informed by the latest and best practicespreventing and correcting misdiagnoses and unnecessary or failed treatments. Named second among Glassdoors 2016 Best Places to Work, Grand Rounds helps restore individual health and quality of life, and offers employers lower health care spend and higher employee productivity.In your first 30 days, you will: Onboard with the Grand Rounds team in San Francisco, setup your dev environment, get access to data systems, and become familiar with the tech stackLearn about on-going initiatives involving data scientists, product managers, and engineersSpend time with members of the Analytics, Medical, and Patient Care teams and learn how our teams collaborateBecome familiar with the data landscape and hit the ground running on a primary project In your first 60 days, you will: Accelerate on-going development efforts around physician quality and expertise modelsMaster the ins and outs of claims data: ICDs, CPTs, and all thatCollaborate with engineers to improve the claims warehousing infrastructureCollaborate with engineers to develop a process/pipeline for model updates that seamlessly flows data to production systems In your first 90 days, you will: Integrate into long-term multi-data-scientist ventures and deliver on one or several short-term individual projectsDevelop internal tools and codebases that are useful for other data scientists and/or engineersSpend time with Staff Physicians and other medical domain experts to learn about the world of healthcareDevelop an understanding of both immediate business objectives as well as longer term company aspirations to develop intuition around prioritization and trade-offs between short-term deliverables and longer term R&D; effortsResponsibilities:Develop creative solutions to diverse problems including engineering challenges, unstructured data messes, ontology development, and machine learning applicationsLead and develop major projects from end-to-end encompassing planning, design, technical implementation, debugging, roll-out to Product & Engineering, testing, and iterationOperate at level of sophistication in statistics, machine learning, or computer science that is publication-worthyRegularly monitor pull requests, perform code reviews, and produce excellent peer reviews on projects prior to shipping to Product & EngineeringEvaluate and experiment with new technologies and tools prior to wider adoption by the teamWork closely with analysts, data scientists, product managers, and engineersQualifications:Excellent verbal communications, including the ability to clearly and concisely articulate complex concepts to both technical and non-technical collaboratorsBS with 8+ years or MS with 6+ years or PhD with 3+ years of experience. Degree(s) should be in a technical discipline such as Computer Science, Engineering, Statistics, Physics, Math, quantitative social scienceWork experience as an engineer highly desiredExperience with SQL relational databases as well as big data: the Hadoop ecosystem, Hive, Spark, Presto, Vertica, Greenplum, etcRequired: SQL, Python, R, linux shell scriptingDesired: Scala, Java, or RubyExperience with machine learning and computational statistics packages (sci-kit learn, nltk, statsmodels, networkx, gephi, arules, glmnet, bigrf, caret, igraph, MLLib, GraphX, MADlib, Weka, etc)Experience with visualization tools (seaborn, d3, plotly, bokeh, ggplot2, rCharts, networkD3, Shiny, Tableau, CartoDB, etc)Frequent user of cloud computing platforms such as Amazon Web Services, Microsoft Azure, or Google Cloud PlatformBonus Points for: experience with web application frameworks (Shiny, Flask, Tkinter, Ruby on Rails, Pyramid, Django, etc)Double Bonus Points: previous work on medical applications and/or with claims dataThis is a full time position located in San Francisco, CA.----Grand Rounds is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Grand Rounds considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance."}