{"jobID": "2833070002", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Analyst - Tableau", "companyRating": "3.7", "companyInfo": {"Website": "www.truecar.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (TRUE) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Edmunds.com, Autotrader, Cars.com"}, "estimatedSalary": "74000", "jobDescription": " Job Description:ALG has been the industry leader for forecasting residual values, the amount of retained value a vehicle will have at a future date, for over 50 years. Our forecasts are utilized by every manufacturer and most of the top leasing institutions in North America. The data science team at ALG is responsible for building, maintaining and demystifying the prediction algorithms that power these residual value forecasts leveraged so heavily throughout the automotive industry.  Our team is accountable for every data point we output and strives to provide industry leading analytics that are accurate and accessible. Right now, we're looking for a Data Analyst to work with automotive data sets and a modern technology stack to create and visualize solutions for some of the biggest data questions OEM's are currently facing. This team member will create transparency for our internal and external data products through data visualization along with analyzing our automotive data lake to help build data driven products. We are a mature and tight knit data science team looking to add another great team member ready to make a difference in the automotive industry. Come join us! ABOUT THE JOBBuild, maintain and iterate on Tableau data visualizationsCreate visual reports in Tableau for internal and external clients that summarize findings clearly and effectivelyHelp create visual style that will define the ALG visualization design languageCollaborate closely with Data Scientists to improve existing visuals and build out new onesCollaborate with data engineering teams to insure efficient data pipelines for Tableau ServerWork with product teams to research and develop the analytics that will power new productsOwn your own data analysis projects from the research phase to productionTeam environment that encourages sharing of ideas to build the best predictive algorithmsAd-hoc data analysis and reportingWHAT YOU NEEDEnthusiasm for the automotive industryA passion for using data visualization to tell complex data storiesAbility to communicate complex ideas to any audience, ranging from teammates to business executives2+ years of professional experience creating Tableau dashboardsExperience with publishing and maintaining workbooks on Tableau Server2+ years of experience with database software (RedShift, Hive, SQL, MYSQL, ...)Experience with statistical programming software (Spark, R, Python preferred)Experience with data visualizations (Tableau, R, D3, Excel, Power BI, ...)Bachelor's Degree in Statistics, Data Science, Economics, CS, Engineering or related fieldNICE TO HAVEExperience working with automotive dataExperience with Tableau Server administrationProficiency with data oriented programming in Python (numpy, pandas, scikit, ... )Master's Degree in Statistics, Data Science, Economics, CS, Engineering or related fieldSome shareable examples of data visualizations you have createdLove of Fast and Furious franchise Location(s): Ocean-Santa Monica Office  Associated topics: data analyst, data architect, data integration, data quality, data warehousing, database, database administrator, erp, mongo database, sql"}