{"jobID": "2699635155", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Science Manager, SMB", "companyRating": null, "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": null, "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.The SMB team contributes directly to this mission by connecting every small business in the world with their customers on Facebook, and then helping them grow through solutions like pages, advertising, and messaging. We succeed when we help our customers grow their business.  The SMB team at Facebook is one of two sales channels responsible for Facebooks multi-billion-dollar advertising business. Our team specifically manages more than 99% of Facebooks 6M advertisers. And our potential business is even larger with more than 70 million active SMB pages on Facebook. Were just getting started.  The SMB team is seeking a Data Science Manager who is passionate about using data and insights to drive business strategy, inform its execution, improve efficiency and facilitate clients success at scale. The successful candidate will manage a group of analysts focusing on driving data-informed strategies to deliver value for our SMB clients at scale, creating the data infrastructure and reports to measure our business top goals and KPIs, conducting deep-dive analyses to inform our strategy, and facilitating data driven decision-making. The ideal candidate is passionate about leading and developing a team and about using data and analysis to evaluate program performance and drive clients success in a fast-paced, dynamic environment.  This is a full-time position based in our Menlo Park HQ. Responsibilities:"}