{"jobID": "2796840518", "jobLocation": "Chicago_IL", "jobTitle": "Marketing Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.periscope.com", "Headquarters": "Minneapolis, MN", "Size": "501 to 1000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Martin|Williams, space150, Olson"}, "estimatedSalary": "56000", "jobDescription": " At the end of the day, we believe in one thing: #DoThingsPeopleLove. Every action and decision we make manifests in this notion. Layered within this idea are the opportunities and responsibilities that allow us to practice what we preach. We're looking for a Marketing Data Analyst to join our team! ABOUT THE ROLE This role analyzes customer data to measure marketing campaigns, test & learn what is successful, generate new insights related to customers behaviors and recommend marketing strategies to improve our clients business results. Perform quantitative analyses of customer & transactional data sets to get meaningful insights and improve clients marketing strategy.Use appropriate data sources and manipulate data to carry out methodologies to analyze customer, market, transaction level data sets.Communicate clearly with the Manager, client project leaders, and other analysts to thoroughly understand clients needs, analyze data appropriately and deliver the work products to clients satisfaction.Develop customer contact strategies, including test design, selection criteria, and measurement plans for analyses.Design marketing metrics reports and management dashboards for multiple client accounts using data visualization.SKILLS & EXPERIENCEBA/BS in Finance, Economics, Marketing, Statistics, Engineering or quantitative related field. Masters degree a plus3 Years Marketing or Business Analysis experience using SQL and/or SASExperience in Tableau is desirable.Ability to interpret large and complex marketing datasets for general analyses for different audience typesProficient in Excel (VBA a plus)Experience with planning and executing data for online and offline marketing campaigns, including list acquisition, test design, audience selections, and model score applications is preferred.Prefer familiarity with regression/predictive modeling and other advanced quantitative techniques(clustering, time series)Collaborative, with a problem solving mindsetIntellectually curious, resourceful, with marketing analytics savvyClear and concise communication skillsKnowledgeable in MS Word and PowerPoint EEO Employer"}