{"jobID": "2817522658", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.tetratech.com", "Headquarters": "Pasadena, CA", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (TTEK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Tetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees16,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion dollar company with local, client-focused delivery in 400 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams.Tetra Techs Disaster Recovery Unit is looking for a Data Analyst in our Houston, TX to assist in calculating the cost of damages incurred by our clients during recent disasters. This is a non-traveling role, but may develop into a traveling position following mastery of the material. Collecting and preparing necessary documentation to support development of FEMA Project Worksheets (PWs) Reviewing and organizing timesheets and employee work logs Reviewing and organizing labor policies, pay rates, and fringe benefit information Reviewing and organizing invoices and other cost documentation Working with Project Controller as necessary to identify corrections needed for missing support and cost documentation for the PW Working with Project Controller to recommend improvements to processes in order to work more efficiently as well as train new staff. Performing ad hoc data analysis Performing ad hoc data entry and reconciliation Preparing PW closeout packages Preparing PW Requests for Reimbursement (RFRs) Job Roles will progress and change as experience is acquired. Every employee begins as a back-room analyst as a way to grasp the work at hand. These back-room activities will include data entry and reconciliation, payroll verification, and file organization, among others. Individuals who display extreme competency at assigned tasks may eventually be given the opportunity to take on a larger role in the disaster recovery process, including communication with clients and/or FEMA representatives. The ideal candidate will have: Bachelor's degree preferred Strong reading comprehension and ability to understand and apply FEMA program policies and guidance (which will be guided, but largely self-taught) Significant experience will Microsoft SharePoint and Excel Ability to research policy questions and apply acquired knowledge Intuition and forward-thinking is a plus while working to accomplish goals Must be motivated and results-oriented Manage multiple tasks, time and deadlines efficiently Participate actively in meetings Professional self-presentation and communication Extraordinary attention to detail For more information on our company, please visit our website at www.tetratech.com. To apply, please submit your resume and cover letter on the Careers portion of our website at www.tetratech.com/careers.  We thank all applicants for their interest; however only those selected for an interview will be contacted. Tetra Tech is committed to creating a diverse environment and is proud to be an Equal Opportunity Employer. We invite resumes from all interested parties including women, minorities, veterans and persons with disabilities.  Tetra Tech is a VEVRAA federal contractor and we request priority referral of veterans for available positions.  EOE AA M/F/Vet/Disability - No calls or agencies"}