{"jobID": "2817607176", "jobLocation": "Bridgewater_NJ", "jobTitle": "Project Lead (Director) Statistician, Global Medical Affairs and Data Sciences", "companyRating": "3.5", "companyInfo": {"Website": "www.sanofi.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SNY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, GlaxoSmithKline"}, "estimatedSalary": "83000", "jobDescription": " Responsibilities: Lead statistician on a product project team or within a Business Unit for Medical Affairs. With general guidance from the Biostatistics Medical Affairs and Data Mining group heads, assume a leadership role for providing input into product strategy and for statistical support to study designs and execution. Coordinate the activity of statisticians working on the project. Accountable for all statistical aspects of protocols, including quality, relevance from a Medical Affairs perspective, and scientific validity. Provide statistical representation at Medical Affairs meetings. Build relationships with other Medical Affairs' functions to effectively collaborate on designs that may involve real world elements, and to ensure that the objectives meet the needs of the late phase environment. Learn key clinical and life cycle management considerations, to ensure that planned statistical methods are applicable and optimal, and communicate statistical perspective to stakeholders. In some cases incumbent could serve as a subject matter expert in the area of Medical Affairs such as in observational methods, or real world study designs. Responsibilities would also include assisting group heads with the creation and implementation of policies. Requirements: Thorough knowledge of pharmaceutical clinical development, together with Late Phase experience. Potential to serve as statistical consultant for Late Phase activities, based on strong understanding of statistical methods appropriate for Medical Affairs. High level of proficiency in statistical analysis and demonstrated knowledge of current developments in Real World Evidence (RWE) methodologies. Solutions oriented. Strong project management, interpersonal and communication skills. Ability to work independently and to effectively represent the Medical Affairs and Data Mining Biostatistics group in multidisciplinary meetings which may involve Commercial and RWE teams, and influence project teams, management, and external partners as appropriate. Experience managing CROs and consultant groups. Excellent work ethic. Masters or PhD degree in statistics or related discipline with at least 10 or 8 years of pharmaceutical experience respectively, with at least 3 years in the Medical Affairs area. Sanofi Inc. and its U.S. affiliates are Equal Opportunity and Affirmative Action employers committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race; color; creed; religion; national origin; age; ancestry; nationality; marital, domestic partnership or civil union status; sex, gender, gender identity or expression; affectional or sexual orientation; disability; veteran or military status or liability for military status; domestic violence victim status; atypical cellular or blood trait; genetic information (including the refusal to submit to genetic testing) or any other characteristic protected by law. #GD-SA #LI-SA Sanofi is dedicated to supporting people through their health challenges. We are a global biopharmaceutical company focused on human health. We prevent illness with vaccines, provide innovative treatments to fight pain and ease suffering. We stand by the few who suffer from rare diseases and the millions with long-term chronic conditions. With more than 100,000 people in 100 countries, Sanofi is transforming scientific innovation into healthcare solutions around the globe. Sanofi, Empowering Life"}