{"jobID": "2684816103", "jobLocation": "Parsippany_NJ", "jobTitle": "[Environmental] Project Engineer or Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.h2m.com", "Headquarters": "Melville, NY", "Size": "201 to 500 employees", "Founded": " 1933", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " AECOM, Langan Engineering and Environmental Services, WSP"}, "estimatedSalary": "75000", "jobDescription": " Back to Category List > Available Positions > Job Description[Environmental] Project Engineer or Scientist (Full Time) Location: Parsippany, NJ H2M architects + engineers, a multidiscipline architectural, engineering, environmental consulting firm seeks Geologists / Environmental Scientists/Engineers to join ourParsippany, NJ office. This position will support the Environmental Services Division in the performance of site assessments, hydrologic investigations, remedial investigations, remedial planning/design, and remediation activities. This position has a strong focus on soil, groundwater and air/vapor sampling, subsurface delineations, data evaluation and remedial activity oversight. Job Responsibilities:Assist in preparation of work plans, field sampling plans, quality assurance project plans and health & safety plans and technical reports.Conduct field work including soil boring and well installation oversight; aquifer testing; remedial pilot tests; remedial construction oversight, and remedial system operation and maintenance.Phase I Environmental Site Assessments and Preliminary Assessments.Close interaction, coordination, and supervision of field crews, subcontractors, remediation contractors, laboratories and vendors.Data tabulation, data review and evaluation, and report writing.Preparation of site maps, cross-sections, groundwater contour maps, and other graphics to support reporting data collected.Preparation of electronic data deliverables consistent with regulatory requirements.Communicate project updates and/or relevant information with project teams and clients.Track task budgets and schedules.Other like duties as assigned.Education and Qualifications:Minimum of a Bachelor’s Degree in Environmental Engineering, Environmental Science, Geology or closely related discipline.2-5 years of environmental consulting experience.Ability to perform field work (sampling, field oversight, operation & maintenance).Knowledge and understanding of NJDEP environmental regulations and technical guidance.Ability to lift up to 30lbs.Hazwoper training required.Excellent oral and written communication skills.Knowledge of federal and state environmental laws, regulations and guidance.Self-motivated individual with strong desire to learn.Valid Driver’s LicenseWe offer a comprehensive benefit package including medical/dental/vision insurance with HSA & FSA, life and LTD insurance, 401(k) with matching contributions, annual bonus, tuition reimbursement, and excellent professional development program.our staff A firm doesn’t reach its 80th birthday without the contributions of a highly skilled and dedicated staff. At H2M, our people are at the heart of everything we do, and we’re always seeking new talent to join our team. Whether you’re a college student or a seasoned professional, we offer career opportunities at every level, in areas ranging from architecture to administration.  We’re passionate about our work, dedicated to our clients, and committed to our legacy. We emphasize collaboration and community involvement and promote sustainability in our practice, ensuring that the right projects are developed with minimal impact on the environment. Our integrated approach to design incorporates the diverse voices and visions of our staff into every project. Through mentoring, peer reviews, and professional development opportunities, employees at every level are offered the opportunity to share best practices and gain new experiences. our approach Since our early roots, our focus has remained steadfast: to provide quality service with sound judgment and to serve as an honest professional resource to our clients. With a dedicated, responsive staff and multiple service offerings under one roof, we blend “can-do” with “can-be,” developing real, workable solutions with a dose of innovation. Our diverse in-house expertise reduces the need for sub-consultants and ensures that our architects and engineers develop a comprehensive understanding of every project.  Providing solutions to a wide variety of markets, H2M brings the combined expertise of architectural design and building systems engineering to make your project a reality. With in-house MEP and structural teams, we’re able to take a holistic approach to project design that combines a practical approach with creative results  http://www.h2m.com EOE/M/F/D/VIf you would like to set profiles, manage, and track your submissions you can register here...or if you already have an account you may login here...or⋅ ⋅"}