{"jobID": "2739162497", "jobLocation": "Palo_Alto_CA", "jobTitle": "Climate Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.oneconcern.com", "Headquarters": "Palo Alto, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "One Concern is a startup which specializes in Artificial Intelligence for Natural Disasters. With our team of global disaster scientists and engineers, we have developed a platform that helps emergency responders prepare for and make the most critical decisions during the first moments of a crisis, with the main goal of saving lives.We are looking for Data Scientist specializing in Climate modeling to join our team at One Concern. This role will work on development and improvement of machine learning models in climate forecasting and impact analysis.We work in a highly collaborative, challenging and exciting environment. Our engineering challenges are unique, so you should be comfortable stepping in uncharted territory and excited to create systems that can scale to all disasters and geographies. If you are problem solver, think out-of-the-box, love challenging yourself, and want to work for a cause, we would love to have you at One Concern.We are committed to a workplace that reflects the community we serve. We especially encourage women, people of color, and others who are underrepresented in the tech industry to apply.What you will do: Develop and improve machine learning models for climate forecasts and seek for scientific and technological improvementsEvaluate model predictions and quantify uncertainties between observed and predicted outcomes using statistical and GIS toolsCollaborate with an interdisciplinary team of software engineers and data scientists on cross-functional projects, interpreting data, and translating into actionable insightsProvide support on ad-hoc analysis and reportsMust-haves:PhD (preferred) or Masters degree in Atmospheric Sciences, Civil Engineering, Natural Resources, Physics, Computer Science or related fieldSolid background with climate models and numerical modeling (e.g. numerically solving PDEs)1+ year experience in machine learning, statistics and quantitative analyticsAdvanced experience with scientific computing in an interpreted language, e.g. Python, Fortran etc. and parallel programming in GPU;Strong drive to learn new topics and skills and to develop innovative products for our customers.Good to have:Experience linking measurement data with process-based models (e.g. via data assimilation, calibration, optimization and/or performance testing) with a strong publication record is a big plus;Broad knowledge of measurement techniques including field, laboratory, and remote-sensing based approaches;Understanding of MySQL, Postgres, Redshift, relational databases etc. Perks and Benefits Market-competitive salary plus equityComprehensive medical, dental, and vision insuranceDaily lunches, and a fully-stocked kitchenGenerous PTO policyTeam off-sitesFlexible working hours"}