{"jobID": "2795120493", "jobLocation": "Lawrenceville_NJ", "jobTitle": "Associate Research Scientist - Immunology", "companyRating": "3.9", "companyInfo": {"Website": "www.alphaconsulting.com", "Headquarters": "East Brunswick, NJ", "Size": "201 to 500 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " The Judge Group, Randstad, Kforce"}, "estimatedSalary": "55000", "jobDescription": "ASSOCIATE RESEARCH SCIENTIST - IMMUNOLOGYLAWRENCEVILLE, NJProject Description: Contributes to the development and implementation of immunoassays for the analysis of nonclinical and clinical pharmacokinetic, immunogenicity, and biomarker samples in discovery and regulated environment. Primary responsibility will be the analysis of samples using qualified methods to support drug discovery and development programs.Contributes to preparation of validation and other analytical reports and study reports.Contributes to reporting study sample results to clients following the departmental policies and procedures.Participates in troubleshooting assays when problems arise.Communicate laboratory results in project team and department meetings. Contributes to the preparation and presentation of scientific material at internal and external meetings.Required Skills:Require a minimum of BS, or equivalent experience in relevant scientific discipline biology, biochemistry, etc. with minimum relevant experience, 5 plus years for non-degreed, 2 years for BS.Have proven technical expertise with execution and troubleshooting of manual methods and immunoassay technologies such as ELISA, ECL (MSD), BIACORE assays.An understanding of the immune system, antibody assays, and experience with clinical or animal studies is extremely desirable.Experience with automated sample management systems is desirable. This 6+ month position starts ASAP. ALPHA'S REQUIREMENT #18-00748MUST BE ELIGIBLE TO WORK IN THE U.S. AS AN HOURLY W2 EMPLOYEE"}