{"jobID": "2738244738", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Marketing Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.fyber.com", "Headquarters": "Berlin, Germany", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Public (FBEN) ", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " The Product Marketing Manager (PMM) will partner closely with the product and the business teams to develop and execute Fybers product strategy and vision. As part of the product team, the PMM will develop deep knowledge and expertise in certain geo and product areas (e.g. video, data, private pipes, buy side tools, inventory quality, etc.), and has a product manager counterpart with whom they work closely to create and implement product area roadmaps and to develop/execute go-to-market plans.  The PMM role includes five primary responsibilities: Market and competitive intelligence: each of the PMMs owns certain product areas & geos, in which they develop market expertise, to become the internal expert on customer lifecycle, for business and product/R&D; stakeholders (including ongoing education, team expansion, retention, and winback).Develop product positioning and messaging that clearly articulates the benefits and differentiation of Fybers product suite in the market. Plan and drive all go-to-market positioning as well as identify and launch product modifications/ additions to improve customer satisfaction, revenue, and retention.MRD formulation: create MRDs (Marketing Requirements Documents) in their respective product domains based on requirements gathering from customers, sales, competition and internal business stakeholders. The MRDs will feed into the product roadmap.Product launch: create the product go-to-market plan (per the product roadmap) and lead the efforts in collaboration with the product and the marketing teams. Execution of the go-to-market plan will span across different teams, including PM, PMM, marketing, sales, etc.Product business development: engage in business development efforts to find, recruit and integrate with business/tech partners.Support marketing in product positioning, communication & documentation: feed the marketing team with detailed product info, including competitive intelligence, for crafting the external message/positioning of his owned product areas. Work together with the marketing team on creating the necessary product collateral, where PMM responsibility will focus on technical documentation. Educate the market on the product positioning, including our sales, customers & analysts, and for training sales on product capabilities, features and differentiation points. Detailed Responsibilities  Interact with customers & sales on an ongoing basis to gather market requirements in owned product areas. Create and manage frameworks for regular customer and sales connection (e.g. bi-weekly business-product sync, quarterly customer advisory council, regular visits in local offices, etc.) Assist members of the sales team on calls with prospects when appropriate to provide deeper dives into specific product areas. Conduct competitive research in owned product areas and incorporate competitive intelligence into prioritization decisions, product positioning, and sales training. Create MRDs in owned product areas, work with counterpart product manager to build a proposed periodic roadmap in each product area; present/pitch proposed roadmap in roadmap discussions, and participate in related RND new product design sessions. Work with counterpart product manager and the marketing team on building a go-to-market plan for the major product areas/releases (the Big Rocks), including activities such as customer roadshow, PR, collateral development, internal training (sales & CS), etc. Marketing and product marketing will create a go-to-market template the teams can use on the different releases. Own technical documentation development of primary product areas/features (per business/sales requirements), including management of an external writer resource (list of product required collateral will be defined together with marketing and split between the teams). Become product area expert and spokesman both internally and externally to promote the story of the product. Provide ongoing market insights as context for innovation. Engage in business development efforts as it relates to complementing product gaps in owned product areas (with support from other internal stakeholders, e.g. legal, RND)."}