{"jobID": "2828212312", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer, Java/Ruby/Go", "companyRating": "4.1", "companyInfo": {"Website": "www.newrelic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (NEWR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AppDynamics, Datadog, Dynatrace"}, "estimatedSalary": "173000", "jobDescription": "New RelicSenior Software Engineer, Java/Ruby/GoSan Francisco, CA Were a new team building a brand new collection of product features that combine massive volumes of data with powerful, intuitive user interfaces. Are you excited about the chance to build new software from the ground up? Ship it to thousands of customers? Were doing that here at New Relic, and looking for someone who can serve as a technical leader. Someone who can design such a system, build key parts of it, and mentor other engineers to do great work. We will proceed iteratively and enjoy significant autonomy while benefiting from the support and resources of New Relics world-class product team. How do you know if you're right for this job?Passion for and previous experience working with high throughput engineeringStrong abilities as a Java/Ruby/Go software engineerStrong technical leader and mentor on a collaborative teamCapable of working throughout the software stack, data tier to UI tierExperience writing resilient software that runs 24x7Experience with modern software components such as Kafka, Elastic, Kubernetes, etc.Principles and practices of good API DesignNot sure if this is you? If you dont exactly match the above criteria, but this position speaks to you, go ahead and apply, and tell us in a cover letter what you will bring to the team. We will be looking for what our new team member would add to our team culture. Interested? Send along:Resume or CVCover Letter that answers the question: what is the toughest thing you've built that you're proud of?Your online identity (optional): Github, Twitter, blog, and portfolio. If you don't have a profile on Github, links to code samples are also helpful. At New Relic, we hire people who are eager to contribute to our culture, and we empower them to do just that. We take pride in thinking beyond our day-to-day job descriptions and encourage you to actively seek out opportunities to create the type of work environment that you want to be a part of. What does this look like in action? You should be ready to be a culture add to New Relic and spend ~5% of your time finding meaningful ways to make this an even better place to work. A little about us: New Relic provides the real-time insights that software-driven businesses need to innovate faster. New Relics cloud platform makes every aspect of modern software and infrastructure observable, so companies can find and fix problems faster, build high-performing DevOps teams, and speed up transformation projects. Learn why more than 50% of the Fortune 100 trust New Relic at newrelic.com.  New Relic is a San Francisco Best Places to Work award winner, an Oregon Top Workplace award winner, named a leader in the Gartners 2012, 2013, 2014, 2015 & 2016 Magic Quadrant for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high-quality teammates, a standard-setting product, and a company on the move.  Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers.  New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law.  Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.  Interested in the details of our privacy policy? Read more here: https://newrelic.com/termsandconditions/applicant-privacy-policy  #LI-BF1"}