{"jobID": "2722488709", "jobLocation": "Washington_DC", "jobTitle": "Senior PeopleSoft Functional Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "Clearance Level Must Currently Possess:No Active Clearance RequiredClearance Level Must Be Able to Obtain:No Active Clearance RequiredSuitability:Public TrustJob Family:Information TechnologyJob Description: Can you imagine being a vital member of team that is working to complete a major federal government initiative? Can you imagine working side-by-side with a team dedicated to improving our government human resources (HR) and payroll system for the U.S. Coast Guard? CSRA is seeking a talented and adept Senior PeopleSoft Functional Analyst. State of Affairs CSRA has a long history of providing functional and technical analyses of Coast Guard HR business practices and software. We have provided recommendations related to system design, system upgrades, configuration or customization, requirements/business process, and policies and procedures. For each technical project, the CSRA Team complies with Coast Guard system development life cycle (SDLC) guidelines for development and documenting and the Coast Guard Enterprise Architecture standards at all times. Having supported the USCG for over nine years, CSRA has a highly skilled team of professionals who are intimately familiar with Coast Guard HR and Payroll practices, the laws and policies governing them, and the technologies currently in use to support them. What will you be doing each day? You will serve as the Lead Functional ERP Consultant and perform this role with minimal direction. You should understand configuration and integration between major functional areas. You will be translating customer requirements into a best fit within the application, and develop processes and documentation that support the SDLC. You will contribute to the overall strategic vision, and integrate a broad range of ideas regarding implementation and support. Each week you will be undertaking implementation and support projects involving single disciplines that may affect multiple business units. You will comply with approved SDLC processes and are responsible for all related SDLC artifacts. You will also document system processes and requirements traceability.  You will be drafting, reviewing and maintaining SDLC documentation. You will be conducting and leading the PeopleSoft HCM 9.2 upgrade effort. This upgrade will require you to define and direct definition of test scenarios and scripts. You will propose options to fill gaps through product configuration, customizations and extensions, or third-party products. While also identifying and documenting gaps between requirements and Commercial Off-the shelf (COTS). You will conduct and lead demos, Conference Room Pilots, and Fit/Gap sessions. As a final point, you will lead requirements elicitation, capture, and management. What are the Requirements for this role?US Citizenship is requiredAbility to obtain Public Trust security clearanceBachelors’ degree and 10 years PeopleSoft ExperienceIn-depth knowledge of core PeopleSoft HCM and Global Payroll, version 9.1 and 9.2Ability to facilitate understanding of existing and new functionality, identification and resolution for areas where business processes depart from delivered PeopleSoft 9.1 and 9.2 software solutions and to recommend best practices from past experienceExperience with all phases of ERP application development including requirements analysis, fit/gap, design, development, test and deploymentExperience with all phases of application testing including system, integration, parallel, etcExperience supporting PS 9.2 upgrade strongly preferred.Knowledge of military human resources and payroll processes strongly preferred.Ability to manage expectations under shifting and/or changing prioritiesTelecommuting is permitted; however, you must be able to work onsite two days a weekFor candidates outside of the Washington, D.C. Metro area, we may be willing to reimburse for travel related expenses #dicepost  #cjobs  #gdjobs # of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Some Telecommuting AllowedWork Location:USA DC Washington - 2701 Martin Luther King Ave SE (DCC129)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}