{"jobID": "2782601661", "jobLocation": "Parsippany_NJ", "jobTitle": "Data Scientist Co-Op", "companyRating": "3.6", "companyInfo": {"Website": "www.gaf.com", "Headquarters": "Parsippany, NJ", "Size": "1001 to 5000 employees", "Founded": " 1886", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Johns Manville, CertainTeed, Owens Corning"}, "estimatedSalary": "96000", "jobDescription": " Come Build Your Career Under OUR RoofJob Description:SUMMARY The data science coop will help GAF develop greater insights around customer behavior  and market conditions for all facets of its business. The coop will work with the data  scientist to develop predictive models and visualizations that inform GAF’s go to market  programs and direct marketing campaigns. The position will also work across functional  departments to understand the various data sources and data structures in the course of  performing her duties. The position will also recommend improvements to methods of  using data and analytics techniques for measuring marketing campaigns productivity and  results. The Data Science Coop will assist in the investment review of new platforms,  apps, and solutions with a particular eye on the data structures and the integration of new  technologies into existing platforms. ESSENTIAL DUTIESDevelop Data Science Solutions to Optimize Marketing CampaignsCo-engineer and be responsible for advanced segmentation models (i.e., clustering, classification, other) that improve targeting of marketing campaigns.Work in an administrative role with IT to integrate advanced segmentation models as solutions in platform systems (i.e., Marketing Automation and CRM).Co-engineer and be responsible for digital and social media analytics using multi-variate models and Google Analytics.Work in an administrative role with IT to facilitate a leads management program with integration between Marketing Automation and CRM platforms.Co-engineer and be responsible for email suppression models to Minimize subscriber opt-outs (i.e., predict opt-out).Work in an administrative role with IT to integrate email suppression models as a solution in Marketing Automation platform.Co-develop campaign/customer trends and insight visualizations using Tableau.Market DataCo-engineer data acquisition strategies to meet aforementioned modeling requirements.Help develop map of marketing and sales data sources and assure that these sources are optimized to work together.Work in an administrative role with IT to warehouse targeted data feeds (i.e., public and proprietary databases, social, and web).Work in an administrative role with IT to integrate 3rd Party data from existing marketing vendors, apps and others and include data in appropriate reporting.Co-engineer and be responsible for industry forecasting models.Corporate program SupportWork with the BI team and other departments to optimize and enhance GAF data structures related to marketing data science.Work in an administrative role with IT to ensure that market data is always available, reliable and clean.Perform ad-hoc duties as may be assigned.LEVEL BASED COMPETENCIES:Building Strategic Working RelationshipsBusiness Acumen associated with Value ChainsExcellent written and verbal communication skillsData Science and Analytics Domain KnowledgeAble to multi-task and has ability to work cross-functionallyTechnical skillsITIL Foundation Study (Certification preferred)Basic knowledge of MuleSoftBasic knowledge of Microsoft DynamicsBasic knowledge of Oracle Eloqua and CompendiumBasic knowledge of SQLBasic knowledge of Microsoft Project and VisioBasic knowledge of Digital Asset Management and Content ManagementBasic experience with large data sets and databasesIntermediate proficiency with StatisticsGeneral knowledge/skillsBasic ability to present complex information in simple termsBasic ability to draft queries of databasesEntry market knowledge of residential and commercial construction industryEntry financial statement analysisIntermediate project management skillsEducation/Experience Working towards Bachelors of Science in Data Analytics or Computer Science or StatisticsWe believe our employees are our greatest resource. We offer competitive salary, benefits, 401k, and vacation packages for all full time permanent positions. We are proud to be an equal opportunity workplace and GAF, SGI, and Siplast are proud to be affirmative action employers. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need that requires accommodation, please let us know. If applying for positions in the U.S., must be eligible to work in the U.S. without need for employer sponsored visa (work permit)."}