{"jobID": "2830912283", "jobLocation": "El_Segundo_CA", "jobTitle": "Experienced Command & Data Handling Engineer", "companyRating": null, "companyInfo": {"Website": "www.boeing.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1916", "Type": " Company - Public (BA) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Lockheed Martin, Northrop Grumman, Airbus"}, "estimatedSalary": null, "jobDescription": " El Segundo,California,United States  6E3DP4As an Experienced Flight Systems Engineer you will develop and manage Command and Data Handling systems for Boeing satellite programs. Typical assignments will include requirements definition and flow down, systems design and analysis, systems integration, test, and verification.  In this position you will have the opportunity to work with senior management and technical experts across multiple disciplines including subsystem engineering, software architecture, Communications Security (COMSEC), software validation, electronic hardware testing, spacecraft level testing, and end to end system engineering. In this role you will be responsible for: Developing solutions to assure customer satisfaction.Performing trade studies to meet program requirements.Performing analyses to evaluate and optimize total system performance to meet customer autonomous operation requirements.Resolving technical issues and ensuring the spacecraft and system are flight worthy prior to delivery.Working under general direction of senior Command and Data Handling. Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.  This position requires an active Single Scope Background Investigation (SSBI)/Special Program Access (SPA) U.S. Security Clearance. (A U.S. Security Clearance that has been active in the past 24 months is considered active). Typical Education & Experience:  Degree and typical experience in engineering classification: Bachelor's and 9 or more years' experience, Master's with 7 or more years' experience or PhD with 4 or more years' experience. Bachelor, Master or Doctorate of Science degree from an accredited course of study, in engineering, computer science, mathematics, physics or chemistry. ABET is the preferred, although not required, accreditation standard. Basic Qualifications (Required Skills/Experience):Strong communication (both written and verbal)Proficient public speaker and ability to grow into lead positions that require diverse backgroundsProject leadership experienceAbility to develop solutions to complex technical problemsAbility to lead projects and drive issues to closureAbility to work with customer, program office, test, and operations personnelPreferred Qualifications (Desired Skills/Experience):Systems Engineering experienceStrong electrical engineering skillsCCSDS and IP (Internet Protocol) experience1553, SpaceWire, CAN experienceCOMSEC/CRYPTO/TRANSEC experienceMATLAB, VBA tool development experience Yes, 10 % of the Time  Space and Launch  Individual Contributor  No  No  Standard  United States; The Boeing Company"}