{"jobID": "2835297748", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Research Engineer/Scientist I", "companyRating": "4.3", "companyInfo": {"Website": "www.mtu.edu", "Headquarters": "Houghton, MI", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Position Information Position Title Research Engineer/Scientist IDepartment Michigan Tech Research Institute (MTRI)Location Michigan Tech Research Institute (Ann Arbor, MI)Position Type StaffFull-time/ Part-time Full-timeFull-Time Equivalent (1.0=100%) 1.0Appointment Term 12 MonthPay Type Salary BasisSalary or Hourly Rate Negotiable based on ExperienceShift 1stPosition Duration Dependent on External Funding? YesTitle of Position Supervisor Sr. Research Scientist/Engr II Position Summary InformationTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Job Description SummaryMTRI is seeking a highly motivated, intellectually curious professional interested in conducting cutting edge research in signal processing, data science and remote sensing and developing an externally supported research portfolio. This individual will support multiple projects for our government and commercial customers, and will work with senior engineers and scientists to research, develop and evaluate algorithms for a variety of signal and image processing, and geospatial applications. This person may also support numerical analysis and simulation on projects involving a variety of sensor phenomena. The successful candidate will have a solid background in applied mathematics, statistics, signal processing, and machine learning. The ideal candidate would have experience writing scientific software and applying such software tools to solve real world problems.Essential Duties & Responsibilities (other duties may be assigned)1. Participate as an integral team member on multi-disciplinary research relating to applying technological skills to solving governmental and societal needs. Provide technical, analytical and numerical support for research and development projects in the areas of mathematics, statistics, programming, electrical engineering, and signal processing.Derive, implement and evaluate signal and data processing algorithms.Develop prototype software and evaluate performance on dataContribute technical expertise to symposia, journal articles, and technical reports.Prepare and deliver reports or presentations of research projects/analysis results to project sponsors as appropriate.Contribute to the generation of proposals and external funding.Apply safety-related knowledge, skills, and practices to everyday work.Encourage continuous improvement practices among employees. Commit to applying continuous improvement strategies to strategic goals and leadership skills.Required Education (minimum requirements)• PhD degree in mathematics, statistics, computer science, electrical engineering, or a similar related field, and 1 year related research experience either as part of degree program or post-degree."}