{"jobID": "2805201936", "jobLocation": "Novi_MI", "jobTitle": "Sales Administrator", "companyRating": "4.5", "companyInfo": {"Website": "www.michigancat.com", "Headquarters": "Novi, MI", "Size": "501 to 1000 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Alta Equipment"}, "estimatedSalary": "54000", "jobDescription": " ObjectiveA Sales Administrator plays the important role of closing off the tail end of a Machines Sales Agreement, whether it be New, Used, or a Rental equipment. Your close attention to detail and ability to pull everything together will ensure that all internal customers are happy, and external customers satisfied with the investment they are makingResponsibilities Preparation of New Machine Sales Quotes, ensuring it meets profitability guidelines, taking into account all costs involvedUpon receiving Machine Sales Agreements for New, Rental, and Used Equipment, review for the following:Verification of machine availability according to requested specifications. Work with Asset Management, Sales/Account Representatives, and Customers on acceptable modifications based on availabilityResponsible for ordering of attachment kits and other add-ons according to final machine specificationsWorks with Service department to obtain quotes on any service repairs or modifications and ensure all applicable costs are added to the overall Sales AgreementCoordinates with the Credit Department to ensure the customer has been approved for the proper level of credit for the Sales AgreementArranges for transportation of the machine to the customer.Collects proof of delivery of machine according to manufacturerProcessing and filing of all documentations relating to machine demonstrations, lease purchase agreements and rental conversion agreements.Calculation/verification of interest owed on rental conversionsReviews vendor invoices ensuring accuracy of costs billed. Approve, scan and submit invoice(s) to Accounting Department for payment. OCCASIONAL/OTHER RESPONSIBILITIES: Order office supplies for departmentWork with Third Party vendors/suppliers to schedule installation of components as necessaryCompile historical sales information as requested QualificationsMinimum Requirements Bachelors Degree in Business or similar, or equivalent experiences in an Sales Support functionIntermediate Excel skillsStrong communication ability both oral and writtenDetail oriented, self-starting individual capable of working by themselves as well as in a team Nice to have Finance/Accounting experiencePrior experience in a rental business or construction equipment businessDisclaimer Any Duties and Responsibilities described within the Careers Page are not a comprehensive list, and the scope of the job may change as necessitated by business demands. Michigan CAT is an Equal Opportunity Employer Qualified applicants will receive consideration for employment without regards to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, or protected veteran status.  Equal Employment Opportunity is the Law  Equal Employment Opportunity is the Law – Poster Supplement"}