{"jobID": "2787670037", "jobLocation": "San_Carlos_CA", "jobTitle": "Sr. Clinical Data Manager", "companyRating": "2.8", "companyInfo": {"Website": "www.natera.com", "Headquarters": "San Carlos, CA", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Public (NTRA) ", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "POSITION SUMMARYThe Senior Clinical Data Manager is responsible for providing clinical data management support to clinical operation team. Leads EDC database specification and manages all aspects of clinical trial data to support the development, validation, and commercialization of first-in-class assays interrogating circulating tumor DNA (ctDNA) for the non-invasive detection and diagnosis of various cancers.PRIMARY RESPONSIBILITIESResponsible for the implementation of EDC for various studies in NIPT and oncology.Responsible for developing and maintaining Data Management Plan throughout the studies.Develop clinical trial data specifications, including eCRF design, user requirements, query logic and data validation.Ensure clinical data within EDC is in high quality to lock/unlock and freeze/unfreeze as appropriate for statistical review.Coordinate the archiving of study databases and related documents.Perform site training for EDC and perform site close-out audit.Ensure data system compliance by following the established guidelines (e.g. FDA).Participate in the preparation and presentation of data.This role works with PHI on a regular basis both in paper and electronic form and has an access to various technologies to access PHI (paper and electronic) in order to perform the job.Employee must complete training relating to HIPAA/PHI privacy, General Policies and Procedure Compliance training and security training as soon as possible but not later than the first 30 days of hire.Must maintain a current status on Natera training requirements.Employee must pass post offer criminal background check.QUALIFICATIONSBachelors degree in data science, other relevant discipline, or equivalent required. Advanced degree preferred.Minimum of 5 years of experience in managing EDC for medical device or in-vitro diagnostic device trials.KNOWLEDGE, SKILLS, AND ABILITIESFamiliar with the FDA regulations relevant to clinical trials and EDC.Proficiency in MS Word, Excel and PowerPoint.Good organization and planning skills.Strong interpersonal skills and communication skills (both written and oral).Strong leadership skills, self-motivated, adaptable to a dynamic and fast paced environment.Ability to collaborate with the study team, cross functional team members and external collaborators.PHYSICAL DEMANDS AND WORK ENVIRONMENTDuties typically performed in an office setting.This position requires the ability to use a computer keyboard, communicate over the telephone and read printed material.Duties may require working outside normal working hours (evenings & weekends) at times.OUR OPPORTUNITY Driven by the passion for elevating the science and utility of genetic testing, Natera is committed to helping families identify and manage genetic diseases. Natera is a rapidly-growing diagnostics company with proprietary bioinformatics and molecular technology for analyzing DNA. Our complex technology has been proven clinically and commercially in the prenatal testing space and we are actively researching its applications in the liquid biopsy space for developing products with oncology applications. The Natera team consists of highly dedicated statisticians, geneticists, doctors, laboratory scientists, business professionals, software engineers and many other professionals from world-class institutions, who care deeply for our work and each other. When you join Natera, youll work hard and grow quickly. Working alongside the elite of the industry, youll be stretched and challenged, and take pride in being part of a company that is changing the landscape of genetic disease management.WHAT WE OFFER Competitive Benefits. Healthy catered lunches, Premium snacks and beverages, Onsite gym with cardio and weight-training equipment, Game room with satellite TV, Onsite dry cleaning and alteration service with pick-up and delivery, Employee-organized sport leagues, Happy hours and BBQs, Generous Employee Referral program.  For more information, visit www.natera.com. Natera is proud to be an Equal Opportunity Employer."}