{"jobID": "2802528050", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Growth Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lime.com", "Headquarters": "Bridgetown, Barbados", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Lime is a technology company that is changing how people get from point A to B via our fleet of shared Lime-S electric scooters and Lime-E e-assist bikes. We're empowering our communities with new mobility options that are clean, affordable, and a ton of fun!At Lime, we make hard, data-driven decisions every day, from optimizing hardware manufacturing process to software prioritization and supply positioning. As a senior growth analyst, you will identify challenges and opportunities to delivering an amazing customer experience. You will work closely with the data engineering team to build pipelines that deliver insights and closely with the growth and product teams to build innovative solutions to dockless sharing challenges. You will develop a firm understanding of what metrics can be used to derive insight, and what measurements need to be collected to fill the gaps. Your insights will help guide the vision and priorities of the company.Requirements4+ years experience in using statistical analysis software to solve real problemsMasters or PhD in a STEM fieldStrong math and statistics fundamentalsIndependence in retrieving and transforming warehoused dataStrong research and modeling skills as evidenced by scopeAnalytical thinking, healthy skepticism, and time management skills- 4+ Experience in using statistical analysis software to solve realWe here at Lime strive to build a workforce comprised of individuals with diverse backgrounds, abilities, minds, and identities that will help us to grow, not only as a company, but also as individuals. Lime is an Equal Opportunity Employer."}