{"jobID": "2795184687", "jobLocation": "Glendale_CA", "jobTitle": "Data Sourcing Analyst, Assistant Vice President", "companyRating": null, "companyInfo": {"Website": "www.mufg.jp", "Headquarters": "CHIYODA-KU, Japan", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (MTU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Join a financial group that's as committed to your future as you are. At MUFG, we share a vision for our future, we share our successes, and we strive to bring out the best in each other in everything we do. Our 14,000 diverse colleagues are connected by a common ambition to create change for the better-from forging more dynamic career paths, to driving progress in our communities, to continuously reshaping the standards of global financial services. Positive impact starts here; see the change you can make as we strive to become the world's most trusted financial group.Main Responsibilities:Create/Deliver Business Requirements:The Business Analyst is responsible for possessing an appropriate level of subject matter expertise and to effectively engaging the appropriate business partners in order drive the dialogue required to define the requirements of the business and for authoring quality Business Requirements in a fashion that will allow down line partners to leverage these artifacts to create the functional and technical requirements.Support Translation of Business Requirements into Functional/Technical Specifications:The Business Analyst is a key partner with Technology in helping the technology group in understanding the Business Requirements and ensuring these requirements are translated into functional and technical requirements in a fashion that will ensure the business requirements will be satisfied.Support Creation of Test Scripts:The Business Analyst will support the business by partnering with the appropriate SME's in the review of test scripts for UAT and partner with Technology in reviewing test scripts for SIT in a fashion that will ensure the scripts created for testing (SIT and UAT) will demonstrate the design and build can be tested against supporting the original Business Requirements.Manage Traceability and Support Testing:The Business Analyst will partner with business SME's on Testing to ensure that test results show that business requirements were satisfied by the project workExtensive knowledge of the MetaCenter application and it's use in  capturing and organizing technical metadata.Working knowledge of the Collibra application and it's use for managing  business metadata.5+ years' experience in data sourcing and financial services  environment.Ability to drive dialogue involving line of business and technical  teammates to reach consensus on data issues.Self-directed individual with effective communication and presentation  skills.Six sigma certification is a plus. The  above statements are intended to describe the general nature and level of work  being performed. They are not intended to be construed as an exhaustive list of  all responsibilities duties and skills required of personnel so classified.  We are proud to be an Equal Opportunity / Affirmative Action Employer and  committed to leveraging the diverse backgrounds, perspectives, and experience  of our workforce to create opportunities for our colleagues and our business.  We do not discriminate in employment decisions on the basis of any protected  category.  A conviction is not an absolute bar to employment. Factors such as the age of  the offense, evidence of rehabilitation, seriousness of violation, and job  relatedness are considered in all employment decisions. Additionally, it's the  bank's policy to only inquire into a candidate's criminal history after an  offer has been made. Federal law prohibits banks from employing individuals who  have been convicted of, or received a pretrial diversion for, certain offenses."}