{"jobID": "2822952616", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist, GS-13/14/Counterintelligence Division", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Title Data Scientist, GS-13/14/Counterintelligence Division, Washington, DC ID 19773 Location WASHINGTON, DC Regular/Temporary Regular  Who May Apply  Open to  ALL  U.S. Citizens  Opening Date:  6/19/18  Closing Date:  7/3/18  11:59 pm (EST)  Questions regarding this opening should be directed to  Robert White  at  (see application details)  or  (see application details)  Job Summary  Position:  Data Scientist, GS-13/14  Division:  Counterintelligence Division  Unit:  Data & Technology Exploitation Unit  Location:  Washington, DC  Working Hours:  8:00AM - 5:30PM  Salary:  GS-13:  $96,970 - $126,062  GS-14:  $114,590 - $148,967  Full Performance level:  GS-14  Number of Positions Available: 1  Duration:  Full Time/Permanent  Additional selections may be made from this announcement to fill positions within the same division when the position includes substantially the same duties, responsibilities, and qualifications.  Key Requirements  Must be a U.S. citizen  Must be able to obtain a Top Secret-SCI clearance  ALL applicants must verify completion of the basic education requirement by submitting a copy of college transcripts by the closing date of the vacancy announcement.  Mission Statement:  The mission of the FBI is to protect the American People and uphold the Constitution of the United States.  Major Duties  :  GS-13:  Integrates and prepares large, varied datasets for analysis. Identify and assess data attributes using statistical software packages in order to develop recommendations and analytical processes based on mission requirements.  Obtains critical information from cross-referenced datasets in support of Intelligence production and operations, while collaborating with counterparts, customers, data stewards, project/program managers, and other IT teams.  Researches, develops, implements and utilizes statistical methods and strategies to address tactical and strategic problem sets, while w orking with a technical team.  Interprets and analyze sdata collected from a variety of sources using exploratory and statistical techniques, validating findings using an experimental and iterative approach.  Coordinates multifaceted scientific research and analytic activities and provide scientific and technical consultation about applicable best practices and new techniques.  Conducts studies to provide realistic assessments of the spectrum of anticipated threat scenarios and to aid in identifying needed technologies and methodologies.  GS-14:  In addition to the above, the selectee  Models complex problem sets to help discover insights and identify opportunities through the use of statistical, algorithmic, mining and visualization techniques.  Designs and implements or coordinates systematic and rigorous scientific procedures for determining reliability, validity and statistical confidence associated with specific technologies and methodologies.  Presents key findings and methodology to counterparts, stakeholders and executives.  Qualifications and Evaluations  Your application will be evaluated and rated under the FBI's Candidate Rating Procedures. Your resume and supporting documentation will be used to determine whether you meet the job qualifications listed in this announcement and will be compared to your responses to the online assessment questionnaire. High self-assessment in the vacancy questions that is not supported by information in your resume, and/or supporting documents may eliminate you from Most Competitive status.  Your application will then be placed in one of three categories: Most Competitive, Competitive, or Least Competitive. Names of candidates in the Most Competitive category will be sent to the hiring official for employment consideration. Veterans' preference will be applied.  All applicants will be rated on the following Competencies:  Advanced Mathematical Reasoning  Algorithms  Analytic Thinking  Data Analysis  Positive Education Requiremen  t  This position has a specific education requirement; all applicants must verify completion of this basic educational requirement by submitting a copy of their college transcripts by the closing date of the vacancy announcement.  BASIC REQUIREMENTS: ALL APLICANTS MUST MEET THE BASIC REQUIREMENTS BELOW:  A. Degree: Mathematics, statistics, or actuarial science. The degree must be in a major field of study (at least at the baccalaureate level) that is appropriate for the position.  OR  B. Combination of education and experience: Courses equivalent to a major field of study as shown in paragraph A above, plus additional education or appropriate experience.  Education completed in foreign colleges or universities may be used to meet the above requirements provided you can show foreign education is comparable to that received in an accredited educational institution in the United States.  IN ADDITION TO MEETING THE BASIC REQUIREMENT ABOVE, APPLICANTS MUST MEET THE SPECIALIZED EXPERIENCE (SE) REQUIREMENTS BELOW:  Specialized Experience (SE):  Please make sure your specialized experience/requirement(s) can be identified in your resume. Applicants must meet the qualification requirements by the closing date of this announcement.  GS-13:  Applicant must possess at least one (1) year of specialized experience (SE) equivalent to the GS- 12 grade level. SE is defined as follows:  Acquiring, processing and measuring data for research purposes utilizing scientific methods.  Developing recommendations and processes to improve the operational performance of data systems.  GS-14:  Applicant must possess at least one (1) year of specialized experience (SE) equivalent to the GS-13 grade level. SE is defined as follows:  In addition to the above SE, the selectee will be:  Developing models and collecting/analyzing data using computer programming techniques.  Designing and implementing scientific procedures for determining the reliability, validity and statistical confidence associated with specific technologies and methodologies.  How to Apply  The following instructions outline our application process:  Step 1: Click the \"Start\" button to begin an application. You will be prompted to either Sign In to continue the application or to register with FBIJOBS if you don't already have an account.  Step 2: Follow the Step by Step process to submit an application. You will be guided through each step in the process. You are required to complete all sections of the application to successfully submit your application.  Required Documents  To apply to this position, interested applicants must provide a complete application package by the closing date which includes:  Your resume, specifically noting relevant work experience and associated start and end dates  A complete assessment questionnaire  Other supporting documents ( if applicable ):  College transcripts, if qualifying based on education or if there is a positive education requirement  Notification of Personnel Action, SF-50  Most recent Performance Appraisal; not applicable to current FBI employees  Veterans: DD 214; Disabled Veterans: DD 214, SF-15, and VA letter dated 1991 or later  How to Attach Documents  To attach documentation as part of your application, please follow the instructions below.  Step 1: Follow the steps of the application process until you reach the Attachments step.  Step 2: Click \"Add Attachment\".  Step 3: Select the appropriate Attachment Type (or \"Other\" if one is not available).  Step 4: Populate the \"Attachment Purpose\" field. Click \"Continue\".  Step 5: Choose the device on which the attachment is located.  Step 6: Upload the desired attachment.  Step 7: To add additional attachments at this point in the application process click the \"+\" on the Attachments step.  To attach documentation to your Global Profile please follow the instructions below:  Step 1: Login to your FBI Jobs account, and click \"My Submissions\".  Step 2: Click the \"Add Attachment\" located under the \"Cover Letters and Attachments\" section.  Step 3: Follow steps 3 - 6 above.  You must complete this application process and submit any required documents by 11:59 p.m. (EST) on the closing date of this announcement. If applying online is a hardship, please contact the HR Specialist listed in the vacancy announcement prior to the closing date for assistance.  What to Expect Next  Once your complete application is received we will conduct an evaluation of your qualifications and determine your ranking. The Most Competitive candidates will be referred to the hiring manager for further consideration and possible interview. You will be notified of your status throughout the process.  Additional Information  The FBI is in the Executive Branch of the federal government. It is one of the components of the Department of Justice (DOJ). The FBI is the principle investigative arm of the DOJ. All FBI positions are in the excepted service.  Applicants must be U.S. citizens and consent to a complete background investigation, urinalysis, and polygraph. You must be suitable for Federal employment; as determined by a background investigation.  Failure to provide necessary and relevant information required by this vacancy announcement may disqualify you from consideration. Additional information will not be requested if your application is incomplete. You application will be evaluated solely on the basis of information you have submitted.  Management may select any grade for which this position has been announced.  Identification of promotion potential in this announcement does not constitute a commitment or an obligation on the part of management to promote the employee selected at some future date. Promotion will depend upon administrative approval and the continuing need for an actual assignment and performance of higher-level duties.  If you are hired, you will be required to serve a two-year probationary period. Probationary employees are precluded from being considered for all job opportunities until 12-months of their two-year probationary period has concluded. Probationary Employees may be considered for competitive vacancies that are advertised within their respective division or field office after serving 90 days within the FBI.  Memorandum of Understanding:  Work performed outside assigned duties (that would not normally be documented on an SF-50, i. e., back-up duties), has to be documented in detail by an immediate supervisor in order to receive full credit for amount of time worked in that position. If no documentation is furnished no credit will be given for time worked in that position. The following notations must be specified in the documentation (Memorandum of Understanding):  a. Percent of time worked in the particular position (cannot conflict with main duties)  b. The month/year work began  c. Frequency worked (i.e., daily, monthly, etc.)  d. Specific duties performed  Attach the Memorandum of Understanding to your application in the \"Cover Letters and Attachments\" section of My Career Tools on the Careers Home page. Please upload the attachment as type \"Other.\"  Veterans' Preference  If you are entitled to veterans' preference, you should indicate the type of veterans' preference you are claiming on your resume and application. Your veterans' preference entitlement will be verified by the employing agency.  Nepotism  Nepotism is the act of favoring relatives in the hiring process, and is prohibited by law. Public officials are prohibited from hiring or promoting relatives or relatives of officials in their chain of command, as well as actively or indirectly endorse a relative's appointment or promotion.  During the hiring process, all selected candidates and FBI hiring managers will be required to certify they are not related to anyone involved in the hiring process.  Reasonable Accommodation Request  The FBI provides reasonable accommodations to qualified applicants with disabilities. If you need a reasonable accommodation for any part of the application and/or hiring process, please notify the Office of Equal Employment Opportunity Affairs (OEEOA) Reasonable Accommodation (RA) Program by either e-mail at (see application details) , telephone at (see application details), or FAX at (see application details). Your request will receive an individualized assessment.  This e-mail address is only for reasonable accommodation requests. Please do not submit your application and/or any questions unrelated to reasonable accommodations. Should any applications be received, they will not be forwarded for consideration during the hiring process.  Equal Employment Opportunity  The FBI is an Equal Opportunity Employer and all qualified applicants will receive consideration for this vacancy. Except where otherwise prohibited by law, selection will be made without regard to, and there will be no discrimination because of color, race, religion, national origin, political affiliation, marital status, parental status, physical or mental disability, genetic information, age, sex, sexual orientation, membership or non-membership in an employee organization, or on the basis of personal favoritism, or any other non-merit factors.  Benefits  The FBI offers a comprehensive benefits package that includes, in part, paid vacation; sick leave; holidays; telework; life insurance; health benefits; and participation in the Federal Employees Retirement System.  This link provides an overview of the benefits currently offered to Federal employees: http://www.opm.gov/insure/new_employ/index.asp "}