{"jobID": "2817046738", "jobLocation": "Dallas_TX", "jobTitle": "Sr. Scientist Consumer Product Insight", "companyRating": null, "companyInfo": {"Website": "www.apexlifesciences.com", "Headquarters": "Glen Allen, VA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Apex Life Sciences is looking for an individual for a permanent Sr. Scientist Consumer Product Insight role with a leading cosmetic company in the Dallas area! Relocation assistance available!  JOB PURPOSE Independently leads sensory research, consumer research, and claims testing.Works with different departments and vendors to conduct research of products in order to meet business needs.Performs descriptive testing, claims testing, and in front end innovation methods. ESSENTIAL DUTIES AND RESPONSIBILIES Conducts developmental studies through both sensory evaluation and consumer testing.Works with Brand and Legal to design consumer claims studies.Screens candidates to determine sensory acuity.Performs one-on-one interviews to gain key consumer insight towards products.Trains CPI team in sensory methods.Establishes guidelines for sensory and consumer evaluations procedures.Interacts with other departments and vendors to research and determine appropriate strategies for projects.Determines ingredients and products to be used for panel training and scale usage.Determines statistics to be used in evaluation and provides data relating to projects and potential product launches.Routinely presents data to US/Global Brand Development, Product Development, and Marketing through reports and presentation of data. KNOWLEDGE, SKILLS AND ABILITIES  Education Masters degree in Science discipline or Market Research Experience 5 years of related experience in cosmetic, consumer product, or food industry.Experience with testing methodology and questionnaire design for consumer market research or sensory evaluation.Knowledge and experience in descriptive testing, claims testing, and in front end innovation methods.Must possess excellent written and verbal communication skills and excellent interpersonal skills.Must have the ability to identify and clarify product and business issues.Must possess a solid understanding of consumer/market research, sensory evaluation, and claims testing.Must demonstrate intellectual curiosity and an innovative mindset. EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178."}