{"jobID": "2657189131", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Computer Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": "169000", "jobDescription": "The Adobe Cloud Platform Project is looking for talented, passionate, and entrepreneurial engineers in high performance, high scale, multi-threaded enterprise computing. If the thought of handling several million transactions excites you then this is the place for you. You’ll be working within a small but rapidly growing team to build the next generation experience platform.Required experience/skills:Strong presence of mind and distinguishable common sense8+ years of experience building high scale production systems using Kafka, Cassandra, HBase or AerospikeExperience supporting operations teams with deployments, debugging production issues and tuning applications.Experience with development continuous integration tools like maven, bamboo, git, Jenkins, Crucible, Jira, Confluence, etc.Expertise in Java / JVM (Scala is a plus)Strong in one or more scripting languages (Python/Perl/Bash)Experience delivering product in an Agile environmentMust be analytical and possess strong organizational/problem-solving skillsPreferred Background:Experience with Streaming systems (Spark streaming, Apache Flink)Experience in building back-end systems for a technology company.Interest/Experience in big data, data mining, Java NIO, analytics, or machine learning.Experience with Cloud Computing basics.Linux (RHEL/CentOS preferred) ADLS, NFS and NAS appliancesLayer 2 / Layer 3 networking Monitoring systems such as Nagios, Zenoss, Groundwork At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}