{"jobID": "2393003018", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.eero.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "159000", "jobDescription": " Data powers the future of eero. We rely on data to inform and drive product decisions, improve network and mesh performance, set marketing strategies, enhance factory testing, provide better customer support and much more. As a Data Scientist at eero, you will participate in product development by bringing analytical and statistical expertise to solve complex problems. Working closely with our product & engineering leadership, you will dig deep into the largest data set from consumer mesh networks ever compiled to drive the understanding, growth and success of eero.  You will…  Partner with Product and Engineering teams to develop key performance indicators, answer important questions with data and identify new product opportunities  Apply your expertise in quantitative analysis, data mining, and data storytelling to build compelling stories about how our users interact with our product  Develop statistical models on large data sets to better understand our business and the drivers of change  Present your analysis with logical recommendations to influence product direction and communicate the state of the business  Build and automate actionable analytics and reporting for key business processes  Innovate to derive meaning from new data sources and devise new measurement frameworks  Mentor others within eero in SQL, Analytics, statistics, and all things data  Currently, you…  Have 3+ years of work experience in quantitative analysis with a demonstrable business impact  Possess strong analytic skills and the ability to synthesize large datasets into meaningful insights, including identifying key trends in data and reconciling data across various sources  Are building statistical models to understand and predict user behavior  Design and evaluate key performance indicators and experiments  Work with large amounts of structured and unstructured data using SQL and the Hadoop Ecosystem (Redshift, Vertica, Spark, Hive, Presto, Pig, etc)  Possess advanced statistics knowledge combined with skills in R or Python Pandas  Have demonstrable general purpose coding experience with a dynamic language such as Python, Ruby, Node.js, PHP, Clojure, etc  Build key data sets and compelling, intelligible visualizations using tools such as Looker or Tableau  Have a PhD or MS degree in Math, Physics, Statistics, Economics, Computer Science, or other quantitative fields.  Are confident in your communication and presentation skills  Bonus Points if you…  Have deployed production models to predict or classify  Have coding experience in languages such as Scala, Java, C++, C#, or Go  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}