{"jobID": "2828121540", "jobLocation": "San_Francisco_CA", "jobTitle": "Business / Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.judge.com", "Headquarters": "Wayne, PA", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Adecco, Kforce"}, "estimatedSalary": null, "jobDescription": " Our client is currently seeking a Business / Data Analyst This job will have the following responsibilities: Inventory Management in a outsourced 3PL/Hub based distribution process.Subcontracting process, Vendor Consignment Inventory.Physical Inventory, Cycle counting and daily reconciliations processes.Inventory Receiving, Inspections and Quality Management process.Inventory Controls and Transactions (Lot, Serial, FIFO, LIFO, Inter company, Returns)Warehousing Pick, Pack and Ship processes with Transportation/Carrier management.B2B XML/EDI integrations with 3PL for Logistics and Inventory process.Customer Facing documentations (Packing Slips, Labels, Commercial Invoices).Logistics KPI and Logistics reporting using BI Dashboards and Standard reports.Drives documentation of business processes, provides analysis and suggestions required to improve the productivity of the individuals or organizations using those processes. (Note: this is NOT limited to ERP tools).Manage, Identify, Troubleshoot and fix issues in Production, Unit test, System integration test and user acceptance test.Works cross functionally to lead the effort to fix the issue and documenting what changes are needed (customizations and/or new business processes).Leads cross functional effort to formally document processes, procedures and user guides.Work with 3PL IT teams on system Integration and support.Onboarding of new Customers/Suppliers by working with internal teams and third party consulting EDI service providers for integration.Qualifications & Requirements:Knowledge & Experience: • Bachelors in MIS, Computer Science or Business.1+ Year of Inventory and Supply Chain Understanding or experience through College.Tech Savvy and ready to learn and understand application with training provided.Should have a good Excel and Access hands on experience. Skills & Ability:Strong interpersonal skills and communication skills to interact with all levels of an organization.Demonstrates good judgment in selecting methods and techniques for obtaining solutions.Ability to work independently and within a team environment.Strong organizational and multitasking capabilities.Work with minimum supervision.Ability to work in a fast pace environment is a plus!Ability to work effectively in a complex and dynamic environment.Ability to Multi task on all levels • Analytical skills to solve complex problems.Ability to create and implement solid business process changes.Ability to work effectively in a team environment.Judge Group Job Order ID: 574331 Salary: Negotiable  Company Description:Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.  The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}