{"jobID": "2641382349", "jobLocation": "San_Francisco_CA", "jobTitle": "IT Support Engineer", "companyRating": "4.2", "companyInfo": {"Website": "www.collectivehealth.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " Our team owns the IT systems at Collective Health, which are critical to keeping the company running, and efficient. We are engaged across the business, interacting with every employee, understanding their workflow, and assisting where possible them make it more effective, and efficient. As a member of the IT team, you are integral part of providing an exceptional customer experience for everyone we interact with.  Well depend on you to resolve problems, and where appropriate, educate people on how to self-resolve and self-serve when appropriate. You display the people skills and empathy required to understand the issues faced by employees, and in turn to explain technical concepts in simple terms; improving each users relationship with the tools and services they depend on. Your Core Responsibilities:Provide all our technology consumers with exceptional experiencesCreate and support frictionless workflows across the businessProvision and deprovision hardware, devices, accounts, and licensesHardware, and software lifecycle managementProvide employees with support, and troubleshooting for various productivity toolsDocument, and keep internal policies, and procedures up to dateTroubleshoot software and hardware issues, including macOS and Windows computers, Apple and Android based mobile devices, telephony, along with wired and wireless networkingParticipate in Root Cause Analysis of incidents, and document resolutionsIf many or most of the following items apply to you, we'd love to talk!Knowledgeable of macOS and Windows platforms; maybe *nix tooExperience with cloud based services (Google Apps, Microsoft Online)Understanding of basic network concepts and protocols (DNS, DHCP, HTTP, TLS etc)Ability to work effectively with groups throughout the organizationKnowledge of Python or other scripting languageExperience, or willingness to learn systems security conceptsPast experience with data cabling, network, or computer facilities maintenanceBonus points for:You have contributed to and maintained Open Source projectsExperience working with Cloud networks (AWS, Google, Azure)You have built utility scripts with bash, NodeJS, Ruby, Python, Go, etcYou're fun to be around Collective Health is a technology company working to create the healthcare experience we all deserve. Founded in 2013, our team of engineers, designers, product managers, and actuaries are redefining the $1 trillion market of employer-sponsored health benefits with data-driven and people-focused products. Our complete health benefits solution helps great companies like Activision Blizzard, Palantir, Restoration Hardware, and Pinterest take care of their people by harnessing the power of design and technology. Based in San Francisco, CA, were backed by some of the best investors in Silicon Valley including Google Ventures, Founders Fund, NEA, and Redpoint Ventures. For more information, visit us at https://www.collectivehealth.com. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Collective Health"}