{"jobID": "2782368721", "jobLocation": "Pasadena_CA", "jobTitle": "Python Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.irvinetechcorp.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Irvine Technology Corporation (ITC) is a leading provider of technology and staffing solutions for IT, Security, Engineering, and Interactive Design disciplines servicing startups to enterprise clients, nationally. We pride ourselves in the ability to introduce you to our intimate network of business and technology leaders – bringing you opportunity coupled with personal growth, and professional development! Join us. Let us catapult your career!Data Engineer – Python IMMEDIATE NEED for a Python Data Engineer. This is a long term contract opening with benefits in Pasadena, CA working for an enterprise distribution company.  Our client is looking for candidate with a strong background in Python, Linux and Shell Script.  We are looking to interview and hire immediately!  Qualifications: 3+ years of Data processing experiencePython experience is requiredShell Script experience managing data and processExperience working in a Linux environment is requiredBachelor’s Degree is preferred but not required Please send your resume to Mike Esquivel, Senior Technical Recruiter for immediate consideration. Let us help you secure an interview!  Connect with Mike Esquivel on Linkedin at https://www.linkedin.com/in/mikeitc/ ABOUT US Irvine Technology Corporation (ITC) is an award-winning Information Technology Solutions and Staffing provider with roots in Southern California. For over fifteen years, we have had the privilege of serving exceptional client organizations as both a local and national resource. Our team is comprised of seasoned technologists, staffing industry thought leaders, top-notch recruiters, dedicated account executives, and a world class support staff. Irvine Technology Corporation provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Irvine Technology Corporation complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities."}