{"jobID": "2816829778", "jobLocation": "Broadview_IL", "jobTitle": "Data Science and Analytics Associate", "companyRating": "3.6", "companyInfo": {"Website": "www.bosch.us", "Headquarters": "Farmington Hills, MI", "Size": "10000+ employees", "Founded": " 1886", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Continental, Delphi, FCA Fiat Chrysler Automobiles"}, "estimatedSalary": "71000", "jobDescription": " Company DescriptionDo you want beneficial technologies being shaped by your ideas? Whether in the areas of mobility  solutions, consumer goods, industrial technology or energy and building technology with us, you will have the chance to improve quality of life all across the globe. Welcome to Bosch.  BOSCH is a proud supporter of STEM (Science, Technology, Engineering & Mathematics) Initiatives: FIRST Robotics (For Inspiration and Recognition of Science and Technology) AWIM (A World In Motion)  Position your career for long term success by joining the world&apos;s most admired motor vehicle parts supplier as ranked by Fortune for the third consecutive year.Job DescriptionOur team is responsible for producing product catalogs, marketing intelligence and digitalization of business processes. This includes activities such as measuring and predicting market coverage, sales potential, sales share, etc. and automating marketing processes and decisions.  As a Data Science and Analytics Associate, you will work closely with marketing, sales and data management teams. You will be responsible for Systematically gathering and storing large volumes of sales and marketing dataDeveloping analytical models for analyzing data, providing insights and recommending actions to improve sales and profits.Building and integrating predictive models into analytics toolsCreating powerful visualizations of the gained insights to convince all levels of managementCreating interactive and intuitive user interfaces to collect from and distribute information to the internal audienceDigitalizing / automating sales and marketing processes and decisions to improve efficiency and qualityQualifications0-3 years of proven experience as a Data Scientist / Data AnalystHands on programming experience in R, SQL, Python, C## and business intelligence tools like TableauStrong statistical and mathematical skillsProblem-solving attitudeBachelors in Data Science / IT / Computer Science , Masters preferredExperience in retail or automotive industry is preferred Additional InformationAll your information will be kept confidential according to EEO guidelines."}