{"jobID": "2643693572", "jobLocation": "Milpitas_CA", "jobTitle": "GSS Service Data Analyst Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "79000", "jobDescription": "Company Overview Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.  Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer? Group/Division The Global Service Support Organization (GSS) team headquartered in Milpitas, CA is our service organization that consists of Service Sales and Marketing, Spares Supply Chain management, Field Operations, Product Training, and Technical Support. The GSS organization partners with our field teams and customers in all business sectors to maintain the high performance and productivity of our products through a flexible portfolio of services. Our comprehensive services include: proactive management of tools to identify and improve performance; expertise in optics, image processing and motion control with worldwide service engineers, 24/7 technical support teams and knowledge management systems; and an extensive parts network to ensure worldwide availability of parts. Responsibilities GSS, being highly data-driven organization, is seeking an intern to work on data analytics and information extraction to assist in meeting the business objectives. Extensive data covering service and financial records will be extracted, automated, analyzed, and presented so right decisions can be made especially on cost-of-service and customer satisfaction initiatives. Some of the data extraction and presentation being done manually is highly desirable to be automated so it can be used by multiple managers with relative ease. among the tools that this intern will need to master or have strong working knowledge: Excel/PowerPivot, SQL Server (SSIS/SSMS), JMP/SAS packages, R, and Snowflake. Not all of these are required but at least one or two will be required. The output will include reliability data, cost data, root causes of tool downs or escalations, and escalation trends and metrics. The candidate for this opportunity will learn how to work on real-life data from complex tools and systems. The candidate will collaborate with product engineers, managers, and other data specialists and programmers. This is a great chance to apply some of the class work to real life situations with impact on real life decisions.Preferred Qualifications Basic Requirements:  Some programming abilities and data analysis are required including some of the following: Excel/PowerPivot, SQL Server (SSIS/SSMS), JMP/SAS packages, R, and Snowflake working knowledge of data presentation and analytics visualization Good communication, interpersonal and team coordination skills Creative thinker with good problem analysis and solving abilities Good understanding of data structures and algorithmsMinimum Qualifications At least 3 years of College in a field such as computer science, data science, science, or engineering.Equal Employment Opportunity KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}