{"jobID": "2829477836", "jobLocation": "Austin_TX", "jobTitle": "Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.junglescout.com", "Headquarters": "Austin, TX", "Size": "1 to 50 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Jungle Scout is seeking a Business Intelligence Analyst to help our marketing and product teams have the insights and reporting they need to optimize performance. This position will have responsibility for helping our teams define their primary KPIs, ensuring they have the reporting necessary to understand important trends in those KPIs, and deep diving into the results and A/B tests to understand where we have opportunities to potentially perform better for certain customer segments. This person will report directly to the CFO/Head of Analytics, and will work extensively with the leadership of our Marketing, Product and Development teams.  The successful candidate will leverage a combination of online and transactional data to understand how our customers are reacting to our marketing efforts and interacting with our site. In collaboration with our internal teams, she/he will use that information to define the KPIs each team needs to closely monitor in order to understand and improve its performance. She/he will then leverage visualization software - which the candidate will help us to select - to provide self-service visibility into trends in and important breakdowns of those metrics for our teams. She/he will also be responsible for deep diving into that same data to spot opportunities and potential testing ideas that our teams can implement to improve performance, and supporting readouts on those tests. Some of the data necessary to do this is easily available, but others is not yet, so the successful candidate must be able to partner closely with our engineering teams to give them clear requirements, and in many cases to dive into our underlying data and extract on their own the data needed to find valuable insights.  We are looking for someone with strong technical and analytical skills, with experience diving into complex online data spanning multiple sessions/interactions, and turning that data into understandable and compelling insights. The candidate must also have strong interpersonal skills and a desire to partner closely and daily with our internal teams to ensure they have what they need to be successful. Finally they must be intellectually curious and honest, with a desire to understand the why behind certain trends and a logical and hypothesis driven approach when digging into each area.  Responsibilities: Partner with internal stakeholders both technical and non-technical to answer complex business questions, providing insightful analyses accompanied by strong verbal and/or visual presentationsUnderstand key business and conversion drivers and define KPIs that are aligned with the teams overall strategic directionPartner with our engineering teams to ensure continuous improvement in data collection such that the necessary metrics and important breakdowns of those metrics are routinely availableCreate online reports that allow our customers teams to monitor the performance of their KPIs on their ownWork with internal stakeholders to review, continuously enhance and ensure usage of our online reportsIn partnership with our internal teams, monitor our key metrics on a daily basis, quickly identifying areas of concern and proposing further analyses and/or corrective actionsThrough data mining and analysis, create hypotheses and recommendations of things we should change, leading to experiments that will confirm or deny those hypotheses and ultimately improve operationsSupport A/B testing efforts, helping with readouts and giving requirements to our development teams to ensure we have the requisite data and tracking needed to understand the results of our testsPresent findings to internal customers and executive teams to ensure alignment and understanding of key opportunities across the company General Skills: Able to structure and lead data exploration problems, with innovative approaches and creative solutions, leveraging strong reporting and data visualization skillsPassion for number crunching, logical problem solving and intellectual challengesStrong business sense, strategic thinking and team playerMust be comfortable with uncertainty by prioritizing effectively and flexibly handling changesHypothesis-driven thinker, especially as relates to A/B testing ideation, prioritization and readoutsAble to work across internal teams to communicate findings company-wideAble to work independently and proactively, identifying issues and raising them to management, as well as offering potential solutionsAbility to build and present evidence-based storiesExcellent organization skills, and ability to manage multiple projects concurrently Technical Skills: Expert-level SQL is a mustSignificant prior experience with Tableau and/or other visualization tools requiredSignificant prior experience with business modeling (Excel) and presentations (PPT)Intermediate level R, Python or other coding languageClickstream data exposure: 3-4 years of prior experience with Google Analytics, Mixpanel or other clickstream analytics platformsA/B testing background: 1-2 years working with internal or external A/B testing platforms and providing readouts based on test data Experience/Education: Bachelor's in an analytical field (e.g., Marketing Science, Computer Science, Mathematics, Statistics) and 7+ years of experience in data analytics OR Master of Science in an analytical field (e.g. Marketing Science, Computer Science, Mathematics, Statistics) and 5+ years of experience3+ years experience with a fast growing SaaS and/or subscription business is preferredPrior experience working with product and development teams in an agile environment preferredPrior experience as an Amazon seller a plus, but not required Why Jungle Scout:  We are a fun-loving group of professionals, working remotely around the world with pursuing one goal: to help people launch and grow successful Amazon businesses. Jungle Scout has competitive compensation packages, generous vacation policy, educational stipend, and the mindset that you should work when and where most suits your personality.  About Jungle Scout:  Amazon Product Research Made Easy. Jungle Scout is the industry-leading Amazon product research tool, that has helped tens of thousands of people find profitable products to sell on Amazon.  Based on millions of data points collected every month, Jungle Scout has the most accurate sales estimates for Amazon sales around, so you know exactly which products will make you money. Come up with product ideas, validate demand, and find the exact products that fit your criteria. www.junglescout.com"}