{"jobID": "2745641982", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.celerity.com", "Headquarters": "Mc Lean, VA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Description:Data Analyst  We collaborate. We create. We innovate.  Intrigued?  You're a business professional with an innate curiosity that thrives in a dynamic and Agile environment. You appreciate teamwork, exemplify integrity, perseverance, flexibility, and a generosity of spirit... if this sounds like you, then please apply – we'd love to meet you!  Celerity's Mid Atlantic team is expanding and on the hunt for the savvy, creative, and analytically sound individuals that are motivated by solving complex problems. We're in the business of transforming how people, process, and systems co-exist, while improving operational efficiencies and user-driven interactions. We work with groundbreaking companies, melding expertise in Digital Strategy, Technology, Creative, and Business Transformation.  What You'll Do Work on a highly collaborative Agile closely with Stakeholder teams to evaluate and analyze current data structuresMeet with stakeholders to gather and document requirementsExtract and synthesize date using SQL, SAS, and R to identify potential data challengesWork with business SMEs to identify the critical data needs and data elements to effectively understand the current data environmentAssist with creation of requirements, conceptual data models, data entity states, data events and data requirementsAnalysis of current data processes and make recommendations for go forward data strategy About You Bachelor's Degree in Business, Management, or a quantitative field4+ years of Data Analysis experience2+ years working in Agile environments2+ years working with business and data teams2+ years Documenting data entity diagrams and entity diagramsStrong business, data, and predictive analysis skillsExperience with R or SAS would be preferable2+ years writing and executing SQL statementsAbility to effectively communicate across multiple levels of an organization specifically ability to provide clear concise communication with project team and mid-level management and demonstrated ability to influence or negotiate with other functional areasPrior working within Financial Services We Are Celerity  Millions of people every day use websites, applications, and business processes designed and built by Celerity. As a consultancy of technologists, creatives, and business experts, we provide the action plans, teams, and solutions our clients must transform the way they do business and deepen engagement with their customers.  Celerity empowers autonomy and accountability. We understand life happens and want our team to do what is needed to get the work done, enjoy it along the way, and have plenty of time and energy for family and friends, vacations, hobbies, learning of languages, you name it! At Celerity, our focus is on bringing synergies to business process, technology, and creative chops to deliver inspirational solutions. We love giving kudos and celebrating achievements. We provide an inclusive and flexible environment that fosters collaboration, quick pivots, and quality work.  Originally founded in 2002, Celerity was acquired in 2015 by AUSY, a France-based IT consultancy and engineering services firm. With 8 regional offices and 400+ employees, Celerity's clients span a variety of industries including media and entertainment, healthcare, financial services, manufacturing, non-profit, and hospitality.  You can also get to know us better on Instagram, Facebook, Behance, Dribbble, LinkedIn, and Twitter.  Build Your Career  At Celerity, our professional growth plan focuses on individualizing everyone's track through incorporating personal interests with training and mentorship, while further expanding existing strong suits. We recognize in this ever-evolving digital world, there is extreme value in learning new skills and technologies. Celerity provides opportunities to shape skill sets, work with an amazing team of industry-leading consultants and exciting clients, in addition to professional trainings and certifications that best align with your career goals. Benefits Our People are everything. Celerity provides a diverse and holistic benefit package: Check out what joining Celerity can do for you and your family. Celerity Cares  Celerity is driven to make positive contributions to our colleagues, clients, and communities. We are committed to giving back and supporting a variety of causes. Check out some of the organizations we support. We are proud to be an Equal Opportunity Employer.  ­"}