{"jobID": "2689606695", "jobLocation": "Washington_DC", "jobTitle": "Accounting Intern", "companyRating": "3.5", "companyInfo": {"Website": "www.avalere.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " Avalere Health is seeking an Accounting Intern to join our Accounting & Finance team. This is an excellent opportunity for an entry-level candidate or student seeking part-time work. The Intern will work part time (approximately 20 hours per week) with the option for full time in the summer in Avalere’s Washington, DC office. This is a paid position.Principal Duties and Responsibilities:Support the accounting team with various daily, weekly, and monthly accounting processesThese may include transaction entry, and vendor account and general ledger account reconciliationMaintain files and documentation thoroughly and accurately, in accordance with company policy and accepted accounting practicesAssist with other projects as neededSkills, Experience, and Other Job Related Requirements:High level of discretion for confidential work and information; ability to appropriately handle critical information and sensitive situationsStrong interpersonal skills; ability to effectively interact with all levels of staff and external contacts; ability to work as an effective team memberCooperative and service-oriented attitude; must be able to work under pressure and maintain a professional demeanorFlexibility to handle a variety of tasks and shift priorities simultaneouslyHigh level of initiative and ability to work with minimum supervisionAbility to use sound judgment to effectively solve problems within the scope of the positionKnowledge of Microsoft Office Suite (Excel, Word, Outlook)How to Apply:All applications should be submitted through the Careers section of our website at www.avalere.com/careers. Please submit copies of the following application materials:Cover letterResume Avalere Health is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status."}