{"jobID": "2616180278", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Analyst, Data Analytics", "companyRating": null, "companyInfo": {"Website": "www.slack.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Microsoft, Atlassian, Facebook"}, "estimatedSalary": null, "jobDescription": " Senior Analyst, Data AnalyticsSlack is looking for experienced analysts to join our Analytics team and help drive the understanding, growth, and success of the product. The right candidates will have deep technical skills to complement their analytical experience and will be comfortable working with a nascent data infrastructure to identify, monitor, and impact key metrics and help us make better decisions. They will be scrappy, independent, and excited about having a big impact from a new team. Responsibilities:Use data to inform and influence the direction of the product team roadmaps and inform business decisionsPartner with product teams to define goals and identify key metrics for existing features and new releasesWork closely with Marketing to rapidly design experiments and iterate on resultsImprove our understanding of patterns/trends in user behavior and find new product opportunitiesBuild automated dashboards and reports to drive awareness and understanding of key metrics and experiment resultsWork closely with Data Engineering to author and develop core data sets to empower operational and exploratory analysesRequirements:Bachelor's degree in Computer Science, Engineering or related field, or equivalent training, fellowship, or work experienceA proven track record of using quantitative analysis to impact key business or product decisionsThe ability to clearly and effectively communicate the results of complex analysesMinimum of 6 years experience writing production datasets in SQL/Hive OR building internal/production data tools for ETL, experimentation, or exploration in a scripting language (Python, PHP, Ruby, etc.)A solid grasp of common statistical applications and methods (experimentation, probabilities, regression)Comfort with basic HTML/CSS/JSAcademic and/or professional experience in a quantitative fieldExperience in software engineering a plus Slack is where work happens. It connects you with the people and apps you work with every day, no matter where you are or what you do. We believe everyone deserves to work in a welcoming, respectful, and empathetic culture. We live by our values and hire accordingly.  Launched in February 2014, Slack is the fastest growing business application ever and is used by thousands of teams and millions of users every day. Slack's investors include many of the best-recognized firms in the world, including Accel Partners, Andreessen Horowitz, Social+Capital, KPCB, Google Ventures, Horizons Ventures, IVP, Spark Growth, DST, and Index Ventures. We currently have eight offices worldwide, in San Francisco, Vancouver, Dublin, Melbourne, New York, London, Tokyo, and Toronto.  Ensuring a diverse and inclusive workplace where we learn from each other is core to Slack's values. We welcome people of different backgrounds, experiences, abilities and perspectives. We are an equal opportunity employer and a fun place to work. Come do the best work of your life here at Slack."}