{"jobID": "2795727302", "jobLocation": "Washington_DC", "jobTitle": "Jr Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.careerprofiles.com", "Headquarters": "Baltimore, MD", "Size": "1 to 50 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " The BOSS Group, Aquent, Creative Circle"}, "estimatedSalary": null, "jobDescription": "A major Fortune 500 organization seeks to hire a Junior Data Analyst to join their team in downtown, Washington DC! Data Analyst Responsibilities:Handle extensive data entry via MS Excel. Support migration of data as it is received from outside vendors. Support the database integrity and handle customer service as necessary w/ outside vendors. Creating/editing media folders where data will be housed. Maintaining the media tracker database and creating customized data reports. Other administrative duties as assigned.Data Analyst Requirements:College degree in economics, statistics, math, information technology or computer science highly preferred.Ideally 0-1 year of professional experience (internships ok!).Strong computer, technical and data base management skills including data entry.Proven ability to work with Excel, Word and PowerPoint.Ability to handle multiple assignments and pay attention to detail; this is critical.Must be a U.S. citizen to hold this position.About Profiles: The leader in Marketing and Creative Technical Recruitment since 1998, Profiles places the highest caliber candidates in Fortune 500 companies and successful organizations across the country. Our experienced recruiters focus on candidates drawn from the top 20% of job seekers nationwide. Profiles professionals are available for contract, contract-to-hire, and direct hire positions. Headquartered in Baltimore, MD, Profiles has regional offices in Philadelphia, Richmond and Washington D.C.  Have you considered a contract position? Profiles offers the following benefits: competitive salary; 401(k) plan; weekly paycheck and bonus pay; health, vision and dental insurance; online software and soft skill training.  New job opportunities are listed daily - www.careerprofiles.com.   "}