{"jobID": "2838005667", "jobLocation": "Chicago_IL", "jobTitle": "Assistant Core Scientist", "companyRating": null, "companyInfo": {"Website": "www.northwestern.edu", "Headquarters": "Evanston, IL", "Size": "5001 to 10000 employees", "Founded": " 1851", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Princeton University, Stanford University, Yale University"}, "estimatedSalary": null, "jobDescription": "Job Summary: Reporting to the Core Facility Director, the Assistant Core Scientist is responsible for ensuring the completion of research projects within the Peptide Synthesis Core Facility, which is part of the Simpson Querrey Institute (SQI). The Assistant Core Scientist provides services and consultation to researchers and investigators, facilitates highly technical and specialized scientific research, and guides the Core in relevant areas to ensure consistent, high quality service for the research community. Key responsibilities include design and execution of peptide synthesis, organic synthesis, HPLC purification, mass spectrometry and other related laboratory duties in a service-based environment. Independently conducts experiments, carries out procedures and processes, and analyzes data. Troubleshoots and revises existing methodologies and develops new experimental methodologies. Provides user support, training, and consultation with graduate students, postdoctoral researchers, and principle investigators. May participate in grant writing as well as marketing and outreach programs for the facility and may assist in the development and implementation of GLP/GMP protocols  SQI is headquartered on the Chicago campus and manages additional laboratories on the Evanston campus. The Institute includes the Center for Regenerative Nanomedicine (CRN), the Center for Bio-Inspired Energy Science (CBES), and the Center for Bio-Integrated Electronics (CBIE). CRN is supported by an endowment provided to Northwestern by the Querrey Simpson Charitable Foundation, CBES is supported by an Energy Frontier Research Centers grant from the Department of Energy, and CBIE is supported by additional endowment funds. A cover letter is required for full consideration* Please Note: This candidate will work in a chemistry laboratory environment. Occasionally a flexible work schedule may be required. Specific Responsibilities: Technical  Applies relevant science to Core technologies and applications including:  Manual and automated peptide synthesis,  Analytical and preparatory HPLC,  Mass Spectrometry including LCMS,  Rotary Evaporation,  Lyophilization,  Organic synthesis,  Project consultation.  Utilizes advanced knowledge of applications, principles, theories, and concepts to design and troubleshoot projects for the research community.  Troubleshoots problems with procedures and equipment, and suggests adjustments to protocols.  Works on advanced problems in which analysis of situations or data requires an in-depth evaluation of various factors.  Exercises judgement within defined practices and policies in selecting methods and techniques.  Trains Core staff and clients in advanced instrument operation and applications.  Administration  Maintains clear and accurate documentation of the protocols, instrumentation logs, and/or data collected.  Maintains established laboratory inventories.  Places orders.  Records work accurately and completely.  May contribute to grant writing.  Participates or develops cost analyses.  Assists with administrative duties necessary for a fee-for-service facility operation such as collecting and/ or entering facility billing data.  Utilizes established safety practices, and is responsible for providing a safe work environment for fellow employees and clients.  Consults and interacts with users to help plan experiments.  Assists the Core Director in developing, implementing, and maintaining GLP/GMP compliance protocols.  Collaboration/Strategy  Participates in the identification of Core facility needs.  Provides input during goal setting processes.  Demonstrates a sound, working knowledge of techniques in other laboratories in order to provide cross-over assistance to clients.  Assists in the organization of in-house and/ or off-site training.  Participates in the delivery of presentations, seminars, and workshops.  Networks with key decision-makers within the research community.  Data Analysis  Performs literature reviews for the purposes of furthering research and Core specific activities.  May contribute data analysis for researchers.  Assists in the development of new analytical techniques and methodologies.  Supervision  Trains and provides oversight to lower-level Core staff and clients.  Miscellaneous  Completes other duties as assigned. Minimum Qualifications: Successful completion of a full 4-year course of study in an accredited college or university leading to a bachelor's or higher degree; OR appropriate combination of education and experience.  2 years of relevant domain expertise;  4 years of technical or other relevant experience.  Minimum Competencies: (Skills, knowledge, and abilities.)  Excellent verbal and written communication skills;  Data presentation skills, computer skills, including spreadsheets and basic computations;  Experimental design ability.  Wet chemistry laboratory experience;  Attention to detail, accurate record-keeping and organizational skills;  Ability to work independently as well as with others in a team environment;  Excellent interpersonal and communication skills with strong customer service orientation.  Preferred Qualifications: (Education and experience)  PhD in Chemistry, Materials Science, Biochemistry, Chemical or Biomedical Engineering or related fields and 2 years practical lab/bench experience.  Previous experience with organic synthesis, solid phase peptide synthesis, and HPLC;  Experience with advanced laboratory equipment maintenance and troubleshooting.  Preferred Competencies: (Skills, knowledge, and abilities)  Ability to work effectively with a diverse group of faculty and student researchers;  Ability to train, assist, and oversee student and postdoctoral researchers;  Ability to plan, execute, and track multiple projects simultaneously;  Ability to adapt in a changing environment toward efficiently completing goals and tasks;  May need to influence others without direct authority;  GLP/GMP experience/familiarity a plus.  As per Northwestern University policy, this position requires a criminal background check. Successful applicants will need to submit to a criminal background check prior to employment.  Northwestern University is an Equal Opportunity, Affirmative Action Employer of all protected classes, including veterans and individuals with disabilities. Women, racial and ethnic minorities, individuals with disabilities, and veterans are encouraged to apply. Hiring is contingent upon eligibility to work in the United States."}