{"jobID": "2735245544", "jobLocation": "Pasadena_CA", "jobTitle": "Computer Vision Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.oben.me", "Headquarters": "Pasadena, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "COMPUTER VISIONCOMPUTER VISION RESEARCH SCIENTISTObEN’s mission is to enable everyone in the world to create their own Personal AI (PAI), intelligent 3D avatars that look, sound, and behave like the individual user. Secured and authenticated on the Project PAI blockchain, ObEN’s technology creates more productive, more personalized digital interactions. ObEN is a K11, Tencent, Softbank Ventures Korea and HTC Vive X portfolio company, and we work with our strategic investors to expand PAI technology across multiple verticals including hospitality, retail, healthcare, and entertainment.  Working at ObEN means taking on extraordinary transformations every day, in an environment that celebrates and encourages innovation. You’ll be working in small, agile teams (including world class researchers in areas of computer vision, machine learning, NLP, speech, and blockchain). We are blazing new trails in AI and blockchain technology, and we encourage and support publications to top conferences and journals. Learn more about working at ObEN in our blog post.Job Description: The Computer Vision team aims to reconstruct 3D virtual avatars that look and move just like you with as few as a single selfie as input. As a Research Scientist of the Computer Vision team, you will be collaborating with a small group of talented researchers and together you will define research problems, perform literature review, implement research prototypes, and work closely with research engineers to transform research prototypes into production. We expect you to be able to think out of the box, propose interesting research directions, and provide novel solutions for them. We value researchers who enjoy a highly collaborative environment with minimal supervision. Responsibilities:Literature review and discussion with peer researchers to define clear research problems and propose novel solutionsFast implementation of research ideas into research prototypesWork closely with research engineers for productionWrite technical papers to top-tier conferences such as CVPR, ICCV, ECCV, SIGGRAPH, and SIGGRAPH ASIAKeep current with latest trends and technologies to help future research subjects and anticipate development needsRequirements:Ph.D. in Computer Science or any other relevant disciplines with a background in Computer Vision, Computer Graphics, or Machine Learning; M.S. in the same field with 3 years+ research experience in the industry or academiaTop-tier publication records, including but not limited to CVPR, ICCV, ECCV, SIGGRAPH, SIGGRAPH ASIA, NIPS, and ICMLAn understanding of 3D multiview geometry, bundle adjustment, and SLAM/visual odometryGeneral and deep understanding as well as hands-on experience of applying computer vision technologies, especially 3D reconstruction from camera images and depth sensorsKnowledge and experience of applying machine learning and deep learning to real problems in the fields of vision and graphicsHands-on experience in Machine Learning, Deep Learning, Artificial Intelligence, and Data Science and their frameworks, such as Tensorflow, Pytorch, and CaffeAbility to quickly adapt to new situations and to learn new technologiesAbility to collaborate and communicate effectively with a multicultural teamPluses:Experience in 3D face and/or 3D body modeling from imagesProjects experience involving any type of facial image processing and analysisKnowledge of geometry and topology concepts, representations and data structures, such as splines, level sets, surface and volumetric meshes, point clouds, analytical surfaces/solids, functional representations, subdivision surfaces, T-splines, etc.Unity3D development experienceVR/AR related development experienceApplication Requirements: Introduction to ObEN: https://goo.gl/gxpxwT Please send the following to careers@oben.comDetailed resume and/or LinkedIn profileLinks to any research / papers you have been an instrumental part of and are proud ofCover Letter identifying your five favorite apps on your phoneAny code you are proud of and is publicName of instructor / adviser, if any along with link to their profile130 W Union St Pasadena, California 91103"}