{"jobID": "2837519159", "jobLocation": "Jersey_City_NJ", "jobTitle": "Senior Data Modeler - Trade and Transactions", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": " Apply Now  Senior Data Modeler - Trade and Transactions  Req #: 180064192  Location: Jersey City, NJ,US  Job Category: Technology Job Description: UTM (Unified Trade and Transaction Model) is the logical representation of data required to support JP Morgan's Trade and Transaction Event Management business capability. The primary intent is to standardize the data representation of trades and transactions across the firm, focusing on all Corporate and Investment Bank asset classes. The adoption of canonical models is foundational to a number of strategic transformation programs within the bank. UTM is to be used to develop interface definitions across applications.  The UTM team is looking to grow over the next few months. Goals:Working alongside our business analysts, line of business teams, and producer/consumer communities, define across the range of Corporate and Investment Bank products:The entities and attributes necessary to provide a business definition of each productHow a trade will be represented at each stage in its lifecycleEnsure that the same concept is modelled in the same way across the Corporate and Investment Bank and prevent unnecessary divergenceEnsure the model is grounded in the reality of business products and how they are processedResponsibilities:Translate requirements into logical data models working closely with Subject Matter Experts and Applications Development representativesDefine the modelling solution and capture the model in modelling toolEnsure consistency and governance across model estate including alignment with all other domain models and taxonomiesReview data samples to understand the data in questionProduce clean and concise documentation for existing model and sample messages throughoutIntegrate with solutions forData Lineage, Security, etc. This role requires a wide variety of strengths and capabilities, including: BS/BA degree or equivalent experienceStrong background in business data modelling preferably in Trade Management in investment bankingKnowledge of trade lifecycle across Derivatives, Securities and FX productsExpertise in modelling various methodologies: Class Models&Entity; Relationship Models (3NF and Dimensional)Familiarity with data serialization frameworks (Protocol Buffers, Avro, XML)Familiarity with various industry formats FpML, FIX, SWIFT, ISO, and COTS data models (IBM, Golden Source, Teradata, etc)Detailed analytical approach; logical, precise thinkerComfortable with various features of modelling tools: MagicDraw, ERwin, PowerDesigner Our Corporate&Investment; Bank relies on innovators like you to build and maintain the technology that helps us safely service the world's important corporations, governments and institutions. You'll develop solutions for a bank entrusted with holding $18 trillion of assets and $393 billion in deposits. CIB provides strategic advice, raises capital, manages risk, and extends liquidity in markets spanning over 100 countries around the world.  When you work at JPMorgan Chase&Co.;, you're not just working at a global financial institution. You're an integral part of one of the world's biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.  At JPMorgan Chase&Co.; we value the unique skills of every employee, and we're building a technology organization that thrives on divesity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you're looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you.  Ready to take your career to the next level? Apply today."}