{"jobID": "2802545982", "jobLocation": "Fort_Worth_TX", "jobTitle": "Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "101000", "jobDescription": " The successful candidate for this position will manage efforts and lead staff delivering Lockheed Martin (LM) Enterprise Operations Business Intelligence and Analytics implementations. The efforts are key to the executive-led transformation into a data-driven company.  This position is a Leadership role, reporting through the LM Enterprise Business Services (EBS) Analytics Center of Excellence (ACE) organizations. Work location is at the Lockheed Martin Valley Forge Facility. Limited travel requirements are anticipated.  LM Enterprise Operations uses Big Data distributed technology, SAP HANA high speed, in-memory database, as well as a large Oracle Enterprise Data Warehouse (EDW). SAP Data Services and Informatica provide large-scale, scheduled data integration. A data virtualization environment to enable data access from a variety of enterprise data sources. Tableau and SAP Business Objects visualizations widely used, both for IT-driven solutions and self-service data discovery.  Duties include, but are not limited to: Oversight of assigned Enterprise operations / Analytics development and support efforts, including responsibility for cost, schedule, quality, and system performance.Leadership of staff, who perform the development and support efforts, toward performance excellence, including mentoring and coaching on best practices.Contribution to ACE BI/Analytics strategies and tactical implementation of those strategy components.Coordination with multiple functions at EO and with peers across business units.Management of assigned staff development (performance management, merit, promotions, etc.) and policy compliance, as well as all aspects of staff hiring, resource planning, & assignments.Management of assigned budgets (Project Investment, Sustainment, EBS Overhead, Travel, Training, and Awards) for optimal use and achievement of organizational goals. Basic Qualifications Experience working with business communities to develop and deploy business analytics solutions.Demonstrated ability to lead Business Intelligence (BI) / Advanced Analytics / Data Warehouse technical teams to develop, release and support deliverables.Demonstrated management skills including budget management and scheduling.Experience with AWS, in-memory database and ETL toolsExperience with Business Intelligence products, preferably Business Objects and Tableau Desired skills Staff management (performance management, merit, promotions, hiring, training skill development, etc.) experience.Experience leading a diverse team with multiple components across geographic locations.Demonstrated business acumen and ability to balance technical requirements with business needs.Ability to proactively identify and mitigate risks.Experience mentoring and coaching.Demonstrated ability to perform well and multi-task in a fast-paced environment.Demonstrated ability to coordinate effectively across both Information Technology and Business Functional organizations.Experience in implementation, upgrade, migration, and/or retirement of BI and analytics platforms, including collaboration with Infrastructure and IT Security organizationsExperience with cloud and distributed big data architectures As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  Join us at Lockheed Martin, where we’re engineering a better tomorrow. Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Job Location(s): Bethesda Florida, Bethesda Maryland, Bethesda Pennsylvania, Bethesda Texas"}