{"jobID": "2687047650", "jobLocation": "Foster_City_CA", "jobTitle": "Research Scientist I, Discovery Virology", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "128000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities: Seeking a highly motivated, creative, and collaborative scientist with a strong passion for discovery of new life-saving medicines. The candidate will join our internal efforts focused on the research and development of novel HIV therapeutics, including small molecule drugs and biologics, with a potential to achieve cure or remission of HIV infection. The successful candidate will be responsible for leading, conducting and coordinating key biological studies focused on the discovery and validation of novel targets and therapeutic approaches for the targeted elimination of cells harboring latent virus. He/she is expected to play a leading role in implementing novel technologies and/or methodologies as needed and will collaborate and work closely with a multidisciplinary team to support preclinical evaluations of molecules, towards the selection of leads for clinical development.  Gilead is a fast-paced, data-driven, scientifically rigorous organization and the role will suit a scientist who is able to thrive in this type of environment. Essential Duties and Job Functions: Work in a project-team based structure to lead and execute virology and cell-biology based studies to evaluate new molecular targets, therapeutic concepts, and therapeutic agents for the targeted elimination of HIV reservoir.  Introduce new tools, assays and models relevant to HIV reservoir eradiation strategies.  Design, execute and oversee studies to support hypothesis-based research.  Participate in multidisciplinary teams, including leading essential parts of drug discovery projects.  Communicate high impact and clear presentations on data and interpretations to project teams and R&D; management.  Author and review non-clinical pharmacology data in support of regulatory documents and publications.  Support relevant external collaborations and evaluations of business development opportunities as needed in applicable areas.  Maintain knowledge of scientific advances in relevant fields and competitive activity from literature, scientific meetings and external contacts.  Effective team player who thrives in a high pace environment where excellence, accountability and innovation are critical for success. Knowledge, Experience and Skills: PhD or equivalent degree in virology, immunology or relevant scientific discipline and a minimum of 2 years of post-doctoral experience with proven successful research in industrial or academic settings.  Extensive experience in cell culture and/or virology techniques such as primary cell isolation and culture, immune cell functional assays, multi-color FACS, ELISA/Luminex, as well as molecular biology techniques such as gene expression profiling, qPCR and cloning.  The ability to work collaboratively in a cross-functional and team-based environment.  Excellent written and oral communication skills and ability to translate ideas and data into concise written and/or verbal communications.  Strong motivation, independence, and ability to integrate into and work within a high-paced multidisciplinary environment with minimal supervision.  #LI-KW1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}