{"jobID": "2730698822", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientist - Machine Learning and Connectivity Studies", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "102000", "jobDescription": "Job Description The Global Data Insights and Analytics (GDI&A;) Machine Learning and Connectivity Studies team supports Ford Motor Companys various connected vehicle initiatives with analytical and machine learning solutions.  We are looking for a data scientist with expertise in Machine and Statistical Learning. We are especially excited about candidates with prior experience in scalable technologies (Hadoop/Spark) and strong technical mindset who demonstrate a passion for applying state-of-the-art solutions to novel and challenging problems.  As a member of this dynamic team, you will have the opportunity to work with some of the brightest global subject matter experts in product development and vehicle connectivity who are transforming the automobile industry. The job candidate should have great autonomy, exceptional collaboration and leadership skills, and self-discipline to conduct original research and choose appropriate methodologies to solve related problems. Responsibilities:Explore and analyze source data and data flows, working with both structured and unstructured data. Manipulate high-volume, high-dimensional data from a variety of sources to identify value-generating patterns, anomalies, relationships, and trendsDevelop scalable machine learning algorithm solutions to address real-world automotive and mobility challenges and to enable an accelerated vehicle development processesUtilize analytical applications (Python/R) and recent Big Data technologies (Hadoop/Spark) to identify trends and relationships between different pieces of Ford-owned and third-party data; draw insightful conclusions and translate those analytical findings into next generation mobility algorithms.Write timely and high-quality work reports, external publications, and records of invention to document new ideas and research results. Communicate and present model insights to business customers and executivesStay current with advances in emerging technologies and analytic solutions for use in quantitative model developmentJob Requirements:Basic Qualification:Bachelors degree in a quantitative field such as Computer Science, Mechanical/Electrical Engineering, Statistics, Economics, Mathematics, Physics, or related field1+ years of academic or industrial experience with Machine Learning methods and tools, including but not limited to: deep neural networks, linear and nonlinear regression, classification, and clustering1+ year of academic or industrial experience in Hadoop/Spark3+ years of academic or industrial experience in an analytic language such as Python, R, Java, or ScalaPreferred Qualifications:Masters or PhD in a quantitative field such as Computer Science, Mechanical/Electrical Engineering, Statistics, Economics, Mathematics, Physics, or related field.Demonstrated ability in the application of Machine Learning to real-world industrial settings with large scale data.Experience with high-performance Deep Learning frameworks such as TensorFlow, PyTorch, Theano, Caffe, Caffe2Experience with version control systems such as GitStrong oral, written, and interpersonal communication skills and an ability to work in a collaborative team settingComfortable working in a fast-paced and innovative environment where problems are not always well-defined The distance between imagination and . Creation. It can be measured in years of innovation, or in moments of brilliance. And, it can be a road you start traveling right now. When you join Ford Motor Company, your journey begins. You become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always ready to go further.  At Ford Motor Company, the distance between you and an amazing career has never been shorter. Join the Ford team today, and discover the benefits, rewards and development opportunities youd expect from a diverse global leader.  Candidates for positions with Ford Motor Company must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship may be available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status. Ford Motor Company also is committed to take affirmative action to employ and advance in employment such persons. "}