{"jobID": "2567854176", "jobLocation": "Sunnyvale_CA", "jobTitle": "Principal Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.target.com", "Headquarters": "Minneapolis, MN", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (TGT) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "201000", "jobDescription": " Description: Join the Data Science & Engineering team at Target. Here we employ cutting edge technologies to help Target meaningfully engage with guests and make intelligent business decisions. Data Engineers partner closely with Data Scientists, continuously innovating to harness valuable insights from data generated and captured at Target. You will work in an environment that provides the freedom and agility of a startup, with the security and vast resources of a large established company.As a Principal Data Engineer, you will be expected to design and architect high quality, flexible, manageable and performant systems and services. You will architect solutions that will capture, manage, process and serve small to large data at scale. You will work with business partners to provide technical solutions for business problems. Responsibilities will include analyzing, designing, programing, debugging, modifying software for existing and new products used in distributed, large scale analytics solutions.We are looking for a highly-motivated engineering professional who will partner with product owners and management at one end, and lead and motivate scrum development teams on the other.Key Responsibilities:Lead decision-making process for selection of software products and architecture solutionsDevelop software systems using test driven development employing continuous integration practicesMentor and partner with engineers to develop software that meets business needsFollow agile methodology for software development and technical documentationInnovate constantly and keep systems up to date with current technologiesRequirements10+ years experience in developing software applications3+ years experience working on Bigdata technologies. Preferred experience with Spark, Druid, Hive and Apex on HadoopMS degree or PhD degree in Computer Science or area of study related to data sciences and data miningProficient in application/software architecture (Definition, Business Process Modeling, etc.)Understand application/software development and design.Collaborative personality, able to engage in interactive discussions with the rest of the teamInquisitive on Big Data technology and current on new ideas and toolsQualifications:"}