{"jobID": "2816287681", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist - Machine Learning", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "135000", "jobDescription": "Job ID: JR0070165Job Category: Engineering SupportPrimary Location: Santa Clara, CA USOther Locations: US, Oregon, HillsboroJob Type: Experienced HireResearch Scientist - Machine Learning Job DescriptionBusiness Group  Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.  Intel Labs is seeking motivated researcher in the area of machine learning and high performance computing research. This is a full-time position with the Parallel Computing Lab.  The Parallel Computing Lab researches new algorithms, architectures, and approaches to address the most challenging compute- and data-intensive applications. We are focused on delivering new Intel software and hardware technologies that will transform the enterprise and technical computing experience. We work in close collaboration with leading academic and industry partners to accomplish our mission.  In this position, you will be responsible for conceiving, researching, and prototyping new machine learning and high performance computing techniques, and you will develop relevant software and hardware technologies with the goal of converting these into products and fueling Intel’s growth. You will identify and research promising technologies typically 3-5 years prior to product development. This requires an understanding of state-of-the-art techniques in machine learning and high performance computing algorithms, language/runtime opportunities for improving programmer productivity, along with a deep understanding of computer architecture. You may also participate in the development of intellectual property. Behavioral Traits:You must possess strong verbal and written communication skills and the demonstrated ability to work in a demanding team-oriented environment. Qualifications Qualifications You must possess the minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum qualifications and are considered a plus factor in identifying top candidates. Experience would be obtained through your educational level research and/or relevant job/internship experiences. Minimum Qualifications:PhD in Electrical/Computer Engineering, Computer Science, or a relevant engineering disciplinePreferred Qualifications: 1 year of Experience in the following: Middleware/runtime systems.Computer architecture.Performance profiling and characterization  -3 years of school and/or internship experience in the development of machine learning and high performance computing techniques3 years of school and/or internship experience in functional and/or object-oriented programming (e.g., C , Java, etc.)Inside this Business GroupIntel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units. Other Locations US, Oregon, Hillsboro Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}