{"jobID": "2818298239", "jobLocation": "San_Antonio_TX", "jobTitle": "RESEARCH ANALYST - SR. RESEARCH ANALYST - SPACE DATA SYSTEMS", "companyRating": "3.9", "companyInfo": {"Website": "www.swri.org", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1947", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Los Alamos National Laboratory, Battelle, SRI International"}, "estimatedSalary": "77000", "jobDescription": "Job Summary: Lead small teams to develop and deploy Java web applications to support a variety of NASA/ESA space missions. The web applications support space missions by providing tools for planning mission activities, instrument telemetry data management, spaceflight operations tools, and space manufacturing support. Responsibilities will include managing software developers, developing software in Java in accordance with the section's software engineering process, creating and improving existing web pages with JavaScript, Spring, jQuery, and CSS, writing SQL to work with Oracle and MySQL databases, administering Linux and Solaris servers and virtual machines, and working with scientists and engineers to plan new features and review products in development. Education/Experience: Requires a BS or MS degree in Computer Science, Computer Engineering or related with at least a 3.0 GPA. BS level candidates require a minimum of 2 years industry related experience with 1 year experience as a software lead, software technical lead or software project manager and experience with Java or either C++, C#, Groovy, or Scala and a willingness to learn Java. MS level candidates require a minimum of 1 year industry related experience with experience as a software lead, software technical lead or software project manager and experience with Java or either C++, C#, Groovy, or Scala and a willingness to learn Java. JSP, Servlet, Spring, or SQL experience (Oracle or MySQL) is preferred. Experience with Javascript, jQuery, and CSS is a plus. Linux or Solaris server and/or virtual machine system administration experience is a plus. Experience with Apache HTTPD and Apache Tomcat is a plus. A valid/clear driver's license is required. Special Considerations: Must be a U.S. citizen or Permanent Resident due to ITAR work in section."}