{"jobID": "2823244207", "jobLocation": "Los_Angeles_CA", "jobTitle": "Implementations Analyst (Big Data)", "companyRating": null, "companyInfo": {"Website": "www.conversionlogic.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " MarketShare, Visual IQ, Convertro"}, "estimatedSalary": null, "jobDescription": "Machine Learning + Cloud Analytics for Enterprise Marketers Our team is changing the way marketers understand their cross-channel portfolio by translating the most sophisticated data science on the market into clear, actionable insights. For us, \"attribution, evolved\" isn't just a slogan; with our machine learning-powered Ensemble Method, we break free of the one-size-fits-all algorithm and create a truly unique, dynamic, and predictive solution for our customers. Conversion Logic is a media agnostic, lean start-up with brains and grit, and we're dedicated to helping clients reduce friction, adapt and realize value more quickly than ever before.  Changing an industry is never a small task and requires a team of exceptional people. As an ImplementationsAnalystyou will leverage your experience in Ad Tech and industry insights to ensure the integrity of big data' flowing in and out of our platform. You will work closely with our Project Management, Client Services, Engineering and Data Science teams, our wonderful big-brand customers and leading industry technology vendors, and must be able to communicate effectively both in technical and non-technical settings. Technical competence is a must you will need to read code, API documentation, write specifications for engineering and be able to QA large sets of data in a cloud-based infrastructure. We're looking for someone who is detail-oriented and has broad knowledge of ad serving and tracking technologies and systems. If you think this is you, we look forward to hearing from you. HOW YOU WILL HAVE AN IMPACTLead and implement the technical integration of numerous complex data sources for clients utilizing the Conversion Logic platform and systems; this includes access to external platforms, data assessment, documentation and specification, configuration and QA according to the type of data and objective of the integration.Validate implementation across clients and vendors, through tools and adhoc data analysis, which support client's business objectives; that is, that their implementation allows them to answer the questions they are trying to answer.Work closely with clients, their vendors and media partners to ensure integrity, accuracy, completeness and timeliness of data collected.WHAT YOU WILL NEEDB.S. or Minor in an analytical field such as Computer Science, Math, Statistics, Engineering, Economics or equivalent experience1-2 years of work experience with big data and web technologiesExperience with large-scale data warehousing and analytics projects, including using AWS technologies Redshift, S3, EC2, etc.Must have experience: SQLWorking knowledge and experience with several areas of technology such as: Programming languages such as Python or Java.Networking protocols such as HTTP and HTTPS, FTP, SFTPAPI technology including REST and/or SOAPWeb technologies or languages such as HTML, JavascriptWorking knowledge of ETL and other areas including data analysis and data visualizationDesired experience with Version Control Systems such as git or SVNDesired experience using a command-line interface to read and update text files and execute scripts.Familiarity with issue tracking tools (JIRA preferred)Ability to work in a fast-paced environment with tight deadlinesTeam-player with a GREAT attitudeExperience with Digital Advertising (preferably Omni Channel Measurement or DMP ) is a huge plus!Conversion Logic is an EOE M/F/D/V"}