{"jobID": "2728740536", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Clinical Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.rallyhealth.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "164000", "jobDescription": " Purpose, mastery, and autonomy. We provide all three at Rally Health (rallyhealth.com), a company that's revolutionizing population health and healthcare. Work for the purpose of improving millions of people's wellness and lifestyles. Help build and improve our platform of mission critical health applications. As a Senior Medical Coder working in the Clinical, Behavioral & Strategy Team, you will collaborate closely with the Data and Reporting teams to identify, define, measure, and improve the impact of Rally products on users’ lives. Responsibilities:Assign and sequence codes for multiple medical treatments and care pathsContribute to the development of new health data management and storage systemsStructure and categorize PHR data for front end display use across multiple code systemsReviews bulletins, newsletters and publications to remain current in regulation trends related to medical record coding and documentationComply with legal requirements –including HIPPA- regarding coding procedures and practicesCommunicate effectively in a cross-functional team environmentRequirements:CCS or CPC-H required; RHIT or RHIA preferredProficient in ICD-9-CM, ICD-10, CPT and NDC codingMinimum of five years of coding experienceAnalytical mindset, with great attention to detailExcellent communication and presentation skillsProficient in medical terminology, including anatomy and physiologyTeam player and strong individual contributorNice to Have:SQL querying abilities a strong plusWorked with big data technologies like Hadoop, Spark, Flume, HUE etc.Able to learn new technologies quickly Rally Health is committed to ensuring that its workforce reflects America’s diverse population. Rally Health knows that such diversity will enrich us with the talent, energy, perspective and inspiration it needs to achieve its mission. Rally Health believes in a policy of equal employment and opportunity for all people based on merit and commitment to the principles of diversity. It is our policy to recruit, hire, train, and promote individuals in all job titles, and administer all programs, without regard to race, color, religion, national origin or ancestry, citizenship, sex, age, marital status, pregnancy, child birth or related medical conditions, personal appearance, sexual orientation, gender identity or expression, family responsibilities, genetic information, disability, matriculation, political affiliation, veteran status, union affiliation, or any other category protected by applicable federal, state or local laws.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}