{"jobID": "2755573851", "jobLocation": "Austin_TX", "jobTitle": "Data Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.rigup.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "Do you wake up in the morning with an overwhelming urge to wrestle mountains of data into useful intelligence? Are you an amazing data engineer who loves working on phenomenal products in challenging industries? Are you ready to push yourself, learn new things and advance your career?RigUp is the fastest growing tech startup in the oil & gas industry. We're seeking a special data engineer to become a key member of our team. If you're ready for new challenges, we'd love to hear from you.Our team has great people from all over the US and beyond, from all sorts of industries and all walks of life. We highly value the different perspectives and unique ideas that diversity brings to our company, and consider it an absolute necessity for our future.What you will do You'll jump right into a wide variety of challenges, working to corral, combine and analyze data from all parts of the company, including product, marketing, sales and finance. You'll immediately start helping people throughout RigUp make better decisions.You’ll develop deep expertise in our products and play a key role in defining our data architecture and toolset over your first couple months, establishing yourself as the go-to person for analytics in the company and growing our continuous improvement culture.You'll work on all aspects of our maturing data stack, using SQL and ETL tools to pull data together and prepare it for analytics, Javascript or Python to glue data sources together, and a variety of analysis tools such as Tableau to deliver useful results.You'll drive greater use of data throughout RigUp by helping others access and analyze the right data for their work. You'll prepare and help other prepare presentations and summaries of analysis for a diverse set of use cases.You’ll be thrown into a close-knit team that moves fast, values failure when it teaches us something, and wants people to solve problems. You’ll thrive as someone who learns quickly, works well independently and with others, and above all gets stuff done.You should be someone who will easily become passionate about our product and its success. You want to understand our business model and our users, then work hard to make our product the best it can be.We’d like you to have some experience working as a data engineer or analyst on a modern data stack, and in particular have a working knowledge of SQL. More important though is your ability to quickly learn new things, manage your own productivity, and improve yourself and our product every single day. If this is you, we want to meet you.What we offer Competitive salary with 100% company-paid health insuranceFlexible work schedule and vacation policy401k with generous matchingGreat office in downtown Austin with fully stocked kitchen and optional standing desksCatered team mealsWe are an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}