{"jobID": "2777778068", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.gopangea.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ABOUT US Founded in 2012 and headquartered in Chicago, IL, Pangea started with the mission of making money transfer simple, fair and safe. Since then, we’ve strived to enhance the security and reduce the costs and pain points of international money transfer.  As Pangeans, we value introspection, accountability, empowerment, excellence, and above all, kindness. We believe in a fierce dedication to customer experience. We know that diversity is the key to innovation and creativity. If you have a growth mindset and you thrive under pressure, you’re a great fit for our team! ABOUT THE ROLE As our company continues to grow, we are adding a Senior Data Analyst to contribute to this momentum. We are looking for an analyst to partner primarily with our product and marketing teams to help improve customer onboarding and retention. This role requires someone passionate about collecting and analyzing data to improve customer experience, forming and investigating testable hypotheses, and explaining results that will be used to make product and marketing decisions. You can expect to set up and analyze A/B tests for new experimental features and marketing campaigns, generate and size opportunities to prioritize product features, and define key performance metrics.  The ideal candidate will be comfortable working with data programmatically (you write SQL and can code in R or Python). You will impress us with a portfolio demonstrating analytical techniques like multivariate regression, hypothesis testing, predictive modeling, machine learning, and/or logical data modeling. As this small team continues to grow there's also an opportunity to help shape and guide its expansion through mentorship and advocacy across the company. RESPONSIBILITIESRefined user segments to help understand patterns and behaviors in order to target the most profitable users and maximize customer lifetime value.Partner with our product and marketing team to utilize data to inform growth, optimization, and user retention efforts.Instrument conversion funnels in tools like Mixpanel, Leanplum, and Google Analytics and lead reporting on funnel metrics.Partner with the software engineering team to design, deploy and measure A/B tests to drive incremental improvements in Pangea products.Assist teams in various departments with building and improving their dashboards reporting out performance to the rest of the company.Contribute to our data warehousing strategy by crafting dependable data pipelines and automated reporting using expertise and understanding of the product and marketing teams’ data models.QUALIFICATIONS2+ years of experience as a professional data analyst, business analyst, or other analytics intensive roleBachelor’s degree with courses in mathematics, statistics, econometrics, computer science, engineering, or relevant quantitative academic areasExposure and relevant work experience using statistics and programming to derive insights and automate work processesExcellent ability to communicate technical information to non-technical audiencesPassion for research, exploration, and self-learning Pangea is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status."}