{"jobID": "2769070312", "jobLocation": "Chicago_IL", "jobTitle": "Wealth Management, CWM Operations - Data and Reporting Analyst - Associate", "companyRating": null, "companyInfo": {"Website": "www.chase.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "J.P. Morgan Asset & Wealth Management, with client assets of $2.4 trillion, is a global leader in investment and wealth management. Its clients include institutions, high-net-worth individuals and retail investors in every major market throughout the world. The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. For individual investors, the business also provides retirement products and services, brokerage and banking services including trusts and estates, loans, mortgages and deposits.Our BusinessWealth Management Operations supports the JPMorgan Private Bank and Chase Wealth Management in JP Morgan’s Asset Wealth Management line of business.The Private Bank is the world’s premier service provider for ultra and high net worth individuals. Our goal is to help these affluent individuals across the globe optimize their wealth, after taxes and across generations. Wealth Management Operations provides end-to-end support for all aspects of the client experience, working closely with client service, fiduciary, product specialty groups, third party vendors and other internal groups.Chase Wealth Management encompasses our Chase Private Client (CPC) and Chase Investment Services businesses. Through a dedicated team of a banker and J.P. Morgan Advisor, Chase Private Client brings our affluent clients concierge banking from Chase and access to the investment expertise from J.P. Morgan. Chase Investment Services provides investment solutions to a broad range of Chase customers through Chase Investment Advisors. The J.P. Morgan Securities Client Service Center’s mission is to create a great client experience and help individuals across all 50 U.S states to save and invest wisely. The group works in a team environment to assist clients with service over the telephone and serves as experts on our online platform, such as Chase.com.Role DescriptionThe CWM Operations Data Analytics and Reporting Analyst will perform reporting and data analysis functions in support of the various functional areas of Chase Wealth Management Operations. The role requires someone with the ability to work in a complex data environment as well as the ability to partner with the business to find creative solutions to business problems and provide actionable information to business leaders. Candidates must possess advanced problem solving skills, the willingness to learn, and the ability to effectively communicate findings verbally and in written/presentation format. In addition, the analyst must have the ability to research and resolve issues independently but must possess a team player mentality. The ideal candidate is a critical thinker that will thrive in a fast-paced, competitive environment and will mesh well with a team that prides itself on attention to detail and results.Key FunctionsAnalyze data and review reports to provide insights and recommendations to the businessAssure the integrity of data, including data extraction, manipulation, analysis and reportingWork with business functional area counterparts to develop and enhance management reportingPartner with business owners to implement new data sources and ensure consistent definitions are used in reporting and analyticsInterface with business management, operations, and risk managers to develop a wide range of metrics focused on measuring efficiency, service, and controlDocument, review, analyze and evaluate business processes, systems and user needs. Types of analysis and reporting may include: scorecard development, quality reviews, workflow analysis, and business / client reporting.Proactively generate ideas for improvement in reporting as well as new ways of looking at informationDetailed analysis of information with the goal of developing a robust conclusion and recommendationDevelop, test and implement daily, weekly, monthly, and ad hoc reports that enable data driven business decisionsPerform statistical analysisThe ideal candidate will possess a “can do” attitude, be detail oriented, and have a strong aptitude for analyzing large, complex data sets to deliver high quality reporting to senior managers.3-5 years of experience in a reporting or business analytics roleExcellent working knowledge of Microsoft Office Applications (Excel, Pivot Tables, Access, Power Point, SQL)Self-starter with the ability to take ownership and work independentlyStrong data analysis/quantitative/technical aptitude with ability to quickly learn new metrics, processes, and datasetsExcellent attention to detail and accuracyStrong organizational and time management skillsAbility to multi-task and manage multiple prioritiesStrong verbal and written communication skillsExecutes superbly and meets commitmentsAbility to perform statistical analysis to identify relationshipsBachelor’s degree required, with preferred concentration in Math, Statistics, Economics, or similar quantitative disciplines"}