{"jobID": "2789633119", "jobLocation": "Chicago_IL", "jobTitle": "VP Software & Data Engineering", "companyRating": null, "companyInfo": {"Website": "www.8451.com", "Headquarters": "Cincinnati, OH", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "VP, Software Engineering – Chicago, ILABOUT US At 84.51°, people are the key to everything. If you are energetic, motivated and naturally curious, and enjoy working in a collaborative environment, we invite you to join us.  We analyze. We challenge. We connect. We are innovators. The things we are achieving are revolutionizing the retail industry. By transforming data into knowledge, we are giving our partners a deep understanding of who the customer is and what they are about.  Throughout 84.51º, change is embraced, explored, and enhanced. We challenge the status quo. We’re always learning more. Always doing more. Always with a purpose. We believe in making people’s lives easier and more satisfying. That’s why we’re always battling complacency, challenging our partners to view decisions as opportunities to surprise and delight their customers. By equipping our partners with a sustainable customer engagement model, we enable them to create lasting change.  We are dedicated to always doing what’s right and never compromising on our values. That’s why we have created a culture where every opinion is respected, and contrary thinking is encouraged.  Making life more rewarding for our community and our associates is an essential part of the process. Our team is known for their enthusiasm, camaraderie and sense of fun. We work hard and we play just as hard. That’s why we engage in a range of official and unofficial activities to get together, serve the community, and have fun.  We continually seek people who make us better. In order to continue to grow, we need more great people who want to join us in doing cool, industry-changing, brain-stimulating work.  The VP,Software Engineering will build and lead the development teams within the 84.51° Engineering Chicago organization and play a key role on the 84.51° Engineering Leadership team. The job is located in our 84.51° downtown Chicago office. This role will be responsible for partnering with 84.51° Product Management and Enterprise Architecture to lead all strategic, tactical, and operational aspects of building solutions to support the 84.51° strategy. The role will also be responsible for leading our Chicago Hub and making connections across the business to connect the office to our business. The successful candidate will be an innovative, forward thinking technology leader with a relentless focus on customers and inspiring people. They will be a natural networker across teams and with external partners.  You will be accountable for: Driving development initiatives within Engineering through innovative and strategic thinking.Providing leadership to create clarity between Engineering priorities/projects and the strategic objectives of 8451.Collaborating with partners across 84.51° to create and execute Engineering strategies in support of 84.51° overall business plan.Recruiting, motivating, mentoring and growing a world-class Engineering team.Building relationships with key partners within the Kroger Technology organization to share best practices, help accelerate the growth of both organizations, and deliver joint initiatives as appropriate.Actively champion 84.51° agile mindset by demonstrating lean-agile leadership, helping manage boundaries and remove impediments for development teams.Leading and coaching direct reports in the performance of responsibilities; providing ongoing feedback to direct reports and completing performance reviews.Leading and coaching direct reports in the performance of responsibilities; providingCapable of networking in the local Chicago market and with business leaders in the Chicago hub and across geographic boundaries.REQUIRED QUALIFICATIONS, SKILLS, AND EXPERIENCEMinimum 10 years software development experience with minimum 4 years’ experience in management.Proven ability to think and contribute at the strategic level.Proven ability to build a team from the ground up and demonstrated capability to build, mentor and maintain an inclusive team based environment.Delivered innovative results in previous roles and have strong knowledge of industry trends and industry competition.Demonstrated written, verbal and presentation/ public speaking communication skills.Demonstrated interpersonal skills with an ability to communicate and work effectively with diverse groups of people.Proven commitment to continuous improvement within the workplace.Strong problem-solving and decision-making skills.Strong experience leading and operating in a lean, agile environment with distributed teams.Demonstrated ability to deliver software through on-premise, cloud, and multi-cloud platforms.Strong understanding of data analytics, data science, and data science engineering fields.Demonstrated experience in delivering software solutions using full stack technologies such as Java, Spark, Python, Hadoop ecosystem, and Cloud providers (GCP, Azure, AWS).Solid understanding of cloud-native and microservices architecture paradigms.PREVIOUS JOB EXPERIENCE AND EDUCATIONBachelor’s Degree in Computer Science/Engineering, IT or related discipline or greater.Demonstrated experience leading a large software development staff. 84.51° is an Equal Opportunity Employer."}