{"jobID": "2829521574", "jobLocation": "Somerville_NJ", "jobTitle": "Scientist, Toxicology & Biocompatibility", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": " Ethicon Endosurgery of Johnson & Johnson, is  recruiting for a Scientist, Toxicology & Biocompatibility, to be located in  Cincinnati, OH or Somerville, NJ.  The  Ethicon Surgical Care business offers a broad range of products, platforms and  technologiesincluding sutures, surgical staplers, clip appliers, trocars and  synthetic mesh devicesthat are used in a wide variety of minimally invasive  and open surgical procedures. Specialties include support for treatment of  colorectal and thoracic conditions, womens health conditions, hernias, cancer  and obesity. The Ethicon Surgical Care business combines products and services  of two market-leading legacy companies, both with long histories of medical  innovation. Ethicon, Inc. based in Somerville, New Jersey, was founded more  than 80 years ago as a pioneer in suture development and manufacturing, helping  to transform the safety and effectiveness of open surgery. Ethicon  Endo-Surgery, Inc. was created 20 years ago in Cincinnati, Ohio, developing  innovative devices that have driven the revolutionary shift from open to  minimally invasive surgery that continues to lead the industry today.  Thriving  on a diverse company culture, celebrating the uniqueness of our employees and  committed to inclusion. Proud to be an equal opportunity employer.Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.The  Scientist, Toxicology & Biocompatibility is responsible for evaluation of  medical device (MD) product and combination products for safety as per US and  internal procedures and as per the ISO 10993 Standard series. Assisting  in the design and implementation of test systems and procedures for  biocompatibility testing for JNJ MD materials and products. Ensuring  appropriate documentation is established and maintained. Ensuring that testing meets all international and  domestic test requirements according to ISO (International Organization  for Standardization), FDA (Food & Drug  Administration) - CDRH (Center for Devices and Radiological Health) and GLP (Good Laboratory Practice).  Overseeing, designing, implementing, and analyzing testing systems, procedures  and test results for biocompatibility / toxicology evaluation for all JNJ MD  materials & products. Review, interpret,  and summarize raw data from reports and support coordination of central  documentation procedures required for reports. Apply technical expertise  to solve complex biocompatibility problems, utilizing ingenuity, business  experience and independent judgment. Interact  closely and provide consultative direction and technical expertise to  R&D;, Clinical Affairs, Regulatory Affairs, Surgical R&D; and Supplier  Management within JNJ MD. This person will also be responsible for contribution  to Preclinical Strategy documents, initiation of material characterization studies,  in vitro and in vivo study design and final toxicological and biocompatibility  reports where necessary to support JNJ medical device products for registration  as their expertise allows.  The Scientist, will function as a key team member by energetically supporting  the goals of the Preclinical Center of Excellence (COE) and JNJ. Collaborate  with associates of diverse technical backgrounds and efficiently execute  evaluations, testing, reporting for product development and product life cycle  management, including biocompatibility and product characterization. The  Scientist will provide technical input and support to project team members in  investigation and experimentation efforts aimed at practical applications of  scientific theories or principles. This person will provide experience and  knowledge of product safety data and procedures to support on-site and off-site  Regulatory Authority audits to support product, which may be sold in various  worldwide markets.  The  Scientist is responsible for serving as the sponsor representative for  GLP/non-GLP biocompatibility studies at a CRO or Ethicon in accordance with  current global regulatory and compliance requirements under minimal  supervision. The associate will work with the project coordinator to ensure high  quality studies are completed on time with the project team requirements and  are compliant to internal and external procedural requirements.  Position  Duties & Responsibilities: Design and implement testing systems and  procedures for biocompatibility testing for JNJ MD materials and productsEnsure appropriate documentation is  established & maintainedEnsure that testing meets all international  & domestic test requirements according to ISO (International  Organization for Standardization), FDA (Food  & Drug Administration)-CDRH (Center for Devices and Radiological  Health) and GLP (Good Laboratory  Practice) lawOversee, design, implement, and analyze test systems, procedures  and test results for biocompatibility evaluation for JNJ MD materials and  productsSummarizing final contract lab reports and  supports coordination of central documentation procedures required for product  submission reportsApply technical expertise to solve complex biocompatibility  problems as related to the ISO 10993 standards and regulatory authority  requirements for product safetyInteract closely with and provide  consultative direction to R&D;, Clinical Affairs, Regulatory Affairs,  Surgical R&D;, and Supplier Management within JNJ MDSupport on-site and off-site Regulatory Authority audits to  support product that may be sold in various worldwide markets.Maintain a collaborative spirit of the work environment that is  both professional and ensures the integrity of others as partners and team  members who uphold the Johnson and Johnson Credo in everything that is driven  towards a potentially marketed productQualificationsMinimum of a Bachelors degree in biology, chemistry,  microbiology, biomedical engineering or a related scientific field is requiredA minimum of 5 years of experience in biocompatibility assessment  and evaluation in a medical device, pharmaceutical, and/or consumer product  company is requiredAbility to work collaboratively as a team member across various  functions in a challenging and changing environment is requiredExperience working in a regulated environment of medical device  safety and supporting product submission and audit is required; support for  worldwide market registration is preferredKnowledge of biocompatibility assessment for  medical devices and previous knowledge of how to conduct and assist in the  interpretation of in vivo and in vitro studies is preferredProven experience with project management skills, leading safety  evaluation for multiple projects, managing priorities and time management is  requiredFamiliarity with medical device product development is preferredCommunication of issues and concepts in a  clear, concise manner is requiredSelf-directed performance in unsupervised  environment is requiredExperienced use of Microsoft Office (word  processing, project planning, presentation, e-mail and spreadsheets) is  requiredThis position  will be based in Cincinnati, OH or Somerville, NJ,  and may require up to 10%  domestic travelPrimary Location United States-Ohio-Cincinnati Other Locations North America-United States-New Jersey-Somerville Organization Depuy Orthopaedics. Inc. (6029) Job FunctionR&D;Requisition ID8925180415"}