{"jobID": "2746773296", "jobLocation": "Fort_Worth_TX", "jobTitle": "Config Status Data Report Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.lockheedmartin.com", "Headquarters": "Bethesda, MD", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LMT) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Boeing, Northrop Grumman, Raytheon"}, "estimatedSalary": "62000", "jobDescription": "Description: F-35 Variance administrative support is required to load the Major Variance Requests (MVR) data and artifacts into Product Data Manager (PDM) and maintaining the database which tracks variances (both prime and supplier) to closure. Specific corrective actions which must be accomplished to close variances must be monitored and reported. The following tasks will be performed, but not limited to: Load all Supplier Variance Requests (SVRs) and MVRs into PDM.Load all Procurement Contracting Officer Letters (PCOLs) and Contract Mods into PDM associated with approval of SVRs and MVRs. This will require monitoring customer and contract documentation.Send supplier approval emails.Initiate and administer travelled work variances in PDM.Maintain the SVR and MVR database including coordinating projected closure dates, tracking closure activity, and maintaining withholding status. Provide requested reports.Provide support for variance and supplier minor change boards, such as agendas, status, computer support during meetings.Support CSA team by monitoring and status supplier variances to support As-Built records.Require CATIA knowledge to process engineering document conversions for supplier minor change board.Desired Skills: Product Data Manager (PDM)  JSF Data Library (JDL)  Catia Familiarity  Strong Personality BASIC QUALIFICATIONS: Microsoft Office, specifically Microsoft Excel and Access. Good  verbal and written skills. Detail Oriented. Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. As a leading technology innovation company, Lockheed Martins vast team works with partners around the world to bring proven performance to our customers toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  Join us at Lockheed Martin, where were engineering a better tomorrow."}