{"jobID": "2828920798", "jobLocation": "San_Diego_CA", "jobTitle": "Director, Data Science", "companyRating": null, "companyInfo": {"Website": "www.elevate.com", "Headquarters": "Fort Worth, TX", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Public (ELVT) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "General Summary: Elevate is a globally distributed technology firm which develops next-generation financial products focused on managing life’s everyday expenses. The Data Science / Account Management team conceptualizes, develops, deploys, and maintains predictive models using advanced statistical and machine learning methods. These models are used in Elevate’s Underwriting, Account Management, and Operations applications. The Director Data Scientist plays a critical role by championing modeling endeavors and applying cutting-edge modeling techniques to drive growth, control risk, optimize customer engagement, and ensure operations excellence. Primary Responsibilities:Work collaboratively across business units to maximize revenue through best in class account management.Champion models for use in Underwriting, Customer Management, Marketing, Collections and Operations.Develop linear and nonlinear machine learning predictive models for underwriting, account management, marketing, and collections.Efficiently apply data mining methodologies to minimize credit/fraud losses, maximize response, attrition and approval rates, and develop methods to enhance profitability of Elevate products.Develop strong partnerships with Strategy, Finance, and Collections to drive demonstrable business resultsAssist with the implementation of scoring models.Maintain clear, detailed model documentation.Interact with business partners to support the needs and goals of all Elevate portfolios.Experience and Education: M.S./M.A./Ph.D. in a highly quantitative field (Statistics, Economics, Mathematics, Engineering, or other quantitatively-oriented degree) required.6-10 years of experience in modeling and analytics for consumer lending.Experience with third-party consumer credit data and non-FCRA compliant consumer data.Proven track recorded of revenue enhancement through multiple model implementations.Previous experience in FinTech / Credit / Collections.Previous experience leading a team of data scientists / modelers a plus.Knowledge of contemporary supervised and unsupervised data mining techniques a plus.Required Skills and Abilities:Ability to work in fast-paced environment with ever-changing demands.Ability to manage multiple projects at one time.Good communication skills for communication with Risk Management peers, Marketing, Operations, Collections, and Finance.Comfort with terabytes of information, coming from a large number of diverse sources, possibly in various formats.Comfort working in a highly skilled analytics team.Intellectual curiosity and passion to innovate. Problems to you are not unsolvable, they just need to be looked and explored differently.Effectiveness in the face of stress, ambiguity, difficult situations, and rapidly shifting priorities"}