{"jobID": "2803339943", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Manager, Risk & Compliance (SOX)", "companyRating": null, "companyInfo": {"Website": "www.morganfranklin.com", "Headquarters": "Mc Lean, VA", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Why Work Here? One word: opportunity. Our professionals embrace our \"Own Your Career\" philosophy sustained growth means creating new opportunities for experienced consultants at all levels of our organization.  Learn what it means to truly own your career and be a part of a growing organization with a big, bold future. What Will You Do?Advise fast growing companies and well-known enterprises (both publicly traded and privately held) on a wide variety of projects including: risk management, accounting and regulatory expertise, internal audit, business processes and operations, SOX compliance, and managing technology risk.Educate internal and external audiences on ERM and financial and accounting regulatory compliance best practices.Serve as a subject matter expert and engage with clients and colleagues on financial accounting and control-related issues to provide research guidance and give recommendations for potential solutions.Lead project teams to deliver exceptional client service across a variety of risk and compliance solution offerings.Lead engagement discussions and serve as advisor to the client executives, audit committees and board of directors.Maintain the firms solution methodology and approach.Serve as a trusted business advisor managing client relationships and business development opportunities.Participating and leading in business development opportunities.What Do You Need to Succeed?Minimum Qualifications8+ years of professional services experience (public accounting or advisory firm) and/or SOX experience with a Fortune 500 organization.Demonstrated track record of technical expertise with SOX, ERM and internal audit.Demonstrated knowledge of accounting/audit practices, procedures and reporting standards, including experience applying COSOs 2013 framework.One or more of the following risk related certifications: CPA, CIA, or CISA.Knowledge of Tier 1 accounting packages (i.e. Oracle, SAP, PeopleSoft).One or more of the following risk related certifications: CPA, CIA, or CISA.Bachelors degree in Accounting, IT, or related field.Willingness to travel up to 50% or more.Preferred QualificationsPMP, MBA, or Masters in Accounting a plus.Proven ability to lead, motivate and build teams that deliver services and solutions that surpass client expectations.Previous experience leading and executing complex projects in challenging environments.Demonstrated track record growing existing accounts and penetrating new accounts."}