{"jobID": "2808519457", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Program Manager - Digital", "companyRating": "3.2", "companyInfo": {"Website": "www.fuseproject.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "139000", "jobDescription": " At fuseproject, the Client Services team empowers our creative teams to do the greatest possible work in the smartest way possible. We are zealots and are passionate about guiding the process to make concepts a reality. We build. We negotiate. We organize. We empathize.  Fuseproject is seeking an outstanding project / program manager a virtuoso digital producer that has the spirit of a creative who collaborates in the creative process and who understands the technologies needed to produce best-in-class experiences for our programs.  We are hiring for a very specific client that is in the fortune 500 and is on the brink of transforming their entire ecosystem and their entire category. The overall program has a multi-year trajectory that spans across all the studio disciplines, but you would be focused on new to world digital experience designs and light development of the subsequent apps and websites that are delivered as an outcome of the work. As a Sr. Program Manager, you will help develop and execute the plans that allow our digital teams to kick some serious  You will need to be a creative ambassador, excellent communicator, have a passion for tip of the spear innovation, reference a diverse project management toolbox, and exercise excellent judgement skills.  Got your interest? Theres more below: The big picture - baselining your expected responsibilities: work as part of the digital design team, portfolio team and creative leadership on a single, large cap multi-year projectlead client discussions on project plans to ensure client understands project flow, interdependencies and delivery datescreate detail project scoping documents, visual work plans, project schedules, resource plans and risk plans/mitigation strategiesdemonstrate strong written and verbal presentation skills Day-to-day snap shot - what youll do run projects and programs to successful outcomesorientate the clients and internal teams so all are moving in the same direction and same velocitydeftly handle risk, escalate when needed and assist the team in resolutioncontribute to the development of methodologies, standards and best practices to streamline processes and create efficiencies for the teammanage the resourcing of the appointed digital team to deliver amazing brand & product experiences via world-class UI design, UX frameworks, flows and interaction frameworksmaintain budget and fiscal health of the projectlook for the next opportunity with the clientlearn something new every daytravel to the East Coast or EUWhat does the right candidate possess?gritpositivitypresenceflexibilityresilienceconfidence"}