{"jobID": "2831934452", "jobLocation": "San_Diego_CA", "jobTitle": "Data Architect / Data Warehouse Analyst Senior", "companyRating": "3.3", "companyInfo": {"Website": "www.fisglobal.com", "Headquarters": "Jacksonville, FL", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (FIS) ", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Fiserv, First Data, Jack Henry & Associates"}, "estimatedSalary": "102000", "jobDescription": " The person in this position will play a key role in designing and developing of data models, interfaces /other applications in Oracle PL/SQL for clients of FIS ACBS.  Collaborate with clients and understand the requirements provided and thus relating it to ACBS product.  Perform business transformation/data governance workshops with clients to architect information and reporting strategy.  Perform data modeling and data design. This includes logical and physical modeling, partitioning strategies for large tables, and other database optimizations.  Responsible for creating high and low level architectural and data designs and development for different enhancements and other applications on the basis of requirement specifications. Also, requirement refinement, if needed.  Responsible for providing Preliminary and Detailed estimates for different artifacts  Performing testing, documenting user test cases, and creating test logs.  Maintain and Support existing applications developed for client.  Also providing third line support to the production client’s Datamart environment by troubleshooting the issues reported and providing prompt resolution.  Assist ACBS ASP (application service provider) support team as and when required related to Datamart Interfaces/client applications.  Knowledge, Skills, and abilities required:  Strong understanding of the Software Development Lifecycle and experience integrating Data Architecture and Data Governance into that lifecycle to steer towards desirable outcomes.  Strong competency in data modeling and data design. This includes logical and physical modeling, partitioning strategies for large tables, and other database optimizations.  Solid experience with Relational Databases, specifically Oracle, Data Warehousing, OLAP, and Business Intelligence Reporting. Must be able to write PL/SQL Stored Procedures.  Solid understanding of pros and cons for different data warehouse methodologies and architectures (Kimball/Inmon/Data Lake/Hybrid).  Experience designing Star, Snowflake Schemas, Dimensional Data Modeling, SCD (Slowly Changing Dimensions), and CDC (Change Data Capture).  Exposure to emerging data technologies such as NoSQL; must understand them sufficiently to guide the organization in understanding and adopting them.  Experience managing data architecture documentation, and standards for data management, as well as training staff on principles of data architecture.  Experience with analyzing current state and conceiving desired future state, and identifying projects required to evolve.  Knowledge of Web Services (REST), Enterprise Messaging (JMS/MQ/AMQP), and ETL.  Strong understanding of agile software development methodology.  Excel, PowerPoint, and Visio skills.  Specific Technical Knowledge and Experience Desired:  Financial industry experience  Database experience with Oracle, Microsoft SQL Server, and Mongo DB.  Experience with Business Objects, Tableau, or similar software.  Qualifications (minimum requirements):  College degree in Computing Science or Engineering required. Certifications highly desired.  Minimum 5 plus years of experience in a Data Warehouse role."}