{"jobID": "2828975374", "jobLocation": "Morristown_NJ", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.atlantichealth.org", "Headquarters": "Florham Park, NJ", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Newark Beth Israel Medical Center, Trinitas Regional Medical Center, East Orange General Hospital"}, "estimatedSalary": "111000", "jobDescription": " Healthcare is an opportunity to utilize data assets including electronic medical records, population health databases and clinical care models to have immediate and wide impact on people’s lives. The Data Scientist is responsible for developing products to serve the analytic needs of the health system through the application of tools such as visualizations, software development and statistical analyses driven by data resources.  This position is expected to carry out complex analyses with data that uncover insightful and actionable information. They should therefore be capable of complex and creative problem solving with the ability to complete difficult projects that fulfill our outcomes based mission. The ability to coalesce multiple, sometimes divergent, data sets to fulfill the visualization and analysis of an outcome (mortality, readmissions e.g.) is required. Creative solutions are encouraged and immersive experiences preferred.  Primary skills for this position include those requisite for developing products that use data to enable analyses, information delivery and interaction with users. Successful candidates should have a good understanding of a statistical programming language consistent with data science and machine learning including Python or R. Our shop is primarily leaning to Python. Domain knowledge in statistics is essential and tools such as Tibco Spotfire, Tableau or Qlik are useful as well as knowledge or application of a visualization language such as d3.js  Knowledge of information architecture (as defined in the field of design as well as the field of data architecture) is preferred to enable the candidate to construct analyses with complex data sets when data engineering resources are unavailable. Ability to work with data science teams to assist in delivery of analytical outcomes and models.Ability to perform analysis of clinical data with stakeholders and users to deliver actionable insights.Ability to generate a quality work product in a timely manner while maintaining a strong attention to detail.Work closely with end users to design impactful analyses with a variety of methodologies.Strong communication skills to enable the developer to interview users and enhance the user experience.Identify and communicate operational impact of analytical findings/decision support.Support other members of the team with the ability to explain methodologies and assist in development.Be a strong learner with the understanding of continuous professional and technical improvement of skills and techniques.Education:Minimum: Bachelor’s: Computer Science, business, statistics, information sciences healthcare, design, engineeringPreferred: Master’s in Healthcare, Computer Science, Informatics, Analytics, Statistics, EngineeringRequirements:Healthcare experience preferred but not required.Demonstrable skill with R or Python in a data science environment is required.Demonstrable skill with visualization using any methodologies including: Tableau, Spotfire, Qlik, Shiny, D3.jsAtlantic Health System aims to deliver the highest quality and care combined the best experience for our patients and their families. We are confident that you will find success within Atlantic Health System, which has been named for the 8th year in a row to Fortune’s “Top 100 Best U.S. Companies to Work For” list. We believe you’ll find that our culture of collaboration and care exemplifies the value we place on our patients, their families and our employees.All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status."}