{"jobID": "2685801284", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Computer Vision R&D; Scientist", "companyRating": null, "companyInfo": {"Website": "www.utopiacompression.com", "Headquarters": "Los Angeles, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Basic RequirementsPhD (preferred) or Masters in Computer Science/Electrical Engineering/Applied Mathematics or related fieldsStrong background in Computer Vision, Machine Learning, and Image Processing (detection, tracking, classification, online learning, active learning, deep learning, etc.)Past record of original contribution, authorship in reputed peer reviewed vision conferences/journalsStrong programming skills in C++/Python; Proficiency in using MATLABDesired Expertise/ExperiencePrior experience in successfully leading R&D; projectsExperience in writing proposal and winning grantsPost-doctoral experience is a strong plusHands-on experience with EO and/or IR sensorsExperience with GPU based algorithm and/or embedded systems development UtopiaCompression Corporation (UC), based in Los Angeles, CA is a High-Tech Company with considerable expertise in intelligent software solutions. UC develops cutting edge technologies: Computer vision and machine learning for Unmanned Aircraft, maritime surveillance, affective computing, roboticsPlanning and control for autonomous systemsTactical wireless communication networksHuman Computer Interaction for autonomous systemsDeep Neural Networks based IntelligenceBiomedical signal processing and data miningIntelligent Tutoring Systems UC offers a challenging and exciting environment to work on high-risk high-reward technologies with the potential to bring in transformational changes to state-of-the-art. UC is currently seeking a Senior Computer Vision scientist to support its vision technology program. US citizens and permanent residents are preferred.UC BenefitsCompetitive compensation packageFully paid for health care benefitsRelocation, if applicablePaid vacations and sick leave allowancesCompany stock options"}