{"jobID": "2830237926", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Sr. Quality Assurance Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.ufpt.com", "Headquarters": "Newburyport, MA", "Size": "501 to 1000 employees", "Founded": " 1963", "Type": " Company - Public (UFPT) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "About UFP Technologies: UFP Technologies is a producer of innovative custom-engineered components, products, and specialty packaging. Using foams, plastics, composites, and natural fiber materials, we design and manufacture a vast range of solutions primarily for the medical, automotive, aerospace & defense, electronics, consumer, and industrial markets. Our team acts as an extension of customers’ in-house research, engineering and manufacturing groups, working closely with them to solve their most complex product and packaging challenges. For our customers, innovation takes many shapes. But each solution is shaped by a level of design, materials and process expertise that is unique to UFP Technologies. Position Location: Grand Rapids, MI Summary: Provides quality engineering technical support to the entire business related to corrective actions, process control, statistical analysis, customer complaints, component validation, product measurement and testing, product launch, product certification, and audits. Essential Duties and Responsibilities:Ensures quality standards of raw material and products produced meet specifications.Champions customer and/or internal concerns including all ICA activities internally and externally and tracks open CAR to successful closure.Provides oversight, direction, and ensures satisfactory completion of PPAP deliverables to Customer Specific Requirements. Submits to customer and tracks to completion.Defines product measurement scheme and appropriate data acquisition method.Provides frequent instruction, guidance, and direction for manufacturing, engineering, materials, customers, and suppliers in performance measurement.Provides program launch support at UFP and customer facilities.Creates and maintains control system documents.Supports and/or initiates preventive action and continuous improvement.Prepares for, supports and/or hosts internal, customer and regulatory audits.Performs internal system and process audits.Performs capability analysis.Uses DMAIC problem solving methodologies to address in-process, supplier and customer quality issues.Supports product development and production transfer to ensure process capability exists and product requirements are understood.Creates C of C / C of A documents for product shipments.Supports manufacturing and engineering problem solving efforts on in-process and supplier related quality problems.Supports product development and production transfer to ensure process capability exists and product requirements are understood.Writes testing procedures for quality inspectionsImproves and monitors inspection processes.Experience / Education:Bachelor’s degree in quality, operations management or engineering related fields required.7 – 10 years quality experience in manufacturing environment required.Experience leading corrective action and preventative action (CAPA).Lean manufacturing experience strongly desired.Must possess broad problem solving skills (Ishikawa, Red X, 5 Why, etc.).Must possess comprehensive knowledge of ISO 9001 and TS16949 series of standards.Knowledge of the ISO 13485 standard a plus.Must possess comprehensive knowledge of the AIAG core tools.Knowledge and use of the IMDS.Six Sigma black belt certification desired.Please click here to apply.UFP Technologies, Inc. is an Equal Opportunity/Affirmative Action employer Minorities/Women/Veterans/Disabled"}