{"jobID": "2600597648", "jobLocation": "Skokie_IL", "jobTitle": "Computational Biologist", "companyRating": "2.6", "companyInfo": {"Website": "www.lanzatech.co.nz", "Headquarters": "Skokie, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "About LanzaTech: LanzaTech is turning our global carbon crisis into a feedstock opportunity with the potential to displace 30% of crude oil use today and reduce global CO2 emissions by 10%. LanzaTechs carbon recycling technology is like retrofitting a brewery onto an emission source like a steel mill, but instead of using sugars and yeast to make beer, bacteria convert pollution to products! Imagine a day when you can power a plane by recycled carbon emissions, when your yoga pants or sneakers started life as pollution from a steel mill. This future is possible using LanzaTech technology with the first 2 commercial units converting steel mill waste gases to fuels being built; in China with Shougang and in Belgium with the worlds largest steel maker, ArcelorMittal. LanzaTech has an additional 3 commercial projects in the pipeline, in India, South Africa and California. LanzaTech has already produced synthetic jet fuel from recycled carbon emissions and has a partnership with Virgin Atlantic.  In 2017, LanzaTech was recognized as the #1 Hottest company in the Advanced Bioeconomy by Biofuels Digest, the worlds most widely-read bioeconomy daily. The company was also inaugurated into the Cleantech100 Hall of Fame, having been listed in the top 100 cleantech companies over the last 7 years. In 2016, the company won the Young Global Leader Award for Circular Economy at the World Economic Forum, LanzaTech was also the top biofuels company in the 2016 CNBC Disruptor 50 Companies list. In 2015, LanzaTech was awarded the U.S. EPA Presidential Green Chemistry Award for Greener Synthetic Pathways. The companys accomplishments were recognized through a number of prestigious awards in 2014, including the Guardian Sustainable Business Innovation Award for Carbon and Energy Management, Breakthrough Innovation Award at the Platts Global Metals Awards, and the Technical Development Award from the World Petroleum Council. In 2013, the company was named a World Economic Forum Technology Pioneer. About The Role: In this position you will perform comprehensive, high level, integrated analysis on pan omic data sets. Leveredging your analysis you will Suggest genome modifications and procedural improvements to perfect the performance of Lanzatechs proprietary bacterial strains in production fermentation,Advance our systems level understanding the organism in order to accelerate and rationalize strain engineering,Enhance our existing, proprietary, highly predictive 3rd generation genome scale modelEstablish models of evolution occurring in fermenter populations, connect evolutionary events with underlying biology, and propose strategies to influence those evolutionary outcomes. To achieve these goals, you will use and extend existing statistical and computational tools to integrate high volume omic data sets. You will work closely with scientists and engineers in the synthetic biology team, the strain development team and across the organization to address specific critical issues which they identify, and, you will reduce your findings to clear and informative visualizations and graphics and actively disseminate your results, conclusions and insights.  You are a team player who scrupulously documents your work. You are generous in shareing your knowledge with your team mates, and you expect to learn from them in return. You thrive in a agile goal oriented environment. Tou are cusdtomer oriented. You operate comfortably in Linux. Key Duties:Install, maintain and use bioinformatics software toolsIntegrate metabolomic, genomic, proteomic and transcriptomic data sets to solve deep biological problemsEmploy statistical computing to extract hypothesis and conclusions from these integrated dataContribute to ongoing re-annotation of bacterial genome and genome scale model refinement.Write scripts and utility programs in Perl, Python, or Bash.Provide bioinformatics support as requested by biologists in synthetic biology, strain development and other scientific groupDesign and implement data analysis pipelinesClearly document work and methodsCommunicate your findings, insights and conclusions to other scientific teams.Present summary of results to group in weekly meetingsEducation & Experience:REQUIREDPhD in computational biology, quantitative biology, bioinformatics, computational genomics, computational systems biology or equivalentSignificant exposure to prokaryotic biology with emphasis on metabolism, ideally to a gas fermenting acetogenStatistical computing in R in particular employing transcriptomics analysis packages, with documentation in jupyter notebooksExpert user of standard Bioinformatics tools such as MEME, BLAST, multiple sequence aligners, etctools for handling and querying read alignments, such as samtools, bedtools etctools for structure sequence comparison such as Chimera or PhyreExpert NGS analyst including RNASeqExperience integrating metabolomics, genomic, proteomic and transcriptomic data sets to solve deep biological problems, especially in the context of metabolic pathwaysAccomplished utility programmer in Perl and/or PythonFluent in Linux ; working knowledge of windowsTeam player balanced with strong individual initiativeNICE TO HAVEIndustry experience highly desirableExposure to microbial fermentation highly desirableExperience in statistical learning highly desirableExperience in a high throughput environment highly desirableFront end development experience a plusRuby/Rails and/or PHP development experience a plusExperience in building analysis pipelinesExperience using / building Genome Scale ModelsExperience in synthetic biologyExperience in Database Design, implementation and Administration in MySQL and PostgreSQLUnix system administration skills and experience This position is open to candidates authorized to work in the United States on a full-time basis for any employer. LanzaTech is an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status."}