{"jobID": "2825001304", "jobLocation": "Detroit_MI", "jobTitle": "Data Analyst II", "companyRating": null, "companyInfo": {"Website": "www.wolverinemail.com", "Headquarters": "Detroit, MI", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Wolverine Solutions Group is looking for high-quality personnel to expand our business and contribute to our full-service document management company, specializing in direct mail production and document management services. We provide customized, cutting edge solutions for document execution, hard copy or electronic, for our clientele in both local and national markets.  We are looking for a Data Analyst for our facility located in Detroit. This position entails loading, manipulating, standardizing, converting and presorting databases provided by clients for maximum postal discounts. Interfaces with production and customer service to ensure time schedules and performs some computer system maintenance. Responsibilities:Create databases, perform merge/purges, conversions, selections and other customer specified instructions.Understand the process of CASS/DPV certification, standardization and presorting presorting.Create, test, and documentation of programs and database programs.Modification, testiing, and documentation of related software programsVerify and check proper weights, rates, sizes and qualifications required by the USPS guidelines.Generate USPS reports, internal reports and customer specific listings.Other duties as assignedRequirements: Documented experience in data list processing and mail list programming Advanced knowledgeable of mailing software such as BCC Mail Manager or Satori Bulk Mailer Intermediate to advanced experience with MS Office Suite Working knowledge of USPS rules, regulations and mail piece design Literacy of data processing procedures, print technologies, and production processes Excellent organizational and communication skills, both written and verbal Strong ability to project manage, set priorities and meet deadlines in a fast-paced environment Strong analytical skills Team player with strong people skills and the ability to adapt to changing situations and deadlines Strong understanding of database concepts such as queries, filtering, and table creation Creative thinking and problem solving skills Wolverine Solutions Group provides Equal Employment Opportunity (EEO) to all applicants without regard to race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, genetic information, marital status, veteran status, height, weight or arrest record in accordance with applicable federal, state and local laws.Job Posted by ApplicantPro"}