{"jobID": "2825440184", "jobLocation": "Cypress_CA", "jobTitle": "Healthcare Provider Network Data Analytics Manager - Medicaid / MediCal - Cypress, CA", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "88000", "jobDescription": " It's a big step forward when you realize that you've earned the trust to lead a team. Now, let's determine just how big that step can be. Take on this managerial role with UnitedHealth Group and you'll be part of a team that's reshaping how provider networks evolve and how health care works better for millions. As a manager within our network contracting team, you'll guide the development and support of Provider Networks as well as unit cost management activities through financial and network pricing modeling, analysis, and reporting. As you do, you'll discover the impact you want and the resources, backing and opportunities that you'd expect from a Fortune 6 leader.  Primary Responsibilities: Manage unit cost budgets, target setting, performance reporting and associated financial models Guide development of geographically competitive, broad access, stable networks that achieve objectives for unit cost performance and trend management Evaluate and negotiate contracts in compliance with company templates, reimbursement structure standards and other key process controls Ensure that network composition includes an appropriate distribution of provider specialties Provide explanations and information to others on difficult issues Coach, provide feedback and guide others Get ready for some significant challenge. This is an intense, fast-paced environment that can be demanding. In addition there are some data challenges and unique problems that need to be solved related to gaps in the process.  Required Qualifications: 4+ years of experience in a network management-related role, such as contracting or provider services In-depth knowledge of Medicare Resource Based Relative Value System (RBRVS) 3+ years of experience in fee schedule development using actuarial models 3+ years of experience using financial models and analysis to negotiate rates with providers Intermediate level of knowledge of claims processing systems and guidelines 3+ years of experience in performing network adequacy analysisPreferred Qualifications: Undergraduate degree Creating and fine tuning provider networks helps improve access to health care for millions. It's an outstanding opportunity to have more meaning and purpose in your career. Join us. Find out how you can start doing your life's best work.SM Careers with UnitedHealthcare. Let's talk about opportunity. Start with a Fortune 6 organization that's serving more than 85 million people already and building the industry's singular reputation for bold ideas and impeccable execution. Now, add your energy, your passion for excellence, your near-obsession with driving change for the better. Get the picture? UnitedHealthcare is serving employers and individuals, states and communities, military families and veterans where ever they're found across the globe. We bring them the resources of an industry leader and a commitment to improve their lives that's second to none. This is no small opportunity. It's where you can do your life's best work. SM Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.  Job Keywords: Healthcare Economics, Network Pricing, Medical Economics, Healthcare Analyst, Financial Analyst, Sales Contracts Analyst, Pricing Consultant, SAS, SQL, Actuarial, Cypress, CA, California  ${description2}  Requisition #: 763438"}