{"jobID": "2788194211", "jobLocation": "Chicago_IL", "jobTitle": "Valuation & Business Analytics Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.bdo.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1910", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "Auto req ID 12504BR Posting Title Valuation & Business Analytics Manager Address 1 330 North Wabash Address 2 Suite 3200 City Chicago State Illinois Zip Code 60611 Job Summary BDO’s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.  The Valuation and Business Analytics Manager is responsible for leading, executing and delivery of challenging valuation engagements by participating in all aspects of projects, from the initial proposal preparation, through project completion. In this role, the Valuation and Analytics Manager is actively engaged in the management of business valuation assignments and managing staff in the development of such assignments. In addition, the Valuation and Business Analytics Manager will be charged with assisting with business development activities and appraisal reviews. Performs related company, industry and economic researchAnalyzes client financial statementsConstructs financial modelsAssesses operational profitability and financial conditionsDevelops and reviews cash flow forecastsPerforms benchmark analysisDocuments and maintains all appropriate aspects of work productComposes narrative reports in support of valuation analysesPrepares necessary exhibits and memos in illustration of complex issuesEnsures quality controls are adhered in association with all work productsParticipates in internal and external client meetingsAssists and provides guidance to peers and staff members in the development of project plans and timelines for deliverablesOther duties as requiredSupervisory Responsibilities:Supervises the day-to-day workload of VBA Senior Associates and Associates on assigned engagements and reviews work productEnsures VBA Senior Associates and Associates are trained on all relevant valuation databases and models.Evaluates the performance of VBA Senior Associates and Associates and assists in the development of goals and objectives to enhance professional developmentDelivers periodic performance feedback and completes performance evaluations for VBA Senior Associates and AssociatesActs as Career Advisor to VBA Senior Associates and Associates, as appropriate Qualifications Education:"}