{"jobID": "2803983392", "jobLocation": "Arlington_TX", "jobTitle": "Data Warehouse Administrator II", "companyRating": "4.0", "companyInfo": {"Website": "www.texashealth.org", "Headquarters": "Arlington, TX", "Size": "10000+ employees", "Founded": " 1997", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Baylor Scott & White Health, UT Southwestern Medical Center, Methodist Health System"}, "estimatedSalary": "81000", "jobDescription": "Qualifications/Duties:Position Summary: Supports the Data Integration teams effort to acquire and integrate new source system data into a data lake as part of THRs extended data warehouse strategy supporting THRs Vision 2026 strategic initiatives. Provides support to data analysts and data scientists in staging and preparing the data to support data mining and analysis to gain insights and rapidly respond to new business opportunities. Administers analytic tools and environment to support data analysis efforts provides hands on application support for data analysts and data scientists as needed. Required Minimum Education: Bachelor's Degree: Computer Science, Engineering, Computer Engineering, or relevant field; or 4 years relevant experience in lieu of a degree. Required Minimum Experience: Two (2) years with a Bachelor's degree - Hands-on experience with these technologies: Microsoft  Integration Platforms, Interface Engine Utilities, SFTP / Scripting.  Or  Six (6) years with no degree - Hands-on experience with these technologies: Microsoft Integration Platforms, Interface Engine Utilities, SFTP / Scripting 6 Essential Functions: New Development Requirements (Doc), Design/ Architecture (Doc/ Rev), Estimates(Doc/ Measurement), Development (Doc/ Standards/ Code Rev),Testing (Plans/Scripts/ Review), Communication/ Collaboration, Issue/Risk Escalation Design, build and deploy high quality, performance, integrated, and documented ETL solutions while following established standards and mentoring others.  Support & Maintenance  Incidents, Requests, Timely (KPI), Escalations, Estimates (Labor), Root Cause Analysis, Triage, Communication (customer/vendor), Production Support/Monitoring, Documentation (Updates/Review), Customer Satisfaction Surveys.  Administration  Upgrades/Patches (Currency/Plan/Impl), User Administration (SLA/Standards), Security (Policy/Standard), Life Cycle Mgmt (Usage), Monitoring (H/W,OS,CPU, Storage, Users, Perform), Events/Scheduling. Oversees the administration of the InfoSphere (and related) environment to ensure that user administration is performed to meet services level agreements and standards.  Process  SDLC (Reviews), Service Mgmt Guidelines, PMO Process, Timekeeping/Status, Peak Process, Training (8 Hours annually) Initiate, perform and participate in reviews required during the software development lifecycle to ensure proper design/development/ implementation of all ETL objects. Follow agreed service management guidelines and mentor/encourage others Follow agreed PMO processes mentor/encourage others Follow established timekeeping requirements mentor/encourage others.  Skills, Growth, Mentoring, Training, Knowledge Mgmt. Continue development of technical skills through training, mentoring, and collaboration. Mentor others to enhance skills, process, and performance. Support knowledge management by maintaining all required documentation within the development and support environments. Maintain/Update documentation needed throughout the InfoSphere environment to ensure compliance with established standards.  Skills & Abilities Communication and presentation skills and a proven ability to work effectively with employees with various levels of technical aptitude while demonstrating a strong understanding of the business problems they are trying to solve.Strong understanding and exposure to variety of database technologies such as Netezza, Oracle, Teredata and/or MS SQL. Exposure and experience with ETL tools such as Data Stage or SSIS. Strong SQL development skills.Experience delivering solutions using agile and/or rapid application development methods.Entity Information: Texas Health Resources is one of the largest faith-based, nonprofit health care delivery systems in the United States and the largest in North Texas in terms of patients served.  Texas Health has 25 acute-care and short-stay hospitals that are owned, operated, joint-ventured or affiliated with the system. It has more than 3,800 licensed beds, more than 21,100 employees of fully-owned/operated facilities plus 1,400 employees of consolidated joint ventures, and counts more than 5,500 physicians with active staff privileges at its hospitals.  At Texas Health, we strive to create an atmosphere of respect, integrity, compassion and excellence for all who come in contact with us, be they patients or our employees. We are committed to diversity in our workforce, and our mission to serve spreads across ethnic, cultural, economic and generational boundaries. We invite you to join us in furthering your career through our accomplishments and philosophy of excellence."}