{"jobID": "2668737632", "jobLocation": "Chicago_IL", "jobTitle": "Junior Quantitative Researcher/Strategy Developer", "companyRating": "5.0", "companyInfo": {"Website": "www.sunrisefutures.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "157000", "jobDescription": " Sunrise Futures is one part technology company, one part trading company. We use a quantitative approach to produce complex and competitive trading strategies. Our algorithmic, black box strategies are deployed in various markets all around the globe. As we continue to expand into new products, markets, and trading strategies; our company seeks highly talented individuals to join our team.  Although we come from different backgrounds, we are all problem solvers. At Sunrise Futures, we strive to maintain a collaborative and productive environment. Hard work is recognized and highly rewarded in our 100% merit-based workplace. We focus on results rather than politics or bureaucracy, creating an environment where our team can thrive, learn, and excel to their maximum potential.  In addition to challenging and rewarding atmosphere, our team enjoys extremely competitive compensation including a performance-based bonus. Other perks include company paid medical and dental insurance, 401k with employer match, game room and social areas to relax, on-site gym facility, free snacks and beverages, as well as daily catered lunches.  If you’re interested in: Working collaboratively with senior quantitative research analysts to develop an understanding of complex financial markets, products, and strategiesAnalyzing financial market data to identify patterns and potential opportunitiesDeveloping forecasts and building predictive and profitable trading modelsEmploying in-house tools to perform strategy exploration and optimizationEvolving trading strategies and methodologies to improve current systems What we’re looking for: Problem solvers who are driven, self-motivated, and \"outside of the box\" thinkersBachelors, Masters, or PhD in a quantitative field ( Mathematics, Statistics, Physics, Engineering, Computer Science)Strong problem solving and math skills and attention to detailProgramming skills and understanding of basic programming concepts. Experience with C/C++Desire and interest in advancing machine learning within the trading industryExcellent written and spoken communication skillsMust be motivated, dependable, and responsible"}