{"jobID": "2812152219", "jobLocation": "Rahway_NJ", "jobTitle": "Preclinical Development Scientist - Preformulation Automation", "companyRating": null, "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Eurofins Lancaster Laboratories PSS is searching for a Preclinical Development Scientist - Preformulation Automation in Rahway, NJ.  Preclinical Development Scientist - Preformulation Automation responsibilities include, but are not limited to, the following :  Responsible for receiving and documenting samples that are submitted for screening assays Tracking the preparation and analysis of thousands of samples submissions per week using automation techniques and current assay guidelines Setup, troubleshooting, and upkeep of automation equipment used for analysis which includes Tecan liquid handling robots and Agilent UPLC's Preparing samples for UPLC analysis using automation tools Data processing and interpretation Calibration, repair and maintenance of laboratory equipment Execution of sample testing and analysis within specified time frames. Routine physical testing of samples to support formulation development Support routine laboratory activities including weekly eye-wash checks, shipping, and chemical inventory.The ideal candidate would possess : Experience in modern liquid chromatography (Agilent UPLC) Experience in preparing and analyzing samples for solubility determination Experience with Microsoft office products, Excel Ability to multi-task and be self motivated Ability to perform duties and responsibilities with minimal supervisionPreferred experience would include : Experience with Excel Macro Programming Experience with XRPD, DSC and other characterization techniques Experience with Tecan Liquid Handling RobotsBasic Minimum Qualifications : A Bachelor's Degree in Chemistry, Pharmaceutical Sciences, other Life Sciences, or equivalent with a minimum of two (2) years of experience, OR a Master's Degree in Chemistry, Pharmaceutical Sciences, other Life Sciences, or equivalent Authorization to work in the United States indefinitely without restriction or sponsorship Position is full-time, Monday-Friday, 8 a.m.-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of Rahway, NJ are encouraged to apply.  As a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.  To learn more about Eurofins, please explore our website www.eurofinsus.com .  Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer. "}