{"jobID": "1945709414", "jobLocation": "San_Diego_CA", "jobTitle": "Computer Vision/Machine Learning Engineers for new AI Team", "companyRating": null, "companyInfo": {"Website": "www.osiengineering.com", "Headquarters": "Campbell, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB DESCRIPTION: Machine Learning Engineers for next-generation Medical Imaging Robotics in San Diego, CA  You will develop a universal Machine Learning engine for Medical Imaging Robots used for Neurosurgery and Ear, Nose & Throat operations (from the neck up).  This will include building revolutionary 3D imaging technologies used to assist Surgeons in life saving surgeries.  You will be part of a new Artificial Intelligence Research and Design Center from the ground-up in San Diego. ResponsibilitiesResearch and develop scalable machine learning solutionsInvestigate and solve exciting and difficult challenges in image recognition/classification, object detection/tracking/recognition, 3D scan and deep learning Must Have Strong understanding of Machine learning algorithms and applicationsExperience in algorithm modifications and optimizations for efficient processingExperience with Caffe, Torch, Tensorflow or OpenCV desiredStrong C/C++ programming skillsMaster's degree in Computer Science or Electrical Engineering Desired PhD in Computer Science or Electrical EngineeringExperience with object detection, tracking and recognition; multiple view geometry, 3D SfM/SLAM; activity recognitionExperience with CNN/deep learning, and their optimizations for efficient implementation on embedded systemsExperience with fixed point conversion, exploiting parallelism, balancing data transfer and computationEmbedded environment experience with DSP and GPUMedical Imaging Background Location: San Diego, CA  Type: Fulltime (relocation assistance is available) CONTACT INFORMATION: Alan Bui 550.2800 x106OSIJOBS"}