{"jobID": "2835297541", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Research Scientist II – Remote Sensing Research Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.mtu.edu", "Headquarters": "Houghton, MI", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Position Information Position Title Research Scientist II – Remote Sensing Research ScientistDepartment Michigan Tech Research Institute (MTRI)Location Michigan Tech Research Institute (Ann Arbor, MI)Position Type StaffFull-time/ Part-time Full-timeFull-Time Equivalent (1.0=100%) 1.0Appointment Term 12 MonthPay Type Salary BasisSalary or Hourly Rate Negotiable. No less than $60,000/year.ShiftPosition Duration Dependent on External Funding? YesTitle of Position Supervisor Senior Research Scientist I Position Summary InformationTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Job Description SummaryThe Research Scientist II – Remote Sensing Research Scientist position provides leadership and support for MTRI programs focused on the development and application of remote sensing and geospatial analysis to solve governmental and societal needs through sponsored research. Knowledge of remote sensing theory, in particular infrared sensing (IR), and application for environmental science and transportation research is required. The applicant will be expected to develop, select, and lead remote sensing research projects that apply their knowledge of IR sensing. The ability to improve the processing and analysis of remote sensing data through custom coding and analysis will be important. Examples of current research areas include wildland and prescribed fire mapping and assessment, Great Lakes aquatic sensing, invasive species mapping, wetlands assessment, transportation infrastructure assessment, wildland fire danger and emissions mapping, cloud-based and distributed computing, user-friendly app development, improved geotemporal visualization of complex data and patterns, extending UAV-enabling sensing, and Arctic landscape change. The position is based at MTRI in Ann Arbor, MI (www.mtri.org).Essential Duties & Responsibilities (other duties may be assigned)1. Develop, plan, lead, and participate in research projects applying remote sensing, geospatial analysis, earth science knowledge, and analysis skills to solve project tasks for ongoing and new MTRI research projects, with the expectation of planning and coordinating research and development tasks in collaboration with other principal investigators. Lead teams and participate as an integral team member on multi-disciplinary research relating to applying technological skills to solving governmental and societal needs for a diverse set of current research areas, including improved remote sensing geotemporal analysis and visualization of complex data for environmental, transportation, and signal processing projects.Construct and populate geospatial databases applicable to a wide variety of sponsor applications, and be able to deal with issues encountered in data processing and analysis to ensure scientifically-valid data collection.Evaluate, select, and apply the results of data collected and research projects undertaken. Describe and share any concerns about the results or methodology, and recommend or implement countermeasures.Contribute technical expertise at a primary and co-author level to specific aspects of conference presentations, journal articles, and technical reports, and be able to take the lead on preparing technical reports. The employee will be expected to exercise independent judgment using their expertise to help define how tasks will be completed, in coordination with project leaders, while being responsible for their own work.Lead and contribute to competitive proposals including development of specific tasks.Assess effectiveness of safety measures and training and implement necessary changes. Anticipate and recognize problems and potential problems at the individual and system levels. Recognize and respond appropriately to potential and actual unsafe situations.Apply safety-related knowledge, skills, and practices to everyday work.Commit to learning about continuous improvement strategies and applying them to everyday work. Encourage continuous improvement practices among employees.Required Education (minimum requirements)PhD in remote sensing, GIS, geospatial technology, geography, computer science, computer engineering, physics, mathematics, earth science, ecology, or closely related field"}