{"jobID": "2829540467", "jobLocation": "Elk_Grove_Village_IL", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "jobs.adp.com", "Headquarters": "Roseland, NJ", "Size": "10000+ employees", "Founded": " 1949", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " ADP is hiring an NPS Analyst. In this position you will be responsible for key business metrics and reporting that drives decision making and process improvement for the Business Unit and NPS Center of Excellence. A champion for standardizing and automating internal client-facing reports provided to Business Units. Be a change agent within the Business Unit's closed loop administration to ensure accurate and high quality data is collected and analyzed on a consistent basis. Leverage a variety of analytical tools to provide information that is flexible, responsive and nimble to changing business needs. The NPS Business Analyst is responsible for Analysis/ Consulting, Configuration/ Integration, Validation/ Support and Project Planning for all aspects of the NPS closed loop process with a focus on predictive Analytics, Reporting and Survey Administration.  At ADP we are driven by your success. We engage your unique talents and perspectives. We welcome your ideas on how to do things differently and better. In your efforts to achieve, learn and grow, we support you all the way. If success motivates you, you belong at ADP.  We strive for every interaction to be driven by our CORE values: Insightful Expertise, Integrity is Everything, Service Excellence, Inspiring Innovation, Each Person Counts, Results-Driven, & Social Responsibility. RESPONSIBILITIES:Analytics/ Consulting/CommunicatingConducts NPS project initiation activitiesAnalyze existing client systems, interface requirements, business process and operational needsProvides professional consulting in the areas of tool customizations, business processes, analytics, complex custom reports and special projectsResponsible for researching benchmarked and attainable validated systemic tools to evaluate HR performance, resulting in metrics that help senior leaders drive Service Excellence.Develop meaningful analytic conclusions and recommends innovative solutionsWork with Business Unit champions and Subject Matter Experts (SMEs) to define requirement related to reporting, analytics, trending and communications.Create business requirements based on detailed analysis of Business Unit needsCoordinates and consults with Corporate IT for customization workDevelops adhoc inquiries to assist in reporting, categorization and analysisProvides demos and training for champions and SMEs, including documentation as required for reporting, analysis, trending and communication.Configuration/ Integration:Works and counsels with business units on system and service configuration tools, tool adaptation and business best practice solutions.Determines best methodology and oversees the accurate and timely conversion of survey data, reporting and analytics.Consults on interfaces to internal and external systemsValidation/Support:Builds survey control information and oversees the pre- and post-implementation testing of tools, processes, reports and alerts.Establish predictive analyticsOversees formal coordination of system and operational services to other ADP business units and departments.Performs testing and support during UAT, works to resolve defects/ issuesSupport the COE (Center of Excellence) and Business Unit during the production release of new tools, reports, alerts and analytics.Provide Tier I/II support for the tools, reports and system supporting the NPS initiative to the business units.Project Planning:Participates in establishing and monitoring of Business Unit implementation schedule and report status to Project Team Members.Ensures issues and risks are documented and work with team members to resolve.Business Unit and Center of Excellence teams will work collaboratively to standardize all aspects of Closed Loop process, analytics, reporting and survey administration with consideration for the unique needs of the individual businesses.Train appropriate uses on analytical tools to ensure widespread adoption of best practices in collecting and analyzing data for actionable recommendations to leaders..Performs other related duties as assigned.QUALIFICATIONS REQUIRED:Bachelor's Degree or Equivalent in Education & Experience with Major Area of Concentration in Finance, Accounting, Statistics3-5 Years of Directly Related Experience in analytics, market intelligence and analytics, financial modeling or statistical analysisLISVCTD#LISERVICE #cb#  PREFERRED QUALIFICATIONS: Preference will be given to candidates who have the following: Bachelor's Degree in Business Administration, Finance, Accounting, Economics, Marketing or Computer Science Executive quality data presentation which clearly and concisely provides visuals of results to allow critical business decisions to be made. Innate ability to display the data differently based on the needs of the audience. audience Broad knowledge of all functions in the regions and SBS products including service procedures, operating systems and support tools. Advanced Microsoft Excel experience including database functions, complex formulas and advanced functionalities. Experience with Access Database and Hyperion/Essbase preferred. Effective written and oral presentation skills are required. Self motivation and ability to work with minimal supervision. Software in the Cloud. Experts on the Ground:ADP powers the working world with comprehensive solutions that drive business success. Consistently named one of the \"Most Admired Companies\" by FORTUNE® Magazine, and recognized by Forbes® as one of \"The World's Most Innovative Companies,\" ADP has over a half-million clients around the globe and 65 years of experience as one of the largest providers of human capital management solutions world-wide.  At ADP, we believe that diversity fuels innovation. ADP is committed to equal employment opportunities regardless of race, color, genetic information, creed, religion, sex, sexual orientation, gender identity, lawful alien status, national origin, age, marital status, non-job related physical or mental disability, or protected veteran status. We support an inclusive workplace where associates excel based on personal merit, qualifications, experience, ability, and job performance. "}