{"jobID": "2755594927", "jobLocation": "Redwood_City_CA", "jobTitle": "Product Marketing Data Operations and Reporting Analyst (Redwood Shores, CA location only no relo provided)", "companyRating": "3.4", "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": "120000", "jobDescription": " Analyzes complex business problems and issues using data from internal and external sources to provide insight to decision-makers.  Identifies and interprets trends and patterns in datasets to locate influences. Constructs forecasts, recommendations and strategic/tactical plans based on business data and market knowledge. Creates specifications for reports and analysis based on business needs or available data elements. May provide consultation to users and lead cross-functional teams to address business issues. May directly produce datasets and reports for analysis using system reporting tools.  Job duties are varied and complex utilizing independent judgment. May have project lead role. 5 years relevant work experience. BS/BA preferred. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.Product Marketing Data Operations and Reporting AnalystLocation: Redwood  Shores, CA (Only available location for role) Key Objectives: The Product Marketing Data  Operations and Reporting Analyst will primarily be  responsible for analyzing and reporting on both sales data as well as content usage  data from a proprietary seller enablement platform. The Analyst should be  comfortable analyzing large, “messy & complex” data sets,  cleaning/organizing the data (data wrangling), and transforming it into  actionable data which the Analyst can present to executives. The Analyst should  be prepared to present directly to senior leadership and field ad hoc analysis  requests in addition to scheduled reporting processes. The data and insights  will be used to drive decisioning across a 400 person Product Marketing (PM) organization  within Oracle’s Cloud Business Group.  Within Product Marketing, the  PM Centers of Excellence (PM-CoEs) team “Delivers  a set of scalable, high value-add marketing shared services at a significantly  reduced cost and with greater consistency.”  This position is part of the Analytics CoE. Primary  Responsibilities:Quickly become an expert on both sales data and content usage data  from proprietary seller enablement platform and find new ways to glean insights  from dataAdvance reporting and analytics with new Business Intelligence  tools and creativityPrepare monthly reports in support of different business units and  be prepared to present results to senior leadershipMaintain and improve dashboards. Train different business units on  dashboard usagePresent key results to senior leadership in ad hoc or scheduled  meetingsRequired  Skills and Experience2 years Marketing/Sales  Ops or other highly analytical roleData Analysis experience  – Excel, Python, BI tools, etc.Experience writing SQL  queriesExperience presenting analysis through PowerPoint to executive  leadershipPossess curiosity and desire to learn new software and programming  languagesEnjoy optimizing and organizing messy data sets and processesPreferred Skills  and ExperiencePython (or other scripting language)Experience using Enterprise analytics / BI tools such as Tableau  and MSFT Power BIOther  ConsiderationsMust be in the Bay Area and willing to commute  to Oracle HQ daily (or willing to relocate within commute distance)Up to 25> travel; possibly internationalWilling to work in the evening and early morning  (from home) to interact with teams in India"}