{"jobID": "2834035422", "jobLocation": "Detroit_MI", "jobTitle": "Departmental Analyst/Trainee 9-P11 - Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.michigan.gov", "Headquarters": "Lansing, MI", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Job DescriptionOPEN TO CURRENT MDOT EMPLOYEES ONLY  As the data analyst, this position will conduct research and data analysis using National Bridge Inventory systems providing a range of professional research and analytical support to Structure Preservation and Management subject matter experts in Bridge Management Systems, Load Rating and Bridge Inspection. Functions include collect and provide bridge asset data to subject matter experts in compliance with National Bridge Inspection Standards (NBIS) and MDOT specifications and quality assurance procedures. Perform quality control reviews of Michigan Bridge Inventory to ensure quality data for asset management. Participate in the NBIS Compliance committee to insure professional data management using the National Bridge Inventory (NBI) data. Prepare reports to meet federal or state audit obligations. Determine the need for developing policy and proposing new statewide initiatives including the review of state and federal requirements as it relates to asset data and reporting of data. Provide training and support to MDOT staff, private and public agencies, and industry leaders for the development of training materials used during presentations. Administer MDOT's statewide Structure Inventory and Appraisal Manual. Create and maintain in office procedural manuals and provide support to their users. Design data queries based on subject matter experts needs and assist in planning, implementing, and evaluating bridge asset data; consolidate data and prepare reports. Train groups of others in the use of MiBridge. Provide inventory data reports for state and federal agencies, as well as for local entities.  Position Description   Required Education and ExperienceEducation for Departmental Analyst 9-P11 Possession of a bachelor's degree in any major. Experience for Departmental Analyst 9-P11Departmental Analyst 9 No specific type or amount is required. Departmental Analyst 10 One year of professional experience. Departmental Analyst P11 Two years of professional experience, including one year of experience equivalent to the intermediate (10) level in state service. Education and Experience for Departmental Analyst (Departmental Trainee) 9 (FOR CLASSIFIED STATE EMPLOYEES ONLY)  Education Educational level typically acquired through completion of high school. ExperienceAdministrative Support Experience Two years of E10- or E11-level experience. OR Four years of advanced or supervisory 9-level, or Senior Executive Management Assistant 9 experience. OR Two years of advanced or supervisory 10-level experience. OR One year of advanced or supervisory 11-level (or higher) experience. Business and Administrative Experience Two years of E9- or E10-level experience. OR One year of advanced or supervisory 10-level (or higher) experience. Human Services Experience Two years of E9- or 10-level paraprofessional* or nursing experience. OR Two years of E10- or E11- or supervisory 10-level experience. OR One year of advanced or supervisory 11-level (or higher) experience. Engineering and Scientific Experience Two years of E10-, E11-level or supervisory 10-level experience. OR One year of advanced or supervisory 11-level (or higher) experience. Safety, Security and Regulatory Experience Two years of E11-level experience. OR Two years of advanced or supervisory 10-level experience. OR One year of advanced or supervisory 11-level (or higher) experience. Paraprofessional classifications are those requiring an associate's degree or two years of college.Educational Substitution College credits may be substituted on a proportional basis (one year of college education may substitute for one quarter of the required experience) for up to one half of the required experience.Additional Requirements and InformationView the job specification at: http://www.michigan.gov/documents/DepartmentalAnalyst_12505_7.pdf  Position is located at 425 West Ottawa Street, Lansing, Michigan.  The department reserves the right to close this posting prior to its original end date once a sufficient number of applications have been received.   Your application for any position does not guarantee that you will be contacted by the Department for further consideration. Only those applicants interviewed will be notified of the results.    "}