{"jobID": "2750354403", "jobLocation": "Murray_Hill_NJ", "jobTitle": "Bell Labs Consulting – Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Are you a person who likes to understand the latest business and technological trends and developments in the ICT industry? Evaluate shifting perspectives and implications for existing and new players? Driven by a passion to shape the vision, strategy and critical transformation decisions of major players in the emerging digital and cognitive economy? If so, Bell Labs Consulting is the place for you.Bell Labs Consulting is an applied R&D; based consulting organization with a mission to guide our customers through the massive network, operations and business transition they must undertake to be industry leaders in the emerging digital and increasingly cognitive economy. Bell Labs Future X Network Architecture defines the vision of end state of these transformations.Our clients include traditional communication service providers, new alternative network providers, private network owners (industry verticals, enterprises, etc.), public sector and regulators around the world. Our work typically includes understanding a customer’s current network, operations, and services, and provide guidance on how to evolve them in line with future demands, business drivers, enabling technologies, emerging standards and industry trends. Customer engagements leverage Bell Labs’ proprietary tools, models, knowledge repositories, multi-disciplinary expertise and innovative problem-solving skills.Main Activities:Apply your deep data science technical skills to support the Bell Labs Consulting organization in IP creation & deliveryCollaborate with BLC team members to advance our capabilities in data science-driven projectsBuild technical capability to enable efficient machine learning on big data setsCreate models and apply algorithms to different use-cases in domains such as customer experience, churn analysis, capex planning, proactive care, etc.Track the current state of technology in data science project execution in the telecommunications industry through standards bodies such as TM Forum and across competitors.Contribute actively to the development and dissemination of BLC intellectual property.Participate in project reviews with the customer, and internally with the project/BLC team.Contribute to the development of whitepapers, presentations and other materials to help grow Bell Labs Consulting’s thought leadershipThe candidate should have experience in developing Machine learning (ML) models such as logistic regression, CART, Random Forest, Gradient Boosting etc., to address solutions to various telecom business problems."}