{"jobID": "2805716441", "jobLocation": "Germantown_MD", "jobTitle": "Senior Scientist (or above), In Vivo ImmunoPharmacology", "companyRating": null, "companyInfo": {"Website": "www.dna.com", "Headquarters": "Germantown, MD", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Public (XON) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description:DUTIES AND RESPONSIBILITIES:Contribute to the design and performance of in vivo experiments.Development of new in vivo models.Demonstrate a high level of independence in performing in vivo experiments, analyzing data, and drawing conclusions regarding experimental progress and results of work.Good communication regarding experiment execution and analysis with supervisor and colleagues.Perform meticulous record keeping and generate scientific reports to support preclinical cancer drug development.Possess excellent time-management skills and manage experiments in several projects concurrently. Manage and supervise workflow of the in vivo group.Supervise research associates and/or scientists.Work with multiple teams to effectively advance research programs efficiently.Demonstrated ability to lead others.Utilization of appropriate technology, i.e. Outlook, PowerPoint, and other programs to create and distribute reports and key information.Coordination of parallel tasks across multiple projects, demonstrating prioritization.Interpret and effectively execute upon a variety of instructions provided in written, oral, diagram or schedule formats.SUPERVISORY RESPONSIBILITIES:1 - 3 Research Associates/ScientistsEDUCATION AND EXPERIENCE:Ph.D. in Immunology, ImmunoPharmacology or related discipline.Seven (7) or more years’ post-doctoral experience, industry experience a plus, working in a dynamic team environment with a solid track record in cancer immunotherapy research and/or development.Demonstrated experience with in vivo oncology models, auto-immune experience a plus.Comprehensive knowledge of in vivo techniques.DESIRED KEY COMPETENCIES:Self-motivated and independently minded.Positive interpersonal skills with the ability to interact with individuals from a variety of levels and function.Self-organizer, meticulous hands-on habits, keen attention to detail.Strong quantitative and analytical skills.Responsive, can-do attitude.Ability to understand and execute on the company’s mission and values.Maintain a high degree of ethical standard and trustworthiness. Capable of fostering change in an organization.Deals with conflict in a direct, positive manner.Ability to think and adapt to a rapidly changing environment and demands.Able to reach rational conclusions through complex processing of information.Fosters innovation through creative solutions.Effective organization and implementation of group projects.Maintain a high degree of accuracy and attention to detail.Energized by accomplishments and excellence in the workplace.Capable of high performance in independent work as well as in team setting. EOE MFDV"}