{"jobID": "2803301136", "jobLocation": "Warren_MI", "jobTitle": "Account Executive", "companyRating": null, "companyInfo": {"Website": "www.upsjobs.com", "Headquarters": "Atlanta, GA", "Size": "10000+ employees", "Founded": " 1907", "Type": " Company - Public (UPS) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Inside Sales Representative based in Greenville,SCAre you looking for an exciting opportunity to begin your career in sales? UPS is seeking a Non-National Inside Sales Representative (ISR), and we want to hear from you! The ISR is an entry-level sales position responsible for retaining and growing UPS’s Small Package business. Primary responsibilities include conducting sales calls to address customer needs, selling additional products and services, and following up on leads.  In addition to building relationships with key decision makers and serving as a customer advocate, the ISR also researches the competitive environment and uses product knowledge to generate solutions that meet the customer’s needs and business objectives. Pre-call duties include using automated sales tools to perform research into customers’ businesses, as well as account information to develop appropriate selling and pricing strategies. The ISR also creates contacts, monitors contractual compliance, and answers customer questions.  This position is located in Greenville, SC, and requires self-relocation to this geographical area. It also requires successful completion of the UPS Sales Academy, which is a six-week training program located on-site at the UPS Inside Sales facility in Greenville, SC. Responsibilities and DutiesResponds to and resolves customer inquiries, complaints, and issuesCoordinates opportunities and strategies with other team membersMaintains knowledge of UPS products and services to develop appropriate sales solutionsReviews customer shipping practices to ensure contractual complianceDetermines customer discounts and writes new contractsEducates customers on UPS’s service channels to expedite problem resolutionProvides compelling value proposals to potential and existing customersKnowledge and SkillsAnalyzes and evaluates financial data and trends to determine impact on customer and company objectivesUnderstands customer business models, operating structures, and strategic objectives, and offers logistic sales solutionsSolicits information from customers through a variety of questioning and probing techniquesUnderstands features and business applications of products, services, and customer-facing technology offerings, and solutionsAssesses, identifies, measures, and monitors customer’s business needs, and aligns account strategies to maximize profitability and meet strategic goalsConducts competitive analysis of competitor’s offerings and strategies, and maintains awareness of competitive environmentCreates and develops effective strategies to manage accountsExperience using Microsoft Office products or equivalent softwareMust have Bachelor's Degree or internationally comparable degree prior to start date (students graduating within current school year may apply)UPS and/or business-to-business or business-to-consumer sales experience – PreferredFluent in more than one language – Preferred UPS is an equal opportunity employer – race/color/religion/sex/national origin/veteran/disability/sexual orientation/gender identity"}