{"jobID": "2830795358", "jobLocation": "Kalamazoo_MI", "jobTitle": "Master Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.stryker.com", "Headquarters": "Portage, MI", "Size": "10000+ employees", "Founded": " 1941", "Type": " Company - Public (SYK) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Johnson & Johnson, Smith & Nephew"}, "estimatedSalary": null, "jobDescription": "Job Description The Master Data Analyst is responsible for executing a structured approach to the collection, creation, and maintenance of master data. They will be a SAP Power User in the Master Data Governance (MDG) application and will drive data governance, data ownership and data quality assurance. Select responsibilities include: Approve Material Data Requests.Review and approve change requests to ensure accurate data entry of item master data attributes.Manage data requests in support of business processes.Drive excellence and ensure continuous improvement in quality of data through cleansing and data construction.Ensure Material Master Data Quality.Monitor and improve data quality through cleansing and data construction.Define KPIs related to material master data management and drive a system of actions to complete requests in accordance with SLA's.Provide input to the development of MDM data collection templates.Work with the Data Governance Office to enforce global policies, standards, and processes.Assist in the development and deployment of SAP training including knowledge layer documents and work instructions.Manage relationships with data steward resources within other teams to ensure clear understanding of organizational requirements that are then managed in concert with MDM.Develop and maintain relationships with business and IS resources to improve data management processes.Support implementation of MDM vision and strategies for their domain.Serve as a business contact for material master related topics while identifying solutions to business challenges.Identify opportunities to gain efficiencies, automate, and improve data quality.Partner with cross functional stakeholders to support business needs for master data.Lead/participate in MDM projects as assigned.Partner with other SAP power users across global community to identify and resolve data gaps and issues with SAP functionality through hands on testing.May include Merger&Acquisition; and/or Global Program supportMinimum Education, Experience&Qualifications;:Bachelor's degree required.SAP experience preferred.Demonstrated expertise with common software platforms required.Physical&Mental; Requirements:Excellent analytical and organizational skills.Strong interpersonal communications skills.Must be able to review printed materials.Ability to use common office equipment (e.g. calculator, PC, fax machine, etc.).Must be able to routinely make decisions that may affect immediate operations and have a company-wide effect.Must be able to analyze and resolve non?routine information systems issues using independent judgment.Must be able to observe and correct minute inconsistencies (e.g. in the printed word, product or component appearance, etc.). Work From Home: No  Travel Percentage: None  Stryker Corporation is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, gender identity, sexual orientation, national origin, disability, or protected veteran status. Stryker is an EO employer M/F/Veteran/Disability.  Stryker Corporation will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information."}