{"jobID": "2698352349", "jobLocation": "Mountain_View_CA", "jobTitle": "Associate Scientist - Data Collection", "companyRating": null, "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " 23andMe is seeking an associate scientist to help develop our survey research portfolio.  This person will help to maintain high-quality data collection by conducting literature reviews, identifying validated research instruments, developing novel data collection tools, and coding these tools for web-based deployment. Accordingly, this individual must possess a strong grasp of research methods, be able to evaluate and synthesize the scientific literature, and be able to work in cross-functional teams. Facility with coding and software release processes is a plus. This is an exciting opportunity to learn about the personal genomics industry while contributing to ground-breaking genetics research. Who we are The 23andMe Research and Therapeutics teams work together to turn large amounts of genetic and phenotypic data into discoveries that improve health. In addition to the genetic data generated for each participant as a customer, we also collect data about their medical history, traits, and behaviors, mostly through online surveys. The phenotype data are collected from the cohort as a whole, and as part of more targeted studies. What you'll doCarry out comprehensive literature reviews on a wide range of topicsIdentify validated survey research instrumentsDevelop new phenotypic data collection toolsCode research study materials for web-based deploymentCarry out rigorous manual testing of our web-based research productWhat you'll bringMasters in Public Health, Epidemiology, Biostatistics, Social Science, or relatedStrong computing skillsDemonstrated ability to communicate successfullyAbout Us 23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.  At 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.  Please note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}