{"jobID": "2815128026", "jobLocation": "Vienna_VA", "jobTitle": "Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.paysafe.com", "Headquarters": "Douglas, Man, Isle of", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " First Data, PayPal, Western Union"}, "estimatedSalary": "96000", "jobDescription": " Paysafe is a leading global provider of end-to-end payment solutions. Our core purpose is to enable businesses and consumers to connect and transact seamlessly through our industry-leading capabilities in payment processing, digital wallets and online cash solutions. paysafecard is part of Paysafe Group and global market leader in online prepaid payment methods. Based in Vienna, the company is internationally active and present in 46 countries around the world. Your Key Responsibilities:Shape how we apply machine learning in operational processes to improve efficiency and customer satisfactionWorking with different business roles to identify opportunities to apply machine learningData cleansing, transformation and analysisBuilding, evaluating and training machine learning modelsCommunicating your findings (e.g. visualization) and explaining how techniques work to non-technical colleaguesYour Qualification:Bachelor's or Master's Degree in mathematics, computer science, quantitative social science or similarMin. 1-3 years professional experience in building, evaluating and training machine learning models, ideally within the payments industryWorking knowledge in R or Python as well as knowledge in SQL and other tools to extract and transform dataFamiliarity with supervised and unsupervised machine learningWorking knowledge of some visualization tools (e.g. Tableau, Power BI, ggplot2)Experience with Microsoft Azure Machine Learning Studio is advantageousGood communication skills to collaborate with technical and non-technical rolesFull working proficiency in English; German is a plusHands-on mentality and international mindsetThinking outside the box and ability to see the underlying \"big picture\" intuitivelyOur Offer:Interesting challenges within an international environmentOpen and great working atmosphere, where successes are celebrated togetherFlexi-time, mobile working and other great company benefitsInternational development and career opportunitiesAn annual gross salary starting from 50.000,- with a view to increase based on the qualification and experience We look forward to your application!  Please find further information on www.paysafe.com, www.payolution.comSDL2017"}