{"jobID": "2786994951", "jobLocation": "Kerrville_TX", "jobTitle": "Data / Business Solutions Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Hill Country Mental Health and Developmental Disabilities CentersJob Title: Data / Business Solutions Analyst Job Summary:  Mission: ?Promoting Independence, Community Integration, and Recovery.?  Under the direction of the 1115 Waiver DSRIP Director, the Data/Business Solutions Analyst applies an intermediate level of both technical and business knowledge to provide answers or recommend solutions to business data problems which influence business strategy or decisions. Define data requirements, gather and validate information, applying judgment and statistical tests. Develop complex data structures to support the generation of business insights and strategy. Serves as an escalation point for the data team, make recommendations on improvements and efficiencies and effectively works with internal departments to identify opportunities to achieve outcome measure success with available data. Identify opportunities to use data to develop new strategies and improve business performance and utilize knowledge of mathematical modeling and other optimization methods to perform quantitative and qualitative data analysis. Leverages an understanding of multiple data structures and sources (possesses an advanced knowledge of multiple data stores) to perform complex data manipulation using advanced data extraction and analytical tools and techniques. Displays an understanding of the connection between business operations and analytics to support business strategies and solutions. Collaborates with IT/IS to facilitate the implementation of technical data solutions and standards. The position of Data/Business Solutions Analyst is responsible for analysis, data validation and user acceptance of data and solutions with the goal of discovering useful information, suggesting conclusions, and supporting decision making. Communicate and present data to management by developing reports. This position must clearly demonstrate the ability to manage multiple projects with different and competent priorities and timeline demands. Essential Job Functions:Responsible for analysis, data validation, outcome measurement, and user acceptance of data and solutions with the goal of discovering useful information, suggesting conclusions, and supporting decision makingWrites technical and procedural documentationThis position analyzes business processes to identify opportunities and develop strategies for improving productivity and achieving organizational objectivesBuilds recommendations by synthesizing data from multiple sources, developing assumptions where needed, to drive business insights and strategy developmentAbility to tell stories with the data, communicate effectively and instill confidence in recommendations to motivate managers to take actionCommunicate and present data to management by developing reportsOutstanding communication skills with both technical and non-technical colleaguesAnalyze data analysis requests obtained from management to conceptualize and define operational problems and define data modeling requirements, validation of content, and problem-solving parameters.Manage multiple projects with different and competent priorities and timeline demandsDeveloping training documentation and demonstration content of enhanced functions (for existing user base and for new internal partners)Identify and acquire data required to answer the business questionManages problem resolution across systems, processes or channels; and navigates obstacles to deliver the work productPerforms data governance, integrity, quality and audit functionsDisplays an understanding of the connection between business operations and analytics to support business strategies and solutionsDevelop and participate in Continuous Quality Improvement activitiesDevelop & maintain reports for internal & external clientsInput data into online reporting databasesMaintain & enhance existing reporting toolsData extraction & integration, creating stored procedures, ad hoc queries, SQL scripting & moreCreate and generate reports through MS-Excel, MS-Access, and SQL using Business Objects interface and direct links to core databases (Anasazi)Gather and interpret business requirements and monitor data trends to proactively identify issuesUnderstand and interpret outcome measures to specification (HEDIS, CMS, NCQA, HHSC)This position attends work on a regular and predictable schedule in accordance with Hill Country Mental Health and Developmental Disabilities Center (HCMHDDC) leave policyAdheres to all HCMHDDC agency policiesPerforms other duties as assignedAcademic / Work Experience Requirements:High School Diploma or GEDBachelor's degree in Economics, Finance, Engineering, Mathematics, Management Information Systems, Science, Computer Science, Statistics, Information Technology or a related quantitative analytical field OR or 6 years of experience in an analytical or technical support function requiredMaster's Degree in Economics, Finance, Engineering, Mathematics, Management Information Systems, Science, Business Administration, Computer Science, Statistics, Information Technology or a related quantitative analytical field - PREFERRED"}