{"jobID": "2740418920", "jobLocation": "Washington_DC", "jobTitle": "Public Health Security Surveillance Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.cadmusgroup.com", "Headquarters": "Waltham, MA", "Size": "501 to 1000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": " At Cadmus, our Homeland Security Sector provides clients with pragmatic solutions to their most important analytical and policy challenges. We bring together teams of outstanding professionals who have earned a reputation of responsive and client-focused support for a wide range of homeland security and emergency preparedness agencies at all levels of government. Our client-oriented approach, coupled with our profound and relevant subject-matter expertise, enables us to bring an incisive edge to solving the most critical homeland security problems.  Cadmus seeks qualified candidates to aid in the development of systems for public health surveillance. Successful candidates will have at least 3 years of experience in a scientific field, with 2 years providing expert support for the development of systems for public health monitoring, identifying and using novel data sources, or conducting risk analysis. Candidates must have a Bachelor’s degree from an accredited institution. The ideal candidate will have experience working in a professional services firm and/or a government agency with public health responsibilities. Please note:This position will be located at a client site and qualified applicants must be able to pass a DHS Suitability checkValid in scope DoD Secret Clearance is plusContribute to the development of public health monitoring systemsOversee delivery by external partners by establishing timelines, budgets, and milestonesProvide subject-matter expertise on data analytics and data visualizationWork with external partners on topics related to data sharingRepresent client on interagency development teamsBachelor’s degree from an accredited institution in a scientific, engineering, medical, veterinary, or public health fieldAt least 3 years of experience, or a Master’s Degree and 2 years of specialized experience providing scientific or technical support to major programs or system development efforts related to biosurveillance, epidemiology, or microbiologyExcellent analytical, communications, and presentation skillsProficiency in relevant software programs including Microsoft Word, PowerPoint, and Excel. Familiarity with R and/or GIS preferredCommand of the English language in both written and spoken formatAs a representative of Cadmus, possess the ability to demonstrate professionalism and sound judgment in interactions with clients and colleaguesCandidates selected may be subject to a security investigation and, if required, should be able to meet eligibility requirements for access to classified informationExperience working with a professional services consulting firm, DHS, Public Health, and/or the Federal Government is highly preferredTo Apply: Candidates should submit a resume, a cover letter explaining interest and relevant qualifications, and a 2-3 page writing sample that demonstrates the ability to synthesize large amounts of information (on any topic) into a concise actionable summary.  Cadmus is an equal opportunity employer and gives consideration for employment to qualified applicants without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other legally protected group status.  To learn more about Cadmus, visit our website www.cadmusgroup.com"}