{"jobID": "2828396989", "jobLocation": "Arlington_VA", "jobTitle": "Data/RF Scientist/Engineer", "companyRating": null, "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": null, "jobDescription": "Job Number: R0029195 Data/RF Scientist/EngineerThe Challenge: Are you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.  We have an opportunity for you to use your leadership and analytical skills to improve the defense and intelligence industry. Youll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. Youll mentor teammates, develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help military leaders make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. As a technical leader, youll identify new opportunities to use data science solutions to help your customers meet their toughest challenges. Join us as we use data science for good in the defense and intelligence space.  Empower change with us. Build Your Career: At Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect: access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunka chance to change the world with the Data Science Bowlthe worlds premier data science for social good competitionparticipation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government Youll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want, as you chart your own course for success. You Have: -Experience with deep learning frameworks, algorithm development, system modeling, statistical analysis, and ML  -Experience with machine learning tools, algorithms, and techniques for RF signal data collection and other related data  -Experience with creating data collection, simulations, and models for machine learning data sets  -Experience with developing data visualization, demonstrations, and presentations for team members and stakeholders  -Ability to perform research and conduct tests covering theoretical applications of ML in EW products  -Ability to complete system integration lab integration through field test events and customer demonstrations  -Ability to collaborate with systems engineers, RF engineers, computer engineers, and test engineers to define system capabilities, data collection needs, and functionality for future EW systems  -Secret clearance  -BA or BS degree Nice If You Have: -Experience with electronic warfare, radar, signal processing algorithms, cellular technologies, and related technologies  -Knowledge of computational electromagnetics solution methods, including MoM, PO or GO, UTD or GTD, and FDTD  -Ability to program in and use C++, Python, R-Sequel, MATLAB, TensorFlowetc, Theano, DIGITS, Cuda, NVIDIA, or Amazon Analytic  -Ability to apply high speed CPU- or GPU-based data acquisition systems to collect and analyze specialized engineering and technical data  -Possession of excellent oral and written communication skills  -Possession of excellent presentation skills Clearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.#LI-AH1, CJ1, DH1, NMC "}