{"jobID": "2737969622", "jobLocation": "San_Diego_CA", "jobTitle": "Senior DevOps Engineer-Data Warehouse", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "105000", "jobDescription": "PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.Senior engineering role in SIEs Data Platform Operations team supporting our current and next generation ETL Big Data Warehouse platform to deliver best-in-class scalable, highly available operational warehouse platform to enable our customers and rapidly growing business. Seeking in-depth, hands-on experience with data warehouse technologies such as Informatica/Talend, Control-M, Composite, and QlikView.Responsibilities:Administration and management of ETL tools such as Informatica, Talend, Control-M.Administration and management of Data Virtualization tools such as Composite.Administration and management of data visualization tools such as QlikView.Coordinate with the Systems Engineering team to plan and execute system upgrades of existing warehouse application tools.Closely work with big data modelers and scientists.Work with developers and architects to advise on standards and best practices.Create and maintain technical documentation.Actively work with offshore team.Participate in a 24x7 on-call support rotation and off-hours maintenance windows. Troubleshooting ETL jobs and follow notification and escalation procedures to resolve the issue.Collaborate and work with development team on L3 issues and follow the task to completion and make our customers successful.Deploy Change requests in PRE-PRODUCTION & PRODUCTION environments as per the organization policies and guidelines.Required Experience & Qualifications:7+ years of working experience in operations teams supporting mission critical environments (365x24x7).5+ years professional experience as an administrator with Data Warehouse technologies, relational and non-relation data store solutions such as Hadoop, MySQL, Cassandra, RDS or NoSQL databases and associated practices.Advanced knowledge in troubleshooting and tuning ETL workflows.Strong query and development experience in PL/SQL and NoSQL.Must have experience troubleshooting difficult production issues (networking problems, intermittent failures, across the entire warehouse application stack).Good understanding of cloud technologies such as AWS, Google Cloud, Azure or Rackspace cloud services.Must possess outstanding verbal and written communication skills, and be able to work with others at all levels; effective at working with geographically remote and culturally diverse teams.Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category. We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond. We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.#LI-GM1"}