{"jobID": "2832780162", "jobLocation": "Dallas_TX", "jobTitle": "Senior Associate, Advanced Analytics Consultant", "companyRating": "3.8", "companyInfo": {"Website": "us-jobs.kpmg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1987", "Type": " Subsidiary or Business Segment", "Industry": " Accounting & Legal", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " PwC, Deloitte, EY"}, "estimatedSalary": "99000", "jobDescription": " Innovate. Collaborate. Shine. Lighthouse KPMG's Center of Excellence for Advanced Analytics has both applied data science, AI, and big data architecture capabilities. Here, you'll work with a diverse team of sophisticated data and analytics professionals to explore the solutions for clients in a platform-diverse environment. This means your ability to find answers is limited only by your creativity in leveraging a vast array of techniques and tools. Be a part of a high-energy, diverse, fast-paced, and innovative culture that delivers with the agility of a tech startup and the backing of a leading global consulting firm. For you, that translates into the chance to work on a wide range of projects covering technologies and solutions from AI to optimization and the power to have a real impact in the business world. So, bring your creativity and pioneering spirit to KPMG Lighthouse.  KPMG is currently seeking a Senior Associate Data&Analytics; Strategy Consultant to join our KPMG Lighthouse - Center of Excellence for Advanced Analytics. Responsibilities:Bring strong sector- and/or business-process-specific knowledge to bear for D&A; strategy, transformation, or solution design engagements; focused on helping clients understand the broader D&A; journey and implications, and helping engagement teams understand domain context required for delivering meaningful and effective insights from D&A; solutions; Gather client and market information through interviews, surveys, workshops, and market research; realize requirements, styles and preferences for visualizations within sectors of expertise; managers in this role may have some opportunity to assist in the overseeing the design, management, execution, and implementation of complex analytics models.Assess, capture and translate complex business needs and existing organization D&A; maturity levels into a structured strategy for D&A; capability development, including role and process design, analytics use case ideation and technology roadmapping with the ability to explain data&analytics; concepts to non-technical team membersProactively broaden and deepen client relationships by working with varying levels of client team members and utilize a hypothesis-driven, problem-solving approach to design and review with clients all aspects of an organization-specific D&A; target operating modelResearch and communicate sector or process-specific data and D&A; solution design requirements, including building such design requirements into targeted visualizationsApply data&analytics; concepts to business problems with an understanding of how applying these concepts can provide business value; design, host and debrief a variety of information gathering exercises as part of D&A; strategy and transformation readiness evaluations; for example, collaborative workshops and ideation sessions, 1:1 leadership interviews, survey design and execution and external market researchSupport project leaders in tracking and communicating project risks, budget, rates and launch/closeout activities; including the administration of work papers and collaboration sites (shared with D&A; Modelers and D&A; Engineers); manage/mentor KPMG resources to drive engagments to successful closureQualifications:A minimum of three years of data analytics experience with a professional services firm, an internal strategy/analytics group, or similar environment with previous experience in strategy and/or analytics consulting highly regardedBachelor's degree in a technical or quantitative field from an accredited college or university (master's or MBA degree preferred) with knowledge of topics such as statistics, econometrics, machine learning, operations research, decision science, and cloud computingDemonstrated analytics solution design and build expertise, project management skills, strong business consulting acumen in applying advanced analytics to solve business issues, and knowledge of business operational, process, delivery, and revenue modelsDemonstrated ability to manage engagements and interface with senior level management internally as well as with clients and significant project management, client handling, and executive communication capabilities (e.g., interviews, workshop management, business writing)Sector- and/or process-specific experience in D&A; strategy and transformation, as well as exposure to design and implementation needs with a good understanding of general landscape for data science and big data opportunities; deeper understanding of sector- and/or process-specific landscape for opportunitiesOrganization design, transformation design/execution expertise, workstream management skills, and strong business consulting acumen with significant project management, client handling, and executive communication capabilities (e.g., interviews, workshop management, business writing)Ability to travel up to eighty percent of the time. Must be legally authorized to work in the US without sponsorship of a Visa KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service, genetic information, personal appearance, family responsibility, matriculation or political affiliation, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please."}