{"jobID": "2836942582", "jobLocation": "Arlington_TX", "jobTitle": "Web Content Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.alleareconsulting.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Web Content Data Analyst  6 Month+ Consulting Engagement  Location: Addison, Texas  We have an IMMEDIATE job opening to join our team and work as a Web Content Data Analyst on-site at our client’s global HQ’s in Addison, TX. This Web Content Data Analyst will be responsible for editing and publishing web-optimized content using our client’s industry leading Content Management system. This position manages multiple types of content: text, imagery, video, SEO, etc. This position is responsible for the publication of new and modified images as well as reviewing, editing and quality assurance of content culled from multiple sources. The successful candidate will have a good understanding of HTML & CSS.  Initially, the focus of this role will be primarily data driven and will be working in a new digital asset management system. The role will deal heavily with metadata and be responsible for searching the DAMS (digital asset management system) also called a “library” and locating assets, then applying metadata and moving assets to the archives. Each asset will be an image or photo and this individual will review the photo and pick the appropriate metadata from a drop-down box to tag the image.  After the initial data driven project is complete, this individual will assist the team in migrating the content to a brand-new Enterprise CMS (content management system).  Required Skills:  o 1-2 years of working on a Web or Enterprise Content Management System  o 1-2 years of HTML, CSS and code structure (as it relates to SEO) experience  o Experience working with images and metadata  o Social medial tools and applications experience - preferred  o Experience with basic keyword research and search engine tools.  o Proficient writing, editing and proofreading skills.  o Excellent organizational skills and a keen attention to detail.  o Flexibility to adapt to change.  o Proficient with MS applications (Word, Excel, PowerPoint, Outlook).  o 4-year college degree (BS/BA) in English, Journalism, Communications, Interactive Media, Business/Marketing -or- an Associate Degree (from an accredited university)  **To view all of our open positions, please visit: http://www.alleareconsulting.com/job-openings"}