{"jobID": "2836008329", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Analyst/Engineer", "companyRating": null, "companyInfo": {"Website": "www.artech.com", "Headquarters": "Morristown, NJ", "Size": "5001 to 10000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DESCRIPTION: Artech is currently seeking to add to the below position Job Title: Data Analyst/Engineer  Job ID: 8260694  Location: 620 E Grand Ave., SSF45, South San Francisco, CA 94080  Duration: 6+ Months contract We are seeking a Technical Project Lead to manage data engineering projects within our Information Management Office. Among other information management core services, our group is responsible for the management of a data analytics platform. The Technical Project Lead would be responsible for the delivery of platform technologies as well as managing the development of data pipelines to support advanced analytics and trial insights. The platform is currently built on AWS and consists of a discovery sandbox (data lake) as well as an integrated data warehouse incorporating data quality management tools and processes. Responsibilities:Provide input into product roadmap development and work with product manager to ensure service deliveryProvide strategic input into the design and governance of the data lakeDevelop data acquisition roadmaps and data pipelines to move data from discovery to productionConsult on continuous platform evolution and architecture design in collaboration with our IT partners and stakeholdersAct as both Technical Project Manager as well as a hands-on technology lead over seeing all delivery activitiesProvide project direction and hands on support to a team of data architects, data engineers/data curatorsLead scrum teams in an agile processStrong analytical, planning, and organizational skills with an ability to manage competing demandsContinuously assess, mentor and develop talent of implementation teamsQualifications:5+ years of software development experience working on infrastructure and data environments2+ years of experience providing hands on technical leadershipExtensive experience building highly functional data pipelines using web services and ETLExtensive experience working in and optimizing cloud environments (currently in use for this platform: AWS S3, Redshift, EC2 GPU, SPARK / EMR)Languages required: Advanced SQL, Proficient / Advanced in Python; Java also preferredUnix and Linux experienceExperience developing and using web servicesPreferred experience using industry standards (HL7 FHIR, SNOMED, CDISC SDTM & ADaM)Applied Agile project management practices and use of tools such as JIRA Please apply on our company website (www.artechinfo.com) with reference to job ID, or contact me at Pradeep.V@artechinfo.com / 973.507.7539  Pradeep  Team Lead – Staffing  Artech Information Systems LLC  360 Mt. Kemble Avenue, Suite 2000 | Morristown, NJ 07960  Office: 973.507.7539 | Fax: 973.998.2599  Email: Pradeep.V@artechinfo.com | Website: www.artechinfo.com About Artech Information Systems LLC Artech is an employer-of-choice for the last 25 years to over 7,500 consultants across the globe. We recruit top-notch talent for over 70 Fortune and Government clients coast-to-coast across the U.S., India, and China. We are #1 Largest Woman-Owned IT Staffing Firm in the US and this may be your opportunity to join us! For more check: www.artechinfo.com Connect with Artech through Social Media Learn more about our company including the latest events at Artech, new job opportunities, jobseeker tips, and more. Follow us on Facebook, Twitter, LinkedIn, Google+, and YouTube "}