{"jobID": "2775758535", "jobLocation": "South_Plainfield_NJ", "jobTitle": "Associate Scientist II, Synthesis", "companyRating": null, "companyInfo": {"Website": "www.genewiz.com", "Headquarters": "South Plainfield, NJ", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Want to be part of a company whose goal is to be the best in the world and the best for the world?  Apply today!  GENEWIZ is seeking an Associate Scientist II to join our Synthesis laboratory.  Title: Associate Scientist II  Location: South Plainfield, NJ Responsibilities:Carry out gene synthesis, DNA sequencing, oligo synthesis and DNA cloning projectsRelated tasks include but are not limited to: PCR amplification, sequencing data analysis, DNA transformation, and restriction digest analysisAssist with troubleshooting effortsFollow SOPs and guidance of supervisorsOversee the daily work and collaborate with GENEWIZ China traineesAdditional tasks and responsibilities as assigned by supervisorQualifications:Bachelor’s degree in Life Sciences is required2+ years of previous lab experience is requiredBilingual in Mandarin Chinese requiredKnowledge of Molecular Biology techniquesExcellent interpersonal skills; both verbal and written are essentialClosely follow Standard Operating Protocol (SOP) GENEWIZ is a leading global genomics service company and trusted provider for DNA sequencing, gene synthesis, molecular biology, next generation sequencing, bioinformatics, and GLP regulatory services.  From the company’s founding, GENEWIZ has maintained its unwavering commitment to providing customers with the best value. Excelling in both science and customer support, GENEWIZ is dedicated to accelerating scientific discovery, as well as to developing and delivering innovative solutions for translational medicine and healthcare. Easily accessible around the world, GENEWIZ is the preferred partner at leading academic, pharmaceutical, biotechnology, agricultural, government, and clinical institutions.  GENEWIZ employees have a winning attitude and champion innovation, teamwork and accountability through a results-oriented, customer-centric, and fun culture. We offer various health and financial benefits, learning opportunities, competitive compensation, rewarding bonus programs, and a wide range of work/life benefits designed to make your life easier.  Visit our Careers page at www.genewiz.com/careers to view our open positions and apply.  Connect with us on LinkedIn and Twitter @GENEWIZ"}