{"jobID": "2830636995", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Lending Assistant, Technology and Life Sciences- San Francisco or Palo Alto, CA", "companyRating": null, "companyInfo": {"Website": "www.comerica.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1849", "Type": " Company - Public (CMA) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Regions Financial, BBVA Compass, Zions Bank"}, "estimatedSalary": null, "jobDescription": " Senior Lending Assistant  The Senior Lending Assistant will assist assigned lending department and officers in administering routine operational aspects of assigned lending relationships, facilitating servicing of customers and sales support for the team.  Position Competencies  Successful incumbents possess customer service skills, ability to communicate by phone and via e-mail and other written correspondence, and problem-solving skills. Position Responsibilities: 1) Act as focal point between customers, relationship managers, portfolio managers and loan closers as appropriate to facilitate loan servicing and coordinate resolution of issues. Provide customers with information for routine to highly complex inquiries.  2) Assist in servicing financial and banking needs of lending and deposit customers. This may include: Contacts or prepares correspondence to relationship and portfolio managers and customers, as appropriate.Assists officers and customers in preparing various forms, applications, presentations, etc.Facilitates opening, closing and modifying of accounts, including DDAs at the Banking Centers.Provides customers with support for interest rate elections and investment option information when requested. Includes accessing and maintaining daily listings of available options, rates, etc. Facilitating the request when received, acting in accordance with established policies, procedures and authorizations and verifying that the request was correctly completed.Researches and coordinates the resolution of complex issues related to overdrafts, returned items, lockbox, CRP questions, stop payments and late deposits. 3) Assist with loan maintenance and monitoring. This may include: Monitors delinquencies and exceptions.Monitors and coordinates with Relationship Managers and Portfolio Managers as applicable to ensure various reports are received, reviewed and processed. 4) Provides administrative support to the RMs and PMs by: Handles most complex administrative support; conducts customer research for officer calls, preparing/ maintaining/distributing portfolio lists, reports, mailing lists, presentation materials, scheduling appointments and making travel arrangements.Performs additional duties such as mail, ordering supplies, correspondence, special projects and other miscellaneous tasks.Provides training to lower level Lending Assistants in procedures and processes. 5) Assist in Portfolio Reporting activities by entering and/or retrieving information from various data collection sites. Assist with administrative or compliance reporting such as FDICIA, Leveraged Lending report, etc.  Travel  No Travel is required for this position.  Relocation  Relocation assistance is not available. High school diploma or the equivalent (GED)3 years of experience in a financial services customer service environment that includes working with loan products2 years of experience utilizing Microsoft Office Products including Word, Excel and Power Point Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}