{"jobID": "2815555682", "jobLocation": "Detroit_MI", "jobTitle": "Applications Analyst - Business Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.glwater.org", "Headquarters": "Detroit, MI", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Nonprofit Organization", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " We are looking for an Applications Analyst - Business Analyst will enable change by eliciting and documenting needs and recommending technology solutions that deliver value to stakeholders. This role is primarily responsible for working with stakeholders to define and document business problems, processes and requirements to deliver on a solution. The Business Analyst reports to the IT Manager – PMO, working to support IT projects throughout their lifecycle by creating business cases; writing business and functional requirements; writing user acceptance test (UAT) plans, cases, and scripts; and related documentation.  You will work on the PMO Team and focus on gathering detailed business requirements to support the business cases for projects. The Application Analyst - Business Analyst will meet operational and project objectives through effective self-management and a “can-do” approach. The individual filling this role should demonstrate a high aptitude in key competencies including technical aptitude, organization, interpersonal relationships, process management and improvement, written and verbal communication, and creativity. These skills are critical, because this role is highly collaborative and will work with various subject matter experts (SMEs), management, and executive stakeholders from across all functional areas to solve problems and recommend solutions. Responsibilities (not all inclusive)  Work under the guidance of the project manager, and in collaboration with the appropriate IT manager, to lead project teams to successfully complete projects. Support the project manager in a leadership role on the project team Work with business and technical subject matter experts to create business cases and business requirements. Work with project stakeholders to elicit and write functional requirements. Work with project stakeholder and end-users to write UAT plans, cases, and scripts, facilitate UAT sessions, and record UAT results. Conduct requirements elicitation meetings. Conduct gap analyses. Diagram current and future states of systems and processes. Understand and translate the needs of varied users into IT system requirements Use business analysis techniques, such as brainstorming, focus groups, document analysis, interface analysis, interviews, workshops, reverse engineering, process mapping, and job shadowing. Facilitate requirements elicitation sessionsRequired Education & Experience Bachelor’s Degree in Computer Science, Information Technology or related field Three (3) or more years of related work experience; or combination of related work experience and education Level 1 designation At least one (1) year experience or a domain specific entry level certificate; or combination of related work experience and education Required knowledge, skills and abilities Knowledge of:  Operating systems (Windows, Linux) System development lifecycle and project management methodologies Reporting tools Principles and practices of the functions performed by information technology departments/teams Hardware, software, application, database, and network environments commonly used in business environments. Principles and techniques of systems analysis A variety of technologies, such as HR systems, ERP systems, web technologies, and relational databases User interface design best practices COBIT and ITIL Principles and techniques of application development Skill to:  Resolve technology issues verbally and in writing for end-users with varying computing skills. Deliver quality written and oral presentations, including the ability to make technology understandable to end-users Understand and translate the needs of varied users into business, functional, and system requirements Use Microsoft Office products to create professional-quality diagrams, documents, spreadsheets, pivot tables/charts, and presentations. Calculate financial metrics, such as Return on Investment, Net Present Value, Payback Period, Cost per Customer, etc. Manipulate data using relational techniques Ability to: Take direction and complete tasks on time Maintain the confidentiality of sensitive information Deliver quality customer service to users Quickly learn about new technology Communicate effectively, both verbally and in writing Establish and maintain effective working relationships with others Effectively utilize appropriate security and safety equipment and procedures Exercise good judgment, discretion, and maintain confidentiality Maintain regular and reliable attendance Apply IT policies and programs in a manner aligned with the GLWA mission, goals, and strategies Prioritize and resolve conflicting requests in a busy environment with frequent interruptions Work with independence and initiative Organize, perform, and coordinate technology tasks and projects Develop proficiency in unit-specific operations and software Direct team activities Environmental Working Requirements Work is performed within an office, plant environment, remote sites, or other locations within the Great Lakes Water Authority (GLWA) service area. Employees within this classification may be exposed to dust and electrical connections, and frequent work with computer equipment. "}