{"jobID": "2812752331", "jobLocation": "San_Francisco_CA", "jobTitle": "Database Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.predictivetechnologies.com", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "Data Engineers / Database Analysts are fundamental to the success of our clients; you will be the bridge between raw client data and the APT software. You will be responsible for: Designing processes to extract, transform, and load (ETL) terabytes of client data into APT's analytics platform using SQL and other technologiesWorking across multiple client teams, both internal and external, in order to determine the data requirements and business logic applicable to each client.Tackling big data problems across various industries, utilizing your creative thinking skills What does this mean for you? Strategic problem solving with exceptional peers who are also passionate about dataCreative freedom to innovate with new technologies (such as Microsoft SQL Server & Business Intelligence Tools) and to explore a variety of directionsFlexibility to work on many new and challenging projects across a diversity of industriesA dynamic environment where you will have an impact and make an immediate differenceAn immediate opportunity for increased responsibility, leadership, and professional growthCommitted mentoring and training by an experienced and driven management teamCollaborate with other APT departments and focus on internal development, during which you will develop new tools and processes that will be used across APT Ideal Candidate Qualifications Understanding of relational databases and ETL process (preferably Microsoft SQL Server)Desire to work with data and help businesses make better data-driven decisionsExcellent written and verbal communication skillsHands-on experience with the ETL process, SQL, and SSISKnowledge of at least one scripting/programming language a plus (Powershell, .Net, Perl, Python, VB Script, C#)Strong troubleshooting and problem solving capabilitiesDemonstrated analytical/quantitative skillsBachelor's degree with an established history of academic successTaipei Applicants: Fluency required in Mandarin Chinese and English languagesAPT is an equal opportunity employer that values diversity and inclusion. Applicants will be considered and treated without regard to gender, gender identity, race, color, ethnicity, national origin, religion, sexual orientation, veteran or disabled status, or any other characteristic protected by applicable law."}