{"jobID": "2832363810", "jobLocation": "Detroit_MI", "jobTitle": "Commercial Underwriting Officer Detroit MI", "companyRating": null, "companyInfo": {"Website": "www.comerica.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1849", "Type": " Company - Public (CMA) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Regions Financial, BBVA Compass, Zions Bank"}, "estimatedSalary": null, "jobDescription": " The Commercial Underwriting Officer is responsible for the underwriting and documentation of larger and/or more complex loan requests for assigned Lines of Business (LOBs) - International, Mortgage Banking, Finance. Underwriting a variety of loan types and structures and may have expertise in one or more LOBs, owns deal analyses and executes workflow according to established Service Level Agreements (SLAs). Also assists in the on-going monitoring of the credit exposure for assigned relationships, including renewals, reaffirmations and annual risk ratings. Reporting Information: The Commercial Underwriter Officer reports to the Manager Commercial Underwriting (MCU). Position Competencies: Successful incumbents possess strong analytical, time management and verbal and written communication skills. Position Responsibilities:Provide complete analysis of loan package for new deals, reviews and renewalsIndependently prepares and/or updates appropriate RECAP documentation for large and/or complex requests.Prepares collateral charts, cash flows, risk ratings and other attachments.Provides detailed industry analysis and understand potential impacts on the client and credit request.Identifies policy exceptions and independently develop mitigates and structure modifications to address or eliminate them.Identifies and analyzes inconsistencies and inaccuracies in customer data, including spreads, aging's, projections and other financial documents.Ensures complete and thorough analytical narrative and commentary on the request and makes recommendations on structural enhancements to mitigate risk or help win business.Evaluates strengths and weaknesses within each credit and escalates risks and other issues to MCU and/or RM or PM (Portfolio Manager).Independently contacts customers to obtain answers for credit requests.Recommends appropriate controls and covenant structure for new credit requests.Recommends risk rating.AdministrationCalculates loan covenants and assist with tracking on complex transactions in conjunction with CSC (Credit Support Center) team for assigned relationships. Follows-up with PM/RM on violations and provide recommendation for waiver, modification or cure.Shares responsibility with Credit Specialists for performing OFAC checks and identifying issues.Serves as mentor and assists with training more junior underwriters and rotating credit analysts.Investigates title searches, surveys and UCC (Uniform Commercial Code) searches as requested by MCU or RM/PM. Works with PM and loan closing team as requested to resolve issues.Process SustainabilityAdheres to department procedures for workload management.Strives to meet or exceed SLA, or when not possible, communicate to MCU and RM/PM.Ensures appropriate RECAP formats/attachments are used in accordance with approved process & procedures and assists MCU with reviewing RECAPs.Recommends process improvements in support if continuous improvement culture within Commercial Underwriting.Other duties as assigned. Travel  Travel is not required of this position.  Relocation  Relocation is not available for this position. Bachelor's Degree4 years of commercial underwriting, credit and/or lending experienceCompletion of Credit College or other formal credit training5 years' experience with Microsoft Office applications (Word, Excel, PowerPoint, Outlook) Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}