{"jobID": "2791075944", "jobLocation": "Cranbury_NJ", "jobTitle": "Scientist - Quality Control", "companyRating": null, "companyInfo": {"Website": "www.oncobiologics.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview: Quality Control Scientists - Raw Materials, perform Quality Control testing of Oncobiologics Biosimilar raw materials, sends samples to external labs for testing, and ensures outside test results are received. Will also be responsible for initiating and overseeing the program to bring raw material testing in house. Will also take part in testing of cell banks, in process intermediates, drug substance and drug product. The Quality Control function at Oncobiologics operates under CGMP and this position is directly responsible for maintaining compliance with FDA, ICH and international regulations. In conjunction with Quality Assurance, the Quality Control function at Oncobiologics ensures that products meet established specifications prior to release. Job Responsibilities:Perform routine testing to support manufacturing and stability. Analyze raw materials, in-process control samples, drug substances and drug products using IR, UV/VIS, pH, SEC HPLC and compendial assays.Oversee raw material testing program, including use of external labs.Performs data review to ensure accuracy, completeness and validity.Performs routine lab inspections.Participates in safety inspections, internal audits and regulatory inspections.Qualifications & Experience:BS or MS in Chemistry or related subject area.Experience in quality control analysis of raw materials. Small molecule experience is a plus.Experience interacting with external labs, sending samples to external labs and reviewing external lab test results.Knowledge of some of the following methodologies is plus: Bioassay, Bioburden, CE-SDS, CEX-HPLC, ELISA, Endotoxin, HCP, HILIC, icIEF, Pro-A HPLC, qPCR, rProtein A, rDNA, SE-HPLC, SE-UPLC and Sterility.Knowledge of compendial test methods and associated instrumentation used to perform raw material ID testing.Knowledge of some of the following methodologies is plus: IR, Bioassay, Bioburden, CE-SDS, CEX-HPLC, ELISA, Endotoxin, HCP, HILIC, icIEF, Pro-A HPLC, qPCR, rProtein A, rDNA, SE-HPLC, SE-UPLC and Sterility."}