{"jobID": "2803273741", "jobLocation": "Chicago_IL", "jobTitle": "Analytics Manager", "companyRating": "2.9", "companyInfo": {"Website": "www.sparkfoundryww.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Company DescriptionWHY YOU WANT TO WORK AT SPARK FOUNDRY Lets be honest in this industry, sometimes we complicate things that should be simple. Here is the bottom line: we want YOU to join us if you are truly passionate about guiding marketers on how to best connect their brands with people. It doesnt get much simpler than that.  At Spark Foundry, we have a unique approach and provide the support to help you do this. In fact, our approach is built on creating the space for ideas that lead to smart work, and Spark Foundry is built to celebrate and develop YOUR ideas.Job DescriptionThe Analytics Manager is a key driver of insight and strategic thinking. The primary responsibility of the Manager is to provide analytics-based strategic insights and directions to aid in the development of media & communications initiatives.  This position requires both strategic and tactical skill sets with an eye for numbers, intellectual curiosity, proficiency at problem solving, and a critical understanding of offline & online media. The candidate must have a proven track record in data-rich analyses, and be a team player. A roll up the sleeves approach is mandatory and a get it done attitude is a must. Specific responsibilities include coordination between the research, analytics & media teams ensuring high quality analytical projects are effectively delivered.  Specific Duties include:  Work with Associate Director to design and execute analytical plans to improve the effectiveness of communications programs. As required/appropriate, perform hands-on analysis in support of results, including the development of conclusions and implications. Work with Analyst to perform ongoing analysis to ensure the timely adjustment/optimization of campaigns. Emphasis on understanding dashboards and applying MMM findings, statistical testing to media planning. Partner with external analytical stakeholders on a daily basis to plan, execute and analyze projects. Supervise and mentor Analysts. Support agency new business process, as directed.Qualifications 3-5 years of experience in performing analytics in marketing sciences capacity at a media agency, market research, consulting or pharmaceutical firm. Quantitative educational background (preferred advanced degree in Statistics, Social Sciences, Economics, Quantitative Marketing). Strong analytical skills: able to analyze raw data, draw conclusions, and develop actionable recommendations; experience in the analysis of large data sets to find useful relationships. Strong presentation skills. Proven ability to communicate complex, technical concepts to broad based stakeholder audience. Working knowledge of databases and SQL a must. A plus Knowledge of web measurement technologies: Ad serving platforms (e.g. DART) Website analytics software (e.g. Adobe SiteCatalyst, Google Analytics) Data visualization skills desirable (e.g. Tableau, Omniscope) Experience in a cross-functional team environment. Agency experience a big plus Additional InformationWHO WE ARE Throughout our rich history, weve taken pride in our ongoing legacy of and commitment to constant evolution. Its in our DNA to evolve.  By melding the spirit of a startup and the soul of a powerhouse across our business, we aim to bring modern heat to brands the kind of heat that arises at the intersection of startup and powerhouse; of data and content; of art and science; of old and new.  Energy and innovation fuels our startup spirit, while the unrivaled marketplace clout, exclusive partnerships, and global practice capabilities we have at our disposal as a full-service Publicis Media agency deliver our powerhouse soul for our clients.  We hope youll take a few moments to learn more about us, and to begin thinking about how we might put the power of plus to work for you (http://www.sparkfoundryww.com/).  Spark Foundry is an Equal Opportunity Employer.  All your information will be kept confidential according to EEO guidelines"}