{"jobID": "2835013292", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist (Intern) - United States", "companyRating": "4.0", "companyInfo": {"Website": "www.cisco.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (CSCO) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Alcatel-Lucent, Juniper Networks"}, "estimatedSalary": "62000", "jobDescription": "WHAT YOU’LL DOAs a Data Scientist Intern at Cisco you will interpret data, analyze results using statistical techniques, and provide ongoing reports. You will review computer reports, printouts, and performance indicators to locate and correct code problems and maintain databases/data systems. You will be responsible for identifying, analyzing, and interpreting trends or patterns in complex data sets. You will also develop, prototype and test predictive algorithms and implement data collection systems and other strategies that optimize statistical efficiency and data quality.TEAM DESCRIPTIONLet's change the world together. At Cisco you will find a diverse group of people working on massive structured, unstructured, transactional and real-time data sets from a variety of sources. We work with multi-functional teams to analyze customer usage patterns and provide actionable, intuitive, impactful insights using metrics, algorithms, and statistics. You'll learn from industry professionals and we will value your ideas and perspective.QUALIFICATIONSYou are currently enrolled in a BS, MS or MBA program or equivalent in Computer Science, Mathematics, Economics, Information Management, Statistics or a related fieldYou have earned a minimum of a 3.0 GPAYou know how to work a problem from beginning to end with data science tools and techniques, including data manipulation (SQL, Hadoop, etc.) and programming (R, Python, XML, Javascript, or ETL) frameworksYou have experience with Oracle databases, strong knowledge of and experience with reporting packages (Business Objects etc), and knowledge of statistics for analyzing large datasets (Excel, SPSS, SAS etc).You possess technical knowledge regarding data models, database design development, data mining and segmentation techniquesYou have strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyYou are proficient in queries, report writing and presenting findingsWHY CISCOAt Cisco, each person brings their own unique talents to work as a team and make a difference.Yes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people.We connect everything – people, process, data and things – and we use those connections to change our world for the better.We innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more – from Smart Cities to your everyday devices.We benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.Colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Be you, with us! #WeAreCisco#UNIVSALESJOBS #SALES #SERVICES #GBS #ENGINEERING #CISCOSALESSTART @WEARECISCO"}