{"jobID": "2470439783", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.uptake.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "What we do Uptake harnesses the power of underutilized data to empower businesses to make informed decisions. We partner with industry leaders to build a predictive analytics software platform that grows smarter in one industry because of what we learn in another. The result is a powerful platform that identifies problems before they happen, ultimately saving money, time and lives. What you’ll do As a Data Engineer on the Data Science team, you’ll work with Uptake’s data scientists to design and build Uptake’s data infrastructure within Data Science. The tools you create will have lasting impact on model development and deployment, model performance reporting, and data monitoring. The ideal candidate is flexible and adaptive to the rapidly evolving needs of the team. ResponsibilitiesCollaborate with data scientists, engineers, and product owners to define and manage new sources of dataWork with data ingestion teams to develop data expertise and resolve upstream issues relating to data qualityDesign and implement data warehouses, real-time ETL, and batch processing of data to support modeling and reporting needsDefine best practices and design for the management of dataPartner with Data Scientists to build and maintain internal data processing and visualization toolsQualificationsRequired:Bachelor’s degree in computer science, information technology/information systems, or a field related to a computational scienceAbility to write efficient SQL queriesExperience managing data ETL processes and making data available through service applications and databases.1+ years experience with NoSQL databases (Cassandra or Elasticsearch preferred)3+ years experience with programming languages (Python, Java, R, and/or Scala preferred)Familiarity with a variety of data processing technologies (e.g. Spark, Kafka, Hadoop)Excellent communication skills, including a knack for clear documentationExperience with or knowledge of REST APIs and making data available through microservices.Experience using version control (Git, Mercurial, SVN, etc.) for collaborative code development."}