{"jobID": "2828438750", "jobLocation": "Santa_Clara_CA", "jobTitle": "Digital Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.vdartinc.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " VDart is global, emerging information technology staffing provider with expertise in Enterprise Resource Planning, Business Intelligence, Identity / Content Management & Infrastructure services. We have successfully deployed over 3000 contractors in the last 5 years with over 60% of the deployments with Fortune 1000 corporations. We possess deep industry expertise and focus in BFSI, Manufacturing, Retail, Energy & Utility, Healthcare, Technology and Public sector. Our scope, knowledge, industry expertise and global footprint have enabled us to provide best in the industry solutions. With our core focus in emerging technologies we have provided global technology workforce solutions in  USA, Canada, Mexico, Brazil, UK & Australia. We are VDart the *Bulls-i-Partner*, customers rely on us more than ever to staff their Information Technology contracting needs. Please send your resume to teamarif@vdartinc.com for immediate considerationRole: Digital Data AnalystLocation: Santa Clara, CADuration: Long Term ContractNo. of Positions: Multiple (Junior/Senior/Managing)Job Description:Assessing current state of technology platforms, data structure, data insight delivery aligned to the business strategies.Digital technology knowledge and experienceData analysis - GA, SAP Hana or the likesData science - hands on end to end data insights extractionStrategic thinkingProject management, collaboration, communicationCandidate should be from the Sales and Marketing domainCandidate should have worked in an M&A; (Merger and Acquisition) environment. If your skills match these requirements, please send your resume to teamarif@vdartinc.com for immediate consideration. Please be assured that your resume will be reviewed and you will be contacted if there is an interest in your background and experience. Candidates should e-mail resume to address above. Be sure to reference the job number and title in the subject line.Referral Program: Ask our recruiting team about how you can be a part of our referral program. If you refer a candidate with this background and if the candidate accepts the role our team pays a generous referral. We are keen on networking and establishing a long-term, mutually beneficial partnership with you. We are Equal Employment Opportunity Employer.  VDart Inc  Alpharetta, GA  recruiter@vdartinc.com  Follow us on Twitter for the hottest positions: @VDart_Jobs  Follow us on Twitter: @vdartinc"}