{"jobID": "2781117249", "jobLocation": "Washington_DC", "jobTitle": "SIGINT Data Scientist, Senior", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "101000", "jobDescription": "Job Number: R0012389 SIGINT Data Scientist, SeniorKey Role:  Provide Scientific, Engineering, and Technical Assistance (SETA) support to the government Program Manager (PM) and provide technical support and expertise on automated analysis of SIGINT data. Assimilate and integrate technical inputs from performers and analyze performers' technical deliverables and reports. Conduct technical writing, development or refinement of briefing materials, and other program documentation using Microsoft Word and PowerPoint, conduct independent review and summary of related technical literature and emerging technologies, and participate in conferences and workshops related to program technical areas. Develop and document testing methodology and protocols, ensuring they align with program technology components. Assess performer results against program metrics. Coordinate, align, and schedule technology development tasks across multiple performers and perform continuous analysis of technical progress in comparison to planned cost and schedule. Perform technical and programmatic risk analysis or review and tracking.  Basic Qualifications:  -3 years of experience with research in statistics, mathematics, or computer science  -2 years of experience with research in time series analysis, text analysis, event ontologies, or stream-based machine learning  -2 years of experience in R&D; program management  -TS/SCI clearance with a polygraph  -MS degree in Mathematics, Computer Science, or Engineering  Additional Qualifications:  -Knowledge of the US SIGINT system, including database repositories, digital network intelligence, and dialed number recognition preferred  -Possession of excellent writing and organizational skills  -Possession of excellent oral and written communication skills  -PhD degree in Mathematics or Computer Science preferred  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.#LI-AH1, CJ1, DH1, GD13, MPPC, NAA, TMJ16 "}