{"jobID": "2829124503", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Superintendent", "companyRating": null, "companyInfo": {"Website": "www.henselphelps.com", "Headquarters": "Greeley, CO", "Size": "1001 to 5000 employees", "Founded": " 1937", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Project Superintendent has the responsibility and authority for daily coordination and direction of the project. The Project Superintendent will generally concentrate on long-range planning, problem solving, and logistics.\",\"PositionRequirements\":\"Essential job functions include: Subcontractor managementOwner / Client relationsProject safety leadershipProject schedulingJob planningMaterial expeditingEquipment utilizationLabor cost control and analysisDaily reportsQuality controlPersonnel evaluation and development Preferred qualifications: Strong communication skillsComputer software - Microsoft Office Suite, specifically Excel based templates, Prolog, Primavera and AutoDesk SuiteMinimum of 7-8 years’ experience on large commercial construction projectsA 4 year degree in Civil, Structural, Architecture or Construction Management \",\"PositionNotes\":\"Hensel Phelps is an equal opportunity employer and contractor. All qualified applicants will receive consideration for employment without regard to their protected veteran status, nor will they be discriminated against on the basis of disability.  EOE AA M/F/Vet/Disability  Hensel Phelps will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with Hensel Phelps’ legal duty to furnish information."}