{"jobID": "2820542287", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Must have strong Supply Chain background", "companyRating": "3.1", "companyInfo": {"Website": "www.nttdata.com/joinus", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (9613) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Capgemini, Accenture, Deloitte"}, "estimatedSalary": "56000", "jobDescription": " Our client has an immediate need for a Lead Data Analyst that has previous experience analyst Supply Chain Data. This is a 6 month contract to hire role with a WORLD CLASS Organization. This is a contract to hire role - our client will not sponsor at this time JOB DESCRIPTION: With minimal direction, this position bridges the gap between our business partners and the technology solution providers (e.g., vendors, infrastructure team, development team, etc.) by translating business needs into technical solutions. This position involves coordination and/or execution of plans to ensure that technical solutions meet the needs of the business. May take a leadership role with other team members on assignments and acts as a primary point of contact with client. The ideal candidate will have extensive experience gathering and documenting requirements, facilitating meetings, and delivering results. This person must be a highly organized, self-starter who thrives in a fast-paced and rapidly changing environment and have proven measurable experience with all aspects of the Software Development Life Cycle. RESPONSIBILITIES:Deliver functional design documents, including the SDLC (requirement gathering and analysis, design, testing, deployment and plan support maintenance).Builds relationships with business clients and acts as liaison between the business community and solution provider, and acts as a day-to-day point of contact with client.Analyzes change requests to determine feasibility in relation to existing business requirements and processes. Interfaces with vendors to understand whether vendor products will meet business and technical requirements.Anticipate the needs of the business and determines strategic fit of initiatives.Set area priorities, establish expectations, and maintain focus.Will need to work closely with business functional areas to understand, define system requirements and make recommendations for business solutions. Also able to identify missing requirements based on experience and business goals.Provide ongoing system support in responsible area. Must be able to solve complex problems through research and analysis.Organize and track the progress of systems by applying project management techniques.Identify issues that will delay on-time delivery and assists in resolving them, by working with management to overcome obstacles and complete projects. Representing the right priority for issues and changes at during defect management and change management processes.Work with business partners to develop acceptance criteria / test cases. Then able to develop test plan and perform needed application testing.Represent the customers and stakeholders to internal and external technology providers. - Maintain all documentation, including business and technical application requirements, report requirements, and support documentation.REQUIRED SKILLS:Bachelor's degree - Business or IT with related experience.6+ years of IT experience.4+ years as a business, technical or systems analyst.5 + years of Supply Chain planning and execution application implementation experience (emphasis on Source to Pay).Highly organized self-starter able to multi-task in a fast-paced and rapidly changing environment.Strong verbal and written communication skills, with the ability to work effectively across internal and external organizations. Including the ability to communicate technical information to non-technical audiences.Ability to build collaborative working relationships with various internal and external stakeholders.Strong analytical and problem solving skills with ability to influence cross-functional teams without formal authority.Demonstrated ability to organize, facilitate, and recap meetings with good attention to detail.Proficiency with Microsoft Office suite, specifically Word, Excel, PowerPoint and Visio.Experience with iValua or a similar Source to Pay application (Arbia, Zycus or other).PREFERRED SKILLS:Leadership, project management, and relationship management skills.Excellent business and technical problem solving.Ability to \"think big” and demonstrate strong analytical skills.Cross-functional integration and negotiation skills.Knowledge of multiple development methodologies, including Agile.Technology implementation experience.Ability to bridge communications on complex needs and requirements between technical and business-oriented audiences. The Company is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result."}