{"jobID": "2687040982", "jobLocation": "El_Segundo_CA", "jobTitle": "Command & Data Handling Engineer", "companyRating": null, "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requisition ID: 38829All Locations: El Segundo, CA (California)  A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning clandestine to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation's space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?Responsibilities The Digital and Integrated Circuit Electronics Department facilitates the utilization of electronics in space by the application of industry-standard tools and our specialized resources and expertise to the issues relevant in the implementation of Architectures/chip/board/unit/sub-system/system space-based electronics. Key FunctionsReview Command & Data Handling board/unit designs, to provide our government customers assessments of space flight worthinessReview schematics, board stack-up, board artwork, worst case circuit analyses, test data to identify design deficiencies and provide recommendations for corrective actionProvide technical consult and assist in hardware anomaly resolutionProvide timely communication of technical issues, along with recommendations for corrective action, to program management and technical peersProvide clear and concise written reports, presentations, to program management and technical peersTravel is required (as needed to support tasks)***This role can be filled as an Aerospace Engineering Specialist or Senior Engineering Specialist***QualificationsRequiredDegree from an accredited university in Electrical Engineering.Minimum of 8 years of experience after achieving Bachelor's degree.In-depth understanding of signal integrity, power integrity circuit mechanisms.In-depth understanding of Command & Data Handling electrical characterization, test methods and test equipment.In-depth understanding of standard digital circuit interface operation (CMOS, RS-422, LVDS, and ASIC/FPGA).Excellent written and verbal communication skills.Strong interpersonal skills and the ability to interface effectively with program offices in a proactive manner.Ability to obtain a DoD Secret level clearance with SCI access. (US citizenship required).Required for consideration as a Senior Engineering Specialist (In Addition)Minimum of 12 years hands-on experience after achieving Bachelor's degree.Demonstrated leadership ability in multi-disciplinary teams.Current and active Secret government clearance.PreferredCurrent and active Top Secret SCI clearanceTranscript Requirement Transcripts are required for this position.Additional Requisition DetailsSystem Job Title: ENGRG SPECIALIST Clearance Requirement: Secret Access: SCI Polygraph: Counter Intelligence Polygraph Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company Statement The Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.  From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world. Equal Opportunity Commitment The Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.  You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement. Nearest Major Market: Los Angeles Job Segment: Database, R&D; Engineer, Electronics Engineer, Engineer, Electrical, Technology, Engineering"}