{"jobID": "2781812233", "jobLocation": "San_Francisco_CA", "jobTitle": "Maintenance Technician", "companyRating": "3.4", "companyInfo": {"Website": "www.veritasinvestments.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "20", "jobDescription": "JOB SUMMARY A Maintenance Technician is responsible for assessing scope for repairs, performing repairs and change orders, and managing project timelines, working closely with skilled trades, resident managers and residents. The Maintenance Technician ensures quality control is consistent with Property Management's specified standards and materials and that work orders are completed in a timely manner. The Maintenance Technician checks in daily and communicates directly with the Maintenance Supervisor and Lead Technician. ESSENTIAL DUTIES AND RESPONSIBILITIESCommunicate with team members, resident managers, and maintenance supervisor throughout the dayDetermine scope applying creative cost solutions, using data, experienceReport on all expenditures, change orders, invoices, billing and purchases for approval and processingCollaborate with skilled trades to perform work in a cost efficient manner keeping deadlines and schedulesDetermines and plans weekly materials, equipment and supply needsPerform QA/QC inspections of portfolio to prevent and correct any unsafe or damaging conditionsPerforms hands-on repairs and maintains portfolio cleanlinessDaily reporting of completed work order, open work order and any issues encounteredWeekly submital of time sheets, gas mileage and invoices associated with the work ordersMaintains regular contact with residents and skilled trades keeping detailed current system records and documentsDiagnose and claims to perform routine maintenance or repairs as required involving the following: electrical, rough and finish carpentry, tile, carpet and flooring, roofing, gutters, sheet metal, windows, sliding glass and doors, shutters, doors, cabinets, door hardware and locks, plumbing, gas and sewer systems, water intrusion – roofs, stucco and siding, drywall and paintConduct all business in accordance with company policies and procedures and all state and federal regulations (such as Lead Based Paint) ADA, EPA, Fair Hosing, HAZCOM Program, OSHA, etc. and perform other related duties or special projects as assigned.SKILLS AND ABILITIESProven experience as maintenance technicianAn understanding of general plumbing and electrical systemsKnowledge of general maintenance processes and methodsGood working knowledge of tools and deviceManual dexterity and problem-solving skillsGood physical condition and strength with the ability to lift up to 75 poundsAble to work well with minimal supervisionAbility to prioritize tasks and follow specified proceduresBe responsive with emails, calls and textsWORKING CONDITIONSWhile performing the duties of this job, the employee is frequently exposed to fumes or airborne particles, moving mechanical parts and vibration. The employee is occasionally exposed to a variety of extreme conditions at construction job sites. The noise level in the work environment and job sites can be loud. This position is often performed in outside weather conditions.The employee is occasionally required to sit; climb or balance; and stoop, kneel, crouch or crawl. The employee must frequently lift and/or move up to 10 pounds and occasionally pull, push, lift and/or move up to 75 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and ability to adjust focus.DISCLAIMER This job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.  We provide employment opportunities (EEO) for all employees and job applicants without regard to race, color, religion, national origin, gender, sexual orientation, age, marital status or disability. We hire and promote individuals solely on the basis of their qualifications for the job to be filled. Qualified job applicants with arrest and conviction records will be considered for the position in accordance with San Francisco’s Fair Chance Ordinance. ABOUT VERITAS INVESTMENTS Headquartered in San Francisco, Veritas Investments is an experienced real estate investment manager that specializes in owning and operating mixed-use multifamily and retail properties in the San Francisco Bay Area.  The company offers institutional and Individual investors a vertically-Integrated platform and a clearly defined investment strategy that focuses on acquiring undermanaged multifamily and urban retail properties and then enhancing their income and value through building and management improvements. The company holds a track record for moving quickly on opportunities, executing efficiently on strategy, and delivering superior financial performance to investors while giving back to the community.  Veritas Investments has been fortunate to be the recipient of many awards including two recent honors: IREM's Workplace Environment Award for Employee and Leadership Development and was also named Real Estate Investment Fund of the Year by REFI. "}