{"jobID": "2518721836", "jobLocation": "Chatham_NJ", "jobTitle": "Environmental Professional – Engineer/Geologist/Scientist", "companyRating": "2.3", "companyInfo": {"Website": "www.bemsys.com", "Headquarters": "Chatham, NJ", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": " BEM Systems, Inc. has an excellent opportunity for growth to a project manager level for a mid-level self-motivated environmental professional. The ideal candidate will be responsible for all aspects of a project including management of scope, budget, schedule, assist with fieldwork (~25%), managing subcontractors, data evaluation, regulatory interpretation, and writing quality technical deliverables. Qualifications6-10 years experience in site remediation in New Jersey, including field investigations and management of tasks.Requires demonstrated experience with NJDEP regulatory requirements and field investigations and site remediation.Bachelor’s degree in Engineering/Geology/Environmental Science or related field; M.S. preferred.Excellent verbal and written communication skills and ability to write technical reports of a high quality.Good field skills preferred such as soil logging, soil groundwater sampling, vapor investigations, etc.Experience on Linear Construction Project and transportation agencies a plus.Professional license (LSRP, PE or PG) not required but a plus.ResponsibilitiesSupport Program Managers and help lead the project teams to successfully execute projects with various local, state and federal clients. Manage multiple tasks and/or projects and able to maintain scope, budget and schedule.Work with managers and/or LSRPs to perform preliminary assessments and implement site and remedial investigations, evaluation of subsurface geology and hydrogeology, assist with remedial action selection and implementation of remedial action work plans and remedial actions.Understand and appropriately apply the most current New Jersey regulations and guidance –NJDEP SRRA, ARRCS, Technical Requirements for Site Remediation (TRSR), various guidance documents, and NJDEP’s Field Sampling Procedures Manual.Manage and coordinate with subcontractors for earthwork, UST removal, drilling, injections, laboratory analyses, etc.Work in small teams to implement projects, and be flexible to play different roles in various projects – field lead, task manager, primary author on reports, or project manager. BEM is an employee-owned company and offers a competitive benefits package including immediate participation in our matching 401(k) Savings Plan. BEM provides excellent opportunities for future career growth and development as a member of our dynamic team. Reply in confidence to: HR Manager  BEM Systems, Inc.  100 Passaic Avenue  Chatham, NJ 07928  E-Mail: hr@bemsys.com  Fax: 908-598-2622 Equal Opportunity Employer"}