{"jobID": "2827456797", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.profusa.com", "Headquarters": "South San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "PURPOSE OF JOB:  Profusa is conducting clinical investigations of fluorescence-based injectable sensors to monitor tissue analytes within the human body. A primary aim of these investigations is to develop approaches to use the sensor data to guide clinical choices during disease management. We seek a Data Scientist with experience in biological signal processing, and ideally with experience in time series analysis. This position will lead the development of approaches to extract meaning from the data that are sampled during clinical investigations. MAJOR DUTIES AND RESPONSIBILITIES:Generate generalizable scripts to parse, organize, clean, and structure multi-parametric datasetsDevelop, deploy, and continuously improve data reporting packages for ongoing clinical investigationsDevelop algorithms that extract meaningful parameters from time-series biological dataDevelop classification algorithms that predict health status of an individual, either independently or in combination with external data streamsDevelop software tools to support standardization of protocols and quality control of sampled dataServe as liaison between Clinical team and external clinical database servicesWork collaboratively with Data Science team to support algorithm development, the Engineering team to support hardware and software development, and the Pre-Clinical team to support experimental applicationsAssist in the creation and expansion of company’s intellectual property portfolioEXPERIENCE REQUIREMENTS:> 4 yrs. research experience working with biological signal processingProficiency in a scientific computing language such as Python, R, Matlab, etc. is requiredProficiency in programming language such as C, C++, Java, or Javascript is a plusFamiliarity with relational databases (i.e. SQL) is importantIdeal candidate has experience with advanced time series analysis (i.e. feature extraction, as well as Fourier, wavelet and complexity analyses approaches)Experience with statistical classification approaches (i.e. machine learning) is desiredExperience conducting receiver operator characteristic analysis is a plusFamiliarity with Tableau is a plusExperience working with data obtained during clinical trials is a plusStrong written and verbal communication skillsDemonstrated ability to work collaboratively with multi-disciplinary teamsEDUCATION REQUIREMENTS:Ph.D. (or experienced M.S.) in Biomedical Engineering, Computer Science, or equivalent"}