{"jobID": "2674193727", "jobLocation": "San_Jose_CA", "jobTitle": "Data Science & Machine Learning Lead - Cloud Access Security Broker Team", "companyRating": null, "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": null, "jobDescription": " Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse “big data” sources to generate actionable insights and solutions for client services and product enhancement.  Interacts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.  Acknowledged authority within the Corporation. Acts as a leader of large-scale company initiatives. Viewed by peers as a leader and top contributor and by line management as a key business partner. 10 plus years experience. BA/BS degree preferred. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.We  are for looking a hands-on technical lead of data science and machine learning  to join our team to focus on security and threat detection. You will be an  influencer working as part of the Oracle strategic cloud security engineering  team. Our team develops game-changing security technologies to help enterprise  customers adopt clouds with high confidence. You will develop, implement, and  deploy algorithms for detecting threats and anomalous user activities in the  cloud. You will lead efforts to apply data science and machine learning skills  to detect known and unknown security sensitive patterns from the large amounts  of data that Oracle security service receives each day. The detected threat and  anomalies will help customers from all over the world secure their data and  users in the cloud and ensure they are compliant.  This role provides a fantastic  opportunity to build disruptive security technology and shape the cloud  security industry. You’ll collaborate with product managers, security experts,  and engineers to build data driven features. You will participate in rapid  build, test & deploy cycles in iterative fast-moving development model. Responsibilities:  ·  Apply data mining, anomaly detection, and machine learning to  enhance security and threat detection efforts  ·  Work in lock steps with product managers, engineers, and  security experts for implementing cloud threat models.  ·  Create  features from the underlying data  ·  Perform  data analysis to generate customer specific business insights from Cloud  applications  ·  Evaluate  different algorithmic approaches to solve various machine learning and  prediction use cases.  ·  Architect,  test, tune and deploy algorithms into production  ·  Implement  data pipeline process for data scientists to consume data in secure fashion Desired Skills and Experience:  · 8  years of experience in applied Machine Learning and Statistics  ·  Minimum 3 years of hands on commercial experience in machine  learning, statistical modeling, data mining, pattern recognition, and  probability theory, especially in security area  · 3  years of experience in cloud security product development  · 5  years experienced in Java, Scala or Python programming  ·  Critical  thinking, ability to track down complex data and engineering issues  ·  Fluency  in data modeling and best industry practices for machine learning pipelines  ·  Experience  in Spark, MLLib, Hive, Scikit Learn  ·  Excellent  problem solving and communication skills with both technical and non-technical  audiences  ·  Masters,  PhD, or equivalent experience in a quantitative field (computer science, mathematics  or statistics)  ·  Preferred  background in security authentication, encryption, entitlements, audit &  authorization policies"}