{"jobID": "2796517854", "jobLocation": "San_Mateo_CA", "jobTitle": "Big Data Engineer", "companyRating": "4.6", "companyInfo": {"Website": "corp.roblox.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unity Technologies, Valve Corporation, Facebook"}, "estimatedSalary": "108000", "jobDescription": "Roblox, Big Data Engineer, San Mateo, CA Robloxs imagination platform is ushering in the next generation of entertainment. Roblox enables kids of all ages to imagine, create, and play together in immersive experiences on their phones, desktops, consoles, and VR. Powered by a growing global community of millions of creators, Roblox enables anyone to build, publish, and monetize their creations.  ComScore ranks Roblox as one of the top digital properties in the US for kids under the age of 18 and has been named One of America's Fastest-Growing Private Companies in the Inc. 5000 for two consecutive years.  Work with the most passionate, team-oriented, visionary, and crazy-smart people youll ever meet. The engineers at Roblox are working on the hardest problems in tech today -- distributed systems, real-time communication, 3D co-experience, massive data processing, social networking, rendering, physics, and more. As a Roblox engineer, you will have real ownership and impact across one or more of these domains.  As a Big Data Engineer, youll play a critical role in scaling our infrastructure at a time of incredible growth and shape the future of the Imagination Platform. You'll have boundless opportunities to devise and build cutting-edge, innovative content search and discovery solutions that impact Roblox's global audience. If you know what it takes to build and operate that can sustain over one million concurrent players year-round and you take play as seriously as we do, youll fit right into our talented and ever-expanding engineering team. You Are:Experienced, with over 3+ years Java and a strong foundation in algorithms and data structuresA Leader with experience working with big data frameworks such as map/reduce, spark and associated tools (hive, pig, sqoop, etc)Effective with demonstrated skills working with NoSQL stores, columnar data stores and relational data storesProficient with modern cloud computing platforms such as AWS and GCP, micro-services architectures, lambda architectures, real-time data processing etc.Passionate about processing big data sets and leveraging Machine Learning, AI to deliver insightsYou Will:Help lead next-generation search and discovery for games, immersive worlds and other user-generated content like modelsHarvest billions of events to gain operational and business insight into the performance and optimization of the Roblox platformBuild complex production-quality algorithms and data pipelines that mine large data setsWork closely with product, engineering and business leads in generating dashboards, reports and summary data that automatically feed into platform behaviorBuild and maintain the infrastructure collect and transform raw data across the Roblox stackYou'll Love:Excellent medical, dental, and vision coverageA rewarding 401k programFlexible vacation policyFree catered lunches five times a week and several fully stocked kitchens with unlimited snacksOnsite fitness center and fitness program creditAnnual CalTrain Go PassA super-cool Roblox Admin badge for your avatarRockstar status with our communityRoblox Powering Imagination. #LI-EZ1  [ID897]"}