{"jobID": "2830928627", "jobLocation": "Los_Angeles_CA", "jobTitle": "Clinical Lab Scientist (CLS/MLT/MT) Permanent position", "companyRating": null, "companyInfo": {"Website": "www.soliant.com", "Headquarters": "Tucker, GA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Clinical Lab Scientist (CLS) Permanent position  We have an immediate full-time permanent position for a Clinical Lab Scientist with 2+ years’ experience and a drive to work independently in a hospital environment. Experience recreational activities in Los Angeles, CA such as, spectacular beaches, hundreds of miles of hiking and biking trails, and/or decompress at one of L.A.’s top spas. All the while, working along-side a company who takes pride in our steadiness and efficiency to guide your steps. If this is an ideal opportunity for you, I would love to be the best possible resource in connecting you with our Client. If you meet the following requirements and look forward to this exciting experience or have questions about any of our assignments nationwide, feel free to e-mail me or give me a call with my contact information listed below. Education & Qualifications:CLS certified Medical Technologist with at least two years’ experience as a GeneralistBLS CertificationBachelor's or Associate's Degree in Medical Technology or equivalentBasic computer skills, written and verbal communication skills, demonstrated ability to be flexible, organized and a critical thinkerEmployment Type & Industry:Hospital SettingDay Shift - 3 x 12 (Wednesday-Friday)Rotating Weekends. 6:00 am -6:30 pmExperience:Blood BankingMicrobiology and Microscan (Strongly prefer)Experience with major equipment such as Vitros 350, Siemens EXL, Abbott Ruby, Sysmex CA 540 or 620Responsibilities:Assist the Laboratory Manager in the coordination of laboratory activitiesProvide accurate testing of patient samples to aid in the diagnosis and treatment of disease in compliance and harmony with the quality management systemMaintains positive working relationship with the medical staff and hospital personnelResponsible for accurately completing records and reportsFollows laboratory policy for data retrieval, record keeping, specimen, and identification, requisition, reporting, charting, and billing proceduresContact Information: Susanna Garner  E-mail: Susanna.Garner@Soliant.com  Direct phone number: (281) 668-0648  www.Soliant.com"}