{"jobID": "2838067399", "jobLocation": "Plano_TX", "jobTitle": "Data Quality Analyst", "companyRating": null, "companyInfo": {"Website": "www.pyramidci.com", "Headquarters": "Alpharetta, GA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Collabera, Artech Information Systems"}, "estimatedSalary": null, "jobDescription": "Job Description Immediate need for a talented Data Quality Analyst with experience in the Banking and Financial Industry. This is a 06+ Months Contract opportunity with long-term potential and is located in Plano, TX. Please review the job description below. Job ID:18-26530KeyResponsibilities:Performing manual data corrections, both proactively and in responsive to problem ticketsIdentifying data-quality trends which may indicate application or system-integration defectsWorking with information-technology resources to perform root-cause analysis for incorrect dataTracking identified data-quality issues for resolutionCoordinating with information-technology resources to prioritize system/integration issues for resolutionDeveloping and maintaining procedural documentation around data-corrections processesRepresenting the BI organization on initiatives which impact customer dataDeveloping and executing user-acceptance and regression test plans for defect fixes, enhancements, and project implementationsTraining incoming team members in these job functionsParticipating in other Business Intelligence data-quality initiatives as neededThe training period is extensive due to the complexity of the applications and research requirements, so the first few months of work are primarily data-entry, with new responsibilities added as the resource becomes proficient in each new task.Key Requirements and Technology Experience: Typing ~30 WPM. Proficiency with Microsoft Office applications. Tech-savvy (will be utilizing 6+ enterprise application + MS Office). Basic data-analysis aptitude. Willingness to travel to Torrance for several periods of training (week at a time) Organized. Detail-oriented. Conscientious. Logical. An effective verbal and written communicator. Not expecting to do coding, programming, or any other hands-on technical work Able to create and maintain documents in Word, Excel, etc. One nice-to-have would be experience is creating and executing user-acceptance tests, but that can be trained for. Experience with Microsoft Access databases. Hyperion and/or SQL. Experience with integrated enterprise applications. Experience with basic compliance requirements in finance industry. Recent college graduate would be preferred. Our client is a leading Banking and Financial Industry and we are currently interviewing to fill this and other similar contract positions. If you are interested in this position, please apply online for immediate consideration."}