{"jobID": "2836366247", "jobLocation": "San_Diego_CA", "jobTitle": "Associate Scientist 1", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "76000", "jobDescription": "Basic Function and Scope of the Position:As an Associate Scientist, Materials and Applied Surface Chemistryat Illumina you will work in a dynamic, team-oriented environment and help create genomic analysis tools that enable leading-edge research. You will be a key contributor to integrated and multidisciplinary teams developing new, and improving existing technology platforms. You will plan, initiate, and execute scientific research for Illumina through individual studies as part of a wider team.This opportunity would suit an early career polymer/materials chemist that is looking for a chance to join an organization that is on the cutting edge of biological assay surface chemistry. The post holder can expect a highly innovative environment with global collaboration and top of the range tools and hardware.Tasks and Responsibilities:Perform a wide range of chemistry functions, including materials design, characterization and modification, polymerization and polymer characterization, small molecule synthesis, oligonucleotide and peptide synthesis, and bio-conjugation and modification of bio-molecules.Working with advanced nanofabrication technologies, where understanding of current MEMS industry fabrication technology, techniques, and associated surface and materials chemistry is needed.Performs research and/or development in collaboration with others for projects.Makes detailed observations, analyzes data and interprets results.Exercises technical discretion in the design, execution and interpretation of experiments that contribute to project strategies.Prepares technical reports, summaries, protocols, and quantitative analyses.Contributes to project process within his/her scientific discipline.May participate in scientific conferences and contribute to scientific journals.Works on extremely complex problems in which analysis of situations or data requires an evaluation of intangible variables.Exercises independent judgment in developing methods, techniques and evaluation criteria for obtaining results. All listed tasks and responsibilities are deemed as essential functions to this position; however, business conditions may require reasonable accommodations for additional task and responsibilities.Preferred Educational Background:Requires a Bachelors/Masters degree in a scientific discipline or equivalent with a minimum of 8+ years experience with a Bachelors, or 5 to 8 years with a Masters and demonstrated working knowledge of scientific principles.Preferred Experiential Background:Demonstrated expertise in materials chemistry, soft matter, interface or colloidal chemistry, surface chemistry, and/or polymer science for the development of new materials such as nanomaterials, hydrogels, composites, and/or novel polymeric materials.Ability to work on novel materials design, supramolecular/polymer chemistry and bio-conjugation.Experience with the design and production of micro-fluidics devices via photolithography, hot embossing, micro-imprinting, PDMS polymerization, and other manufacturing techniques.Motivated, enthusiastic, hard-working, cheerful individual who desires to be part of a fast-paced dynamic research environment.Acts independently to determine methods and procedures on new assignments. May supervise the activities of other lower-level personnel.Knowledge of Microsoft Excel and Outlook required.Good data analysis and interpretation skills.Excellent communication and technical skills.Must be very detail oriented. Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at 858-255-5081. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}