{"jobID": "2778784847", "jobLocation": "Santa_Monica_CA", "jobTitle": "Compliance, Controls & Analytics Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.activision.com", "Headquarters": "Santa Monica, CA", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Electronic Arts, Sony, Take-Two"}, "estimatedSalary": "108000", "jobDescription": "The Mission:Reporting to the VP of Internal Audit, the Compliance & Controls Manager will be responsible for fraud prevention and detection: identifying areas of risk and control weakness - mainly within Finance and other headquarters functions – developing plans to remediate, delivering real process improvements and streamlining activities to maximise systems capabilities and ensure robust financial, operational and IT controls are established. The Role:Primarily focus will be continuous monitoring of financial and operational data to prevent and detect fraud at the transaction level; requiring creating automated data collection and analysis processes using a wide variety of software tools on entire populations to identify anomalies, trends, patterns, correlations and fluctuations. The broad categories of test data may include Accounting, Financial, Treasury, Human Resources / Payroll, Sales & Marketing and Procurement activities.The Duties:The underlying duties can be broadly described as follows: •Extract and transform financial data for use in continuous transaction monitoring procedures, fraud investigations and ad-hoc special requests.•Develop custom data mining, analytic tools using Alteryx, Tableau, IDEA, Python and Excel to streamline common analysis of big data and convert PDF reports into data sets.•Visualize and report data findings professionally and creatively to communicate results and minimize the possibility of fraud. •Manage the process of following-up with process owners on Internal Audit’s SOX observations to insure deficiencies are remediated on a timely basis.Individual Traits:Excellent communicator, facilitator and leader, able to clearly and confidently articulate and communicate on and deliver the organization's fraud management strategy.Strong negotiating skills to influence all levels of staff, showing ability to work collaboratively and with peers from different departments/ organizations.Possess the strong analytical skills, to be able to identify fraud risk at all levels in the company demonstrating an over-arching pragmatic approach.Self-motivated and capable of working with limited daily supervision; albeit with frequent interaction and feedback from/with his/her manager.Background:The ideal candidate will hold a recognized accountancy certification and have a seasoned mix of internal audit, risk, controls forensics and data analytics experience. Familiarity with Oracle, Hyperion and Workday are also beneficial. Below is a select list of qualifications and technical skills: Audit Data Analytics Expert• 5+ Years Audit/Data Analytics Experience • Big 4 Advisory/Consulting Experience Preferred • Master’s Degree Graduate Preferred• Professional certifications including CPA, CISA, CIA, CFE • Extensive data analytics expertise utilising IDEA, including extensive professional training, as well as providing training to others. • Expert in utilising Alteryx, including using Alteryx designer to create customized data analytics tools. (Alteryx is very similar to ACL: however, it is user friendly and analyses big data more efficiently.) • Data extraction expertise utilising SQL • Expertise working in the COBIT framework • Data visualisation expertise in QlikSense • Working knowledge of IFRS"}