{"jobID": "2817222625", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.fundrise.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company Overview  Fundrise is the first investment platform to create a simple, low-cost way for anyone to unlock real estate's historically consistent and exceptional returns. Our technology and world-class real estate private equity management provide access to a level of investment performance that only the wealthiest investors have enjoyed until now.  We exclusively hire creative, collaborative, and results-driven people with a penchant for bold ideas and an obsession with solving problems.  Job Summary  We're seeking a talented, passionate data analyst to play a key role in realizing our vision of a world-class online investing experience. A data analyst at Fundrise will think critically, question assumptions, and adapt to ever-changing requirements. They will take initiative and work with little supervision, but thrive on communication and constructive critique. In this role, you will:Use SQL to help better understand our growing investor baseMine large sets of data and develop recommendations based on your findingsUse analytics tools such as Mixpanel and Google Analytics to study user behavior for patterns and draw conclusionsMeasure how new features or site changes are driving changes in customer behaviorDevelop recommendations on new methods and tools to use to improve our data collection and analysis strategiesRegularly present your findings to relevant stakeholders on the engineering, product, design, marketing, and investments teams.Constantly question assumptions and look for quantitative explanations of events or trends we want to investigateIdeally, you are:Motivated. You have the energy and desire to track down answers to difficult questions and problem solve in creative ways.Flexible. At Fundrise we're defining a new industry and constantly evolving our business. You can adapt to and work within these shifting requirements and embrace the constant changes the job requires.Curious. You are naturally curious about things you don't understand and are always looking to learn from others.A strong communicator. You can effectively distill large amounts of data and nuanced analysis into clear and digestible findings both verbally and through writing and presentations."}