{"jobID": "2385114353", "jobLocation": "Sacramento_CA", "jobTitle": "Principal Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "132000", "jobDescription": "Basic Qualifications:Masters or Ph.D. (Computer  Science, Statistics, Engineering, Physics, Mathematics, Economics)Minimum 5 years' of Data  Science experience for Ph.D. candidates and 7 years for Masters candidatesMinimum 5 years' of work  experience in relevant domains (F&A;, Procurement, Fraud, Infrastructure  Analytics, eCommerce, Security, Retail, Supply Chain Health Care, Pharma,  Retail) with hands on experience handling data driven decisionsMinimum 5 years of experience  in at least one of the following Supervised and Unsupervised Learning,  Classification Models, Cluster Analysis, Neural Networks, Non-parametric  Methods, Multivariate Statistics, Reliability Models, Markov Models,  Stochastic models, Bayesian ModelsMinimum of 5 years of  experience in various statistical and machine learning models, data  mining, unstructured data analytics in corporate or academic research  environmentsMinimum 3 years of  experience in statistical software - , SAS, C, C++, Java , PythonMinimum 3 years of  programming experience (C, C++, Java, SAS, Python)Preferred  Qualifications:Familiarity with relational  databases and intermediate level knowledge of SQLAbility to think creatively to  solve real world business problemsAbility to work in a global  collaborative team environmentExperience leading or collaborating  with a team of data scientists in developing and delivering machine  learning models that work in a production settingKnowledge of UNIX or Linux  environmentsExperience working with large  data sets and tools like MapReduce, Hadoop, Hive, etc.Experience working with large  data streaming technologies like Spark, Flink, etc.Familiarity with relational  databases and intermediate level knowledge of SQLProficient verbal and written  communication skills in English Applicants for  employment in the US must Applicants have work authorization that does not now  or in the future require sponsorship of a visa for employment authorization in  the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa  or any other non-immigrant status).  Candidates who are  currently employed by a client of Accenture or an affiliated Accenture business  may not be eligible for consideration.  Accenture is an EEO and  Affirmative Action Employer of Females/Minorities/Veterans/Individuals with  Disabilities.  Equal Employment  Opportunity  All employment decisions  shall be made without regard to age, race, creed, color, religion, sex,  national origin, ancestry, disability status, veteran status, sexual  orientation, gender identity or expression, genetic information, marital  status, citizenship status or any other basis as protected by federal, state,  or local law.  Accenture is committed  to providing veteran employment opportunities to our service men and women."}