{"jobID": "2791911346", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist/Senior Research Physicist (Must Be US Citizen)", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": "Updated: TodayJob ID: 213881Status: Full-TimeRegular/Temporary: RegularLocation: San Antonio, TX, United StatesJoin the HJF Team! HJF is seeking a Research Scientist II/Senior Research Physicist to support the Naval Medical Research Unit – San Antonio (NAMRU-SA) in San Antonio, TX. NAMRU-SA is a major research center conducting medical and directed energy biomedical research, which focuses on ways to enhance the safety, health, performance and operational readiness of Navy and Marine Corps personnel and addresses their emergent medical problems in routine and combat operations. Incumbent leads directed energy bioeffects research, which consists of laser and radiofrequency safety and medical outcomes. Responsible for planning, conducting and promoting basic and applied research activities determining direct and collateral hazards from developing directed energy systems in military applications. Responsibilities Serves as team leader of a multidisciplinary government and contractor team and mentors scientists, engineers and technicians. Develops technical and management information, reports and briefings on progress, evaluation, analysis and recommendations of applications of high-energy laser systems, measurements and theory. Expands the technical data base and analytical technologies for assessing the operational and occupational risks from a wide range of systems, including lasers at any visible wavelength, all radiofrequency wavelengths, and their countermeasures. Develops scientific experimental designs addressing measurements of dynamic reflectivity, absorption and scattering properties. Serves as key communication link/technical liaison with other DOD agencies with regard to directed energy safety bioeffects. Translates DOD mission deficiencies/requirements into science and technology investment strategies and programs. Maintains a safe work environment with appropriate training of other personnel. Completes other projects as needed.Required Knowledge, Skills, and Abilities: Doctoral degree in biophysics or a related field. In depth knowledge of lasers and radiofrequency systems including recent advances in technology.  Specialized laser safety analysis techniques for high-energy laser systems and their deployment in a military setting. Knowledge of directed energy systems and methods employed to exploit electromagnetic radiation for warfighter applications so as to define problems and design experiments that will determine hazards associated with operational use of electromagnetic systems, including laser systems. Demonstrated ability and skill to prepare all aspects of professionally accepted scientific reports including methods, data interpretation, presentation, and significance of findings in relation to other findings by peers, and present effective oral presentations. Experience in the oversight and management of 6.1, 6.2, and 6.3 federal research programs, including the preparation, planning, execution and reporting of each type of research according to DoD requirements. Knowledge of and experience in contractual program management procedures and requirements. Knowledge of National Laser Safety Standards (ANSI Z136) and the committees that create these standards. Must have excellent communication skills and the ability to clearly convey scientific information and data to peers and flag level officers. Minimum Education/Training Requirements: PhD in Biophysics or a related field. Minimum Experience: 4 to 6 years related research experience. Physical Capabilities: work involves long periods of standing Required Licenses, Certification or Registration: Must be a US citizen. Current DoD SECRET Clearance with possibility of upgrading to Top Secret. Supervisory Responsibilities/Controls: May supervises technical support staff Work Environment: Laboratory environment; may require working evenings and weekends; may involve working with human and animal subjects. HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status.Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer."}