{"jobID": "2836644412", "jobLocation": "San_Diego_CA", "jobTitle": "eCommerce Data / eCatalog Analyst", "companyRating": null, "companyInfo": {"Website": "www.webshopmanager.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "eCommerce Data / eCatalog Analyst Web Shop Manager, an E-Commerce company located in Kearny Mesa, is looking to expand our data team! We're looking for a talented, detail-oriented, hard-working individual who enjoys a challenge. You'll gain great exposure working with our team and with our clients. Your primary role will consist of manipulating product data, documenting how-to guides, and working with our clients to troubleshoot data discrepancies. We will provide extensive one-on-one training to help you grow. This is not a data entry position!  Responsibilities Use Excel to standardize and structure product data into our formatResearch products to ensure data accuracyContact clients to troubleshoot data discrepanciesCoordinate projects with other departmentsMaintain departmental records of progress and completed work Qualifications Strong Excel skills (able to manipulate product data)Ability to troubleshoot difficult data formatsExcellent listening, verbal and written communication skillsVBA experience is a plusAutomotive knowledge is a plusE-Commerce product data experience is a major plus Perks for this role: The excitement of a startup environment in a solidified companyBeautiful laid back office environment in sunny San DiegoRegular delivery of fresh fruit, snacks, and drinksPotential future management experienceCompany outings and eventsStarbucks next door We absolutely love coming into work every day, at Web Shop Manager we work with an amazing team on some really incredible projects (other people think so too since they keep giving us awards). Our core purpose is to help our clients realize their dreams of success online while taking care of all of all the complex technical aspects of their business.  Web Shop Manager offers a competitive compensation and benefits to its employees including commission, PTO, health insurance, 401K, and holiday pay. We are an Affirmative Action / Equal Opportunity Employer."}