{"jobID": "2731289992", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Engineer", "companyRating": "4.5", "companyInfo": {"Website": "www.boingo.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Public (WIFI) ", "Industry": " Telecommunications", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Gogo, Demand Media, Cogent Communications"}, "estimatedSalary": "127000", "jobDescription": "Entrepreneurial-Minded Data Software Engineer Wanted: At Boingo, our engineers decide what technologies and methodologies to use when building and enhancing systems. Its great to have a choice! We trust you to figure out the best solution and get it done. Our technology stack includes Python, GO, Node, Linux, Rest APIs, AWS and Redshift. Were building systems for Boingos next generation data platform.  Were not looking for an order-taker. We need someone with engineering, problem-solving skills who will develop well thought out systems that are robust and extensible. If youre curious, structured & resourcefulness, this is the job for you. What does the job entail?Develop leading data ingestion technology using GO/node.jsDevelop data tables that support business questions and provide actionable insights to Boingos challengesDevelop solutions for complex problems exercising judgment within broadly defined practices and policies in selecting methods, techniques, and evaluation criteria.Design, develop and test feature enhancements to meet business requirements then package the changes/additions for release including implementation instructions.Work with QA team to define test plans; assist in testing related activities (planning/debugging/problem resolution) as neededMake recommendations regarding development processes, etc.Maintain and manage test, build and staging environments, acting as key front-line contact with internal Quality Assurance and Engineering Departments for on-going testing of software interface.Assist Director / Principal Engineer(s) with architectural related tasks.Got what it takes?Essential are excellent analytical and problem-solving skills, coupled with discretion and sound independent judgment.Self-motivation and discipline - the ability to work as a team member with other in-house and external developersMulti-discipline experience is key with at least two of the following:Expert Data platforms and ingestion, minimum of 2 yearsGO/node.js development experience, 1 year minimumPython development experience, 1 year minimumStrong relational data modeling skillsGood computer science fundamentals including data structures, algorithm design, concurrency issues, and performance assessment.Experience with issues of performance, memory usage, software quality, and other platform requirementsStrong verbal & written communication skillsExperience debugging code in device and emulation environmentsExperience with Subversion and/or GitDemonstrated expertise with Linux/Windows/OSX platforms.SQL knowledgeWhats in it for you?Boingo named one of the Best Places to Work in Los Angeles! - LA Business Journal, 2015Work with a talented, expert team, creatingthe future of wireless.Competitive pay: base + bonus+ Restricted Stock Units (RSUs)Health, dental, vision coverage401(k), including employer matchSubsidizedyour gym membershipsSubsidized wirelessdevice every two yearsAmazing WWHQ with 360-views of LAfrom Catalina to the Hollywood signFun extras: lots of yummy snacks, on-site massageand yoga, Bagel Mondays, Farmers Market produce on Tuesdays, keg on tap and much, much moreEmpowering corporate cultureMeet Boingo Boingo Wireless, Inc. (NASDAQ: WIFI) helps the world stay connected. Our vast footprint of Wi-Fi and cellular networks reaches more than a billion consumers annually. From airports and stadiums to universities and military bases, Boingo helps folks stay connected to the people and things they love.  Our team is creative, collaborative, and on the cutting edge of technology. (You can check out some of the awards weve won here. #humblebrag). But theres no doubt the secret sauce to Boingos success is our incredible team and culture. We take pride in having fun and staying healthy think summer picnics, bowling nights, in-house yoga classes, costume contests, massages and food trucks. Theres also a kitchen stocked with yummy snacks and drinks, and an incredible benefits package including equity, health, dental, vision, 401(k) match, unlimited vacation, 12 weeks paid parental leave, and more! Plus our award-winning headquarters in Westwood boasts 360-degree views of LA, from Catalina to the Hollywood Sign. Its no wonder weve been named among the Best Places to Work in LA three years in a row!  Boingo is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability."}