{"jobID": "2829109828", "jobLocation": "Washington_DC", "jobTitle": "English Language Arts (ELA) Test Developer", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "78000", "jobDescription": " Do you want to be a part of something innovative and cutting edge? If your answer is yes, then join our team of project managers, designers, and software specialists that are smart, creative and excited about the impact they are making on students education around the nation. American Institutes for Research (AIR) Assessment provides assessment services and technical assistance to school systems nationwide.  We are currently seeking English Language Arts (ELA) Test Developers to join on our team in the Washington, D.C. or Chicago, IL office.  The English Language Arts (ELA) Test Developer will lead state assessment projects and tasks that include the development and management of ELA Assessment programs. Responsibilities include managing the review, revision, and delivery of ELA test items; ensuring item quality; leading a team of ELA Test Developers and providing professional development and support for all team members; leading internal and external meetings with AIR review teams and clients; collaborating with AIR technical and operations staff; and developing pool production plans.  Qualified applicants will hold at least a Bachelors degree in a English or a related field. Must have a minimum of 4 years of experience teaching English and/or managing English item development functions within an education assessment environment. Strong knowledge and experience with the U.S. Education and Education Assessment system is required.  Required travel for this position ranges from 1 week to 6 weeks per year. Candidates should be able to travel as required for 2-3 days at a time, mostly in the June/July timeframe.  AIR Assessment is one of Americas leading K -12 educational assessment entities, currently holding prime contracts for educational testing and scoring in many states. AIR Assessment is a national leader in computer based adaptive assessments; a market that is rapidly growing. We focus on providing our clients with customized assessments that not only measure student achievement against state standards, but also provide meaningful score reports that can help students, parents, and educators address any areas of student weakness. Our environment is fast-paced and requires people at all levels who are willing to roll up their sleeves to get the work done on time while maintaining high quality. As a part of AIR, a not-for-profit organization, we are more than 1,900 people working to improve lives in communities domestically and around the world. Our mission calls for us to turn the best research into practice, which we do in every arena in which we work LI-DG1"}