{"jobID": "2818031683", "jobLocation": "Houston_TX", "jobTitle": "Institute Sr Research Scientist - Flow Cytometry - ECLIPSE", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " ECLIPSE (Evolution of Cancer, Leukemia and Immunity Project) is a novel organization within the MD Anderson Cancer Center, Houston, Texas, with the mission of making MDACC and its partners recognized leaders in the identification and development of innovative immunooncology therapies that will cure all hematologic malignancies.  The primary requirement for the Institute Sr Research Scientist - Flow Cytometry is an experienced and highly motivated individual with hands-on experience in generation and analyses of complex multi-parametric flow cytometry data. Such data generated from the team is expected to influence a broad array of decisions around target identification and validation. The successful candidate will participate in cross-functional research to design, perform and interpret assays for high throughput flow cytometry analyses. The candidate must have solid hands-on experience with designing and executing on various platforms used in flow assay analyses. The selected candidate will be expected to work at the bench and also manage direct reports. Previous experience in biotech/pharma is highly preferred.  The mission of The University of Texas M. D. Anderson Cancer Center is to eliminate cancer in Texas, the nation, and the world through outstanding programs that integrate patient care, research and prevention, and through education for undergraduate and graduate students, trainees, professionals, employees and the public.  Salary range: Min $112,000 - Mid $140,000 - Max $168,000  Key Functions Coordinate multidimensional flow cytometry evaluation from cells of patients with advanced hematological malignancies.Provide expert technical guidance in flow cytometry assay design, development, set up, trouble shooting, validation and clinical implementation to others on project/task groups. The candidate will be responsible for driving research programs in a multidisciplinary and exciting research team environment and supervise research activities of direct reports.The successful candidate will approach problems with curiosity and open mindedness; notice current processes/products needing improvement and generate new options using own technical expertise.Oversee development and quality of flow cytometry data generated both internally and externally.Ensure scientific excellence, quality and completeness of programs in a timely manner.Education Required: Master's degree in one of the natural sciences  Preferred: PhD in Biochemistry, Molecular Biology or a related discipline.  Experience  Required: Eleven years of relevant research laboratory experience. With preferred degree, five years of required experience.  Preferred: At least ten years of relevant research experience in the lab with supervisory experience in guiding direct reports. Demonstrated expertise in designing and performing multi-parametric complex flow cytometry assays; and acquisition/analysis of its data.Expertise in ensuring instrument standard operating procedures and maintenance of high value flow cytometry instruments.Experience in maintaining quality control, assuring compliance with regulations and standards of regulatory agencies, and managing special projects.In depth knowledge of commercial flow cytometry software including BD FACS Diva, FlowJo, FCS Express, Cytobank, ViSNE, TiSNE etc.Experience with techniques in cell biology including live cell imaging, immunohistochemistry and fluorescence microscopy would be desirable. Experience in using and maintaining flow sorting instruments.Significant experience managing a diverse team in high pressure situations.Ability to clearly communicate and operate in a highly matrixed environment.Proven track record of handling multiple high priority tasks in parallel with internal and external collaborators.Ability to provide subject matter guidance and train junior personnel in experimental and panel design, set up and data analysisHands on experience working with primary hematological samples, with working knowledge of basic molecular biology techniques.Extensive knowledge in key areas of flow cytometry, including knowledge of recent developments in flow cytometry methodologies as evidenced by publication in peer-reviewed journals.A strong understanding of flow cytometry theory and application in routine analysis, experience in single cell sorting for downstream genomic and transcriptomic analyses.Team player with outstanding communication skills and ability to interact with both internal and external collaborators. It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.htmlSDL2017"}