{"jobID": "2764721053", "jobLocation": "Encino_CA", "jobTitle": "Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.mpulsemobile.com", "Headquarters": "Encino, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "Company Mission and Highlights: mPulse Mobile, the leader in mobile health engagement, drives improved health outcomes and business efficiencies by engaging individuals with tailored and meaningful dialogue. mPulse Mobile combines technology, analytics and industry expertise that helps healthcare organizations activate their consumers to adopt healthy behaviors. With 9 years, 60+ healthcare customers, and more than a hundred million messages sent annually, mPulse Mobile has the data, the experience and the technology to drive healthy behavior change. Our Core Values:Model Integrity and CollaborationDrive Innovation and Thought LeadershipSupport Decision Making at All LevelsCreate Value for Clients by Empowering ConsumersImprove Customer Experience Through Simple DesignCelebrate Success OftenPurpose of the Role: The mission of the Data Science and Analytics (DSA) team at mPulse is to uncover insights from data in order to help drive better patient engagement and health outcomes. We are looking at everything from tactical optimizations to broad level strategic direction that is grounded in data evidence and heavy analytical rigor.  This requires a multidisciplinary blend of data science, behavioral science, and business strategy, all applied in tandem to discover key insights that lie hidden in our data sets. The Data Engineer will help build a research-based and data-driven approach to optimize mobile customer engagement. This role will focus on deep diving into a broad variety of exploratory initiatives to improve segmentation, tailoring and personalization of mobile engagement. Duties and Responsibilities:Querying and processing data using ETL tools, generating reports, and visualizing dataWorking with the data science team to refine and develop data science and analytics (DSA) product roadmapImproving team data report quality by cross-checking, cross-validation, documentation and code reviewsFollow our HIPAA compliant data policiesBuilding rich and interactive data visualizations used for internal analysis, reports, and in client presentationsUnderstanding and participating in analytics groups data mining techniques and analytics effortsAbility to deliver reports and visualizations within tight timelinesSkills, Abilities, and Experience:Required:Strong background and solid skills in interactive data visualization (Shiny, D3.js)1-2 years experience with Python (Pandas, NumPy, sciKit-learn), SQL and RStrong academic record, ideally in Economics, Mathematics, Computer Science, Engineering, Operations Research, Statistics or other quantitative fieldStrong team player with organizational skills, attention to detail and ability to collaboratePreferred:2-5 years of experience in a corporate, start-up, or research environmentExperience in research methods and exploratory data analysis, and familiarity with machine learning approachesIntense intellectual curiosity strong desire to always be learningAnalytical, creative, and innovative approach to solving difficult problems and a can-do attitude when outside your comfort zoneAble to work in a demanding deadline-oriented startup environmentThe Perks:Enjoy Unlimited PTO and flexible work hoursFull Vision, Dental and Healthcare - all individual premiums paid by mPulse!401K Program with a 4% matchWeekly team lunches to celebrate victoriesPaid Parking as well as Car Pooling incentivesLaptop fitness stationsPing pong conference table and FoosballFree snacks and drinksContact Information: mPulse Mobile, Inc.  Attn: HR Dept.  16530 Ventura Blvd, Suite #500  Encino, CA 91436  careers@mpulsemobile.com  (mPulse is an Equal Opportunity Employer)"}