{"jobID": "2801417485", "jobLocation": "Concord_CA", "jobTitle": "Quantitative Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.assetmark.com", "Headquarters": "Concord, CA", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " The responsibilities of the position are to take a lead analytical role in developing and maintaining quantitative models to help drive investment decisions within the Investment Strategies group at AssetMark. This will include development of implementable investment strategies, risk models and portfolio constructions tools for use in a systematic process that can be used for consistent and scalable investment decisions. With this exciting opportunity, you will own all aspects of quantitative development. Duties: Under limited supervision and following established procedures the position will undertake specified tasks, performing some or all of the following: Research and develop implementable investment strategies to deliver consistent out performance for tactical, outcome oriented and strategic solutions.Collaborate with the portfolio management team to research and develop multi-asset portfolio construction and optimization models.Collaborate with the investment strategies group for designing, developing and maintaining models, dashboards, reports and other collaterals for investment and risk committees.Assist with ad-hoc quantitative projects to update and improve the investment decision making and evaluation process The above description covers the most significant duties required. Other work assignments will be assigned as needed and will be in conformity with the general purpose above. Requirements:Bachelor’s degree from a fully accredited 4-year college or university, preferable majors in financial engineering, applied mathematics, statistics, engineering, physics, or other quantitative fields. (Master or PhD qualification a plus)3-5 years of professional experience in quantitative modeling and backtesting – experience within financial services preferred (understanding of investments, portfolio construction techniques and risk management desired)Strong working knowledge and experience with programming languages and databases, such as Python, R, Matlab, SQL, MongoDB.Experience with multi-asset models a plus.Experience with investment management tools like Bloomberg, FactSet, Morningstar Direct a plus.Strong verbal and written communication skills in order to communicate effectively with peers and strong interpersonal skills in order to work in collegial environment.Attention to detail and thorough working practices with the ability to apply quantitative methods into investment decision making theory to reach informed and logical decisionsInitiative and proactive approach, including the ability to recognize when and how to apply criteria guidelines, some of which are defined in very specific terms and some of which are more general.Ability to manage multiple priorities to timely and successful conclusion while adhering to deadlinesAbility to work independently with minimal support to investigate and resolve issues, perform analysis and document resultsFlexibility and constructive attitude toward change AssetMark, Inc. is a leading strategic provider of groundbreaking investment and consulting solutions created to serve independent financial advisors and help them create great outcomes for their clients. Through a consistent program of engagement, education and community-building, AssetMark brings like-minded advisors together to share their ideas, experiences and solutions. This collaboration guides our development of investment, client relationship and practice management tools that advisors can tap to help clients achieve their investment objectives and life goals.  We are always seeking bright, creative, energetic individuals who want to learn and grow with the company. AssetMark is an innovative organization, delivering the best services in the industry. We offer a rewarding work environment, competitive salaries, full benefits, and excellent opportunities for career growth. We are headquartered in the San Francisco Bay Area. We also have regional offices in Chicago, IL, Phoenix, AZ, Encino, CA, and State College, PA. Become a part of our growing team today!"}