{"jobID": "2816534768", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Part-Time 2nd Shift Warehouse Associate - $12.00 per hour!", "companyRating": "3.4", "companyInfo": {"Website": "www.notionsmarketing.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 1938", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "REQUIRED DAYS: Monday, Tuesday & occasional Saturdays 3pm-11:30pm. Other days as needed.POSITION SUMMARY: A Warehouse Associate performs various activities within the warehouse, primarily selecting, fulfilling and consolidating customer orders in a pick to tote operation, along with performing miscellaneous duties throughout the warehouse operation. Once an associate is placed in the warehouse a department/general function will be assigned, however department/assignments will change with the business need. This position requires a great deal of efficiency and accuracy in order to maintain production standards and efficiency rates.KEY RESPONSIBILITIES: Pick/pull product for customer ordersLift totes, boxes, and pull carts up to 50 poundsMay be required to stock; place newly received product correctly on shelves in an organized mannerVerify product and quantities match order invoiceScan all items selected for internet ordersCommunicate to supervisor any inconsistencies with product flow or order detailsBox all items for internet orders; fill boxes with proper packing material as neededMINIMUM REQUIREMENTS:Must be at least 18 years or olderHigh School Diploma or equivalent Demonstrated consistent work historyExcellent attendance recordREQUIRED KNOWLEDGE, SKILLS AND ABILITIES:Ability to work in a warehouse environmentAbility to stand/walk for an entire shift (8+ hours)Ability to stoop, bend, twist and grip on a regular basisBasic math skillsBasic computer skills (navigating/keyboarding)Basic matching skills (letter/number combinations)Ability to work well independently with minimum supervisionHigh attention to detailThrives in a fast paced environment PHYSICAL AND ENVIRONMENTAL REQUIREMENTS The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. May be required to lift and/or move up to 50 pounds; may occasionally need to lift over 50 pounds (with or without assistance). The associate is frequently required to sit/stand/walk. While performing the duties of this position, the associate is subject to a distribution setting where temperatures may vary, and the noise level may be moderate to high."}