{"jobID": "2597936758", "jobLocation": "San_Clemente_CA", "jobTitle": "Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.intraedge.com", "Headquarters": "Chandler, AZ", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "113000", "jobDescription": " Looking for talented machine learning engineers to build the next-generation,  AI-based, software for smart-buildings. You will be working in a collaborative, fast-paced  environment utilizing the latest tools, methodologies and best practices in analytics, machine  learning, big data and software engineering.  RESPONSIBILITIES  ● Develop solutions for real world, large-scale problems in the smart-buildings space.  ● Work with large, disparate datasets - provide insights, develop algorithms, organize data.  ● Take responsibility for your projects and pride in your work.  ● Ask hard questions and challenge assumptions to ensure that we’re solving the right problems.  ● Develop in Python/Java and other applicable technologies, providing high quality of code.  REQUIRED SKILLS  ● MS or PhD in Computer Science, Software Engineering, or related technical disciplines  ● Experience in machine learning techniques, statistics, data structures, algorithms, and software  engineering.  ● Strong coding skills in Python and Java.  ● Ability to thrive in a fast-paced, high-growth, ever changing startup environment.  ● Ability to work in the U.S.  COMPENSATION  An attractive compensation package will be made available to outstanding candidates.  LOCATION  This is a remote job from any location in the U.S, reporting to our office in San Clemente, CA.  INTERVIEW TIPS  We’re technology aficionados! Show us your previous work/projects, tell us what you are passionate  about. Demonstrate your practical skills in machine learning / data science / programming.  CORPORATE OVERVIEW/CULTURE  Site 1001 is a high performance building management and operations software platform that uses core  building information, building systems and sensor data in combination with artificial intelligence to put the  “smart” in “smart buildings.” Cloud-based, mobile first, and location-aware, Site 1001 helps owners,  operators and facilities manager save money, improve building performance and extend building and  asset life by delivering critical facilities information to the right person in the right place at the right time.  Backed by a revolutionary building AI technology called ‘Carl,’ Site 1001 users can improve efficiency,  slash FM costs, and extend equipment lifecycles without increasing workloads. Site 1001 has created a  purposeful environment of mutual respect and free thinking that champion’s innovative solutions while  encouraging fresh new ways of thinking about diverse challenges and opportunities. Site 1001 strives to  be an organization that possesses the innovative and entrepreneurial energy of a technology company  while incorporating a high sense of urgency and a focus on execution that is a hallmark of the company’s  legacy. Much of our team is remote and we allow our engineers to work from home."}