{"jobID": "2814424212", "jobLocation": "Plano_TX", "jobTitle": "Specialist Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.perspecta.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2018", "Type": " Company - Public", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DescriptionEvery day at Perspecta, we enable hundreds of thousands of people to take on our nations most important work. Were a company founded on a diverse set of capabilities and skills, bound together by a single promise: we never stop solving our nations most complex challenges. Our team of engineers, analysts, developers, investigators, integrators and architects work tirelessly to create innovative solutions. We continually push ourselvesto respond, to adapt, to go further. To look ahead to the changing landscape and develop new and innovative ways to serve our customers.Perspecta works with U.S. government customers in defense, intelligence, civilian, health care, and state and local markets. Our high-caliber employees are rewarded in many waysnot only through competitive salaries and benefits packages, but the opportunity to create a meaningful impact in jobs and on projects that matter.Perspectas talented and robust workforce14,000 strongstands ready to welcome you to the team. Lets make an impact together. Perspecta has an immediate need in our US Public Sector group for a Specialist Data Analyst - Secret Clearance Eligible in Plano, TX or Pontiac, MI. Job Description: Analysis of data and construction of models to evaluate policies, processes, and metrics, and develop algorithms and decision support capabilities using statistical analysis, simulation, and other operations research techniques.QualificationsQualifications:Strong foundation in statistical data analysis, and experience using advanced capabilities in MS Excel and MS Access.2 years experience as a practicing analyst, OR a Masters degree in a relevant filed, OR relevant Navy experience.  Ability to obtain a security clearance.Preferences are: Experience with data analysis using large data sets, in any tool/language.Experience in Operations Research, simulation, and/or modeling.Experience in coding in C# or VB.NET.Experience with statistical tools like SPSS, SAS, or R.Experience in modeling and building Data Visualization techniques to present large data sets.Experience working with MS SQL Server database.Familiarity with SQL Server Analysis Services and/or Business Objects.Knowledge of Navy veteran or Navy manpower, personnel, training, and education related business functions.Psychology or psychometrics background.EEO Tagline: Perspecta is an AA/EEO Employer - Minorities/Women/Veterans/Disabled and other protected categories"}