{"jobID": "2833297729", "jobLocation": "Sacramento_CA", "jobTitle": "Environmental Scientist/Engineer/Geologist (Associate Level)", "companyRating": "3.0", "companyInfo": {"Website": "www.erm.com", "Headquarters": "London, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " ENVIRON, AECOM, Golder Associates"}, "estimatedSalary": "43000", "jobDescription": "ERM is looking for a motivated, detail-oriented Environmental Scientist, Engineer or Geologist to join our growing team in Sacramento, CA. Working under the direction of project managers and partners, the successful candidate will work on interesting site investigation and remediation projects throughout Northern California and other US locations. You may also have the opportunity to work on a variety of projects, covering the full spectrum of ERMs services.This is a great opportunity to work with ERM's technical experts to implement the latest engineering and remediation technologies, while building the required experience to obtain your professional registration.RESPONSIBILITIES:Conduct manage and oversee field work, including sampling, drilling, well installation, remedial pilot tests, construction oversight, and remedial system operation and maintenance.Assist in groundwater and system performance monitoring.Compile and evaluate data and assist in report preparation.Prepare environmental compliance plans, permits, and reports for air quality, hazardous waste, spill prevention, storm water, and wastewater.Perform Phase I and II environmental site assessments to support property transfer transactions.Assist in ensuring compliance with all federal, state and local regulations.Focus on team project delivery, taking direction primarily from project managers.Work within quality/budget/schedule expectations and scope-specific assignments.Communicate with subcontractors, regulatory agents, tenants, and clients during field activities.REQUIREMENTS:BS in chemical, civil, environmental, or mechanical engineering, geology, hydrogeology or related degree.3 to 8 years experience, including willingness/interest in field assignments.Environmental field work experience and 40-hour OSHA HAZWOPER certification.Strong commitment to safety, including following established Health and Safety protocols.Valid drivers license and a good driving record.Effective written/verbal communication and organization/analytical skills; experience recording/writing detailed technical data and reports a plus.Ability to work independently and as part of a team.Detail-oriented with mechanical aptitude and hands-on trouble-shooting/problem-solving skills.Ability to multi-task, maintain flexibility, travel, and work independently with minimal supervision.Professional registration a plus.Local candidates preferred. Qualified candidates will be contacted by email, and requested to complete a pre-interview questionnaire. Based on review of these responses, shortlisted candidates will be invited for interviews. Thank you for your interest in ERM!ERM does not accept recruiting agency resumes. Please do not forward resumes to our jobs alias, ERM employees or any other company location. ERM is not responsible for any fees related to unsolicited resumes."}