{"jobID": "2753402689", "jobLocation": "Carlsbad_CA", "jobTitle": "Data Analyst (Business Intelligence)", "companyRating": "3.1", "companyInfo": {"Website": "www.gia.edu", "Headquarters": "Carlsbad, CA", "Size": "1001 to 5000 employees", "Founded": " 1931", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "Job Description:JOB OVERVIEW The Business Intelligence team is responsible for the build and support of GIA’s global data warehouse. The team is a fundamental part of GIA’s effort to become a fully digitalized company within the next five years. The team partners with various business units to enable the services required to deliver software, data and business intelligence services.  The team is looking to add a Data Analyst to be part of a global team of Business/Data Analysts, Data Scientists and Application Developers. The individual will have the opportunity to develop his/her technical knowledge and skills while ensuring the applications we build are meeting the highest standards of quality and supportability. ESSENTIAL DUTIES AND RESPONSIBILITIESDesign, architect and build digital systems that integrate data from various sources.Maintain the performance and integrity of existing data structures in the data warehouse.Write SQL scripts, stored procedures, functions and views to prototype new datasets.Work closely with Business/Data Analysts and Data Scientists to assist them with data requests.Design and deliver ad-hoc and scheduled reports.Understand the existing ETL (Extract, Transform and load) workflows and assist in building future workflows.Other duties as assigned.TECHNICAL COMPETENCIES (Knowledge, Skills & Abilities)Must have working knowledge of PL/SQL and experience with Oracle databases.Experience working with large datasets as well as experience analyzing volumes of data through basic Microsoft Excel functions, like macros and pivot tables.Preferred knowledge of any Business Intelligence tool like OBIEE, Tableau, QlikView etc.Preferred knowledge of ETL tools like Informatica.Office Suite, e.g., MS Word, Excel, PowerPoint; and e-mail.Excellent grammar, written and verbal communication skills.Ability to maintain and foster sensitivity and respect for a culturally diverse work environment.Ability to display supportive behavior and communicate positively regarding department goals and objectives.Ability to deal effectively with a variety of personalities to establish and maintain effective working relationships.EDUCATION AND EXPERIENCE Bachelor's degree or equivalent required; or combination of education and related experience. Master’s degree preferred. PHYSICAL REQUIREMENTS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  While performing the duties of this job, the employee is regularly required to sit and talk or hear. The employee frequently is required to use hands to finger, handle, or feel. The employee is occasionally required to stand, walk, and reach with hands and arms. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.  WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually moderate. Additional Locations:Disclaimer: This job description indicates in general terms, the type and level of work performed as well as the typical responsibilities of employees in this classification and it may be changed by management at any time. Other duties may also apply. Nothing in this job description changes the at-will employment relationship existing between the Company and its employees. Distribution of this item outside of the Company without an authorized release is a violation of Company policy."}