{"jobID": "2823026209", "jobLocation": "Downers_Grove_IL", "jobTitle": "Data Analyst, Regulatory Affairs", "companyRating": "3.0", "companyInfo": {"Website": "www.adtalem.com", "Headquarters": "Downers Grove, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (ATGE) ", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " As the Data Analyst for Regulatory affairs, your primary purpose is to ensure that all institutions and business units operate in compliance with federal, state, organizational and divisional regulations and policies. You ensure that regulatory requirements and business changes that impact the regulatory environment and compliance policies are appropriately incorporated and communicated. Work with colleagues in all institutions and functional areas to ensure processes, procedures, reports, materials and communications are developed in compliance with federal, state and internal standards and regulations.Conduct testing to evaluate the efficiency and effectiveness of controls.Execute controls in high-risk areas to mitigate non-compliance risk exposure.Provide information and guidance to colleagues throughout the organization on regulatory requirements and internal policies.Represent regulatory affairs in meetings in order to provide compliance guidance for organizational programs and initiativesAnalyze new and amended state and federal regulations and accreditor requirements to determine the organizational impactDevelop, implement, and maintain the organization's written compliance policies and procedures to ensure requirements remain observant to all current federal and state, regulations and internal standards.Ensure that corrections in the areas of non-compliance are made timely and accurately; escalates unresolved items to manager as needed.Work on specialized assignments such as call monitoring, file reviews, research assignments, report development, data analysis, regulation monitoring and analysis, and marketing material review and approval.Work with all functional areas as needed to develop new reporting capabilities and improve existing processes; provide prompt analysis where applicable.Train colleagues and external partners on compliance with relevant policies, procedures and regulatory requirements.Complete other duties as assigned. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Below are the minimum requirements of the education, experience, knowledge, and skills required to competently perform in this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Bachelor's degree requiredAt least 2 years of experience in a federal/state regulated environment; experience in higher education regulatory compliance preferredExcellent organizational, interpersonal, critical thinking, analytical, verbal and written communication skillsIs a detail-oriented problem-solverCan demonstrate a consistently great work ethic in a high productivity environmentCan travel 10%Experience with Microsoft Office, Outlook, Excel and internet applications.Writing samples required We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing. Thank you for applying for this outstanding opportunity today.  PI102953696"}