{"jobID": "2802044503", "jobLocation": "Chicago_IL", "jobTitle": "Workforce Analytics Consultant", "companyRating": "3.1", "companyInfo": {"Website": "www.cnoinc.com", "Headquarters": "Carmel, IN", "Size": "1001 to 5000 employees", "Founded": " 1979", "Type": " Company - Public (CNO) ", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": "Job TitleWorkforce Analytics ConsultantLocationCarmel, INJob DetailsPosition Overview This position serves as the central point for all human resources and workforce metrics, analytics, and insights. The position serves as a key expert in understanding, extrapolating, and standardizing large amounts of data in CNO’s complex data environment. The analyst provides regular and ad hoc analyses for workforce demographics, recruiting, engagement, retention, workforce development and talent management. Insights generated will be used to evaluate HR programs, and help the unit carry out the business strategy for overall effectiveness.  This role will be expected to lead the design and creation of data sets that will assist members of the Human Resources organization in drawing key insights from our various data sources. This role will also be responsible for creating dashboards, visualizations, algorithms, and other business tools. The analyst uses external surveys and benchmarks to bring context and perspective to the data and deploys predictive analytics to forecast for more informed decision-making. The analysis helps to solve complex challenges and forecast future workforce planning needs. The focus on detailed analytics is complemented with visualizations to bring the numbers to life through graphical presentations and reporting.  This position works closely with all areas of human resources (talent acquisition, talent management and development, internal communications, employee relations & business partnership) and interacts with other business units in the organization. Incumbent will also lead and contribute to special projects. ResponsibilitiesOwn and drive analyses of HR data to identify trends; interprets data and communicate key findings to HR and business partners.Translate findings into succinct, actionable business insights.Perform analyses and regular reporting for key stakeholders including executives.Create and execute recurring and ad hoc queries/reports/dashboards from the various data warehouse universes and databases to ensure timely delivery of data and insights.Respond to requests for HR metrics data, analysis and insights by running reports, consolidating and analyzing data, interpreting results and presenting findings.Analyze complex business problems and assess how automated reporting mechanisms can be implemented to solve them and determines the most appropriate tools to use to analyze and report.Effectively collaborates and communicates with HR team members and business partners to define deliverables, timelines, and responsibilities.Use knowledge of HR systems (ex. Workday) in data identification and extraction.Stay abreast of external quantitative and qualitative data and trends. Bring research and external data to bear on internal analysis.Assist business partners as needed with the creation of analytic models and presentation of data and intelligence.Understand and apply continuous improvement processes, policies, and procedures and internal control standards to ensure primary source reporting.Implement an HR-wide common project management framework.Develop project plans to drive project schedules, run meetings, collaborate, coordinate across stakeholders, cross teams to commit project goals, timelines and deliverable; implement project management process and methodologies; track and mange action items, issues and risks.Own communications to project members and stakeholders on progress, issues, and risks. including regular, status updates, and minutes of meetings.Coordinate across HR stakeholders to launch solutions, on time and on budget.Leads the development of automated and reusable routines for extracting requested information from numerous database systems.RequirementsEDUCATION Bachelor's degree in related field and a minimum of six years of progressively responsible professional experience requiring analytical and project management skills. Graduate degree desirable. COMMUNICATIONSStrong verbal communication skills, including the ability to listen carefully and ask thoughtful questions to drive new thinking.Excellent written and presentation communications skills; experience tailoring messages to employees, managers and executive.PERSONAL EFFECTIVENESSPassion for using data to identify patterns and trends and to propose solutions to challenging problems; intellectually curious.Ability to deal with highly confidential employee information with great discretion.Excellent interpersonal skills to work with employees, managers and executives at all levels.Ability to consult with colleagues and business partners to determine best way to meet analytical and project management needs.Strong business and financial acumen.EXPERIENCE AND TECHNICAL REQUIREMENTSExperience in managing projects of all sizes and across multiple functions.Ability to research and analyze data to arrive at valid conclusions, recommendations, and plans of action.Track record of delivering on time with speed and accuracy.Strong mathematical and analytical capabilities required.High level proficiency in Microsoft Office suite, including advanced Excel and PowerPoint skills, as well as other software such as Tableau. Experience with HRIS systems."}