{"jobID": "2819806867", "jobLocation": "Lansing_MI", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.afgroup.com", "Headquarters": "Lansing, MI", "Size": "1001 to 5000 employees", "Founded": " 1912", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "SUMMARY The main focus for this role is developing/monitoring models used in multivariate analysis, linear modeling and data mining. This would include developing and testing predictive risk models; interact, understand and articulate the complex mathematical and computational learning concepts (to appropriate staff).In addition, this position will be expected to understand the business goals (growth) and capital strength and make strategic recommendations to enhance business processes and reflect our strategic goals. RESPONSIBILITIES/TASKS:Responsibilities will be multi-disciplinary and will include:Provides technical and quantitative analysis for predictive modeling group.Assists in statistical data mining and actuarial research by applying advanced statistical concepts.Uses computer technology, computer modeling, spreadsheet applications, software tools, and programming languages.Participates in and is responsible for projects requiring advanced statistical analyses, innovative research, mathematical calculations, and technical skills.Conducts research utilizing predictive modeling.Interprets data and identifies correlations using both univariate and multivariate analysis.Participates in and is responsible for advanced projects.Presents findings and recommendations to appropriate groups.Prepares and delivers summary reports to the relevant or affected areas within the company. Helps to determine what actionable steps can be taken based on the findings.Communicates and trains users on model results. Develops custom, explainable models that enhance business processes to reflect corporate goals, experience, and current market conditions using pattern recognition, evolutionary computation, and machine learning algorithms. Document model requirements.Examine and analyze data to determine optimal modeling approach.Identify candidate risk factors.Build models using training, test, and cross-validation data sets.Share model results.Finalize model.Delivers conclusions.Deploy and maintain models with or without the assistance of the IT departmentADDITIONAL RESPONSIBILITIES/TASKS FOR PREDICTIVE MODELER II:Oversees the creation, development and maintenance of our models.Further involvement in communication of predictive model results to other departments.Involvement in the implementation of predictive model results into the appropriate system.Works with, mentors and provides direction (as necessary) to Predictive Modeler I.Participates in development of annual budget, goals, objectives and systems.ADDITIONAL RESPONSIBILITIES/TASKS FOR DATA SCIENTIST:Further involvement in the implementation of predictive model results into the appropriate system.Additional communication to all affected departments. This includes the creation of appropriate documents (PowerPoint presentations, etc.) to be used in the communication of predictive model results to the company.Lead the deployment and maintenance of models with or without the assistance of the IT department.ADDITIONAL RESPONSIBILITIES/TASKS FOR SENIOR DATA SCIENTIST:Leads communication of predictive model results to company.Leads implementation efforts for assigned predictive model projects.Trains predictive modelers I and II in predictive modeling and other analytical tasks.Performs ad hoc analysis to identify issues with existing models.Designs and leads implementation efforts for the maintenance procedures for our models.EMPLOYMENT QUALIFICATIONS:EDUCATION: Bachelor's degree in insurance, math, economics, statistics, or computer science required. Advanced degree in statistics, actuarial science, or applied mathematics preferred. Continuous learning, as defined by the Company's learning philosophy, is required. Certification or progress toward certification is highly preferred and encouraged. EXPERIENCE:PREDICTIVE MODELER I: With proper education credentials, no experience is required; however, workers compensation, predictive modeling and actuarial experience are preferred. ADDITIONAL EXPERIENCE FOR PREDICTIVE MODELER II: 2 years of research, modeling or actuarial experience required. Workers compensation experience is preferred. Demonstrated ability in statistical modeling and data mining techniques (GLM, clustering, decision trees, etc). Strong understanding of modeling software and data manipulation techniques. Strong understanding of insurance related modeling and data. Strong project management skills. ADDITIONAL EXPERIENCE FOR DATA SCIENTIST: 4-6 years of research, modeling or actuarial experience required. Workers compensation experience is preferred. ADDITIONAL EXPERIENCE FOR SENIOR DATA SCIENTIST: 7-10 years of research, modeling or actuarial experience required. Workers compensation experience is preferred. SKILLS/KNOWLEDGE/ABILITIES (SKA) REQUIRED:Excellent interpersonal, organizational and communication skills.Ability and proficiency in the use of computers and company standard software specific to position.General familiarity with the following software: SAS, R, SQL.Strong database management skills.Ability to provide direction to other department analysts.Ability to use independent judgment and initiative and to anticipate needs of executive and department, accomplishing tasks without direction.Ability to work effectively as a member of a team.Resourceful problem solving skills and desire to succeed.Knowledge of insurance and underwriting techniques, agency and policyholder needs.Ability to establish workflows, manages multiple projects, meet necessary deadlines, and work without supervision.Exercise sufficient discretion and independent judgment with a wide degree of creativity and latitude.Ability to apply the principles of independent logical thinking to define problems, collect data, establish facts, draw valid conclusions and make actionable strategic recommendations.Ability to manage responsibilities as unexpected pressures/dilemmas arise.Ability to comprehend consequences of various situations and make appropriate individuals aware of same for decision making.Ability to maintain confidentiality.WORKING CONDITIONS: Work is performed in an office setting with no unusual hazards. Minimal travel may be required.  The qualifications listed above are intended to represent the minimum education, experience, skills, knowledge and ability levels associated with performing the duties and responsibilities contained in this job description.  We are an Equal Opportunity Employer. Diversity is valued and we will not tolerate discrimination or harassment in any form. Candidates for the position stated above are hired on an \"at will\" basis. Nothing herein is intended to create a contract.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled "}