{"jobID": "2723070408", "jobLocation": "Mountain_View_CA", "jobTitle": "Cloud AI Research Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "156000", "jobDescription": "We do research differently here at Google. Our team of Research Scientists aren't cloistered in a secret lab but are embedded throughout the engineering organization, allowing them to setup large-scale tests and deploy promising ideas quickly and broadly. Ideas may come from internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. From creating experiments and prototyping implementations to designing new architectures, Research Scientists work on real-world problems including artificial intelligence, data mining, natural language processing, hardware and software performance analysis, improving compilers for mobile platforms, as well as core search and much more. But you stay connected to your research roots as an active contributor to the wider research community by partnering with universities and publishing papers.  You manage individual project priorities, deadlines, and deliverables, adapting to changes and setbacks in order to manage pressures, demonstrating and applying theories through research efforts to develop new and improved products, processes, or technologies.  As a Research Scientist on the Google Cloud AI and Machine Learning (ML) team, you will be working on innovating and delivering the most advanced machine learning techniques to impact the world via Google Cloud. You’ll have the opportunity to collaborate with the best AI talents in the company, both inside cloud as well as Google Research, DeepMind and other organizations. Our quest: To democratize AI for everyone and every business. Your research could make a huge difference to many verticals: Ecommerce, Transportation, Healthcare, Finance, Content/Entertainment, Energy, and more.  The goal of Cloud ML is to innovate and deliver the best AI tech to impact the world via Google Cloud. We're developing Cloud ML on Google Cloud Platform, in close partnership with a number of teams across the company. Cloud is one place where data, computing and algorithms converge.  There is always more information out there, and the Research and Machine Intelligence team has a never-ending quest to find it and make it accessible. We're constantly refining our signature search engine to provide better results, and developing offerings like Google Instant, Google Voice Search and Google Image Search to make it faster and more engaging. We're providing users around the world with great search results every day, but at Google, great just isn't good enough. We're just getting started. Responsibilities Participate in cutting-edge research in artificial intelligence and machine learning applications.Develop solutions for real-world, large-scale problems. Qualifications Minimum qualifications:"}