{"jobID": "2608955266", "jobLocation": "Hopewell_NJ", "jobTitle": "Principal Scientist, Translational Bioinformatics, Head of Clinical Flow Cytometry Bioinformatics", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " We are seeking a highly motivated bioinformatician with significant academic and/or industry experience to lead our clinical flow cytometry bioinformatics team. This team will be responsible for analysis of cytometry based assays for all phases of clinical studies and trials at BMS. Results from this group will influence a broad array of decisions around patient stratification, dose optimization, and indication prioritization. Responsibilities The successful candidate will have oversight for all aspects of analyses of cytometry data including: data processing and management; analysis of and hypothesis generation from large multi-parameter cytometry data sets; providing subject matter advice to collaborating teams; targeted innovation; oversight of vendor interactions; quality control; line management of several Ph.D. level bioinformaticians.  The candidate will interact and collaborate with scientists within Discovery, Translational Bioinformatics, IT, Translational Medicine, and Clinical Development.  Enterprise Mindset: The ability to make decisions, set priorities and share resources based on what will benefit the whole. Capable of building and maintaining networks within and outside of the organization. Qualifications:Ph.D. in a technical field (e.g. in Physics, Mathematics, Engineering, Statistics, Biology, or similar) plus 6 years of experience in an academic, government, or industry settingSignificant hands-on experience with complex data quality control and analysisExperience with commercial Flow Cytometry software including BD FACS Diva, FlowJo, FCS Express, Cytobank, ViSNE, TiSNE, etc.Excellent programming skills (e.g. R, Pyton, Perl, NodeJS)Experience with and understanding of multi-parameter data analysis, with a focus on hands-on application of these skillsAbility to act as an energetic and respectful collaborator in a highly matrixed environment. Ability to communicate with bench scientists, bioinformaticians, information technologists, and cliniciansProven track record in handling multiple parallel internal and external collaborationsPrior line management experience preferred but not requiredSDL2017"}