{"jobID": "2831127329", "jobLocation": "Chicago_IL", "jobTitle": "Senior Retail Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.jameshardie.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1888", "Type": " Company - Public (JHX) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " CertainTeed, USG, Louisiana-Pacific"}, "estimatedSalary": "83000", "jobDescription": "Now’s your chance to move your career in a new direction – upward!Consider this... As theRetail Market Intelligence expert you'll develop fact-based, data driven insights to identify opportunities for growth and better operating model in James Hardie’s retail business. This role will provide direction to leadership in the retail sales organization based off of patterns they’ve discovered. You will also help design and monitor experiments in stores and compare results to a control group of retail stores to understand impact of price, promotion, placement and rep activity. Manage a system of metrics, reports and key initiatives including competitive benchmarking, ad hoc analyses and report development.  Fiber cement is the fastest growing category within the US residential cladding market and James Hardie Building Products has operations in the United States, Australia, New Zealand, Asia, and Europe. No matter where we operate, our goal is to remain at the forefront of the fiber-cement industry, capitalizing on our global leadership in building products and manufacturing and technology for both new home construction and remodeling. To be considered for this position, you must have:Bachelor’s degree in a technical or quantitative discipline (e.g., finance, economics, statistics) and/or relevant quantitative work experience5 years of analytical experience working with large data sets. Proven ability to synthesize large data sets from multiple sources into actionable insights that business leaders can understandProficiency in Excel, SQL or other relational database toolsExperience structuring market tests to measure the impact of different variables (e.g., price elasticity, inventory levels, promotions)Exceptional problem solving and analytical skills and a natural curiosity for understanding the “why” behind the business resultsExperience in CPG or retail industry a plusExperience with using and creating reports / dashboards in BI tools such as Tableau, SAP Business Objects or related data visualization tools a plusResponsibilities Serve as the analytical lead for James Hardie’s retail business Analyze data through data mining and data auditing in order to provide actionable insights to the retail business and contribute to setting the strategy for the segmentDevelop and track key metrics to identify opportunities for improvement; track trends, patterns and correlation in cases of complex data setsPerform A/B testing and run scenarios based on different hypotheses to understand the correlation between activities and results to optimize James Hardie’s retail strategy in each market, specifically, price, promotion, placement and rep activity.Ensure the quality and accuracy of data used by the businessCollaborate with Sales leaders to ensure that appropriate changes are made based on analyses and that key learnings are incorporated into the sales processProvide information on performance trends and competitive intelligence to senior business leaders to support strategic planning, forecasting and goal setting Develop, streamline and automate key reports used to communicate business performance Participate in the design, development and testing of new analytical reporting and business intelligence toolsEnsure that executive dashboard and reporting accurately portrays business performance and trendsPrepare concise data reports and data visualizations and present to upper managementAutomate existing reports and develop business rules to drive exception reportingSet standards for best practices in terms of how to collect, manage and publish data for the businessManage the evolution of the analytical roadmap for James Hardie’s retail business At James Hardie Building Products, we are looking for people who are Smart, Driven, and Real. We hire leaders and innovators – not employees or staff. James Hardie is a $1.9B world leader in fiber cement building products and technology, and our success and quality of our products is attributed to the talent of our people. What’s next?“Come home to Hardie” and apply now! #LI-KEP  James Hardie is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran status, among other things, or as a qualified individual with a disability. Equal Employment Opportunity is the law."}