{"jobID": "2826740962", "jobLocation": "Los_Angeles_CA", "jobTitle": "Program Manager, Los Angeles Community Engagement", "companyRating": "3.0", "companyInfo": {"Website": "www.aspca.org", "Headquarters": "New York, NY", "Size": "501 to 1000 employees", "Founded": " 1866", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " The Humane Society of the United States"}, "estimatedSalary": "58000", "jobDescription": " Please make sure to attach both a resume and cover letter to complete your application. Summary: The Los Angeles Community Engagement program works collaboratively with animal welfare organizations, government agencies, community based organizations and community members with the goal of keeping pets and people together and improving their welfare. Through a direct partnership with the Los Angeles County Department of Animal Care and Control, the ASPCA provides services to pet owners facing relinquishment to county shelters in Downey and Baldwin Park service areas.  The Program Manager supports the Community Engagement program by managing data entry, event logistics, inventory management, vehicle and location maintenance needs and other tasks as needed. This position will also provide more strategic administrative support by analyzing data to derive trends and advise on program direction. This position will be based 90% onsite and 10% at a remote home office in Los Angeles and will require frequent travel between the Downey and Baldwin Park Animal Care Center ASPCA sites.The Program Manager must be willing to work a flexible schedule (Tuesday to Saturday or Sunday to Thursday).Responsibilities:Responsibilities include, but are not limited to the following:Administration (50%)Manage all administrative aspects of pet retention and improved welfare program.Assist the Program Director in overseeing various program budgets, including processing and tracking invoices and expenses.Maintain database of promotional and informational materials, in collaboration with creative services and external vendors.Manage internal repository for staff policy and procedures. Developing and standardizing policies with the Program Director and overseeing ongoing document maintenance to ensure all policies are up to date.Other administrative tasks as needed.Reporting & Data Analytics (30%)In partnership with the Strategy & Research team, enter, prepare and clean data, and run basic monthly reports to facilitate measurement of impact.Conduct detailed data analysis of quantitative and qualitative data. Identifying and depicting trends for both internal and external audiences to help inform priorities and guide our program’s direction.Support monthly reporting and compilation of compelling stories that depict programmatic work.Operational Support (20%)Participate in community engagement activities at the shelters and in the surrounding communities.Manage equipment and supplies at shelter sites and outside storage units, including ordering, vendor relations, and stocking, which requires the ability to bend, crawl, and kneel.Manage vehicles including regular maintenance, registration and record keeping.Exemplifies the ASPCA’s Core Values:Has Commitment and dedication to improving the lives of animalsDemonstrates Ownership and feels responsible for outcomesBelieves in Team – that we are stronger togetherSeeks to Elevate others and reimagine what is possible.Focuses on Impact, specifically making change for animalsAdditional Information5+ years of administrative or office experience1-2 years of experience with data collection, analysis and tracking,Data visualization experience, including the development of charts, graphs and pivot tables in Excel is strongly preferredFlexibility in work schedule; weekend and off-hours required.Animal handling experience a plusMust provide a valid CA driver’s license upon hire and pass a motor vehicle history check demonstrating a safe driving historyQualifications:Ability to lift up to 50 lbs., carry up to 25 lbs., stand for long periods and work outside in various conditions, Computer literacy with particular proficiency in MS Word, Excel, PowerPoint and Access, Must possess strong written and oral communication, client service and organizational skills, Strong team player, as well as ability to work independentlyLanguage:English (Required), SpanishEducation and Work Experience:Bachelors, High School Diploma or GED (Required)Our EEO Policy: The ASPCA is an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, national origin, ancestry, gender, gender identity or expression, age, marital or domestic partner status, citizenship status, sexual orientation, disability, genetic information, military or veteran status, or any other characteristic protected by applicable federal, state or local laws, regulations or ordinances.  Applicants with disabilities may be entitled to a reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. A reasonable accommodation is a change in the ASPCA’s standard application process, which will ensure an equal employment opportunity without imposing undue hardship on the ASPCA. Please inform the ASPCA’s People Team if you need an accommodation in order to complete any forms or to otherwise participate in the application process.  Individuals seeking employment are considered without regards to race, color, creed, religion, sex, national origin, ancestry, gender, gender identity or expression, age, marital or domestic partner status, citizenship status, sexual orientation, disability, genetic information, military or veteran status, or any other characteristic protected by applicable federal, state or local laws, regulations or ordinances.  ASPCA is an Equal Opportunity Employer (M/F/D/V). Please don’t forget to attach your resume and cover letter to complete your application."}