{"jobID": "2769863869", "jobLocation": "Downers_Grove_IL", "jobTitle": "Healthcare Benefit Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.advocatehealth.com", "Headquarters": "Downers Grove, IL", "Size": "10000+ employees", "Founded": " 1995", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " Advocate Health Care, the largest health system in Illinois and one of the largest health care providers in the Midwest. Our Corporate Support & Operations Services are equally committed to advancing Advocate's goal of building lifelong relationships with patients by delivering the best health outcomes and highest level of service through an integrated approach to care and wellness. What You Will Do: Responsible for designing and developing metrics, reports and analysis to drive key business decisions. Responsible for the compilation and analysis of internal and external benefits data used to develop Advocate benefits programs (retirement, welfare, wellness, disability and worker's compensation). Associate is expected to provide a link between raw data, data extraction, analysis and solutions. Associate will receive various requests for data analytics so must have strong task prioritization skills in addition to statistical and critical thinking skills. Ability to collaborate with various teams (internal and external), understand and manage vast amounts of data, develop reports, monitor usage patterns, conducts analysis of current benefit programs, provide predictive trending and analyze trends and costs are key aspects of this role. Accountabilities: Compile and analyze data from multiple sources into various reports to support strategies within the benefits function and to make benefit recommendations. Required to conduct statistical data analysis to interpret quantitative data.  Conducts market analysis and benchmarking activities to assess competitiveness with market trends, support decisions and the delivery of benefits.  Additional Responsibilities  Vendor Management What Will You Need:Bachelors Degree or equivalent with 5 or more years of experience in benefit administration.Must have proven statistical analytical background in either education (actuarial, finance, accounting) or experience (OD, HR, Metrics)Proficient in software such as Access, Powerpoint, Lawson, Word, Windows. Advanced experience in Excel. HR, Benefits and/or Finance/Accounting related certification preferred Must be professional, self~motivated, possessing a high level of judgment skills and initiative.Ability to work independently and maintain flexibility.Ability to work collaboratively within team environment.Ability to deal in a calm demeanor with multiple independent requests, issues and problems.Strong customer service orientation.Accuracy and attention to detail are critical.Ability to manage multiple projects simultaneously.Strong communication and organizational skills.About Advocate Health Care Advocate Health Care, named among the nations Top 5 large health systems based on quality by Truven Analytics, is the largest health system in Illinois and one of the largest health care providers in the Midwest. Advocate operates more than 250 sites of care, including 12 hospitals that encompass 11 acute care hospitals, the states largest integrated childrens network, the states largest emergency and Level I trauma network, one of the areas largest home health care companies, and the regions largest medical group. Advocate Health Care has 4 teaching hospitals and is a not-for-profit, mission-based health system affiliated with the Evangelical Lutheran Church in America and the United Church of Christ."}