{"jobID": "2816384137", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.fanaticsinc.com", "Headquarters": "Jacksonville, FL", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Lids"}, "estimatedSalary": "118000", "jobDescription": " Data Scientist Location(s)  San Mateo, CA Job Code 3156 # of openings 1Apply NowAs the global leader in licensed sports merchandise, Fanatics is changing the way fans purchase their favorite team merchandise by partnering with top leagues, clubs and soccer brands worldwide to offer the largest collection of timeless and timely gear from every pro and college team online, on your phone, in stadiums or on-site at the world’s biggest sporting events. A top 50 Internet Retailer Company, Fanatics comprises the broadest online assortment by offering hundreds of thousands of officially licensed items via its Fanatics (www.fanatics.com), FansEdge (www.fansedge.com) and Kitbag (www.kitbag.com) brands, as well as the largest selection of sports collectibles and memorabilia through Fanatics Authentic (www.fanaticsauthentic.com). A multi-channel company, Fanatics operates more than 300 online and offline stores, including the e-commerce business for all major professional sports leagues (NFL, MLB, NBA, NHL, NASCAR, MLS, PGA), major media brands (NBC Sports, CBS Sports, FOX Sports) and more than 200 collegiate and professional team properties, which include several of the biggest global soccer clubs (Manchester United, Real Madrid, Chelsea, Manchester City). The company's in-venue and event retail portfolio includes the NBA, NHL, NASCAR, Wimbledon, Kentucky Derby, The Ryder Cup, Manchester City, Texas Longhorns, Pittsburgh Pirates and New Jersey Devils, allowing fans to experience a seamless shopping experience across online, mobile and physical store locations.  We are looking for someone who is passionate about applying machine learning and statistics techniques to solve business problems and build scalable marketing solutions. Candidates need to demonstrate their ability to crunch complex data into automated algorithms that have direct and measurable impact. Successful candidates will be capable of driving a project end-to-end, from idea generation and brainstorming to completely implementing and sustaining analytical solutions. The role requires a broad knowledge of machine learning algorithms, creativity to invent and customize when necessary, and effective communication with business stakeholders. Responsibilities:Build, deploy, and sustain predictive models in marketing pipeline.Dive into complex data sets to analyze trends, identify opportunities and improve upon existing marketing solutions.Support the marketing function by providing ad-hoc analysis that improves decision-making and business performance.Collaborate cross-functionally with diverse teams (e.g. marketing operations, technology, merchandising, procurement, apparel design/production) to understand business objectives and design and implement analytics deliverablesEffectively communicate analytical solutions to non-technical stakeholders and senior leadershipQualifications:Bachelor’s degree is required. Master’s degree in relevant fields such as Statistics, Machine Learning, Computer Science with Artificial Intelligence focus is preferredDetail-oriented, with strong analytical, technical and problem solving skillsStrong SQL skillsStrong communication skillsKnowledge of advanced statistics and machine learning and ability to apply the knowledge to building predictive models in R, Python or SparkSuccessful applicants should have familiarity with and/or a strong interest in learning relevant technical skills such as: General purpose programming languagesState-of-the-art machine learning algorithms2 - 4 years experience"}