{"jobID": "2831117195", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Engineer", "companyRating": "2.7", "companyInfo": {"Website": "www.dfsco.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Public (DFIN) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": "Donnelley Financial Solutions (NYSE: DFIN) provides software and services that enable clients to communicate with confidence in a complex regulatory environment. With 3,500 employees in 61 locations across 18 countries, we provide thousands of clients globally with innovative tools for content creation, management and distribution, as well as data analytics and multi-lingual translations services. Leveraging advanced technology, deep-domain expertise and 24/7 support, we deliver cost-effective solutions to meet the evolving needs of our clients. Company Info  Donnelley Financial Solutions (DFS) is a leading financial communications services company with approximately 3,500 employees and 2015 revenues of $1.1 billion. DFS serves capital market and investment market clients by delivering products and services to help create, manage and deliver accurate and timely financial communications to investors and regulators.  Position Summary  Donnelley Financial Solutions is seeking a Senior Data Engineer to join our Data and Analytics Team. The ideal candidate is a self-starter who is effective working with large development teams in a highly collaborative environment.  Job Description Develop, maintain, test, and troubleshoot data solutions, including Database Development, ETL / Data Migration Development, and Big Data Development.Collaborate with technical and non-technical resources to solve issues and develop new functionality.Participate in Requirements Gathering and Analysis meetings with Team Members, Internal Customers, and Stakeholders.Mentors and assists Data Engineers and Data Developers as needed. Required Skills Database development skills (SQL, T-SQL)SQL Server 2012 or laterSQL Server 2016 Experience is a plusETL / Data IntegrationAzure and Cloud Based TechnologiesSQL AzureSSISSQL Performance Tuning and OptimizationTroubleshooting of complex data solutionsBig Data Technologies including (Azure Data Factory, Spark, NoSQL, Hadoop, HDInsight, Big Data Architecture) a plusData AnalysisRequirements AnalysisBachelor’s Degree in Computer Science, Information Technology or relevant experience.5 + Years development experience with SQL and TSQL using SQL Server 2012 or later.5 + Years development experience using ETL / Data Integration Tools (SSIS preferred).3 + Years of experience performing Data Analysis / Data Profiling.5 + Years of requirements analysis experience.5 + Years of experience working in environments with formal SDLC (Software Development Life Cycle) experience, 3 + years of experience working on teams utilizing Agile Methodologies.3 + Years authoring technical and functional documentation.Experience working on large teams a plus.Experience with Project Planning and more specifically sprint planning a plus.It is the policy of Donnelley Financial Solutions to select, place and manage all its employees without discrimination based on race, color, national origin, gender, age, religion, actual or perceived disability, veteran&apos;s status, actual or perceived sexual orientation, genetic information or any other protected status.  If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access jobs.dfsco.com as a result of your disability. You can request a reasonable accommodation by sending an email to AccommodationRequests@dfsco.com."}