{"jobID": "2686557538", "jobLocation": "San_Francisco_CA", "jobTitle": "Customer Service Representative", "companyRating": "2.3", "companyInfo": {"Website": "www.ccfi.com", "Headquarters": "Dublin, OH", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "15", "jobDescription": " Position Summary: Process loan and check cashing transactions with use of phone, computer, reference material. Receive and pay out money. Keep records of money and negotiable instruments involved in various transactions. Provide exceptional service to customers. Learn and follow compliance requirements. Create a positive, respectful, friendly environment among peers, superiors and customers. Tasks: Assess risk and make decisions, within established limits, to accept or reject a financial transaction.  Examine, evaluate and processes loan applications and check cashing transactions after following verification procedures.  Promote and cross sell other established products and services as appropriate to customer needs.  Obtain recourse as necessary. Calculate daily transactions using computers, calculators, other machines and and tools in the store. Compile and report financial data.  Meet growth goals through internal and external marketing, including via the phone. Meet Net Revenue goals through contact calls, establishing promise to pays. Balance currency, coin, and checks in cash drawers at end of shifts.  Take vault management responsibility when assigned. Follow company policies, procedures, and service standards.  Research, compile, and prepare reports, correspondence, and other information required by management or governmental agencies.  Utilize reports to improve performance. Audit transactions, conduct store audits to ensure compliance.  Complete Compliance Captain responsibilities. Communicate positively and effectively with customers. Deescalate negative customer situations through use of professional behavior.  Personally comply with governmental regulations as well as company policies, procedures, laws, and maintain compliance within the location.  Uphold security procedures on a daily basis. Perform simple maintenance tasks.  Be punctual to shifts and maintain good attendance.Skills / Competencies: Oral Expression - The ability to communicate information and ideas in speaking so others will understand. Oral Comprehension - The ability to listen to and understand information and ideas presented through spoken words and sentences. Speech Clarity - The ability to speak clearly so others can understand you. Numeric Reasoning- Ability to read, understand and discuss numerical reports. Active Learning - Understanding the implications of new information for both current and future problem-solving and decision-making. Patience. Active Listening - Giving full attention to what other people are saying, taking time to understand the points being made, asking questions as appropriate, and not interrupting at inappropriate times.  Speaking - Talking to others to convey information effectively.  Reading Comprehension - Understanding written sentences and paragraphs in work related documents.  Critical Thinking - Using logic and reasoning to identify the strengths and weaknesses of alternative solutions, conclusions or approaches to problems.  Service Orientation - Actively looking for ways to help people.  Time Management - Managing one's own time.  Monitoring - Monitoring/Assessing performance of yourself, other individuals, or organizations to make improvements or take corrective action.  Judgment and Decision Making - Considering the relative costs and benefits of potential actions to choose the most appropriate one.  Instructing - Teaching others how to do something.  Social Perceptiveness - Being aware of others' reactions and understanding why they react as they do.  Active Learning - Understanding the implications of new information for both current and future problem-solving and decision-making.  Complex Problem Solving - Identifying complex problems and reviewing related information to develop and evaluate options and implement solutions.  Negotiation - Bringing others together and trying to reconcile differences.  Persuasion - Persuading others to change their minds or behavior.  Troubleshooting - Determining causes of operating errors and deciding what to do about it. Salesmanship- Skill in selling; skill in ersuading peopleExperience And Education: High School Diploma (or GED or High School Equivalence Certificate); Minimum 1 year experience in the retail, financial or service industry; Hands on cash management experience with vault or safe responsibilities; Supervisory experience preferred.Physical Requirements: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Physical Requirements: While performing the duties of this job the employee is frequently required to stand for long periods of time, walk & sit. The employee is occasionally required to reach with hands & arms and climb or balance. The employee must occasionally lift and or move up to 25 pounds."}