{"jobID": "2821651124", "jobLocation": "Dallas_TX", "jobTitle": "Senior Data Scientist (Startup)", "companyRating": null, "companyInfo": {"Website": "www.averityteam.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are hiring a Senior Data Scientist to join a fast-growing startup that has the backing of one of the largest financial companies in the world. We are growing our new office in Dallas and want to hear from you! What's The Job? As a Senior Data Scientist on our team you will be working with a wide variety of data sets (candidates consistently name this as one of the main reasons they want to join us).  You will be using your advanced machine learning and data science skills to build out models to support our efforts. We are a true startup environment, so you will be working shoulder-to-shoulder with the rest of the team from the ground up to develop our models.  We are a data research and analytics company that is launching a new product. Our specialty has been in supporting financial institutions, and we are now expanding out our business to other industries.  You will be using your coding/software engineering skills extensively as well, so be prepared to get your hands dirty with code. You should also want to utilize the latest in machine learning methodologies.  We are located headquartered in Manhattan and have an office in Dallas, and we are growing this year, and we hope to add 3-4 more data scientists to our team by the year's end. Salary • $140,000 - $160,000 (plus generous bonus)  • Full Benefits (Medical, Dental, Vision) What's the Company? We are a cutting-edge data research company headquartered here in New York City (Midtown East). Our clients range from small hedge funds to larger financial institutions and beyond. We work in a true startup environment, which means we work collaboratively and hard, and are aiming to do big things! Skills • Excellent programming skills (Python, Java, C++, etc...)  • Experience with Machine Learning  • You should be a self-motivated, startup-like individual  • Ideally you have a Master's or PhD in a STEM field How to Apply Please apply here or via email at: Matt.Stabile@AverityTeam.com"}