{"jobID": "2830945144", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.usitsol.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Demonstrated knowledge of Upstream in one or more of the following domains (Field Operations, Production Management, Reservoir Management, Field Development or Drilling & Completions).  Demonstrated & recognized as architecture practitioner in the Upstream business  Demonstrated knowledge of Upstream Architecture Process & Methodology  Demonstrated ability to work effectively on teams, respecting others' opinions, valuing diversity, building consensus and assisting others to accomplish team goals and objectives  Exceptional communication skills both written and verbal  Must be a team player and able to work with and through others. Ability to work effectively at all levels in an organization  Strong desire to establish Standards of Best Practice  Ability to write & understand SQL script in Oracle and SQL Server environment and knowledge of ANSI SQL in general  Ability to use the database interface tools such as TOAD, SQL*Plus, SQL Server Management Studio  Ability to design and query Analytic services  Technical Skills -Advanced knowledge of data warehousing philosophies (e.g. Inmon & Kimball) Proficient knowledge of service oriented architecture towards data/information as a service concept. Advanced skills with the Microsoft/ Oracle Data Management and Business Intelligence platform and tools. Knowledge on ETL, especially SSIS.  Understand Data Architecture concept in decoupling Required Qualifications: Bachelor's Degree or equivalent in Management Information Systems, Information Technology, Computer Science, Engineering, or related discipline  A minimum of 2 years' experience in Data Architect involving Oil and Gas domain, and overall 8 years in Data Warehouse and Business Intelligence solutions  Possess the blended ability of understanding business/operational know-how, as well as technology know-how  Demonstrated experience with large-scale business solution lifecycle"}