{"jobID": "2830788922", "jobLocation": "Dallas_TX", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.hubgroup.com", "Headquarters": "Oak Brook, IL", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Company - Public (HUBG) ", "Industry": " Transportation & Logistics", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " J.B. Hunt, C.H. Robinson, Schneider"}, "estimatedSalary": "52000", "jobDescription": " JOB SUMMARY: Conceptualize, design, implement, and support standard and custom logistics reports and dashboards for Mode internal and external customers utilizing TMS tools, data warehouse tools and visual analytics tools. Manage the design and construction of high-quality analytics, queries, and procedures for supporting data integrity and securing high quality data across the business network. Maintain a solid understanding of reporting tools, data warehousing structures, query languages, economics, and operational performance measures. ESSENTIAL JOB FUNCTIONS:Work with internal (IBOs, IT, Corporate Management ) and external customers to customize and design reports utilizing SQL, MS Access, MS Excel, TRITAN, Mercury Edge or other reporting tools.Collect, clean, and transform data into valuable reports and provide insightWork with internal and external customers to customize and design dashboards and visual analytics utilizing Tableau Software or other visual analytics toolDetermine which dimensions, measures, and details should be used when creating reports along with how to structure the informationConduct reports and DBs demonstrations and discussions with internal customers and upper managementExplore, analyze, and communicate trends in dataSupport the conversion of the existing Tableau DBs and Business Objects reports where applicable to utilize the new Azure DW.Support the development and implementation of Data Governance programOther duties as assignedMINIMUM QUALIFICATIONS:Bachelor of Science in information systems, logistics, transportation, operations management, operations research, or economicsUnderstand basic data warehouse structures1-3 years work experience in operational or financial reportingPossess high level of competency and demonstrable skills in Microsoft Access, Excel, PowerPoint, SQL, SAP Business Objects, and Tableau or other visual analytics toolsAbility to work in a highly visible role that will interact with individuals at all organizational levels, internal and externalSuperior \"hands-on\" problem solving skills with ability to work on their own and coordinate with multiple internal partnersWorking knowledge of Transportation Management Systems, implementation methodologies, systems integration, communications technologies, and relational database designDetail oriented with strong written and verbal communication skillsAbility to diagnose technical issues and maintain focus on resolutionsThird-party logistics or logistics-related consulting is helpfulOTHER BENEFITS: Hub Group provides the opportunity to participate in a variety of outstanding benefits. In addition to a business casual office atmosphere, the company offers the following benefit programs: 401(k) plan with company match3 Medical PlansDental and Vision plansCompany paid basic life/AD&D; insuranceSupplemental life/AD&D; insuranceCompany paid short term disabilityVoluntary short term disabilityCompany paid long term disabilityVoluntary term life, critical illness and accident insurance policiesFlexible spending accounts (FSA)Health savings account (HSA)Scholarship awardPaid Time Off (PTO)Holiday Pay We are committed to a policy of Equal Employment Opportunity and will not discriminate on any legally recognized basis, including but not limited to race, age, color, religion, sex, marital status, national origin, citizenship, ancestry, non-job related handicap or disability or veteran status. Hub Group is committed to working with and providing reasonable accommodation to individuals with disabilities. If, because of a disability, you need a reasonable accommodation for any part of the employment process, please send an e-mail to careers@hubgroup.com and let us know the nature of your request and your contact information. PAY TRANSPARENCY NONDISCRIMINATION PROVISION The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information."}