{"jobID": "2697561571", "jobLocation": "Washington_DC", "jobTitle": "Senior Software Engineer (.NET)", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "99000", "jobDescription": " Be part of something innovative and cutting edge. Join our team of more than a hundred software engineers, designers, project managers and software specialists that are smart, creative and excited by what they do. Some of our ground-breaking work includes:advanced computer-adaptive algorithms (only one thats peer-approved in the country)mobile support for the user interfaceslearning management systems with social media featuresuser interfaces that are universally accessible to people with or without disabilitiesinnovative, machine-scorable items The American Institutes for Research (AIR) is a leading professional services firm with a growing software engineering and product development team. We design and build things that are inspiring and make a real impact in the online testing industry. We are currently seeking Senior .NET Software Engineers to join our team in Washington, DC.  The Contract to Hire Senior Software Engineer will be an integral part of the software engineering and product development team within AIR. This group of professionals provide custom software solutions for our clients as well as internal support systems. Much of the work we perform is new development, so the right candidate will have the skills needed to perform full life-cycle software development. This includes participation in requirements gathering, application and database design, system documentation, writing and unit-testing efficient code, and deployment. REQUIRED QUALIFICATIONS:Bachelors and/or Masters degree in Computer Science8+ years of development experienceExperience with relational databases and writing SQL queries preferredSolid understanding of object oriented (OO) analysis and design principles and demonstrated proficiency/expert knowledge in OO designProficient/expert knowledge in design of multi-tiered web-based systemsProficiency in development of highly efficient and high performance distributed software systemsExcellent analytical skillsHighly detail-orientedGood communication skillsAbility to work well on a team as well as independentlyPREFERRED QUALIFICATIONS:Experience with machine learning, natural language processing and computational linguisticsExperience using statistical methods for data mining on vast quantities of data.Professional experience utilizing J2EE technologiesWorking knowledge of .NET (C#, ASP.NET), Python and statistical packages."}