{"jobID": "2779580932", "jobLocation": "Pasadena_CA", "jobTitle": "Research Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.caltech.edu", "Headquarters": "Pasadena, CA", "Size": "1001 to 5000 employees", "Founded": " 1891", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " Research Scientist Job Category  Fulltime Regular ExemptOvertimeEligible  Exempt Benefits Eligible  Benefit BasedApply NowCaltech is a world-renowned science and engineering institute that marshals some of the world's brightest minds and most innovative tools to address fundamental scientific questions. We thrive on finding and cultivating talented people who are passionate about what they do. Join us and be a part of the diverse Caltech community.Job SummaryThe Beckman Institute at the California Institute of Technology seeks a highly qualified and motivated Research Scientist for projects focused on the discovery of novel adeno-associated viruses (AAVs) for gene therapy applications in the Beckman Institute Resource Center for CLARITY, Optogenetics and Vector Engineering (CLOVER Center: clover.caltech.edu). These funded projects will use and adapt the CREATE methodology our group developed (Chan et al Nature Neuroscience 2017; Deverman et al. Nature Biotechnology 2016) for custom AAV capsid engineering. The work will be fast-paced, challenging and collaborative, and therefore requires that the candidate is well organized and has strong problem-solving, interpersonal and communication skills. It is essential that the applicant has hands-on experience with molecular cloning, cell culture, and animal models. The ideal candidate would also have experience with recombinant virus production, fluorescence microscopy, directed evolution, computational biology and analysis of large datasets. Candidates should have, or be working toward, a doctoral degree in a biological science and a strong record of productivity. The position requires outstanding organizational skills, as well as experience in the managing of a life science laboratory and collaborations. The candidate will work independently under general guidance from the supervisor and must exhibit strong problem solving skills (e.g. be able to accurately recognize irregularities in experimental results and modify experiments as needed). Must be accurate, efficient, organized and keep detailed records. Strong written and verbal communication skills and the ability to work in a multi-disciplinary environment are essential. Two positions are available immediately. Competitive pay and benefits, based on experience level.Job DutiesThe research involves the planning, discovery and evaluation of new AAV vectors and will require the researcher to perform  –Literature search and independent project planning  –Proprietary virus library design (by novel directed evolution methods)  –Molecular cloning, DNA and titering  –Cell culture for recombinant AAV and possibly lentivirus production and validation  –Discovery of novel variants with unique properties - requires functional quantitative evaluation of vectors in vitro and in vivo  –In vivo vector administration, tissue processing, DNA/RNA isolation, immunohistochemistry and microscopy  Manage a life science laboratory and collaborations  –Train laboratory personnel and coordinate daily operations for smooth functioning  –Run teaching workshops for outside collaborators  –Work closely with the PI and other laboratory staff to adapt methodology to fit research requirements and ensure that research timelines are kept on track  –Guide collaborators on best choices for their experimental paradigms  The researcher will also be expected to  –Write manuscripts and create figures for publications  –Prepare grant progress reports and figures and text for grant applications  –Present findings at group meetings and participate in lab discussions  –Keep careful recordsBasic Qualifications– BS degree in biology, biological engineering, or a related field  – Prior hands-on experience with molecular cloning, DNA/RNA isolation, mammalian tissue/cell culture, qPCR, transfections  – Working knowledge of sequence analysis tools such as BLAST, SnapGene/DNA Star/Vector NTI and primer design software  – Must have prior experience with mouse models  – Must be self-motivated and organized  – Must have excellent communication and interpersonal skills – the project requires a coordinated effort within and across laboratories  – Excellent communication skills (writing and verbal) and the ability to interact professionally with students and all levels of staff as well as with external collaborators  – Ability to handle a variety of tasks simultaneously  – Ability to resolve technical problems and adapt easily to changing needs and priorities  – Must possess a high level of initiative Preferred Qualifications– MS or PhD in biology, biological engineering, or a related field  – Experience working with recombinant viral vectors under BSL2 conditions  – Hands on experience with fluorescence and confocal microscopy  – Stereotaxic injections  – Experience with immunohistochemistry, in situ hybridization  – Experience with computational biology and analysis of next generation sequencing datasets  – Familiarity with high throughput screens/selections, DNA library design, and directed evolution  – Excellent organization, time management and project management skillsRequired Documents– Resume"}