{"jobID": "2821026893", "jobLocation": "Washington_DC", "jobTitle": "OSINT SME", "companyRating": null, "companyInfo": {"Website": "www.kingfishersys.com", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Government", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Kingfisher seeks an exceptionally qualified Senior Open-Source Intelligence (OSINT) Subject Matter Expert (SME) to support the Headquarters Department of the Army (HQDA) Office of the Deputy Chief of Staff G2 (ODCS-G2) for formulating Policy, Programming, Budgeting, Evaluating and conducting Oversight of the Army OSINT Activities. The contract requires a Sr. OSINT SME with previous extensive experience in fusing intelligence information from Human Intelligence (HUMINT), Counterintelligence (CI), Signals Intelligence (SIGINT), Geospatial Intelligence (GEOINT), Imagery Intelligence (IMINT), Measurement and Signature Intelligence (MASINT), All-Source Analysis, as well as Collection and Requirements Management. The incumbent is required to understand, process, and implement OSINT strategic polices, regulations, and congressional (public) law across the force. Must be able to work independently and be able to develop and provide guidance to Senior Executive Staff with regard to open-source and social media architecture as well as knowledge in existing Intelligence Community (IC) enterprise tools. The OSINT SME requires proficiency in writing policies and DoD guidance IAW DoD and United States Army standards. The SME shall provide knowledgeable assessments on current and emerging tools exploring the Publically Available Information (PAI) domains, including social media and its implications to US Armys global operation.  The incumbent will participate and represent the ODCS-G2 within the IC and provide guidance on OSINT related topics. Shall have knowledge of the National and Defense open-source community; must be able to provide expertise with implementing OSINT operations throughout the US Armys tactical and strategic mission. Represent the ODCS-G2 at executive level meetings and briefings regarding all facets of OSINT. Work hand in hand with the Joint Service military structure/organization with regards to Defense OSINT Enterprise and draft, evaluate, and submit OSINT policies and documentation for staff actions. Position Responsibilities: This position requires on-demand strategic and sometimes tactical guidance on OSINT operations critical to the United States Army OSINT program. This position requires extensive researching, interpreting, evaluating and integrating open-source information to assess the relevance and significance of developments within the overall US Army global operations. Will perform liaison functions with personnel in other intelligence agencies and commands (including law enforcement (LE) personnel) and participate in interagency / international meetings and conferences; provide analysis of OSINT to include interaction with national authorities, reporting entities, collectors, collection managers and operators at national level, and the LE community.Operate computer based analysis systems and tools and use a variety of analytical applications, computer systems, and software and ancillary equipment including basic DoD intelligence automated applications, tools and intelligence data bases.Required qualifications:Active TSSCI security clearance.Kingfisher Systems, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, protected veteran status, among other things, or status as a qualified individual with a disability."}