{"jobID": "2570782068", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Data Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.healthline.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " WebMD Health, Everyday Health, Mayo Clinic"}, "estimatedSalary": "164000", "jobDescription": "About UsHealthline.com is the fastest-growing health information site on the planet. Every month, over 85 million people count on our talented teams to support, guide and inspire them toward the best possible health outcomes for themselves and their families. We create authoritative content thats highly relevant, approachable and actionable. And we complement that with a culture of genuine compassion. In short, were changing the consumer health information business and we need exceptional people like you to help us do it. If you share our vision for a stronger, healthier world please explore Healthline Media and lets talk.As a Sr. Data Engineer, you will be working closely with the Sr. Director of Data Engineering as one of the very first members of the data team. It's an opportunity to have significant input into the technical direction and architecture of our new data platform. You will also work closely with product management and various business owners to build an infrastructure that is critical to the success of the company.Responsibilities Build and support our data pipelines to help power our dashboards, reports and analytics teams.Work together with the engineering and product team come up with better and more efficient ways to collect and process the data generated.Collect and process data from our ad, event aggregation, and various 3rd party systems.Required Skills5 years experience in data warehouses, building pipelines, ETL, data cleansing, reporting tools etc.Proficiency with Python and SQL required.Proficiency with MySql.Experience with Spark, Hive, Hadoop and MySql.Experience with AWS EMR, EC2, S3.Experience with one or more of the following, dynamoDB, BigQuery, Redshift or Snowflake. Preferred Skills Knowledge of statistics.Adtech experience a big plus.AWS Lambda functions.AWS Kinesis / Firehose.AWS Data Pipeline.Tableau.Healthline Media is committed to a policy of Equal Employment Opportunity and will not discriminate on any legally recognized basis, including but not limited to race, color, religion, sex, sex stereotyping, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), gender, gender identity, gender expression, national origin, age, mental or physical disability, ancestry, medical condition, marital status, military or veteran status, citizenship status, sexual orientation, genetic information, or any other status protected by applicable law. We also provide reasonable accommodations to qualified individuals with disabilities in accordance with the Americans with Disabilities Act as amended and applicable state and local law. No person shall be excluded from participation in, be denied the benefits of, or be subjected to discrimination on the basis of these factors. If you require an accommodation in the application process, please advise your recruiter."}