{"jobID": "2583602385", "jobLocation": "Washington_DC", "jobTitle": "Subject Matter/Functional Expert/Network Architect-Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": "Clearance Level Must Currently Possess:Top Secret w/SCI eligibilityClearance Level Must Be Able to Obtain:Top Secret SCISuitability:PolygraphJob Family:Engineering & SciencesJob Description:Generally recognized as a leader in the industry in their area of expertise; sought out by others in the area of expertise for advice and guidance.Provide expert support, analysis, research, and advice into exceptionally complex problems, and processes relating to the subject matter.Serve as technical expert on executive-level project teams providing technical direction, interpretation and alternatives.Expertise is in a particular area of Information Technology (e.g., Cybersecurity, Information Systems Architecture, Telecommunications Systems Design, Architecture, Implementation, Information Systems Integration, Software Development Methodologies, Security Engineering, Communications and Network Systems Management).Perform highly specialized and technical tasks associated with the most current and cutting-edge technologies.May serve as a technical consultant to a project or a number projects dealing with area of technical expertise.Coordinate with contract management and Government personnel to ensure the problems have been properly defined and the solutions satisfy customer needs.Network Architect/Engineer responsible for the development, configuration, and maintenance of the Stoneghost Network.Training and Certificates:DoD 8570 compliance or information assurance certification commensurate with technical objectives and services required within the task order.Applicable software or hardware training and certifications commensurate with the technical objectives, services required, and IT environment specified within the task order.Skills and Tasks:Exceptionally Complex - researches and evaluates new concepts and processes to improve performance.Analyzes cross-functional problem sets, identifies root causes and resolves issues.Assists more junior level technicians, specialists, and managers in their activities.Can perform all tasks of lower level technicians, specialists, and/or managers.Serves as key technical expert in an area of expertise or across multiple areas, providing strategic consulting to internal or external clients. Builds and maintains relationships with client, customer staff, and end users. Analyzes client and customer business needs and provides guidance on industry trends and opportunities. Researches and proposes products, systems, and solutions as appropriate. May participate in sales presentations.DESIRED QUALIFICATIONS: BS or equivalent + 9 yrs related experience, or MS + 7 yrs related experience# of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Telecommuting Not AllowedWork Location:USA DC Washington - 200 MacDill Blvd, Bolling AFB (DCC016)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}