{"jobID": "2831606580", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist - Operations Research", "companyRating": "4.0", "companyInfo": {"Website": "www.socalgas.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1929", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Southern California Edison"}, "estimatedSalary": "113000", "jobDescription": "Primary Purpose: Provide work direction to Operations Research Analysts and Project Specialists. Conduct preliminary assessment, problem definition, and scope document. Assigned some of the most complex business problems. Formulate and apply advanced mathematical modeling and other optimizing methods to develop and interpret information that assists management with decision making, policy formulation, or other managerial functions. Using analytical techniques, help managers to make better decisions and solve problems. Develops related software, service, or products that are used by functional organizations to optimize operations. Duties and Responsibilities:Lead or primary point of contact with client directors and VPs for most complex business problems. Prepare for, manage and sustain change management.Formulate mathematical or simulation models of problems, relating constants and variables, restrictions, alternatives, conflicting objectives, and their numerical parameters for most complex problems.Collaborate with others in the organization to ensure successful implementation of chosen problem solutions, working as an internal consultant. Analyze information obtained from management to conceptualize and define operational problems.Identify underlying principles, reasons, or facts of information by breaking down information or data into separate parts.Analyze information and evaluating results to choose the best solution and solve problems.Provide insight to problems and mentoring of Operations Research Analyst and Data Miners.Perform validation and testing of models to ensure adequacy and reformulate models as necessary.Collaborate with senior managers and decision makers to identify and solve a variety of problems and to clarify management objectives, policies and strategies.Provide guidance and expert advice to management or other groups on technical, systems, or process-related topics.Define data requirements and gather and validate information, applying judgment and statistical tests.Observing, receiving, and otherwise obtaining information from all relevant sources.Study and analyze information about alternative courses of action to determine which plan will offer the best outcomes.Translating or explaining what information means and how it can be used.Prepare management reports defining and evaluating problems and recommending solutions.Break systems into their component parts, assign numerical values to each component, and examine the mathematical relationships between them.Specify mathematical or computational methods to be applied to models.Use computers and computer systems (including hardware and software) to program, write software, set up functions, enter data, or process information.Keeping up-to-date technically and applying new knowledge to your job.Perform other duties as assigned. QualificationsEducation:Bachelor's Degree Bachelor's degree in quantitative methods, e.g., Applied Mathematics, Operations Research, Statistics, Industrial Engineering, Management Science, Decision Sciences, Economics, Econometrics or equivalent training and experience. RequiredMaster's Degree Advanced degree (MA, MS or PhD highly desirable) in quantitative methods, e.g., Applied Mathematics, Operations Research, Statistics, Industrial Engineering, Management Science, Decision Sciences, Economics, Econometrics or equivalent experience. PreferredPh.D. Advanced degree (MA, MS or PhD highly desirable) in quantitative methods, e.g., Applied Mathematics, Operations Research, Statistics, Industrial Engineering, Management Science, Decision Sciences, Economics, Econometrics or equivalent experience. PreferredExperience:5+ Practice of mathematical, statistical and machine learning methods PreferredSkills and Abilities:Interpersonal Skills – Demonstrate ability to develop effective business relationships with senior managers, directors and VPs. AdvancedMathematics — Knowledge of advanced mathematics, including calculus, statistics, linear algebra, linear and non-linear optimization, stochastic processes, experimental design, network flow theory, simulation modeling, real and complex analysis, number theory, queuing theory, econometrics. IntermediateAnalytical software/tools — Knowledge and use of major statistical and mathematical analytical, decision support and modeling software and open-source tools IntermediateCommunications — Knowledge of the structure and content of business report writing, presentations. AdvancedSpeaking — Talking to others to convey complex and technical information effectively to a general audience. AdvancedWriting — Communicating technical language and advanced mathematical solutions to general business language. AdvancedAdministration and Management — Knowledge of business and management principles involved in strategic planning, resource allocation, human resources modeling, leadership technique, production methods, and coordination of people and resources. IntermediateCritical Thinking — Using logic and reasoning to identify strengths and weaknesses of alternative solutions, conclusions or approaches to problems. AdvancedComplex Problem Solving — Identifying complex problems and reviewing related information to develop and evaluate options and implement solutions. AdvancedReading Comprehension — Understanding complex and technical reference material, including scientific, engineering and mathematical literature/publications. IntermediateJudgment and Decision Making — Considering the relative costs and benefits of potential actions to choose the most appropriate alternatives. IntermediateSystems Analysis — Determining how a system should work and how changes in conditions, operations, and the environment will affect outcomes. IntermediateSystems Evaluation — Identifying measures or indicators of system performance and the actions needed to improve or correct performance, relative to the goals of the system to support process redesign and continuous process improvement. IntermediateActive Learning — Understanding the implications of new information for both current and future problem-solving and decision-making ability to continue to learn new analytical techniques and business applications. AdvancedRecognized leader or contributor in profession. IntermediateProven application development and recognized in industry. Intermediate 07/31/2018"}