{"jobID": "2776410830", "jobLocation": "Santa_Clara_CA", "jobTitle": "Photonic Device Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "104000", "jobDescription": "Photonic Device Scientist Job Number: 113788282Santa Clara Valley, California, United StatesPosted: Jun. 13, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product. Do you love working on challenges that no one has solved yet? As a member of our dynamic group, you will have the unrivaled and rewarding opportunity to craft upcoming products that will delight and inspire millions of Apple’s customers every single day.  In this role, you will work within an Optical Science team, collaborating with a highly multi-disciplinary group, to develop and demonstrate new photonic sensor concepts. You will take advantage of your technical breadth as well as your depth of experience with optical systems.Key Qualifications 4+ total years of experience with photonic device physics, including significant experience with silicon photonics, plus most of the following:Excellent grasp of optical physics fundamentals.Experience with simulation of integrated optical active and passive components at both component and circuit level, including FDTD, waveguide mode solvers, and scatter matrix.Experience constructing and validating models of optical devices, based on first principles and empirical data.Strong programming ability with Matlab, Python, or similar language.Good understanding of a variety of optical measurement techniques, with hands-on experience characterizing optical devices.Excellent communication and presentation skills.Ability to work well in a team environment. DescriptionAs a Photonic Device Scientist, you will have the following responsibilities: Design, implement and maintain the setups for optical tests.Responsible of the design and implementation of the testing procedure for the new sources.Work with the System Engineering team to invent, implement and test optical sensor concepts.Conduct first-principles numerical simulations of optical devices and systems.Identify causal relationships between observed system-level performance and specific device-level parameters.Write specifications for custom optical devices, based on a combination of modeling and interpretation of empirical data.Work with external vendors to fabricate custom optical devices meeting our system-level requirements.Work with the team to test and validate fabricated devices.EducationA Masters degree or PhD in Physics, Applied Physics, Optics, EE, or related field is required."}