{"jobID": "2742788625", "jobLocation": "Ne_Jersey", "jobTitle": "Sr Scientist-Clinical Innovation - Advanced Research", "companyRating": null, "companyInfo": {"Website": "www.loreal.com", "Headquarters": "Clichy, France", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (LRLCY) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Procter & Gamble, Unilever, Estée Lauder Companies"}, "estimatedSalary": null, "jobDescription": " L’Oréal, the world leader in cosmetics, is synonymous with beauty, innovation and scientific excellence in more than 130 countries. As the leader in the beauty industry, our success is a direct result of our unequaled employees. L’Oréal is always looking for talented and ambitious minds to help build our beauty into something even better. Leadership also means innovation and quality. We offer the most technologically advanced products to our customers and a portfolio of brands in every product category. L’Oréal USA fully encompasses all aspects of beauty for everyone, everywhere.  We are searching for talented and creative Senior Scientist to join our state of the art Clinical Innovation team in the Advanced Research Department, Clark, NJ  As a Senior Scientist, you will be responsible for driving upstream clinical validation of efficacy of bioactives, formulations, diagnostics and wearables that will be transformed into consumer products. This requires knowledge and continuous improvements of existing methodologies as well as development of novel protocols in cosmetic evaluation in both skin and hair. This role requires collaboration globally with other clinical departments, formulation, biology/chemistry/biophysics, statistics, safety, regulatory and claims teams in L’Oreal Research & Innovation; and externally with academic KOLs and CROs. You will…..Maintain strong relationships with internal and external partners (CROs, global Advanced Research, Applied Research, Technology Incubators, and skin and hair care labs).Collaborate with other evaluation functions (in vitro, clinical and consumer claims, bioinstrumentation teams) within global L’Oreal R&I; (USA, France, Brazil, and Asia).Expand CRO networks within the US.Be the driving force for clinical validation by utilizing existing methodologies and developing new protocols for in vivo efficacy tests such as skin aging, hydration, pigmentation, hair care using instrumental, expert and consumer evaluations.Manage full process of clinical studies from design, protocol writing, IRB approval, monitoring, data management, analysis, reporting, presentation of results to management and assisting in publication strategies.Apply your knowledge of mechanisms of action and rationale of key technologies (cosmetic ingredients, consumer devices etc.) and stay up-to-date in cosmetic science.Provide guidance to strategic partners in formulations/biology/chemistry/biophysics teams on parameters such as appropriate clinical tests, evaluations, timing, CRO selection, cost.Work within guidelines from various business divisions such as Safety, Regulatory, Claims, Finance.You must have…..Master’s Degree or higher in the Biomedical Sciences, Biochemistry, Pharmaceutical or Cosmetic Sciences.5 to 8 years of experience managing clinical trials in cosmetic, personal care, pharmaceutical or OTC industries.Expertise in cosmetic science, techniques, instrumental and clinical evaluations of efficacy for skin and hair and understanding of skin/ hair biology, cosmetic actives and their functions.Demonstrate self-drive, intrinsic motivation, independence, and ability to manage multiple projects concurrently, problem solving and desire to innovate in a fast-paced environment.Team oriented, collaborative and capable of working in a global company with diverse culture.Adherence and understanding of ethical practices in human research studies, Declaration of Helsinki, good clinical practices and FDA regulations.Experience managing internal and external (CROs) collaborations.Excellent oral and written communication skills.Experience with data management and statistical analysis methodologies. Available for domestic and international travel (~10%).Legally eligible to work in the USA in a continuous basis. We are an Equal Opportunity Employer and take pride in a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, sexual orientation, national origin, age, marital or veteran status, medical condition or disability, or any other legally protected status.  If you require a reasonable accommodation to complete an application for a recognized disability under applicable law, please email USApplicationAccommodation@support.lorealusa.com. Please note this email will only respond to specific requests for assistance completing the application as a request for accommodation for a disability. All others will not be considered."}