{"jobID": "2826721707", "jobLocation": "Chicago_IL", "jobTitle": "Director, Data Science", "companyRating": null, "companyInfo": {"Website": "www.kemper.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Insurance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number KCS-185968SD Post Date 4/23/2018 Title Director, Data Science City Chicago State IL Description Position Summary:  Kemper has an immediate need for a Director of Data Science in our corporate headquarters location in Chicago, IL. You will work as part of a team to build predictive models designed to support the Kemper organization in areas such as risk selection, customer  segmentation and lifetime value, insurance pricing, operational efficiency, and fraud detection. Position Responsibilities:Developing and automating predictive modeling processes that can be deployed through the organization to solve reoccurring analytics needs (ex: state specific implementations).Aiding the decision making process of our internal customers by building easy to deploy tools that present both insightful data summaries and actionable modeling results.Functioning as both project lead and supervisor for teams of 3-5 analysts. Ensure compliance with both analytics best practices and corporate standards while emphasizing analyst training and development.Providing implementation support for completed projects to insure work results are successfully deployed in the marketplace.Experimenting with and conduct internal peer reviews for new modeling techniques to continually improve on existing methodologies.Meeting with key stakeholders to understand the processes and work streams of the area, identify problems that can be solved through predictive modeling and propose appropriate solutions;Prioritizing projects based on the positive impacts to the businessActing as an analytics resource in executive meetings and advise the leadership team on the best approaches to data driven solutions to corporate problems. You will also independently manage research for a corporate area such as a line of business or an operational department which includes areas such as Marketing, Sales, Claims, etc. Position Qualifications:10+ years of experience in a data science environment; some interaction with the Property and Casualty insurance industry preferredGraduate degree in a quantitative field preferred: Mathematics, Statistics, CS, Physics etc.Excellent overall communication skills, particularly possessing the ability to translate technical results for wide audiencesProficiency and experience with several modeling techniques such as generalized linear models, decision trees, ensemble learning, regularized models (ridge/lasso/nets), clustering or neural networks.Solid coding skills and proficient with at least one programming language (C++, Java, Python etc.)Ability to work with various data formats – from delimited text files to ODBC connections and relational databases.Ability to combine various analysis methods to solve complex business problems, including using mathematical optimization techniques to combine predictions of different statistical modelsstrong skills with SAS and R, including an understanding of each tools comparative strengthsOur employees enjoy great benefits:Qualify for your choice of health and dental plans within your first month.Save for your future with robust 401(k) match, Health Spending Accounts and various retirement plans.Learn and Grow with our Tuition Assistance Program, paid certifications and continuing education programs.Contribute to your community through United Way and volunteer programs.Balance your life with generous paid time off and business casual dress.Protect what you love with discounts on home and auto insurance products.Get employee discounts for shopping, dining and travel through Kemper Perks. Kemper at a glance  With $8 billion in assets, Kemper is one of the nation's leading insurers. The Kemper family of companies specializes in home, auto, life, health and valuables insurance products for individuals, families and businesses.  Kemper’s underwriting companies* are rated A- (Excellent) by A.M. Best Company, the leading insurance industry rating authority. Kemper services six million policies and ranks among the top 25 personal lines property and casualty writers and the 2016 Ward’s  50 Top Performers list of life insurance companies. Alliance United Insurance Company is not rated. We value diversity and strive to be an employer of choice. An Equal Opportunity Employer, M/F/D/V  +MO +CB +LJ -GD -IN -MSJ -PT"}