{"jobID": "2829519395", "jobLocation": "Fenton_MI", "jobTitle": "Mortgage Processing Manager/Underwriter", "companyRating": null, "companyInfo": {"Website": "www.thestatebank.com", "Headquarters": "Fenton, MI", "Size": "51 to 200 employees", "Founded": " 1898", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Dort Federal Credit Union, Chase, ELGA Credit Union"}, "estimatedSalary": null, "jobDescription": "The State BankJob DescriptionJob Title: Mortgage Processing ManagerDepartment: MortgageReports To: Senior LenderGrade Level: 10 SUMMARYManage the work flow of the residential mortgage processors to ensure timely and accurate processing of mortgage applications.ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned.Supervises loan processing staff, responsible for training, counseling, performance reviews.Underwrites mortgage loans as necessaryPerforms processing and document preparation of loans same as processing staff.Assist in responding to quality control and audit findings and implement any necessary changes identified.Assign files to processors and manage closing schedule to ensure the department meets closing deadlines.Responsible for ordering title commitment and clearing any outstanding title issues that are identified.Work with customer, loan officer, real estate agent and title Company to close loan on schedule.Clear all underwriting conditions on each loan file.Re-running loan through LP or DO underwriting systems for any material changes to file.Check loan file for compliance regarding disclosure deadlines.Preparation of closing documents, wiring funds to title company, inputting loan into banks system and reviewing co-workers file input for SOXA compliance.SUPERVISORY RESPONSIBILITIESResidential mortgage processing staffQUALIFICATIONSTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.EDUCATION and/or EXPERIENCE5+ years mortgage processing in a banking environment managing a team of mortgage loan processors and closers. Strong knowledge and understanding of Freddie Mac & Fannie Mae guidelines is required. College degree preferred but not required.LANGUAGE SKILLSAbility to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of organization.MATHEMATICAL SKILLSAbility to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals. Ability to compute rate, ratio, and percent and to draw and interpret bar graphs.REASONING ABILITYAbility to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form. Ability to deal with problems involving several concrete variables in standardized situations.REGULATION TRAINING REQUIREMENTSBank Secrecy Act (BSA) for LendersRegulation BB Community Reinvestment Act (CRA)Regulation ORegulation BFair LendingFair Credit Reporting ActHome Mortgage Disclosure ActOffice of Foreign Assets Control Regulation (OFAC)Flood Disaster Protection ActPrivacy for Customer Contact PersonnelReal Estate Settlement Procedures Act RESPARegulation Z Overview (Truth in Lending)TILA RESPA Integrated Disclosure (TRID)CERTIFICATES, LICENSES, REGISTRATIONSNone requiredPHYSICAL DEMANDSThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to sit and use hands to finger, handle, or feel. The employee is occasionally required to stand and walk. Specific vision abilities required by this job include close vision.WORK ENVIRONMENTThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The noise level in the work environment is usually moderate."}