{"jobID": "2813097198", "jobLocation": "Battle_Creek_MI", "jobTitle": "Fuel System Specialist", "companyRating": null, "companyInfo": {"Website": "www.duncanaviation.aero", "Headquarters": "Lincoln, NE", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " West Star Aviation, Elliott Aviation, StandardAero"}, "estimatedSalary": null, "jobDescription": " The Fuel System Specialist tests, adjusts and repairs a variety of airframe fuel systems and their related components on a variety of airframes in a safe and clean work environment according to manufacturer's specifications, Duncan Aviation approved procedures and customer specifications. In addition, this position assists with troubleshooting fuel systems and their related components; prepares and completes appropriate documentation in a timely manner; and trains less experienced team members through the OJT process. Essential Job Functions 1. With limited supervision, uses proper application of sealants and fasteners and appropriate tooling to repair aircraft fuel systems according to manufacturer's requirements and Duncan Aviation approved procedures in a safe and clean work environment. Services and maintains aircraft fuel systems and components using proper hand tools in a timely, clean, safe and professional manner with limited or no rework.  2. Performs basic troubleshooting and repairs to fuel system wiring and components. Assists with removal of major components. Applies Service Bulletins (SBs) and Airworthiness Directives (ADs) as required.  3. Creates detailed maps of fuel system leaks and required repairs.  4. Prepares various documents for record keeping purposes, as required by Company policy and FAA regulations (i.e. turnovers, removal sheets, personal training log, etc.). Demonstrates proficiency of Duncan Aviation work order system, service plans, Tracker and outside maintenance tracking programs by completing accurate and timely discrepancies and corrective action statements, Service Bulletins and Airworthiness Directives (AD) Compliance statements, final inspection and closing of squawks and work orders.  5. Willingly and effectively shares knowledge and capabilities with less experienced technicians through OJT to foster their development, ensure accurate work and support the team's goals.  6. Consistently locates and uses appropriate technical data and follows verbal instructions when accomplishing assigned maintenance tasks.  7. Performs other related duties as assigned by management. Job Specific RequirementsLicenses/Certificates: Valid driver's license and acceptable driving record: Respirator Fit qualified; tool inventory per department tool list required; Man Lift qualified eligible; QI designation eligibleAttendance: Regularly scheduled attendance required; occasional overnight and short notice travel requiredPhysical: Routinely lifts up to 50 lbs. and occasionally up to 100 lbs.; reads small print; hears sounds associated with mechanical deficiencies; repetitive motion; works with moving parts and vibration; tolerates products, materials and fumes associated with component maintenance; tolerates working in confined spaces and heights above four feet; tolerates standing, walking, bending, kneeling, stooping, crouching, crawling, climbing and sittingEnvironmental: Tolerates working in extreme temperatures and in noisy environmentsWork Schedule: Must be available to work all shiftsEducation and ExperienceFuel System Specialist I:High School graduate or equivalent requiredPrevious one year mechanical related experience requiredPrevious fuel system and/or aircraft repair experience preferredFuel System Specialist II:High School graduate or equivalent requiredPrevious one year fuel system and/or aircraft repair experience requiredFuel System Specialist III:High School graduate or equivalent requiredFive years fuel system and/or aircraft repair experience required Duncan Aviation, Inc. is an Equal Opportunity/Affirmative Action Employer. All qualified candidates will receive consideration for this position regardless of sex, race, color, national origin, religion, age, disability, veteran status, genetic information, marital status, sexual orientation, gender identity or any other characteristic protected by law. Click to access the EEO is the Law poster.  If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us by e-mail at Recruiting@DuncanAviation.com or by calling at 402.479.1608.  We maintain a drug-free workplace and require a pre-employment drug test."}