{"jobID": "2623195358", "jobLocation": "Santa_Clara_CA", "jobTitle": "Machine Learning Scientist", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JD.com is looking for exceptional and self-motivated machine learning researchers and engineers to join our JD-Y Business Unit (JD-Y) at JDs Silicon Valley R&D; Center. We are looking for scientists and engineers with successful hands-on experience applying advanced machine learning techniques to solve real world problems. As the core decision making engine of JD.coms supply chain, JD-Y has been leading the innovation of supply chain management technology. You will have the opportunity to work with the cross-functional team to create deep learning and machine learning algorithms to a form deep understanding of JDs vast product selection well as the hundreds of millions of active shoppers who use the platform. Your algorithms and models will help JD to improve supply chain system efficiency as well as other applications such as product selection, dynamic pricing and promotion.  Responsibilities:  Work with business, engineering and product teams to form an understanding of the requirements and processes of existing systems. Create deep learning and machine learning algorithms that can be applied to address business needs and provide business insights. Apply advanced machine learning / deep learning techniques to form a deep understandings of customer behavior and products. Create decision-support and decision-making systems based on such learning results to improve business efficiency. Participate in cutting-edge research in artificial intelligence and machine learning algorithms and applications. Define and drive a technical vision and strategies to integrate machine learning algorithms into the existing production system and business decision making processes. Qualifications:  Masters or Ph.D. degree in Computer Science, Machine Learning, Operational Research, Statistics or related field. Hands-on experience applying machine learning techniques to solve real-world problems. Experience with a deep learning framework such as TensorFlow or Caffe. Experience with a big data platform such as Hadoop and Spark. Experience with scripting languages such as Python or R. Excellent written and oral communication skills.About JD-Y team JD Y Division (JD-Y) focuses on building a smart supply chain and using AI to drive retail reform. The Y division applies AI algorithm and use data-driven approaches in product selection, inventory management, pricing and promotion. It also leverage big data technologies in smart retail to lower the costs of distribution. The Y division is working with leaders in industry and academia to design and build the next generation supply chain management system. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}