{"jobID": "2816509866", "jobLocation": "Deerfield_IL", "jobTitle": "Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.kellyservices.com", "Headquarters": "Troy, MI", "Size": "5001 to 10000 employees", "Founded": " 1946", "Type": " Company - Public (KELYA) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Adecco, ManpowerGroup, Allegis"}, "estimatedSalary": null, "jobDescription": " Our client, a top international Healthcare firm, is currently seeking a Business Analyst, Business Transformation for a 6+ month contract opportunity. The position is located in Deerfield, Illinois. By working for our client, you will be exposed to a large global company (listed on the NYSE), work for a leader in the R&D;, manufacturing and distribution healthcare products, work in a fast paced corporate environment and be an integral part to the team. In addition to working with the world’s most recognized and trusted name in staffing, Kelly employees can expect:-Competitive pay-Paid holidays-Year-end bonus program-Recognition and incentive programs-Access to continuing education via the Kelly Learning Center Overview & Responsibilities of the role below;  The Business Transformation Office (BTO) has been established with responsibility for leading a number of company-wide initiatives. The BTO reports to the CFO, and is coordinating change efforts to advance many aspects of our future strategy.  The BTO programs are focused on managing costs, transforming our organization and reducing complexity, allowing the company to focus resources on key business goals and reinvest in innovation and sustainable growth.  The project is seeking to establish a team of individuals who can help to respond to requests for data analytics and innovative savings ideas. The Business Analyst will support the team in required data analytics and data integration in support of financial analyses and creation of profit improvement and cost savings models. This includes “hands on” work on analyses / data as well as close collaboration with team members, including marketing. Specific areas of responsibilities include: Develop and consistently improve reporting for select areas of spend for a variety of stakeholders.Support senior leaders with deep dive analysis of spend across the global platform.Partner cross-functionally with Purchasing team to help identify potential areas of opportunity and savings.Prepare general month-end reports for P&L; owners and various senior leaders.Perform special projects with heavy financial analysis and provide recommendations.Assist with annual Planning process to identify category targets at the P&L; level.Actively partners with and collects feedback from cross functional team members, including marketing leads, to dive into details of data sets, analyses, and business cases.Dives into detail of functional datasets (e.g. sales, supply chain, manufacturing) from various IT systems to understand linkages to key financial analyses helping to enable reproducibility of analyses in the futureIn a “hands on” fashion, works to establish connection points and reconciliation needs between functional datasets as needed The ideal candidate will hold a Bachelor Degree in Finance, Accounting or other Analytical discipline, coupled with 4+ years’ experience, preferably within Biotech/Pharma industry. “Master” level excel skills as well as experience in business analytics software such as Tableau. Past management consulting experience is a plus. Demonstrated competencies in data analytics and/or financial analysis. Proven success partnering with cross functional team members in a matrix organization **Important information: This position is recruited for by a remote Kelly office, not your local Kelly branch. Please submit your resume to be considered for this position by pressing the “SUBMIT RESUME” button below. If you have questions about the position, you may contact the recruiter recruiting for this position (DANR020@Kellyfinance.com), however, your resume should be uploaded via the “SUBMIT RESUME” button included within**Why Kelly®?"}