{"jobID": "2659403529", "jobLocation": "Lanham_MD", "jobTitle": "Marketing Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.2u.com", "Headquarters": "Lanham, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (TWOU) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": "What we’re looking for: We are a fast-growing and high-performing team looking for a Marketing Data Analyst to join our demand generation / marketing group.  The Marketing Strategy Analyst is responsible for managing the paid marketing efforts of several 2U programs by setting the marketing strategy, ensuring each program is meeting profitability goals, and working cross-functionally with senior stakeholders. Each Analyst is expected to own their portfolio of programs, and are the direct stakeholder for senior leadership. The work of each Analyst has a direct impact on the profitability of 2U and is strategically vital to the organization.  A successful candidate has the ability to use data to drive change across all paid marketing efforts. Successful backgrounds typically include those with a business, economics, finance, or math undergrad. Responsibilities include, but are not limited to:Setting the paid digital marketing strategy and budget for 4-6 2U programsForecasting spend, revenue and profitability by marketing channel for each programUsing data to flag risks and opportunities, and devising a strategy to improveReport weekly on pacing and performance to senior leadershipWork cross-functionally to segment audiences and develop new media campaignsIdentify risks and opportunities in business performance and communicate to managerPerform ad-hoc analysis as needed to support the larger teamExperience:0-2 years of experience using data to solve business and marketing problems (including academic experience)Has a working knowledge of Excel, and some previous exposure to SQL or other databasesPrevious work with Tableau a plusYou are someone who:Has a Bachelor’s degree (from a business, economics, or math related field is a plus)Is looking for the opportunity to set business strategyHas a keen interest in digital marketing (prior experience a plus, but not required)Is adept at problem solving and can balance creativity with analytical sillsHas a strong work ethic and doesn’t accept complacencyDemonstrates proactive thinking – always seeking ways to do something betterOther Attributes That Will Help You in This Role:Background or coursework in Statistics, Economics or BusinessPrior experience in digital marketing and lead generationThe ability to multi-task, stay organized and evaluate priorities on an ongoing basisThe ability to communicate difficult/sensitive information in a tactful manner About 2U Inc. (NASDAQ: TWOU) 2U partners with great colleges and universities to build what we believe is the world’s best digital education. Our platform provides a comprehensive fusion of technology, services and data architecture to transform high-quality and rigorous campus-based universities into the best digital versions of themselves. 2U's No Back Row® approach allows qualified students and working professionals around the world to experience a first-rate university education and successful outcomes. To learn more, visit 2U.com. 2U Diversity and Inclusion Statement At 2U, we are committed to creating and sustaining a culture that embodies diverse walks of life, ideas, genders, ages, races, cultures, sexual orientations, abilities and other unique qualities of our employees. We strive to offer a workplace where every employee feels empowered by the ways in which we are different, as well as the ways in which we are the same. Why It’s Great to Work at 2U 2U offers a high-energy work environment that’s both challenging and fun. We work hard, but our offices are casual and social places. We wear jeans to work and fuel brainstorming sessions with snacks and seltzer. Benefits 2U offers a comprehensive benefits package: Medical, dental and vision coverageLife insurance, disability and 401(k)Unlimited snacks and drinksGenerous paid leave policiesTuition reimbursement programSpontaneous dance partiesNo Asshole policy Note: The above statements are intended to describe the general nature and level of work performed by individuals assigned to this position, and are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.  2U is an equal opportunity employer that does not discriminate against applicants or employees and ensures equal employment opportunity for all persons regardless of their race, creed, color, religion, sex, sexual orientation, pregnancy, national origin, age, marital status, disability, citizenship, military or veterans’ status, or any other classifications protected by applicable federal, state or local laws. 2U’s equal opportunity policy applies to all terms and conditions of employment, including but not limited to recruiting, hiring, training, promotion, job benefits, pay and dismissal."}