{"jobID": "2831493809", "jobLocation": "Tomball_TX", "jobTitle": "Technical Services Scientist (Pressure Pumping)", "companyRating": "3.5", "companyInfo": {"Website": "www.bakerhughes.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (BHI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": "About Us: Baker Hughes, a GE company (NYSE:BHGE) is the world's first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain.  BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company deploys minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own.  With operations in over 120 countries, the company's global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.  Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com. Role Summary: Baker Hughes, a GE company is currently hiring a Technical Services Scientist supporting Pressure Pumping at our facility in Tomball, Texas. Essential Responsibilities: The Technical Services Scientist will be responsible for running routine testing in a laboratory environment in response to field technical service requests. This person will be self-sufficient and can take on multiple lab requests at once. In addition, the candidate will be expected to analyze and interpret data from the testing and summarize it in a report format. Finally, this role could be supporting multiple laboratories supporting technical questions and operational concerns in both cementing and stimulation. Conducts routine chemical and physical analysis by running testsAssists technical services team in compiling, analyzing and interpreting results for internal and external customersAbility to learn fundamental concepts related to cementing or stimulation to solve problems, initiate projects, and provide innovative ideas.Works independently to perform lab testing and provide results, and communicates results to team/project leaderHas a fundamental understanding of equipment calibration, troubleshooting and maintenance of equipmentCan manage multiple projects at once and has understanding of out to manage and deliver on complex projectsCollaborates with Pressure Pumping Product Line, teammates, colleagues, and other product linesWilling to learn equipment calibration, troubleshooting and maintenance of equipmentParticipates in development of standardsQualifications/Requirements:A Bachelor's Degree in Engineering, Physics, Chemistry, Mathematics, or Computer Science from an accredited college or university (OR a High School Diploma / GED with a minimum 4 years of experience in an engineering, IT, scientific or other technical position)Knowledge of oilfield laboratory testing or scientific testing in generalVerbal and written communication skillsMust be action-oriented, ethical in values, and have a strong focus on satisfying customersStrong analytical skillsCommunicates well both individually and in a team environmentDemonstrates project management skillsSelf-motivating, goal oriented, and determinedDesired Characteristics:3 years laboratory testing experienceMust be authorized to work in the US without sponsorshipBusiness travel may be required for both domestic and International locationsWork schedule may vary (days, evenings, and/or weekends) depending on business needsLocations: Tomball, TX  Baker Hughes, a GE company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Learn more"}