{"jobID": "2825981459", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.medixteam.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Description: The Data Analyst provides data architectural leadership in developing enterprise data/process models, and logical/physical database designs. Provide data and database development, maintenance, and production support. Participate in IT and Business project to define system requirements.  This position will be required to analyze clinical operations metrics and quality measures for clinical programs, including Medicare Advantage Program, managed Medicaid Home and Community Based Services (HCBS) and Medicare Medicaid Dual Demonstration projects and quality affordability initiatives. The role requires a self-motivated, independent individual with a solid background in healthcare analytics and knowledge of healthcare metrics. Essential Duties and Responsibilities:Work with the clinical program leaders and business intelligence to gather reporting and analytic requirementsProvides advanced analytical support for an Accountable Care Entity business on some of the following areas: ClaimsProvider dataPatient dataClinical dataHEDIS and other quality measuresPharmacyExternal / State reporting.Standardize reporting processes and documentationExtracts, load, model, and reconcile large amounts of data across multiple system platforms and sources.Develops, analyze, and monitor reports/data (new, routine, and ad hoc) to determine operational impacts and needed actions; elevate issues, trends, areas for improvement and opportunities and to provide recommendations to managementLead the development and continuous improvement of methods, processes, and technologies to enhance healthcare quality, affordability, outcomes, and patient / provider experience.Models data using MS Excel, Access, SQL, and/or other data warehouse analytical tools.Assists management in driving business decisions based on data. Provides consultative advice and interprets and summarizes analytical findingsResearches, identifies, and implements new approaches and methods to facilitate process managementEnsures compliance with federal and state deliverable reporting requirements by performing data quality audits and analysis.Experience with implementing and interfacing electronic health records to other systemsQualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. BA/BS Computer Science, computer programming or equivalent experienceHealthcare experience preferredWorking knowledge in health informatics / health and claims data3+ years advanced experience in healthcare data query and analytics, preferably analyzing clinical program data and clinical operations performance metrics using SQL, or tools such as Microstrategy, SAS and other relational databases, MS Access and MS Excel, and advanced skills in building databases3+ years of statistical analysis or data analysis experience.Advanced knowledge of Enterprise Reporting and Analysis tools, SQL, and Microsoft Office applications, including Excel and AccessExperience managing projects or heavy involvement in project implementationWord Processing software; Spreadsheet software; Accounting software; and Database software"}