{"jobID": "2802001454", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior UX Designer", "companyRating": null, "companyInfo": {"Website": "www.vitamintalent.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Aquent's client is seeking a passionate, team-oriented Senior UX Designer to join its Customer Experience organization to play a key role in shaping the user experience design for our client's website, app and retail stores. The Senior UX Designer plays a key role in realizing the strategic vision through the design of engaging user experiences. Candidates should have a minimum of 5 years of experience designing across digital channels. Strong candidates will have a proven track record of delivering elegant, world-class designs in a fast paced collaborative team environment, solving business goals and user needs,working and influencing in a cross-functional context, and using research and data to inform the design of user experiences. In addition to being an individual contributor, the Senior UX Designer will mentor UX Designers and Associate UX Designers, and guide their efforts to align with the strategic vision.  The candidate is responsible to perform other duties as assigned.  This position reports to the Manager of User Experience Design. Responsibilities  Designs domain experience that meets business goals and user needs (e.g. KPI’s and user success metrics).   Effectively collaborates with managers, product managers, engineers, and researchers to define, conceptualize, and design user-facing products.   Partners with the UX leadership team to define the domain experience and to ensure deliverables are consistent with the user experience design vision.   Designs across web, mobile apps, and in-store environments, ensuring a consistent user experience across different platforms.   Works through domain design problems from beginning to end: conceptualizes new products and features, designs storyboards, workflows, interactions, wireframes, high fidelity mockups, and design  standards based on business goals and user research.   Work closely with the domain UX Manager and UX Lead to ensure deliverables are consistent with the overall design system.   Mentors domain team user experience designers. Skills Required  Experience: Minimum 5 years UX/UI design experience across consumer mobile applications, websites, or retail stores.   Education: BA/BS in Design Required, preferably in UX related fields of HCI, Industrial Design, Product Design, Architecture or Graphic Design.   Strong analytical, strategic, and conceptual UX design skills.   Highly knowledgeable of designing for mobile apps and responsive web experiences; well versed in user interface design processes and methodology, including user-centered design.   Capable of designing user experiences that support business goals and user needs.   Strong ability to design high-fidelity mockups and prototypes, and iterate on user interface design and interaction flow of applications and experiences based on user feedback.   Ability to leverage metrics, optimization, and qualitative and quantitative research to inform and validate design decisions.   Strong verbal and written communication skills; ability to influence and cultivate strong relationships with key business stakeholders in the organization.   Solid negotiation skills across a variety of audiences; can successfully advocate solutions among peers and to executive leadership.   Solid time management and prioritization skills; ability to manage multiple projects simultaneously, at various stages of their development.   Must have a strong user experience design portfolio that clearly demonstrates consumer oriented user experience design solutions for complex problems. % Essential Functions70% Development and execution of UX design vision and deliverables within your assigned channel 10% Strategic thinking, developing POVs and UX design vision 10% Collaboration & communication with all projects and initiatives to ensure consistency and clarity 5% Mentoring and skill development of mid-level and associate level UX team members 5%Personal Development Qualifications:  Experience: Minimum 5 years UX/UI design experience across consumer mobile applications, websites, or retail stores.   Education: BA/BS in Design Required, preferably in UX related fields of HCI, Industrial Design, Product Design, Architecture or Graphic Design. Masters degree preferred.   Communication Skills: Excellent written and verbal communication skills. Ability to read, write and interpret business and technical documents. Create and present documentation, findings and points of view material.   Mathematical Skills: Basic math functions such as addition, subtraction, multiplication, division and analytical skills   Reasoning Ability: Must be able to work independently with minimal supervision. Consistently demonstrates regular, dependable attendance & punctuality.   Physical Demands: This position involves regular ambulating, sitting, hearing, and talking. May occasionally involve stooping, kneeling, or crouching. May involve close vision, color vision, depth perception, and focus adjustment. Involves use of hands and fingers for typing on keyboard and using a mouse. May be a need to move or lift items  under 10 pounds.   Other skills: Strong design and collaboration skills.   Work Hours: Ability to work a flexible schedule based on department and company needs   Supervisory Responsibility: None"}