{"jobID": "2823477169", "jobLocation": "Englewood_Cliffs_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.unilever.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1872", "Type": " Company - Public (ULVR:LN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Procter & Gamble, Nestlé, Johnson & Johnson"}, "estimatedSalary": "127000", "jobDescription": "Background & Purpose of the Job:As a Senior Data Scientist (Analyst), at a start up within Unilever, you’ll be helping drive business by data mining, testing, analyzing and transforming data into actionable insights. You'll own aspects of the data creation and management, data pre-processing, modeling and inference considerations. You will also be involved in our efforts to develop and mature a scalable program to test customer experience, sales, and production efficiency. Your analyses and experiments will drive future direction of value propositionWho You Are & What You’ll Do:We are looking for an individual with an entrepreneurial spirit. Bringing seniority to the team: ready to manage when the company grows but at the same time able to execute straight away. You will join us in building a very exciting digital/e-commerce start-up company within Unilever. We look for candidates with creativity, innovative problem solving skills, passion and most importantly a growth mindset.You will be part of the initial start-up team which will be building the company from scratch with strong focus on customer value creation. As Unilever experiments this start-up mindset, you will have direct access to senior leadership and resources. The initial team will consist of highly motivated, selected people who are each proven experts in their areas. The team will be compensated with strong base salary and aggressive bonus payouts which will tie to the start-up financial performance.As the company grows, new team players/direct reports will be recruited into the company but during in the initial stage, you are expected to perform the role hands-on and build the future of the start-up companyKey Responsibilities of the role:Proactively structure and kickstart growth experiments, covering the full spectrum of traction channels (paid / organic, funnel marketing, engineering-as-marketing, etc.)Test new landing page structures to increase conversion and control acquisition costsCo-develop propositions and test new propositions online as well as offline to validate assumptions.Own data collection and perform analyses (cohorts, user surveys, etc) to inform product roadmapWork closely with our growth marketer to design customer acquisition strategies, with our tech development manager to enhance the buying experience.Identifying, developing and executing data analysis to uncover areas of business opportunity.Design and execute analyses and data mining by utilizing available analysis tools, interpret the results and develop recommendations and actionable steps based on the learning.Design predictive models using Spark ML/MLlib or R to be able to predict the key customer sales or click behavior that needs to be influencedDeep dive into massive data sets to answer key business questions.Analyzing trends in growth marketing and making recommendations to the business on new avenues to exploreBuild a data preparation process using SQL or Spark SQLExtract and analyze data to interpret impact of tests on marketing performance (e.g. cost per lead, cost per acquisition, pipeline growth, ROI)You’re a born leader: be part of the initial start-up team which will be building the company from scratch with strong focus on customer value creationYou’re a strategy guru: Manage multiple deliverables in a fast paced and ever-changing business environmentYou’re a dot connector: Be a liaison with several cross functional groups in order to facilitate the completion of deliverablesYou’re a teacher: You build strong relationships within the various functional areas through the delivery of exceptional results and supportYou’re a changemaker: Analyzing trends in growth marketing and making recommendations to the business on new avenues to exploreWhat You’ll Need To Succeed:You're driven by metrics – you keep measuring and analyzing your experiments, and will not rest until you find answers to your questionsYou have a strong quantitative background, an experimenter's mindset, broad technical skills.Proven experience in setting up, executing and analyzing proposition/growth experimentsProven ability to leverage analytics and data into brand and revenue growth driving initiativesYou have strong collaboration and communication skills and enjoy working on international teamsHave extensive knowledge on statistics, multivariate statistics, econometrics / decision modeling & machine learningHighly skilled in SQL / SparkSQL to test data for predictive models.Have a great understanding of marketing as a business functionCreative in finding ways to use data to personalize different parts of the platform (Campaigns, Adds, Web, App)Bachelor’s degree in related field5-7 years of work experience in analytics, performance, e-commerce marketing, or other quantitative/data-driven field; you've been there before, made your share of mistakes, and are itching to hit the ground runningAbility to Build landing pages, set up Facebook/Linkedin/Google test campaigns, use analytics tools like Hotjar, Google Analytics etc.The location for this role is in Unilever North America Campus (Englewood Cliffs, New Jersey).By applying for this vacancy, you are confirming that you have made your Line Manager aware of your application and that you are at a point in your career with Unilever where it is appropriate for you to be applying for other positionsUnilever is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business.Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with DisabilitiesApplicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the LawEmployment is subject to verification of pre-screening tests, which may include drug screening, background check, credit check and DMV check."}