{"jobID": "2805287079", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.xpo.com", "Headquarters": "Greenwich, CT", "Size": "10000+ employees", "Founded": " 2011", "Type": " Company - Public (XPO) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " DHL Supply Chain, UPS, FedEx"}, "estimatedSalary": "86000", "jobDescription": " Data Engineer Requisition Id:  51137 Business Unit:  Corporate Location:Chicago, IL, US, 60601#job-location.job-location-inline {  display: inline;  }Logistics done differently. You are always looking for a better, more efficient way to improve productivity. At XPO Logistics, we are looking for people who can effectively incorporate strategies to help people work smarter. As the Data Engineer, you will be responsible for developing data pipelines and data engineering components to support strategic initiatives and ongoing business processes. You will work with leads, analysts, and data producers and consumers to understand requirements, develop technical solutions, and ensure the reliability and performance of the data engineering solutions. If you’re ready to further your career—to go bigger and better—we have an opportunity for you to grow with XPO. Pay, benefits and more. We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability, and the opportunity to participate in a company incentive plan. What you’ll do on a typical day:Develop Business Intelligence and data solutions focused on data engineering and analytics using Python, Machine Learning, RDBMS, R, SQL, Data Modeling, Java, Unix Scripting, AWS, and Azure services, MicroStrategy, Power BI, and MPP databasesTroubleshoot technical issues in existing processes and current development work, solicit assistance from other roles and groups, and drive resolution to ensure the integrity of platform quality and project timelinesUnderstand and improve shared standard patterns, templates, and artifacts for BI and data warehouse platform architecture, data science development approaches, data models, and new technology adoption and rolloutAssist others using the data lake, data warehouse, and related systems to build analytical applications, visualizations, queries, and dashboards; tools include SQL, MicroStrategy, Power BI, Python, R, and Jupyter notebooksProactively generalize and share technical approaches and best practices among other developers, and simplify and communicate completed work to broader audiences across the companyHelp support data consumers to ensure they have reliable access to trusted data including periodic responsibility for 24/7 on-call production supportWhat you need to succeed at XPO: At a minimum, you’ll need: Bachelor’s degree in Computer Science, MIS, Engineering, or related field3 years of experience in data engineering and analytics It’d be great if you also have: 4 years of experience in data engineering and analytics, and in delivering solutions in at least two of the following: data science, data modeling, data integration, data analysis, AWS, Big Data, SQL, R, Python and Machine LearningData Science specialization from Coursera, Udacity, Data Camp, etc.; R, Python certificationsCertified Business Intelligence Professional from TDWI, and Data Management Professional from DAMACertifications in data modeling and data engineeringUnderstanding of core principles of data warehousing, data science, and machine learningAbility to work with MPP databases like Netezza, Redshift, or Teradata; write SQL fluently, recognize and correct inefficient or error-prone SQL, and perform test-driven validation of SQL queries and their resultsKnowledge of data pipeline concepts (like in Pentaho, SSIS, Informatica, Data Stage etc); data analytics and visualization using R and Python (Numpy, Pandas, Scipy, Scikit-learn, Tensorflow and Keras)Knowledge in cloud solutions (preferably in Amazon suite of products)Ability to read and understand logical data models and physical data modelsBe part of something big. XPO provides cutting-edge supply chain solutions to the world's most successful companies, including Disney, Pepsi, L'Oréal, Toyota and many others. We’re the fastest-growing transportation company on the Fortune 500 list and we’re just getting started.  We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.  The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.Nearest Major Market: Chicago"}