{"jobID": "2705550285", "jobLocation": "Berkeley_CA", "jobTitle": "Site Medical Director", "companyRating": "2.8", "companyInfo": {"Website": "www.obhg.com", "Headquarters": "Greenville, SC", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "268000", "jobDescription": " Berkeley, California  Hospital InformationThe hospital is the East Bay's largest private nonprofit medical center and has served the community for more than 100 years. As one of the largest non-academic delivery centers in the country, the hospital's Women and Infants Program delivers approximately 7,400 babies each year, more than any other hospital in Northern California, and has special expertise in high-risk obstetrics. For babies who are born prematurely or need additional medical care, the hospital has a 55-bed level III newborn intensive care unit (NICU).The LocationBerkeley, CA enjoys an enviable location along the eastern shore of San Francisco Bay in northern Alameda County. It borders the cities of Oakland and Emeryville to the south and the city of Albany and unincorporated community of Kensington to the north. Berkeley has a population of roughly 115,000.  Berkeley has a Mediterranean climate, with dry summers and wet winters. The summers are cooler than a typical Mediterranean climate thanks to upwelling ocean currents. Residents enjoy cool mornings and evenings. Berkeley's location directly opposite the Golden Gate Bridge ensures that typical eastward fog flow blankets the city more often than its neighbors.  Berkeley is the site of the oldest campus in the University of California system – the University of California, Berkeley. It is one of the most politically liberal cities in the United States.Arts and EntertainmentWith more than 100 cultural arts organizations, and hundreds more artists and performers, Berkeley is filled with world-class productions applauded by audiences and acclaimed by critics.  Given the temperate climate and beautiful landscapes, it is perhaps, not surprising that Berkeley boasts many award-winning golf courses.  The city has many parks and is a leader in the nationwide effort to re-tree urban areas. Tilden Regional Park, lies east of the city, occupying the upper extent of Wildcat Canyon between the Berkeley Hills and the San Pablo Ridge. The park features a steam train, carousel, Lake Anza and a botanical garden as well as many other opportunities to enjoy its scenic locale. The Berkeley Marina and McLaughlin Eastshore State Park offer year round water sports and hiking. César Chávez Park, hosts the Annual Kite Festival every July and offers a wide range of recreational opportunities in a marina setting with spectacular views of the three bay bridges, Alcatraz, and Angel Island.EducationBerkeley has 33 primary and secondary schools and is served by the Berkeley Unified School District. Nearby Emery Unified School District schools don't rank as high as Berkeley, while neighboring Piedmont City Unified scores higher, with a rating of 10 out of 10. Naturally, there are a vast array of collegiate opportunities in Berkeley."}