{"jobID": "2767424327", "jobLocation": "El_Dorado_Hills_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": "We are looking for a Data Analyst that will help us discover the information hidden in vast amounts of data, and help us make smarter decisions to deliver even better service for our customers, and contain the rising costs of healthcare. Your primary focus will be in applying data mining techniques, doing statistical analysis, and building high quality prediction systems integrated with our operational areas. You will ultimately produce new and creative analytic solutions that will become part of our core deliverables and enable us to ask better questions and deliver better business results. We are on the ground floor of an emerging capability in the health insurance sector. Bring your curiosity, creativity, and energy and help us turn our data into actionable insights. ResponsibilitiesData mining of claims, calls and membership data using state-of-the-art methods to find claim overpayments and other business optimization opportunitiesFulfilling ad-hoc reporting requestsProvide expertise on mathematical concepts for the broader analytics team and inspire adoption of advanced analytics across the organizationTranslate findings from data into consumable, actionable insightsExtending company’s data with third party sources of information when neededEnhancing data collection procedures to include information that is relevant for building analytic systemsProcessing, cleansing, and verifying the integrity of data used for analysisDoing ad-hoc analysis and presenting results in a clear manner from front-line employees to executive levelCreating automated anomaly detection systems and constant tracking of its performance3-5 years of experience in a quantitative profession in operations research, applied statistics, data mining, machine learning, or other quantitative discipline.Experience in Medicare and Medi-Cal healthcare highly preferred, but not required;Demonstrated strong ability to make the complex simple and consumable;Must be a data-oriented, highly curious individual.Understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.Experience with common data science toolkits, such as R.Great communication skills at all levels of leadership.Proficiency in using query languages such as SQL.Good applied statistics skills, such as distributions, statistical testing, regression, etc.Good scripting and programming skills.Experience with Tableau and SAS a plus.Education:Minimum a Bachelor's degree"}