{"jobID": "2810012068", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.adecco.co.uk", "Headquarters": "GLATTBRUGG, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (ADEN) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Data Science Analyst Estimated Length: 1 year Pay: $55/hr. - $60/hr. Location: Mountain View, CA Job Description: The \"\"World's Largest Search Engine\"\" is looking for a Data Science Analyst with distinctive analytical and problem-solving skills to develop a deep understanding of our process improvement. This role will collaborate with team members responsible for analyzing operation performance, uncovering cost, quality and scalability which leads planning to improve customer experience and reduce cost. Qualifications:Advanced experience with:Database query, SQLSpreadsheets (Google/Excel) and analysis experienceData analytical skills combined with impeccable business judgment and ability to communicate and influence effectively by presenting data in a compelling wayIncredibly strong skills to conceptualize experience within database relationships using diagrams and explain how databases interact with one anotherExcellent cross-functional leadership; able to work independently, part of a team and interact professionally with the influence of all organizationsPreferred background in Python Equal Opportunity Employer Minorities/Women/Veterans/Disabled  More Information  Company Description:Adecco is the world’s largest provider of staffing solutions. But it’s not our size that makes us different, it’s our unwavering commitment to the businesses, job seekers and communities we serve.  Every day, we propel job seekers forward in their career and help America’s top employers attract, develop and manage the very best talent. Job seekers rely on us for exciting temporary, temp-to-perm and permanent opportunities, as well as career resources and advice. Businesses throughout the country and across all industries count on us for access to more than 9 million qualified candidates and an ability to deliver proactive and actionable insight into the economy and the job market. We also sponsor community and nationwide community service events to ensure opportunities for all.  We are proud of the fact that we connect more people with more jobs than anyone else, and know how important what we do is - not only to the economy and job market, but also to the lives and communities we touch"}