{"jobID": "2766548159", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Field Applications Engineer", "companyRating": "3.0", "companyInfo": {"Website": "www.sensata.com", "Headquarters": "Attleboro, MA", "Size": "10000+ employees", "Founded": " 1916", "Type": " Company - Public (ST) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " To support Marketing and Sales activities. Our goal is to secure new business opportunities or enhanced share through engineering activities and market awareness with a tight link to customer engineering teams and a direct link to R&D; Engineering- Duties will include: Providing technical and project support in the area Performance Sensing (TPMS, Wireless & connected Megatrend) for pre-RFQ / RFQ and advanced development projects to our HVOR customer base, which can include tier 1 suppliers and Vehicle OEMs  Act as the main local technical interface  Work with other internal teams to ensure the company’s roadmap is well aligned to future market demands, focusing specifically in the near horizon through to local sustaining support  Capturing technical and project requirements to ensure products are developed according to our customers’ needs  Planning, preparing and conducting workshops & technical demos with customers  Translating the customer product expectations and requirements into effective product demonstrations  Preparing, conducting, documenting and assessing vehicle level testing  Providing the wider Sensata organisation with technical intelligence including market benchmarks and technical presentation material  Maintain direct links to Sensata Research & Development Engineering  Maintaining tight links with internal, sales, marketing and customer (OEM) engineering teams to ensure our organization is always up to date on all relevant technical and project developments/status Essential Criteria: Bachelor's degree in Electrical Engineering, Computer Science, with 3+ years’ experience in automotive R&D;, vehicle electrical architecture, and/or diagnostics  Team oriented and flexible working style with strong self-discipline  Strong motivation and drive, coupled with excellent organization skills  Excellent communication, program management and problem solving skills  Willingness to carry out hands-on work during the development of customer demonstrations and customer support activities  Willingness to travel sometimes at short notice, typically 30 – 40% burden of role  Experience dealing and negotiating with customers, preferably tier 1 suppliers or automotive OEMs  Programming Skills (e.g. CAPL, C, C++, Java, etc) to create bespoke GUIs for customer demonstrators based on existing generic example Desirable Criteria: Knowledge of relevant automotive systems (e.g. Telematics, ABS, EBS, ADAS, etc)  Knowledge of wireless technology and wireless applications (e.g. TPMS, RKE, Bluetooth, 802.15.4, etc)  Experience with the electrical bus architectures of automotive OEMs including CAN, ISO11992 J1939, LIN, and/or FlexRay, and the use of relevant tools to test and diagnose them (e.g. CANalyzer, CANoe, etc)  Programming Skills (e.g. CAPL, C, C++, Java, etc) to create new technology demonstration content from scratch.  -  -  Our employees are the reason we have been successful in the past and the reason we will be successful in the future. Employees’ skills, talents and work ethic have defined the business and will shape our collective future. Our Vision is to be:A world leader and early innovator in mission-critical sensors and electrical protectionSatisfying the world’s growing need for safety, energy efficiency and a clean environmentA partner, employer, and neighbor of choiceNOTE: If you are a current Sensata employee (or one of our Affiliates), please back out of this application and log into Workday via the Company Intranet to apply directly. Type FIND JOBS in the Workday search bar."}