{"jobID": "2823244238", "jobLocation": "San_Diego_CA", "jobTitle": "Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.motiveinteractive.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Liftoff (Palo Alto, CA)"}, "estimatedSalary": "50000", "jobDescription": " Motive Interactive is a global mobile app optimization and marketing company that combines over 15 years of experience in the digital advertising industry and sophisticated programmatic technology to drive user acquisition for some of the world's top mobile app companies including Amazon, Apple, and Pandora. In 2017, Motive Interactive was recognized as a top 20 partner by Singular's Mobile ROI index, a ranking that evaluates over 1000 mobile ad networks, 1500 apps, and over $3B in ad spend to identify the world's best-performing ad networks across the globe. Additionally, Motive is recognized as part of Inc. 5000's exclusive Hall of Fame list for its five-year consecutive rating as one of the fastest-growing private firms in America. To continue the build-out of our programmatic capability, we are looking for a candidate in one of the data-oriented principles to join our data team full-time. Responsibilities:Dive deep into our dataset and report to communicate business trends and opportunitiesVerify third party data and assemble large, complex data sets that meet business requirementsExpand and optimize our data and data pipeline architectures, as well as data flow and collection for cross-functional teamsWork with stakeholders including media buying, data scientist, and business teams to assist data related issuesDo ad-hoc data analysis, reporting and present results to the teamQualifications: US citizens and permanent residents only.2+ years of related work experience in analyticsA solid foundation in statistics, regression, correlation, etc.Strong SQL skills and experience working with relational databaseBasic understanding of ETL mechanismKnowledge of business intelligence, data visualization, and related toolsHighly analytical and detail orientedExcellent communicationsMaster degree in Mathematics, Statistics or related technical fieldsNice to have: God scripting and programming skills. Python skill is highly preferredUnderstanding f digital advertisingExperiences with setting up a data dashboardPerksRanked as one of San Diego's best places to work.Work in a fast-paced development environment where you will see the results of your work immediatelyA casual relaxed atmosphere with a results-driven mentalityCompetitive compensationHealth benefits: Medical/dental/vision benefits401KProfit from working with a team on the cutting edge of the mobile marketing and advertising industry.Quickly expand your skills as a mobile marketing professional and build a valuable network in one of the fastest growing segments of marketing.Awesome company events!"}