{"jobID": "2778575163", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Connected Vehicle Operations Data Analyst - PSP 616181", "companyRating": "4.6", "companyInfo": {"Website": "www.techrg.com", "Headquarters": "Troy, MI", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Looking for Data Analyst for our client in Michigan. Its a long-term indefinite contract with a possibility to become full-time employee. NO SPONSORSHIP AVAILABLE AT THIS TIME. Interested candidates, may please send their resumes - Payal Kakkar (pkakkar@techrg.com) or call at 248-202-7303. Looking for US CITIZEN or GREEN CARD HOLDER ONLY. Location : Auburn Hills, MI The Connected Vehicle Operations Data Analyst will work with internal as well as external cross functional teams including operations, engineering, product planning, forecasting, and finance, to generate and automate reports such as vehicle build and sold volumes, firmware versions on vehicles to support several reports. This person will act as a point of contact for all issues pertaining to factory VIN and data feeds and will work closely with engineering as well as IT teams to monitor, analyze, triage, and resolve issues. In addition, the Connected Vehicle Operations Data Analyst will support the connected vehicle operations team in triaging customer issues by looking up relevant information within various databases. Education: Bachelor's Degree Requirements: (DB Visualizer, SQL DBX, MS Access and Qlik Sense are used to generate reports) Requirements: Bachelors degree in Computer Science, IT (Not Master's degree)  3+ years current, continuous experience as a Data Analyst (Not Entry level) of e Experience in OEM Telematics/Connected  Services a plus. Proficient in database communication language SQL!!!!!!!!!  Experience in other programming language (Java) to automate reports  Experience in one of the following Qlik Sense, Eclipse for Java, DB Visualizer  Strong analytical and technical skills  Excellent organizational, multi-tasking and time management skills  Excellent written and verbal communication skills  Excellent knowledge in Microsoft Office (Excel, Word, Power Point)  Highly motivated & Team Player Travel and Driving Notes: May be required to drive a company car. A valid drivers license is required as well as a clean driving record."}