{"jobID": "2725453933", "jobLocation": "Menlo_Park_CA", "jobTitle": "People Research Scientist, PhD Intern/Co-op - Fall", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "126000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.At Facebook we pride ourselves on making data-informed decisions. This includes not only decisions we make about our platform, which serves over 2 billion users, but also how we learn more about Facebook's most important assetour people. The People Analytics team explores complex questions, and generates data-driven insights to attract, develop, motivate, and retain top talent.  Facebook is looking for a People Research Scientist Intern to join the People Analytics team, which designs and builds analytical solutions to help Facebook recruit, grow, and retain talented people. This is a full-time Fall Internship role based in Menlo Park, CA or New York, NY.  The ideal candidate will be a social scientist with expertise in quantitative research methodologies or a quantitative specialist with experience solving social problems. You'll be comfortable improvising and have the ability to work cross-functionally and thrive in a fast-paced organization.  This internship is an opportunity to work on cutting-edge people research problems. You'll also get the chance to work with and learn from great colleagues, who are smart, highly collaborative, and helpful. It's a great work environment with lots of benefits that you'll love. Responsibilities:"}