{"jobID": "2592434134", "jobLocation": "Parsippany_NJ", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " -Develop innovative TPO roofing products/manufacturing process for business impact and growth -Works on problems of diverse scope, including product/process development, product/process improvement, field issue resolution, manufacturing efficiencies, and outsourcing support -Provides technical direction for 1 to 2 major projects, having significant impact on sales or process efficiency. Simultaneously leads several other smaller projects. -Use advanced material characterization techniques to establish structure property relationships of materials and final product performance. -Manage technical business support for current products including raw material qualification, benchmarking of competitive materials and product/ system testing at external laboratories. -Required to network, internally and externally, to acquire information for projects and identify future opportunities -Required to fully develop and manage technical schedule for entire project from ideation through scale up to launch, including key tactical items for other functional areas -Publish technical reports and conduct presentations at regular intervals on key projects -Supervise lab technician for R&D; TPO projects -Must champion safety Technical knowledge/skills In depth understanding of TPO roofing product technology and end use, understands the impact of TPO roofing product design on field performanceIs regarded as TPO roofing product technology/manufacturing process expertHas knowledge of the industry segment for a single product, including key drivers. Understands competitive technologiesDevelops FFUs and translates into product specificationsIs practiced in the company’s scale up process from experiment, PTR, TDN, on to commercialization and RCNProven experience taking products from the lab, through manufacturing, to commercializationSkilled at reading and interpreting competitive art and patentsGeneral knowledge/skillsExcellent verbal and written communication skills with strong customer focusExcellent organizational and follow up skills with strong attention to detailAbility to meet time sensitive deadlinesAbility to adapt to a changing environmentKnowledge of company productsStrong analytical and problem solving skillsExcellent time management skillsStrong project management and vendor management skillsHighly motivated with the ability to work independently Demonstrable ability to use advanced statistical tools and design of experimentsEducation/ExperienceBS or MS in a physical science with 5 to 10+ years in new product development experiences, orPhD in Chemistry or Chemical Engineering with minimum 2 years industrial working experiences"}