{"jobID": "2804004932", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.devselect.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Title: Data Engineer  Location: Chicago, Ill  Openings: 1  Type: Permanent hire  The Client is searching for an experienced data engineer. This person will be responsible for building and managing an array of data acquisition services. The Ideal candidate will demonstrate experience with software development lifecycles, working with cloud architecture, and development within a software team.  Responsibilities include data mining, web scraping, cleaning and organizing the data into both SQL and NoSQL databases. Further responsibilities will include building ecient APIs to communicate the data and managing continual data ingestion. Required Job Qualifications:At least 4 years experience with python development and database management in a Linux environmentExpertise in relational database architecture and ecient SQL. Experience with managing databases in Azure is a plus as well as Neo4j graph databases.Development of RESTful APIsDistributed computing (Spark or similar)Ability to provide guidance on data security issuesWriting and maintaining clear and reproducible documentation for all services and projects will be required.Strong general communication and interpersonal skillCapable of providing guidance to junior developersPreferred Job Qualifications:Experience in machine learning and general data scienceData visualizationUnderstanding of the healthcare industryAzure, Google, AWS or other cloud-platform experienceSDLC Tools & Processes: JIRA, Docker, Git-flow, Puppet, or similarEducation Requirements:B.Sc. in Computer Science, Engineering, or related field."}