{"jobID": "2804003436", "jobLocation": "Arlington_VA", "jobTitle": "Beverage Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.imiagency.com", "Headquarters": "Woodstock, GA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Description: The Beverage Data Analyst will provide full-time analytical services, within a corporate office environment to one of IMIs lodging clients in Arlington, VA. Essential Functions: Responsible for developing advanced skills and knowledge of data platforms including Avero, Fintech and TM1  Responsible for running, interpreting, and analyzing reports using a variety of programs  Responsible for making recommendations to the client for applicable operational changes based on findings  Will work with the clients VP of Food and Beverage and Senior Beverage Coordinator to create and implement programs, improve operations and increase sales  Responsible for developing metrics to measure program results Job Requirements: Minimum of 3 years of experience with data analytics (pricing, sales, product assortment, etc.), preferably in the hospitality or beverage industry  Advanced Microsoft Excel, Access and pivot table skills as a minimum  Operational experience in the hotel and/or food & beverage industry preferred  Experience with Avero and/or Fintech preferred  Must have strong organizational, time management, and communication skills  Must be able to prioritize work assignments and work under minimal direction  Must be a self-starter, problem solver, and have great attention to detail  Capable of working inside a Client environment while reporting to the Client and IMI Management  IMI Agency is an industry leading beverage marketing consulting firm serving national chain hospitality operators across North America. IMI is known for its creativity and technology, providing Building Better Beverage Business for its Clients and investing beverage supplier partners. For more information, please visit www.IMIagency.com."}