{"jobID": "2783303468", "jobLocation": "Irving_TX", "jobTitle": "GCB Data Quality Analyst (Data/Information Mgt. Manager)", "companyRating": null, "companyInfo": {"Website": "www.citigroup.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1812", "Type": " Company - Public (C) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Citi’s Global Consumer Business Operational Risk and Controls (CBORC) organization drives global consistency for addressing Operational Risk and Control issues in the Global Consumer Bank. CBORC fosters a culture of control and customer centricity and accountability by leading efforts to identify, anticipate and mitigate regulatory, reputational, and operational risks.A key component of this Organization is the GCB Data Governance team, which drives the data management discipline and culture that values information in support of GCB’s business strategies. GCB Data Governance is responsible for the implementation of the data guidelines, standards and controls to protect Citi’s critical information asset, data. Data must be managed to ensure GCB meets its regulatory obligations, but also to create opportunities to leverage the data for innovation, competitive advantage and enhanced operational efficiencies. To further drive our investment in this area, the GCB Data Governance team is looking for individuals to help support their global data quality initiatives.PURPOSE OF JOBWorking with business and IT data stewards and data managers: assist in leading data quality initiatives, propose defect prevention processes and techniques, assist with data quality assessments, root cause analysis and coordinate data quality improvement efforts. Works closely with cross-functional team members in the development and delivery of data quality business solutions. Independently performs complex work assignments and problem resolution across systems, processes, and channels. Creates, communicates, and delivers business solutions. Develops and ensures understanding and adoption of common Data Quality processes and other standards.JOB DUTIESDevelops processes to streamline data quality measurement, monitoring and remediation across Citi’s lines of business and enterprise data flows.Assist in measuring and monitoring data quality and identifying business impacting data quality issues.Assists in conducting data quality assessments and derive metrics for the data elements of most business valueAssist in identifying the perceived versus real data quality issues and assure explanation of perceived problems to all stakeholdersAssists and provides data collection and data transformation processes to determine the cause of systematic errors or data quality improvement opportunitiesUpon finding root causes of errors, assists with solution or options for correction and preventionAssesses and provides metrics of the data quality characteristics (e.g., validity, integrity, accuracy, completeness, timeliness control) and CDE metadata (e.g., availability, relevance, usefulness, accessibility, and definition)Provides a framework for determining the priority of data quality correction activitiesCoordinates data correction processesDevelops and maintains working relationships with business leaders/strategy owners"}