{"jobID": "2796299484", "jobLocation": "Chicago_IL", "jobTitle": "B - Data Science Manager", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " B - Data Science Manager DATE 1 Mar LOCATION Chicago COMPENSATION $160,000.00 KEY SKILLS DESCRIPTION  Retailer and ecommerce is seeking exceptional Data Science Talent to deliver $100M+ margin enhancing projects. This is the remit from the CEO to the Chief Data Scientist, and now they are seeking an experienced Data Science leader with track record in delivering large scale projects utilizing Machine Learning and Optimization techniques.  This is a Hadoop, Spark, Python and R shop, and applicants should be willing and able to lead from the front technically. Contributing and providing guidance to direct reports and juniors with the above technologies. Those from Engineering, Architecture and strategy backgrounds who have moved into Data Science are also encouraged to apply.  This is an opportunity to join an incubated think tank environment, with the scale of a blue chip. You will support the Chief Data Scientist with the strategy and in the delivery of huge, highly visible projects in a number of departments including Pricing, Marketing, Inventory and Logistics.  Desired Skills and Experience  • Experience as a data science expert, demonstrated big data and machine learning innovation  • Expert with machine learning – text mining, NLP, neural networks, Spark, Python, R, etc.  • Familiarity with Hadoop ecosystem a plus  • Track record of delivering complex Machine Learning or Optimization projects  • Strong academic background, ideally with a PhD in an a field associated with data science/ predictive analytics i.e. Computer Science, Electrical Engineering, Statistics, Operations Research, Machine Learning While a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an  agent please contact one of our regional offices. Utmost confidentiality and discretion is assured."}