{"jobID": "2726407834", "jobLocation": "San_Francisco_CA", "jobTitle": "Accounting Advisory Manager", "companyRating": "4.3", "companyInfo": {"Website": "www.bpmcpa.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Novogradac & Company, Moss Adams LLP, Armanino"}, "estimatedSalary": "104000", "jobDescription": "BPM OverviewBPM is a full service accounting firm providing comprehensive assurance, tax, and consulting services to clients globally. We are one of the largest California-based accounting firms and have built our success by focusing on our clients and our people. Our client base encompasses a complex array of sophisticated clients that keep our staff intellectually challenged every day.Our people-centered culture and firm motto Because People Matter has allowed us to be consistently recognized as one of the Best Places to Work in the Bay Area. We are dedicated to providing meaningful careers for all of our employees along with fostering an environment that allows an integrated lifestyle. Our flexible culture allows our professionals to live a balanced lifestyle between their work responsibilities and personal commitments.Learn more about BPM on Glassdoor or our key leaders on LinkedIn like Jenise Gaskin and Mark Leverette. You will likely meet some of these people during your interview process!Accounting Advisory OverviewBPMs Accounting Advisory team provides comprehensive financial and business advisory services to private, owner-run companies, including family-owned businesses and start-ups. We do this by conducting audits for presentation to investors, representing companies in securing loans and financing, developing succession plans and exit strategies, and supporting company growth through tax planning, risk management, system and processes optimization and merger and acquisition integration. In addition, as part of the Advisory Service line we work with clients on their ERP system implementation needs.We Have: A unique people-centered culture that attracts the brightest and most forward-thinking accounting professionals.The resources, expertise, and global capability of a Big Four accounting firm together with the responsiveness and accessibility of a local firm.A regional presence in the Bay Area, while still serving our clients nationally and internationally.Recognition as one of the Bay Areas Best Place to Work and No. 1 Best Large Accounting Firm to Work for by Accounting Today.You Will (Job Responsibilities):Oversee, supervise and manage multiple accounting services for a variety of clients.Research new technologies and innovations to solve specific related business needs.Responsible for managing most of the day to day accounting for multiple clients.Assist in month-end close to include A/P, A/R, journal entries, account reconciliations and assisting in preparation of financial statements.Set budgets, select staff and assign workloads, and financial reporting.Develop and maintain client relationships, thus driving clients' satisfaction.Research, understand and apply complex accounting concepts.Develop, motivate and mentor staff by providing training, regular feedback and career guidance while fostering a team environment.Draft and assist in the delivery of proposals for engagements by knowing the range of firm services.Participate in special projects for our clients that provide further growth and learning experiences.Competently analyze and prioritize information to make appropriate recommendations.Ability to understand client needs, identify root causes of problems and implement pragmatic solutions.Continuous networking with industry peers and technology vendors to understand the latest and most innovative ideas and solutions.You Have (Requirements):6+ years experience with a focus on delivering innovative system solutions to drive company success.BS/BA degree in Accounting, Finance or related field; Master degree a plus.Experience with job costing process for new development and capital projects at existing properties; including ancillary accounting activities like contracts and terms, budgets, change orders, progress billing, etc.Advanced knowledge of and experience working with one of the following platforms: Yardi, AppFolio, MRI, NetSuite, Sage Intacct, RealPage, Entrata, or QuickBooks.Demonstrated management experience with increasing levels of responsibility.Experience developing and mentoring junior level staff.Excellent oral and written communication skills.Excellent time management skills and are a self-starter.Strong presentation skills, with the ability to address both executive and technical level audiences.Ability to grasp and explain technology solutions quickly; You need to be able to build a great message and deliver it.Leadership Skills:Ability to think strategically.Knows what it takes to give your business the competitive advantage. Ability to operate at a high level in a dynamic environment.Can develop relevant, sustainable solutions.Aligns the right resources to the task at hand; foresees and plans around obstacles.Attacks everything with drive and energy with an eye on both the bottom line and customer success.Develop talent at all levels, and is involved in the recruitment and hiring of new team members.A real influencer. Someone who gets passionate about things and motivates everyone around them.You are collaborative, proactive, creative, entrepreneurial, have a healthy appetite for feedback, and thrive in high-pressure situations.LinkedIn Code: #LI-AW2"}