{"jobID": "2824928700", "jobLocation": "Plano_TX", "jobTitle": "Principal-Big Data Software Engineer (AdCo)", "companyRating": "3.4", "companyInfo": {"Website": "www.att.jobs", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1983", "Type": " Company - Public (T) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Verizon, T-Mobile, Sprint"}, "estimatedSalary": "106000", "jobDescription": " As a Data Engineer in our Chief Data Office organization you'll be responsible for interpreting the requirements of various big data analytic use cases and scenarios. Here you will drive the design and implementation of data products to ultimately support key business decisions through insights from a combination of both external and AT&T; specific data assets. As an integral member of our dynamic team, you'll have an opportunity to develop the necessary enablers and data platforms in the data lake environment and have responsibility for maintaining data integrity during the life cycle phases. KEY ROLES AND RESPONSIBILITIES:Define requirements, capture and mine large scale structured and unstructured data, and validate results by running tools in the big data space.Build and develop the data products and solutions in cloud platforms (AWS and Azure) leveraging approved PaaS components,primarily through software development throughout the vertical stackYou will support the standardization, customization and ad-hoc data analysis, and develop the mechanisms to ingest, analyze, validate, normalize and clean data.Implement statistical data quality procedures on new and existing data sources, and apply rigorous iterative data analytics, support Data Scientists in data sourcing and preparation to visualize data and synthesize insights of business value.Work with data policy, security teams and legal to craft data policies and develop interfaces and data models supporting the anonymization of data.Develop and maintain data engineering standard methodologies and contribute to Insights on data analytics and visualization concepts, methods and techniques.Solves unusual problems through evaluative discernment/precedent. Independently applies sophisticated analysis in evaluating issues.Develop new concepts/methods/techniques for multi-functional initiatives. Recognize and pursue creative and ground breaking alternative methods.Serve as a mentor and provide technical guidance and explaining advanced concepts to others in the work area. Collaborate with teams across multiple departments. Promote active listening and open communicationAdditional Information:Masters of Science in Computer Science, Math or Scientific Computing with 8+ years experience ORBachelors of Science in Computer Science, Math or Scientific Computing with 10+ years experience8 - 10+ years combined development experience including the data and application development with Java and all related technologies in the Java stack (e.g. Spring)3+ year experience in Hadoop with deep knowledge around all the Hadoop ecosystem (EMR, Hive, pig, Spark/scala, Python, Kafka, HBase, Elastic search and log stash a plus)5+ years of experience working in Linux/UnixDeep understanding and experience with performance and performance tuning for complex S/W projects mainly around large scale and low latencyHadoop/Java certifications are a plusExcellent interpersonal skillsAbility to work in a dynamic, team oriented environment. Job ID 1821885 Date posted 05/14/2018"}