{"jobID": "2746950322", "jobLocation": "Chicago_IL", "jobTitle": "Experienced Quantitative Researcher", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is searching for a Quantititative Researcher to work in their Chicago office. The ideal candidate will be expected to conduct quantitative research on proprietary risk factor models for equities and other asset classes for both fundamental and quant equity long-short strategies. Responsibilities:Responsible for the entire model evaluation process, including factor selection/recognition, factor return estimation, covariance estimation, idiosyncratic volatility estimation etc.Conduct research in stress scenarios; build individual equity stress scenario evaluation models and provide full coverage for the equity long-short strategiesIntegrate multiple data sources in model building; utilize PCA approach to identify factors.Develop & test new risk/alpha factors and new data sourcesWork with various teams to aggregate information from a variety of sources to create detailed and accurate reports representing the risk and portfolio construction of their investment portfolios.Pragmatically establish links between the numbers on reports and the impact to the business.Work closely with Risk Managers, Portfolio Managers and Analysts to understand and incorporate risk metrics and methodologies within the investment process.Requirements:Long/Short Equities Risk ManagementAdvanced training in Statistics, Mathematics, Finance/Financial Engineering or a related fieldStrong mathematical and/or statistical modeling backgroundDemonstrated empirical skill; comfortable with analysis of large datasetsIntellectual curiosity and passion for solving investment problems through the use of technology and fundamentalsDemonstrated interest in or knowledge of investments, including asset pricing, empirical anomalies and market micro-structure;Previous exposure to a quantitative role within a trading and risk modeling/management environment preferredExperience using statistical packages (e.g. Matlab, R) and exposure to programming & scripting languages (e.g. C/C++, Perl)"}