{"jobID": "2835217033", "jobLocation": "Houston_TX", "jobTitle": "Staff Data Engineer- Financial Mgt", "companyRating": "3.6", "companyInfo": {"Website": "www.ge.com", "Headquarters": "Boston, MA", "Size": "10000+ employees", "Founded": " 1892", "Type": " Company - Public (GE) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Philips, Siemens, Microsoft"}, "estimatedSalary": "78000", "jobDescription": "About Us: GE is the world's Digital Industrial Company, transforming industry with software-defined machines and solutions that are connected, responsive and predictive. Through our people, leadership development, services, technology and scale, GE delivers better outcomes for global customers by speaking the language of industry.  GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Role Summary:  Deliver the architecture, design, and implementation for automated analytics and reporting to support the new 2018 new simplified billing model (costs received from CoreTech and other GE Corporate, integration of all data sources to provide app TCO, variance analysis). Essential Responsibilities: Deliver the architecture, design, and implementation for automated analytics and reporting to support the new 2018 new simplified billing model (costs received from CoreTech and other GE Corporate, integration of all data sources to provide app TCO, variance analysis).Partner with the Finance Steering Team, DT FP&A; contacts, the Strategy and PMO organization, and Corporate DT to assess and align data requirements for the DT Finance organization,Update/modernize data visualization feedsSupport the data and reporting requirements for the cost-out automated reportingIntegrate cost-out data to enable a single view of cost-out for DTProvide support to FP&A; for analyzing and tracking financials (design, automate, integrate),Qualifications/Requirements:Basic Qualifications:"}