{"jobID": "2830393035", "jobLocation": "Washington_DC", "jobTitle": "Interdisciplinary General Engineer/Physical Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.energy.gov", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1977", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Duties Help Duties Summary  This position is located within the U.S. Department of Energy (DOE), Energy Efficiency and Renewable Energy (EERE), in the Bioenergy Technologies Office (BETO).  The Office of EERE is the lead Federal government organization for energy efficiency and renewable technology research and development. The mission of EERE is to strengthen America's energy security, environmental quality, and economic vitality through public-private partnerships that promote energy efficiency and productivity, bring clean reliable, and affordable energy technologies to the marketplace, and make a difference in the everyday lives of Americans by enhancing their energy choices and their quality of life.  BETO is responsible for enabling the widespread commercialization of bioenergy technologies through applied research, development, deployment and demonstration, and focused efforts to the overcome market challenges.  A successful candidate will serve as a scientific and engineering advisor on energy efficiency and renewable energy technology research and development related to bioenergy technology. Supporting technology readiness through system-level analysis which includes: evaluating technologies and pathways, guiding the selection of research, development, and demonstration (RD&D;) technological approaches/options, estimating the potential value of RD&D; efforts, and reporting on the evaluation of infrastructure development approaches.  This position is being filled as a General Engineer or Physical Scientist at either duty location in Golden, CO or Washington, D.C. This will be determined at time of selection. Below are the salary for the GS-13 for each duty location. Golden, CO: $94,890.00 - $123,358 (including locality payment for Denver-Aurora, CO);Washington, D.C.: $96,970.00 - $126,062.00 (including locality payment for DC-MD-VA-WV-PA) This is an Interdisciplinary position which may be filled under any of the following titles and occupational series, depending on the qualifications of the applicant and needs of the agency: General Engineer, 0801Physical Scientist, 1301 Learn more about this agency Responsibilities As an Interdisciplinary General Engineer or Physical Scientist, you will: Establish relevant bioenergy program including: scheduling, milestones, deliverables, and resource requirements. Monitors program execution, conducts in-process reviews, and informs the Office Director on the program meeting performance, scheduling, and cost requirement goals and the need for program adjustments.Manage early stage research and development (R&D;) and complex engineering systems to ensure that individual unit operations support the overall goals of enabling production of biofuels, bio-products, and bio-power.Lead bioenergy technology studies designed to assess the benefits of biofuels and bio-products (on a life-cycle basis) for diverse applications and quantifies the benefits of integrating production.Serve as a liaison between research teams including those at multiple National laboratories, industrial, academic, and other governmental entities conducting research, as well as, scale-up of innovative technologies in the area of bioenergy-related technologies to ensure that R&D; goals are achieved and that cohesive and accurate date is being acquired.Design, plan, oversee, and analyze experiments including the design, construction, and trouble-shooting of specialized test set-ups and methods that are being tested in a relevant environment for the first time to ensure that the capability of the test and measurement systems, methods, and protocols are consistent with experimental needs. Travel Required  Occasional travel - 10% or less travel may be required  Supervisory status  No  Promotion Potential 13 Who May Apply This job is open to Internal Agency Employee  Questions? This job is open to 1 group. Job family (Series) 0801 General Engineering  1301 General Physical Science  Similar jobs Engineers, All OtherRequirements Help Requirements Conditions of Employment You must be a United States Citizen.This employer participates in the e-Verify program.Males must abide by Selective Service registration requirements.Must meet time-in-grade requirement by the closing date of the announcementYou must be a current DOE federal employee in the competitive service.May be required to complete a one-year probationary period.OTHER REQUIREMENTS: You must be a current Department of Energy career-conditional or career appointment Federal employee with competitive status.  You must submit an unofficial or official transcripts by the closing date of this vacancy announcement. NOTE: Failure to provide transcripts will result in you being rated ineligible for this position.  If selected, an official transcript will be required prior to entering on duty.  May be required to complete a one-year probationary period.  You must meet both the positive education requirement known as \"Basic Requirements\" and Specialized Experience as described in the \"Qualification\" section of the vacancy announcement. QualificationsBASIC REQUIREMENTS:FOR GS-0801, GENERAL ENGINEER: A. Degree: professional engineering. To be acceptable, the curriculum must: (1) be in a school of engineering with at least one curriculum accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in 5 of the 7 areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials; and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. OR B. Combination of education and experience--college level education, training, and/or technical experience that furnished (1) thorough knowledge of physical and mathematical sciences underlying professional engineering, and (2) good understanding, both theoretical and practical, of engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following: Professional registration-Current registration as a professional engineer by any State, District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test are eligible only for positions that are within or closely related to the specialty field of their registration.Written Test-Evidence of having successfully passed the Engineer-in-Training (EIT) exam, or written test required for professional registration, which is administered by the Boards of Engineering Examiners in the various States, District of Columbia, Guam, and Puerto Rico.BASIC REQUIREMENT FOR GS-1301, PHYSICAL SCIENTIST: A. Degree: physical science, engineering, or mathematics that included 24 semester hours in physical science and/or related engineering science such as mechanics, dynamics, properties of materials, and electronics. OR B. Combination of education and experience -- education equivalent to one of the majors shown in A above that included at least 24 semester hours in physical science and/or related engineering science, plus appropriate experience or additional education.  In addition to meeting the \"Basic Requirements\" described above, applicants must also have at least one year of specialized experience, equivalent to the GS-12 grade level in the Federal service. SPECIALIZED EXPERIENCE REQUIREMENTS: Specialized experience is experience that equipped the applicant with the particular knowledge, skills, and abilities (KSA's) to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled.  A qualified candidate's online application and resume must demonstrate at least one year of specialized experience, equivalent to the GS-12 grade level in the Federal service. Specialized experience for this position is defined as: experience conducting and managing research and development programs in the areas of bioenergy, biofuels and bioproducts or biochemistry; and/or serving as a technical authority in bioenergy or biochemistry research and development missions.  Your application and resume should demonstrate that you possess the following knowledge, skills and abilities (KSAs). Do not provide a separate narrative written statement. Rather, you must describe in your application how your past work experience demonstrates that you possess the KSAs identified below. Cite specific examples of employment or experience contained in your resume and describe how this experience has prepared you to successfully perform the duties of this position. DO NOT write \"see resume\" in your application! Knowledge of scientific or engineering principles, theories, and methodologies, as it relates to bioenergy or biochemistry research and development.Skill in coordinating scientific and engineering studies and analyses involving the application of experimental theories or new applications or developments to bioenergy or biochemistry research and development.Ability to develop and assess progress toward bioenergy or biochemistry systems technology research and development program requirements, long-term goals and objectives, and schedules for the accomplishments of applied research and development, full-scale demonstration, and deployment.Ability to communicate effectively with individuals and groups at all levels, both orally and in writing, lead teams via direction and influence to achieve established goals and targets.Ability to synthesize past results, scientific and engineering principles, and broad objectives to develop and document strategies, intermediate targets, and tactics for future activities to meet technology development goals. \"Experience\" refers to paid and unpaid experience. Examples of qualifying unpaid experience may include: volunteer work done through National Service programs (such as Peace Corps and AmeriCorps); as well as work for other community-based philanthropic and social organizations. Volunteer work helps build critical competencies, knowledge, and skills; and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.  CTAP/ICTAP candidates: To be considered \"well qualified\" you must meet all of the requirements as described in this section. Education This position has positive education requirement.  For additional information regarding education requirements described above for the GS-0801, General Engineer can be found at following website:  https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/0800/all-professional-engineering-positions-0800/  Additional information regarding the education requirements for GS-1301, Physical Scientist can be found at the following website: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/1300/general-physical-science-series-1301/  Education must be obtained from an accredited institution recognized by the U.S. Department of Education. Applicants can verify accreditation at the following website: http://www.ed.gov/admins/finaid/accred/index.html  Foreign education must be reviewed by an organization recognized by the U.S. Department of Education. For special instructions pertaining to foreign education and a list of organizations that can evaluate foreign education, see the Department of Education website."}