{"jobID": "2811512474", "jobLocation": "San_Francisco_CA", "jobTitle": "Regional Sales Manager - Mid Market", "companyRating": null, "companyInfo": {"Website": "www.cornerstoneondemand.com", "Headquarters": "Santa Monica, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Public (CSOD) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " SAP, Oracle"}, "estimatedSalary": null, "jobDescription": "We're looking for a Regional Sales Manager - Mid Market (San Francisco, CA)We are seeking a proven software sales executive to sell our state-of-the-art Talent Management Software Suite to prospects in several US regions. The ideal candidate will have a proven ability to successfully sell mid-market software solutions to senior-level executives of companies ranging from 500 - 5,000 employees.  You will work remotely and sell into a regional marketplace. Your initial training will take place in Santa Monica, CA. Compensation is competitive and commission is generous. In this role you will...Be a Hunter: You are going after new logo businessBuild account plans and strategies for each target accountQualify sales opportunities; build and manage sales pipeline in the territoryBuild and maintain an accurate and robust sales pipelineCoordinate sales team efforts for optimal deliveryDrive sales activities in the territory consistent with best practices; build consensusMeet quota/margin objectives for the assigned territoryStrong Inside Sales, Marketing and Sales Engineering supportDevelop, negotiate and close long-term agreement with accounts in your assigned territoryConduct virtual and live presentations around our solutions... and being the rockstar you are, be willing to take on additional responsibilities as neededYou’ve got what it takes if you...A minimum of 5 years business services and/or software sales experience, successfully selling solutions or services at the executive levelTrack record of exceeding company sales quotasAggressive, hard-working, persuasive, persistent, self-motivated, and productiveMulti tasking and strong time management skillsExcellent communication skills and analytical skillsMust be comfortable demonstrating software and speaking to technical and non-technical executives alikeExperience with CRM tools like SalesForce.com and Microsoft OfficeExtra dose of awesome if you...Have experience selling HR-related software or servicesOur Culture: Our mission is to empower people, businesses and communities. A culture created less by what we do and more by who we are. When people are asked to describe the team, the answer is always the same: Smart, Cool, Dependable, and Visionary. We are not a typical tech company (even with our unlimited vacation, paid sabbaticals, generous stock units, education reimbursement, and 100% paid employee health coverage), because, well, our employees aren't your typical techies...  We're always on the lookout for new, curious and capable people who can help us achieve our goal. So if you want to work for a friendly, global and innovative company, we'd love to meet you! What are you waiting for? What We Do: Cornerstone OnDemand (NASDAQ: CSOD) helps organizations to recruit, train and manage their people. We work with hundreds of the world’s largest companies—from Walgreens and Starwood Hotels & Resorts to Deutsche Post DHL and Xerox—and thousands of smaller ones to help them engage their workforces and empower their people. Our software impacts every aspect of the employee experience, helping people to make their best work even better – which ultimately translates into greater business results.  Our software and services are in use by over 36 million people in 192 countries and in 43 languages.  Check us out on Linkedin, The Muse, Glassdoor, and Facebook!  Equal Employment Opportunity has been, and will continue to be, a fundamental commitment at Cornerstone OnDemand. All qualified applicants are given consideration regardless of race, color, gender, age, sexual orientation, national origin, marital status, citizenship status, disability, veteran status, or any other protected class as provided in applicable Federal, State, or Local fair employment laws. If you have a disability or special need that requires accommodation, please contact us at careers@csod.com.  #LI-CT1"}