{"jobID": "2815047945", "jobLocation": "Detroit_MI", "jobTitle": "Research Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.wayne.edu", "Headquarters": "Detroit, MI", "Size": "5001 to 10000 employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Posting Details Posting Number 043624 Position Title Research Scientist Number of Vacancies 1 School/College/Division/Institutes/Centers 06 - School of Medicine Primary Department H0632-Oncology Essential Functions (Job Duties) Develop, validate, and implement LC-MS/MS methods to quantitatively determine small molecule drugs and metabolites in biological samples to support preclinical and clinical drug metabolism and pharmacokinetic studies.  Develop novel LC-MS/MS based methods for metabolomic profiling.  Develop and implement novel sample preparation and separation strategies.  Apply LC-MS/MS to identify chemical structures of unknown metabolites.  Design and perform cell and biochemical based assays to measure cell growth/death pathways, mRNA and protein expression, and other mechanistic read-outs.  Participate in managing the day-to-day operations of a laboratory, including but not limited to, daily instrument maintenance.  Organize and implement laboratory SOPs for sample processing and analysis.  Participate in data analysis/interpretation and writing manuscripts for publication. Unique Duties Qualifications PhD degree in chemistry, biochemistry, molecular biology, pharmacology or other appropriate discipline.  At least 3-year laboratory experience with a strong background in analytical chemistry or molecular biology.  Extensive experience in HPLC-based bioanalytical techniques.  Experience in cell and molecular biology techniques, such as RT-PCR, ELISA, Western blot, immunohistochemistry, immunofluorescence, gene transfection, RNAi, reporter assays.  Ability to work independently and communicate effectively.  Ability to interpret and summarize scientific data in a clear, concise and accurate manner.  Excellent organizational skills, with the ability to efficiently manage and prioritize multiple projects.  Excellent oral and written communication skills Preferred Qualifications Applicants can send CV and cover letter to Dr. Jing Li at lijin@karmanos.org. Testing Requirements Not Applicable Test Scheduling Working Conditions Job Type Full or Fractional Time Job Category Research Assistants/Associates"}