{"jobID": "2809802166", "jobLocation": "Cranbury_NJ", "jobTitle": "Senior Scientist Biochemical Characterization", "companyRating": null, "companyInfo": {"Website": "www.oncobiologics.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About the OrganizationMission Statement: Oncobiologics is a publicly traded biopharmaceutical company focused on the advancement of its pipeline of biosimilar products, two of which are currently in clinical development. Led by a team of biopharmaceutical experts, Oncobiologics operates from a state-of-the-art 40,000 sq. ft. fully-integrated R&D; and manufacturing facility in Cranbury, NJ. The company employs its BioSymphony development model to ensure that biosimilar assets meet the stringent requirements of U.S. and European regulators, while also achieving accelerated development and technical excellence in creating affordable medicines for global patients who so urgently need them.  Oncobiologics provides a scientifically disciplined and speed-to-market approach to biosimilar development. By leveraging its scientific talent and technical infrastructure, the company has established a unique CMC engine designed to provide scientific rigor, speed and cost efficiencies. Through these capabilities, Oncobiologics is uniquely positioned to deliver a robust CMC package as required by the FDA, EMA and other regulatory bodies. The company is executing a commercial strategy to advance its biosimilar assets to global markets.  Oncobiologics actively fosters a collaborative, entrepreneurial culture. With years of experience in large organizations, the Oncobiologics team understands the critical importance of agile, rapid decision-making and strives to infuse all activities with urgency, creativity and disciplined thinking. Key Facts: Founded January, 2011  Employees: ~64  Focused on the development of 'large molecules' (i.e., biologics) Description Opportunity and Summary of Position: The main mission of the Biochemical Characterization group in Analytical Sciences is the development and validation of physicochemical methodologies and assays for process-related impurities. As part of this overall goal, the candidate would be required to develop methodologies, create experimental plans, and execute studies which assess the physicochemical stability of biologic drug candidates. This includes generating, documenting, and analyzing data for team and senior management discussions and development reports. Reporting Relationships: Reporting to the Director of Biochemical Characterization, Analytical Sciences. Position Responsibilities:Perform method development and validation to support the cross-functional team.Perform testing as needed using the instruments such as spectrophotometer, capillary electrophoresis (CE-SDS, cIEF), chromatography (HPLC/UPLC), SEC-MALS, plate reader (ELISA), and qPCR.Lead junior scientists in the group to provide expertise in instrument maintenance and troubleshooting as well as resolution of OOS and OOT results.Maintain the tidiness in the laboratory while following the safety guidelines provided by EHS.Keep real-time experiment records in ELN and prepare documents (SOP, protocol, report).Contribute to departmental activities such as new instrument purchasing, laboratory safety inspections, and internal audits. Position Requirements Candidate Qualifications: The company is seeking an individual with the following qualifications and who is willing to make a long-term commitment to the organization:  Education/Certification  MS/PhD in Chemistry, Biochemistry, or related field with 6+ years of experience with MS or 4+ years of experience with PhD in the Analytical laboratories in pharmaceutical or biopharmaceutical industry.  Qualifications and Skills Must have clear understanding of method development and validation under regulatory guidelines.Must have demonstrated the ability to work independently with little supervision and be flexible with changing project timeline.Solid understanding of the principles and practices of analytical technologies applicable to the biological drug products are required.Experience in the analysis of monoclonal antibody therapeutics and the basic statistical analysis are highly desirable.Familiarity with CMC and GMP requirements is desirable.Excellent verbal and written communication skills are required. LocationOncobiologics EOE StatementWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law."}