{"jobID": "2835292420", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.atlassian.com", "Headquarters": "Sydney, Australia", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public (TEAM) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " GitHub"}, "estimatedSalary": "124000", "jobDescription": "Job DescriptionAre you passionate about exploring and analyzing data, presenting your findings, and driving serious change? If so, this role is for you. As a Senior Business Analyst on our Customers Success and Support team, your primary focus will be driving our business to the next level via data and analytics. From predicting customer pain points to identifying opportunities for better customer experience, your work will drive strategies to improve our business at every level.Some examples of what you will be doing are:Dig into a variety of large data sets and identify trends, gaps, and opportunities to move business forwardDesign and carry out experiments informing data-driven decisionsDefine metrics/KPIs and provide reporting to show how our business is going (up to the right)Work closely with data engineers to build a scalable data infrastructure for analyticsUse data visualization, statistics, and story telling to effectively answer open-ended business questionsPresent your awesome data results and recommendations to senior leadersSome examples of the skills and tools you'll use are:Analytics: Statistics, data distributions, summary/aggregation methods, operational KPI development, experiment design and analysis, confidence intervals and sampling theory, regression models (linear, ordinal)Data: Star schema data models, data extraction via SQL/HQLTools: R, Python, Tableau, SourceTree, Bitbucket, etcYou'll work together with other analysts, data engineers, project managers, and subject matter experts to deliver impactful outcomes to the organization. You'll participate in multiple concurrent high-visibility projects along with occasional ad hoc questions from your internal customers.The job is more than just numbers; to be successful you'll need to deeply understand the business and be comfortable engaging with business leaders and team members in a global organization.More about youYou've been working with data for 5+ years and have a BS degree in Statistics, Mathematics, Economics, Computer Science or other quantitative discipline. You love data exploration, playing with numbers, and presenting information in simple and impactful ways. You value high-quality work with attention to detail and have a track record of delivering both. You combine curiosity with critical thinking and good judgment, and like asking \"why\" to unravel a seemingly complex problem and get to the root cause. You know how to gather, document, and interpret business requirements.When you encounter a problem you come up with multiple solutions, weigh the tradeoffs and efforts, identify the best path forward, and exercise good judgment to drive ahead. You're comfortable interacting with people across all levels of an organization and can field questions during a presentation like a pro. You're self-driven and find ways to be impactful.To keep pace with our rapid growth and evolution you learn new things quickly. You can take an ambiguous assignment and derive valuable insight. You use multiple tools and methods to find trends and correlations by mining data, and couple that with intuition and quick tests to prioritize how to drive forward on complicated problems.More about our teamYou'll be joining a growing analytics and project delivery team located in multiple regions across the globe. We challenge each other constantly to improve our work and ask hard questions. We're direct, focused, and demand excellence, but there's laughter in every meeting because we thoroughly enjoy the work we do and the impact it has. We're constantly growing, learning, adapting, and trying new things. BBQ, tacos, and coffee are a few of our favorite things.More about our benefitsOur offices are open, highly collaborative and yes, fun! To support you at work (and play) we offer some fantastic perks: ample time off to relax and recharge, five paid volunteer days a year for your favourite cause, plenty of food and drinks (including our famous 'Charlie's bar'), ergonomic workstations with sit/stand desks, unique ShipIt days, a company paid trip after five years and more.More about AtlassianSoftware is changing the world, and were at the center of it all. With a customer list that reads like a who's who in tech and a highly disruptive business model, were advancing the art of team collaboration with products like Jira, Confluence, Bitbucket, Trello, and now Stride. Driven by honest values, an amazing culture, and consistent revenue growth, were out to unleash the potential of every team. From Amsterdam and Austin to Sydney and San Francisco, were looking for people who are powered by passion and eager to do the best work of their lives in a highly autonomous yet collaborative, no B.S. environment.Additional InformationWe believe that the unique contributions of all Atlassians is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.All your information will be kept confidential according to EEO guidelines."}