{"jobID": "1829894224", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist for Computer Vision / Machine Learning Architecture", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "150000", "jobDescription": "We are now looking for a Research Scientist for Computer Vision / Machine Learning Architecture: NVIDIA is seeking extraordinary hardware and architecture researchers to contribute to the development of future state of the art high-performance and mobile computing systems, with an emphasis on architectures for computer vision & machine learning algorithms. We are looking for candidates that have a consistent track record of research excellence; systems-building experience; a broad perspective across the field of computer architecture; and depth in data parallel architectures and computer vision or machine learning. NVIDIA has pioneered programmable GPUs and the CUDA language, and is a world leader in high-performance and mobile computing technology, with aggressive plans for future processors. This position offers the opportunity to have a real impact in a dynamic, technology-focused company. What you'll be doing:You'll develop creative architectures to address the emerging demands of computer vision and machine learning algorithms.Understand and analyze the interplay between hardware, software, and media processing algorithms.Collaborate with a diverse set of teams across the company, spanning software, research, engineering, and product groups.Publish original research and speak at conferences and events.What we need to see:Ph.D. in CE/CS/EE with a strong background in computer architecture, VLSI, parallel processing, and/or HPC. A strong publication, patent and research collaboration history is a huge advantage.Expertise in computer vision or machine learning algorithms.Experience with experimental computer architecture development and evaluation.Experience with C, C++, and scripting languages.Strong communication skills needed. Being a creative and dynamic presenter is a big advantage. NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. If you're creative, autonomous and love a challenge, we want to hear from you!  #deeplearning  We are an AA/EEO/Veterans/Disabled employer"}