{"jobID": "2796218896", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Project Manager", "companyRating": "3.0", "companyInfo": {"Website": "www.avomeen.com", "Headquarters": "Ann Arbor, MI", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " Are you looking for a fast paced position in a rapidly growing company? We have an excellent opportunity for a Project Manager in Ann Arbor, MI. We are searching for talented and motivated individuals who would enjoy working in a team oriented, entrepreneurial company.  Avomeen is part of the CRO industry, which serves Pharmaceutical, Biotech, Legal, Automotive, Paints & Coatings, and other diversified industries with laboratory services. This $600B dynamic industry has risen to fill the needs of a wide variety of companies that have realized that Analytical Science is not core to their mission and is better done in an outside science based organization that values and supports it.  At Avomeen we: Perform analyses to get approvals for innovative as well as generic pharmaceuticalsPerform testing as well as Expert Witnessing for Law firms to support litigationRe-engineer and improve existing products for new markets and applicationsInvent new products (several clients have appeared on Shark Tank)Solve major quality problems for manufacturers including soft drink companies, auto manufacturers, pharmaceutical manufacturers, and othersPosition Summary The Project Manager will plan, oversee, drive and document all aspects of projects. Project Managers may work closely with upper management to make sure that the scope and direction of each project is on schedule, as well as other departments for support. He or she will coordinate with other departments to ensure all aspects of each project are compatible and on target, identifying risk and serve as the primary POC (point of contact) for the project team and client. The Project Manager: Is ultimately responsible for planning, directing, managing and guiding project workIs responsible for aligning project work with strategyIs responsible for delivering the projectIs responsible for ensuring all projects comply Avomeen standards and guidelinesResponsibilities Project Manager is responsible to: Lead complex projectsOwn and drive the project launch, maintenance and delivery activities.Drive execution of projects against the contracted scope and objectives, involving all relevant stakeholders using the agreed upon project toolset. Work with scientists to ensure technical feasibility.Ensure appropriate resource availability and allocationDevelop comprehensive project plans based on templates to be shared with clients as well as other staff membersCoordinate internal resources and third parties/vendors for execution of projects within the contracted agreement with the Client.Measure, monitor, track and report project performance/progress using approved manual and automated systems, tools and techniques.Establish and maintain relationships with third parties/vendors, and ensure outsourcing work is done on timeDrive communication across both internal and external teams.Manage all Client communications, schedule meetings, record MinutesPerform forward looking risk assessments to identify obstacles to minimize unexpected project issues. Drive resolution activities. Report and escalate to management as needed.Use appropriate verification techniques to manage changes in project scope, schedule and costs. Lead resolution.Monitor project budgets in relation to contracted billable milestones, scope changes and invoicing. Drive adjustments to project constraints based on financial analysis.Drive resolution of financial queries that are raised, including timely escalation if extra budget is needed.Ensure that relevant management information is captured and analyzed, per systems and processes. Drive the analysis and offer suggestions.Create and maintain comprehensive project documentationFormat final study reports, guide through approval processOn an ongoing basis, meet with Clients to clarify specific requirements of each project, troubleshoot, negotiate timeline changes and bring the “right” people together to solve problems.Track project performance, specifically to analyze the successful completion of short- and long-term goals.Manage the relationship as the primary Point of Contact (POC) with the Client and all stakeholders.Orchestrate activities of all team members to ensure that assigned projects are delivered on-time, within scope and within budget.Skills & Abilities A successful Project Manager shall possess the following skills and abilities: Strong communicator with excellent client-facing communication skills. Able to communicate effectively, clearly, succinctly, assertively.Detail orientedHighly organizedCustomer focusedSelf-motivatedStrong organizational skillsEffective team playerProcess orientedTakes the initiative, pro-activeAnalytical thinkerResponsible and reliable, holds self accountableJuggle needs and requests from Avomeen management, customers and team members, often spinning multiple plates at onceSome technical/science backgroundCreative problem solverIntermediate financial acumenAbility to effectively manage own timeAbility to motivate team, resolve conflictsAble to analyze and use data to make decisions that affect the projectManagerial background (for resource juggling)Ability to work independently or with minimal supervisionReact calmly under pressure To apply, email your resume, cover letter, and salary history to hr@avomeen.com or apply via GlassDoor."}