{"jobID": "2827274588", "jobLocation": "Hopewell_NJ", "jobTitle": "Scientist, Bioassay Development/ Analytical Team Lead - Bioassay Center of Excellence", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": " Description:  Bristol-Myers Squibb is the world leader in Biotherapeutics for Immuno-Oncology. The Bioassay Center of Excellence is the global center for biological potency assay development, biological characterization and clinical lot release. To enable the continuous expansion of our biologics pipeline, we are looking for experienced professionals passionate about bringing recombinant therapeutics to patients to address significant unmet medical need.  The Scientist, Bioassay Development/ Analytical Team Lead has the opportunity to drive state-of-the art potency assay development that supports the company’s portfolio of preclinical and clinical- stage biologics. The role calls for close collaboration with early discovery groups, process sciences groups, internal analytical functions, as well as with Manufacturing Sciences and Technology and the Quality Control organization. The role also offers an opportunity for analytical project management in an Analytical Team Lead function for Biologics.  Responsibilities:  Directly accountable for bioassay development for early and late stage development programs, development of fit-for-purpose biological characterization assays, assay qualification/validation, and strong collaboration with stakeholders in partner organizations.  Responsible for experimental design, execution, data review and analysis/interpretation, document writing, and contributing to sections of regulatory submissions.  Participates in development of the analytical control strategy (as it relates to potency) and anticipates and addresses technical, regulatory, and other business needs.  Generate and thoroughly document results, and maintain instrumentation in a GMP-compliant environment  Inspires innovation and operational excellence and fosters a continuous learning environment  Translate analytical strategy into actionable objectives, and anticipate and address technical, regulatory, and other business needs  Coordination of multiple functional area objectives to achieve program technical and business goals  Qualifications:  PhD in immunology, cell biology, molecular biology or equivalent field.  Typically 0-2+ years directly applicable experience in biopharmaceutical development.  Exceptional non-PhD candidates with significant relevant experience may also be considered  Strong organizational, interpersonal and communication skills  Flexibility and creativity  Experience in cell-based in-vitro assays functionally related to clinical mechanism of action  Experience in ELISAs  BIACORE or FACS experience would be advantageous  Methodical, detail oriented and committed to high-quality results  Awareness of regulatory and compliance guidelines  Project management/coordination experience for CMC projects in Biologics would be advantageous"}