{"jobID": "2769173406", "jobLocation": "Chicago_IL", "jobTitle": "Business Intelligence Analyst / Developer", "companyRating": "4.5", "companyInfo": {"Website": "www.imc.com", "Headquarters": "Amsterdam, Netherlands", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Optiver, Susquehanna International Group, Citadel"}, "estimatedSalary": "111000", "jobDescription": " IMC – Where Technology drives Trading  Are you someone who is passionate about challenging the status quo? Do you enjoy the process of problem solving, a process where you recognize areas of improvement and iterate and innovate to improve? Does your curiosity and desire to learn drive you?  BUSINESS INTELIGENCE & ANALYSIS TEAM AT IMC:  The BP&A; Team plays an important role in our finance operations and partners closely with the finance, trading and middle office teams to understand their needs and provide them with meaningful insights through data analysis and reporting.  You will analyze big data and extract valuable information, making it readily available in the decision making process. You maintain existing and develop new business reporting solutions and you develop tools that increase efficiencies, data processing and load times.  You will work closely with other Data Analysts/Engineers to maintain and develop best practices and keep the middle office, finance and trading teams up to speed with various migrations. You collaborate with global teams in Chicago and Sydney, reporting into the local BP&A; lead.  The ideal candidate acts as a true partner to the business and is both technical and business-savvy, displaying strong analytical and interpersonal skills.  WHAT MAKES IT FUN: You will act as a true partner to all areas of the businessWe strive to create cohesive global teams and you will collaborate with teams in Chicago and Sydney reporting into a global leadYou will work closely with other data analyst / engineers to maintain and develop best practices and keep the middle office, finance and trading teams up to speed with various migrations WHO YOU ARE: Degree in Computer Science, Mathematics, Statistics, Econometrics or other quantitative backgrounds or equivalent work experience2-5 years of work experience as a Business Intelligence Analyst, preferably in a (Strategy) Consultancy role or a similar client facing positionStrong interpersonal and communication skillsStrong business acumenInterest in and preferably exposure to finance processesProficiency in SQL and at least one programming / scripting language (i.e. Python)Experience with developing business reporting applications (Qlikview strongly preferred) and ETL’sSomeone who thrives within a dynamic, quickly changing environment OUR CULTURE: Globally, we believe in hiring the best people and giving them the freedom, responsibility and ongoing support they need to succeed (and have some fun along the way). They learn, grow and expand their knowledge in a flat structure that means the best ideas are always recognized, regardless of position. From traders, to technologists, to our business operations team, it’s their collaboration that is one of our biggest strengths, and has made us one of the world’s leading market makers. WHO WE ARE: IMC Financial Markets is among the world’s leading proprietary trading firms, and a market maker in securities listed on exchanges across the globe. Our cutting-edge technology drives everything we do. High performance algorithms, smart strategies and collaborative teams are the core of our business.Today, IMC Financial Markets is 500+ people working together to build software and trade financial products in our offices in Amsterdam, Chicago and Sydney. What does this mean for you? The chance to join a multi-national, multi-cultural team of exceptional individuals, focused on making IMC the world’s best trading firm."}