{"jobID": "2831407884", "jobLocation": "Oakland_CA", "jobTitle": "VP of CS", "companyRating": null, "companyInfo": {"Website": "www.broadly.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "HI, WERE BROADLY!Broadlys mission is to champion local businesses. We strongly believe in the positive impact local businesses have on their community. Broadly helps businesses get found online, connects them to local customers, and improves their daily operations; helping them succeed in our rapidly-evolving digital economy.Broadly is a fast-growing, venture-funded startup located in Oakland, CA. We are looking to hire our first Vice President of Client Services to help our world-class team scale to support thousands of new local business customers across the nation. We take tremendous pride in our customers experiences; just read our 500+ 5-star Google reviews!The Vice President of Client Services reports directly to the CEO and is responsible for all Client Services functions (e.g., onboarding, implementation, training, professional services, care, retention and expansion. You will have 3 direct reports to start: the Managers of Customer Success, Customer Care and Professional Services. This is a fast-paced, rewarding leadership position where you will make a large impact across our organization!VP of CS Responsibilities: Create a company-wide culture of Customer Success and align with Executive Team on key business objectives.Define operational metrics and benchmarks to measure customer health (adoption, usage, satisfaction, retention, etc.).Optimize and manage customer on-boarding, training, implementation, renewals and retention activities and processes for Customer Success, Professional Services, and Customer Care teamsScale customer success operations by adopting customer success management, predictive analytics, business intelligence, and customer support technologies.Drive new business growth through expansion and up-sell initiatives.Align with Sales and Marketing to develop sales qualification, vertical specialization, customer retention, advocacy programs, and customer communications.Work alongside Product and Operations teams to improve Broadlys services and product offerings.Create a company-wide customer feedback process to drive cross-department business initiatives. Our company is built on transparency and feedback, after all!Required Experience/Skills:5+ years experience leading customer-facing organizations5+ years in a management role, leading large teamsStrong understanding of SaaS and recurring revenue business modelProven track record of scaling customer success operationsUnderstanding and sympathy for SMB marketStrong team mentorship and coaching abilitiesEntrepreneurial mindset with a strong work ethicExcellent interpersonal, verbal, written communication, and presentation skillsBenefits:Flexible Time Off: We believe that balance between work and life is essential to happiness and success, so work hard and take the time you needHealth Coverage: We offer competitive coverage plans for medical, dental and vision, because youre worth itFood: We serve catered lunch every week, gather for company happy hours, and stock the office with bountiful snacksFitness: Gym subsidy, commuter benefitTravel: Ask us about our International Travel StipendTeam Bonding: Weekly Happy Hours, Quarterly All-Hands, Team Offsites and more!EquityCompensation:Compensation: $180K base, variable compensation and equityPlease note that we conduct 360-degree reference checks, and offers of employment are contingent upon a background check.Classification: ExemptBroadly is committed to providing and promoting equal opportunity for all employees and applicants. We comply fully with the spirit, as well as the letter, of all applicable local, state, and federal laws and regulations implementing the national objective of equal employment opportunity. Broadly does not discriminate in employment opportunities or practices on the basis of race, color, citizenship status, national origin, ancestry, gender, pregnancy, sexual orientation, gender identity, genetic information, age, religion, creed, physical or mental disability, marital or domestic partner status, veteran status, political or religious affiliations, height, weight, or any other characteristic protected by law."}