{"jobID": "2836057225", "jobLocation": "Rahway_NJ", "jobTitle": "Associate Principal Scientist, Quantitative Pharmacology and Pharmacometrics", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Associate Principal Scientists in Quantitative Pharmacology and Pharmacometrics (QP2) apply quantitative approaches to develop and implement translational PK/PD strategies, characterize clinical pharmacokinetics and pharmacodynamics of new chemical entities and biologics, and inform dose selection and go/no-go decisions. Associate Principal Scientists perform job duties independently with minimal supervision, support or lead QP2 efforts on drug/vaccine development programs, and author or co-author strategic documents. Associate Principal Scientists are expected to have or be developing expertise in several areas, including:  Serving as an expert representative for QP2 on drug/vaccine development teams  Mentoring junior colleagues  Framing critical drug development questions for optimizing model-based development.  Developing and executing translational PK/PD models, population pharmacokinetic models, exposure-response and, stratification biomarker models, quantitative system pharmacology (QSP) and disease progression models, clinical trial design via outcome/enrollment modeling and simulation, comparator modeling, absorption/biopharmaceutical modeling, clinical utility index modeling, and other model-based analyses  Developing and maintaining a comprehensive understanding of global regulatory expectations for small molecules and biologics, authoring regulatory documents (INDs, CSRs, CTDs), and representing QP2 at regulatory meetings.  The Associate Principal Scientist is a skilled modeler and a quantitative drug/vaccine developer, with a strong, integrated understanding of the strategic elements of drug discovery and development, and leads the combined efforts of QP2 and the wider Department of Pharmacokinetics, Pharmacodynamics and Drug Metabolism (PPDM). In addition to the responsibilities described above, Associate Principal Scientists demonstrate excellent leadership and communication skills. They collaborate within QP2 and with other functional areas, as well as with external vendors and partners, creating an aligned, quantitative framework to impact strategies and decisions of drug development teams. Qualifications Education:  Master or equivalent degree with at least seven years of experience, where “experience” means having a record of increasing responsibility and independence in a similar role in pharmaceutical drug development or academia.  Ph.D. or equivalent degree with a minimum three years of experience - OR - a PharmD or equivalent degree with at least five years of experience.  Required:  Educational background in biopharmaceutics, pharmaceutical sciences, pharmacometrics, mathematics, statistics/biostatistics , computational biology/chemistry, chemical/biomedical engineering, or a related field.  Proficiency in R, Matlab, SAS, or other similar programing language.  Preferred:  Proficiency in performing population PK / PKPD and non-compartmental analyses using standard pharmacometric software (e.g. NONMEM, Monolix, Phoenix, etc.)  Strong skills in experimental design, mathematical problem solving, critical data analysis/interpretation, and statistics.  Scientific understanding of biopharmaceutical and ADME properties  Proficiency in written and verbal communication, interdisciplinary collaboration, and problem scoping and planning.  Experience leading a team"}