{"jobID": "2775820495", "jobLocation": "Detroit_MI", "jobTitle": "VAVE Cost Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.grede.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1920", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Amsted, Mueller Industries, Waupaca Foundry"}, "estimatedSalary": null, "jobDescription": " We are AAM. We have the POWER to move the world.  At AAM, we're looking for associates who push boundaries and drive solutions for the future. Innovators. Thinkers. Dreamers. Doers. No matter the role or function, every associate is a piece of what makes AAM great. We're growing and building #TeamAAM to be the best. Join us!  VAVE Cost Modeling Engineer Continuously identify and execute measures to improve cost through Value Engineering. Identify cost reduction opportunities through:Product and component tear down to analyze cost driversCost model development and industry benchmarks for key productsFacilitate cross functional workshops to develop cost reduction ideasVisit suppliers (global locations) to analyze their manufacturing process/materials/tooling costsVisit internal manufacturing sites (global locations) to analyze manufacturing costs.Increases profitability by driving design changes or substituting suppliers reducing overall BOM cost. Provide relevant reporting for cost decisions (status reports of ongoing activities, progress towards savings target implementation, and forward workshop planning) All other duties as assigned.BA/BS minimum 1-5 years professional experience in Engineering, Cost Modeling.Demonstrated ability to move from concept to production in technical arena Program Management experience  About American Axle & Manufacturing  For over 20 years, customers around the world have entrusted AAM to design, engineer, validate and manufacture driveline, metal forming, powertrain, and casting technologies for automotive, commercial and industrial markets. Today, we are a premier global Tier 1 automotive supplier with broad capabilities across multiple product lines to deliver efficient, powerful and innovative solutions for our customers. We've earned the trust of our suppliers and our customers through our steadfast commitments to quality, operational excellence and technology leadership.  AAM delivers power. We deliver power literally through vehicle components, systems and innovation, but we also deliver power in ways unseen. We power our associates, their families, and the communities in which we operate. Our global team of over 25,000 associates has a clear vision of where AAM is going and how we are going to get there. After all, they are the reason we are a leader in the automotive industry. We are powering the future. We are AAM. Move with us, and join #TeamAAM.  AAM will not discriminate against any Associate or applicant for employment because of age, race, color, gender, religion, weight, height, marital status, sexual orientation, genetic history or information, gender identity or expression, disability, protected veteran status, national origin, or other characteristic protected by law. AAM will take affirmative action to ensure that applicants are employed, and that Associates are treated equally during employment, without regard to their age, race, color, gender, religion, weight, height, marital status, sexual orientation, genetic history or information, gender identity or expression, disability, protected veteran status, national origin, or other characteristic protected by law. For the Disabled Job Seeker: We offer reasonable accommodations for qualified disabled individuals who are applicants for employment. To request assistance or accommodations, please e-mail aamhr@aam.com . AAM is an equal opportunity/affirmative action employer.SDL2017"}