{"jobID": "2378908127", "jobLocation": "Chicago_IL", "jobTitle": "Salesforce Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.acumensolutions.com", "Headquarters": "McLean, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Accenture, Deloitte, Appirio"}, "estimatedSalary": "63000", "jobDescription": "Acumen Solutions drives excellence - not only in our performance, but also in the results we deliver for our clients. We are a global cloud consultancy that combines the insight of our strategists, the vision of our innovators, and the ingenuity of our engineers to achieve this extraordinary impact. The Fortune 500 trust us to build solutions focused on growing revenue and profits by amplifying competitive advantage and strengthening customer relationships. Our groundbreaking solutions in the public sector streamline operations and improve productivity. We apply this same focus on excellence to our unparalleled social responsibility program, generating sustainable impact across our local communities. Engage with us at www.acumensolutions.com or on Twitter @AcumenSolutions.We are looking to grow our team and currently have entry to manager level opportunities for a Salesforce Data Analyst in our Chicago, IL, location. Specific DutiesSpecialize in collecting, organizing, and analyzing data from various systemsDevelop an in-depth understanding of the interrelationships of data and multiple data domainsCreate thorough documentation artifacts and maintain same for duration of projectIdentify and document data migration paths and processesMaintain industry/technical knowledge base and facilitate/maintain industry relationshipsDemonstrate commitment to providing customer-focused quality serviceSupport assigned systems through transition periodPerform other duties as deemed relevant based upon experience to fulfill customer needsDevelop and perform standard queries to ensure data quality, identify data inconsistencies, missing data and resolve as neededStandardize data naming, data definitions and modelingPerform data extraction, storage, manipulation, processing, and analysisCollect, profile, collate, and map appropriate data for usage in new or existing solutions as well as for ongoing data analysis activitiesInterpret Customers functional and information needs and turn them into functional or data requirements, process models, etc.Desired Skills and ExperienceBachelor’s Degree or equivalent in Computer Science, Information Systems, Engineering, Business, Mathematics, or other related scientific or technical discipline with two (2) or more years of experience related to this positionMust be willing to travel up to 50%1-5 years of demonstrated experience in data analysis, data manipulation, and decision supportKnowledge and application of relational database conceptsExperience or exposure to Extract/Transform/Load (ETL) and/or Business IntelligenceStrong SQL skillsSkilled at completing technical design via iterative mockupsHigh proficiency in MS Office Suite (esp. Word and Excel)Openness to learning new skills and software as necessaryDemonstrated ability to manage simultaneous work flows while maintaining quality output and meeting deadlinesDemonstrated ability to learn new and exciting technologies with little assistancePreferred ExperienceExperience with ETL tools and procedures (any tool)Prior experience working in the CloudStrong verbal and written communication skills with demonstrated ability to communicate at different levels of the organizationAbility to perform ad-hoc analysis and maintain clear and comprehensive documentation of decision-making, data preparation, and processesRelevant IT certificationsCritical SkillsHigh aptitude in analytical and logical thinkingDemonstrated experience with data models and data mappingExperience with Unified Modeling Language (UML), including Entity-Relationship Diagrams (ERD), Sequence Diagrams, and Data Flow Diagrams (DFD)Understanding of XML, SQL, Data Modeling Language (DML), and Data Definition Language (DDL)Strong communication skills, both written and spokenDemonstrated ability to produce highly detailed, comprehensive documentation artifactsClient-focused attitudeHigh-level knowledge of enterprise IT organizational, business, and technical environmentsAbility to analyze processes and recommend improvements as neededBenefits Acumen Solutions offers the opportunity for growth and advancement, as well as a competitive base salary, annual performance based incentives, medical, dental, and vision benefits, Paid Time Off, 401k, and more.About UsAs a leading management and technology consulting firm, Acumen Solutions offers a range of challenging and rewarding opportunities whether you’re just starting out in your career, looking to advance your career, or seeking a senior leadership position. Acumen Solutions employees are ambitious, committed, passionate problem solvers. EOE M/F/V/DVEVRAA Federal Contracto "}