{"jobID": "2735400318", "jobLocation": "Santa_Clara_CA", "jobTitle": "Salesforce Data Quality Analyst", "companyRating": null, "companyInfo": {"Website": "www.nufern.com", "Headquarters": "East Granby, CT", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "  Defines and oversee rules for data models, structure and requirements in Salesforce and related systems such as Oracle and Agile. Works to identify data sets that need cleansing and drive tools and routines that aid in their cleansing. Develops practices and methods to maintain data in good health. Create training material and train the involved user groups accordingly.   Defines data models for customer, contact, product and pricing data for Salesforce that aligns with other customer databases such as Oracle and Agile. Reviews integrations between Salesforce and Oracle already in place, analyzes and drive correction where the current integration mapping or data sets needs adjustment.   Oversees Product Information available in Salesforce, optimizes the accessibility and minimizes ambiguity for Sales when searching Product and Pricing Information. Works with Business Owners on the definition of and correct setting of attributes that drive reliable navigation, search and use of key data sets. Creates training material and trains involved user groups accordingly.   Generally protect the overall integrity of the data in Salesforce, whether created within the application or from integration feeds from other systems.   Works directly and independently with various data set owners to assess and correct core data and processes that impact reliability of the data.   Defines and owns processes for periodic review of Customer/Product data alignment between SFDC/Oracle EBS including monitoring of daily interfaces to ensure continual data quality."}