{"jobID": "2784903245", "jobLocation": "San_Diego_CA", "jobTitle": "Imaging Research Scientist/MR Scientist", "companyRating": "2.7", "companyInfo": {"Website": "www.humanlongevity.com", "Headquarters": "San Diego, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "Purpose of Job Human Longevity, Inc. is looking for an Imaging Research Scientist / MR Scientist to assist with developing acquisition and reconstruction methods. This scientist will be part of a team working to create first of kind imaging methods that would improve the detection of cancer and prediction and prevention of other diseases including cardiovascular disease and dementia. Tasks and Responsibilities The Imaging Research Scientist / MR Scientist will contribute by developing image reconstruction algorithms. The scientist will also be responsible for pulse sequence research and development. Minimum Qualifications (Must Have)Ph.D. in biomedical engineering, electrical engineering, computer science, applied math, physics or equivalentStrong proficiency in pulse sequence development and image reconstruction (preferably on Siemens or GE scanners)Strong MR physics backgroundExpertise in MR imaging techniques and clinical applicationsStrong proficiency in image processing and signal processingStrong proficiency with C/C++, pythonCoding experience from inception through implementationSolid understanding of good programming practices, architecture, design patterns and unit testingExcellent communication skillsKnown for passion and perseverance to pursue long-term goals through short-term high performanceMaintains a positive and respectful attitude while working collaboratively in a highly dynamic environmentResourceful and willing to experiment, pursue new ideas and take risksPreferred QualificationsDomain experience in biotech and healthcare5+ years of software development experienceExperience with computer vision, machine learning, and deep learningExperience in a start-up environmentExperience in a regulated environmentProficiency with object oriented programmingWorking ConditionsOpen office environmentDog-friendlyWork with multidisciplinary team including software developers and cliniciansAbout Human Longevity Inc. Human Longevity Inc. (HLI) is the genomics-based, technology-driven company creating the most comprehensive database of whole genome, phenotype and clinical data. HLI is developing and applying large scale computing and machine learning to make novel discoveries to revolutionize the practice of medicine. A privately held company headquartered in San Diego, CA, HLI was founded in 2013 by pioneers in the fields of genomics and stem cell therapy. HLI will be licensing access to its database and developing new diagnostics and therapeutics as part of their product offerings. For more information please visit www.humanlongevity.com."}