{"jobID": "2801291161", "jobLocation": "Gardena_CA", "jobTitle": "Sr Data Engineer - Data Warehousing", "companyRating": "3.0", "companyInfo": {"Website": "www.bankofhope.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " The Sr. Data Engineer designs and constructs enterprise-wide data and information architecture to support business intelligence and data warehouse efforts. Responsible for the design, implementation and maintenance of data warehouse and data marts. ETL development skills using Microsoft SSIS, expertise in relational structures, dimensional data modeling, and T-SQL skills are a must. Responsibilities will include physical design and creation of physical database, Work-Load-Management/Priority Scheduling, data & user security; SQL performance tuning, and enforcement of standards, data replication and documentation.  Responsibilities & Duties Build custom data-driven frameworks and solutions, and leverage off-the-shelf data products and tools.Create extract, transform and load (ETL) processes based on mapping specification documents (STMs).Perform ongoing monitoring, automation and refinement of reports and BI solutions.Work with BI Management to identify and resolve data related issues.Work with business departmental teams to help them define and document business requirements for new metrics and reports.Participate in process reviews and enhancements.Provide analysis and issue resolution on business reported concerns.Participate in design and delivery of cubes, dashboards and various self-service business intelligence solutions.Enforces established documentation guidelines and best practices.Maintains a high degree of business functional knowledge and current automated technologies and tools.Adheres to all policies and procedures concerning all confidential information including but not limited to internal use and restricted information Job Qualifications/Requirements Degree in computer science, mathematics, operations, management, or a related field7+ years of experience as a Software Engineer, Database Engineer, Systems Engineer or related occupation, including experience in building and maintaining data-intensive systems and data warehouses using advanced SQL or ELT/ETL tools (including SSIS, Talend, Pentaho), OLTP, OLAP, and MDM, dimensional data modeling.Experience in cloud computing and big data analytics: AWS, MS Azure, Eucalyptus, OpenNebula, CloudStack and OpenStack; Hadoop; MapReduce model; Google File System; Amazon RedShift or Azure SQL Data WarehouseExperience in building enterprise data warehouseExperience working in Agile teams utilizing Atlassian products, e.g. Confluence, Jira.Broad understanding and experience of data modeling, data management, ETL and BISolid T-SQL knowledge SQL query development using MS SQL 2008 and 2012Thorough understanding of relational databases and SQL.Experience working with any scripting languages like Bash, Powershell, Python, and Ruby, etc...Ability to use multitude of technologies to automate processing of the similar data structures.Experience creating metadata driven processes to manipulate the data.Ability to learn new technologies without a formal training.Understanding of dimensional modelling using Kimball methodology.Understanding of schema on read modelling approaches.Understanding of the Data Warehouse Data Vault methodology.Enjoying working with the data and processes around it.Excellent communication, interpersonal and organizational skillsAbility to prioritize, meet deadlines and to work well under pressure.Must enjoy working in a fast-paced teamwork environment and dealing with a variety of people.Banking systems experience preferred.Bank of Hope is an Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law. Bank of Hope will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the employer's legal duty to furnish information.Please view Equal Employment Opportunity Posters provided by OFCCP here.SDL2017"}