{"jobID": "2767366770", "jobLocation": "Washington_DC", "jobTitle": "Strategy and Corporate Development MBA Intern", "companyRating": "4.0", "companyInfo": {"Website": "www.diligent.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": " Diligent is the leading provider of secure corporate governance and collaboration solutions for boards and senior executives. Over 12,000 clients in more than 90 countries and on all seven continents rely on Diligent for secure distribution of board materials, secure messaging, integrated compliance, board evaluation and entity management. Diligent’s Governance Cloud is the only solution that meets the evolving governance needs of leading organizations. Visit diligent.com or follow us on Twitter @diligentHQ to learn more.  The MBA Intern for Strategy and Corporate Development will work with the Corporate Development team and other members of the executive team to provide research and analytics support on the competitive market landscape. This role will be a key member of the Corporate Development team working with executive management at one of the fastest growing and most prominent B2B SaaS companies in New York.  Specifically, MBA Intern for Strategy and Corporate Development will: Research and analyze market opportunities which align with Diligent’s strategic developmentCollaborate and communicate reports and findings to the executive management teamAssist in detailed financial modeling of structures and returns, business plans and commercial arrangementsParticipate in due diligence, as applicableAssist in project managing integration efforts related to M&A; transactions, as applicableRequired Experience/Skills:Full-time post-graduate student currently studying for an MBA programPrior professional experience in investment banking, private equity, corporate strategy or management consulting preferredMust be a team player with strong analytical capabilitiesDemonstrated interest in software or tech industry companies (particularly SaaS)Strong interpersonal skills, resourcefulness and a collaborative approach.Availability for a Summer 2018 start in NYCPhysical RequirementsAbility to type and/or manage laptop or personal computer keyboard for the purpose of internal and external electronic communication.Ability to see and hear and communicate verballyMental RequirementsAbility to understand, remember and apply oral and/or written instructions or other informationAbility to understand complex problems and to collaborate and explore alternative solutionsAbility to make decisions which have moderate to significant impact on the immediate team and division and stakeholders/colleagues and be able to monitor that impactFSLA Status: Intern / Non-Exempt We are a drug free workplace, and an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law."}