{"jobID": "2830684502", "jobLocation": "Rahway_NJ", "jobTitle": "Medical Safety Review Physician, Principal Scientist, Drug Safety", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck?s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world?s premier, most research-intensive biopharmaceutical company. Today, we?re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck?s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Under the direction and oversight of the Associate Vice-President, Head of Medical Safety Review (MSR), MSR Directors and managers, the Medical Safety Review Physician will: Provide in-line medical safety review of individual case safety reports (ICSRs) arising from Merck clinical trials and other sources as required, in order to:provide a company statement and a causality assessment for regulatory reporting requirements, which will be included as part of the Individual Case Report,determine or confirm the need for expedited reporting to regulatory agencies,ensure the quality, coherence and accuracy of the case narrative,perform a medical assessment of the case in the context of the available safety data and the known safety profileassess the expectedness of reported events against various reference safety information sourcesImprove the accuracy and completeness of the case report by generating medical queries, as needed, which will be communicated to the corresponding site via the clinical databaseHelp ensure compliance with global expedited reporting timelines with timely case assessmentMay participate in quality review of ICSRs from other MSR PhysiciansMay lead and/or participate in cross-functional projects as the MSR subject matter expert contributing to continuous process improvement of ICSR assessmentsConsult with the Clinical Director for the trial and with the Clinical Safety and Risk Management (CSRM) Physician, as needed, for cases requiring additional clinical or safety subject matter expertiseMay, in conjunction with MSR Directors, have management responsibilities of other individual contributor MSR PhysiciansMay participate in the selection, training, supervision, development, and performance management of the specified MSR Team The MSR Physician will work closely and collaboratively with colleagues in other Merck departments, including but not limited to: Clinical Safety Scientists, Clinical Directors in Clinical Research, CSRM Physicians, and CSRM Associates and Scientists, and Global Safety Case Management and Pharmacovigilance. The MSR Physician will be an extended member of the Risk Management Safety Teams (RMST's) for the products that he/she supports, and other relevant sub-teams. \\#LI-ES1Education Minimum Requirement: M.D., D.O., or international equivalent Required Experience and Skills: + Minimum of 3 years: clinical practice experience, following training or prior industry experience in safety, clinical development and/or medical affairs  + Excellent writing and communication skills required.  + Effective presentation skills and experience influencing and negotiating required  + Computer skill required- use of database and basic MS Office suite applications  + Problem solving, conflict resolution and critical thinking skills are required. Preferred Experience and Skills: + Board certification  + Experience in drug safety, pharmacovigilance and/or risk management is highly desirable  + Prior medical review and/or case management experience  + Relevant Safety Systems Experience (i.e. Argus, ARIS-G, etc).  + Drug development experience (early or late phase clinical research, regulatory affairs, and/or safety/PV)  + Demonstrated leadership skills in managing programs & processes, leading meetings and influencing peers and direct reports to drive results.  + Experience working and collaborating with global teams  + Awareness of local business practices and culture.  Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we?re counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we?re inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to staffingaadar@merck.com . Search Firm Representatives Please Read Carefully: Merck & Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  For more information about personal rights under Equal Employment Opportunity, visit:  EEOC Poster at http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf  EEOC GINA Supplement? at http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf  Merck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations. *Job** _Drug Safety Surveillance (MD)_ Merck is an equal opportunity employer, Minority/Female/Disability/Veteran ? proudly embracing diversity in all of its manifestations. *Other Locations:** _NA-US-NJ-Rahway_*_Title:_** _Medical Safety Review Physician, Principal Scientist, Drug Safety_*_Primary Location:_** _NA-US-PA-Upper Gwynedd_*_Requisition ID:_** _DRU000847_"}