{"jobID": "2681870766", "jobLocation": "Rocklin_CA", "jobTitle": "Construction Engineer", "companyRating": null, "companyInfo": {"Website": "www.tiltonpacific.com", "Headquarters": "Rocklin, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Construction, Repair & Maintenance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Tilton Pacific Construction is looking for Commercial Construction Project Engineer with the knowledge and drive to support a Project Management team with a diverse range of challenging commercial construction projects including Site Development, Big Box Retail, Senior Living, Sports Clubs, Grocery and more! If you have a 4 year degree in Construction Management or Engineering, strong negotiation and written communication skills and the ability to work on a team in a fast-paced construction environment, then Tilton Pacific Construction’s Operation’s Department needs you! You will enjoy a very structured work environment with a family business atmosphere, training, and the opportunity to work with a talented staff of Project Manager’s managing multiple large commercial construction projects to their success. You will be required to process and track RFI’s, Submittals and Change Order Requests in addition to supporting Project Manager(s) with the preparation and documentation related to project meetings, subcontractor coordination, scheduling and Owner relations. Positions available in both Rocklin, CA and San Jose, CA Competitive Salary, Medical Benefits, 401K with 4% match & Bonus potential Desired Skills and Experience: 4 year (Bachelor's) degree in Construction Management or Engineering Strong Computer skills Strong Communicator and able to effectively interface with Owners/Subcontractors/Staff & Coworkers Experience with Procore Project Management sofware a plus Independent Managerial skills Personable, presentable and professional www.tiltonpacific.comTilton Pacific Construction has a reputation of service and construction excellence across California, Oregon, Washington, and Nevada that has been earned over 25 years of operation. We have offices in Rocklin, CA and San Jose, CA. We are a relationship-driven company that has provided private-sector clients with uncommon integrity, quality and value.We hold great respect for our clients, their goals, the quality of our work, as well as for all the members of the TPC team that make our success possible. We are dedicated to a small set of company core values that guide our efforts; principles that shape everything we do: Integrity, Building Relationships, Quality Work, Competitiveness, Accountability, Professionalism and a Work/Life Balance.CONSTRUCTION SPECIALTIES: Site Development, Shopping Centers, Retail, Grocery, Pharmacies, Sports Clubs, Auto Dealerships, Senior Living, Assisted Living, Office, Medical Office, Mixed Use, Tenant Improvements, Light Industrial, Multi-Story buildings and Underground Parking Facilities. We have extensive experience with Ground Up Construction, Remodels, Open Store Remodels, Expansions and 2nd Generation Projects."}