{"jobID": "2647140141", "jobLocation": "Los_Angeles_CA", "jobTitle": "Manager of Data Science & Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.nordstrom.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1901", "Type": " Company - Public (JWN) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Discover it Here.At Nordstromrack.com and HauteLook, we strive to empower  shoppers through choice and discovery of the hottest fashion at great  prices. At the intersection of technology, fashion and design, we value  employees who have great in-“sites” to fashion and e-commerce, act fast, think  creatively and embody our customer-first mentality. Our fast-paced, dynamic  culture attracts creative, passionate individuals with a determined, can-do  attitude and entrepreneurial spirit.  Work hard and play hard in a  fun, casual and collaborative work environment in the heart of Downtown  LA.Summary:It is critical for any e-commerce business to  know your customer, know their online behaviors and to track as well as  forecast our key performance indicators (KPI’s). We are looking for a Manager  of Data Science and Analytics who’s motivated by making an impact to the e-commerce  customer experience and leading a team of analysts and data scientists. This  team enables tactical and strategic business decisions by providing teams  across the company with actionable insights whether in weekly scorecards or  ad-hoc analyses. You will also be leading projects such as customer  segmentation, search optimization, and forecasting digital trends. At the same  time, you will partner with other business leaders to ensure site experiences  are continually optimized to drive conversion growth while identifying and  prioritizing optimization and A/B testing opportunities. This position requires  strong business sensibilities and technical acumen, as well as great problem  solving, communication, and mentoring and management skills.  Our ideal candidate has a passion for data, business  analysis, conversion funnel optimization and helping to drive e-commerce  strategy and growth. You and your team  will be embedded within a collaborative and cross-functional team of Analysts,  Product Managers, UX Designers and UX Researchers and you’ll sit amongst your Engineering peers as well.Responsibilities:Collect  and analyze data and present research, findings, and recommendations to cross-functional  teams including Product Management, UX & TechnologyDefine  tracking requirements for roadmap projects and support measurementIdentify  and prioritize optimization and A/B testing opportunitiesEffectively  communicate and advocate the overall Analytics team strategy and visionHighly  motivated self-starter, strong leader, team player with experience working with  engineering in a fast-paced, agile environmentKnow and understand the Nordstrom Rack and HauteLook  customers’ needs and serve as their advocateThis position reports to the Vice President of Product  Management, UX and AnalyticsQualifications:Bachelor’s  degree in related field, Master’s preferred4  years in an analytical role as a Data Analyst or Data ScientistPrior  people management experience preferredStrong  understanding of analytics tracking methods and tools (IBM Coremetrics, Adobe  Omniture, Google Analytics)Strong  working knowledge of statistical analysis, algorithm development, and  methodologies for data scienceExperience  with data visualization tools such as Tableau, MicroStrategy, LookerAbility  to coordinate projects across multiple stakeholders through organization,  collaboration and charismaInterest  in fashion and shopping a plus"}