{"jobID": "2819923019", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist, Semiconductor and Photonic Devices", "companyRating": "3.5", "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": "96000", "jobDescription": "Title Research Scientist, Semiconductor and Photonic Devices  18-Jun-2018 Job Description SRI International's Advanced Technology and Systems Division (ATSD) performs research across a wide range of disciplines, from novel material development designed at the atomic level to implementation of advanced optical, radar, and imaging systems, transitioning technology from basic R&D; to fieldable prototypes.  Our SRI campus in Princeton, NJ has an immediate opening for a Research Scientist within ATSD to support our growth in the optoelectronics and photonics areas. The position will be part of a close-knit team of applied physicists and engineers working on leading-edge R&D; projects to realize proof-of-concept demonstrations for our government and commercial customers. We are seeking a candidate who has a strong working knowledge of optoelectronic materials and devices, including both silicon photonic and III-V optoelectronic devices, and who will be able to apply this knowledge to develop novel solutions to enable larger system needs.  The candidate must have strong technical knowledge in: the physics of electronic, optical and optoelectronic devices;semiconductor physics including superlattices and semiconductor quantum structures;experience in the design of silicon photonic/optoelectronic device and waveguide structures;the physical and chemical basis of micro- and nanofabrication techniques. Hands-on experience in device design, device fabrication, and/or material and device characterization is a plus. The candidate should possess good intuition of underlying physical processes to make decisions based on limited data Additional skills should include:Translating the needs of an application to requirements for the device geometry and for the materials used to make the deviceImplementing numerical and analytic models for physical processes in software as an aid for device or process design with a programming language (e.g., C/C++ or Python) or with a commercial software package (e.g., COMSOL, HFSS, MATLAB)Testing and characterization of optoelectronic and photonic devices, including test automation where neededInterpreting the results of common techniques used to characterize materialsHaving a basic working knowledge of materials scienceOperating and doing routine maintenance of common thin film fabrication and lithography equipment The candidate should be able to contribute at the individual level, with expected guidance from more senior group members, with a goal to develop into a principal investigator of innovative R&D; proposals and programs. Auto req ID1831BRLocation(s) Princeton, NJ Other Requirements-U.S. Citizenship required., --Ability to transfer/obtain/maintain a U.S. government security clearance required. See http://www.dss.mil/psmo-i/ps_faqs.htmlEmployment Status Full Time QualificationsPhD in Physics, Applied Physics, Electrical Engineering or related discipline. New graduates are welcome to apply, industry experience is a plusDue to government requirements, U.S. Citizenship and ability to obtain/maintain/transfer a DOD Security Clearance requiredCharacter qualities:Detail-orientedSelf-motivatedStrong written and verbal communications skillsAble to work in a team environmentMust possess a results-oriented approachInterest in multiple technical areasDesire to learnEOE/AA SRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Background Check Candidates who receive a conditional offer of employment will be subject to a background check. "}