{"jobID": "2821555591", "jobLocation": "San_Diego_CA", "jobTitle": "Lead Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.smithhanley.com", "Headquarters": "New York, 061", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kforce, PageGroup, Robert Half"}, "estimatedSalary": null, "jobDescription": " Smith Hanley AssociatesLead Data ScientistLocation: San Diego, CASalary: Up to 150k BaseContact: Sean Murphy - smurphy@smithhanley.comThe Lead Data Scientist will work with exceptionally large amounts of real-world data and assure data quality throughout all stages including, acquisition, collection, analysis and transformation. The Lead Data Scientist will be relied upon to oversee projects within high end model development and to work collaboratively to ensure the proper deployment and implementation of analytical software and solutions. The Lead Data Scientist will be expected to build cutting edge statistical/predictive models using machine learning, AI, and deep learning techniques. Other duties will include regular model validation, monitoring, coding, implementation, and assisting with internal/external client meetings to resolve problems. This individual may also be relied upon to provide post implementation support. Requirements for Lead Data Scientist:-M.S. Degree in a quantitative discipline (i.e. - Statistics, Mathematics, Operations Research, Physics, Computer Science, etc) PhD STRONGLY preferred-Five (5) or more years of strong hands on experience within predictive modeling, data mining, large scale data analysis and AI/machine learning techniques-Proven hand on experience with analytical techniques such as neural networks, logistic/non-linear regression, random forests, decision trees, support vector machines, linear/non-linear optimization-Strong scripting experience using Perl, Bash or similar tools-Excellent working knowledge of Java, Python, C++ or C-Cloud computing experience in AWS or OpenStack a big Plus"}