{"jobID": "2832226005", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist - Radiation Oncology - Research", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " For our quantitative imaging work, we study the physical properties of cancer to help us understand how tumors react to chemotherapy and radiation. Our work has demonstrated that these physical characteristics impact the delivery of drugs, response to treatment, and the subsequent clinical outcomes of the patients. Our research is primarily in pancreatic and hepatobiliary cancers. We have also worked in lung cancer and head and neck cancers.  Our 3D printing work, we are developing new methods to create patient-specific devices that can help lessen the toxicity burden of patients and improve their long-term quality of life. Our research revolves around fully characterizing the performance of these devices, programming algorithms to make the device fabrication more efficient, and conducting clinical trials to demonstrate the value of the devices.  The ideal candidate will be interested in Hepatobiliary and Pancreatic Cancers, have experience with computer programming (Matlab, C++, Python), and the ability and desire to work in a team  The salary range is min $ 53,200 mid $ 66,500 max $ 79,800. Strong experience in wide range of biophysics, biology, and image analysis in order to identify diagnostic imaging biomarkers for cancer and study their tumor biology.Excellent experimental skill sets (e.g. confocal, fluorescence and brightfield microscopy, immunocytochemistry, immunohistochemistry, in vivo imaging techniques)Strong background with cell culture techniques. Ability to isolate organs from mice for sterile single cell cultures preparation and efficacy in performing cell based assays in vitroStrong skillset with animal studies, including mouse model development, oral, ip, and iv dosing, tissue collection, small animal imaging (e.g. IVIS optical imaging, Micro-CT imaging, MRI imaging, etc.)Development and validation of image analysis methodologies and algorithms for quantitation of single stain and multiplexed immunohistochemistry and immunofluorescence for disparate analytes in human tissuesApplication of analytic methods to multiparametrically phenotype cells, quantify them, and spatially characterize molecular targets in situ within tissue sectionsAbility to design independent experiments to address a scientific question, analyze data, and understand the final results and utilize them to plan future experiments. EDUCATION: Required: PhD in one of the natural sciences or related field or Medical degree. EXPERIENCE: Required: With PhD, no experience required. With Medical degree, two years of experience in experimental or scientific work.  Preferred: Experience in computer programming such as Matlab, C++, or Python  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.htmlSDL2017"}