{"jobID": "2828304562", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Business Intelligence Analyst - Senior", "companyRating": "3.4", "companyInfo": {"Website": "www.spectrumhealth.org", "Headquarters": "Grand Rapids, MI", "Size": "10000+ employees", "Founded": " 1997", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": " Business Intelligence Analyst - Senior  Grand Rapids, MI  Apply Now Employment Classification: Full-time with Benefits (A1)Shift: DayShift Length: 8 hoursHours per two-week pay period: 80Work Hours: 8 a.m. to 5 p.m.Days Worked: Monday to FridayWeekend frequency: N/ADepartment: Ph-Advanced AnalyticsFacility: Priority HealthPosition Requisition #: 54081Date Posted: June 13, 2018Share Company Description Spectrum Health is a not-for-profit, award winning, integrated health system based in West Michigan. Our organization includes a medical center, regional community hospitals, a dedicated children's hospital, a multispecialty medical group and a nationally recognized health plan, Priority Health. We invest in our people by supporting a dynamic, high-performing workplace. Our collaborative approach to patient care includes a commitment to provide an exceptional experience for patients and their families. Spectrum Health supports successful career growth in an innovative environment. Position Summary Working as embedded intelligence expert as part of an integrated cross-functional team, Business Intelligence (BI) Sr. Analyst turn data into information and knowledge, understanding how that information/knowledge supports and enables key business processes, and communicating those Insights for maximum business impact. BI Sr. Analysts contribute to the business intelligence, reporting, and data analysis needs for the organization. This role works closely with Data Engineers, Data Scientists, Lead BI Analysts, and internal customers to turn data into critical information and knowledge that can be used to make sound business decisions. It is essential that BI Sr. Analysts build an understanding of the business at a level of detail that enables them to identify and address critical issues. They provide data that is accurate, congruent and reliable, and ensure the information is easily available to users for direct consumption or integration with other systems. BI Sr. Analysts educate and train customers to use the data as an analytical tool, displaying the information in new forms and content for the purpose of analysis and option exploration. BI Sr. Analysts work with customers to determine business requirements, priorities, and define key performance indicators (KPI). This includes working with business and clinical teams to design and document dashboards, alerts (e.g. regulatory surveillance metrics), and reports. This role is accountable for facilitating information gathering, structured documentation, and presenting findings to all levels of management. The BI Sr. Analyst conducts analyses of functional business processes and functional business requirements and participates in the development of business cases in the support of operations and improvement activity. BI Sr. Analysts must have an in-depth understanding of the business environment and an interest in going beyond the obvious, delving into the source, finding insights, and turning those insights into a story to drive impact and better decision making. They must work well within a team environment. Qualifications Basic Qualifications: Education - Bachelor's Degree or equivalent in business, liberal arts, computer science, application programming, software development, information systems, database administration, mathematics, engineering, or other related field  Experience - 5 years of experience typically gained through skills/knowledge/abilities  Spectrum Health grants equal employment opportunity to all qualified persons without regard to race, color, national origin, sex, disability, age, religion, genetic information, marital status, height, weight, sexual orientation, veteran status, or any other legally protected category.Apply Now"}