{"jobID": "2764453295", "jobLocation": "San_Diego_CA", "jobTitle": "DATA ANALYST", "companyRating": "2.9", "companyInfo": {"Website": "www.firstdata.com", "Headquarters": "New York, 061", "Size": "10000+ employees", "Founded": " 1971", "Type": " Company - Public (FDC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " First Data is a global leader in commerce-enabling technology solutions, serving more than six million business locations and 4,000 financial institutions in 118 countries around the world. Our 23,000 owner-associates are dedicated to helping companies, from start-ups to the world’s largest corporations, conduct commerce every day by securing and processing more than 2,300 transactions per second and $1.9 trillion per year. First Data is committed to staying at the forefront of our industry, and we are innovating a wide range of next-generation commerce technology solutions to help our clients better detect fraud, gain insights into consumer spending patterns and build customer loyalty. First Data is looking for a Data Analyst for a full-time role. You will be part of an agile team using Scrum. Our teams include software engineers, QA engineers, product development managers, and scrum masters. A typical day consists of brief standup meetings, roughly 80\" coding & building new features on your own and sometimes in a pair programming environment. The other 20& of your time will be spent helping with technical issues, planning for releases, or assisting with technical issues. Responsibilities:Use Data mining, analytics and business judgment to help identify, prioritize, structure and solve complex data problems﻿Create dashboards, reports, and analyses that explain what happened and whyPerform ad hoc analyses and data extraction requests; actively build processes, tools and metrics dashboard to make data more accessibleExtract insights from data to improve the product experience and operational efficiencyActively build processes and tools to make data more accessibleDrive the monitoring, analysis, and improvement of website and other products performanceWork in a cross functional team to implement data-driven plans designed to maximize ROIRequirements:Undergraduate degree in either Computer Science, Operation Research, Applied Mathematics, Economics or another quantitative discipline; Masters preferred2 years of experience analyzing very large, multi-dimensional data sets using SQL/PSQL2 years of experience creating visualization using Looker(preferred), Chartio, Tableau, QlikView.Solid experience in Excel for data analysis and visualizationComfortable working in a fast-paced, dynamic environment while juggling multiple projectsGood interpersonal communication and presentation skillsSelf-motivated, detail-oriented and passionateNice to have:ETLData VisualizationSQLPythonData Analysis and ModelingAWS"}