{"jobID": "2824452137", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.ninthdecimal.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "About NinthDecimal: NinthDecimal is the marketing platform powered by location data. It harnesses this data to build a precise understanding of consumers' physical world behavior. Fortune 500 companies and marquee brands activate this customer intelligence through audience targeting, measurement, insights and data licensing solutions. By filling the gap in understanding how consumers spend the majority of their time, NinthDecimal provides marketers a new model of the customer journey for impactful engagement.  NinthDecimal introduced the mobile industry to one-to-one audience targeting with the launch of our Location Graph, the first platform to build audiences using historical location data. The subsequent launch of our Location Conversion Index® offered marketers the first mobile measurement solution beyond the click that could accurately measure incremental lift. NinthDecimal is now leading the way in exposing mobile audiences across the digital ecosystem, bringing advanced performance and measurement to all the ways the brands want to engage their audience. Position Summary We are looking for a Data Analyst to join our growing custom analytics team. The responsibilities for this position include these activities: Analysis of large data sets to derive factbased decisions of high-value business problems for the various business units, such as research analysts, product managers, data scientists, marketing and ad operations teams;Supporting Research&Insights; team to produce actionable insights and datadriven recommendations for business and monetization strategies. Apply business analytics through ad-hoc reporting and custom scripting to drive optimization of various ad campaigns;Prepare data sets using python/scala/sql for targeting, reporting and data science researchEnsure data quality of all inbound and processed dataCreate visualization to illustrate data trendsLead A/B testing processes, create and evaluate user segments and performance metrics, come up with the databased recommendationsContribute in the design, tuning, performance and maintenance of raw and normalized data so that data can be leveraged by stakeholders in a timely fashion by the appropriated reporting toolsQualifications Required:Extreme passion for data qualityExpert in python or scalaExpert in building and optimizing complex SQL, preferably in Postgres, Mysql. Familiarity with the columnar database concepts.Expert in data manipulation in multi-billion records data sizeBe an excellent communicator and a leader able to articulate complex decisions to the cross functional teamStrong sense of business application and urgencyAdvance degree in CS, Math or related subject is preferredFamiliarity with the digital media / advertising industry is a big plusExperience with Hadoop based technologies, such as Hive, Spark is a nice to haveFamiliarity with high level languages such as python, R, pig, java is a nice to have What's in it for you? 100% mobile revenue growth year over year - the company is a great acquisition targetThis role is crucial for the company's futureBe the lead of the most disruptive revolution in the mobile advertising industryWork with wicked smart people in the hottest area of modern business mobile/local/social targetingExcellent benefits and stock option planNinthDecimal Culture: NinthDecimal, a name as interesting as its people. We are passionate about everything we do, whether it's working, telling the NinthDecimal story at industry events, playing our highly competitive ping-pong games, or participating in Beer Fridays. We come from a background of companies like, YP, TiVo, CNET, AOL, comScore, BrightRoll, Walmart, Coca Cola and many we just picked up out of college. Together we have created a company that is awesome, inspiring, innovative, fast-passed, nimble, and forward thinking.  Sound like a company you want to work for? We are looking for smart, hungry, humble people who are truly passionate about building a great company! If you are looking for a place to put your handprint and make an impression NinthDecimal wants you! For immediate consideration, please submit your resume to http://NinthDecimal.com/jobs.  NinthDecimal is an AA/EEO employer that actively pursues and hires a diverse workforce."}