{"jobID": "2807176184", "jobLocation": "Washington_DC", "jobTitle": "Practice Support Manager, Activism and Mergers & Acquisitions Solutions", "companyRating": "3.4", "companyInfo": {"Website": "www.fticonsulting.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Company - Public (FCN) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": "About FTI Consulting:FTI Consulting, Inc. is a global business advisory firm dedicated to helping organizations manage change, mitigate risk and resolve disputes: financial, legal, operational, political & regulatory, reputational and transactional. With more than 4,600 employees located in 28 countries, FTI Consulting professionals work closely with clients to anticipate, illuminate and overcome complex business challenges and make the most of opportunities. The Company generated $1.81 billion in revenues during fiscal year 2017.FTI Consulting continually strives to offer employees and eligible dependents, including domestic partners and eligible domestic partner children, a competitive and comprehensive benefits package. Please click here for more information.FTI Consulting does not accept unsolicited resumes from external firms or agencies. FTI Consulting will not be responsible for placement fees associated with unsolicited resumes.FTI Consulting is an equal opportunity employer and does not discriminate on the basis of race, color, national origin, ancestry, citizenship status, protected veteran status, religion, physical or mental disability, marital status, sex, sexual orientation, gender identity or expression, age, or any other basis protected by law, ordinance, or regulation.About Forensic & Litigation Consulting:The Forensic and Litigation Consulting practice at FTI Consulting provides multidisciplinary, independent dispute advisory, investigative, data acquisition/analysis and forensic accounting services to the global business and legal community. Our team supports clients facing high stakes litigation, arbitration and compliance investigations, and regulatory scrutiny.The Forensic and Litigation Consulting practice helps clients, who are facing legal disputes, protect enterprise value by:Quantifying damages and providing expert testimony in a range of dispute situations: intellectual property, professional malpractice, lost profits, valuations, breach of contract, purchase price disagreements, business interruption, environmental claims, construction claims and fraud cases.Employing forensic accounting and complex modeling expertise to unravel complex financial transactions.Independently gathering and analyzing critical information.Offering industry‐leading electronic evidence services that identify, preserve and collect relevant, structured information and analyze complex data within enterprise systems.About The Opportunity:This position is responsible for managing day-to-day practice operations, sales process and staffing. Responsibilities also include overseeing client billing, budgeting and goal tracking for the Activism and M&A; Solutions practice based in Washington, DC. For more information about the practice, please visit www.ftiactivism.com. Operational ResponsibilitiesCoordinate with practice leadership to ensure practice goals are tracked and achieved with smooth operation of the practiceAssist with new business intake and conflict check processManage staffing for new and expanding projectsManage schedule of deliverables and key datesAssist in the preparation of budgets and forecasts and track against actualsMarketing / Sales SupportMaintain database of materials for new opportunities, RFPs and presentationsManage and monitor SalesForce reporting for practice and provide information to leadership about new opportunities, pipeline and backlogSupport practice business development by managing new business source processes, managing client databases and support follow-up on opportunities and leadsMonitor and schedule FTI participation in industry events and conferencesCoordinate campaigns for practice and provide maintenance of client relationships in SalesforceManage practice website maintenance and updatesServe as a redundancy in operating the practice’s Twitter handle. HR / StaffingCoordinate recruitingComplete administrative orientations and training for new staffManage vendor/subscription contractsCoordinate as-needed employees and independent contractors.Client AdministrationManage billing processWIP and A/R surveillanceAssist project leads in establishing time entry guidelines at the start of engagements and ensuring the engagement team complies with unique engagement termsMaintenance of LOEs, MSAs, contractor and sub-contractor agreementsReceive, approve and process contractor invoices.Qualifications:10+ years work experience supporting senior-level professionals in a legal, consulting or financial services environment or equivalent experienceBachelor’s Degree or equivalent education background / commensurate work experienceExcellent verbal and written communication skillsAdvanced proficiency in software applications such as Microsoft Office especially Outlook, Word, Excel, PowerPoint; Eilte, Adobe Acrobat, SalesForceSales support and budget management experienceIncredible organizational skills and initiativeFlexibility to work under tight deadlines; ability to handle multiple tasks through prioritization and time management skills.Preferred Skills:Advanced proficiency with Microsoft Office, Carpe Diem, Elite and Salesforce Position Classification: Exempt  #LI-MS1 #CB#"}