{"jobID": "2802182711", "jobLocation": "Los_Angeles_CA", "jobTitle": "Jr. Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "As a member of the Ayzenberg Soulmates.ai team you will offer a strong data perspective while working closely with product managers, data scientists, and engineers. You are resourceful and enjoy proposing new ideas that drive key strategic decisions. The ideal candidate is business savvy, passionate about solving novel problems with data, and excited about working in an innovative and collegial environment.Responsibilities Data Wrangling: Identify data sources that can be useful to answer business questions.Perform experiments on ingested data to evaluate quality and integrity. Data Analysis and Visualization: Use advanced visualization techniques to present data insights in a compelling way.Apply advanced analytics to create metrics and KPIs that summarize insights from data.Provide advice to the business on strengths and limitations of statistical results, to avoid misuse. Documentation: Document processes and analyses, using reproducible methods and scripts.Work with data scientists and product mangers to provide proof of concept testing and regression testing as needed.Required CapabilitiesMinimum 2 years working in a Data Science/Business Analytics roleBachelors degree in a Mathematics or Science fieldExperience successfully implementing analytical solutions with real-world business impactProficiency in R, Python, Stata, SAS, Matlab or similar mathematical programming languages for advanced predictive modeling and visualizationStrong SQL skills (Postgres and Redshift preferred)Proficient with Tableau or other BI toolsProficient with Excel and PowerPointPreferred CapabilitiesExperience with Natural Language Processing (NLP) methods and applicationsSocial media and paid media analytics experienceDate warehouse development, ETL, and AWS knowledge/experience Were a Frontline agency. Creative, driven by data, shared with vision. Its what we do for our clients, and heres how we do it: We listen. Data is everywhere around us; the trick is turning that noise into insight. Weve got pioneering analysts with proprietary cyborg ears all over the web and social mediacurating and interpreting, informing everything we do in real-time, allowing us to stay always in front of what consumers want. We create. The best creative is born through Idea Darwinism. In our shop, concepts can come from anywhere and anyone. But when its time to execute, all our mingling people work, think, and create together, fluidly Voltroning into a slightly different super-machine for every project. The ecosystem we live in doesnt stay in compartments, so neither do we. We share. Were not above the trendiest trends, but our real passion is to stay in front of them. From the latest and greatest in culture to whatever sci-fi tech is coming around the bend, we care deeply about how we share your brand story. Thats why we include a social perspective in every one of our campaigns, so we can bring you to where your audience is engaged.  Listening. Creating. Sharing. Nimbly bringing it all together: thats what we do."}