{"jobID": "2786821103", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.krolldiscovery.com", "Headquarters": "Mc Lean, VA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " KLDiscovery, one of the  largest national eDiscovery providers, is currently seeking a Litigation Data  Analyst in Chicago, IL. This entry level position aids our eDiscovery Hosting  Department.Shift days and hours are Tue-Fri (2pm-10:30pm) & Sat  (10:30am-7pm). ResponsibilitiesValidate and Import/Export dataAnalyze and troubleshoot issues with data loadingProvide technical assistance to clients and end users  via telephone and emailTroubleshoot issues related to online databasesSetup database structures and permissionsConvert images and data to client specified formatsAdditional responsibilities in support of KLDiscovery's  hosted solutionsKLDiscovery OffersA friendly and welcoming team-oriented environmentOpportunities for career advancement and growthBusiness casual dressMedical/Dental/Vision benefits as well as  company-provided Life Insurance, Short Term and Long Term DisabilityPaid Time Off401(k) retirement savings plan with company matchQualificationsBachelor’s  Degree preferredKnowledge  of Microsoft Office Suite including Excel, Access and WordAbility  to manage multiple tasksProblem-solving  and organization skillsExcellent  written and verbal communication skillsKnowledge  gained by working within the litigation support industry with a  vendor or law firm would be a plusDatabase  experience and/or exposure to Relativity, Concordance and/or Equivio is  preferredOur Cultural ValuesEntrepreneurs at  heart, we are a customer first team sharing one goal and one vision. We  seek team members who are: Humble - No one is above another; we all work together  to meet our clients’ needs and we acknowledge our own weaknessesHungry - We all are driven internally to be  successful and to continually expand our contribution and impactSmart - We use emotional intelligence when working with  one another and with clients Our culture shapes our  actions, our products, and the relationships we forge with our customers. It  helps us stand out in an ever-increasing crowd of providers.Who We AreKLDiscovery provides technology-enabled services and software to help law  firms, corporations, government agencies and consumers solve complex data  challenges. The company, with offices in 43 locations across 19 countries, is a  global leader in delivering best-in-class ediscovery, information governance  and data recovery solutions to support the litigation, regulatory compliance,  internal investigation and data recovery and management needs of our clients.  Serving clients for over  30 years, KLDiscovery offers data collection and forensic investigation, early  case assessment, electronic discovery and data processing, application software  and data hosting for web-based document reviews, and managed document review  services. In addition, through its global Ontrack Data Recovery business,  KLDiscovery delivers world-class data recovery, email extraction and  restoration, data destruction and tape management.  KLDiscovery has been  recognized as one of the fastest growing companies in North America by both  Inc. Magazine (Inc. 5000) and Deloitte (Deloitte’s Technology Fast 500) and CEO  Chris Weiler was recognized as a 2014 Ernst & Young Entrepreneur of the  Year™. Additionally, KLDiscovery is an Orange-level Relativity Best in Service  Partner, a Relativity Premium Hosting Partner and maintains ISO/IEC 27001  Certified data centers.  KLDiscovery  is an Equal Opportunity Employer."}