{"jobID": "2761302147", "jobLocation": "San_Jose_CA", "jobTitle": "Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.slalom.com", "Headquarters": "Seattle, WA", "Size": "5001 to 10000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Deloitte, Avanade"}, "estimatedSalary": "127000", "jobDescription": " Slalom is a purpose-driven consulting firm that helps companies solve business problems and build for the future, with solutions spanning business advisory, customer experience, technology, and analytics. We partner with companies to push the boundaries of what’s possible—together.  Founded in 2001 and headquartered in Seattle, WA, Slalom has organically grown to nearly 5,000 employees. We were named one of Fortune’s 100 Best Companies to Work For in 2017 and are regularly recognized by our employees as a best place to work. You can find us in 25 cities across the U.S., U.K., and Canada. Job Title: Data Engineer Do you like working with data? Do you want to use data to influence decisions for products and services being used by business and consumers every day? If yes, we want to talk to you. Slalom is seeking a Data Engineer to join our Information Management & Analytics team.  As a Data Engineer, you should have expertise in the design, creation, management, and business use of extremely large datasets. You know and love working with analytic tools, can write excellent SQL, scripts (e.g. Python, PL/SQL) and ETL code (e.g. Alteryx, Informatica), and can use your technical skills and creative approaches to solve some unique problems in the BI space. In this role, you will be working across industry sectors such as retail, finance, healthcare and high-tech and you'll get an opportunity to solve some of the most challenging business problems. Responsibilities:Collaborate with engineers and business customers to understand data needs, capture requirements and deliver complete BI solutionsDesign and build data extraction, transformation, and loading processes by writing custom data pipelinesDesign, implement and support a platform that can provide ad-hoc access to large datasets and unstructured dataModel data and metadata to support adhoc and pre-built reportingTune application and query performance using performance profiling tools and SQLBuild data expertise and own data quality for allocated areas of ownershipWork with data infrastructure to triage infrastructure issues and drive to resolutionQualifications: Bachelor’s degree in CS or related discipline3 - 5 years of experience in using SQL and databases in a business environment3 - 5 years of experience in data warehouse space3 - 5 years of experience in custom ETL design, implementation, and maintenance3 - 5 years of experience with schema design and data modeling2 plus years of experience with programming or scripting languages (e.g. Python or shell scripting)Preferred experience working with either a Map Reduce or an MPP systemPreferred experience working with cloud platforms such as AWS, Google Cloud Platform or MS AzureExperience to analyze data to identify deliverables, gaps, and inconsistencies Slalom is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}