{"jobID": "2836215284", "jobLocation": "Carlsbad_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.artech.com", "Headquarters": "Morristown, NJ", "Size": "5001 to 10000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Data Scientist/Data ScientistJob ID: TMO-REQ-002673Location: CarlsbadDuration: 3 We are seeking a Data Scientist to join a newly formed team that will transform how we engage with researchers in the life science community. This role will be part of the team that develops and delivers a Client customer loyalty strategy that will both delight our customers and change our personalized marketing initiatives for the Life Science Division of Thermo Fisher Scientific.  The Data Scientist will use large data sets to find opportunities for program optimization and apply models to recommend the most effective course of action. The candidate will guide the optimization of marketing activities spanning customer engagement, acquisition, retention, upsell and cross-sell. In addition, this individual will build reporting and data extraction solutions, analyze and prepare recommendations to help address business challenges and guide strategic marketing decisions. The ideal candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders across Thermo Fisher Scientific to improve business outcomes.  The professional who best fits this position is highly analytical, passionate about data, and determined to deliver results through continuous improvement of our customers' all around experience. To be successful, this professional must be comfortable working in a fast-paced, highly matrixed environment at a global level and collaborating with large cross-functional teams across the organization. Responsibilities: · Drive the development and enhancement of analytic, predictive, and overall data strategies for the Loyalty program to optimize the effectiveness of the program across offline and online channels  · Utilize a combination of predictive, descriptive, and prescriptive analysis to drive actionable insights, predict and influence customer behavior, and increase revenue across offline and online channels  · Conduct performance, cost, and profitability studies for customer segments, program offerings initiatives, campaigns, etc. to optimize, enhance, and focus operations  · Develop reports, visualization, and key performance indexes to identify patterns and trends; predict customer behavior and profitability; track effectiveness of marketing and guide marketing decisions; and Client opportunities to increase customer engagement and revenue  · Run queries into data warehouses, CRM systems and other internal systems, to determine, create, and refine audiences and segments across offline and online channels for upsell, cross-sell, win-back, engagement, and other targeted programs  · Provide analysis and actionable insights related to VOC, pulled from several systems including online feedback mechanisms as well as customer support  · Act as a data expert for the Loyalty Program to provide quick and efficient understanding of data availability, limitations, and effectiveness  · Present findings and actionable recommendations to leadership to drive strategy  · Work closely with Benefit Managers, Global Market Development, Regional Market Development, eBusiness, Digital Analytics and business unit product management teams to ensure member adoption success, engagement and conversion  · May perform other related duties as required and/or assigned Qualifications: · BS in computer science, data science, data analytics, or applied statistics. MS preferred.  · Experience with Natural Language and Text processing  · 3+ years of experience with machine learning, data mining, statistical modeling tools and underlying algorithms  · Excellent pattern recognition and predictive modeling skills and experience in modeling and predictive analytics, including multivariate data mining and machine learning techniques  · 3+ years of experience in Python  · 2+ years of experience in R  · 1+ year of experience in building models in Spark using R, Python and Scala  · 1+ year of experience in Tableau  · 3+ years of experience in SQL  · A strong background in data analysis, predictive statistical modeling, customer profiling and segmentation, experiment design and A/B and multivariate tests  · Experience with collaborative and content filtering  · Ability to understand various data structures and common methods in data transformation  · Ability to understand new business domains and apply analytics solutions to meet business objectives  · Strong (written and verbal) communication and interpersonal skills  · Collaborative and able to build strong relationships quickly  · Must be able to derive insight and provide actionable recommendations to leadership  · Strong attention to detail, and the ability to manage multiple projects simultaneously  Please apply on our company website (www.artechinfo.com) with reference to job ID, or contact me at Pradeep.V@artechinfo.com / 973.507.7539  Pradeep  Team Lead – Staffing  Artech Information Systems LLC  360 Mt. Kemble Avenue, Suite 2000 | Morristown, NJ 07960  Office: 973.507.7539 | Fax: 973.998.2599  Email: Pradeep.V@artechinfo.com | Website: www.artechinfo.com About Artech Information Systems LLC Artech is an employer-of-choice for the last 25 years to over 7,500 consultants across the globe. We recruit top-notch talent for over 70 Fortune and Government clients coast-to-coast across the U.S., India, and China. We are #1 Largest Woman-Owned IT Staffing Firm in the US and this may be your opportunity to join us! For more check: www.artechinfo.com Connect with Artech through Social Media Learn more about our company including the latest events at Artech, new job opportunities, jobseeker tips, and more. Follow us on Facebook, Twitter, LinkedIn, Google+, and YouTube"}