{"jobID": "2823687158", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Data Scientist / Predictive Analytics Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.farmers.com", "Headquarters": "Woodland Hills, CA", "Size": "10000+ employees", "Founded": " 1928", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": "We are Farmers!Join a team of diverse professionals at Farmers to acquire skills on the job and apply your learned knowledge to future roles at Farmers. Farmers Insurance also offers extensive training opportunities through the award winning University of Farmers named by Training magazine amongst top 10 corporate training units in the world. Start your career at Farmers today!Job SummaryThis position is a true Data Scientist roleContributes to the development and implementation of predictive models / analytics through the application of advanced statistical and analytical techniques in order to deliver data driven insights supporting business objectives.Essential Job FunctionsDesign and create predictive models and analysis to address business needs.Support preparation of internal/external, structured/unstructured data sets to build/rebuild/refresh predictive models.Communicate models to audiences outside of department; coordinate with business leads to develop understanding, engagement, and branding.Contribute to the development of new modeling techniques and procedures.Continuously deepen knowledge of insurance industry practices across multiple disciplines.Review programs to ensure they conform to quality standards.Education RequirementsMathematics, Statistics or Computer Science Bachelor's degree. Master's degree preferred.Experience Requirements5 years of experience AFTER Maters/PHD in related fieldMust have experience in a Data Scientist role, including predictive modeling experience (this experience is excluding internships and academic project)Advanced experience with programming and database tools such as Python, R, SQL, C , Java and SAS.Special Skill RequirementCuriosity to explore and analyze business problems through data, seeking insights that propel Farmers Insurance forward as a leading provider of Business Insurance.Advanced understanding of statistical and predictive modeling techniques such as machine learning, Text Mining, decision trees, probability networks, association rules, clustering, regression, and neural networks and their application to business decisions.Farmers is an equal opportunity employer, committed to the strength of a diverse workforce. Farmers"}