{"jobID": "2822790205", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.capitalgroup.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1931", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "Req ID: 18467 Experience Level: Professional Other Location(s): N/A Relocation offered: Yes Travel required: None Come grow with us At Capital Group, how we work is defined by shared values that include absolute integrity, respect and collaboration. But it’s more than that. It’s smart and highly driven people united in purpose to serve our investors and one another.  Bring your energy and unique perspective to Capital and you’ll have the opportunity to grow with us professionally, personally, and financially. You’ll be part of a team that genuinely cares about helping you succeed. You’ll work alongside talented colleagues, many of whom build long careers while progressing through multiple roles, establishing lifelong friendships and making a difference in our communities. In return for your contributions, you’ll receive premier compensation and benefits, and a company-funded retirement plan that ranks among the most generous. Full Time Associate HighlightsCompensation: We target the upper quartile of the market for total cash compensation, including base salary and bonuses. We also take a pay-for-performance approach, rewarding each associate commensurate with their contribution to the organization.Benefits: In addition to health, life, and retirement benefits starting from day-one, you will have access to a wealth of additional benefits, ranging from tuition assistance to ample paid time off.Professional Development: We provide guidance on specific topics that you and your manager can discuss during your monthly one-on-one meetings that are completely tailored to you as an individual. Our Data Strategy and Operations team is focused on implementing and evolving Capital Group's investment data strategy to enable the full range of business objectives; data for minimizing risk, data for efficient processes, and data for growth and innovation. It also delivers a set of capabilities to source, automate, and curate data assets to enable and enrich core investment and distribution processes, quantitative analytics, reporting and analysis, and advanced analytic efforts such as artificial intelligence.  As a Senior Data Solutions Analyst based in Los Angeles, you will serve as an investment management data expert. You will provide direction to Analysts and Associates and assist them in completing their assignments. You will participate in the training and development of other associates and serve as a positive role model and mentor. Responsibilities:Provide guidance on prioritizing data requirements within a business unitEvaluate new and alternative data sources and new integration techniquesContribute to data models and designs for the data warehouseWork with complex data structures and provide innovative ways to solution for complex data delivery requirementsPrototype complex reporting and/or data visualization solutions in partnership with IT and other business unitsEstablish standards for documentation and ensure your team adheres to those standardsInfluence and develop a thorough understanding of standards and best practices used by your teamQualifications:5+ years of experience with business intelligence, analytics, reporting, and data transformationDemonstrated experience in translating unstructured business problems into clearly defined requirements frameworkBachelor's degree requiredAdvanced knowledge of SQLAdvanced knowledge technical and functional designs for databases, ETL, data warehousing, and reportingAdvanced knowledge scripting tools for automation such as R, Python, Alteryx, etc.Advanced knowledge with reporting/data visualization tools such as Tableau, SSRS, etc.Company Overview: Founded in 1931, Capital Group is one of the world’s largest and most trusted investment management companies and home to the American Funds. We manage more than US$1.39 trillion in assets, and our 7,500 associates make our clients their first priority every day. When we do our job right, millions of investors around the world fulfill their dreams and financial goals, from home ownership and higher education, to a comfortable retirement. Our long-term investment results and outstanding service set us apart from our competitors, while our workplace sets us apart from other employers. We are an equal opportunity employer, which means we comply with all federal, state and local laws that prohibit discrimination when making all decisions about employment. As equal opportunity employers, our policies prohibit unlawful discrimination on the basis of race, religion, color, national origin, ancestry, sex (including gender and gender identity), pregnancy, childbirth and related medical conditions, age, physical or mental disability, medical condition, genetic information, marital status, sexual orientation, citizenship status, AIDS/HIV status, political activities or affiliations, military or veteran status, status as a victim of domestic violence, assault or stalking or any other characteristic protected by federal, state or local law."}