{"jobID": "2628084170", "jobLocation": "Irving_TX", "jobTitle": "Data/Sys Sr Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.hiretalent.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Previous  Data/Sys Sr Business Analyst  Next  -Basic Job Information Ref No.: 17-04353 Location:  Irving, Texas Position Type: Contract Start Date / End Date:  12/18/2017 to 06/29/2018  -Job Description Job Title: Data/Sys Sr Business Analyst Job Duration: 6 months Job Location: Irving, TX Job Description: Required Function 1: The Data/Systems Sr. Business Analyst functions as the liaison between the Developer and internal/external clients. Reviews, analyzes, evaluates and documents the technical components of data/systems and business requirements for new product development, applications and analytics.Required Function 2: • Reviews, analyzes, and evaluates data/system business requirements for existing and new development. • Writes detailed technical and business specifications, program functions, and steps required to develop or modify data files or systems • Creates project plans, conducts project meetings and coordinates other project activities such as testing. • Provides data mappings, user interface specifications, processing logic as per business requirements to the Developer. • Communicates with users, developers, and management as needed. • Tests development efforts and assists the client in user acceptance testing. • Provides regular status reports to clients, developers, and management as needed. • Provides mentorship and guidance to junior Analysts on the team as needed. • Leads the data analysis and profile efforts for new client implementations and system enhancements. • Leads technical meetings with IT and business project team. • Performs other functions as assignedRequired Function 3: • Ability to drive project timelines to completion with a cross-functional team • Ability to understand relational database concepts and client-server concepts. • Ability to be careful and thorough about detail. • Ability to analyze information and use logic to address work-related issues and problems. • Ability to work proficiently in Microsoft Word, Excel, and Project. Required experience in Access, Outlook, PowerPoint, SQL, and Visio. • Familiarity with TSO, File-Aid, and reviewing Flat files. • Experience working within the Healthcare industry. • Experience using ServiceNow and VersionOne is a plus. • Understanding of the SDLC. • Ability to work on complex projects with general direction and minimal guidance. • Ability to work independently as a member of various teams and committees. • Ability to multi-task and work under pressure.Required Function 4:Minimum education: Bachelors degree in related field or equivalent work experience requiredMinimum Related Work Experience: 5+ years related work experience Strong SQL knowledge Strong relational database systems knowledge Exposure and/or familiarity with various IT platforms and languages such as Informatica Power center, Java, DB2, SQL DB "}