{"jobID": "2733438382", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Research Scientist II", "companyRating": "3.4", "companyInfo": {"Website": "www.danaher.com", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (DHR) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " The Research Scientist II will provide expertise for a variety of developmental processes and function in the laboratory as an integral part of project teams focused on optimizing methods and processes for cell-based manufacturing.  Primary Responsibilities:  Experience with purification of monoclonal antibodies and expressed proteins, experience with viral particles is a plus (gene therapy and/or vaccine fields)  A good understanding of protein purification mechanisms and basic protein analysis tool (gels, ELISA)  Experience with upstream processes desirable, but not required  Prior experience compiling information into technical reports  Ability to solve complex issues independently  Strong computer, scientific, and organizational skills  Ability to handle multiple tasks with good organizational skills  Skills and Knowledge:  Plan and execute experiments for DSP, analyze data  Performance of required analytic assays, possibly including gels, ELISA, qPCR, protein glycosylation mapping.  Analyze project results and summarize for discussion with team. Make recommendations for further optimization  Help with administrative functions for assigned projects – including organization of meetings, preparation of reporting docs, etc.  Ability to communicate effectively  Strong team-oriented work style  Self-starter w/ ability to execute technical tasks and projects with minimal supervision  Computer literate (Word, Excel, PowerPoint)  Abilities to adequately record, analyze and document analytical data  Ability to reproducibly follow established procedures and critically analyze data using statistical tools  Ability to work effectively with cross-functional groups  Good hands-on and productive in the laboratory  Highly motivated  Must be able to function effectively in a team environment  Must have excellent organizational and communication skills  Excellent hands-on laboratory expertise  M.S. or PhD. in Cell Biology, Bioengineering, Microbiology, or related field, with 5-7 years of bioprocessing experience  The ideal candidate will have experience in one or more of the following areas: Scale-up of manufacturing processes, principles of particle separation technology, mammalian cell culture, stirred-tank bioreactor process development  Experience in a cGMP environment is also highly desirable"}