{"jobID": "2781146402", "jobLocation": "Chicago_IL", "jobTitle": "DATA ENGINEER", "companyRating": null, "companyInfo": {"Website": "www.farmersfridge.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Restaurants, Bars & Food Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Farmer’s Fridge, we love data. Every executive decision is (almost) backed by data. Our company’s mission is to provide \"24/7 access to food you can trust\". We believe it is only possible to accomplish our mission with good data you can trust.  We are integrating multifaceted data streams such as real-time IoT data, production and logistics data, purchase data from the fridge, and engagement data from the mobile apps, so that we continuously improve and optimize our business workflows. We are looking for a Data Engineer to join our tech team and this could be you.  main course: As a member of the tech team you will grow our existing cloud and data infrastructure, democratize access to data, champion the use of data and analytics at the company. Be the pioneer of a data-driven culture.You will work with tech, marketing, sales, operations, finance and other business functions to scope, design and implement their data needs.You will help identify significant data sources and key variables for various business functions.You will lead the design and development of the data pipelines to productionize and ingest meaningful business data into a unified data model.You will enable others to \"play\" with the data to validate (or invalidate) hypotheses, answer some questions, and build trust and confidence (arent both the same?) in the data.You will ensure the high data quality by putting regular automated quality checks in the pipeline and fine tune the model.You are responsible for developing real-time predictive analysis tools and back-end platform in our cloud environment.Moreover, you will experiment with machine learning to identify new growth opportunities and personalize our servicesWe will help you with all the above, says our 12-member diverse tech team :) bring your own (byo): Bachelor’s degree in Computer Science/Computer Engineering or related technical field.Proficiency in multiple programming languages, particularly Python, R or Javascript, with minimum two years full time professional experienceYou can write SQL while (day) dreaming.You have developed data warehouse, data ingestion and integration pipelines in your past life.You are comfortable with both batch and stream data processing.You know what it takes to build scalable and performant data models.You value writing tests and people who write tests.Preferably, you have worked on Amazon Web Services (AWS) Cloud.Ideally, you have experience with data visualization. icing .. or just the cake: Traditional Benefits – Health, Dental, Vision, Life, Short Term Disability, LTD, 10 Paid Holidays and Paid Time Off.Daily Fridge Credits – You can enjoy these fixed credits at any Fridge.Monthly Cellphone Bill CreditFantastic Team – You will get to work with a phenomenal and passionate team that is constantly pushing the market boundaries to make healthy food accessible 24/7.Clarity Breaks – We absolutely encourage you to step away from your routine to reflect on your work strategy and top priorities.Monthly Yoga Classes –You can participate every month in our office yoga class in order to relax, meditate and stretch your body.Volunteering Opportunities – We love to engage with our community and participate in events that are aligned with our Core Values.Sports Leagues – Another way our employees engage with the community that fuels teamwork and collaboration with a healthy dose of competition.Spontaneous Events – Solar eclipse event at the park? We’re there. Daybreaker party at the Planetarium? Count us in. Taste of Chicago impromptu get together? Absolutely! We are constantly scoping nearby events to give our team a break from our unconventional routine.Family Events - From company sponsored BBQ’s to social gatherings, we always make time to meet our team member’s family members and friends.So much! And of course, we have professional development opportunities."}