{"jobID": "2831406901", "jobLocation": "Washington_DC", "jobTitle": "Scientist, Enterprise&Data; Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.comcastcareers.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CMCSA) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " AT&T, Time Warner Cable, Verizon"}, "estimatedSalary": "52000", "jobDescription": "Business Unit:Job Summary: Responsible for leveraging internal and external data to provide  insights and information which supports a facts-based decision making  process. Provides input into strategy, analysis methods, and tool  selection. Acts as a key contributor in a complex and crucial  environment. May lead teams or projects and shares expertise.  Employees at all levels are expect to: Understand our Operating Principles; make them the guidelines for how you do your job Own the customer experience-think and act in ways that put our customers first, give them seamless digital options at every touchpoint,  and make them promoters of our products and services Know your stuff-be enthusiastic learners, users and advocates of our game-changing technology, products and services, especially our digital  tools and experiences Win as a team-make big things happen by working together and being open to new ideas Be an active part of the Net Promoter System-a way of working that brings more employee and customer feedback into the company-by joining  huddles, making call backs and helping us elevate opportunities to do  better for our customers Drive results and growthRespect and promote inclusion and diversityDo what's right for each other, our customers, investors and our communities Core Responsibilities:Lead a small group of less experienced team members on analytical projects or on cross-functional teams. Frequently serves as team lead on  multiple projects, mentor and train junior team members. Review and approve methodologies used for advanced analysis projects (predictive models, clustering/segmentation, etc.) by junior team  members and others Leads complex projects using wide breadth of data sciences and advanced techniques. Manages the review, revision and maintenance of existing internal procedures to ensure quality and efficiency. Determine appropriate methods, prove viability of selected method and educate internal teams as to the analytical foundation. Uses analytical rigor and statistical methods to analyze large amounts of data, extracting actionable insights using advanced statistical  techniques such as data analysis, data mining, optimization tools, and  machine learning techniques and statistics (e.g., predictive models,  LTV, propensity models). Leads large scale projects that utilize online&offline; data, structured&unstructured; data, set top box data  (media/behavioral/attitudinal) to build customer centric models and  optimization tools. Consistent exercise of independent judgment and discretion in matters of significance. Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) as necessary. Other duties and responsibilities as assigned.Job Specification:Master's DegreeEconomics, Statistics, Mathematics, Decision Science, Operational Research, Computer Science, Engineering, or related field - Generally requires 7-11 years related experience. Comcast is an EOE/Veterans/Disabled/LGBT employer"}