{"jobID": "2831071574", "jobLocation": "Washington_DC", "jobTitle": "Area Senior Maintenance Technician", "companyRating": "4.5", "companyInfo": {"Website": "www.equityapartments.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Public (EQR) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " UDR, AvalonBay Communities"}, "estimatedSalary": "18", "jobDescription": " *This is a floating position supporting our Metro DC portfolio of 47 communities.  Working for Equity Residential means being part of a community  employees and residents striving to provide the best in apartment living,  speaking boldly about new ideas for innovation, and inspiring creativity in the  ways we live and work. Thats what our Be.Think.Play.Live. culture is all  about.  Our Senior Maintenance Technicians are a key part of each communitys  success. They are our repair leaders who provide the technical know-how behind  each apartment community and provide guidance and training to other maintenance  professionals. From HVAC to plumbing to a fresh coat of paint, Senior  Maintenance Technicians have a hand in every apartment and every residents  satisfaction. Senior Maintenance Technicians are personable, multi-talented,  technically skilled individuals with a passion for fixing things and a keen eye  for detail.  As a Senior Maintenance Technician, you will work with one of our top  property management teams to provide exceptional service to residents. Each day  will be unique, requiring a diverse set of skills. You will collaborate with  team members to assess and respond to maintenance issues, develop a rapport  with residents by being both knowledgeable and friendly, and inspire trust by  caring for our community and making our apartments feel like home.WHO YOU AREA Maintenance Whiz. You have a solid understanding of  general maintenance and are quick to learn new skills.A Clear Communicator. You help residents and teammates  understand the timeline and process for repairs.A Team Player. You are united with teammates in delivering the best experience to  residents.Proactive. You act like an owner, performing regular maintenance to avoid  emergencies.Personable. You are respectful,  pleasant to be around, and enjoy engaging with others.Levelheaded. You keep your cool during maintenance emergencies and quickly find  solutions.Motivated. You invest extra energy to reach your goals.Solution-Oriented. You follow through on commitments, letting residents know they matter.Organized. You are flexible and able to juggle  multiple priorities and interactions with residents and teammates smoothly.WHAT YOULL DORepair and enhance our community. Youll be responsible for repairing and  maintaining all plumbing,  electrical, HVAC, appliance, carpentry, and painting needs at the community.Build rapport with residents. You'll make positive  connections with residents by offering a smile and a greeting when you see them  and chatting as you make repairs in their homes.Manage service requests. Youll launch into action when  maintenance issues arise, collaborating with teammates and prioritizing service  requests to earn trust and build resident satisfaction.Know the make-ready schedule. Youll monitor apartment vacancies daily  and initiate the turnover process with painting, cleaning and repairing.Tend to preventive maintenance. Youll safeguard equipment with regular  tune-ups, helping equipment last longer and minimizing costly repairs.Notice the details. Youll walk the property daily,  inspecting all areas for cleanliness and safety, and helping to maintain great  curb appeal.REQUIREMENTS1+ years of  hands-on general maintenance experienceAvailability to  work a flexible schedule, including weekendsRotating on-call  responsibility for after-hours emergenciesValid driver's  license and/or access to reliable transportationPREFERRED EXPERIENCEHigh school  diploma or equivalentHVAC experienceEPA Certification  (Type I & II or Universal)Trade school  and/or military training or industry designation (CAMT or CAMT II)REWARDSWe recognize everyone has  different needs outside of work. Thats  why, in addition to a competitive benefits package (medical, dental, vision and  paid time off), we offer many unique options to employees, like adoption  benefits and paid time off for community service projects. To learn more, view  our Total Wellbeing page here."}