{"jobID": "2757062398", "jobLocation": "Southfield_MI", "jobTitle": "Data Architect/Data Modeler", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Our Direct client is looking for a Senior DATA ARCHITECT/DATA MODELER/SOLUTION Architect who has experience using Datastage, highly skilled in Data modelling/Data Architect, who can architect solutions using Datastage and Oracle (atomic and data mart modeling) having solid experience in solution using Data-warehousing technologies.  As a BI/Data Architect /Solutions Architect, you will act as the primary technical architect for datawarehousing projects to solve some of the toughest challenges in business intelligence today. The successful candidate should possess deep technical expertise in ETL design, reporting and analytics and will have previous consulting experience utilizing a structured delivery methodology. RequirementsMust have skills/Tools/Technnology ExperienceETL DataStage, Informatica SQL Server, Oracle, DB2, Teradata, People Soft Financials 9.2IBM BDW and IBM MDM Server experienceData Integration and management framework Data Integration Models like Stone Soup, FIT etc)ERWIN, Model Mart and S-DesignerData Models, Process Models, Star Schema Models,Snowflake Models, Hierarchical ModelsNetezza Performance ServerEnd-to-End Process and Implementations ExperienceInformation Architecture and Re-usability Online-Offline Integration methods experienceADDITIONAL QUALIFICATIONA minimum of 18 + years’ experience architecting large scale data warehousesA minimum of 7 years of relevant consulting experience preferred or 15 years of corporate ITExpert data modeling skills (i.e. conceptual, logical and physical model design - with both traditional 3 rd normal form as well as dimensional modeling (star, snowflake), experience with Operation DataStores, Enterprise Data Warehouses and Data MartsEXpert ETL Designing, Data ArchitectingExpert with pro's and con's of multiple warehouse architecturesExpert in Data Sourcing from multiple sources.Expert RDBMS knowledge of Oracle (release 9i and 10g) including very large databasesExpert in load design strategies and optimization techniques,Implementation experience with ETL concepts and tools such as: Oracle Warehouse Builder, Informatica, DataStage, and ab InitioImplementation experience with one or more of the following BI/Enterprise Reporting tools: Oracle Discoverer, Business Objects, Cognos, Brio, and MicrostrategyPossess strong communication and client management skills.Ability to effectively manage multiple projects simultaneously"}