{"jobID": "2724715388", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Quality/Sales Reporting Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.rubrik.com", "Headquarters": "Palo Alto, CA", "Size": "201 to 500 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "Job SummaryRubrik has become the fastest growing enterprise startup in Silicon Valley. We are seeking a highly strategic, driven, and analytical individual to join the Sales Operations team! The Data Quality/Sales Reporting Analyst role reports into the Head of Worldwide Sales Operations. The Sales Operations team is integral to the success of the Sales organization by helping to drive revenue and sales productivity. This is a full-time position located at Rubrik HQ in Palo Alto, CA.  Where you can make an impact: Deliver weekly, monthly, and quarterly sales reports/dashboards with actionable insights.Proactively identify opportunities to automate manual reporting/data processes and manage execution of those projects.Continually enhance reports and data requirements to maximize analysis capability.Work independently to develop new reports and dashboards as needed.Support ad-hoc data and reporting requests.Run analytics projects to proactively identify trends and areas of opportunity to improve, deliver recommendations to sales leadership, and drive outcomes that improve revenue and productivity.Drive scalable data quality strategy, policies, processes, and automation needs. Who you are: Highly analytical / abstract thinker: You ask the questions that others aren’t asking and draw connections between data and business impact. Identify the 80/20 opportunities to reach insightful, actionable answers without boiling the ocean with analysis overload.High-energy, company first, positive attitude: Passionate and motivated to make a massive impact and work hard in a fast-paced environment.Strong presentation skills: Quick and high quality analysis and presentation creation using advanced Excel and PowerPoint.Multi-tasking prioritization expertise: Experience (and preferably an enjoyment of) balancing numerous different priorities and demands.Strong people skills: Ability to develop relationships, drive consensus, and results from cross-functional teams.Great communication skills Ideal background: 1+ years of sales reporting experience for enterprise technology organizationsExperience with Salesforce.com, analytics and BI tools preferredExperience engaging with senior executivesAdvanced excel and computer programming background a plusUndergraduate degree from top tier university a plusRubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}