{"jobID": "2804269928", "jobLocation": "San_Diego_CA", "jobTitle": "Analyst, Operations - Enterprise Data Management - Pricing & Security Master", "companyRating": "3.1", "companyInfo": {"Website": "www.lpl.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1968", "Type": " Company - Public (LPLA) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Our Analyst in Performance & Data Recon is a team expert responsible for aiding in the design, implementation and ongoing support of new technology solutions for multiple firm or department level initiatives. This role is specific to the Enterprise Data Management project and the operational applications, processes and reports being created to provide governance over LPL's enterprise data. The Analyst is knowledgeable in relational databases as well as data management including analysis, architecture and modeling. In addition, the Analyst possesses the ability to develop Microsoft SQL scripts used for data analysis, process improvements, and reporting used for strategic planning. Other duties include supporting UAT using application lifecycle management software such as HP Quality Center and maintaining technical internal documents. The analyst must possess excellent prioritization skills and should be comfortable working in an agile environment. Essential Functions:Support manager/or AVP on multiple and possibly overlapping projectsDatabase support through architecture improvements and SQL back-end enhancementsRoot cause analysis of production and test environment issuesTrend analysis and solution implementation using multiple parameter filters in MS Access, SQL StudioAlignment of T and STO data quality initiatives for the purpose of accurate performance reportingReporting that will be used to make strategic management decisionsSolution implementation with management directionUpdate and maintain technical department proceduresIdentification of defects through user acceptance testingQualifications:Bachelor’s degree in Business, Finance, Management Information Systems, Computer Science6+ years in the brokerage and financial services industryFINRA licensing a plusHighly advanced skills with Access and SQL development to support extremely complicated applications with complete end to end control of the software development lifecycleVBA development and data mining experience a plusStrong understanding of managing investment performance dataStrong analytical and problem solving skills with a keen attention to detailKnowledgeable in portfolio and investment sleeve transaction accounting and reconciliationKnowledgeable in a wide range of investments, including but not limited to; mutual funds, fixed income products, options, common stocks and annuitiesProject coordination experience desiredWorking knowledge of Word, Outlook, Visio and PowerPointExcellent verbal and written communication skillsAbility to perform under pressure with competing deadlinesAbout LPL Financial: LPL Financial is a leader in the retail financial advice market and the nation’s largest independent broker/dealer*. We serve independent financial advisors and financial institutions, providing them with the technology, research, clearing and compliance services, and practice management programs they need to create and grow thriving practices. LPL enables them to provide objective guidance to millions of American families seeking wealth management, retirement planning, financial planning and asset management solutions. LPL and its affiliates have more than 3,700 employees with primary offices in Boston, Charlotte, and San Diego. Our Culture: If you join LPL, you will join a culture that believes in delivering a world-class client experience and looks to all employees to contribute to that goal by sharing their creativity, experience, and passion for continuous improvement. As a destination of choice, our top priorities are growth and development, social responsibility, and financial health for our employees.  We offer competitive compensation and industry leading benefits, including a wellness facility with onsite fitness classes, healthy meal choices, and a walk-in clinic. We support employee financial health through a 401k match, ESPP, and employee discounts. Work/life balance is our foundation and is supported through paid holidays, and paid time off (including time to volunteer). We foster a diverse work environment through Employee Resource Groups and diverse strategic partnerships.  Join the LPL team and help us make a difference by turning life’s aspirations into financial realities. Please login or create an account to apply to this position. Principals only. EOE  *As reported by Financial Planning magazine, June 1996-2017, based on total revenue."}