{"jobID": "2796404715", "jobLocation": "Chicago_IL", "jobTitle": "Data Analytics Consultant - Long Term Care", "companyRating": "3.2", "companyInfo": {"Website": "www.cna.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1897", "Type": " Company - Public (CNA) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Chubb, Zurich Insurance Group, The Hartford"}, "estimatedSalary": "90000", "jobDescription": "Job SummaryBe a member of the long-term care (LTC) Finance & Reserving team engaged in the transformation of reserve valuation processes and financial reporting. This role reports directly to the Assistant Vice President of LTC Finance & Reserving and actively partners across the broader LTC business with the Data & Analytics, Operations, Actuarial Experience and Actuarial Pricing teams. This role is responsible for identifying and implementing solutions to automate processes and reporting, interpreting data and results, and providing actionable insights.Become a subject matter expert on LTC reserving and financial data, processes, and interpreting and explaining results. Create innovative solutions to automate processes, build reports, dashboards, and metrics using coding and visualization software (including Alteryx, R, SQL, Tableau, and Qlikview) in support of Reserving and Financial processes, reporting, and insight generation. Develop relationships and fill reporting and analysis needs of the LTC Finance and Reserving team.Essential Duties & ResponsibilitiesPerforms a combination of duties in accordance with departmental guidelines:Evaluates data processes supporting finance and reserving processes, creates, and implements solutions to automate processes and enhance control environment.Performs moderately complex modeling for the purpose of quantifying the performance of LTC and evaluating operational changes. Reports findings to business partners and make recommendations to management.Interprets data and identifies relevant analyses; Monitors trends over time and provides actionable insights that support the active management of the claim block.Determines possible solutions using technical experience, judgment, and precedents.Builds dashboards and prepares reports for business partners and/or Management.Identifies opportunities to leverage new IT solutions in support of objectives.Receives a moderate level of guidance and direction; provides informal guidance to new team members.Actively partner with broader LTC business and may partner with other teams across the organization and/or participate in special projects.Champion the adoption and continued use of new data consumption tools (e.g. Tableau, Qlikview, R, Alteryx)Responds to and fulfills ad hoc data requests.May perform additional duties as assigned.Reporting RelationshipManager or aboveSkills, Knowledge & AbilitiesStrong business acumen including technical knowledge of statistical, financial, and economic concepts, which may include a specialty area.Solid knowledge of applications such as Microsoft Office Suite, visualization software (e.g. Tableau, Qlikview) and experience with a coding language (e.g. Alteryx, SQL, R).Strong analytical and problem solving skills with the ability to effectively resolve moderately complex situations and issues. Demonstrates attention to detail.Strong interpersonal, communication, and presentation skills. Ability to effectively interact with all levels of CNA’s internal and external business partners.Ability to work independently, as well as in a team, manage time and resources to accomplish multiple tasks and meet deadlines.Solid project management skills and strong organizational skills with the ability to prioritize and manage work deliverables/projects effectively.Education & ExperienceBachelor's Degree in Business, Economics, Mathematics, Finance, Statistics, Actuarial Science or related field.Typically a minimum of four years of related work experience."}