{"jobID": "2797455412", "jobLocation": "Chantilly_VA", "jobTitle": "SW Engineer/Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.alionscience.com", "Headquarters": "Mc Lean, VA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "Responsibilities/Qualification Alion is seeking an experienced nuclear engineer or scientist to support a dynamic, multidisciplinary team at a government facility in Northern Virginia. The successful candidate will work to develop methodologies and processes for the full spectrum of counter-WMD planning – from developing and running models through interpreting and documenting results, to preparation of technical reports and briefing the results. SECURITY CLEARANCE: Candidate must possess an active TS/SCI, or a Top Secret clearance with a current SSBI, and be eligible to obtain a TS/SCI w/ ploy level clearance.PRIMARY RESPONSIBILITIES:Use exploitation products, intelligence resources and engineering expertise to to characterize selected facilities.Provide engineering guidance and judgment throughout the characterization process to produce accurate estimates.Work within a matrixed team including engineers, scientists, modelers (physics-based, agent-based and structural) and intelligence analysts.BASIC QUALIFICATIONS: (list the “must have” requirements to be considered for hire)Bachelor’s degree in Physics or Nuclear Engineering or related field + 5-8 years’ experienceProficiency in Microsoft Office suite of toolsExcellent verbal and written communication skillsStrong background in HVAC, power / electrical or communications engineering.Excellent written and verbal communication skills with the ability to successfully brief and interact with Senior Officials.Ability to work in a fast-paced, high-energy environment.ADDITIONAL QUALIFICATIONS:Advanced degree in Physics or Nuclear Engineering or related fieldProfessional Engineer certificationExperience working in CONUS or OCONUS nuclear facilityMilitary or defense-related experience and an understanding of operational planning is a strong plus. *CJ Diversity Statement Women, minorities, individuals with disabilities and veterans are encouraged to apply. Alion will provide a reasonable accommodation to individuals with disabilities and disabled veterans who need assistance to apply. Please visit the Alion Careers site for more information  U.S. Citizenship Required."}