{"jobID": "2830567058", "jobLocation": "Portage_MI", "jobTitle": "IS Data Migration Analyst", "companyRating": null, "companyInfo": {"Website": "www.stryker.com", "Headquarters": "Portage, MI", "Size": "10000+ employees", "Founded": " 1941", "Type": " Company - Public (SYK) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Johnson & Johnson, Smith & Nephew"}, "estimatedSalary": null, "jobDescription": "Job Description The Data Migration Analyst will be techno-functional expert having great coordination, communication and management skills. Initially, the Data Migration Analyst will support our Accelerate program, Stryker's largest transformational program to date, and will support our SAP ERP system.  The Data Migration Analyst will be responsible for the completion of functional requirements and field mapping documentation for assigned data objects. This individual will be an integral part of the data conversion test cycles, supporting all the issues resolution activities between the technical teams, work stream leads, data domain leads, and SME's. Select responsibilities include: Initiate work stream data conversion activities for each new wave of the Accelerate Program.Provide technical / functional subject matter expertise and technical / functional clarification for SAP data objects and configuration in support of design sessions with related Process Teams to confirm functionality-driven data standards.Provide knowledge transfer and historical context of prior wave data conversion design decisions to implementation partner.Contribute and influence key data conversion design decisions.Assist with the identification and coordination of Stryker IS legacy system owners and subject matter experts to identify data migration, field mapping, and transformation design requirements for all assigned data objects.Participate in and support end user training for SAP Data Conversion tools (e.g. Information Steward) and data conversion processes (e.g. Mock data load validation activities).Support the development unit and end-to-end data migration test plans and test scripts (including testing for data extraction, transformation, data loading, and data validation).Support data cleansing strategies, action plans, and Data Readiness Network (DRN) activities to assist in the remediation of the data cleansing, construction and/or validation cycles including the creation and maintenance of data readiness reports and scorecards.Provide functional and technical support, defect management, and issue resolution during all testing cycles, including Mock Data Load cycles.Ensure implementation partner aligns to program standards and Stryker IS policies.Provide governance and final signature approval for all Data Conversion documentation for each data object.Continuously evaluate and drive measurable improvements to processes, platforms, tools, and related technologies; provide necessary trainings to communicate changes and measure outcomes.Minimum Education, Experience&Qualifications;:Bachelor's degree from an accredited university required. Bachelor's degree in the areas of Computer Science, Engineering, Information Systems, Business, or equivalent field of study preferred.Minimum of 5-8 years of professional working experience in IS or equivalent business function.Techno-functional ERP expertise, including knowledge of available reports and database tables.Excellent coordination and communication skills.Ability to maintain strong relationships within program team, across Stryker Divisions and Geographies.Experience of working large-scale ERP projects or ERP production support a plus.Ability to translate functional requirements to test scenarios.Ability to understand the data models and structures of complex technology systems.Experience analyzing and implementing interfaces between systems is a plus.Must be able to prepare regular written and verbal presentations, technical documents, and reports.Track record of successful delivery at the individual and team levels.Ability to explain complex technical concepts to a non-technical audience.Exhibits acute business acumen and understanding of organizational issues and challenges.Aligned with program goals and principles.Demonstrates a strong work ethic and willing to take the lead on their own initiative, meet deadlines, and produce consistent high-quality work.Demonstrated data analysis and problem-solving skills required.Strong analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracy.Flexible and willing to adapt to changing business requirements and be prepared to learn and support a variety of project needs and new technologies. Work From Home: No  Travel Percentage: None  Stryker Corporation is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, gender identity, sexual orientation, national origin, disability, or protected veteran status. Stryker is an EO employer M/F/Veteran/Disability.  Stryker Corporation will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information."}