{"jobID": "2593881583", "jobLocation": "Lemont_IL", "jobTitle": "Software Development Specialist Data Centric Workflows - TERM", "companyRating": "4.1", "companyInfo": {"Website": "www.anl.gov", "Headquarters": "Lemont, IL", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Oak Ridge National Laboratory, Lawrence Livermore National Laboratory, Fermilab"}, "estimatedSalary": "78000", "jobDescription": " We invite you to apply for a Software Development Specialist position with the ALCF with a focus on data-centric workflows. You will join the data sciences group and provide technology vision, research, development and support in data-centric workflows to glean insights from large-scale datasets being produced by simulations, experiments and observations in domains including material science, genomics, neuroscience, engineering, and high energy physics. You will also work closely with the Mathematics and Computer Science division on the Swift parallel scripting language (swift-lang.org/Swift-T) for exascale. You will work in a highly collaborative environment involving science application teams, academia, industry as well as other national labs and agencies.  Position Requirements Experience with high-performance computing.Significant experience programming in one or more programming languages such as C, C++, Python, Java, and Fortran.Experience with scripting and workflows in high-performance computing.Experience in parallel computing for shared and distributed memory architectures including experience with MPI and OpenMP.Experience with one or more of: compiler technologies, programming language implementation, and/or source-to-source translation.Good communication skills both verbal and written.Experience with measuring and characterizing the performance of parallel data intensive applications.Software development practices and techniques for computational and data-intensive science problems.Bachelor's and 5+ years; Master's and 3+ years; Doctorate and 0 years, or equivalent.Desirable knowledge and skills:Experience with BigData stack, including Apache Spark, and data analytics.Good experience and skills in interdisciplinary research involving computer scientists and discipline scientists.Experience with parallel I/O such as MPI-I/O.Good ability to provide project leadership.Collaborative skills including the ability to work well with other laboratories and universities, supercomputer centers, and industry. As an equal employment opportunity and affirmative action employer, Argonne National Laboratory is committed to a diverse and inclusive workplace that fosters collaborative scientific discovery and innovation. In support of this commitment, Argonne encourages minorities, women, veterans and individuals with disabilities to apply for employment. Argonne considers all qualified applicants for employment without regard to age, ancestry, citizenship status, color, disability, gender, gender identity, genetic information, marital status, national origin, pregnancy, race, religion, sexual orientation, veteran status or any other characteristic protected by law.SDL2017"}