{"jobID": "2745860969", "jobLocation": "Chevy_Chase_MD", "jobTitle": "Senior Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.geico.jobs", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1936", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": "Ready to make an impact? If so read on!As a Senior Data Scientist, you will harness the power of Big Data through predictive analytics and innovative machine learning models. We are seeking a Data Scientist to support systems and business optimization through detailed analysis of GEICO's data. The Data Scientist team drives strategic business initiatives by researching, analyzing and interpreting data; developing algorithms to evaluate customer behavior and identify areas of opportunity; presenting analysis and recommendations; and participating with business units and IT to deliver innovative, actionable business models. The Data Scientist will be responsible for assisting in the definition of data mining and machine learning strategies and the execution of corresponding procedures. Would you like to join this innovative team? if so, do you meet these qualifications?Candidate Qualifications: A minimum of 3 years of experience in data mining, machine learning and distributed computing is required Bachelors degree in Statistics, Data Science, Computer Science or Mathematics preferredFamiliarity with Hadoop, Pig, Hive and MapReduce is requiredKnowledge with Python, Perl or other scripting language is a mustDemonstrated proficiency with statistical computing languages such as R, MATLAB, etcExperience with integrating large-scale heterogeneous datasets is requireKnowledge with statistical research techniques, including modeling, data mining, clustering and segmentationExcellent interpersonal skills and ability to communicate effectively with third parties and internal staff at all levels of the organizationStrong analytical and problem solving skillsExcellent organization and time management skillsAbout GEICOFor more than 75 years, GEICO has stood out from the rest of the insurance industry! We are one of the nation's largest and fastest-growing auto insurers thanks to our low rates, outstanding service and clever marketing. We're an industry leader employing thousands of dedicated and hard-working associates. As a wholly owned subsidiary of Berkshire Hathaway, we offer associates training and career advancement in a financially stable and rewarding workplace.Our associates' quality of life is important to us. Full-time GEICO associates are offered a comprehensive Total Rewards Program*, including:401(k) and profit-sharing plansMedical, dental, vision and life insurancePaid vacation, holidays and leave programsTuition reimbursement Associate assistance program Flexible spending accounts Business casual dressFitness and dining facilities (at most locations)Associate clubs and sports teamsVolunteer opportunities GEICO Federal Credit Union * Benefit offerings for positions other than full-time may vary. GEICO is an equal opportunity employer. GEICO conducts drug screens and background checks on applicants who accept employment offers.How to ApplyClick \"Apply for Job\" to complete your application. You will need an active email address and phone number. Please upload your resume, preferably as Word .doc files or PDF. Once you begin your application you can save it and access it later. Your application should include any work and/or internship experience from at least the past five years."}