{"jobID": "2829256749", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst - Insights & Analytics - Minute Maid Park", "companyRating": "3.0", "companyInfo": {"Website": "www.aramark.jobs", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1959", "Type": " Company - Public (ARMK) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sodexo, Cintas, Compass Group"}, "estimatedSalary": "42000", "jobDescription": "*Overview:** Aramark (NYSE: ARMK) proudly serves Fortune 500 companies, world champion sports teams, state-of-the-art healthcare providers, the world?s leading educational institutions, iconic destinations and cultural attractions, and numerous municipalities in 19 countries around the world. Our 270,000 team members deliver experiences that enrich and nourish millions of lives every day through innovative services in food, facilities management and uniforms. We operate our business with social responsibility, focusing on initiatives that support our diverse workforce, advance consumer health and wellness, protect our environment, and strengthen our communities. Aramark is recognized as one of the World?s Most Admired Companies by FORTUNE, as well as an employer of choice by the Human Rights Campaign and DiversityInc. Learn more at www.aramark.com at http://www.aramark.com/ or connect with us on Facebook at https://www.facebook.com/Aramark/ and Twitter at http://www.twitter.com/aramark . *Description:***Essential Functions:** + Leverage internal and external data to further evolve Aramark?s category management / retail approach and help develop strategies to further engage the consumer  + Leverage consumer analytics to analyze and look for patterns within customer behavior and/or business performance data, summarize findings and recommend actions.  + Lead the creation and development of key performance reporting throughout Minute Maid Park?s different channels  + Manage and enhance programs to measure customer satisfaction and loyalty and measure the delivery of the customer experience, leveraging traditional and new methods and technologies.  + Identify opportunities for consumer demand creation and collaborate with the business to test/pilot concepts and broadly deploy them. Develop plans on how best to implement test/pilot programs and solutions to scale.  + Support the design and development of analytical platforms designed to understand key business levers to drive consumer engagement, satisfaction and loyalty to create demand and accelerate revenue growth.  + Identify and generate ad-hoc analysis to drive short-term strategies. Partner with cross-functional resources to define analytics and insights requirements and measure outcomes.  + Recommend key enablers including business process, organizational and technology.  + Perform other related tasks, projects and ad hoc analyses as assigned.  + Bachelor?s degree required in Mathematics, Statistics, Accounting or Finance or another scientific discipline. Course work towards an MBA degree preferred.  + Minimum of 3-5 years experience in an analytical function preferred.  + Superior analytical ability and spreadsheet modeling skills are required.  + Excellent written and verbal skills and the ability to interface with multiple levels of management are essential.  + Strong organizational, project management and time management skills  + Ability to effectively communicate findings, analysis, implications, and recommendations to varied stakeholder audiences  + Must be able to problem solve and adjust priorities with little advance notice to meet deadlines and requests.  + Extensive experience with the Microsoft Office package, specifically a high level of proficiency with Excel and PowerPoint  + Ability to program in SQL or related language as well as experience in developing in BI Tools (Ex. Qlikview, Tabluea) a plus  + Position requires good interpersonal and communication skills, sound judgment and ability to learn quickly; ability to adapt to new situations and interface with senior management. *Qualifications:** Aramark is an EQUAL EMPLOYMENT OPPORTUNITY/AFFIRMATIVE ACTION employer ? Minority/Female/Disability/Veteran"}