{"jobID": "2803972500", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.allclearid.com/business", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " Do you want to be a part of outstanding customer and client relations during one of the scariest events that can happen: a data breach? Come play an important part in making the world a safer place!  Working in conjunction with operations teams, data analysts, and database analysts, the Data Analyst is responsible for the handling and processing of the data files received or created during client on-boarding and servicing of the data breach responses, as well as production support, day-to-day processes supported by the Response Operations Technology (ROT) team. ESSENTIAL FUNCTIONSOwnership of the process and technology to format, cleanse, and validate the contents of mail files from clients, reporting back findings at the record levelIdentify and implement improvements to processes related to the technology involved in breach responseProvide basic production support of primary internal systemsDesign technology implementations within the data arm of the ROT teamManage and add back-end data tables to support reporting capabilitiesUtilize technology in a way that focuses on security, customer satisfaction, and data accuracyKnowledge/Skills/Abilities:Demonstrate a genuine understanding of the security risks and privacy concerns involved in the handling, processing, and exchange of confidential information within or outside of the organization.Have strong abilities to provide solutions and attention to data quality issues and be experienced with the handling of high volumes of data.Strong understanding of data normalization principles (i.e. canonical form) as it applies to identity information (names, addresses, company data, etc.)Proficient with data extraction, transform, and loading activities from or to flat files, spreadsheets, and relational databases using scripting, macros, SQL, and other ETL technologiesAble to maintain the confidentiality of highly private and sensitive information at all times.Extremely detail-oriented while working on multiple concurrent projects.Able to adapt to an ever-changing, fast-paced work environment.Excellent verbal and written communication skills.Ability to keep calm under pressure with high emotional intelligence.Be able to communicate complex technical information and activities to non-technical personnel.Schedule flexibility to allow for high-volume periods. Compensatory time off will be allocated following these periods.Education/Experience:3+ years of experience working as a data analyst, data engineer, database developer, or DBABachelor’s degree in computer science or equivalent experienceExpert with SQLFamiliar with Oracle database, PL/SQL artifacts.Experience in interfacing with Linux through shell/terminalExperience in a role managing data migrations or data cleansing strongly preferredPrior experience with Informatica Cloud preferredExperience with data cleansing or data quality tools a plusJoin us at AllClear ID and enjoy the following benefits:Comprehensive Medical Benefits, Life & Disability Insurance, Flex-Spending & Health Savings Plans401(k) Investment PlanStock OptionsCommuter Benefits (heavily discounted parking, free transit passes)Gym MembershipPaid Time OffVarious Bonus ProgramsFree ID Theft and Credit MonitoringOur Values:Integrity is paramount.Customer service above and beyond the expected.Have fun together as a company.We operate as one. We inspire one another to win.We take pride and ownership in all that we do.This position is not eligible for relocation assistance or visa sponsorship.AllClear ID is an Equal Opportunity Employer. Applicants will receive consideration for employment without regard to age, race, color, religion, gender, sexual orientation, disability, gender identity, national origin, or protected veteran status."}