{"jobID": "2741986663", "jobLocation": "Dallas_TX", "jobTitle": "Data Science Manager", "companyRating": null, "companyInfo": {"Website": "www.bain.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " McKinsey & Company, Boston Consulting Group, Booz & Company"}, "estimatedSalary": null, "jobDescription": " Overview  Bain & Company is one of the world's leading global business consulting firms, serving clients across six continents. It was founded in 1973 on the principle that consultants must measure their success in terms of their clients' financial results. Bain's clients have outperformed the stock market 4 to 1. With offices in all major cities, Bain has worked with over 4,150 major multinational and other corporations from every economic sector, in every region of the world.  A career at Bain & Company will provide the opportunity to learn in a collaborative teaming environment, drive impact to support our 'Results' mission statement. The firm has a passionate and rich culture that offers an unparalleled business experience that can carry throughout a career. We hire dynamic individuals that are dedicated to achieving both personal and professional goals. To learn more about the firm, please visit www.bain.com. Position SummaryThis is an opportunity to be a key leader in Bain's expanding data science capability area. This position will be part of the Advanced Analytics Group (Bain's team of data science, engineering, marketing science, operations research and primary research experts).Responsibilities will include working closely with the Advanced Analytics Group (AAG), Bain Partners, Bain Practice Areas, and the Technology Services Group (TSG) to extend and innovate our data and analytics capabilities.This will include helping formulate and driving our evolving strategy on how to best support our clients on large data/heavily analytic initiatives.Serve as Advanced Analytics expert on Advanced Analytics strategy casesBe an expert advisor in proposal discussionsDemonstrate fluent understanding of major ERP, CRM, Data warehousing, Relational and Non-Relational Database systems; and have familiarity with new applications and technology in unstructured data storage and query solutions.The person in this role will need to:Communicate effectively with analytics/data experts as well as business managers to assess opportunities and develop data driven solutions for Bain clients across a variety of sectors;Translate business objectives into data and analytics solutions and, translate results into business insights using appropriate data engineering, analytics, visualization & dashboard applications;Help develop Advanced Analytics Intellectual Property and identify areas of new opportunity for data science and analytics for Bain and its clientsCommunicate with and educate both senior and junior colleagues to further embed data science and analytics across the firm and within our clients;Advise Bain clients and consulting teams on data strategy, analytics strategy, and data science best practicesManage 1-3 Data ScientistsThis position will be located in Boston, Atlanta, Washington D.C., Chicago, or DallasResponsibilitiesWork with consulting teams to understand business problems, translate them into data science projects and appropriately prioritize and execute.Help to increase consulting staff's knowledge of Advanced Analytics and Data Science.Develop and/or implement tools for data acquisition, extraction, transformation, management, and manipulation of large and complex data sets.Explore, model, mine, and experiment with data to answer critical business issues.Support and train consulting teams in use of data and visualization tools to generate and communicate insights.Train relevant AAG team members to support big data/data science initiatives.Develop relationships with external data and analytics vendors and interact with as needed.Provide training, documentation and other assistance to Bain's consulting staff to support and expand the use of data science analytics.Keep abreast of new and current data science techniques and technologies.QualificationsAdvanced degree in a quantitative discipline such as Computer Science, Statistics, Mathematics, Engineering, Computer Science, Econometrics or Information Sciences such as business analytics or informatics.6+ years' experience in data mining, predictive modeling, machine learning, statistical modeling, large scale data acquisition, transformation, and cleaning, both structured and unstructured data.Track record of leading and collaborating on strategic initiatives.Strong team and business communication skills ? can walk through approach with technical clients or explain tricky concepts to non-technical peopleAbility to collaborate with people at all levels and with multi-office/region teams.Must thrive in a fast paced environment and be able to work independently.Travel requiredStrategic consulting experience a plus.Proficiency in R or Python requiredSolid SQL skills and experience in relational databases/data warehouses is desiredExperience with dashboards, business intelligence tools, and visualization solutions (e.g., Tableau, Qlik, Shiny) is desiredNoSQL database experience is a plusProficiency in any of SPSS, SAS, or Spark is a plusExperience in machine learning frameworks and tools (e.g. scikit-learn, mlr, caret, H2O, TensorFlow, MXNet, PyTorch, Caffe/Caffe2, CNTK, MLlib) is a plusExperience with cloud platforms a plus.Experience with Primary Market Research and Operations Research a plus.SDL2017"}