{"jobID": "2835651842", "jobLocation": "Santa_Clara_CA", "jobTitle": "Operations Research Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Operations Research Data Scientist Job Number: 113751174Santa Clara Valley, California, United StatesPosted: May. 17, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  Are you passionate about applying your quantitative skills in a dynamic tech environment? If so, then this is the job for you. The Worldwide Sales and Operations Advanced Analytics team is looking for a top research scientist in optimization and stochastic systems to design and craft advanced analytics models for strategic and tactical decision-making as well as drive the development of our future supply-chain infrastructure and planning processes.The individual will be part of a small team of experts responsible for the optimization of our current supply chain and crafting future networks. You will be instrumental in working closely with business stakeholders, research colleagues, finance and IT groups in incorporating the essential tradeoffs within the models and take an active role in effectively communicating the recommendations to senior management.Key Qualifications You will have a proven history of driving critical research and development and developing in-depth analytical understanding of systems.• PhD in Computer Science, Statistics, Applied Math, Operations Research or a related field.• 5-10 years hands-on experience in optimization modeling, simulation and analysis.• Sound communication skills - adept at messaging domain and technical content, at a level appropriate for the audience.• Experienced at understanding key performance levers and metrics to highlight operational issues and drive improvement.• Innate curiosity and bias to action with expert ability to identify, define and execute project plans and develop modeling approaches suitable for the problem• Phenomenal teammate - invested in the collective success of the team and project outcomes• Self-sufficient with an ability to thrive in an environment of autonomy amidst ambiguity• Working knowledge of optimization tools (Gurobi, Cplex, or Xpress)• Working knowledge of predictive modeling and ML tools (scikit, R)• Experience with data acquisition tools (e.g. SQL, Apache Spark etc.), large datasets (Hadoop) and data mining• Experience prototyping and developing software in programming languages (Java/ C++/Python/Perl). Description• Knowledge of stochastic systems analysis Familiarity with machine learning concepts5+ years plus hands-on experience in optimization modeling, simulation and analysis.Strong critical thinking and problem solving ability.Programming skills with at least one object oriented language (e.g. Java) and one scripting language (e.g Python).Experience in using statistical analysis software packages (e.g. R)Strong communication and presentation skills.EducationDegree in Computer Science, Statistics, Applied Math, Operations Research or a related field.Additional RequirementsKnowledge of stochastic systems analysis  Familiarity with machine learning concepts  4 years plus hands-on experience in optimization modeling, simulation and analysis.  Strong critical thinking and problem solving ability.  Programming skills with at least one object oriented language (e.g. Java) and one scripting language (e.g Python).  Experience in using statistical analysis software packages (e.g. R)  Strong communication and presentation skills."}