{"jobID": "2802232786", "jobLocation": "Union_Beach_NJ", "jobTitle": "Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.iff.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 1889", "Type": " Company - Public (IFF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Givaudan, Firmenich, Symrise"}, "estimatedSalary": "63000", "jobDescription": " Tracking Code  5212-292  Job DescriptionWe are IFF. We are the catalyst for discoveries that spark the senses and transform the everyday. International Flavors & Fragrances Inc. is a leading innovator of sensorial experiences that move the world. At the heart of our company, we are fueled by a sense of discovery, constantly asking “what if?” That passion for exploration drives us to co-create unique scents and tastes in fine fragrances and beauty, detergents and household goods, as well as beloved foods and beverages.  Our 7,300 team members globally take advantage of leading consumer insights, research and development, creative expertise, and customer intimacy to develop differentiated products.  Dreamers and doers, we work tirelessly to discover flavors and fragrances that inspire customers and delight consumers. We are fueled by our four corporate values of passion, creativity, expertise and empowerment. It is the unique blend of these values that make us IFF. These qualities can be seen and felt throughout our amazing 129 year history and will continue to guide us as we explore our limitless possibilities and develop new-to-world solutions that enhance the lives of millions around the globe.  Please view our careers video at IFF Career Video- Great things are happening here  The History of IFF: The History of IFF  Follow us on social media: LinkedIn Facebook  The Research Scientist will be a part of the Process Engineering group at R&D; and will play a key role in the discovery, development and optimization of new flavor/fragrance delivery technologies. The successful candidate will participate in the development and use of technologies that provide IFF with new opportunities for profitable growth.  This role will focus primarily on research activities related to prototyping/testing new delivery systems under direction of senior technical staff. The work involves programming and operating robotic prototyping equipment to develop screening methodologies and support sample preparation for downstream evaluation, data analysis and interpretation. Experience with laboratory programming (e.g., LabVIEW, Simulink) and working with electronic components, sensors and control systems is a plus. The successful candidate will work closely with other scientists and engineers in an interdisciplinary, matrixed environment. Technical creativity and the ability to coordinate assigned project activities are expected. ***CANDIDATES MUST HAVE SOME ACADEMIC OR WORK EXPERIENCE WITH LABORATORY ROBOTIC SYSTEMS AND KNOWLEDGE OF THE PROGRAMMING SOFTWARE TO BE CONSIDERED *** This position is for a process engineer with emerging skills in small-scale chemical processing. It will require development of an in-depth understanding of the processes, software, hardware, and materials needed for product/process research in the delivery systems area. Develop technical approaches and project plans 20%Conduct laboratory experiments on robotic platforms 50%Analyze data, accurately document experiments, and propose next steps 20%Act as functional representative on project team/manage project areas 10% Required SkillsCANDIDATES MUST HAVE SOME ACADEMIC OR WORK EXPERIENCE WITH LABORATORY ROBOTIC SYSTEMS AND KNOWLEDGE OF THE PROGRAMMING SOFTWARE TO BE CONSIDERED.  MS degree in Biomedical or Chemical Engineering with 0-3 years of experience, or  BS degree in biomedical or Chemical Engineering with 3-5 years appropriate R&D; experience.  Ability to function independently within a broadly defined technical area.  Demonstrated ability to coordinate small projectsJob Location  Union Beach, New Jersey, United States  Position Type  Full-Time/Regular"}