{"jobID": "2377718339", "jobLocation": "Plainsboro_NJ", "jobTitle": "Data Analyst - III", "companyRating": "3.8", "companyInfo": {"Website": "www.compunnel.com", "Headquarters": "Plainsboro, NJ", "Size": "1001 to 5000 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Data Analyst - III Posting ID: KURDC13206 Location: Hillsboro, Category: Data Analyst Job Type: Consulting Rate: DOE Posting Date: 04/05/2017 Start Date: 04/10/2017 Duration: 3 Month(s)  Job Description Need US Citizen or GC Description:Enterprise customers have never had more options for consuming leading edge technology services to drive their business and answer complex problems. In our highly diverse ecosystem, with a broad range of stakeholders and an ever evolving landscape, how customers are deploying and consuming technology services to drive their business quickly becomes blurred. We are often left to run our business based on historical trends that are informed by tribal knowledge and associated educated judgments. Which means we are seeking creative data scientists with an appetite to answer questions that have evaded our industry; and then identifying what the next questions should be. In the immediate term this role will be focused on preparing novel and complex data sets for both one off and operational ingestion to our growing data lake. As we evolve our increasingly complex queries, we will certainly shine a light on the next data set(s) that we need. We’re just getting started…Requirements: Technical -Expertise designing, implementing, and optimizing data ingest ETL within a big data architecture -Experience with SQL and Hadoop -Experience with Git or other version control tool -Some experience with a data science oriented computer language like R, Python or Julia (advanced skills for efficiency) -Advanced Excel skills including functions like vlookup and macro developmentBusiness Acumen -Some experience in large corporations including teamwork, independent workflow management, presentation skills -Some level of technical/product acumen including “what is a server”, what are the components of a server -Some experience in a role with transaction processing responsibility: this is because the data cleansing will mostly be transaction record or aggregated transaction data of some kind. Knowing something about how any business transaction is processed from start to end is helpful in making independent decisions about the data – not specific Intel transactions – but any.Preferred Skills -Experience with Tableau or other visualization softwareYears of experience required for this position: 5-7 years relevant experience in related field.Four year College Degree - relevant field required  About Compunnel Software Group Inc.  Compunnel Software Group was founded in 1989 with head office in New Jersey and soon expanded its global presence to serve clients worldwide. Compunnel SoftwareGroup is preferred partner of several clients to provide cost-effective and a timely solutions.  We have been recognized as one of the 50 fastest growing privately held companiesin the US by the Inc 500 magazine. Compunnel Software Group is ISO 9001:2008 certifiedand is one of Microsoft's gold partners. Compunnel Software Group provides a rare blend of business model, technology, and consulting expertise to offer customizedand comprehensive solutions to complement client’s business and technical objectives.  Compunnel is a high energy, technology driven global software employer with people-centeredvalues fostering continuous learning. We are a rapidly growing company. To supportour expansion plans and achieve our growth objectives we are always seeking highly talented information technology professionals.  Choosing Compunnel Software Group as your employer could be a deciding factor for your career graph.  Contact Information Tarun jaiswalCompunnel Software Group, Inc. 103 Morgan Lane, Suite 102, Plainsboro, NJ- 08536T: (609) 606-9010, Extn: 1341T: (800) 696-8128F: (609) 228-4161E: tjaiswal@compunnel.comW: www.compunnel.com"}