{"jobID": "2802188401", "jobLocation": "San_Francisco_CA", "jobTitle": "Salesforce Marketing Cloud Platform Architect", "companyRating": null, "companyInfo": {"Website": "www.appirio.com", "Headquarters": "Indianapolis, IN", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Accenture, Deloitte, Cloud Sherpas"}, "estimatedSalary": null, "jobDescription": "About Us Appirio, a Wipro Company helps customers create next-generation Worker and Customer Experiences using the latest cloud technologies. Our free-thinking consultants deliver unmatched customer value by creating actionable strategies, delivering results quickly, and helping organizations adapt to a new experience-driven era. We do this by harnessing the power of one of the world’s largest crowdsourcing communities and thousands of pre-built solution accelerators. Appirio is a trusted partner to some of the world’s largest brands, including YP, Cardinal Health, Coca-Cola, eBay, Facebook, Home Depot, Sony PlayStation, Moen, and IBM. Brief Summary of Role People have a habit of referring to you as “the Marketing Cloud guru.” You know your AmpScript from your Data Extensions and your Sender Authentication Packages from your Automation Studio. You’re comfortable not just talking solutions, but implementing them. You’re at your best when you’re answering tough questions about the product and then putting your answers into action--both on your own and with the support of other resources. You’re good at integrating the platform with other technologies, and data is your second language. Your skill with Salesforce Marketing Cloud is exceeded only by your passion for the product. Responsibilities Work with senior leadership of the Marketing Cloud Practice, Marketing/Business Architects and other consulting team members to design and implement Salesforce Marketing Cloud technical solutions. Lead teams of resources, both onshore and offshore, in executing tactics that lead to the successful launch of sophisticated, integrated Marketing Cloud solutions. Serve as a “platform expert” on all aspects of the Marketing Cloud for clients and internal resources alike. Specific areas of responsibility include:SalesWorking with Marketing Cloud and Sales resources to design client solutions and scope the time and effort required to implement themConduct research and network with other experts to determine the best approach for new and untested solutions for unique client needsWork with project managers to provide flexible approaches for non-standard client needsAssisting in the development of new solution offerings as neededSolution DeliveryRefining solutions designed in the Sales Process to meet learnings gained in project kickoffWorking in conjunction with other Appirio consultants to implement highly-complex, data driven integrationsCapture learning from ongoing solution delivery to refine processes and work effort associated with achieving client successCoaching and MentoringOnboarding new consultants with technical training as requiredAnswer questions from other Appirio consultants re: platform features, capabilities, implementation, etc.Developing and refining implementation best practicesExperience & RequirementsBachelor’s Degree in a business- or technology-related field, or equivalent combination of education and experience is required5+ years Marketing Cloud or related Saas implementation experience is requiredSalesforce Marketing Cloud certifications highly desirableSalesforce CRM/Sales and Service Cloud experience highly desirablePredictive Intelligence experience highly desirableSocial Studio experience highly desirableProven consulting and/or client implementation experience is requiredExperience with Agile development, User Story development highly desirableAbility to review work products and provide meaningful coaching highly desirableProven written and verbal communication skillsAbility to work independently from a home office with a remote team, think creatively, manage your own time, and take the initiative to drive client successAble to travel up to 40% *NOT ELIGIBLE FOR VISA SPONSORSHIP We are an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply."}