{"jobID": "2759334797", "jobLocation": "Madison_Heights_MI", "jobTitle": "Outside Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.abcsupply.com", "Headquarters": "Beloit, WI", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Allied Building Products, Beacon Roofing, SRS Distribution"}, "estimatedSalary": null, "jobDescription": " ABC Supply, the nation’s largest distributor of exterior building products, is seeking a motivated sales professional to join its team. ABC Supply has been the recipient of the Gallup Great Workplace Award for 12 consecutive years and is proud to be an employee-first company. Outside Sales Representatives at ABC Supply have exclusive sales tools to enhance their success in business-to-business selling and have high earning potential.  In this role, you will sell residential and commercial exterior building supplies to contractor customers. You will collaborate with your Branch Manager on ways to strategically build new relationships with prospective customers in the industry. In addition, you will provide your customers with superior service as you assist them with a full range of products and services to meet their contracting needs. Specific duties may include:Cultivating and managing customer relationshipsUtilizing sales reports and other data to recognize sales opportunities in customer buying patternsMaking cold calls to prospective customersFollowing sales leads and scheduling appointments with prospective customersFollowing up with customers and providing solutions, should a service concern ariseProviding training to customers and their teams on various product lines and servicesAssisting customers in the credit application processConnecting with customers to ensure that past due bills are paid and collect payments when necessarySpecific qualifications include:College degree (Business, Sales or other related field) or equivalent combination of education and experienceSpecific industry knowledge, including both familiarity with product lines and the overall building contractor process, is preferred but not requiredValid driver’s license, clean driving record, and own reliable vehicleExceptional communication and interpersonal skillsProfessional appearance and demeanorSuperior time-management and organization skills ABC Supply values hard work and dedication and rewards its associates with an excellent compensation package. In addition to a competitive pay and commission structure, Outside Sales Representatives receive a comprehensive benefits package. Benefits may include:Health, dental, and vision coverageEmployer paid life insurance401(k) with a generous company matchFlex spendingVehicle allowanceExpense accountPaid holidays and paid time offEqual Opportunity Employer / Drug Free Workplace"}