{"jobID": "2744616063", "jobLocation": "Detroit_MI", "jobTitle": "Capacity Planning and Strategy and Analytics Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.ally.com", "Headquarters": "Detroit, MI", "Size": "5001 to 10000 employees", "Founded": " 1919", "Type": " Company - Public (ALLY) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": "Career Area: Sales Support Experience Level: Experienced Available Work Locations: Arkansas (Little Rock), Detroit (Michigan), Florida (Jacksonville), Minnesota (Shoreview), Texas (Lewisville) Ally Requisition #:18-5412 Job Description:Position Description Reporting to the Strategy and WFM Director, this position is primarily responsible for managing the creation, maintenance and validation of staffing models used to assist Ally with short and long term resource planning. This position will create and implement strategies that support our continued effort to develop resource modification solutions in all areas of the enterprise as it pertains to the utilization and productivity of our staff. Job ResponsibilitiesLead the WorkForce management team and manage capacity planning processWork closely with Executive Leaders and their Direct Reports on capacity planning models, resource modification strategiesDevelop Champion - Challenger tests to optimize operational strategiesWorks closely with Finance, forecasting and analytics teams to provide streamlined support to consumer operations leadersEvaluate/develop strategies for capacity planning, Collections, and Loss MitigationMeasurement of processes, productivity and staffing calculationsExtensive use of SAS, Excel, and formula based modelingExecutive presentations of findings to senior levels of leadershipProject management responsibilitiesTravel as requiredPerformance Standards:Demonstrates strong analytical and organizational skill setExtensive experience working with data , fluent in Microsoft Excel, Microsoft PowerPoint and Microsoft Access; SAS preferredTeam focused and results driven with ability to independently manage multiple tasks for multiple groups and work reliably in time sensitive situationsAbility to work independently and anticipate needs of leadershipAbility to identify process improvement, effectiveness and efficiency and execute on change management, influence and collaboration in a matrix environmentDemonstrates ability to work collaboratively and effectively with people at all levels of the business , and cross functionallyDemonstrates a high degree of personal accountability, passion, and executionMaintains strict confidentiality when requiredMaintains high level of attention to detail and accuracyQualificationsBA/BS required; Business, Finance, Accounting, Math or Statistics preferredTrack record of strong analytical thinking and problem solving skillsProcess Improvement/Project Management experienceRelevant experience in the Automotive or Financial Services FieldStrong understanding of workforce management principles and budgetary experienceStrong understanding of analytical methodologiesAlly Overview Ally Financial Inc. (NYSE: ALLY) is a leading digital financial services company and a top 25 U.S. financial holding company offering financial products for consumers, businesses, automotive dealers and corporate clients. Ally's legacy dates back to 1919, and the company was redesigned in 2009 with a distinctive brand, innovative approach and relentless focus on its customers. Ally has an award-winning online bank (member FDIC), one of the largest full service auto finance operations in the country, a complementary auto-focused insurance business, a growing digital wealth management and online brokerage platform, and a trusted corporate finance business offering capital for equity sponsors and middle-market companies. Business Unit/Enterprise Function Description Ally Auto's U.S. auto finance operations provide a wide array of financial products and services to automotive dealerships and retail automotive customers in the United States. Together with Dealer Products and Services, the U.S. auto finance team has built strong dealer relationships by offering high-quality wholesale financing services, attractive volume incentives and a full array of highly competitive products like extended service contracts, dealership insurance products and more. Total Rewards Information Ally's compensation program offers market-competitive base pay and bonus pay potential based on achieving personal and company goals. Plus, we have a flexible paid time-off program with an emphasis on work-life balance.  Ally offers a variety of benefits to protect your health and well-being, provide financial security and balance your work-life needs including: Industry-leading 401K Retirement Savings Plan including Matching and Company ContributionsComprehensive wellness program with financial incentives designed to help you achieve your best healthFlexible health insurance options including dental and visionPre-tax Health Savings Account with generous employer contributionsPre-tax dependent care and commuter benefitsOther work-life integration benefits including Paid Parental & Caregiver Leave, Adoption Assistance, Back-up Child & Adult/Elder Care, Child Care Discounts, Tuition Reimbursement, LifeMatters Employee Assistance Program, Weight Watchers and other employee discount programsAlly is an Equal Opportunity Employer We extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition or any other reason protected by law."}