{"jobID": "2825158475", "jobLocation": "Milpitas_CA", "jobTitle": "Staff Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.kohlscorporation.com", "Headquarters": "Menomonee Falls, WI", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (KSS) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " J. C. Penney, Target, Macy's"}, "estimatedSalary": "249000", "jobDescription": " Data Science/Senior Data Scientist You will work with large volumes of data to develop new algorithms and models both to improve existing products and to help create new ones while working on cutting edge systems and algorithms. We are looking for bright self-starter individuals who are driven to solve real world data problems, both big-data and small, using whatever tools are widely available in data science. You will scour through peer-reviewed research to justify the approaches and communicate the benefits to stakeholders. You recognize that data cleaning is an integral step in data science and can tease insights from real world scenarios by prototyping solutions quickly. At Kohls you will develop solutions that have large real-world impact on the business and along the way become a leader in the space. Requirements Required qualifications include: •Ph.D in Statistics, Computer Science, or equivalent •Must be VERY strong in statistics or algorithms •For senior level roles, the ability to work independently on a project or lead a small group of less experienced data scientists towards delivery of project goals •At least 3 years experience building predictive analytics or machine learning algorithms. Preferably starting from raw data and performing cleaning, feature extraction, peer review research, and final delivery. •Strong working knowledge of several of the following data mining techniques: regression analysis, clustering, decision trees ensembles(gradient boosted trees, random forests, bagged trees), neural networks, SVMs (support vector machines), Matrix factorization, or any other common related machine learning/statistical techniques. •Extremely proficient in at least one of the following: R, python, Spark/Scala, Hadoop/Java •Ability to communicate business value of analysis to stakeholders •Ability to identify datasets that may have business value and formulate a proof of concept analysis to prove that value Additional nice to haves: •Experience developing on big data platforms (ex. Map-Reduce ,spark) •Experience working on mission critical real-time applications like recommendation engines •Understanding of object oriented design •The candidate should have good written and verbal communication skills and should be able to lead an individual project. ACCOUNTABILITIES INTERPRETS AND APPLIES DATA ANALYTICS TO TRANSLATE BUSINESS INTO ACTIONABLE ITEMS Lead and recommend business decision making for multiple business functionsImplements activities that may impact multiple components/processes and the work of other business units/teams/projectsAssigned to strategic initiatives across one or more business unitsLeads in the execution of statistical and mathematical solutions to business problems within business unitLeads team in determining intended approach and quantitative methods to develop solutionOversees design experiments to answer targeted questionsDevelops materials to explain project findings to LeadershipDefines and delegates development tasks among teamGuides and recommends to team members and partnersProvides guidance regarding analytical approach and iteration of algorithmsResearches new ways for modeling and predicting end-user behavior and makes recommendations for adoptionQUALIFICATIONS REQUIRED 5+ years of progressively complex Data Science or analytics experienceBachelor's Degree or equivalent in MIS, Computer Science, Data Science or related field PREFERRED Masters degree and/or Ph.D.Retail experience"}