{"jobID": "2787965302", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Advanced MATLAB/Simulink Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.gogtech.com", "Headquarters": "Dearborn, MI", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Contract", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Strategic Staffing Solutions, Aerotek, KellyMitchell Group"}, "estimatedSalary": null, "jobDescription": "This role requires knowledge and experience in creating models in MATLAB/Simulink- not using MATLAB/Simulink but creating the models to be used.The ideal candidate will have experience inModel Based Engineering in Matlab /Simulink.This is not embedded software engineering- but Model Based Engineering demonstrated experience is needed, ideally in high voltage automotive systems.Work within a team of Powertrain controls, calibrations and integration engineers to develop electrified powertrain charging systems for current and next-generation electrified powertrainsSupport High Voltage (HV) controls including AC and DC charging, HV management, 12V management and innovation projects related to HV charging.Partner with the requirements teams to understand the standards related to DC charging Develop the algorithms and controls in Simulink.Required Engineering Experience & Skills5+ years of experience in controls, calibration, validation Powertrain and/or ePT engineering2+ years of dedicated, professional experience in model based development in Matlab/SimulinkDemonstrated knowledge of vehicle and powertrain functionsStrong problem solving, interpersonal, technical problem solving and communication skillsMust be strong team player willing to work in fast –paced environment actively supporting multiple projectsEngineering Education RequiredBachelors of Science in Applied Physics, Mechanical, Electrical, Aerospace, Industrial, or Computer EngineeringPreferredEngineering Experience & Skills8+ years of experience in controls, calibration, validation Powertrain and/or ePT engineeringExperience with Electrified Powertrain Controls and High VoltageExperience with Embedded SoftwareExperience with data acquisition and analysis tools such as ETAS-INCA and CANalyzerSpecialization in classical and modern control disciplines with vehicle applicationKnowledge of powertrain control system architecture/best practicesEngineering Education PreferredMasters in Mechanical, Electrical, or Aerospace, Engineering G-TECH Services, Inc. is a leading certified recruitment and placement firm that specializes in providing highly skilled staff in technical fields such as engineering, IT, procurement, finance and accounting. We have well-established relationships with some of the most respected companies in the country and know our clients’ job requirements and corporate cultures. Once we understand your experience and career aspirations, we aim to connect you with the right opportunity.  At G-TECH, we embrace a personalized approach to professional staffing, recognizing the important link between employee and employer satisfaction. We work tirelessly to connect qualified job seekers with positions that align with their career goals, skillsets and personalities. Upon placement, we support our employees throughout the duration of their assignments, providing them with a direct point of contact who serves as a dedicated advocate and sounding board. As our employees can attest, this approach is consistently effective in bettering the contract employment experience.  At G-TECH, our mission is simple: we are dedicated to connecting great people with great places to work."}