{"jobID": "2827756878", "jobLocation": "Princeton_NJ", "jobTitle": "Project Scientist I", "companyRating": "3.8", "companyInfo": {"Website": "www.ucar.edu", "Headquarters": "Boulder, CO", "Size": "1001 to 5000 employees", "Founded": " 1951", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " Project Scientist I  This is a full-time position. This position will be posted until 4 pm on July 6, 2018 or until a sufficient number of applications have been received. Thereafter, applications will be reviewed on an as-needed basis.  Relocation assistance is available for this position.  U.S. Citizenship, Permanent Residency, or other protected status under 8 U.S.C. 1324b(a)(3) is required for this position. UCAR/NCAR will not sponsor a work visa (e.g., J-1, H1-B, etc.) for this position.  Where You Will Work  The Cooperative Programs for the Advancement of Earth System Science (CPAESS) develops customizable solutions to complex scientific challenges by fostering scientific leadership and workforce, building community collaborations, and facilitating the advancement of research for the benefit of society. CPAESS facilitates and manages scientific research and research-to-operations appointments for early career and expert scientists at US institutions, federal laboratories and program offices. CPAESS collaborates with the community to provide an array of scientific opportunities that promote lifelong professional and workforce development and that fosters a new generation of leaders within the scientific community.  What You Will Do  The Project Scientist will work within the Seasonal to Decadal Variability and Predictability Division of the Geophysical Fluid Dynamics Laboratory (GFDL), and will participate in both experimental seasonal prediction, conducted on a routine monthly basis, and in fundamental research on seasonal to decadal climate variability and predictability.  In the second part of the position the incumbent will conduct fundamental research on climate variability and predictability on seasonal to decadal scales. This will include topics such as the limits and mechanisms of predictability, and the impact of tropical Pacific variability, including ENSO, on regional climates around the world. While the incumbent will work under the general guidance of the Division Leader, the incumbent is expected to work in a largely independent fashion.  This position will be located at the NOAA Geophysical Fluid Dynamics Laboratory (GFDL) in Princeton, NJ.  Research on climate variability and impacts on seasonal to decadal timescales: The incumbent will conduct analyses of experimental seasonal predictions produced at GFDL and assess the underlying physical factors that lead to the predicted climate conditions.The incumbent may design and execute climate model simulations, as appropriate, to better understand the sources and mechanisms of predictability and associated impacts.The incumbent will analyze broader aspects of the GFDL experimental seasonal prediction system, including general topics in tropical climate and hydroclimate, to better document and understand what aspects of the climate system are predictable, and to contribute findings that feed back onto improving the prediction system.The incumbent will present results at both internal and external meetings, and through written publications in both internal documents and peer reviewed journals. Conducting and analyzing experimental seasonal and multi-seasonal predictions: The incumbent will be responsible, as part of a team, for the timely execution each month of experimental seasonal to multi-seasonal predictions using the GFDL seasonal to decadal prediction system. This will involve coordinating with other staff members on acquiring the necessary data to initialize the prediction system, running the assimilation system to produce initial conditions, running the prediction model, post-processing the model output, assessing the scientific integrity of the prediction output, and communicating the prediction results to external customers. The incumbent will also contribute to developing new prediction systems. What You Need PhD in meteorology, oceanography, or a closely related field or other relevant science, or an equivalent combination of education and experience.The incumbent should be an expert in the field of tropical storm and hurricane predictability, variability and change. This expertise should be demonstrated by an outstanding record of publications in the peer-reviewed literature.The incumbent will need expertise in advanced statistical methods for the analysis of large and complex climate data sets.The incumbent should be experienced in working with modern supercomputers and data analysis systems, along with experience in a variety of software packages for diagnostic analyses, including python, matlab, grads, ferret, ncl, and fortran.Strong verbal and written communication skills, as demonstrated both by extensive experience in presenting work at national and international meetings, as well as a strong publication record.Desired SkillsAt least 3 years of postdoctoral experience. Other Requirements This position is subject to work location requirements for obtaining access to facilities and research systems. These requirements may include a combination of national security checks, credit checks, fingerprinting, or other security clearance requirements. The University Corporation for Atmospheric Research (UCAR) is an equal opportunity/equal access/affirmative action employer that strives to develop and maintain a diverse workforce. UCAR is committed to providing equal opportunity for all employees and applicants for employment and does not discriminate on the basis of race, age, creed, color, religion, national origin or ancestry, sex, gender, disability, veteran status, genetic information, sexual orientation, gender identity or expression, or pregnancy.  Whatever your intersection of identities, you are welcome at the University Corporation for Atmospheric Research (UCAR). We are committed to inclusivity and promoting an equitable environment that values and respects the uniqueness of all members of our organization.SDL2017"}