{"jobID": "2826562302", "jobLocation": "Los_Angeles_CA", "jobTitle": "Research Scientist I", "companyRating": "3.9", "companyInfo": {"Website": "www.cedars-sinai.org", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " UCLA Health, City of Hope"}, "estimatedSalary": "74000", "jobDescription": " sought by Cedars-Sinai Medical Center in Los Angeles, CA. Duties: Develop rigorous, innovative, and independent research themes, and create, adapt, and implement new research techniques and protocols within the Department of Surgery and Biomedical Sciences.  Lead the Genito-Urinary Informatics team and all GU research faculty on projects utilizing bioinformatics.  Provide counsel and insight on the structure of projects and analysis of data.  Conduct disease-relevant studies directed toward identifying the drivers of pathogenesis; the discovery and assessment of biomarkers with the aim of classifying disease entities, prognosis, and responses to therapeutic interventions; and the potential association of specific signal transduction and metabolic networks with disease phenotypes as an approach to identifying novel therapeutic targets.  Prepare and submit grant proposals. Work independently and in close collaboration with the Principal Investigator and research staff on various research projects.  Regularly produce scholarly publications and presentations.  Provide mentorship to Staff Research Associates and Research Fellows.  Participate in departmental meetings. Requirements: Doctorate degree (Ph.D.), or equivalent, in Biology, Bioengineering, or closely related field, plus two (2) years of biology research, analysis, or related experience, including conducting novel experiments, protocols, and procedures in the fields of biology and bioengineering; developing methods to discover and assess biomarkers to extract disease-relevant information and identify pathogenic drivers; analyzing, interpreting, and compiling omics data; utilizing network-based data integration methods to analyze and cluster scientific data; preparing grant proposals and submissions; publishing research in scientific journals; and presenting research findings at meetings and conferences. Send resume to: Laia Jones, HR Services Coordinator, 8700 Beverly Boulevard, PACT, Suite 700, Los Angeles, CA 90048 or email *******************.  Location/Region: Los Angeles, CA (US - 90048)"}