{"jobID": "2798367875", "jobLocation": "Washington_DC", "jobTitle": "Executive Producer (temporary)", "companyRating": null, "companyInfo": {"Website": "www.mcclatchy.com", "Headquarters": "Sacramento, CA", "Size": "5001 to 10000 employees", "Founded": " 1857", "Type": " Company - Public (MNI) ", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Gannett, Tribune Publishing"}, "estimatedSalary": null, "jobDescription": "Overview Do you have a passion for live storytelling? Do you have a relentless curiosity about how to engage audiences while diving deep into key issues that matter? And are you a leader, with a strong track record of directing teams to create and deliver strong editorial products? If so, we want to hear from you.  McClatchy is redefining how we engage our audiences with live events. And we want you to help lead the way.  McClatchy Events is a new team at McClatchy. As Executive Producer, you will be responsible for crafting the editorial strategy, managing and working with our newsrooms, to expand our story telling into compelling live experiences. You’ll play a large role in brand establishment, workflows and audience growth as well. You must have deep expertise in live content production and will be charged with building and leading a team of creative individuals.  This is a roll-up-your-sleeves startup environment. If you’re a motivated individual with a passion to empower creatives to bring their imagination and ideas to life, you’ll fit right in. ***This position is a temporary assignment, ending in December 2018.Responsibilities:Partner with our executive team to build McClatchy’s overall event strategyLead the journalism and content development for our live editorial eventsCreate new and leverage existing event formats within McClatchy to drive audience engagement in our core marketsDevelop innovative event concepts that can be replicated across our marketsWork collaboratively with McClatchy’s Regional Editors to identify large-scale project opportunities with our newsrooms and across teamsRecruit and develop an events team that will execute high quality experiences for speakers and attendeesRequirements: Education: College degree required.  Experience: Strong editorial background with at least 7-10 years producing compelling live journalism.  Skills Need: Experienced producer with reliable news judgement with strong leadership, project management and strategic skills. Ability to develop both a staff and moderator talent within our newsrooms is essential. Comfortable working across a geographically diverse, matrixed organization with excellent interpersonal skills is essential. Experienced with live production and developing cross-platform editorial initiatives. A vision for live audience trends and digital media important.  Personal Attributes: Creative, flexible and capable of experimenting and quickly iterating. Aptitude for thinking big, with strong managerial skills and the ability to execute. Collaborative learner who enjoys working across all facets of a news operation.  This position may be based in either Washington, DC or Sacramento, CA. Travel will be required as part of this job."}