{"jobID": "2798504416", "jobLocation": "Union_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.24seventalent.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aquent, The Creative Group, JBCStyle"}, "estimatedSalary": "101000", "jobDescription": "Client Overview: Our client is a popular specialty retailer presenting the latest must-haves for everything home in one convenient destination. With their modern, innovative, and on-trend approach, you can effortlessly transform every space into a beautiful oasis. Position Overview: In this role, you would be responsible for translating large data into actionable insights to drive improved business performance. You would also be responsible for manipulating and evaluating complex data from varying sources. Responsibilities: • Manage and build machine learning, statistical, and other mathematical models for specific business use cases Recommend algorithms to discover patterns, conduct data mining, and confirm the integrity of data used for analysis  • Oversee and drive the collection of new data sources, improve existing data sources, and present data driven analytic solutions to drive the company’s objectives  • Translate complex data into key recommendations for the operational and strategic business units and remain current of emerging technology trends  • Collaborate with cross-functional teams, enhance data creation procedures, and communicate the experiment results to necessary partners Key Qualifications: • Master's degree in statistics, applied mathematics, operations research, computer science, engineering, economics, or related field  • 5-8 years’ experience solving analytical problems using machine learning approachesKnowledge of SAS, ETL, SQL, Python, R, SAS, MatLab, SQL, Hive, Pig Java, Tableau, and Qlik-ViewStrong data processing, database programming, data analytics pattern recognition, predictive modeling, and Natural Language Processing (NLP) skills"}