{"jobID": "1708059841", "jobLocation": "Palo_Alto_CA", "jobTitle": "Machine Learning Engineer (Optimizer)", "companyRating": null, "companyInfo": {"Website": "www.applovin.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " AppLovin offers a comprehensive platform where app developers of all sizes can connect with their ideal consumers and get discovered. Founded in 2012, the company is focused on helping both indie and established developers grow with the expertise and insights they need to finance, market, and expand their businesses all in one place. App developers view AppLovin as a trusted partner, the rare company that understands what it takes to succeed in the mobile app ecosystem and has the ability to help them reach their goals. Learn more at www.applovin.com.  The Palo Alto team comprises of smart, passionate engineers and data scientists who tackle challenging problems to scale mobile advertising to billions of users daily. We use Java, C++, Redis, Scala, Spark, Aerospike, Vertica, PHP, Chef, Jenkins, Github. We're looking for a Machine Learning Engineer to join our Optimizer team! What You'll Do:Be responsible for architecting the ML models and how they're used in a production environmentGiven the opportunity to take your own ideas from hypothesis to A/B testing the solution in a live production environmentDeal with real world challenges like sparsity of test data and real time updates for model.Requirements:You love to program, solve problems and build stuffHave knowledge of C++, Java, Scala2+ years of industry experience applying Machine Learning to large scale problems.Have a minimum of a BS and/or MS in Computer SciencePerks:Free medical, dental, and vision insuranceDaily lunches and fully stocked kitchenFree public transitFree laundry service (wash/dry clean)Free gym membership401k matchingFun company parties and eventsAutonomy to make decisions in a rapidly growing companyFlexible Time Off - work hard and take time when you need it Interested? Send us your resume and let's talk!"}