{"jobID": "2827226462", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst, Community Operations", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "81000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.Community Operations' focus is on supporting our users through both direct support interactions as well as scalable solutions, and on improving the health of our products by helping people understand how to use them. Those who join our teams are very passionate about solving peoples issues, and are strong advocates for the Facebook community. We need data driven influencers who can align cross-functional partners to ensure the best possible experience for our platforms. The Process teams within CO works on improving the support experience for different Facebook products - from content like videos and photos to communities like Groups and Pages. The team focuses on ideating, testing and implementing process improvements that enable us to prevent bad experiences for the Facebook community by efficiently reviewing these products at scale and ensuring the review is accurate and achieves the best outcome for the community. If you like helping people and working at scale Community Operations is for you. Responsibilities:"}