{"jobID": "2819928764", "jobLocation": "Dallas_TX", "jobTitle": "Data Integrity Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.atmosenergy.com", "Headquarters": "Dallas, TX", "Size": "1001 to 5000 employees", "Founded": " 1906", "Type": " Company - Public (ATO) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Responsible for maintaining and auditing the integrity of enterprise-wide system data. Ensures compliance with applicable laws, regulations, policies, procedures, and standards.  THIS JOB DESCRIPTION DOES NOT ATTEMPT TO LIST ALL OF THE DUTIES THAT ARE OR MAY BE PERFORMED IN THIS POSITION.  1. Ensures the integrity of and consistency in enterprise-wide system data by acting as a liaison between workgroups. Manages enterprise-wide data cleansing and validation efforts.  2. Collects data to conduct the root cause analysis of complex issues. Identifies and recommends initiatives to increase efficiencies.  3. Tests processes and system configurations to identify areas of deficiency and determine appropriate changes to complex application configuration. Works with Business  Process/Change Management department to translate business requirements into technical specifications.  4. Demonstrates strong functional knowledge of relevant system applications with emphasis on system data in testing environments.  In addition to the duties outlined above, incumbents will specialize in either Revenue Management or Asset Integrity activities as outlined below.  Revenue Management  Supports Data Integrity Specialists.  Performs monthly validation of billing data across systems. Identifies, researches and resolves variances in order to fulfill requests related to rates, operands, and address validations.  Ensures timely, accurate and quality billing by performing tax jurisdiction and franchise contract validations and corrections. Performs troubleshooting when necessary.  Authorized to make billing adjustments to customer accounts without manager approval.  Asset Integrity  Configures and tests automated data collection systems. Represents division end-user requirements and perspectives when evaluating current and future system needs or implementing new procedures. Educational/Experience Level: Revenue Management  Bachelor's degree in Business Administration or a related field preferred and three years experience in accounting, finance, or customer billing/ collections; or equivalent.  Asset Integrity  Bachelor's degree in Business Administration or a related field preferred and three years experience in the utility industry with exposure to compliance and/or regulatory agencies; or equivalent. Problem Solving / Independent Judgment: Applies advanced skills to resolve complex problems independently. Can work with limited supervision by relying on experience and independent judgment. Can interpret procedures and policies to determine the best approach to achieve the desired outcome. Communication Skills: Requires the ability to communicate with internal and/or external customers in order to obtain and/or provide explanations and/or information. Requires excellent verbal and written communication and interpersonal skills as well as the ability to explain technical or complex concepts to individuals. Numeric Skills: Requires the ability to apply research methods, and/or advanced statistical and/or accounting methods. Computer Skills: Requires basic computer skills in order to utilize various software applications for developing documents, reports and graphics. Work Conditions: Works in an office environment. Requires occasionally performing activities including, but not limited to, bending, stooping, grasping, reaching, twisting, turning and/or lifting.  Atmos Energy is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, age, disability, or veteran status."}