{"jobID": "2838125264", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Ads Marketplace", "companyRating": "4.0", "companyInfo": {"Website": "www.twitter.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Public (TWTR) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Facebook, Google, Pinterest"}, "estimatedSalary": "149000", "jobDescription": " Data Scientist - Ads Marketplace  San Francisco, CA Who We Are: The ads marketplace team is responsible for placing each and every ad that Twitter serves. While placing those ads we decide how best to balance user experience, advertiser results, and Twitter revenue. Our team optimizes the ad delivery engine, manages demand/supply, and improves product outcomes by applying data science and machine learning skills. We routinely deliver significant improvements to our revenue, and work in a close sync with our executive staff (including our COO&CFO;) due to our direct impact on Twitter's business. What You'll Do: We're looking for a key individual contributor to drive our advertising products forward. Ads marketplace decides which ads to serve billions of times a day under a sub-second setting. You will ship new features and optimize existing products. You will perform rigorous analysis, understand our advertising products, experiment, make data-driven decisions, optimize for impact, and measure performance funnels.  Your team will empower you with the autonomy to make good product decisions and ship well-designed code. You'll own significant projects end-to-end. The small teams of talented, passionate people in which you'll work will include engineers and data scientists from across the revenue engineering organization. The ads marketplace team works on every high-priority ads project at Twitter. Who You Are: You're a data scientist with a track record of delivering results. You find satisfaction in shipping changes that deliver measurable impact in the form of immediate revenue. You apply machine learning and data science techniques when applicable, but are just as happy to implement a simple heuristic when you find it's as effective at driving impact to your product. You're looking to join a strong, high-performing team. Sample Projects:We build new ways for advertisers to buy ads on Twitter, such as paying up front for guaranteed resultsWe design incrementality studies to measure the lift in brand awareness that our advertising campaigns driveWe dive into individual products (e.g. video ads) to improve results for our most critical business prioritiesWe evaluate the impact of ads on new Twitter users, determining how to show them ads in order to maximize their long-term usage of the productWe build more intelligent delivery algorithms resulting in better ROI for our advertisersWe are responsible for measuring the results of all experiments on Twitter adsRequirements:Experience building models, engineering features, and using data intelligently to optimize product performanceExperience performing analysis on raw event data in modern distributed system engineering stacksDeep understanding of data platforms in which you've previously workedAbility to thrive in an unstructured environment, working autonomously ona strong team to find opportunity and deliver business impactGood understanding of (one or more of the following): Python or RBonus Points:Past experience in adtechPhD or MS in computer science, machine learning, or statisticsExperience in production stacks involving machine learning, AB testing, or control systemsGood understanding of (one or more of the following): Java, Scala, or C++Interesting side projects or Kaggle competition resultsEntrepreneurial mindset We are committed to an inclusive and diverse Twitter. Twitter is an equal opportunity employer. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, genetic information, marital status or any legally protected status.  San Francisco applicants: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}