{"jobID": "2831567190", "jobLocation": "Burbank_CA", "jobTitle": "Sr. Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.warnerbros.com", "Headquarters": "Burbank, CA", "Size": "5001 to 10000 employees", "Founded": " 1923", "Type": " Company - Public (TWX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " NBCUniversal"}, "estimatedSalary": "151000", "jobDescription": "Posting  Job Title Sr. Data Engineer Time Warner  Division Warner Bros. Entertainment Group WB Business Unit WB Technology Industry Film Production and Distribution Area of  Interest Technology/Information Technology Location United States - California - Burbank Requisition # 158812BR Position  Type Full Time Posting Job Description What Part Will You Play? The Data Engineer – Supply Chain, Data Intelligence manages multiple back end data platforms supporting company sales, research and other revenue driving business initiatives. The role is responsible for understanding each application’s capabilities and the underlying business process, which the application supports. This is the key, hands-on role responsible for overall physical design of this area.  The person works across multiple functional and technical groups, educates technical and non-technical stakeholders, effectively manage expectations, facilitate negotiations and help establish department priorities. They must drive project delivery within established timeframes, budget and scope while delivering business value and simultaneously planning for and managing future requirements. Passion for Data is a must. Data Integration – Design and develop new source system integrations from a variety of formats including files, database extracts and APIs.Data Pipelines – Design and develop highly scalable Data Pipelines that incorporate complex transformations and efficient code. Data will need to flow to and from unstructured and relational systems for analytic processing.Data Delivery – Design and develop solutions for delivering data that meets SLAs and is of high quality to various WB divisions for marketing and reporting as well as external vendors.Operations and Tuning - Investigate problems and resolve as required, including working with various internal teams and vendors. Proactively monitor the data flows with a focus on continued performance improvements. What do we require from you?Bachelor’s Degree in Computer Science, Engineering, Business or equivalent work experience.5 - 7 years of relevant experience: Data warehousing tools such as Teradata, Oracle, DB2, and or SQL, Informatica, Python.Minimum of 4 years of relevant ETL/ELT experience.Project lifecycle, on a global level, including business process design, documentation, testing, rollout.Managing and providing data mining and data modeling solutions.Experience with various Business Intelligence reporting tools (Business Objects, Microstrategy, Tableau) a plus.Experience with Amazon Redshift, Scala, Spark, and Hadoop a plus. Technologies We Use Teradata, Oracle, DB2, SQL, Informatica, Python  Business Objects, Tableau business intelligence reporting tools  Amazon Redshift, Scala, Spark and Hadoop But Wait, There's More! At WBT, we look for team members who want to: Be Curious: Seek out opportunities to learn, and who aren’t afraid to ask questionsOwn It: Be the driver, and take accountabilityEmbrace Change: The technology landscape is ever changing – we’re looking for people who are ready to change along with itEngage and Influence: Share your passion for technology, and develop great relationships with colleagues and collaborators#LiveTheWBLife: At WBT we look for team members who want to “Contribute to Our Community”"}