{"jobID": "2733826269", "jobLocation": "Houston_TX", "jobTitle": "Sr Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bhge.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (BHGE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: Baker Hughes, a GE company (NYSE:BHGE) is the worlds first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain. BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company deploys minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own. With operations in over 120 countries, the companys global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.  Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com.  GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Role Summary: In the role of Sr Data Scientist, you will: Essential Responsibilities:Develop analytics to address customer needs and opportunities Work alongside software developers and software engineers to translate algorithms into commercially viable products and services Work in technical teams in development, deployment, and application of applied analytics, predictive analytics, and prescriptive analytics Perform exploratory and targeted data analyses using descriptive statistics and other methods Work with data engineers on data quality assessment, data cleansing and data analytics Generate reports, annotated code, and other projects artifacts to document, archive, and communicate your work and outcomes Share and discuss findings with team members Qualifications/Requirements:Basic Requirements:Bachelors Degree in a STEM major (Science, Technology, Engineering, Mathematics) Minimum 5 years of analytics development for industrial applications in a commercial setting OR completion of a GE Leadership program Eligibility Requirements:Legal authorization to work in the U.S. is required. We will not sponsor individuals for  employment visas, now or in the future, for this job. Desired Characteristics:Masters Degree in a \"STEM\" major (Science, Technology, Engineering, Mathematics) Ph.D. in a STEM major (Science, Technology, Engineering, Mathematics Demonstrated skill in the use of one or more analytic software tools or languages (e.g., R, Python, Dataiku, SAS, SPSS,) Demonstrated skill at data cleansing, data quality assessment, and using analytics for data assessment Demonstrated skill in the use of applied analytics, descriptive statistics, feature extraction and predictive analytics on industrial datasets Demonstrated skill at data visualization and storytelling for an audience of stakeholders Demonstrated skills in use of some of the Machine Learning/AI techniques (e.g., Regularization Techniques, Boosting, Random Forests, Ensemble Methods, image/video/audio processing, time series modeling) Demonstrated awareness of data management methods Demonstrated awareness of real time analytics development and deployment Demonstrated skill in data management methods and analytic scaling Demonstrated awareness of industry and technology trends in one or more sectors where GE operates Demonstrated awareness of customer and stakeholder management and business metrics Demonstrated skill at function in a team setting Demonstrated awareness of critical thinking and problem solving methods Demonstrated awareness of presentation and influencing skills Demonstrated awareness of how to succeed in ambiguous circumstances Demonstrated awareness of how to leverage curiosity and creativity to drive business impact#DTR Locations: United States; Texas; HoustonGE will only employ those who are legally authorized to work in the United States for this opening."}