{"jobID": "2828879182", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data AnalystPosition Number: 289399Location: Austin, TXDesired Skill Set:SQL, Tableau, Data AnalysisPosition Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Job Title: Data Analyst  Start: 07/09/2018  End: 01/09/2019  Location: Austin, TX 73301 Duties: Manage the e-mail alias inquiries from internal stakeholders Manage the headcount management tool queue to approve transfers, move positions, and unblock transactions Assist Recruiting & HR with position management inquiries for job requisitions or offers Perform consistent and accurate headcount data entry into various information systems Maintain and audit data integrity of headcount positions (cost center, manager, talent profile, location, team assignments, etc.) within Workday, Salesforce, and Internal Tools Answer database questions and reconcile systems of record Track changes to budget in headcount management tool and change management log Work with team to analyze data, propose process improvement, and driving system enhancements Assist in solution testing, debugging and documentation and system issue support Skills: Proficient in Excel  Ability to gather data from multiple sources and compile it into a user-friendly format, ensuring it meets customer needs Ability to run basic SQL queries and build Tableau dashboard Experience fielding and responding to requests Experience investigating incorrect data patterns as well as addressing root cause Keywords: Education: Bachelor's degree or 3+ years problem-solving/data experience Skills and Experience: Required Skills:· AUDIT.· DATA ENTRY.· DATA INTEGRITY.· EXCEL.· PROBLEM-SOLVING.Additional Skills:· DATA ANALYST.· SQL.· TABLEAU.· CHANGE MANAGEMENT.· DATABASE.· DOCUMENTATION.· PROCESS IMPROVEMENT.· WORKDAY.Languages: · English.  · Read.  · Write.  · Speak. Minimum Degree Required: · Bachelor's Degree. Send me a reminder to complete this applicationRose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.  Rose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).  (Posting required by OCGA 13/10-91.)"}