{"jobID": "2819832283", "jobLocation": "East_Windsor_NJ", "jobTitle": "Data Analyst (Enterprise Data Warehouse)", "companyRating": null, "companyInfo": {"Website": "www.brooksource.com", "Headquarters": "Indianapolis, IN", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Data Analyst (Enterprise Data Warehouse)East Windsor NJ$60-65/hr (Dependent on Experience) As the Senior Data Analyst you will be a key member of the Global Technology Services team in a Fortune 500 Educational Publishing company to provide analytical insights for revenue generating technical projects. The Data Analyst will work with off-shore and on-shore business units to test queried data, analyze and package information based on specific requirements. You will assist leadership in completing data life-cycle reporting and analysis on data pulled from the companies on-premise data warehouse. Minimum Qualifications · 5+ years of Data Analytics or relative experience  · Experience in data testing, packaging, and analysis  · 5+ years of hands-on SQL experience  · Strong foundation in utilizing Informatica  · 3+ years Oracle ERP Responsibilities · Test ETL code that has been supplied to ensure the requirements are being met and the changes are sound  · Provide expertise among a team of data warehouse analysts who partner with business units  · Partner with offshore development team on the requirements documentation, functional design, assembly testing, and user acceptance testing of Data Warehouse enhancements/upgrades  · Utilize Informatica to source qualify data sets  · Determine underlying issues to common business problems and use appropriate influencing, negotiation, and change management techniques to implement best practice solutions What's in it for you? · Get your foot in the door at a Fortune 500 company  · Relaxed work environment near the beach!  · Ability to work with cutting edge technologies within the AWS Cloud  · Established relationship with in the client for a tightknit culture  Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws."}