{"jobID": "2812015862", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Financial Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.checkr.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Checkr’s mission is to build a fairer future by improving the understanding of the past. Since graduating Y-Combinator in 2014, Checkr’s product has shifted the on-demand economy and has continued to scale into serving enterprise companies across various industries. As a company that provides modern and compliant background checks for global enterprises and startups, Checkr knows first hand how difficult it may be for individuals with prior criminal history to find employment and we want to help provide fair chances for the formerly convicted. A career with Checkr provides the opportunity to make an impact on the professional lives of millions of people and we encourage all qualified individuals to apply for our roles.  Checkr’s Financial Planning and Analysis Team (FP&A;) is responsible for improving financial decision-making across the company. As a Sr. Financial Data Analyst you’ll help build reliable financial data pipelines, provide visibility into key financial metrics, and explore ways to use the data in ways we haven’t yet considered. ResponsibilitiesWork cross-functionally to build and ensure accuracy of Checkr’s financial data pipelineExplore data relationships and pursue potential value-add analyses and modelling that affect financial and business decisionsProvide general financial/data support to other key stakeholders within the Finance organization and across the companyWhat you bring:Proficiency in SQL with 3+ years of experience working with large data setsExpertise in data mapping, building queries, data extraction, manipulation & conversionReport design and development skills including expertise in SQL queries, Microsoft Excel and experience using data analysis tools such as LookerA drive to understand the core issues and determination to uncover the solutionExtremely detail oriented and highly organizedAbility to partner with and influence stakeholders across different departmentsWhat you get:A fast-paced and collaborative environment where we leverage the latest technologyHands-on coaching and professional developmentCompetitive compensation and opportunity for advancement – a true meritocracy100% medical, dental and vision coverageUnlimited PTO policyGym membership, transportation reimbursementsCatered lunch, dinner, and snacksEqual Employment Opportunities at CheckrCheckr is committed to hiring talented and qualified individuals with diverse backgrounds for all of its tech, non-tech, and leadership roles. Checkr believes that the gathering and celebration of unique backgrounds, qualities, and cultures enriches the workplace.Checkr also welcomes the opportunity to consider qualified applicants with prior arrest or conviction records. Checkr’s commitment to diversity extends to hiring talented individuals in spite of a prior criminal history (in accordance withSan Francisco’s Fair Chance Ordinance as well as state and/or federal laws)."}