{"jobID": "2764752737", "jobLocation": "Bethesda_MD", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.itstaffing.com", "Headquarters": "Norwell, MA", "Size": "501 to 1000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Kforce, Robert Half, TEKsystems"}, "estimatedSalary": null, "jobDescription": "Data Analyst Our client, a leading provider of strategy, technology and marketing services to a wide array of U.S. government agencies is seeming several Data Analysts to support a large healthcare project with the NIH. Job Summary: This is an entry to mid-level level position in the business consulting domain and the function of this position is to provide support in project tracking and reporting for projects in the life sciences domain. The expectation is to provide comprehensive, timely data management support: quality control/quality assurance, query development, data integrity, data analysis, account management, data management platform design and planning.  Qualified applicants must be detail-oriented, result-driven individuals who work well within team environments and have excellent interpersonal skills, client interaction and management skills, and organizational skills. Responsibilities:Utilize protocol-specific guidelines to provide project tracking and reporting support for human clinical research projects including master data and metadata management and queries.Analyze clinical site performance in terms of data submission, collection, and consistency.Collaborate with nationwide grantee sites, program directors, and the internal multi-disciplinary operations and development teams.Actively participate in regular meetings, client communications/reporting, and data-driven business decisions.Perform data analysis to support process improvement/design and/or scientific communication.Perform data harmonization and data cleaning among multiple cohorts.Provide Tier 1 user support for system issues, including login assistance, user privileges, system workflows, and enhancement requests.Develop Case Report Forms (eCRFs) and assist with inventory tracking in the Electronic Data Capture (EDC)/data management platform.Provide input for and assess impact of EDC functionality enhancements.Support the software lifecycle with emphasis on performing User Acceptance Testing (UAT).Update and develop Standard Operating Procedures (SOPs).Additional tasks as assigned by the Program Manager.Requirements:Must be a U.S. CitizenEligible for U.S. Government ClearanceStrong verbal and written communication skills.Ability to establish and maintain effective harmonious relationships with diverse stakeholders.Ability to plan and manage time and resources, establish priorities, and meet or exceed goals.Skilled in the operation of computers and related software applications, such as MS Office.Experience Guidelines:Experience in research processes and/or entry/extraction/compilation/reporting of research data.Technical understanding of tools such as SQL and SAS at an intermediate level.Experience with EDCs, monitoring clinical trial data, CDISC, and/or Big Data a plus.Experience operating as a team member, without close supervision, in complex situations.Demonstrated ability to work well under pressure with competing priorities and demands.2-4 years of relevant work experience, preferable in a related field: life sciences, health programs, clinical research, NIH, or other related government/health research programs.Education:Required: Bachelor's Degree from an accredited college/universityPreferred: BS in Health Sciences, Statistics, MIS, or InformaticsTCM is an EEO/Vets/Disabled Employer."}