{"jobID": "2703797981", "jobLocation": "Northbrook_IL", "jobTitle": "Data Scientist Lead, Senior Manager", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Position Summary As the Data Scientist Senior Manager, you will be responsible for the development and implementation of proprietary machine learning algorithms and techniques to solve business problems and optimize our member experience. In this role, you must proactively collaborate with business partners to develop actionable plans to enable the identification of patterns related to claim quality, cost, and other variables. Other responsibilities include, but are not limited to: Working with data sets of varying degrees of size and complexity, including both structured and unstructured data.Implementing real-time model scoring to drive actions.Determine continuous improvement opportunities of current predictive modeling algorithms.Mentor, guide, and develop Data Scientists and Analysts within the team. The successful Data Scientist Senior Manager will possess excellent analytical and problem solving skills, with a strong attention to detail and accuracy. You will also demonstrate excellent written and oral communication skills, along with superior organization skills. You must be adaptable and able to move with change, while maintaining positivity and being a strong role model on the team. You should be able to handle multiple tasks and adapt to evolving business and technical environments. The contributions you will make as the Data Scientist Senior Manager will help to position CVS Health as a leader in client satisfaction and service within the PBM marketplace.  This role can be located in any one of our major hubs in Northbrook, IL, Irving, TX, Scottsdale, AZ, or Woonsocket, RI, as well as remote/telecommute with ability to travel 10%-15%. Position Summary As the Data Scientist Senior Manager, you will be responsible for the development and implementation of proprietary machine learning algorithms and techniques to solve business problems and optimize our member experience. In this role, you must proactively collaborate with business partners to develop actionable plans to enable the identification of patterns related to claim quality, cost, and other variables. Other responsibilities include, but are not limited to: Working with data sets of varying degrees of size and complexity, including both structured and unstructured data.Implementing real-time model scoring to drive actions.Determine continuous improvement opportunities of current predictive modeling algorithms.Mentor, guide, and develop Data Scientists and Analysts within the team. The successful Data Scientist Senior Manager will possess excellent analytical and problem solving skills, with a strong attention to detail and accuracy. You will also demonstrate excellent written and oral communication skills, along with superior organization skills. You must be adaptable and able to move with change, while maintaining positivity and being a strong role model on the team. You should be able to handle multiple tasks and adapt to evolving business and technical environments. The contributions you will make as the Data Scientist Senior Manager will help to position CVS Health as a leader in client satisfaction and service within the PBM marketplace.  This role can be located in any one of our major hubs in Northbrook, IL, Irving, TX, Scottsdale, AZ, or Woonsocket, RI, as well as remote/telecommute with ability to travel 10%-15%.  Preferred Qualifications PBM experience/healthcare industry experience.Experience with data forensics. Required Qualifications 5+ years of experience in predictive analytics or equivalent, including theoretical and practical experience with various machine learning techniques and statistical algorithms.3+ years of advanced expertise with software such as Python, R, or SAS, with demonstrated ability in manipulating data and drawing insights from data sets.3+ years of intermediate-advanced knowledge using Hive, impala, or Apache Spark, as well as data extraction and manipulation using SQL.3+ years of experience working with distributed computing environments such as Hadoop.3+ years of demonstrated experience leading and delivering projects.SDL2017"}