{"jobID": "2781218456", "jobLocation": "Austin_TX", "jobTitle": "Big Data Pipeline Software Engineer - Java/Scala", "companyRating": null, "companyInfo": {"Website": "www.dauint.com", "Headquarters": "Munich, Germany", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "All data has a story to tell… Can you help tell the story...? Currently seeking an Austin based Big Data Engineer for AI/Machine Learning product to work with a profitable computer software company specialized in IT security solutions. You will be a part of a team of 12 engineers including 2 big data scientists and 1 big data architect. Tasks for theBig Data Pipeline Software Engineer - Java/ScalaBuilding microservices with Java/Scala & Apache FlinkImplementing ETL processes - (Extract-Transform-Load)Monitoring performance and advising any necessary (Big Data) infrastructure changesDefining data retention policies (Storage of Data – Compliance around it)Implementing machine learning algorithms for predictive modeling.Be part of a team that is creating a brand-new product line for Predictive Modeling or Predictive analytics (Peer Group Analysis)Collaborate with team members to help shape requirementsActively engage in technology discovery that can be applied to the productRequirements of the Big Data Pipeline Software Engineer - Java/Scalamin. 4 years of data/software engineering experienceStrong Java and/or Scala experience preferredProficient understanding of distributed computing principlesExperience with integration of data from multiple data sourcesGreat communication skillsBS in Computer Science, or a related fieldThe stack you will be exposed to as a Big Data Pipeline Software Engineer - Java/ScalaMahout/Deeplearning4j/Spark MLHadoop, and/or SparkSpark streaming/Storm/BeamClouderraElasticsearchKafka/KinesisRedshift, Cassandra, DynamoDB, MySQL on Amazon RDSBenefits for the Big Data Pipeline Software Engineer - Java/ScalaHighly competitive salary + stock OptionsFlexible vacation policy/paid holidaysTechnical and career growth opportunitiesFlexible working hoursEmphasis on healthy work-life balanceComprehensive medical and dental coverage401KA profitable and financially disciplined organization/management teamSend us your application or a brief message to set up a call and gain further insight on this exciting opportunity.All conversations are confidential, and we will only submit your profile after attaining your consent. Please visit my LinkedIn profile to learn more about me and feel free to reach out directly with any additional questions: https://www.linkedin.com/in/albert-dau/Dau International creates a connection between IT Professionals and successful companies seeking new talent.  Our aim is to provide a service based on open communication and targeted networking. Relationships are our top priority, and we believe that integrity and trust should be a part of every exchange. Our passion is helping companies grow by providing them with the necessary employees to successfully run their IT departments. We love to see the success of our candidates, and it is very rewarding to help them find their dream position. "}