{"jobID": "2829108741", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We are currently seeking a motivated, career and customer-oriented Data Scientist to join our team in Northern Virginia and begin an exciting and challenging career with Unisys Federal Systems. The ideal candidate is an individual with broad understanding of the Department of Homeland Security (DHS) based on experience gained from supporting several components. Applicants should have the functional knowledge and ability to support our client's data challenges by providing data solution architecture, data engineering, data science, and data analysis support that analyzes, synthesizes, and integrates large quantities of structured and unstructured data that will be used to enhance the tools and features of the client information technology applications.  Working with our DHS clients, you will use your knowledge of DHS's data collection and management capabilities, end-to-end data and work flows, and data warehouses and lakes to enhance mission performance and improve Departmental and Component efficiency. You will implement data analysis using machine learning, predictive analytics, data mining, pattern recognition, data modeling, and statistical methods to solve large scale optimization problems and identify meaning derived from large data sets. You will perform data analytics at on-premise data centers and in cloud environments, including AWS and Azure. You will develop architectures and approaches for addressing information siloes and systems of records that do not facilitate data sharing and reuse. You will apply your expertise on multiple complex work assignments which are broad in nature, requiring originality and innovation in determining how to accomplish tasks. You will apply your comprehensive knowledge across key tasks and high impact assignments, evaluate performance results and recommend changes as necessary to achieve project success. Your primary responsibility will be working with teams designing, testing and building applications to meet DHS customer requirements and goals, which may include using Big Data Analytics and a Continuous Integration/Continuous Delivery (CI/CD) approach to optimize data flows and provide meaningful and actionable information. You will support our customers and enhance the experience of their clients and users by designing, developing, and deploying tools for public users of many types. Potential tasks include expanding existing client models to present relevant information to users including: developing and deploying personalized processing models; adding integration points for the intelligent automated help agents to connect with external applications or data sources to increase its effectiveness and accuracy; creating and implementing scrubbing strategies to ensure unstructured data is appropriate to present to the end user; analyzing customer data and biometrics to identify key data points for confirming a customer's identity; and analyzing, validating, and creating process to transition from a transaction based model to a customer centric model. You will also prepare technical papers and playbooks, responses to acqusitions, and conduct white board sessions within Unisys and with customers.  Must have experience working for or supporting the Department of Homeland Security and its components. You must be familiar with Agile methodology and be able to work collaboratively in a team environment. Excellent written and oral communications skills are essential. Other requirements include: Expert in enterprise data tranformation including data warehouse and data lake rationalization.Proven expertise in using combinations of supervised and unsupervised machine learning algorithms, predictive models, and statistical algorithms to provide insights into client datasets.Must be familiar with current link analysis and risk analysis tools.Deep knowledge of Data Science including Google Analytics and metrics, statistical analysis, machine learning and natural language processing, and data science, analytics, modeling and integration.Experience planning, organizing, facilitating, and collecting data from focus group and research/usability testing sessions.Data segmentation and data flow modeling.Knowledge of and experience working with Hadoop and Cloudera.Executing descriptive analyses, ranging from identifying product opportunities to understanding user behaviorExperience/expertise with Natural Language Processing (NLP), graph theory, Scala, and machine learning.Demonstrated ability building innovative data products (e.g., Artificial Intelligence, real-time services, such as personalization and commerce graphing using Big Data platforms with real-time data ingestion and processing).Establishing big data reporting and enterprise analytics platforms to analyze increasingly larger and more complex data sets.Skills at Identifying and correcting data quality issues and establishing a data governance framework to enforce data standards and improve accuracy using integrated internal and external disparate data sources.  Familiarity and experience with the following is highly desirable:Developing machine-learning algorithms to improve predictions.Develop highly optimized, scalable automatic case matching logic on microservice/container technology.  U.S. CITIZENSHIP REQUIRED Master’s Degree in Computer Science, Computational Mathematics, Statistics, Engineering or related field degree or higher and a minimum of 15 years of related experience. Applicable advance certifications and education and specific skills can be substituted for Master's degree or years of experience. Current DHS Clearance is a bonus.  Local candidates only. Work location: Northern Virginia Do you have what it takes to be mission critical? Your skills and experience could be mission critical for our Unisys team supporting the Federal Government in their mission to protect and defend our nation, and transform the way government agencies manage information and improve responsiveness to their customers. As a member of our diverse team, you’ll gain valuable career-enhancing experience as we support the design, development, testing, implementation, training, and maintenance of our federal government’s critical systems.  Apply today to become mission critical and help our nation meet the growing need for IT security, improved infrastructure, big data, and advanced analytics. Unisys is a global information technology company that solves complex IT challenges at the intersection of modern and mission critical. We work with many of the world's largest companies and government organizations to secure and keep their mission-critical operations running at peak performance; streamline and transform their data centers; enhance support to their end users and constituents; and modernize their enterprise applications. We do this while protecting and building on their legacy IT investments. Our offerings include outsourcing and managed services, systems integration and consulting services, high-end server technology, cybersecurity and cloud management software, and maintenance and support services. Unisys has more than 23,000 employees serving clients around the world.  Unisys offers a very competitive benefits package including health insurance coverage from first day of employment, a 401k with an immediately vested company match, vacation and educational benefits. To learn more about Unisys visit us at www.Unisys.com. Unisys is an Equal Opportunity Employer (EOE) - Minorities, Females, Disabled Persons, and Veterans.  #FED#"}