{"jobID": "2813265482", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist Senior", "companyRating": "3.5", "companyInfo": {"Website": "www.freddiemac.jobs", "Headquarters": "Mc Lean, VA", "Size": "5001 to 10000 employees", "Founded": " 1970", "Type": " Company - Public (FMCC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Sallie Mae, Fannie Mae"}, "estimatedSalary": "129000", "jobDescription": " Position Overview  As a Senior Data Scientist on the Collateral Modeling and Analytics team at Freddie Mac, you will join a group of skilled professionals who use data science to solve important business problems. You will apply statistical and machine learning techniques to build tools that will be used daily to make decisions about the collateral underlying the mortgages in Freddie Mac's portfolio. You will make efficient use of distributed computing technologies with the latest structured and unstructured big data available. Responsibilities include:Use techniques from statistics, machine learning, and other data sciences to estimate predictive models from numeric, categorical, textual, graphic, and other data featuresProvide modeling and analytical assistance to a line of business or product area, functioning as day-to-day technical expertEvaluate and manage risks associated with the company's models including collateral valuation and othersPresent research results to both technical and non-technical audiencesWrite model documentation and research reportsVisualize data to communicate complex ideasStay abreast of trends in data scienceQualificationsTypically has 5-7+ years of professional experienceBachelor's degree in related field3+ years of training in and/or experience with data science, statistics, and/or machine learning1+ years of training in and/or experience programming in SAS and either R or PythonStrong communication skills Preferred Skills Advanced degree (PhD, Masters) in a quantitative discipline (data science, statistics, computer science, economics/econometrics, applied mathematics, operational research, physics, bioinformatics, engineering, etc.)Experience with and/or training in text mining for predictive analyticsExperience using Linux and/or UnixExperience querying relational databases via SQLTraining and/or experience in image processing Closing Statement  Today, Freddie Mac makes home possible for one in four home borrowers and is one of the largest sources of financing for multifamily housing. Join our smart, creative and dedicated team and you'll do important work for the housing finance system and make a difference in the lives of others. Freddie Mac is an equal opportunity and top diversity employer. EOE, M/F/D/V."}