{"jobID": "2819045427", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst - Entertainment and Media Industry Opportunity", "companyRating": "3.5", "companyInfo": {"Website": "www.aegworldwide.com", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " The Data Analyst must have a honed skill for choosing the right lens through which to best explain the relevance of a given data set and its relationship to business goals. The Data Analyst will figure out the best way to visualize their findings and explore new ways to express them. The incumbent will be able to distill a great body of work into an illuminating image.-Analyze customer behavior and engagement signals across all channels and touchpoints to provide key business insights; identify macro and micro indicators. Visualize key metrics on an ongoing basis to succinctly communicate out to marketing, executive team and key stakeholders.Own analytic toolset from an implementation and maintenance standpoint, including, but not limited to: adding data sources / pipelines, iterating reports, and exploring new functionality and technologies.Collaborate with cross-functional groups including Product, Media, Talent Buying, and Marketing to identify trends and key opportunities.Develop quantitative analysis, ad hoc reports, models, and suggest A/B tests to challenge assumptions or ratify strategies.Conduct ad hoc analysis to provide guidance for stakeholders in order to make informed decisions.Create, monitor and maintain automated report inventory.Identify anomalies in the data to help trouble-shoot issues like data integrity, missing fields, broken data and UX flows, etc. Required Qualifications (Job Knowledge, Skills, and Education): A minimum education level of: BA/BS Degree (4-year)3 5 years of related work experienceFamiliar with statistical models and advanced data analytics skillsHighly adaptable, motivated, proactive problem-solverProven history of decision-making excellence and cross-functional influence through insightsExperience with email marketing software a plusProficient with Microsoft Office Suite (Outlook, Excel, Word, PowerPoint); and ability to learn all required business systems.Power user of Excel and Tableau, or comparable analysis, reporting toolExperience working with relational databases and SQL query languagesFamiliar with Java, no-SQL architectures, R, experience with Python is a plusComfortable adopting new technologies and eager to understand how to effectively wield new tools"}