{"jobID": "2825079769", "jobLocation": "Chicago_IL", "jobTitle": "Data Steward Analyst", "companyRating": null, "companyInfo": {"Website": "www.tiaa.org", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 1918", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Fidelity Investments, Vanguard, Wells Fargo"}, "estimatedSalary": null, "jobDescription": "Job DescriptionCOMPANY OVERVIEW: Nuveen is the investment management arm of TIAA. It is one of the largest global asset managers with specialist knowledge across a wide array of asset classes, including fixed income, equities and alternatives. Nuveen is driven not only by the independent investment processes across the firm, but also the insights, risk management, analytics and other tools and resources a truly world-class platform provides. As a global asset manager, our mission is to work in partnership with our clients to create outcome-focused solutions to help them secure their financial future. For more information about the firm please visit our website at www.Nuveen.com POSITION SUMMARY: The Global Distribution Solutions group works across sales, marketing, product, and service teams to build processes and functionality to solve key problems to help drive our business forward. The group provides strategic and tactical support with incorporating data, CRM functionality, customer-based analysis and analytical insight into the distribution processes in an effort to improve our strategic and tactical approach to distribution effectiveness. We work to understand our clients across all distribution channels, and we use a creative, intelligent approach to CRM to encourage adoption. KEY RESPONSIBILITIES AND DUTIES: The Customer Information Management (CIM) Data Steward is responsible for data quality, stewardship, and analysis of the data within our CRM systems, encompassing multiple elements including financial and demographic data. Additionally, the role helps to manage our external data vendor relationships to continually improve the quality, depth, and breadth of customer data in our CRM ecosystem. Execute data stewardship for entities across CRM systemsCollaborate with distribution across Nuveen to revise criteria for adding, updating, and deleting entities within CRMResponsible for all administrative functions within CRM systems related to data accuracy and quality, including the creation and organization of users, and the maintenance of validation lists which drive workflow, reporting, and analyticsAnalyze third party data and provide recommendations for integration and enrichment of existing dataManage service tickets and change requests within CRM systems in accordance with governance rulesCo-manage the CRM enhancement release process for the CIM Team, including identification of future enhancements and writing business requirements. Collaborate with IT and other internal departments as needed.Conduct a quality review of entities within CRM systems on a periodic basis and recommend improvements to governance and stewardship guidelinesAdd and update customer entities and attributes (mass upload and manually) within our CRM systems to enrich existing dataSupervise internal and offshore resources maintaining and updating customer dataDevelop and manage relationships with legal, operations, and third party providers to maintain data completeness and qualityDOCUMENTATION AND REPORTINGProfile and report on data completeness and qualityProvide ad hoc reporting assistanceQUALIFICATIONS:Education and/or Experience: · Bachelors degree from an accredited four-year university  · 2-3 years previous work experience  · Industry experience preferred  · Previous data stewardship/governance experience preferred Knowledge, skills and abilities:CRM (Salesforce, MS Dynamics)Intermediate SQL or similar query languageTableau or similar BI toolAdditional:Ability to display independent judgment to make decisions where no clear precedents exist; adjusts plans and deliverables with the right approvals and the business goals in mind. Ensures that all standards are followed and controls are adequately designed and implemented.Strong presentation skillsStrong analytical skillsTRAVEL:  · Limited travel required (Equal Employment Opportunity is not just the law, its our commitment. Read more about the Equal Employment Opportunity Law.  If you need assistance applying due to being visually or hearing impaired, please email Careers Help.  We are an Equal Opportunity/Affirmative Action Employer. We will consider all qualified applicants for employment regardless of age, race, color, national origin, sex, religion, veteran status, disability, sexual orientation, gender identity, or any other legally protected status."}