{"jobID": "2835595500", "jobLocation": "Mountain_View_CA", "jobTitle": "Scientist, Product Development (Ancestry)", "companyRating": "4.9", "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": " Are you fascinated by genetics, passionate about bringing science to the everyday consumer, and interested in revolutionizing how people interact with their DNA? We're looking for enthusiastic people with scientific backgrounds to contribute to the development of consumer genetics applications. Your work could help millions of people understand their genetic information and use it to make impactful life changes. Come join 23andMe's Ancestry team! Who we are Since 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding. Who you are You have a passion for science and believe that it is important to make genetic information accessible, relatable, and useful to everyone. You have an innate curiosity about user behavior and an aptitude for analyzing it to produce actionable insights. You are comfortable evaluating findings from scientific studies, have a high-quality bar, and are a stickler for detail. You enjoy working in cross-disciplinary settings and are always looking for ways to improve the way your team gets things done. Like us, you are mission-driven and want to contribute to something that truly impacts peoples lives. What youll doDevelop science-focused features and content for 23andMe's Ancestry ServicePerform exploratory data analysis to identify trends, patterns, correlations, and insightsWork with a cross-disciplinary team of product managers, researchers, engineers, and designers to deliver on our unique product and missionProvide scientific support to a variety of teams across the companyWe hope you haveAn advanced STEM degree (PhD or equivalent)Post PhD experience preferredAn ability to translate complex scientific terminology for a consumer audienceExperience with data analysis and programming, with a publication record (or repository) to back it upFamiliarity with the fundamentals of biology and human geneticsFamiliarity with various study designs and statistical analysis in the context of critically evaluating scientific findingsAn ability to work with minimum supervision to deliver well-designed high-quality work on timeInterested? Submit your resume and a cover letter letting us know why you are excited about this position and why you are a great fit. About Us 23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.  At 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.  Please note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}