{"jobID": "2733762627", "jobLocation": "Richmond_CA", "jobTitle": "Scientist I/II, AAV Engineering", "companyRating": null, "companyInfo": {"Website": "www.sangamo.com", "Headquarters": "Richmond, CA", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Public (SGMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title: Scientist I/II, AAV EngineeringManager: Scientist IIDepartment: ResearchLocation: Richmond, CAJOB SUMMARY:We are seeking a talented scientist to fill an open position in our Discovery and Translational Research group to support the development of novel adeno-associated viruses for improved delivery of genome editing technologies. The successful candidate will contribute to the advancement of therapeutics across our pipeline and in supporting the translation of research efforts into the clinic. The position requires adaptability, organization, attention to detail, and a capacity for constant innovation in pursuit of company goals.PRIMARY RESPONSIBILITIES:Advance the development of novel AAV capsids for targeted gene delivery to a variety of tissue targetsIndependently design and execute experiments to characterize the biological properties of AAV serotypesGenerate innovative solutions to overcome technical challenges to efficient gene deliveryManage and support research studies with partners and/or contract research organizationsPerform and document laboratory procedures with great attention to detailEffectively analyse and present data internally and externallyEDUCATION, EXPERIENCE, AND SKILLS REQUIREMENTS:Ph.D. in bioengineering, chemical engineering, virology, or related disciplineExtensive hands-on experience and comprehensive knowledge of AAV biologyExpertise in AAV engineering with demonstrated ability to develop and characterize novel serotypesBroad knowledge and proficiency in molecular biology techniques including cloning and quantitative PCRExperience in next generation sequencing and high throughput library screeningProficiency in mammalian cell cultureAbility to train and mentor research associatesExceptional oral and written communication skillsDedicated, hard-working, and dependableExperience in planning and execution of animal studiesCompetency in programming languages is preferredUnderstanding of immunologic responses to gene therapies is preferredHands-on FACS experience is a plusExperience with molecular modeling is a plusThe above reflects managements definition of essential functions for this position, but does not restrict the tasks that may be assigned.The above duties are representative only; management may assign or reassign duties and responsibilities to this position at any time."}