{"jobID": "2725383477", "jobLocation": "Dallas_TX", "jobTitle": "Senior Healthcare Data Analyst - Remote", "companyRating": "3.0", "companyInfo": {"Website": "www.medecision.com", "Headquarters": "Wayne, PA", "Size": "201 to 500 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Healthagen, ZeOmega"}, "estimatedSalary": "92000", "jobDescription": " OverviewMedecision is transforming healthcare one cool app at a time!  Are you the kind of person that is motivated by the challenge of a dynamic, changing market? Can you utilize and exploit progressive systems and processes to satisfy urgent business needs? Are you a good partner with your teammates; driven to execute team and individual commitments that align with business vision? Does the idea of a high visibility and high impact role in a medium sized, growing company excite you? Are you interested in being part of a team that strives to achieve high business impact, execution excellence and has a lot of fun while we are doing it? Are you ready? We are! Join us in our journey towards liberating today’s fragmented healthcare systems to Connect Care Everywhere.  Medecision is looking for a Senior Health Care Data Analyst, a passionate power contributor who blends proven ability to positively impact the usability of health care data with solid systematic diagnostic and solutioning experience specific to health care data management challenges. The right individual, will have solid Data Operations background with a combination of strong communication, healthcare analytic knowledge skills, operational facilitation, documentation and change management experience. This position will need to have proven problem-solving skills, issue escalation, root cause analysis and resolution experience while having experience from working within a SaaS organization. THIS JOB MIGHT BE FOR YOU, IF… You, as the Senior Health Care Data Analyst, willoversee critical data processes for quality and conformance to standards. Perform ad hoc analysis as needed to determine root cause of unexpected results. Reports to: Senior Director, Data Management Team Location(s): Philadelphia, PA; Dallas, TX; Remote-USResponsibilitiesYOU’RE GOOD AT:Understanding the specific data management requirements and challenges within the health care industry such as HIPPA requirements and HL7 standardsAssessment of data inputs and outputs against SLA and compliance expectationsTraining junior team members on data management operations and proceduresWorking directly with clients in operational and review settingsDocumenting data specifications, especially in converting business level knowledge requirements to technical data specificationsWorking in a team setting to diagnose and solution data quality challengesDriving operational best practices that solve real business challenges across MedecisionResolving potentially complex cross-functional data challengesMaintaining regular and ad-hoc operating metrics and performance gauges such as the balanced scorecardSupporting User Acceptance testing (UAT) and maintaining operational documentationPartnering with implementation teams to smoothly transition new clients and internal roll outs to production QualificationsYOU HAVE:Bachelor’s degree in Health Sciences, Computer Science, Analytics, MIS, or BusinessAt least 8 years of relevant work experience in healthcare data management coupled with strong data operations, analytical and customer focused expertiseIn depth expertise in healthcare data exchange (EDI) and data processing, this includes but is not limited to: X12 (834s, 837I, 837p and 274s), HL7 messaging based standards including LOINC, Lab and CCDA and standards from National Council for Prescription Drug Programs (NCPDP)Intermediate to advanced experience with SQL (e.g. ability to read and write complex queries, navigate relational databases) coupled with the familiarity of Linux to troubleshoot within as necessaryDemonstrated experience in establishing strong relationships with internal stakeholders, cross-functional team members, and external clients/customers to bring data management issues to resolution or other projects to fruitionWorking knowledge of common health care reference data sets such as National Drug Codes (NDCs) and International Classification of Diseases (ICD)Working knowledge of widely used Health Care data analytics providers and associated tools including Verisk and Truven(MEG)Knowledge of major production application systems used for delivery of services to internal and external clientsAbility to understand reported issues, customer business workflows, and provide suggestions on business directionDocument and adhere to change management processAbility to do some travel, likely OUR CULTURE DRIVES US It’s not all about what we do. It’s as much about how we do it. Medecision team members show up. We consistently exemplify our 6 core values of success: Execution. Service – We deliver “standing ovation” service. Speed – We are Agile. Ownership— We all take ownership and responsibility for how we deliver our promises, how we spend money, who we hire, what we build and how we help one another grow.Passion. We show an infectious emotional commitment to our work because what we do is important to our customers, one another and ourselves.Partnership. We are all in this together, without boundaries. Our internal/external network contains the solutions we need: we’ll continuously seek them out, use them and improve them.Leadership. We are Medecision’s brand. We are experts in care management, care coordination and healthcare information and technology. We lead our clients to excellent results by providing our expertise on best practices, industry trends, solutions development and innovations. We are moving in sync with an evolving industry. There is no problem we cannot solve.Innovation. We are in a constant state of discovery, inventiveness, thinking outside the box, and leading others internally and externally to do the same.Candor. Medecision communicates in a sincere, direct and famil­iar way. We address conflict directly and escalate issues internally and externally to address conflict with speed and partnership. Join us in our quest to liberate healthcare!  This description has been designed to indicate the general nature and level of work performed by an employee within this position. The actual duties, responsibilities and qualifications may vary based on assignment. Medecision is an Equal Opportunity Employer (EOE) and strongly supports diversity in the workplace."}