{"jobID": "2829224193", "jobLocation": "Chicago_IL", "jobTitle": "Analyst - Data Governance", "companyRating": "4.0", "companyInfo": {"Website": "www.williamblair.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1935", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Company Description:William Blair is committed to building enduring relationships with our clients and providing expertise and solutions to meet their evolving needs. We work closely with private and public pension funds, insurance companies, endowments, foundations, sovereign wealth funds, high-net-worth individuals and families, as well as financial advisors. We are 100% active-employee-owned with broad-based ownership. Our investment teams are solely focused on active management and employ disciplined, analytical research processes across a wide range of strategies, including U.S. equity, non-U.S. equity, fixed income, multi-asset, and alternatives. William Blair is based in Chicago with an investment management office in London and service.William Blair Investment Management, LLC and the investment management division of William Blair & Company, L.L.C. are collectively referred to as \"William Blair.\"About the Team: William Blair Investment Management’s data governance team is responsible for strategic technology initiatives surrounding the use of fundamental and quantitative data throughout the investment process. The functions of this team include, but are not limited to: defining, capturing and verifying data requirements in collaboration with data consumers; ensuring all data is consistently defined, aligned to business concepts and captured as metadata. We also coordinate across functions to define and implement data usage and lineage, SLA’s and data retention policies.Job Summary & Responsibilities: Oversee the department’s data platform which encompasses Data Governance, development, analysis and data delivery for front-office research and operations. Collaborate with business areas including research, institutional products, quantitative teams and other technology teams to enhance the data platform, implement analytical rules and develop tools to ensure users are provided with quality data, reports detailing validation breaches, and timely resolution on the steps taken to remediate the data. Work with various stakeholders to identify and source new data domains from both new and existing vendors, ensure the data is licensed for appropriate use and integrated into the team’s systems.Design, execute and monitor daily data controls and transformation processes primarily focused on quantitative, fundamental and research data.Support data quality management including profiling, remediation and business validation by building dashboards and analytical tools monitoring & resolution with a focus on automation.Execute daily data and exceptions analysis to determine root-cause of rule breaches, associated business impacts and recommended remedial actions focused specifically on factor input data, factor scores, model scores and portfolio construction data.Collaborate with data providers to resolve source related data quality issues and make recommendations to continuously improve field level data quality.Communicate data issues and remedial actions to data users/owners.Collaborate with business teams on defining & documenting data requirements and establishing operational needs to ensure proper sourcing and provisioning of data.Collaborate with business teams to identify and certify new sources of market/research data.Participate in the routine reporting of data quality metrics to business users as well as upper management.Work in partnership with others to integrate new data and new vendors into IM systems and develop new tools and methodologies for data analysis. Qualifications: Bachelor’s degree required; concentration in math or finance preferred.Four to six years in data use/analysis, with quant/research focus.5 or more years of Financial Services experience with a primary focus on quantitative research.Experience working with all types of data vendors (eg. Thomson Reuters, ICE, Factset, XTF), and a working knowledge of their offerings with experience with the vended QAI data models, being highly preferred.Good interpersonal and communication skills to ensure successful results when assisting users of varying knowledge levels.Ability to understand quantitative investment processes.Familiar with database architecture as well as SQL and R.Experience with cloud-based data technologies would be a plus.Ability to collaborate across multiple functions.Attention to detail and quality.Commitment to quality, including satisfying internal and external customers.Strong verbal communication skills.Strong problem resolution skills.Ability to work effectively in a team environment.As a William Blair associate, you’ll enjoy Medical, Dental, Life and AD&D; Insurance, along with a generous profit sharing program that includes a 401K plan in addition to a firm contribution. We also offer three weeks of vacation, flexible spending accounts, a business casual dress code, a 75% discounted commissions on trades, and discounts at restaurants, museums, parks and retailers.  William Blair is an equal opportunity employer. It complies with all laws and regulations that prohibit discrimination in employment practice because of race, color, religion, creed, ancestry, marital status, gender, age, national origin, sexual orientation, unfavorable discharge from the military service or on the basis of a physical or mental disability that is unrelated to the employee's ability to perform the duties of the job applied for.  EOE m/f/d/v"}