{"jobID": "2756009059", "jobLocation": "Washington_DC", "jobTitle": "Federal Account Executive", "companyRating": null, "companyInfo": {"Website": "www.venafi.com", "Headquarters": "Salt Lake City, UT", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " DigiCert, Gemalto, Comodo"}, "estimatedSalary": null, "jobDescription": "The Opportunity Venafi is a rapidly growing cyber security organization, and the leader in managing, securing and protecting Machine Identities, the cryptographic keys and digital certificates that every organization depends on to improve security, increase operational efficiency and achieve better compliance. Due to our fast growth and urgency to fulfill the demand, Venafi is looking for a highly motivated Federal Account Executive.  The Federal Account Executive will manage all sales activities and own an existing and new revenue (ARR) target for a list of targeted, high-priority existing accounts in the DOD/IC territory. The candidate can be based anywhere within the Washington DC metropolitan area. The position involves managing renewals and driving the expansion and adoption of new and existing Venafi software and services in existing federal accounts.  A principle goal for this position is selling multi-year enterprise agreements to maintain existing revenue and to reach new revenue (ARR) target. The Federal Account Executive is responsible for ensuring Venafi customers successfully realize the full value of the Venafi software and services. As such, the position requires extensive relationship building activities in the targeted list of federal accounts along with driving business and security cases. To achieve this along with further adoption of Venafi software and services, the Federal Account Executive must have strong skills and experiences educating and building relationships at the C-Level and in selling complex solutions in large and complicated customer environments. Successful execution may at times require the involvement of Venafi channel partners. Key Result AreasDrive top-line sales revenue in a targeted list of existing large Venafi Federal customers directly and through Venafi channel partnersDrive adoption of enterprise agreements in the targeted list of federal accounts to ensure long term relationships and maximum contract value with Venafi.Educate C-Level to get sponsorship.Strong focus on relationship building with executive decision makers.Build trust and credibility at multiple levels in the targeted list of federal accountsGuide prospects through sales process (following Venafi Playbook) to facilitate decisions.Ensure customer success with Venafi solutions.Represent Venafi at local and/or industry events.Maintain accurate CRM information.Collaborate with other team members in Venafis Federal Group to foster a strong sense of community and information sharing among targeted federal accounts.Travel as necessary to client locations (approximately 30-60% of time traveling).Minimum Skills and Experience RequiredMinimum 7 years enterprise software sales experience to DOD/IC.Proven ability to sell enterprise level software.Proven ability to build and maintain relationships with executive decision makers.Proven ability to sell multiyear multi million dollars enterprise licensing agreements.Proven track record of exceeding software sales revenue targets.Excellent critical thinking & analytical skills a must.Excellent communications and presentations skills a must.Excellent execution skills a must.Strong ability to write and create content in Word, Excel and PowerPointProven ability to manage complex sales cyclesExperience selling a subscription software model What Sets You ApartSecurity software sales experience.PKI knowledge or experience.Named, global or large enterprise account management experience.About Venafi Venafi is the cybersecurity market leader in machine identity protection, securing machine-to-machine connections and communications. Venafi protects machine identity types by orchestrating cryptographic keys and digital certificates for SSL/TLS, IoT, mobile and SSH. Venafi provides global visibility of machine identities and the risks associated with them for the extended enterpriseon premises, mobile, virtual, cloud and IoT at machine speed and scale.  Venafi puts this intelligence into action with automated remediation that reduces the security and availability risks connected with weak or compromised machine identities while safeguarding the flow of information to trusted machines and preventing communication with machines that are not trusted. Internally, we have an exceptional culture built around our core values comprised of honesty, transparency, leading by example, awareness, risk taking, and team before self.  Leaders looking to join this growing federal team are welcome!"}