{"jobID": "2820073628", "jobLocation": "Wall_Township_NJ", "jobTitle": "Associate Environmental Scientist or Geologist", "companyRating": "3.1", "companyInfo": {"Website": "www.gesonline.com", "Headquarters": "Wall Township, NJ", "Size": "501 to 1000 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "Our Wall, NJ office seeks an Associate Environmental Scientist or Geologist to join our team.This position typically consists of 70% fieldwork and 30% office work, and may include some overnight travel.Responsibilities and Duties:Participates in monitoring well installations and soil/groundwater/vapor intrusion sampling eventsCompiles and completes field notes on each event/siteRecords data, prepares reports, provides analysis and interpretationsCompletes groundwater monitoring and other technical reports, including generation of tables, figures and appendicesPrepares NJDEP forms, including individual Report forms, Case Inventory Documents (CIDs), Receptor Evaluations (RE), Pubic Notifications, Full Laboratory Deliverables, and Well SearchesPerforms hydrogeological assessments regarding groundwater flows to identify contamination impact and related concernsResearches information relating to identifying geological formations and soil delineation studies and prepares reports (NJ DEP, PA/SI, RIR, RAR, RAPS/RAOs) and geological maps based on the findingsPerforms groundwater sampling, gauging and product bailing, and surveyingParticipates in the identification of viable remedial solutions consistent with all Federal, state, and local regulationsFamiliarity with NJ DEP SRRAand ARRCS, technical regulations, NJDEP guidance documents, and LSRP program.Team Player, dynamic, eagerness to learn, motivated and highly responsive · Interest in Career DevelopmentGeneral knowledge of LSRP program and willingness to review and ability to comprehend NJDEP guidance.A Bachelor's degree or higher in Geology, Environmental Science, Engineering or a related discipline and 2-4 years of related experience is required. Retail petroleum and/or industrial site experience is a plus.Must be detail-oriented, and a team playerMust have good technical writing, communication, analytical, organization, decision-making, and time management skills. · Must be resourceful and possess a high degree of initiative. · Must have OSHA 40 hr. Hazwoper and up to date on 8 hr. Refresher Training. · Possession of TWIC card is preferred.Must have a clean driving record and be able to drive a company vehicle.Drug/Alcohol screening and a background check are required.Our comprehensive benefits include: medical, dental, vision, prescription card, 401k, FSA, LTD, STD, New Parent Leave, 529 CollegeBound Fund, Tuition Assistance, Bonus Plan, and more.  GES is an equal opportunity/affirmative action employer that strongly values diversity. EOE/AA/M/F/V/D"}