{"jobID": "2815856341", "jobLocation": "Plano_TX", "jobTitle": "Global Principal Scientist - Dips/Sauces", "companyRating": null, "companyInfo": {"Website": "www.pepsico.com", "Headquarters": "Purchase, NY", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (PEP) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unilever, Mondelez International, Amazon"}, "estimatedSalary": null, "jobDescription": " PepsiCo is one of the world's largest food and beverage companies. The company employs approximately 290,000 people worldwide, and its products are sold in over 200 countries. Its principal businesses include: Frito-Lay snacks, Pepsi-Cola beverages, Gatorade sports drinks, Tropicana juices and Quaker foods. The PepsiCo portfolio includes 18 brands that each generates more than $1 billion in annual retail sales. Our Principal Scientist - Dips/Sauces will: Lead Dips / Salsa technical projects through exploration of ingredients, formulation, process technologies, and packaging interactionGain critical experiences across key Innovation, Productivity, and Stewardship projects to build knowledge base as company's subject matter expert and critical professional on Dips / Salsa platformExplore new ingredients, products, and processes leveraging internal development and external resources.Utilize experimental design and data interpretation tools to make technically sound recommendations.Develop, plan, conduct, and coordinate product development initiatives.Coordinate production at bench top, pilot plant, and manufacturing levels for shelf life, stability, sales samples, scale-up, and other needsInterpret data and communicate impact to the businessProvide trial and commercialization support to products at manufacturing facilitiesEffectively manage multiple projects (new, existing) and project types (Innovation, Productivity, and Brand Stewardship / Quality), develop work streams, define resource needs and drive alignment across R&D;Input, review, and finalize formula specifications and ingredient specificationsActively participate in marketing research programs including focus groups and other consumer research formats.Perform basic economic evaluations on ingredients, suppliers, and formulationsStay current on FDA regulations & other external factors to implement necessary changes & mitigate risksSupport talent development by providing guidance and oversight to less experienced developers and technicians.Represent R&D; on multi-functional business teamsInfluence others through strong communication & interpersonal skillsQualifications:M.S. or Ph.D degree in Food Science or Food Engineering field with 7+ years of experienceStrong knowledge in ingredient functionality & formulation chemistry, and demonstrated of product innovationExperience in dips or spreads (ie. salsa, cheese, dairy, bean) or high moisture product development and manufacturingExperience with vegetables (ie. tomatoes), dairy ingredient processing, and beans / legumes product development & scale-upExperience with thermal processing calculations & commercial sterilization technologies such as hot fill, retort, and asepticStrong working knowledge of experimental design & product development protocols (from concept to execution), including formulation, stability testing, product/package interaction, sensory and consumer testing methodology.Possess strong work ethic and ability to be a self-starterDemonstrated ability to function effectively in a dynamic and fast-paced environment as well as manage multiple projects simultaneouslyAdapts to change well with the personal leadership to influence and positively motivate self and peers.Outstanding teamwork and communication skillsStrong organization, documentation, and formula management skillsInterest & desire for long term technical career in Dips / Salsa platform and high moisture foods All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status.  PepsiCo is an Equal Opportunity Employer: Female / Minority / Disability / Protected Veteran / Sexual Orientation / Gender Identity  If you'd like more information about your EEO rights as an applicant under the law, please download the available EEO is the Law & EEO is the Law Supplement documents. View PepsiCo EEO Policy.  Please view our Pay Transparency Statement"}