{"jobID": "2831900030", "jobLocation": "Austin_TX", "jobTitle": "Master Data Management - Senior Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.darbyconsulting.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB DESCRIPTION Darby Consulting is looking for a Master Data Management Business Analyst to support the Texas Workforce Commission (TWC) in developing an enterprise data warehouse along with longer-term data governance strategies, plans and processes. TWC requires the Business Analyst to have solid experience in business process mapping, business process development and developing data governance and data quality plans. The Business Analyst will interface with IT management, project sponsors, project teams and technical resources, to document, analyze and communicate system changes and downstream impacts of these changes. The Business Analyst will be expected to work with both business and technical staff to assist TWC in developing a comprehensive data governance strategy, and master data management (MDM) and data quality initiatives within the enterprise.  This is a 1099 Independent Contract or W2 Hourly position with up to 100% (M-F) of the work to be performed at the client site in Austin, Tx. ABOUT DARBY CONSULTING If you've worked for a few consulting firms by now, you know there's a lot of \"great\" places to work. We've worked with many of them too. But, let's be honest: if everyone claims to be great, then great really is just the new average.  Our goal is to build an amazing place to work. That means designing and building a company that goes beyond average. We want amazing. For us, Amazing is the opportunity to join a growing company of highly talented and experienced professionals. It's about learning and working alongside great people who care as much about you and your success as they do about their clients. Amazing is about flexibility, work-life balance and opportunities to deliver solutions for respected companies who value our knowledge, skills and experience. WHAT WE DO Darby Consulting is a full-service IT consulting firm specializing in IT project management, systems design and deployment of software and hardware-related projects. Supporting clients in the energy, government and education sectors, Darby helps growing organizations to maximize the value from their IT projects by integrating experienced and specialized IT project professionals, success-based methodology and cloud-based project management tools at affordable rates for growing organizations. APPLICATION REQUIREMENTS To be considered for this role, you must complete the Skills Inventory Assessment in your profile with Darby Consulting. Applicants who do not complete the assessment will not be eligible for consideration. Application requirements include: You are authorized to work in the United States as a 1099 Independent Contractor or W2 Hourly employee (no Corp-to-Corp).You are able to work Monday to Friday, 8-5pm, at the client site in Austin, TX (no work from home).You are willing to accept a maximum pay rate between $70-80/hr.You are able to start within 1-3 weeks of offer.You are willing to authorize a criminal background check.You are able to provide up to 3 references."}