{"jobID": "2758301703", "jobLocation": "San_Jose_CA", "jobTitle": "SR Research Scientist - Speech Processing/Recognition", "companyRating": "3.0", "companyInfo": {"Website": "www.pearson.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1844", "Type": " Company - Public (PSO) ", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "168000", "jobDescription": "SR Research Scientist - Speech Processing/RecognitionDescription At Pearson , we’re committed to a world that’s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always reexamining the way people learn best, whether it’s one child in our own backyard or an education community across the globe.  We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology — and each other to surpass these boundaries — we create seeds of learning that become the catalyst for the world’s innovations, personal and global, large and small. Come check us out. What big idea will you help us launch?http://www.youtube.com/watch?v=MkyK4aaYzpc We are seeking a very talented, Senior Research Scientist in our R&D; team who has strong knowledge of and extensive experience in automated speech recognition (ASR) and speech processing with an understanding of Artificial Intelligence, Natural Language Processing, and/or Machine Learning. You will be part of the R&D; team responsible for a cutting-edge educational technology (EdTech) for language learning and assessment. You will focus on advancing the state of the company's automated grading technology while working with product management, test development, and sales & marketing teams to solve practical problems from the field and customers.  The position demands a person who has broad interests, is motivated to design and implement improvements to the company’s system, and is highly skilled in researching new innovative ways to contribute to the future of EdTech. Opportunities for further research in applicable areas are available.  Bring your expert research, software development and user modeling skills together to continue shaping Pearson’s advanced product solutions for the EdTech industry! And yes, have fun doing it with a highly innovative R&D; Team! Essential Responsibilities:Perform entire R&D; cycle (building language models, training acoustic models, building statistical models for measuring the performance, etc.) for new and existing products that use ASR and automated gradingDesign new algorithms for different purposes (such as improving the grading performance)Perform data analysis for different requirementsProactively research ways to apply latest methodologies to improve the automated grading system’s capability, reliability and accuracyMaintain grading systemQualificationsRequired experience will include:Ph.D. or ABD (with graduation in 2018) in CS, EE or relevant areas with 3-5 years working experienceStrong desire to integrate research with product development and augment your research abilities with solid programming in C/C and proficiency with SQL, Perl (or Python) and Matlab (or R)Skilled knowledge of speech recognition, probabilistic systems, statistical modelsStrong background in statistical modeling and machine learningDemonstrate a willingness to learn and apply a wide range of technologiesExperience with linguistic and statistical analysis of natural language would be highly desirableExperience in designing and running ASR experiments using HTK or KALDI or a plusStrong written and verbal communication skills Assessment Technology Engineering (ATE) is a leader in automated spoken and written assessments, which utilize natural language processing techniques, advanced statistical modeling and speech recognition technologies. The provider of brands such as Versant™ Tests and WriteToLearn™, APS develops formative, diagnostic and progress monitoring assessments and instructional tools for various domains including education, business, and government. For more see www.pearsonkt.com and http://www.pearsonassessments.com Pearson is an international media company with world-leading businesses in education, business information and consumer publishing. Pearson fuels the growing demand for effective education and high-quality information in the global knowledge economy, and share a common goal: to help people get on in their lives through education. For more information, visit www.pearson.com.  #LI-BJ  Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply. Primary Location: US-CA-San Jose Work Locations: US-CA-San Jose-303 Almaden 303 Almaden Boulevard Suite 500 San Jose 95110 Job: Professional Development Organization: Assessments School Employee Status: Regular Employee Job Type: Standard Shift: Day Job Job Posting: May 2, 2018 Job Unposting: Ongoing Schedule: Full-time Regular Req ID: 1806213  Pearson is an Equal Opportunity and Affirmative Action Employer and a member of E-Verify. All qualified applicants, including minorities, women, protected veterans, and individuals with disabilities are encouraged to apply."}