{"jobID": "2836205504", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Predictive Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "120000", "jobDescription": "What you’ll be doing...Cross-functional Team LeadershipLead a large cross-functional team to support the reduction of spend across various environments in the business in support of $10B target.Manage the analysis tied to evaluating Greenfield opportunities across the network footprint.Drive compliance across IOF space in regards to minimizing spend on deploying fiber to supporting transport.Develop and maintain annual models to support FTTP Build requirements and track monthly against entire FTTP build.Business IntelligenceMaintain visibility to the network usage with tie into overall capital and expense spend.Understand, Analyze, and track network spend against revenue enabled for various products.Use big data analytics to develop insight to network trends and gain understanding of market forces influencing trends.Measure actuals against predicted volumes/targets to further enhance models and improve predictability.Manage volume and network reporting requirements for Access, Edge and CORE.Build and maintain network KPIs; analyze progress and enablers to advance program targets.Ability to learn and understand new technologies (internally and externally driven) and its impact to Verizon (ie: 5G, MEC, SDN/NFV).Create detailed network scenarios that reflect the impact of proposed changes to CapEx / OpEx spend required to support proposed technology changes/assumptions.Executive ReportingProvide executive-level communication and recommendations on proposed plans / changes to plan and potential impact of such changes.Make business recommendations (e.g. cost-benefit, forecasting, experimental analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.Manage and analyze all video franchise opening requests for NT and Greenfields.Maintain fiber and transport build reporting across all demand points within the business.What we’re looking for... You'll need to have: Bachelor’s degree in Engineering or four or more years of work experience.Six or more years of relevant work experience. Even better if you have: MBA or other master’s degree.Master understanding of new technology and respective process changes to assist Executives with understanding the current capex/opex tied to future spend.Ability to produce & present senior leadership level presentations.Ability to understand and correlate Marketing trends into analysis, where appropriate.Familiarity with systems such as Peoplesoft, FUZE, Atoll, SiteTracker, NSAP, VSAP, CCP, vPlan, vBuild, FRR, PIMS, WFM.Preparation of internal management reports as a result of ad-hoc analysis requests.Experience with operations, engineering, design or planning in one or more of the following areas: Transport Networks: Unified Transport, Optical, Ethernet, Cell Site backhaul, long haul transport.Core Data Networks: SDN, OTNGN / COIN, MPLS, routing/switching, IPv6, LAN/WAN architecture, firewalls.Voice: Switching, tandems, peering, SS7, VoIP, SIP, SBC, NNI and gateway platforms.Video: VOD, video distribution router.Wireless: VCP, eNSE, MEC, 5G, RF planning, 4G LTE, IMS Core, RAN planning, SON.Core planning Computing: SDN, NFV / Virtualization, databases, capacity planning and performance testing.Knowledge of Data Center and/or Central Office infrastructure, UPS, cooling, and space/power planning.FTTP video, data and voice.Open mindset; willing to be challenged to solve new challenges.Ability to identify new solutions to technical and capital/expense challenges.High level of curiosity and investigative mindset with an attention to detail.Flexibility to adapt to new challenges to overcome short-term hurdles by staying focused on the team’s deliverables.Capacity for quickly learning and using widely available tools and methodologies.Network Planning Experience.2+ years of experience with business intelligence tools (Tableau, Alteryx, PowerPivot).Excellent business and technology acumen and extremely strong collaboration, influencing and presentation skills.High degree of technical and analytical capability, including the ability to analyze a large amount of data between and amongst various systems.Strong strategic skills with the ability to identify and assess key points, implications and recommendations.Computer proficiency including a thorough knowledge of the Microsoft Office applications.Strong project and process management skills and ability to manage multiple competing projects/priorities simultaneously.Strong verbal and written communication skills, including ability to distill complex issues quickly, effectively communicate strategies, and summarize key points/implications.Ability to translate data into Executive Presentations in an accurate, clear and concise manner including graphical displays.Proven ability to drive results, including data manipulation, data creation/interpretation, while working under tight deadlines.Experience programming/scripting/coding (SQL, Python, R) and knowledge of relational databases.Understanding of geospatial analysis and uses in finding business solutions.2+ years of experience with data warehousing technologies (e.g. Oracle, SAP, Teradata, MS SQL).Familiarity with Hadoop ecosystem and NoSQL database technologies (MongoDB, Cassandra).When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}