{"jobID": "2837890428", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.excell.com", "Headquarters": "Bellevue, WA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Kforce, TEKsystems, Robert Half"}, "estimatedSalary": "84000", "jobDescription": " Did you know that our employee benefits start on the first day of employment? Join eXcell and enjoy our generous, DayOne Benefits (SM)! Summary of the Data Engineer Position:Apply proven expertise and build high-performance, scalable data warehouse applicationSecurely source external data from numerous global partnersIntelligently design data models for optimal storage and retrievalDeploy inclusive data quality checks to ensure high quality of dataOptimize existing pipelines and implement new ones, maintenance of all domain-related data pipelinesMaintain ownership of the end-to-end data engineering component of the solutionCollaborate with the programs SMEs, data scientistsData Engineer will rotate on an On-Call shift as needed to support the team. * * * Local Candidates Only * * * Non-Local candidates will be rejected without consideration. Relocation assistance is not on offer. Qualifications:5+ years experience in data engineering, proven expertise of applying DWH / ETL best practicesProficiency in LAMP and the Big Data stack environments (Hadoop, MapReduce, Hive)Competence with relational databases (Oracle, MySQL, Vertica)Experience working with enterprise DE tools (Informatica) with ability to learn in-house DE toolsCoding and scripting experience with Python, Java, PHP, SQL, CLIBS / MS in Computer Science or a related technical field We will consider for employment all qualified applicants, including those with criminal histories, arrest, and conviction records in a manner consistent with the requirements of applicable state and local laws. This includes the City of Los Angeles Fair Chance Initiative for Hiring Ordinance as well as the San Francisco Fair Chance Ordinance.  W2 only, no Corp to Corp. We are unable to sponsor H1B visas at this time. **eXcell Supports Equal Employment Opportunity** eXcell, a division of CompuCom® Systems, Inc., a global company headquartered in Bellevue, Washington, provides IT staffing services and solutions to Fortune 1000 companies as well as small and medium business. For more information, visit www.excell.com."}