{"jobID": "2587144721", "jobLocation": "San_Francisco_CA", "jobTitle": "Rental Sales Agent", "companyRating": null, "companyInfo": {"Website": "www.sixt.jobs", "Headquarters": "Pullach i. Isartal, Germany", "Size": "5001 to 10000 employees", "Founded": " 2011", "Type": " Company - Public (SIX3) ", "Industry": " Travel & Tourism", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Enterprise, Avis Budget Group, Hertz"}, "estimatedSalary": null, "jobDescription": " Overview  Sixt rent a car is an international leader in car rental, leasing, and innovative mobility solutions like Drive Now or mydriver. With revenues in excess of $2 billion and a fleet of 220,000 cars, we have moved into over 100 different countries worldwide. Sixt is the largest fleet purchaser of BMWs internationally, however does not consider itself a luxury car rental company. Instead, Sixt is proud to be a company with superior service and better cars for everyone at an exceptional value.  At Sixt, customers are guests. It is not a rental transaction but an experience equivalent to that of a five star hotel. Sixt hires service and sales oriented individuals, free to travel, and open to cultural experiences interacting with customers and colleagues from many diverse backgrounds. Sixt is more than just cars. We have a passion for style, technology, innovation, creativity and entrepreneurial spirit. Position Summary: The Rental Sales Agent is responsible for optimizing the rental experience by selling extras based on the customer's needs, drafting rental agreements, and providing exceptional customer service. As a Rental Sales Agent you are entrusted with educating our customers on their buying options and serving them with the highest level of respect, professionalism and friendliness. You will be expected to become the expert on our fleet and ancillary products and enhance the customers' experience by providing expert recommendations. Rental Sales Agents will be incentivized and evaluated on predetermined service and sales goals and standards. We strive to meet our customers' needs and exceed their expectations on every opportunity. ResponsibilitiesCreate the optimal rental experience by maximizing on sales and service opportunities for every customerGreet customers professionally and prepare the rental agreementAdvise on and sell optional extras to the customer according to his/her needsAdvise as an expert on all vehicles in the Sixt fleet, all protection items, and all extrasMake expert recommendations and present every product to every customer every timeProvide excellent customer service in all customer contact situationsMeet all sales and service standardsMaintain cleanliness and order in the office areaHandle customer complaints with professionalism and confidenceComplete daily lists and report to the Supervisor and ManagerOther job duties as assigned to meet the business needsHandle all telephone and email inquiries in a friendly and helpful manner.QualificationsHigh school diploma or GED required, Associate’s or Bachelor’s degree preferredMinimum 1 year customer service or sales experienceExperience meeting sales quotas or working in highly commissioned positions preferredExceptional interpersonal and relationship building skills requiredAbility to follow defined service and sales processesDemonstrate strong verbal and written communication skillsStrong organizational skills and the ability to multi-taskMust be able to work a flexible schedule including day and/or evening hoursMust have the ability to manage stressful or unusual situations in order to maintain good customer serviceMust have basic computer navigation skills and knowledge of Microsoft Office ApplicationsMust be willing to wear company uniformsMust have a valid driver's license with a clean driving recordMust be at least 21 years oldMust be able to work 40 hours per weekMust be authorized to work in the United States and not require work authorization sponsorship by our company for this position now or in the futureAbility to communicate in other languages (Spanish, French, Portuguese, Hebrew, German, etc.) is a plus.Benefits: We value our employees' time and efforts. Our commitment to your success is enhanced by an extensive benefits package including paid vacation, medical, dental, vision and 401(k), STD, LTD, Basic Life and Supplemental Life benefits and future growth opportunities within the company. Compensation:Base plus CommissionDomestic and International professional growth opportunities.We are an Equal Opportunity Employer M/F/D/V. The information listed above is intended to describe the general nature and level of this position. Essential functions and responsibilities may change as business needs require. Your response to this advertisement may result in your consideration for employment with Sixt Rent a Car, LLC and its subsidiaries. Offers of employment will be made by Sixt rent a Car, LLC or any of its subsidiaries or brands. Come join our team! Apply now."}