{"jobID": "2837666322", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Director, Data Sciences & Analytics", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "147000", "jobDescription": " Johnson & Johnson is recruiting for a Director, Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Analytics team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. The primary location for this position is New Brunswick, NJ and may require up to 50% domestic and international travel. Consideration will be given to other areas in New Jersey, Pennsylvania, California, and Jacksonville, FL and may require domestic and international travel of up to 60%.  Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world.  With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen.  Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J&J; is proud to be an equal opportunity employer.  We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune Worlds Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson.  The Director, Data Sciences & Analytics is an important, integral part of the transformation within J&J; Enterprise Data Analytics team. The position is responsible for personally analyzing and/or leading a team of internal and external Data Science and Data Engineering resources to analyze commercial outcomes and improve them by optimizing marketing and sales levers of demand generation, (including pricing analytics, market mix modeling, trade promotions, revenue growth management, customer experience improvement, business development and other initiatives.). This individual will be responsible for personally developing and/or leading team members to develop analytical prototypes and scalable analytical solutions in the medical device and / or consumer healthcare space and will be a part of a dynamic and growing team. This role will bring a broad knowledge of existing data science algorithms and analytic creativity to invent and customize them when necessary, to help drive business results This individual will drive business impact by personally solving and/or helping team members solve unique problems through keen and creative mathematical analysis, continuous improvement methodologies and change management in a cross functional organization.  Key Responsibilities:  • Articulate analytics proposition to business stakeholders, and collaborate to identify use case opportunities.  • Support analytics design decisions by taking relevant inputs from business team and defining clear plan for analytics team; push analytics teams to confirm assumptions, extract relevant insights and to interpret the models and outputs.  • Partner end-to-end with business teams during use case delivery  • Identify and prioritize problems.  • Collect inputs from critical business stakeholders.  • Share insights and observations throughout the process.  • Communicate end results of use cases within the business.  • Set up appropriate tools to measure and capture business value of results.  • Lead communication of analytics use case outputs with executives, acting as a bridge between management and analytics specialists Guide analytics team to develop right visualizations for presenting results.  • Once data science use cases and POCs are delivered and confirmed, partner with technology team to industrialize analytics solutions and the data strategies required to deliver them as a business process (vs. a one-time use case) on an ongoing basis. Qualifications·  Masters in STEM or related discipline, e.g.  statistics, operations research, computer science, mathematics and 7 years of  relevant work experience in data engineering or related field (Data analyst or  Scientist), OR Ph.D. in STEM related field and 3 years of experience is  required. ·  Strong domain knowledge in application of data  science solutions to commercial business problems is required. ·  Experience with data modelling, design patterns,  building highly scalable and secured analytical solutions is required. ·  Commercial Analytics experience is preferred. ·  Strong demonstrated understanding of machine  learning methods and statistical packages as applied to data analysis within  open source scripting languages (e.g. R, Python) is required. ·  Proficiency in one or more programming languages  such as R, Python, HTML5, etc., and background in programming in C, C++, Java  preferred. ·  Significant exposure to optimization engines  (e.g. C-PLEX, Gurobi) is preferred. ·  Demonstrated experience in business applications  of distributed computing (e.g. MapReduce, HIVE, HADOOP) is strongly preferred. ·  Experience on ML algorithms on platforms like  MS-AZURE, AML is strongly preferred. ·  Experience in digital native company applying  real-time advanced machine learning analytics, artificial intelligences, and/or  natural language processing based methods throughout operational workflows is  required. ·  Strong willingness to learn new hard and soft  skills, and develop new professional capabilities. ·  Strong communication with experience in working  with senior management and cross functional teams is required. ·  Proven thought leadership on challenging  problems with examples of implementing innovative analytic solutions and  driving outstanding results is required. ·  Passionate outlook to the role and a strong  sense of ownership is required. ·  The primary location for this position is New  Brunswick, NJ and may require up to 50% domestic and international travel.  Consideration will be given to other areas in New Jersey, Pennsylvania,  California, and Jacksonville, FL and may require domestic and international  travel of up to 60%.Primary Location United States-New Jersey-New Brunswick Other Locations North America-United States-Pennsylvania, North America-United States-New Jersey, North America-United States-California, North America-United States-Florida-Jacksonville Organization Johnson & Johnson (6067) Job Function Info Technology Requisition ID00001D5U"}