{"jobID": "2613714997", "jobLocation": "Chicago_IL", "jobTitle": "Lead Operations Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.xpo.com", "Headquarters": "Greenwich, CT", "Size": "10000+ employees", "Founded": " 2011", "Type": " Company - Public (XPO) ", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " DHL Supply Chain, UPS, FedEx"}, "estimatedSalary": "119000", "jobDescription": " Lead Operations Research Scientist Requisition Id:  37424 Business Unit:  Corporate Location:Chicago, IL, US, 60601#job-location.job-location-inline {  display: inline;  }Logistics done differently. At XPO Logistics, we’re constantly looking for ways to improve, enhance, and adapt in an ever-changing marketplace. As the Lead Operations Research Scientist, you will play a pivotal role in the research and development of data products, drive better and faster decision-making across the company, and support the creation of a global data science competency. In this role, you will work with business stakeholders across the company to identify high-impact applications of analytics, formulate and iterate on solutions, and drive technical implementation and business adoption of these solutions. We want to put you in a position to positively affect XPO’s future through advice and counsel. Pay, benefits and more. We are eager to attract the best, so we offer competitive compensation and a generous benefits package, including full health insurance (medical, dental and vision), 401(k), life insurance, disability, and the opportunity to participate in a company incentive plan. What you’ll do on a typical day:Perform optimization and simulation modeling for decision support systems and internal operational efficienciesBuild and evaluate predictive and prescriptive decision models to be deployed in production systemsAssist with model go-lives by performing production data validations and score distribution analysis of models in productionApply data mining methodology in thorough analysis of model behaviorManage medium to large scope projects and work with other data scientists and data engineers within XPO to enable integration and deployment of analytics software and solutionsMentor and assist in developing growth opportunities for data scientistsWhat you need to succeed at XPO: At a minimum, you’ll need: Master’s degree in statistics, operations research, industrial engineering or related field4 years of data science research experience; extensive hands-on experience working with large, real-world dataExperience mentoring other data scientistsDemonstrably strong business orientationStrong programming and algorithm development skills as applied to working with large data sets It’d be great if you also have: PhD in statistics, operations research, industrial engineering or related field5 years of data science research experienceExperience working with optimization or simulation toolsBe part of something big. XPO provides cutting-edge supply chain solutions to the world's most successful companies, including Disney, Pepsi, L'Oréal, Toyota and many others. We’re the fastest-growing transportation company on the Fortune 500 list and we’re just getting started.  We are proud to be an Equal Opportunity/Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, sex, disability, veteran, or other protected status.  The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time-to-time, as needed.Nearest Major Market: Chicago"}