{"jobID": "2683117796", "jobLocation": "Detroit_MI", "jobTitle": "Construction Inspector", "companyRating": null, "companyInfo": {"Website": "www.b-l-n.com", "Headquarters": "Indianapolis, IN", "Size": "51 to 200 employees", "Founded": " 1945", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Construction InspectorBeam, Longest & Neff, LLC (BLN), is a leading provider of engineering, construction and technical services for public agencies and private sector companies around the United States. The Company offers a broad range of planning, engineering design, environmental, construction observation, program and construction management and a wide range of specialized technical services for the U.S. federal government, state and local government agencies. We provide services for transportation, bridges, site development, environmental services, water/wastewater engineering and right of way engineering and services.Description:Beam, Longest and Neff, LLC is seeking applicants for multiple Construction Inspector positions within our rapidly expanding Detroit, Michigan office. The primary duties of these positions will include inspection and documentation of MDOT construction and/or demolition projects.Tasks/Responsibilities will include:Daily inspection of contractors operations on construction or demolition projectsVerifying conformance with construction plans and other contract documentsGenerating detailed daily reports and other required documentationOverseeing maintaining traffic operations/traffic control devicesMonitoring soil erosion and sedimentation control devicesAssisting project management staff with identifying problems and developing viable solutionsQualifications:Previous MDOT or Local Agency construction inspection experience (all levels)Proficient with Microsoft Office software, including Outlook, Word, and Excel is requiredExperience with MDOT documentation requirements and Field Manager/FieldBook software is preferredCompletion of various MDOT construction and/or materials testing training/certification is preferredHighly organized and motivated, and able to work in a fast-paced environmentMust have a valid drivers license with good driving recordCommunicates effectively with other team membersBenefit Information: In exchange for bringing your skills to our team, we offer a very generous compensation package in addition to an array of benefits, including:Complete Medical, Prescription, Vision and Dental CoverageGenerous 401(K) Retirement PlanEmployer-Paid Short And Long-Term DisabilityCompany Paid Life InsuranceFlexible Spending AccountsPaid Time Off Program including Vacation and HolidaysEducation Assistance ProgramAn affirmative action participant EOE M/F/D/V"}