{"jobID": "2830354854", "jobLocation": "Herndon_VA", "jobTitle": "HawkEye 360 - Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.alliedminds.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Public", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview  This position may require exposure to information which is subject to US export control regulations, i.e. the International Traffic in Arms Regulations (ITAR) or the Export Administration Regulations (EAR). All applicants must be U.S. persons within the meaning of U.S. regulations.  An Opportunity to Invent and Innovate  HawkEye 360, a developer of space-based radio frequency (RF) mapping and analytics systems, is currently seeking a Senior Data Scientist who will be part of an important team that designs, implements, supports and utilizes a scalable analytics architecture and complementary analytic products. The team will aim to invent processing components within the analytics architecture to derive data products with commercial potential on topics ranging from behavior characterization and geospatial prediction to visual data representation. The analytics team will also take the lead integrating processed data and analytic products with systems developed by customers and partners.  The Senior Data Scientist will have the primary responsibility of conceiving and implementing analytic components able to leverage data unique to HawkEye 360 to solve critical customer problems. Analytic components may vary from deep convolutional neural networks and bayesian propagation networks to statistical anomaly detection. The Senior Data Scientist will play a role in creating visualizations for results.  Additionally, the Senior Data Scientist may contribute to the efforts of HawkEye 360's processing team, especially as it relates to implementing and analyzing geolocation algorithms. He/She would contribute as a member of the analytics team to the creation and maintenance of the software architecture used to deploy analytic components, as well as to the formation of requirements for this architecture as it evolves.  The Senior Data Scientist reports to the Director of Analytics and interfaces with directors and engineers on the signal processing and space systems teams. Responsibilities We'll Expect You To Derive and implement analytic components to predict or detect behaviors of interest; predict or determine spectrum usage patterns; develop profiles for RF-emitting actors, or to answer similar and related questions using statistical and machine learning methodsSelect features, build and optimize classifiers using machine learning techniquesExtend the company's data with third party sources of information when neededDevelop visualizations and other analytic end productsCoordinate with the signal processing team to develop shared interfaces and formats for supported datatypes, specify RF data processing requirements for analytic products and direct RF taskingConduct data mining using state-of-the-art methodsEnhance data collection procedures to include information that is relevant for building analytic systemsProcess, cleanse and verify the integrity of data used for analysisCreate automated anomaly detection systems and constant tracking of its performanceQualifications You'll Need to Have 8-15 years professional experience with data analytics or equivalent professional experience as a software developer for quantitative applicationsS. or higher in electrical and computer engineering, statistics, mathematics, physics or another quantitative field with relevant work in statistical modeling, machine learning or data analytics contributing to that degree. Particularly strong work experience may be deemed equivalent for candidates with alternative or lesser degreesExcellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.Demonstrated effective experience with computational statistical methods and modeling or machine learning using some combination of Python, C/C++ and JavaExperience with common data science toolkitsExperience blending analytic and simulation modeling approaches to problem-solvingExperience with data visualization tools, such as D3.js, GGplot, etc.Proficiency in using query languages such as SQL, Hive, and PigExperience with NoSQL databases, such as MongoDBGood applied statistics skills, such as distributions, statistical testing, regression etc.Good scripting and programming skillsData-oriented personality We'd Like to See Professional experience or experience in pursuit of a degree using open source libraries for computational machine learning (Keras, Theano, TensorFlow, Caffee, etc.) HawkEye 360, Inc. is committed to providing equal opportunity for all employees and applicants without regard to race, color, religion, sex, sexual preference/orientation, gender identity or expression, age, marital status, national origin, physical or mental disability, veteran status, or any other protected classification under applicable law."}