{"jobID": "2825688220", "jobLocation": "Princeton_NJ", "jobTitle": "Senior Manager Data Scientist (Machine Learning)", "companyRating": "3.6", "companyInfo": {"Website": "www.otsuka-us.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " Senior Manager Data Scientist with expertise in machine learning, artificial intelligence, statistical data analytics, and applications. Must have an excellent knowledge of advanced methods, and experience in applying those methods to a variety of applications. Must be agile to grow in new directions, work with a team of scientists and practitioners from different functional areas to solve problems in pharmaceuticals. Key Job ResponsibilitiesEstablish and implement end to end proof of concept for data analyses across functional areasCreate innovative methodologies for dataBuild proof of concept systemsEstablish strategic partnerships with technical leadership across functional areasPresenting to senior leadership as well external audienceDemonstrates the ability to create new and different solutions that align to real work problems and opportunitiesProficiency in computer programming with excellent software development skills using state-of-the-art technologies and languages (C++, Java, R, Python, and other scripting languages)Required3-5 years hands on experience in machine learningMaster’s Degree required and PhD strongly preferred in Computer Science, Statistics, or a related field with focus on data analysisCommand of principles of machine learning, statistical analysis, data mining algorithms, and mathematical modelingDemonstrated ability to use knowledge of recent techniques, and develop new methodologiesDemonstrated experience in applying Machine Learning to at least one of the areas: Computer Vision, Natural Language Analysis or text analysis, large data sets, and social network analysisExcellent software development skills, esp. in rapid prototypingEstablished publication recordExcellent communication skillsExperience in machine learning on large size data using MapReduce and Hadoop preferredExperience in health care data analytics preferredBackground in information security and privacy preferred Travel (approximately 15%) Disclaimer: This job description is intended to describe the general nature and level of the work being performed by the people assigned to this position. It is not intended to include every job duty and responsibility specific to the position. Otsuka reserves the right to amend and change responsibilities to meet business and organizational needs as necessary.  Otsuka Pharmaceutical Company is a global healthcare company with the corporate philosophy: “Otsuka-people creating new products for better health worldwide.” Otsuka researches, develops, manufactures and markets innovative products, with a focus on pharmaceutical products to meet unmet medical needs and nutraceutical products for the maintenance of everyday health.  In pharmaceuticals, Otsuka is a leader in the challenging area of mental health and also has research programs on several under-addressed diseases including tuberculosis, a significant global public health issue. These commitments illustrate how Otsuka is a “big venture” company at heart, applying a youthful spirit of creativity in everything it does.  Otsuka Pharmaceutical Company is a subsidiary of Otsuka Holdings Co., Ltd. headquartered in Tokyo, Japan. The Otsuka group of companies employed 45,000 people worldwide and had consolidated sales of approximately USD 11 billion (€ 9.9 billion) in 2016.  All Otsuka stories start by taking the road less travelled. Learn more about Otsuka Pharmaceutical Company on its global website at www.otsuka.co.jp/en. Learn more about Otsuka in the U.S. at www.otsuka-us.com."}