{"jobID": "2835286357", "jobLocation": "Chicago_IL", "jobTitle": "Sr Data Cleansing Analyst Developer with Alteryx", "companyRating": "4.5", "companyInfo": {"Website": "www.baergroup.com", "Headquarters": "Atlanta, GA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "The Baer Group is looking for Sr Data Cleansing Analyst Developer with Alteryx for a 2+ months contract located in Chicago- ILTitle: Sr Data Cleansing Analyst Developer with Alteryx Location: Chicago- IL Duration:2+ Months. Rate: Plus Expenses.  Required Skills:  Highly experienced Data Analyst /Developer with proven experience working with complex data mapping, extraction and data cleansing working with Alteryx and SQL tools. This resource will be working with a team extracting and cleansing logistics data from legacy data sources (Excel) that will be utilized for specific Visualizations developed in MS BI. Qualifications:Minimum of 5+ years of experience working with Data Analysis to include Data Visualization, Mapping, Data Mining.Proven experience working with Alteryx Designer tools to map/prepare/cleanse data as well as core SQL concepts.Additional experience working with MS BI desiredExposure to SCM logistics concepts related to freight movement/Railcar transport highly desiredMUST HAVE ALTERYX EXPERIENCE:Alteryx is a leader in data science and self-service analytics with a platform that can prep, blend, enrich, and analyze data, manage and deploy predictive .Knowledge of: Rail Car, SAN, Alteryx, Data Manipulation skillsCompany Overview: The Baer Group, an award-winning ERP staffing and consulting firm, has a solid track record of finding and providing the right candidates for each distinctly different staffing assignment. With its deep experience in enterprise applications from SAP and Oracle including ERP, Business Analytics and Cloud solutions plus extensive industry coverage, The Baer Group knows that ERP is a solution where generalists are not nearly as effective as specialists.  Today, The Baer Group has in excess of 160 consultants deployed in client projects. Over 85% are subsequently redeployed by clients. Better yet, over 90% complete all engagements assigned. You can trust our ability to successfully deliver on every engagement.- provided by Dice  Sr Data Cleansing Analyst Developer with Alteryx"}