{"jobID": "2697757951", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Food Scientist II", "companyRating": "4.2", "companyInfo": {"Website": "www.cps4jobs.com", "Headquarters": "Westchester, IL", "Size": "51 to 200 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Aerotek, Robert Half"}, "estimatedSalary": "65000", "jobDescription": "Job Description Food Scientist IIThis position independently leads product development projects from concept through commercialization for Bakery Ingredients and Pipeline Innovation. Responsible to develop and test formulas and processes for innovative new products, quality improvements and cost reductions. Position will be responsible for directing the technical work of junior team members. Creatively develops icings and glazes for cakes, donuts and other bakery products. Develops methods and procedures needed to improve the processing, storing, packaging, and distribution of company and customer specific manufactured products. This position provides expertise on ingredients and formulation and must be familiar with plant processes. Provides technical representation on cross functional teams to drive innovation programs and key customer projects forward.  *Conducts advanced experiments to create new and innovative food systems and consumer relevant products. Develops new ways to solve technical challenges  *Engages in complex research to develop new methods of processing or production  *Studies the effects of food additives and preservatives on finished products. Brings new thinking to solve problems. Navigates ambiguity and provides clear technical leadership  *Provides ongoing research for new and existing recipes to ensure product quality and cost effectiveness of all key ingredients  *Demonstrates leadership. Is an active functional leader who effectively collaborates cross functionally at all levels within company  *Supports effective decision making and drives projects forward through sound decision making. Skilled at creating contingency plans and understanding critical path project planning  *Gathers and leverages knowledge of our customers, consumers and competitors. Brings innovative ideas to support strategic plans and enables R&D; to apply this knowledge to assigned projects. Aware of key competitive trends across multiple focus areas  *Participates in the review of our performance versus competitors. Assists in creating marketplace insights and data analysis. Familiar with formal and informal sensory techniques  *Recognized as a subject matter expert who consults with junior scientists on their work providing coaching and mentoring to achieve their goals. Provides scientific expertise and information to team members to ensure the most accurate, up to date data is being disseminated  *Utilizes external relationships and knowledge to influence technical and business decisions**If you’d like to hear more about this opportunity and others we are currently working on, please contact Tamra Sanders at 815.756.1221 / [Click Here To Join].JO: 116.18TS #TJS Job Requirements Requirements:*BS/MS/PhD with 2+ years of relevant experience*A strong understanding of food science related to bakery products and ingredients, icings/glazes specifically*Ability to travel 25% of the time, with up to 50% travel in the first 6 months of service **If you’d like to hear more about this opportunity and others we are currently working on, please contact Tamra Sanders at 815.756.1221 / [Click Here To Join].JO: 116.18TS #TJS"}