{"jobID": "2805041793", "jobLocation": "San_Antonio_TX", "jobTitle": "Environmental Scientist/Engineer/Part-Time/On-Call/San Antonio or Houston, TX/RB", "companyRating": "3.4", "companyInfo": {"Website": "www.tetratech.com", "Headquarters": "Pasadena, CA", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (TTEK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " Environmental Scientist/Engineer  Part-Time/On-Call  Tetra Tech, Inc.  San Antonio, or Houston, TX  Tetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees16,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion dollar company with local, client-focused delivery in 400 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams.  We are seeking a Mid-Level Air Quality Environmental Scientist/Engineer position for our San Antonio and/or Houston, TX office location to assist in growing Tetra Tech's environmental business.  Essential duties and responsibilities include: Project management, technical report writing, data analysis and client interaction are regular requirements associated with this position. Periodically there are requirements to present project findings to a client and relevant stakeholders. Other duties and responsibilities are: Collect, analyze, and develop reports in support of environmental air permitting and compliance programs for federal, state, and local clients.Support clients in the Air Quality Program to include oAir Emissions Inventories  oTitle V compliance reviews  oGreenhouse Gas Inventories and reporting  oNSR, PSD, and Title V permitting.  oSupport other environmental protocols as required. Technical writing.Data review, option evaluation, applicability review, and recommendation of best results.Client interaction and presentation of options and results.Production of deliverables.Project management, technical report writing, data analysis and client interaction are regular requirements associated with this position. Periodically there are requirements to present project findings to a client and relevant stakeholders. A BS degree in Engineering, Geoscience, or Environmental Science with five to ten years of air permitting experience is required. Knowledge of Texas Air Quality rules and regulations. Experience in data collection, report writing, sampling, and investigation. Significant experience and knowledge of the Clean Air Act (CAA), air permitting and emission inventories. Knowledge of federal, state, and local regulations related to environmental issues in the state of Texas. Must have demonstrated ability in technical writing. Experience in environmental consulting or related experience preferred. Knowledge of federal and state environmental regulations preferred. Strong oral and written communication/interpersonal skills are a must. 40-hour OSHA HAZMAT training is preferred. Applicants should be fluent in the English language and possess excellent verbal and written communication skills. Applicant should possess excellent math skills. Applicant should possess computer spreadsheet, word processing, and document creation skills, excellent technical report writing, fact and research finding skills, and the ability to work in a team environment, as well as independently. Computer Skills must include Microsoft Windows Word and Excel.  For more information on our company, please visit our website at www.tetratech.com. To apply, please submit your resume and cover letter on the Careers portion of our website at www.tetratech.com/careers.  We thank all applicants for their interest; however only those selected for an interview will be contacted. Tetra Tech is committed to creating a diverse environment and is proud to be an Equal Opportunity Employer. We invite resumes from all interested parties including women, minorities, veterans and persons with disabilities.  Tetra Tech is a VEVRAA federal contractor and we request priority referral of veterans for available positions.  EOE AA M/F/Vet/Disability  No calls or agenciesSDL2017"}