{"jobID": "2783023255", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist - Entertainment and Media Industry Opportunity", "companyRating": "3.9", "companyInfo": {"Website": "www.21cf.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (FOX) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": "OVERVIEW OF THE COMPANYJOB DESCRIPTION The Customer Intelligence group at 20th Century Fox designs, builds and operates machine learning pipelines that analyze several data sources to explain and predict the dynamics of filmed entertainment, theatrical movie releases and home entertainment consumption.  We are looking for a resourceful and motivated individual to drive strategically important and visible machine learning projects with our internal and external technology partners in the areas of natural language analysis, social media analysis, and chatbot analysis.  The person in this role will be in charge of defining and managing overall program goals and key individual milestones; coordinating with key stakeholders; cleaning and transforming large quantities of continuously streaming data; applying ML models to the data; pushing ML insights to management dashboards and/or decision making tools; and implementing end-to-end, production-ready machine learning pipelines. Responsibilities: Develop data science tools to model customer behavior  Develop machine learning models to segment customer data  Develop machine learning pipelines to drive low-latency insights and decision making  Develop statistical models to identify underserved customers  Procure, discover and visualize data to drive insights  Prepare data for machine learning algorithms  Select and train models  Fine-tune models  Filter, map and reduce large amounts of data using distributed computing Education/Skills: PhD or Master in sciences, engineering or computer science  3+ years of experience as data scientist  Academic or practical experience working with data at scale  Experience with production machine learning pipelines  Experience with big data paradigms (map-reduce, lazy-evaluation, in-memory storage, immutability, etc)  Experience with classifiers, regression, support vector machines, decision trees, ensemble learning, and dimensionality reduction techniques  Experience with neural network modeling using TensorFlow  Understand data ingestion, data cleaning, prototyping, bringing prototypes to production, product design, setting up and managing data infrastructure  Knowledge and Skills  Social Media APIs  NLP Libraries  NLP literature  Python, Jupyter, Scikit-learn  Spark, SparkML  We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, gender identity, disability, protected veteran status, or any other characteristic protected by law. We will consider for employment qualified applicants with criminal histories consistent with applicable law."}