{"jobID": "2318267728", "jobLocation": "Santa_Cruz_CA", "jobTitle": "Data Analyst, Customer Support", "companyRating": null, "companyInfo": {"Website": "www.looker.com", "Headquarters": "Santa Cruz, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Tableau Software, Chartio, Periscope Data"}, "estimatedSalary": null, "jobDescription": "WHO WE ARE Looker is on a mission to bring better insights and data-driven decisions to every business. Everything we do is aimed at making sure our customers love every aspect of Looker, from our products and technologies to our ease of doing business and our support. We are looking for curiously brilliant individuals to join our team as we reinvent data analytics. Get data driven and see yourself at Looker.WHAT WE'VE GOT GOING ON Looker is seeking a Support Analyst to provide phenomenal service to our customers - based out of our Santa Cruz, CA HQ. Our customer base is growing rapidly, and so must our capacity to meet their needs, answer their questions, and ensure maximum business value is derived from our unique product.The Customer Support Analyst is responsible for bringing Looker’s best practices, innovations and capabilities to our customers to deliver world class support, while also driving adoption, usage, engagement and delight. You will deliver technical leadership coupled with a deep understanding of business intelligence and data modeling, thus ensuring overall adoption and driving greater business value and satisfaction. This high-touch, rapport-building position requires strong communication skills and a desire to give our customers the personal attention that they need to have a fantastic experience with our product. WHAT WE NEED YOU TO DOCreate great experiences for our customers when they need help. Build trust and an advisory relationships with customers to help them better use the product.Act as the frontline of Customer Love, utilizing live chat and internal resources as your secret weapons to proactively resolve product issues and provide proactive guidance to deepen relationships and product usage.Learn Looker’s product at a deep level and help customers do the same. Learn what’s happening next with the product, and help customers prepare for the use of new features.Go beyond the question being asked; understand how our customers define their own success with the product and help them work toward that success.Proactively propose creative solutions to address customers’ business problems and goals.Be a voice for our customers during internal discussions and projects at Looker. Represent their needs and struggles to help drive our products in a strong direction.Monitor and identify trends in customer experiences. Work within the team and with other teams at Looker to give customers the information and tools they need to more effectively and efficiently support themselves in the use of the product.WHAT YOU BRING TO LOOKERA lot of the attributes mentioned above - these are keySome SQL savviness! Experience in a business setting is great, but new grads who have used/learned/taught themselves SQL will definitely be considered!An ability to navigate and advise on efforts related to complex customer requests or projects, gathering additional human resources for assistance if neededAn ability to learn quickly to understand and articulate new technologies and corresponding value propositionsA strong motivation to work closely with customers to create the best possible experiences with LookerAssertive, positive and effective communication skills – both written and oral – with considerable attention to detail and the ability to present and influenceA love of data and how companies can use their data to solve data access, usage, and visualization challengesDemonstrated problem-solving ability, particularly in complex technical situationsAbility to thrive in a dynamic, fast paced startup environmentFour year university BA/BS degree (or equivalent)A couple years of business experience (preferably in a SaaS customer success or data analysis role) is nice to have, but not requiredA LITTLE MORE ABOUT LOOKER Looker is a complete data platform that offers data analytics, exploration and insights to every function of a business and easily integrates into every departmental application to get data directly into the decision-making process. The company is powering data-driven cultures at more than 750 industry-leading and innovative companies such as Sony, Amazon, The Economist, Kohler, Etsy, Lyft and Kickstarter. The company is headquartered in Santa Cruz, California, with offices in San Francisco, New York, Dublin, and London. Investors include Kleiner Perkins Caufield & Byers, Meritech Capital Partners, Redpoint Ventures, First Round Capital, Sapphire Ventures, and PivotNorth. For more information, connect with us on LinkedIn, on Twitter, Facebook and YouTube or visit looker.com. "}