{"jobID": "2731052967", "jobLocation": "Troy_MI", "jobTitle": "Senior Manager, Automotive Data & Analytics", "companyRating": "3.1", "companyInfo": {"Website": "www.jdpower.com", "Headquarters": "Costa Mesa, CA", "Size": "501 to 1000 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Nielsen, TNS Global"}, "estimatedSalary": "108000", "jobDescription": "J.D. POWER Be where the voice of the consumer meets the value of the brand. At J.D. Power, you’ll be at the heart of commerce, working for a worldwide leader whose intelligence and insights are shaping the way people sell, and the way people buy. Title: Senior Manager, PIN Consulting Location: Troy, Michigan Reports to: Senior Director, PIN Consulting The Role: As part of J.D. Power’s Power Information Network (PIN) Automotive Consulting team, your primary focus will be supporting our global automotive clients in optimizing their pricing and go-to-market strategies by leveraging our proprietary data sets and predictive modeling. J.D. Power’s PIN data sets, containing contains millions of data points of annual vehicle purchase transactions, along with our proprietary predictive analytics, that we use to understand the dynamics of the automotive industry. You will work directly with clients in our recurring engagements to optimize multi-billion dollar budgets, specifically in the areas of demand planning, market sizing, pricing and profitability, and promotion/incentives strategies. Our engagements also cover distribution, inventory optimization, remarketing and financial services in the very exciting, dynamic and complex automotive industry. The Career Opportunity: This role will use your analytical, business, and client-facing communication skills, while leveraging your knowledge of the automotive industry. You will also have the opportunity to pursue new business development opportunities enabling your career growth within the PIN Automotive Consulting team. Responsibilities:Provide in depth analysis and consulting to automotive clients. (Hypothesize what is happening; utilize data to prove or disprove the hypothesis; present data and findings)Evaluate and analyze the automotive marketplace to identify risks and opportunities for clientsPresent team members and clients with analysis supporting decisions related to sales, pricing, and marketing strategyProactively assist in determining client needs and help develop new analytical solutions to satisfy those needsQualifications:BA/BS degree in Business related field: Economics, Statistics, Engineering, Accounting, Business Administration, Computer Science etc. required [Masters / MBA highly desirable]5 -7 years of relevant experience*Knowledge of and interest in the automotive industry highly preferred, experience with consumer products or with management consulting firms also preferredOutstanding communication skills (written and oral) with ability to think quickly on feetOutstanding analytical/problem solving and data analysis skills (ability to see the story through the data)Strong proficiency in Excel (ability to work with large, complex and dynamic datasets) and PowerPoint as well as balance of Microsoft Office SuiteAbility to interact effectively with people including senior management both within clients and internally at J.D. Power Thrives on tackling difficult problems in a dynamic and fast-paced environment.  * A combination of an advanced degree and corporate work experience, or analytical extracurricular / entrepreneurial activities and corporate work experience, will also be considered. Who We Are Since 1968, companies around the world have trusted J.D. Power to generate and gather the consumer insights that illuminate and inform business success. At J.D. Power we amplify the voice of the consumer, and help brands improve the value of their products and services. Together, these principles empower everyone in the global commerce ecosystem, enabling better purchase decisions – and better business results. Beyond our proven process, J.D. Power’s strength is its people. They offer diverse disciplines, talents, and expertise, but share one common goal: to generate growth and long-term value for our clients. Our scientists, Ph.D. level statisticians and methodologists, ensure our research meets the highest scientific quality standards and provides advanced statistical support. J.D. Power represents the science of customer satisfaction in any language, to consumers and businesses worldwide. "}