{"jobID": "2497905080", "jobLocation": "Washington_DC", "jobTitle": "Configuration/Data Management Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We are seeking motivated, career and customer oriented Configuration/Data Management Analysts interested in joining our team in the Washington, DC metro area and exploring an exciting and challenging career with Unisys Federal Systems.  In this role you will deliver world class solutions to Unisys’ customer. You will leverage your experience to drive high efficiency, quality, and completeness of all customer work products. Duties/Tasks and ResponsibilitiesResponsible for the effective development and implementation of programs to ensure that all information systems products and services meet minimum company standards and end-user requirements.Administers the change control process for zero defects software development. Responsible for configuration management of requirements, design, and code.Evaluates and selects configuration management tools and standards.Prepares configuration management plans and procedures.Administers problem management process including monitoring and reporting on problem resolution.Ensures adequate product testing prior to implementation. Coordinates with users and systems development personnel on releases of software.Verifies the completeness and accuracy of release libraries before implementation and ensures that correct versions of programs are included in specified releases.Makes recommendations to superiors regarding the acquisition and/or implementation of software to increase information systems efficiency, configuration management activities including product identification, change control, status accounting, operation of the program support library, and development and monitoring of equipment/system acceptance plans.Operates and manages program support library.Monitors library structure and procedures to assure system integrity, including procedures for collection, release, production, test, and emergency libraries and the movement/migration of components between libraries.Monitors end-item acceptance plans.Analyzes and evaluates major system project requirements of considerable complexity requiring a thorough understanding of all parameters affecting and interfacing with the system.Position Requirements: U.S. CITIZENSHIP REQUIRED  Minimum ability to obtain public trust clearance, Secret or higher clearance a plus  Bachelor’s degree and a minimum of 8 years of relevant experience  Relevant certifications, such as ITIL are a plus  Must have demonstrated capability for oral and written communications  Solves complex problems; takes a new perspective using existing solutions  Works independently; receives minimal guidance  Acts as a resource for colleagues with less experience  Do you have what it takes to be mission critical?  We are always looking for team members that have what it takes to be mission critical. At Unisys Federal Systems, our team supports the Federal Government in their mission to protect and defend our nation, and transform the way government agencies manage information and improve responsiveness to their customers.  Our team members gain valuable career-enhancing experience as we support the design, development, testing, implementation, training, and maintenance of our federal government’s critical systems.  Apply today to become mission critical and help our nation meet the growing need for IT security, improved infrastructure, big data, and advanced analytics. Unisys is a global information technology company that solves complex IT challenges at the intersection of modern and mission critical. We work with many of the world's largest companies and government organizations to secure and keep their mission-critical operations running at peak performance; streamline and transform their data centers; enhance support to their end users and constituents; and modernize their enterprise applications. We do this while protecting and building on their legacy IT investments. Our offerings include outsourcing and managed services, systems integration and consulting services, high-end server technology, cybersecurity and cloud management software, and maintenance and support services. Unisys has more than 23,000 employees serving clients around the world.  Unisys offers a very competitive benefits package including health insurance coverage from first day of employment, a 401k with an immediately vested company match, vacation and educational benefits. To learn more about Unisys visit us at www.Unisys.com. Unisys is an Equal Opportunity Employer (EOE) - Minorities, Females, Disabled Persons, and Veterans.  #FED#"}