{"jobID": "2832363977", "jobLocation": "Ridge_NJ", "jobTitle": "Scientist Pharmacovigilance", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Join a Legacy of Innovation 110 Years and Counting! Daiichi Sankyo, Inc. is the U.S. subsidiary of Daiichi Sankyo, Co., Ltd. The Company currently markets therapies in hypertension, dyslipidemia, diabetes, acute coronary syndrome, thrombotic disorders, stroke risk reduction, opioid-induced constipation, IV iron therapy and metastatic melanoma. Job Summary This position is responsible for processing, evaluating, and submitting adverse event reports in accordance to DSI policy and regulatory authority requirements. This position includes the assignments of bulk reporting and back up for the triage function. This position may also include serving as PV Representative on study teams and compilation of the SAE section for the IND report. This level interacts within CSPV for the majority of the time, which includes interactions with other DSPD sites and giving ICSR notifications to partners. This position is expected to handle ICSR issues in accordance with SOPs, SOIs, and experience and escalate more complex problems to Level III. ResponsibilitiesCase Processing: Adverse event case processing for clinical and spontaneous cases, including case data collection and entry into the global safety database. Entry includes medical history, laboratory data, and concomitant and co-suspect drug products. Includes the review and evaluation of event(s) to determine seriousness criteria and listedness according to DSI product information. Requires knowledge and use of MedDRA and WHO-Drug dictionaries for coding of adverse events, medical history, lab data and co-suspect and concomitant medications. Ensures case details are complete, initiates follow up on reports as needed, and prepares adverse event reports, including Analysis of Similar Events (AOSE) as applicable. Performs review of cases entered by vendors. Is responsible for timely submission of adverse event reports to regulatory authorities, global DSI sites and partners during ICSR preparation and bulk reporting assignments.PV Representative on Study Teams: May be assigned as the PV Representative on Phase 1-3 study teams. Role includes attendance at study team meetings, query oversight and SAE reconciliation as applicable.Aggregate Reports: May compile the SAE section for IND report. This includes working with Data Coordination to prepare the summary of most frequent adverse events and serious adverse events for both IND and non-IND studies occurring during the relevant reporting period.Case Processing Policies and Procedures: Participates in development of process guides which are used to ensure consistency and compliance in case processing and adherence to regulatory guidelines.Qualifications Education and Experience Bachelor's degree in nursing, pharmacy, or healthcare related field with minimum of two (2) years of PV experience and knowledge of FDA regulations.CompetenciesDelivers high quality work, assesses individual and vendor/CRO work with minimal supervisionExecutes strategic plans within multiple projects and can prioritize in accordance with strategy.Competent in identifying and understanding issues independently and can contribute to remediation plansCompetent knowledge of pharmacology, clinical research and medical terminology, global data entry conventions and systems and procedures for application in daily work.Communicates effectively with team/project members using clear and effective verbal and written communication skillsEffectively manages own workload to meet multiple deadlines in a timely manner.Understands functional role and others' functional roles within the clinical trial process. Daiichi Sankyo, Inc., is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law. "}