{"jobID": "2832785435", "jobLocation": "The_Woodlands_TX", "jobTitle": "Materials Research Scientist (Enterprise Research) Greater Houston", "companyRating": "3.5", "companyInfo": {"Website": "www.bakerhughes.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1909", "Type": " Company - Public (BHI) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": "About Us: Baker Hughes, a GE company (NYSE:BHGE) is the world's first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain.  BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company deploys minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own.  With operations in over 120 countries, the company's global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.  Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com. Role Summary: Baker Hughes a GE company hasan opening for research scientist specializing in materials science. Candidatewill be based in the Greater Houston area. Essential Responsibilities:Supportthe development, operation, and maintenance of the materials integritylaboratory. Including procurement, installation, calibration ofequipment, drafting procedures to maintain high quality and safety standardsCandidateshould be comfortable among other things, in working independently and in team,project presentations, and travel to vendors and universitiesAssignmentscan be a significant portion of a larger projectMaybe the lead Scientist on smaller projects with some functional supervisionAssignmentsare broad in nature, requiring originality and ingenuityUsuallyworks with minimum supervision, conferring with superior on unusual mattersMaybe assisted by entry or junior or level personnelAssistsin project planning and reviewMayparticipate in customer interface with or without team leaderSelectsscientific techniques to solve problems and makes sound recommendationsAssessesresults for applicability, validity and conformance to specificationsHandlesspecial projects, as assignedQualifications/Requirements:Bachelor'sDegree in a Scientific discipline 6 yrs experience Master's Degree and 4 yrsexperience, or PhD and 2 yrs experienceUnderstandingof materials science, metallurgy, corrosion, structure-property relationships, mechanicaltesting and analytical characterizations.Experienceworking in laboratory environmentVersedin materials selection of alloys and corrosion failures in in oil&gas;,automotive, aerospace, marine or similar industriesGoodproblem solving skills with a drive for resultsGoodwritten and verbal skills in EnglishAbilityto build peer relationships as well as work independentlyMustbe action-oriented, ethical in value, and have a strong customer focusDesired Characteristics:M.S.orhigher degree in Material Science and some industry research experienceFamiliaritywith metallurgy of steel and corrosion resistant alloys, welding and corrosionscience.Familiaritywith corrosion testing and electrochemistry including solution chemistry, testdesign, and data analysisFamiliaritywith mechanical testing, fractography, thermal analysis techniques,compositional analysis, and microstructural analysis.Familiaritywith techniques used to analyze fundamental science in composition, fracture,strength, and ductility. Particular techniques include: optical microscopy,scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS), x-raydiffraction (XRD), statistical data analysis and fracture toughness measurementLocations: Greater Houston, TX area  Baker Hughes, a GE company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Learn more"}