{"jobID": "2799491235", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist, Path Forward Returnship", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "125000", "jobDescription": "Position DescriptionAt Walmart Labs were reinventing the worlds leading retail platform, leveraging our unique strengths to deliver the best customer experience wherever our customers shop. Imagine an environment where one line of code, one experiment, or one idea has the power to catapult an entire industry towards a smarter future. Better yet, imagine if that power could be yours, every day. Thats what we do at Walmart Labs.  Walmart Labs is partnering with Path Forward, a nonprofit organization on a mission to empower people whove been focused on caregiving transition back to the paid workforce. The Path Forward Return to Work program is a 16-week paid internship for experienced professionals, returning to the workforce after taking time off for caregiving. After completing the four-month program, qualified candidates will be considered for conversion to available full-time opportunities at Walmart.  If you are passionate about technology, have at least 5 years of professional experience and have been out of the paid workforce for at least 2 years to focus on caring for a child or other dependent, we welcome you to apply and join our team. We are excited to be part of the Path Forward program, because we appreciate the skills you can offer, the perspective you provide, and the contributions you will make. This program offers you a chance to revamp your skills, update your resume with new experience, and make connections with other women and men transitioning back to the workforce. Responsibilities include:Analyzing large data sets to develop custom models and algorithms to drive business solutions. Data Scientists work on project teams in order to provide analytical support to projects (for example, email targeting, business optimization, consumer recommendations) for Walmart eCommerce.Building large data sets from multiple sources in order to build algorithms for predicting future data characteristics. Those algorithms will be tested, validated, and applied to large data sets.Researching new trends in the industry and utilizing up-to-date technology (for example, HBase, MapReduce, LAPack, Gurobi) and analytical skills to support their assigned project.Conducting advanced statistical analysis to determine trends and significant data relationships.Researching new techniques and best practices within the industry.Working with cross-functional partners across the businessMinimum Qualifications• To be eligible for consideration for this returnship, you must have been out of the paid workforce for at least 2 years to focus on caring for a child or other dependentDegree in Statistics, Computer Science, Operations Research or related fields and 2+ years of related experienceKnowledge of quantitative analysis, machine learning, data miningGood problem-solving skillsExperience with at least one modern compiled programming language (C++, Java etc.) and one scripting language (Python, R etc.)Additional Preferred Qualifications• Experience with big data technology (Hadoop, Hive, Spark, Hbase etc.) and data processing pipelineExperience in Real-Time stack and Streaming technologies (example Kafka) a plusExperience in Anomaly/Outlier Detection techniquesCompany SummaryThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.Position SummaryAt Walmart Labs were reinventing the worlds leading retail platform, leveraging our unique strengths to deliver the best customer experience wherever our customers shop. Imagine an environment where one line of code, one experiment, or one idea has the power to catapult an entire industry towards a smarter future. Better yet, imagine if that power could be yours, every day. Thats what we do at Walmart Labs. Walmart Labs is partnering with Path Forward, a nonprofit organization on a mission to empower people whove been focused on caregiving transition back to the paid workforce. The Path Forward Return to Work program is a 16-week paid internship for experienced professionals, returning to the workforce after taking time off for caregiving. After completing the four-month program, qualified candidates will be considered for conversion to available full-time opportunities at Walmart.  If you are passionate about technology, have at least 5 years of professional experience and have been out of the paid workforce for at least 2 years to focus on caring for a child or other dependent, we welcome you to apply and join our team. We are excited to be part of the Path Forward program, because we appreciate the skills you can offer, the perspective you provide, and the contributions you will make. This program offers you a chance to revamp your skills, update your resume with new experience, and make connections with other women and men transitioning back to the workforce. Responsibilities include:Analyzing large data sets to develop custom models and algorithms to drive business solutions. Data Scientists work on project teams in order to provide analytical support to projects (for example, email targeting, business optimization, consumer recommendations) for Walmart eCommerce.Building large data sets from multiple sources in order to build algorithms for predicting future data characteristics. Those algorithms will be tested, validated, and applied to large data sets.Researching new trends in the industry and utilizing up-to-date technology (for example, HBase, MapReduce, LAPack, Gurobi) and analytical skills to support their assigned project.Conducting advanced statistical analysis to determine trends and significant data relationships.Researching new techniques and best practices within the industry.Working with cross-functional partners across the business"}