{"jobID": "2836047918", "jobLocation": "Jackson_MI", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.consumersenergy.com", "Headquarters": "Jackson, MI", "Size": "5001 to 10000 employees", "Founded": " 1910", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "Employer Name: Consumers Energy Company Position Title: Data Analyst Position Duties: Support various departments and teams within Consumers’ Operations to execute routine reports, generate “ad hoc” data sets for unique request and develop new and forward looking metrics. Develop project plans and teamwork assignments, directing and monitoring work efforts, identifying resource needs, and escalating associated risks, issues and change requests appropriately. Deliver analytic expertise to the organization. Analyze and forecast data and prepare a variety of reports in support of departments and teams. Perform strategic assessments in order to look for opportunities to help Customer Operations excel in its different organizations. Provide regulatory knowledge relating to energy production, strong business acumen, and quantitative modeling skills. Work in a matrix team environment to collaborate, negotiate and positively influence team members. Use Visual Basic for Applications, SQL, SAP Business Intelligence, SAP Business Objects, SAP Dashboards, MS Excel, Power Point, Access and other software tools for metrics and analysis of data. Worksite Location: One Energy Plaza, Jackson, MI 49201 Minimum Requirements: U.S. master’s or foreign equivalent degree in Information Technology or Business related field and Lean/Six Sigma certification. Must have at least one (1) year of experience improving business processes by performing business analytics and optimization and effectively mapping technology-to-business challenges. Mail Resume To: Consumers Energy Company  One Energy Plaza  Jackson, Michigan, 49201  ATTN: Pamela Hincka  Equal Opportunity Employer EOE.All qualified applicants will not be discriminated against and will receive consideration for employment without regard to protected veteran status, disability, race, color, religion, sex, sexual orientation, gender identity or national origin."}