{"jobID": "2817524907", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Analyst - Translational Molecular Pathology", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": "SUMMARY The primary purpose of the Senior Data Analyst position is to coordinate the development, utilization and maintains database(s) middleware and analysis applications at use in the TMP Immunoprofiling laboratory. Supervises data collection and reporting. Ensures relevant data is collected at designated stages, entered into appropriate database(s) and reported appropriately. Monitors assignments to assure distribution of workload and the assessment of collection efforts. Prepares specific reports and analysis to aid in decisions. JOB SPECIFIC COMPETENCIES Management and analysis of data Manage and analyze data collection and reporting.Ensures relevant data (clinical and research) is collected at designated stages, entered into appropriate database(s) and reported appropriately.Integrates data from multiple sources.Oversee quality of data entry efforts.Monitors assignments to assure distribution of workload and the assessment of collection efforts.Build queries and assists in providing end user support for analyzing data.Plan and process analysis of research data in collaboration with laboratory personnel.Perform exploratory data analysis, descriptive statistics, univariate and multivariate analysis, regression, survival analysis and longitudinal data analysis in collaboration with the Primary Investigator.Collaborate with immunoprofiling team and across department scientific teams. Protocol and Research Management Prepares specific protocol reports and analysis to aid decisions regarding therapeutic efficacy and to assist in manuscript preparation and submissions.Develop and implement plans to meet requirements of new studies/protocols.Evaluate new protocols.Plan and lead team meetings at which protocol activity and progress, resource allocations and productivity benchmarks are reviewed.Ensure protocols meet laboratory, specimen and processing requirements.Serve as primary contact with institutional, state, federal, national and industry sponsoring agencies for regulatory, compliance, funding and collaborative clinical research matters.Develop and manage study databases. Quality Assurance Conducts quality assurance reviews of research processes and data.Develops and manages computerized databases appropriate to the design of various research studies.Develops and maintains systems for the coding, editing and computer entry of data for assigned research studies.Adapts, implements and maintains acquired database software most appropriate for the needs of various research studies.Develop, implement and oversee research data management processes.Develop, execute and oversee control of the data management portion of research studies.Plan and manage complex coding and collection of research data.Collect and enter data on case report forms.Plan and manage complex coding and collection of research data.Manage oversight of quality control and quality assurance for studies.Manage and program proper communication linkages between additional database systems.Assists with descriptive and exploratory statistical analysesEnsure validity and integrity of data. Research Project Management Oversee planning, organization, implementation and execution of research projects.Manages and supervises daily administrative, operational, research activities collaborating and communicating with faculty, administration and research staff.Plan, direct, assign and monitor team workflow, activities and productivity to ensure fulfillment of research goals.Directly manages research and clinical studies coordinators.Coordinates the flow of study specimens with research laboratory staff. Data Generation & Reporting Compile and prepare research data results for manuscripts and presentations.Generates reports on data collected to Primary Investigator and sponsoring agencies. Assist with dissemination of results and analyses. Present findings of the research project to professional groupsPrepare scientific data and documents for publication Other duties as assigned  Bachelor's degree in Biology, Healthcare or related field. Five years of related experience. With preferred degree, three years of related experience required. It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.htmlSDL2017"}