{"jobID": "2761515591", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Software Engineer (Fullstack)", "companyRating": "3.9", "companyInfo": {"Website": "www.onemedical.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "159000", "jobDescription": "About Us At One Medical we are passionate about revolutionizing the primary care industry by offering a new approach to primary care. We combine people-centered design, technology, and a team of talented health care providers to give our members an amazing experience.  One Medical is the fastest-growing primary care system in the country with over 70 locations nationwide in Boston, Chicago, Los Angeles, New York, Phoenix, Seattle, the San Francisco Bay Area, and Washington, DC. The Opportunity At One Medical we build that software that our members use and all the software that our doctors and nurses use to deliver great care. This enables us to build amazing end-to-end solutions to connect patients and our care team in new and innovative ways.  In our highly collaborative environment, not only will you be partnering with designers and product managers, youll also be sitting shoulder to shoulder with the doctors and nurses who deliver care daily to One Medical patients. You'll work throughout the technology stack and have responsibility for functionality our clinicians rely on every minute of the day. What you'll likely work on:Helping to design our technical architecture and to set technical directionMentoring team members and sharing experience and learningsBreaking our applications up into multiple servicesEngaging members in taking a more active role in their own healthIntegrate medical data and make it easier for doctors to access information from before a patient joined One MedicalAllow patients to automatically report stats so they and their doctor can track progressVisualize data so doctors can quickly understand a patients medical historyEngage patients and learn how we can better serve their needsYou areAn owner of everything you do. You take pride in building and delivering elegant code.A collaborative thinker. You enjoy working closely with all your coworkers -- both technical and clinical -- and discussing technical designs and trade-offs with your teammates.Thoughtful achiever. You strive to craft the complete product. You think through everything you build, from architecture and design to code and testing. You value scalability, maintainability, and security.Seeking to do something bigger than just another job. You want to apply your skills to a cause that you care about while working with a talented and fun team.Youll be set up for success if you have:Solid Object Oriented design and implementation skillsRuby on Rails and Angular experience preferredAbility to write highly performant codeExperience with Microservice ArchitecturesKnowledge of security best practicesExcellent communication skills to collaborate with partners across the organizationFamiliarity with Amazon Web Services (AWS)Understanding of relational databases such as MySQL or PostgresB.S. / M.S. in Computer Science, Electrical Engineering or related experienceBenefits: Top-notch Dental, Vision, and Health InsurancePTO, Paid Holidays, and Sabbatical at 5 and 10 years401K MatchCommuter BenefitsPaid Parental LeaveOne Medical Membership for you and your family This is a full-time role based in San Francisco, CA.  One Medical is an equal opportunity employer and encourages all applicants from every background and life experience."}