{"jobID": "2828607877", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist Full-Time | RM Dayton Analytics, Ltd. Co.", "companyRating": null, "companyInfo": {"Website": "www.rmdayton.com", "Headquarters": "Plano, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Description Title: Data Scientist  Location: Dallas, TX  Description: That’s my kind of job! I’d love to do it!  The candidate for this role requires an in-depth knowledge of advanced algorithms. Key Responsibilities: I really want to do that!Support the team in development and/or implement various types of predictive models, segmentation strategies, optimization algorithms, and data mining analyses with a targeted result of increasing revenue.Leverage state-of-the-art data processing tools and/or analytical methodologies to drive improved decisions.Conduct multi-channel analytics for online and integrated online/offline contexts.Desired Skills and Experience: Been there, done that!Experience creating models utilizing Machine Learning and/or StatisticsGreat intuition, curiosity and skepticism when analyzing dataExposure to the Hadoop Ecosystem tools (e.g Spark, MapReduce/Tez) or other big data technologiesExperience manipulating big and noisy datasets (e.q. SQL, Pig, Hive)Minimum of Bachelors of Science in Computer Science, Math or Scientific Computing; Data Analytics, Machine Learning. Typically requires 5-8 years experience or PhD or Masters in an approved field with 2-3 years experience.Support advanced analytics team in exploiting data in an effort to promote growth and business development via data algorithms.Experience in processing and performing multi-faceted analysis with customer/consumer behavior data.Experience in developing or enhancing machine learning and artificial intelligence algorithms using Python, R, C++, Java, Matlab.Experience in working with distributed computing i.e. Hive SQL, Pig, Java Map/Reduce, Apache Spark.Knowledge of descriptive analytics and data visualization.Exceptional standards for quality and strong attention to detail.Experience with full life-cycle agile application development in supporting analytic requirement.Ability to manage multiple projects and on-demand business requests simultaneously.Hands-on experience with the Hadoop stack (MapReduce, Python, Spark, Hive, Java, Pig, Flume, Hbase). RM Dayton Analytics, Ltd. Co. (www.rmdayton.com) is headquartered in Plano, TX (U.S.)."}