{"jobID": "2684611249", "jobLocation": "Royal_Oak_MI", "jobTitle": "Research Postdoctorl Scientist", "companyRating": null, "companyInfo": {"Website": "www.beaumont.ie", "Headquarters": "Dublin, Ireland", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Research Postdoctoral Scientist position is to enhance professional skills under the mentorship of a principal investigator/scientist/professor. The incumbent plans and conducts assigned and/or original research projects autonomously while working collaboratively with faculty, staff, post docs, and students. The Research Postdoctoral Scientist will work on numerous mass spectrometry based metabolomics projects investigating a variety of neurodegenerative diseases.Duties: •Conduct research involving LC-MS metabolomics, and apply these techniques to the study of human diseases.  •Perform metabolite analyses on biofluid and tissue specimens using accurate mass LC-Orbitrap-MS including sample preparation, data acquisition and data processing with commercial and in-house software.  •Perform metabolite analyses on biofluid and tissue specimens using commercially available kits (Biocrates) for in-house and fee for service studies using a Waters TQ-S coupled with an Acquity I-Class chromatography unit.  •Design, develop and refine experimental protocols to differentiate disease states from control groups.  •Operate, maintain and troubleshoot issues with liquid chromatography, mass spectrometers and auxiliary instruments.  •Present regular progress reports on research to members of the research group or to external audiences to disseminate and publicize research findings.  •Prepare, often in consultation with supervisor, material for publication in national and international journals and presentations at international conferences.  •Assist grant holder in the preparation of funding proposals and applications to external bodies.  •Carry out routine administrative tasks associated with the research project/s to ensure that project/s are completed on time and within budget. These might include organization of project meetings and documentation, financial control, risk assessment of research activities.  •Read academic papers, journals and textbooks to keep abreast of developments in own specialism and related disciplines.  •Plan for specific aspects of research programs. Timescales range from 1-6 months in advance and contribute to research group planning.  •Plan for the use of research resources, laboratories and workshops where appropriate.  •Plan own day-to day activity within framework of the agreed research program.  •Liaise with research colleagues and support staff on routine matters.  •Make internal and external contacts to develop knowledge and understanding and form relationships for future collaboration. Education / Training: PhD, MD or DO and basic laboratory research experience required. Work Experience: At least 3 years' experience of using and maintaining mass spectrometers. Understanding of the issues pertaining to LC-MS analysis of small molecule metabolites. Have experience using Biocrates based kits with Waters equipment. Capable of developing and optimizing chromatography methods for a range of metabolites/tissues, whether that is targeted or untargeted analyses. Other Qualifications: Ability to perform a variety of laboratory procedures. Scientific methodology, mathematical ability, technical writing skills, computer skills (word processing, presentation software, database management). Interpersonal skills. Strong organizational skills. Comfortable working with a range of biological specimens. Experience working with animal models. Ability to work seamlessly as part of a diverse and multidisciplinary team (scientists and physicians). Demonstrate a willingness to teach others in the lab/research institute. Ability to work autonomously. Ability to work effectively within an experimental team. Ability to meet deadlines. PreferredQualifications: Metabolomics research preferred. Neurodegenerative disease research preferred. Experience with 1H NMR metabolomics. Experience in applying LC-MS (Orbitrap-MS) to untargeted and targeted (Waters TQ-S) small molecule metabolite analysis. ACKNOWLEDGEMENT OF EMPLOYMENT UNDER RESEARCH GRANT"}