{"jobID": "2790402933", "jobLocation": "The_Woodlands_TX", "jobTitle": "Sr. Clinical Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.mckesson.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1833", "Type": " Company - Public (MCK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cardinal Health, AmerisourceBergen, UnitedHealth Group"}, "estimatedSalary": "104000", "jobDescription": " McKesson  is in the business of better health and we touch the lives of patients in  virtually every aspect of healthcare. At McKesson Specialty Health, our  products and services span the full continuum of specialty patient care. From  the initial phases of a product life cycle and the distribution of specialty  drugs, to fully integrated healthcare technology systems, practice management support,  and ultimately to patient care in the communities where they live, we empower  the community patient care delivery system by helping community practices  advance the science, technology and quality of care.  We have a  vision —that the long-term vibrancy of community care will be achieved through  the leadership of physicians committed to clinical excellence and innovation,  enabled by close collaboration with our organization and our deep clinical,  operational and technological expertise. Every single McKesson employee  contributes to our mission—by joining McKesson Specialty Health you act as a  catalyst in a chain of events that helps millions of people all over the globe.  You’ll collaborate on the products and solutions that help us carry out our  mission to improve lives and advance healthcare. Working here is your  opportunity to shape an industry that’s vital to us all.  Join our  team of leaders to begin a rewarding careerPosition DescriptionStimulating  and challenging position working with one of the largest collections of  clinical oncology data in the U.S.  High-performing team has an opening for a Senior Clinical Data Analyst  to provide a myriad of services and expertise.  Supports healthcare data initiatives by providing accurate and timely  data mining, data manipulation, data analysis, data visualization and  reporting, as well as, quality assurance and ongoing system and process  maintenance in collaboration with multiple teams. Responsible for obtaining data and producing  mock up, proto-type, and production reports from available sources. May also develop functional and/or technical  specifications. Validates data and  performs analysis as needed. Supports  and adheres to McKesson I-CARE values, to include the Code of Ethics and  Business Standards.Key Responsibilities:Collaborates  with multi-functional teams across the enterprise and within department to  develop solutions.Interacts,  as needed, with various customers to understand requirements of requested  reports and explain deliverables.Coordinates  the implementation of logic and business rules into several platforms.Writes  functional and technical specifications.Validates  business rules are implemented according to specification.Obtains  and analyzes raw data from multiple sources to perform core job duties and to  answer questions posed by internal / external customers.Develops  scripts to automate routine activities and reportsPerforms  duties to support data analysis and manipulation, reporting, and automation.Actively  participates and/or leads teams including delegating work, establishing  deadlines, and following up on assignmentsIdentifies  opportunities to create and manage processes, as well as, develop strategies to  address complex data analyses and reporting requirements.Interacts  with customers to clarify needs and in reviewing results. Obtains proper  approvals on each of the deliverables.Other  duties as requested or assigned.Competencies:Able  to learn quickly and independently: Uses  available resources to quickly learn new coding languages, processes, and  software to accomplish goals effectively and efficiently.Uses  Technical and Functional Experience:  Possesses up-to-date knowledge of analytical and information  technologies; is regarded an expert in the technical/functional area; accesses  and uses other expert resources when appropriate.Demonstrates  Adaptability: Thrives in a dynamic work  environment. Handles day-to-day work  challenges confidently; is willing and able to adjust to multiple demands and shifting  priorities; shows resilience; demonstrates flexibility.Uses  Sound Judgment: Makes timely, cost  effective and sound decisions; makes decisions under conditions of uncertainty.Collaboration: Able to gather and apply input from multiple  teams and/or individuals on deliverables.Shows  Work Commitment: Sets high standards of  performance; pursues aggressive goals and works efficiently to achieve them.Commits  to Quality: Emphasizes the need to  deliver quality products and/or services; defines standards for quality and  evaluated products, processes, and service against those standards; manages  quality; improves efficiencies.Excellent  communication skills: Able to  communicate clearly and concisely.Minimum Requirements2 years’  experience in clinical/healthcare field, computer applications, or data  analysis.Critical SkillsMinimum  Four (4) years of work experience in clinical data analysis and/or supporting  healthcare information systems.Experience  in mining clinical data, claims and/or EMR data preferred.Strong  data analyst skills required.SQL,  Excel, Relational Database understanding is required.Project  Mgt/Business Analyst skills required.Additional Knowledge & SkillsBachelors/Master’s  degree in Healthcare, Statistics, Computer science, or related fields  preferredHealthcare  experience preferred.Experience  working with Oncology EHR data preferred.Informatica  or other scheduling and ETL software experience preferred.Tableau  or other Business Intelligence & Data Visualization software experience  preferred.Education4-year  degree or equivalent experience.Physical RequirementsGeneral  Office DemandsBenefits & Company Statement McKesson believes superior performance – individual and team – that helps us drive innovations and solutions to promote better health should be recognized and rewarded. We provide a competitive compensation program to attract, retain and motivate a high-performance workforce, and it’s flexible enough to meet the different needs of our diverse employee population.  We are in the business of better health and we touch the lives of patients in virtually every aspect of healthcare. We partner with payers, hospitals, physician offices, pharmacies, pharmaceutical companies and others across the spectrum of care to build healthier organizations that deliver better care to patients in every setting.  But we can’t do it without you. Every single McKesson employee contributes to our mission—whatever your title, whatever your role, you act as a catalyst in a chain of events that helps millions of people all over the globe. Talented, compassionate people are the future of our company—and of healthcare. At McKesson, you’ll collaborate on the products and solutions that help us carry out our mission to improve lives and advance healthcare. Working here is your opportunity to shape an industry that’s vital to us all.  McKesson is an equal opportunity and affirmative action employer – minorities/females/veterans/persons with disabilities.  Qualified applicants will not be disqualified from consideration for employment based upon criminal history. Agency Statement No agencies please."}