{"jobID": "2834320934", "jobLocation": "San_Mateo_CA", "jobTitle": "Sr. Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.drawbridge.com", "Headquarters": "San Mateo, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Facebook, Google"}, "estimatedSalary": "120000", "jobDescription": "Identify opportunities to perform analysis that provide actionable insights to partner teams.Create and maintain automated reports and tools that empower others.Collaborate with cross functional teams to provide recommendations based on data driven insights.Effectively communicate data insights and methodology to a diverse set of stakeholders. Develop frameworks for analysis and build models to help solve complex problems for the business. What You Bring To The Table 2+ Years work experience doing analysis for a technology company.Experience with Hadoop Ecosystem and willingness to learn more (Hive, Spark, Presto ect.).Fluency in SQL. Experience with relational databases (Mysql,Vertica, Redshift ect.).Experience with BI Reporting & Visualization tools. Knowledge of Tableau a big plus.You have a deep understanding of statistics and interest in predictive modeling.You enjoy digging through data and discovering the right metric or graph that you could build a story around.You are a pro-active self starter with a willingness to learn and adjust in a fast-paced working environment. What's In It For You Contribute to a fast-paced, high-growth company that will challenge you, and which was recently featured in Forbes, Fortune, TechCrunch, and AdWeek.Have a huge impact in the hottest growth area in digital advertising.Get rewarded with competitive pay, benefits, and pre-IPO stock options.Work with fun, intelligent people in a great work environment.Enjoy gourmet coffee, free lunches, sweet & salty snacks, and keg.Medical (PPO and HMO options), dental, and vision coverage.Flexible Spending Account (FSA) benefit.Life and disability insurance.401K savings plan.Attractive vacation, sick, gym/health, and holiday benefits.An excellent work culture of fun, respectful, open minds, diversity, and teamwork. The Drawbridge \"X\" Factor  Sure we've got the usual requisite stuff like happy hours, brown-bag talks, free lunches, snacks, and more, but what sets Drawbridge apart is the authentic sense of community. We actually like hanging out together, whether we're working to move the company forward, or getting to know each other a little better in and out of the office. Our culture makes us excited to come to work, and we know that this strength helps us attract talented individuals who go above and beyond. If you're different, you'll fit.  As part of our dedication to the diversity of our workforce, Drawbridge is committed to Equal Employment Opportunity without regard to race, color, national origin, ethnicity, gender, protected veteran status, age, disability, sexual orientation, gender identity, or religion, or any other unlawful factor. Drawbridge complies with all applicable laws, including those regarding consideration of qualified applicants with criminal histories (such as the San Francisco Fair Chance Ordinance). We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our Drawbridge participates in E-Verify.  Note to Recruiters and Placement Agencies: Drawbridge does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Drawbridge employee. Drawbridge will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered the property of Drawbridge.SDL2017"}