{"jobID": "2823032568", "jobLocation": "Irvine_CA", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.ingrammicro.com", "Headquarters": "Irvine, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Copaco, Tech Data, COMPAREX"}, "estimatedSalary": "74000", "jobDescription": " Ingram Micro helps businesses fully realize the promise of technology.TM No other company delivers the full spectrum of global technology and supply chain services to businesses around the world. Ingram Micro's global infrastructure and deep expertise in technology solutions, supply chain, cloud and mobility enable its business partners to operate efficiently and successfully in the markets they serve. Combined with distinct market insights and the trust and dependability generated from decades of strong partner relationships, Ingram Micro stands apart as the global technology services provider for the future. Responsibility: Responsible for data gathering, writing queries and running reports for supervisor or others in the department. Check reports for correctness of data. Perform moderate to complex analysis of reports and interpret the data for others. Explain variances. Make recommendations. Research and resolve moderate to complex query writing and report running problems. This position also supports day to day operations and projects, ensuring programs adhere to all federal export control laws and regulations. Reporting, Performance Metrics and Analysis:Run daily reporting, maintain trend files for compliance KPIs, performance metrics.Assist in establishing, implementing and continuously improving global/regional metrics to streamline and track functional processes.Assist in developing and providing data analytics to support trade compliance and business needs.Complete analysis on large series of data using data base management tools Assist in creating and developing project plans. Manage Daily Operations and Compliance ProjectsSupporting Actions:Order Management and Screening Process.Support import/export activities and compliance initiatives of all regulatory requirements.Perform RPL/SPL screening in various ERP systems, release or escalate orders for further review.Follow screening guide lines and adhere to cutoff schedule.Constantly monitor ERP systems for order holds, identify hold reasons and resolve as quickly as possible.Notify appropriate business units with order status and action.Monitor and follow up until order can be released.Review and release export shipments in various ERP systems ensuring compliance with US export regulations and requirements.Assist in the development of business procedures for Export Operations.Assist in the development, maintenance and monitoring of Export Order Management processes and procedures, desktop instructions, and training materials.Assist in Supporting Global Trade Compliance System Development, Implementation, and Maintenance.Understand the order process flow and how systems tie in with the export regulatory requirement.Assist manager in testing system enhancement and fixes in various ERP or WMS.Assist in creating test scenarios/ test data and completing the test scripts.Support implementation of various Trade related programs.Identifies and explores opportunities for improvement within functional assignmentsJOB QUALIFICATIONS AND EDUCATIONAL REQUIREMENTS Education: Bachelor's degree  Experience: One to three years' general business experience. Previous analytical experience required.  Excellent interpersonal, verbal and written communication skills  A moderate to complex level of knowledge of the MS office Suite, including:  MS Excel writing macros, developing formulas, using functions such as pivot and lookup tables  MS Access multi-table queries, report generation, macros, forms (preferred)  General knowledge in MS Outlook, Word, Power Point.  Working knowledge with Magellan or other Business Intelligence software, creating queries and report generation is a plus  Familiarity with ERP system such as SAP/GTS, or other Trade Compliance systems and tools is a plus.  Ability to analyze and interpret statistical reports.  Time management, prioritization, and organizational skills; ability to prioritize among demanding and sometimes conflicting requirements.  Attention to detail and data integrity; with high level of diligence and professionalism  Occasional extended work hours may be required.  Ingram Micro Inc. is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran status, or any other protected category under applicable law."}