{"jobID": "2618029698", "jobLocation": "Washington_DC", "jobTitle": "Senior Science Test Developer", "companyRating": null, "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": null, "jobDescription": " The Assessment Program at AIR is a well regarded organization that is growing rapidly. We focus on providing our clients with customized assessments that not only measure student achievement against state standards, but also provide meaningful score reports that can help students, parents, and educators address any areas of student weakness. Our environment is fast-paced and requires people at all levels who are willing to roll up their sleeves to get the work done on time while maintaining high quality.  We are currently seeking a Senior Science Test Developer to join our team in the Washington, D.C. or Chicago, IL office.  A Senior Science Test Developer may be assigned to one of three different jobs within test development: (1) a senior member of a science content team, (2) a team leader or (3) an item development manager for a state assessment project. More information is provide below.  (1) Senior Member of a Science Team  The Senior Science Test Developer will function as an important role model and trainer within one of the science teams. They will be responsible for writing and reviewing items as well as training staff to understand the features of a quality item and work with them to improve the quality of their item writing and reviewing. Responsibilities include:Manage science test development activities for specific state assessment projects.Write test blueprints and item specificationsDesign plans for item pool development based on these blueprintsTrain internal Science staff and outside item writers to write high-quality items based on the states standards and benchmarksPerform senior content review for all project science items to ensure item qualityAssemble and do test specialist reviews on all operational and field test forms based on test blueprint and field test designProvide content expertise at standard settings and data review meetingsLead constructed response scoring activitiesLead content committee meetings, pool planning meetings, and form building meetings (2) Science Team Leader  Responsible for all aspects of managing a team of science test developers including performance monitoring, review, and feedback. The person who fills this position must be willing to troubleshoot, problem solve, and work alongside the rest of the team to get the job done well. Responsibilities include:Manage science staff and their use of approved AIR and Test Development processes and procedures on specific assessment projectsDevelop a cohesive science team that works together to achieve a quality product and meets all deadlines on an assessment projectServe as part of senior project team to develop, implement, and oversee a work plan that provides quality assurance and meets budgets and deadlines.Identify staffing needs, assign staff to project activities, and adjust these assignments as needed.Monitor staff attendance and performance on assigned workSet goals for staff and conduct performance reviews at required intervalsParticipate in the hiring of new science staff (3) Item Development Manager for a State Project  The Item Development Manager for a state project has the overall responsibility for managing all of the item development within a specific state project. This person will interact with clients, develop and monitor a strong team of Test Developers across content areas, and implement appropriate work plans to produce high quality tests that meet required specifications within deadline and budget. Responsibilities include:Interact with state client counterpart and bring up issues that need to be addressed and work toward the satisfactory resolution of these issuesWork with the client to determine yearly pool needs and constructed response scoring datesRespond to client requests as needed and include appropriate AIR staff to reach decisionsMasters degree in Science field or science education with at least 6 years of experience in the development of standardized assessments or a Ph.D. in a science related field and at least 4 years of experience in the development of standardized assessmentsAbility to identify problems and conceptualize solutionsAbility to prioritize tasks and meet deadlinesAbility to work collaboratively and manage staff and the test development processesKnowledge of the detection and correction of flaws in multiple choice and constructed response itemsExperience in the activities of blueprint and item specification development, pool development, item review, fairness review, constructed response scoring, and form developmentExperience in the use of either classical and IRT statistical models to interpret item level data and construct of test formsMust be comfortable with and interested in learning new technologiesExcellent communication skills with clients and colleaguesAbility to give and receive professional feedback Required travel for this position ranges from 4 to 10 weeks per year. Candidates should be able to travel as required for 2-3 days at a time, mostly in the June/July time frame. LI-DG1"}