{"jobID": "2831091073", "jobLocation": "Houston_TX", "jobTitle": "IT Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.marathonoil.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1887", "Type": " Company - Public (MRO) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Anadarko Petroleum, Devon Energy, Pioneer Natural Resources"}, "estimatedSalary": "120000", "jobDescription": "     JOB:Data ScientistJOB OVERVIEW This position is for a Data Scientist. The responsibilities include innovation, design, and support. This is principally a role for someone with strong statistical and data science background. Someone who can translate this knowledge into Analytical Models that will help optimize the business. The role requires a creative thinker who can propose innovative solutions by using data science approaches on existing sets of information and validate those findings by using an experimental and iterative approach.JOB RESPONSIBILITIESAnalysis, design, architecture, development and support various Data Science Tools and applications like R, RStudio, Python, Jupyter Notebooks, Anaconda, SAP PA, HANA PAL, etc.Work with key business partners to prioritize modeling initiatives, manage timeline expectations, and ensure that technical solutions meet business needs.Be capable of working in a big data environment, processing large volumes of data efficiently and using this data for Analytical Modeling.Support the design, development, rollout of analytical solutionsWork hand in hand with Data EngineersSupport custom solutions built using various technologies such as R, Scala, Python, SQLQUALIFICATIONS   Skills Required:Must have academic and work experience in the area of Statistics, Statistical and Analytical Modeling. Master degree or higher in Statistics, Data Science, Computer Science or a related discipline.4 – 5 years’ demonstrable experience in developing, building and implementing Analytical modelsDetailed demonstrable knowledge of data science tools and programming languages like R, Python, RStudio, Jupyter Notebooks, Anaconda, TensorFlow, SAP HANA PAL etc. Capable of completing projects with tools like R, RStudio, Python, and Anaconda.Detailed demonstrable knowledge of various Machine Learning libraries, and tools.Individual will possess deep statistical/data science background but should be also interested in learning about O&G; and applying the statistical background to O&G.;Be innovative, pushing the envelope, unafraid to fail and yet results oriented. Must be a self-starter, mature enough to work with a customer directly with minimal supervision. Should be capable of providing guidance and direction to the customer based on their statistical background and advising the customer to arrive at a feasible, optimal solution.Be capable of experimenting with upcoming technologies and provide guidance about which technologies are a good fit within the environment.Exposure to Big Data technologies, especially Hadoop, Cloudera distribution would be a plus.Knowledge of Hadoop tools like Hive, Pig, Impala, Sqoop, Spark is a plus.Experience in the O&G; industry a plus.   Degree Required: Masters Required Years’ Experience: 4+ years overall Knowledge Required: Must be proficient in multiple Development technologies Travel Require: minimal   REPORTING RELATIONSHIPS   Supervisor: IT Application Architect & Mobility Reports:        Marathon Oil Corporation (NYSE: MRO) is an independent oil and natural gas exploration and production company based in Houston, Texas. With a material position in four of the best oil-rich U.S. resource plays in different stages of development, we offer a variety of career opportunities, whether you're a recent college graduate or an experienced professional. You'll have the tools to develop and refine the skills and knowledge you need to succeed.Marathon Oil Company will take the necessary action to ensure that applicants are treated without regard to their race, color, religion, sex, age, disability, national origin, sexual orientation, genetic information, veteran status or other protected status under applicable employment law.If you are a current Marathon employee please use the ERP website to submit referrals.Posting Notes: || Houston || TX || United States (US) || Not Applicable; SF:DI; SF:GH; SF:LI; SF:MN; SF:RZ || Information Technology || Not Applicable || || 28141 ||           "}