{"jobID": "2802001917", "jobLocation": "Springfield_VA", "jobTitle": "Mid Level Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.knowledge-link.com", "Headquarters": "Herndon, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job LocationsUS-VA-Springfield  Time Well Spent Develop, design and organize research approaches for data collection and analysis.Administer quality control and process improvement activities, including data entry, data cleaning and data coding.Merge multiple datasets using advanced functions of Excel and other statistical applications.Develop queries and reports, extract data from PeopleSoft, Microsoft Access, Microsoft Excel, and SPSS, and analyze data using advanced statistical techniques.Design, conduct, analyze and report on quantitative and qualitative research.Display analyses results in text and visualizations to communicate results to customers.Support annual and ad hoc internal and external reporting requirements and prepare briefings and reports as needed. Qualified Candidate Bachelor's Degree with significant quantitative analytic focus.Minimum eight (8) years of experience and six (6) years of relevant experience in workforce/human capital analysis, business/finance/economics, operation research, and/or system engineering.Demonstrated experience in data collection and analysis. Exceptional Candidate Master degree with significant quantitative analytic focus.Proficiency with PeopleSoft, SPSS, Microsoft Access.Working knowledge of NGA organizations and mission.Working knowledge of Microsoft Project.Strong history/experience in customer-service, able to advise on tactical and strategic issues.Strong oral and written communication skills; demonstrated ability to develop written artifacts of the caliber to be consumed by working and senior audiences.Strong interpersonal skills; ability to work independently, and as a team member; ability to establish a network of contacts; ability to mentor and guide activities of other team members.Demonstrated ability to merge multiple workload and population datasets that involves use of advanced functions of Excel and other statistical applications.Demonstrated ability to conduct interviews, research, and data analysis to translate information into analytic results.Demonstrated proficiency in MS Office."}