{"jobID": "2814617686", "jobLocation": "Denison_TX", "jobTitle": "AEL (Adult Education & Literacy) Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.grayson.edu", "Headquarters": "Denison, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": " Job Information Job Opening ID 317 Location Denison - Sherman Work Experience 0 - 1 Year Job DescriptionRole:Analyzes  program participation. Compiles program data and reports statistics to the  state of Texas as required. This position is grant-funded.Essential  Functions & Responsibilities:Works with the program director and the data coordinator to determine and implement the various systems and procedures used to ensure that full and accurate program data is input in Texas Educating Adults Management System.Maintains and enrolls students in Distance Learning Programs.Builds AEL program detains including class sites and classes.Runs reports in TEAMS to determine student attendance, class rosters, and participant counts by funding sources.Creates custom reports from the TEAMS data to determine when students need progress assessments, sign in sheets to record attendance data, and funding source reports.Completes monthly data attendance audit.Maintains MS Access databases to facilitate ease of data analysis.Creates tutorials and staff training materials to update staff on data reporting requirements for TEAMS as they change.Other duties or special projects as assigned.Performance Measurements:Demonstrates Viking Values of balance, clarity, gratitude, service, teamwork, and trust.Completes timely and accurate work.Maintains an acceptable record of attendance.Attends professional development as required to meet program and state guidelines.Maintains current knowledge of all programs and systems required to complete daily work.Works effectively with co-workers to achieve departmental goals. Skill set Experience:  Up to six months of similar or related experience. Education: A Bachelor's degree. Interpersonal Skills: Courtesy, tact, and diplomacy are essential elements of the job. Work involves much personal contact with others inside and/or outside the college for purposes of giving or obtaining information, building relationships, or soliciting cooperation. Other Skills: Previous experience with Access databases preferred.  Ability to learn computer applications quickly to analyze data and complete job assignments. Physical Requirements: The work is typically sedentary. Work Environment: Work is typically performed in an office environment. Salary: Salary Grade 8 - Minimum starting salary $14.40/hourly. ADDITIONAL INSTRUCTIONS: To be considered for this position a Grayson College application, résumé or vitae, official transcripts and a list of three professional references must be submitted.  If your degree is from a country other than the United States, you must also include an evaluation from a NACES member evaluation agency indicating the U.S. equivalency of your degree.  For application information contact: Human Resources Department, Grayson College, 6101 Grayson Drive, Denison, TX 75020 or email jobs@grayson.edu. For questions, please call 903-463-8770. GRAYSON COLLEGE IS AN EQUAL OPPORTUNITY INSTITUTION PROVIDING EDUCATIONAL AND EMPLOYMENT OPPORTUNITIES ON THE BASIS OF MERIT AND WITHOUT DISCRIMINATION BECAUSE OF RACE, CREED, COLOR, RELIGION, GENDER, AGE, NATIONAL ORIGIN, OR DISABILITY. ADA/Section 504 and Title IX Coordinator, Director of Human Resources, 6101 Grayson Drive, Denison, TX 75020-(903) 463-8648.  This Job Description is not a complete statement of all duties and responsibilities comprising the position."}