{"jobID": "2821131458", "jobLocation": "Washington_DC", "jobTitle": "Requirements Analyst", "companyRating": null, "companyInfo": {"Website": "www.redgategrp.com", "Headquarters": "Chantilly, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION: Requirements Analyst LOCATION: 935 Pennsylvania Ave. NW Washington, D.C. 20535 DEPARTMENT: FBI CLEARANCE: Active TOP SECRET with Sensitive Compartmented Information (SCI) access BACKGROUND Executive Order (E.O.) 13587, Structural Reforms To Improve the Security of Classified Networks and the Responsible Sharing and Safeguarding of Classified Information - in conjunction with The White House Memorandum on National Insider Threat Policy and Minimum Standards for Executive Branch Insider Threat Programs - directs all executive branch departments and agencies that have access to classified information to implement an insider threat detection and prevention program.  In 2014, the Federal Bureau of Investigation (FBI) established the Insider Threat Center (InTC) to act as the central coordinating component for the FBI's Insider Threat Detection and Prevention Program. The InTC leverages the specific strengths of the existing Insider Threat components which are in place and supports the centralization of the technical, analysis and administrative personnel within the same component at FBIHQ. The InTC will identify new tools required for a robust Insider Threat Program, identify trends, and incorporate new data sets into analysis from various sources, working closely with internal administrative and investigative components to detect and deter insider threats. DUTIES AND RESPONSIBILITIES(NOTE: Your resume must reflect each of the duties under \"DUTIES AND RESPONSIBILITIES\") The Program Analyst will provide subject matter expertise relevant to implementing requirements management methodology, understanding and optimizing data, providing operational end-user support and providing strategic programmatic support. Contractor personnel supporting this task shall be responsible for providing requirements analysis support, including but not limited to: Identify and document all requests from stakeholders and outside entities;Assist in the management of, review and analysis of IT requirements for two FBI systems;Responsible for preparing and presenting IT documentation to an executive management audience (as needed to document systems operation, functional requirements, processes and methodologies);Translate and communicate complex technical documentation and subject matter between technical and non-technical audiences;Coordinate and facilitate meetings between IT personnel internal and external to InTC relating to IT and functional requirements;Prepare, produce and disseminate both scheduled and unscheduled products, including but not limited to: briefings, technical cost estimates, studies, memos);Perform short and long-range planning in support of existing and future requirements to enhance the systems;Provide support to the acquisition of data requirements for two FBI systems;Review software design, change specifications, and plans against contractual and/or process requirements;Document and maintain complex requirements using standardized requirements templates (traceability matrix, MS Project);Reviews and understand system test requirements, integrated testing activities and results;Conduct user-acceptance testing prior to full production deployments;Prioritize data and functional needs based on user and business management input regarding enterprise mission impacts and imperatives; andProduce final approval documentation for implementation of IT and functional requirements.QUALIFICATIONSActive TOP SECRET clearance with SCI eligibility at time of applicationExcellent communications and interpersonal skills;Proficiency with word processing and Microsoft Office applications;Ability to prioritize multiple projects simultaneously;Ability to schedule and coordinate meetings and schedules for executives and facilities;Ability to assist in preparation of presentations;Ability to coordinate communications for front office;4-year college degree and US citizenship is required.Minimum 5 years' experience in IT Requirements Management (development, review and analysis), System Development, System Management and/or IT Business Analysis; and. Experience with Intelligence-focused operation environment.PREFERRED QUALIFICATIONFBI experience"}