{"jobID": "2744628079", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist – Novel Hybrid Simulation Methods (Data + Principled approach)", "companyRating": "3.8", "companyInfo": {"Website": "www.siemens.com", "Headquarters": "Munich, Germany", "Size": "10000+ employees", "Founded": " 1843", "Type": " Company - Public (SIE) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " GE, ABB, Philips"}, "estimatedSalary": "102000", "jobDescription": "Division: Corporate Technology Business Unit: Corporate Technology Requisition Number: 225176 Primary Location: United States-New Jersey-Princeton Assignment Category: Full-time regular Experience Level: Entry level Education Required Level: Doctorate Degree Travel Required: 20% Division Description:For nearly 170 years, pioneering technologies and the business models developed from them have been the foundation of Siemens‘ success. Our central research and development unit, Corporate Technology (CT) plays an important role in this. Together with our global network of experts, we are a strategic partner to Siemens’ operative units and provide important services along the entire value chain – from research and development to production and quality assurance, as well as optimized business processes. Our support provided to the businesses in their research and development activities is ideally balanced with our own future-oriented research.  We at Corporate Technology are more than employees: We are actively helping to make people’s lives a little better every day. Would you like to be a part of that? Then join us. We offer you a high level of practical relevance as well as an opportunity to individually contribute your knowledge and your visions around the world. Whether you’re helping to develop products for the operating units or working in interdisciplinary projects for the business areas: At Corporate Technology you’ll be working in the heart of Siemens’ technological research together with the best.Job Description:We are currently seeking a Research Scientist – Novel Hybrid Simulation Methods (Data + Principled approach) for our Princeton, NJ location. The successful candidate will work with the Product Design, Modeling and Simulation Research Group (PSM RG) to develop solutions to the real-world problems. You will have the opportunity to test your knowledge in a challenging problem-solving environment. You will be encouraged to think out-of-the-box, innovate and find solutions to real-life problems. Our team has a strong publication record in leading journals and conferences What are my responsibilities?Conduct research activities focused on mathematical modeling and simulation of multi-physics problems, ranging from complex systems to 3D parts, with the goal of providing fast predictions.Research, design, and implement algorithms and techniques to exploit synergies between existing data and principled models.Advance the state-of-the-art in the field, including generating patents and publications in top journals and conferences.Working with customers to understand algorithm requirements and deliver high-quality solutions. What are the requirements?PhD required in Applied Mathematics, Mechanical Engineering, Aerospace Engineering or related discipline, and 3 years work experience.Knowledge in mathematical modeling and computational methods for simulations is a must, preferably in applications like computational fluid dynamics, computational electro-magnetics, computational mechanics, heat transfer, multi-physics and multi-scale simulations.Knowledge and applied experience in artificial intelligence, machine learning and deep learning tools is required.Very strong coding skills and ability to quickly prototype efficient algorithms in C++ are a must. Further experience in at least one of following: Python, R, WEKA, AmgX, cuBLAS, cuSOLVER, cuSPARSE, Pandas, Octave, Matlab, Java, JavaScript is required.Deep knowledge and practical expertise in at least one of the following topics is required: optimization, probabilistic reasoning, uncertainty quantification, inverse analysis, GPU computing, high performance computing.Familiarity with the usage and extensibility of commercial CAE packages like Siemens Simcenter (e.g. NX Nastran DMAP, StarCCM+ API, NXOpen) is a plus.Contribution to research communities and/or efforts, including publishing papers in impactful journals and relevant conferences.Outstanding written and verbal communication skills in English are required in combination with excellent analytical and interpersonal skills and can do attitude.Successful candidate must be able to work with controlled technology in accordance with US Export Control Law. US Export Control laws and applicable regulations govern the distribution of strategically important technology, services and information to foreign nationals and foreign countries. Siemens may require candidates under consideration for employment opportunities to submit information regarding citizenship status to allow the organization to comply with specific US Export Control laws and regulations. Additional information on the US Export Control laws & regulations can be found on http://www.bis.doc.gov/index.php/policy-guidance/deemed-exports/deemed-exports-faqs?view=category&id;=33#subcat34"}