{"jobID": "2703125931", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist (TS/SCI Required)", "companyRating": null, "companyInfo": {"Website": "www.federalhillconsulting.com", "Headquarters": "Falls Church, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Federal Hill Consulting is building a team of cleared professionals to support a large program in Reston, VA using cutting edge technologies. Come and join a winning team and support counter-terrorism efforts.The Data Scientist will develop and operationalize innovative Big Data software solutions in direct support of an unconventional warfare client. Perform as a data scientist, helping the team on a distributed scalable Big Data store, including Apache Accumulo, Apache Hadoop, MapReduce programming and technologies, and real-time data processing with Apache Spark. Participate in the development of machine learning, data mining, and statistical or graph-based algorithms designed to fuse and analyze massive data sets. Use expertise to ensure the proper implementation and usage of employed algorithms and bring in cutting-edge innovations from industry and academia. Leverage knowledge of requirements analysis, installation, integration, evaluation, enhancement, maintenance, testing, and diagnosis or resolution. Conduct software development, software integration, statistical analysis, modeling, and simulation all in a rapid DevOps environment. Sync across functional teams, ensuring data science is supporting mission-focused analytic teams and work with rapid prototyping teams on site to deploy new data science capabilities through existing toolsets.Basic Qualifications:  -3+ years of experience with high-level languages, including Java -2+ years of experience with distributed scalable Big Data storage, including Accumulo, Cloudbase, HBase, or Bigtable -Experience in MapReduce programming with Apache Hadoop, the Hadoop Distributed File System (HDFS), and processing large data stores -Experience with a real-time, large-scale data processing engine, including Apache Spark -Experience with using Agile software development methods in a DevOps environment -Experience with developing solutions and integrating and extending free and Open-source software (FOSS) or COTS products -Ability to exhibit flexibility, initiative, and innovation when dealing with ambiguous and fast-paced situations -TS/SCI clearance in JPAS -Minimum BA or BS degree. Graduate level degree preferred. Additional Qualifications:  -Experience in working with various intelligence disciplines, including GEOINT, HUMINT, MASINT, OSINT, and SIGINT and comprehension of the data and tools associated with these disciplines -Experience with intelligence or operations analysis in the DoD or intelligence community -Experience with deploying applications in a Cloud environment -Experience with designing and developing automated analytic software, techniques, and algorithms -Experience with open source software, including GeoWave and MapReduce Geo (MrGEO) -Security+ or CISSP and DoD 8570 Compliance Certifications Clearance: TS/SCI clearance in JPAS is required."}