{"jobID": "2818264560", "jobLocation": "Washington_DC", "jobTitle": "Business Data Analyst (SAS", "companyRating": "3.5", "companyInfo": {"Website": "www.camber.com", "Headquarters": "Huntsville, AL", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " Huntington Ingalls Industries - Technical Solutions Division, Integrated Mission Solutions Group (Camber Corporation) provides mission-critical engineering and technical service to Information Technology, Federal Civilian, and National Security, Aerospace & Defense and International government and commercial customers at over 100 locations worldwide.  HII-TSD, Integrated Mission Solutions Group (Camber Corporation) is currently seeking a Business Data Analyst (SAS) to work out of USPS Headquarters, L'Enfant Plaza, in Washington, DC.  The positions are a part of the United States Postal Service (USPS) business team. The business/data analyst will be responsible for extracting, consolidating, transforming and analyzing data from different systems and converting it into actions that help drive business directions. The business/data analyst must also demonstrate strong abilities to understand business processes and make correlations to the analyzed data, and have good communication skills to describe findings to decision makers at management/executive levels.  Duties and Responsibilities (to include but not be limited to the following): Extracting, consolidating, transforming, and analyzing systems data based on business rules either defined in the business process flows or based on verbal directionsConduct regression analysis to identify root causes of system issuesEvaluate outcome of certain system actions given certain system conditions using data stored in the systemsUse findings to draw conclusions and make recommendations (to included task, projects, actions), to address and resolve business/system issues and to help suggest process improvements and/or possible application changesConduct on-going business analysis of system activityThe successful candidate will demonstrate:The ability to understand and analyze various business challenges and provide recommendations based on data analysis and other forms of substantiationThe ability to identify, query and extract needed data to evaluate business challengesThe ability to identify trends, patterns and/or anomalies in the data and/or in how the application functionsA proactive approach to problem solvingAn ability to work independently and be self-motivatedProven experience working successfully with both business and IT usersGood communication skills to describe findings to decision makers in a clear and easy-to-understand way.Qualifications and Experience: Required- Minimum Education/Experience: Bachelor's degree or equivalent years of experience (focus in a technical field a plus, for example: engineering, mathematics, statistics, computer science or related field) plus at least five years of professional experience.Attention to detail, preciseness and accuracy with strong problem solving skillsStrong interpersonal and communication skills (both verbal & written) to easily communicate complex ideasProven analytical skills and experience identifying, extracting and working with complex and large amounts of dataGood analytical skills to identify patterns, trends and other findings and present conclusions based on dataAbility to translate complex application requirement concepts between business and technical personnelA challenging and inquiring mind a critical thinkerOracle experience to include knowledge of database query tools such as Toad, SQL Developer and/or SQLExperience with MS Word, Excel and PowerPoint Preferred 4+ years of IT experienceExperience developing Business Process MapsExperience working on client sites and interacting with customers frequentlyUnderstanding of Mail Industry, especially in Commercial MailAdvanced Analytical Software such as SASSecurity:All candidates will be subject to a pre-employment background investigation and drug screening per HII requirementsAll candidates must have the ability to obtain a USPS Sensitive clearance About Us  Camber Corporation is part of the Integrated Mission Solutions Group of HII's Technical Solutions division. Integrated Mission Solutions Group is a leading provider of Agile Software Engineering and Information Technology solutions; All Hazards services; Modeling, Simulation, and Training solutions and services; Unmanned Systems support; Intelligence Analysis and Operations; and Engineering and Management services to Department of Defense, Federal, and commercial customers.  Integrated Mission Solutions Group (Camber), a subsidiary of Huntington Ingalls Industries, Inc. (HII) is headquartered in Huntsville, AL. From Camber's founding in 1990, we have grown to 32 offices, positioned to provide responsive support to our customers across the United States. We deploy personnel to support our customers globally, including many locations in Asia, Africa, and Europe, providing daily interface on technical, programmatic, and operations issues. Overall, more than 1,600 Camber professionals deliver ISO 9001:2008-certified and CMMI ML3 high-value solutions to customers worldwide.  Camber Corporation is an Equal Opportunity Employer EOE/AA Minorities/Females/Veterans/Disabled Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here.SDL2017"}