{"jobID": "2815772183", "jobLocation": "Houston_TX", "jobTitle": "Sr Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": "Description: Under general supervision, leveraging competencies in the technical software development process, the Technical Software Developer will perform the analysis to define system scope and objectives needed to develop or modify existing engineering applications. This developer will also be instrumental in choosing and implementing technologies in designing, coding, testing, trouble-shooting and documenting engineering systems applications. May also develop test strategies used in the automated regression testing of these systems. Usually works on projects of moderate scope and complexity. Assists in the development of assignments and schedules. May require instruction and guidance during certain phases of application systems analysis. Job tasks, correctly performed, impact indirectly on cost containment, efficiency, profitability or operations. Consequences of error are easily measured and can be confined. Skills are typically acquired through the completion of an undergraduate degree in Computer Science or similar discipline, and 2 years of related experience or through 6 years of related software development experience.  Comments  Entered  Overview  As a data scientist Digital Solution team, you are responsible to deliver digital solutions which can achieve measurable business results through collaborating with subject matter experts in businesses, building data analytics models, prototyping data driven digital tools to tackle business problems. We are looking for top talents who enjoyed learning and contributing to our team through creative and innovative thinking.  Job Responsibilities  Translate large scale complex business data (time series data, structured/unstructured) into identified patterns/trends or predictive models, deploy solutions to business units to generate measurable values for businesses.  Grasp the latest machine learning and cloud computing technologies to ensure the best technologies were implemented to meet businesses data challenges.  Required Qualifications  Advanced degree (Master or Ph.D.) in math or engineering with 5 years of data analytics experience  Minimum of 3 year experience with data visualization technologies using popular software (such as Tableau) and programming data visualization dashboard using data visualization open source like (D3.js, dimple.js)  Minimum of 3 year experience in building classification or regression models using R or Pandas.  Familiar with popular machine learning packages provided by Amazon AWS, Microsoft or Google (such as Azure, GCP).  Had knowledge in full stack development. This covered backend data processing skills including programming with Postgresql, or with Sklearn, and front end development with HTML, CSS, Javascript, Python or Java. Desired Qualifications Experience in Oil&Gas; industry, especially experience in upstream operations was preferred.  Worked with big data platform like Hadoop, Hive, or Phoenix. Had knowledge in parallel programming, map-reduce framework in Spark.  Experis is an Equal Opportunity Employer (EOE/AA)"}