{"jobID": "2816283326", "jobLocation": "Skokie_IL", "jobTitle": "Fermentation Scientist", "companyRating": null, "companyInfo": {"Website": "www.lanzatech.co.nz", "Headquarters": "Skokie, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About LanzaTech: LanzaTech is turning our global carbon crisis into a feedstock opportunity, with the potential to displace 30% of crude oil use today and reduce global CO2 emissions by 10%. LanzaTechs carbon recycling technology is like retrofitting a brewery onto a steel mills emission source, and instead of using sugars and yeast to brew beer, bacteria ferments pollution into products! Imagine a day when you can power a plane by recycled carbon emissions and when your yoga pants or sneakers started life as pollution from a steel mill. This future is possible using LanzaTech technology, with the first 2 commercial units converting steel mill waste gases to fuels being built in China with Shougang and in Belgium with the worlds largest steel maker, ArcelorMittal. LanzaTech has an additional 3 commercial projects in the pipeline, in India, South Africa and California. LanzaTech has already produced synthetic jet fuel from recycled carbon emissions and has a partnership with Virgin Atlantic.  In March 2018, LanzaTech was recognized as the #1 Hottest company in the Advanced Bioeconomy for the third time by Biofuels Digest, the worlds most widely-read bioeconomy daily. The company was also inaugurated into the Cleantech100 Hall of Fame, having been listed in the top 100 cleantech companies over the last 7 years. In 2016, the company won the Young Global Leader Award for Circular Economy at the World Economic Forum, LanzaTech was also the top biofuels company in the 2016 CNBC Disruptor 50 Companies list. In 2015, LanzaTech was awarded the U.S. EPA Presidential Green Chemistry Award for Greener Synthetic Pathways. The companys accomplishments were recognized through a number of prestigious awards in 2014, including the Guardian Sustainable Business Innovation Award for Carbon and Energy Management, Breakthrough Innovation Award at the Platts Global Metals Awards, and the Technical Development Award from the World Petroleum Council. In 2013, the company was named a World Economic Forum Technology Pioneer. Position Summary: The role involves characterizing new bacterial strains for LanzaTechs gas fermentation process to produce biofuels and chemicals. The successful candidate will advance our understanding of strains using fermentation fundamentals and systems tools to accelerate and rationalize strain engineering. Because LanzaTech creates fuels and chemicals from waste with our proprietary gas fermentation process, developing and improving our microbial catalyst portfolio is essential to maximize the value we create using our gas fermentation technology. The successful candidate will contribute to efforts to test and optimize the growth characteristics of proprietary strains of anaerobic bacteria that produce chemicals and fuels from carbon-containing gases (carbon monoxide and carbon dioxide/hydrogen mixtures), therefore converting waste products efficiently into recycled valuable chemicals. The successful candidate will generate and analyze fermentation data and develop new methods and strategies to improve performance of microbial strains. Responsibilities will include maintaining, supervising, and advising on fermentation plant operation and performing tasks according to fermentation run guidelines to ensure uninterrupted operation. The successful candidate will participate in cross-functional team based projects with synthetic and computational biology, as well as with scale up activities, which may require international and domestic travel. Responsibilities and Duties Include: Independently design, plan, and execute fermentation experiments to improve fermentation performance.Perform anaerobic microbiology growth experiments using plate, shake flasks and bioreactors cultivation techniques.Collaborate with cross-functional teamsPrepare and present results, scientific findings, technical reports, and protocolsAdjust procedures and troubleshoot scale-up, as needed.Evaluate and maintain fermentation data in databases.Analyze data using fermentation and chemical engineering fundamentals, mass and energy balances. results.Maintain safe practices and work environment.Required Qualifications and Desired Skills:Masters Degree in Microbiology, Bioprocess or Chemical Engineering, or related field.Strong communication skills including presentations, preparing technical reports and writing SOPs.Strong organizational and analytical skills, including data management, analysis and communication.Experience with gas fermenting organisms, bioreactor operation and anaerobic fermentation processes is desired.A knowledge of synthetic biology tools and systems biology experience is desired.Work Conditions:Up to 15% of international and domestic travel may be required. Some travel is for extended periods to support projects.May work at industrial sites for project needs.This position is open to candidates authorized to work in the United States on a full-time basis for any employer. LanzaTech is an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status."}