{"jobID": "2831025306", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.wolve.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": "Description We are looking for a Statistical Machine Learning expert to be a member of our Quantitative Research team. You will be using large data sets to create trading strategies, improve trading, quantitative research and data mining. This work will be challenging, fast-paced, and competitive. You will collaborate with quants and traders to develop and improve trading strategies. ResponsibilitiesMonitor development of new and existing data setsCollaborate with other traders and teamImprove existing models with new learning algorithms, alternative feature transformations, feature selection techniques, improved evaluation metrics, and increased model diversity Requirements • 2+ years of application development and implementation experience (C++, Python, R or Matlab)5+ years of machine learning related experienceCreative thinkers who are driven, self-motivated, and eager to solve challenging problemsExceptional programming skillsWorking knowledge of forecasting and data mining techniques, such as linear and non-linear regression analysis, neural networks or support vector machinesCapable of managing large data sets and developing statistical modelsInterested in applying machine learning within tradingMasters or PhD in Statistics, Physics, Applied Mathematics Computer Science/Machine Learning, or other highly quantitative field (or related subject)Desire to work within a collaborative, team-driven environmentGood communication skillsPreferred financial background, but will consider those from non-financial backgrounds. About Wolverine Founded in 1994, the Wolverine companies comprise a number of diversified financial institutions specializing in proprietary trading, asset management, order execution services, and technology solutions. We are recognized as a market leader in derivatives valuation, trading, and value-added order execution across global equity, options, and futures markets. With a focus on innovation, achievement, and integrity, we take pride in serving the interests of both our clients and colleagues. The Wolverine companies are headquartered in Chicago with offices in New York and San Francisco and a proprietary trading affiliate office located in London. Sponsorship is not available for this position. Back  Email  Apply Now"}