{"jobID": "2630201555", "jobLocation": "Ne_Jersey", "jobTitle": "Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.i28tech.com", "Headquarters": "Iselin, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Business Intelligence Analysti28 Technologies - NJ, USADescription:The Business Intelligence Analyst will be responsible for developing BI solutions in the form of reports and dashboards for the organization and providing data visualization and analysis.Responsibilities: Analyzes the business objectives of the stakeholder and develops solutions to their business issues.Analyzes and defines processes of business both “To Be” and “As Is.”Documents business requirements and delivers work products throughout the project life cycle.Analyzes the entire business, including data, goals, process, and organization.Translates business requirements to System/Functional requirements, and then these are passed to Application Developers.Understanding business requirements and translating them into specific software requirementsUnderstanding both technical designs and specificationsAnalyzing and documenting the required data and informationHaving strong technical skills, business intelligence, and a full understanding of the needs of the customerBeing able to effectively communicate with external clients and internal teams to deliver GUI, interface and screen designsSKILLS:SQL Server, Tableau knowledge is requiredTechnical or Senior Engineer experience is required. Data integration and BI project experience is a plusExcellent trainer and oral and written communication skills are required.Ability to effectively communicate processes and results with accuracy is also required.Ability to analyze complex problems and work both alone and as part of a team to find solutionsGood applied statistics skills, such as distributions, statistical testing, regression, etc.Bachelors Degree in Computer Science, Information Technology, Computer Information Systems and related technical fields with or without 1-2 years of experienceHighly motivated to solve real-life problems Requirement:Any suitable combination of education, training, or experience is acceptable. Relocation may be required.  Send Resume to i28 Technologies Corporation, Attn: HR Dept, 200, Middlesex Essex TPK, Suite#210,  Iselin, NJ 08830 or email : info@i28tech.com  Should the candidate accept employment with i28 Technologies Corporation., the referring employee will be eligible to receive an award of $1000.00 for the successful referral."}