{"jobID": "2769003826", "jobLocation": "Lyndhurst_NJ", "jobTitle": "Business Intelligence Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.vitals.com", "Headquarters": "Lyndhurst, NJ", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zocdoc, Healthgrades"}, "estimatedSalary": "68000", "jobDescription": " We are looking for a Business Intelligence Data Analyst to join the Vitals team. Reporting to the Vice President, SmartShopper Engagement, in this role you will be responsible for analyzing market and business trend data to enhance decision making for the sales force. Discover information hidden in vast amounts of data, and help Vitals make better decisions. Translate findings and present results in a clear manner to Sales and Engagement teams. The key objective is to understand the program and client performance, the effectiveness of engagement strategies and drivers of ROI.In this position, you'll be responsible for: Performing quantitative data collection from various sources, through state of the art data collection methods, and extending companys data with third-party sources of information when neededEnhancing data collection procedures to include information that is relevant for building analytic systemsCreating the value from data by performing advanced analytics and statistical techniques to deepen insights, making predictions and generate recommendationsEmploying performance analytics predicated on high-quality data to develop reports and dashboards with actionable insightsCommunicating data value to key stakeholders by synthesizing findings into actionable management reporting, utilizing using word, charts, graphs, and other visualizations to present your findings.Supporting Sales and Engagements management planning and decision making on sales incentives and production by, developing and maintaining financial models, reporting and sensitivity analysis by customer segmentPerforming ad-hoc analysis and present results in a clear mannerYou might be a good fit if you have: 5 to 7 years related experience and/or training; or equivalent combination of education and experience.Strong background in data modeling with highly advanced Excel skills.Bachelors degree (B. A. / B. S.) from four-year college or university;Ability to display and effectively communicate findings, and recommendationsTechnical expertise regarding data sources, data structures, data organization, and data optimization using tools like Salesforce Einstein Analytics (formerly known as Wave), MS Power BIAdvanced analytics knowledge and techniques to discover deeper insights, make predictions or generate recommendations.Knowledge of statistics and experience analyzing large datasets (utilizing any number of analytical tools)Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyTime management skills, oral and written communication skills, presentation skills, attention to detail, ability to multi-taskKnowledge of health insurance plans a plusDemonstrated ability to work in a fast-paced, decision-oriented environmentStrong presentations skillsAbility to work independently and in a collaborative team environment"}