{"jobID": "2804482196", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Technical Systems Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.dominos.com", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1960", "Type": " Company - Public (DPZ) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pizza Hut, Papa John's, Little Caesar's"}, "estimatedSalary": "59000", "jobDescription": " Dominos, which began in 1960 as a single store location in Ypsilanti, MI, has had a lot to celebrate lately: were a reshaped, re-energized brand of honesty, transparency and accountability, not to mention great food! In the rise to becoming a true technology leader, the brand is consistently one of the top five companies in online transactions. Further, 50% of our sales in the U.S. are taken through digital channels. The brand continues to deliver the dream to local business owners, 90% of which started as delivery drivers and pizza makers in our stores. Thats just the tip of the icebergor as we might say, one slice of the pie! If this sounds like a brand youd like to be a part of, consider joining our team!  As a Technical Systems Analyst with Domino's Store Architecture team, you will serve as the system level expert around new store delivered technology and capabilities. This includes a newly built in-store Point of Sale (POS) system that will be in Domino's 15,000+ stores across the globe! You'll partner directly with our systems architects as they build, scale and define a world-class store platform system.What you'll be doing: Support the Product and Development Teams during requirements gathering and development of APIsGenerate and maintain architecture documents (domain models, sequence diagrams, API specifications, and event models)Analyze current store configurations (e.g., addresses, coupons, pricing, reports) to validate architecture against a wide range of international use cases.Partner with cross-functional technical and business teams to determine whether the platform is performing as architected.Analyze existing store system data to determine required migration approaches. Support migration of existing store system data into newly built platforms.Bachelors degree in Computer Science, MIS, or Information Technology or equivalent combination of education and experience.Excellent communications skills, both written and oral. Ability to engage in technical discussions with peers.Working knowledge of APIs. Knowledge of RESTful API concepts is a plus.Working knowledge of relational database concepts and proficiency in performing SQL queries to explore data. Experience with SQL Server is a plus.Innate curiosity for the advancement of new technologiesProficiency in one or more programming and scripting languages (C# and Javascript)Ability to troubleshoot and manage problems independently.Knowledge of UML or similar modeling language is a plus."}