{"jobID": "2837118489", "jobLocation": "Austin_TX", "jobTitle": "Platform Architect - R&D; Data CoE", "companyRating": null, "companyInfo": {"Website": "www.gsk.com", "Headquarters": "Brentford, United Kingdom", "Size": "10000+ employees", "Founded": " 1830", "Type": " Company - Public (GSK) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, AstraZeneca, Merck"}, "estimatedSalary": null, "jobDescription": " Platform Architect - R&D; Data CoE  + Requisition ID:WD148907  + Position:Full time  + Open date:Jul 3, 2018 10:02 AM  + Functional area:IT + Location: Dallas,  Texas  Philadelphia,Pennsylvania  + Required degrees:Bachelors  + Experience required:Not Indicated  + Relocation:Not Indicated  Email a friend  Your Responsibilities:Want to use your skills to significantly improve the daily lives of scientists and employees across R&D; so they can help patients? Want to be part of high performing teams containing world class talent? Do you have a passion for developing innovative, cutting-edge solutions to scientific and operational business problems? Then this could be the role for you . . .  The Data CoE has been in existence for over 2 years with the mission to improve R&D; decision making through the better use of its data. The group has concentrated on start-up fundamentals including Infrastructure build, Platform delivery, team set-up and early value delivery through use cases. The focus now is driving implementation so we can maximise the effective use of new tools and the available data by users across all of R&D; from those reporting the data, those conducting data discovery through to experts in data and computational science. This will require individuals with leadership qualities, an appreciation of the value of data and the ability to drive the embedding of new ways of working. If think you have what it takes then read on further about this fantastic opportunity.  Click here to learn more about why data is so important to GSK, from our CDO Mark Ramsey.  The Opportunity ...  The platform Architect will enable the next generation Big Data capabilities to work within GSKs platform team. The individual will work closely with developers and end users to enable capabilities based on product roadmap.  This role will interface with various roles within IT and R&D.; The RDIP system serves as the backbone for analytics within R&D; Pharma. This role will be a key contributor to enabling new capabilities and sustaining current ones as it relates to the platform. Speed and deep working knowledge is key for success in this role.  Key Responsibilities ... Provide direction for the implementation of capabilities of the Big Data PlatformResearch tools and technologiesStay abreast of new technologies and solutions in the Big Data arena Why GSK ...  At GSK we are all inspired by the difference we make and challenge ourselves every day to improve the lives of patients and consumers. Thats why we have created an environment where everyone feels valued, able to develop, contribute to our mission and be proud of what we achieve.  To support you in achieving your role and career ambitions youll be given the opportunity to: Play an important role in delivering our missionBe an essential part of diverse, global teamDevelop others as part of your own professional growth We look forward to receiving your application !  Closing date for applications: 13th July 2018  When applying for this role, please use the 'cover letter' of the on-line application to clearly describe how you meet the competencies for this role, as outlined in the job requirements above. The information that you have provided in your cover letter will be used to assess your application.  Thank you for your interest in this opportunity. LI-GSK #BigData  If requiring an adjustment for a disability, once selected for interview you may contact ukdiversity.recruitment@gsk.com  Why You?  Basic qualifications:• Bachelors degree Architecture & Design:Experience designing and building complex, high performance data ingestion pipelines using Big Data technologies.Understanding of streaming vs batch ingestion patterns, trade-offs and implementation intricacies.Very thorough understanding of Hadoop security, Kerberos, TLS/SSL encryption, SentryExperience and understanding of various third party vendor solution such as StreamSets, H2O, BI reporting solutions, ETL solutions etc, search engines.Deep understanding of Hadoop storage and compute frameworks Key Value stores, wide column stores, mutable vs immutable stores, document stores.Deep understanding of consistency, availability and performance guarantees provided by various Hadoop components and how they apply to use casesDeep understanding of software design principles, architecture approaches, design best practices etc.Deep understanding of RDBMS concepts SQL competency is requiredDeep understanding of distributed systems concepts, shared nothing architecturesExperience gathering and understanding business requirementsExperience with software version control, configuration management and release management principles.Tactical/Technology:Working knowledge of setting up and running Hadoop clustersIn-depth knowledge of capacity planning, performance management and troubleshooting for of various Hadoop components.Must have experience with monitoring tools used in the Hadoop ecosystem such as Cloudera Manager, Nagios etc.Experience with at least one of the following programing languages: Java, Scala, C++.Experience with at least one of the following scripting languages: Python, Bash, PerlStrong understanding and experience with Linux internals and administrationStrong understanding of Linux Filesystem management, Networking and resource management.Miscellaneous:Consulting background and/or comfort in working with customersExperience reviewing and critiquing architecture design and approaches,Experience reviewing and critiquing source codeExperience providing technical leadership to a team of engineers/architects Preferred qualifications:• Certifications in Hadoop Administration  Why GSK?:At GSK, our mission is to improve the quality of human life by enabling people to do more, feel better and live longer. Our three world-leading businesses research and deliver innovative medicines, vaccines and consumer healthcare products. We need a talented and motivated workforce to deliver against our strategy. To achieve this, we strive to attract the best people and to create an environment that empowers and inspires. Contact information: You may apply for this position online by selecting the Apply now button.  If you require an accommodation or other assistance to apply for a job at GSK, please contact the GSK HR Service Centre at 1-877-694-7547 (US Toll Free) or +1 801 567 5155 (outside US).  GSK is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.  Important notice to Employment businesses/ AgenciesGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.  Please note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, GSK may be required to capture and report expenses GSK incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure GSKs compliance to all federal and state US Transparency requirements. For more information, please visit GSKs Transparency ReportingFor the Recordsite."}