{"jobID": "2784075657", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Lead Data Scientist - Predictive and Prescriptive Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "159000", "jobDescription": "What you’ll be doing... As a Data Scientist on the Ann team, you will work within the Ann Machine Learning and Decisioning Platform to develop models and algorithms that predict or prescribe outcomes of and for customer interactions.  Your role will be multi-faceted. In addition to model development, you will take an active role in making assessments and recommendations on current and future technology, and helping to set the Platform architecture vision and roadmap. Working with domain experts to understand data sources and complete feature engineering.Performing data munging and creating training data sets, designing and executing experiments with the training data sets to determine the best models to apply, and performing cross validation to test the efficiency of the resulting algorithms.Once reaching adequate efficiency thresholds, assisting in implementing algorithms into the Ann Real Time Decision Engine for run-time scoring, or ingestion into the Ann Real Time Customer Insights model store for batch scoring of customers.Fully immersing yourself in the business problems you are solving, and acting independently to move projects to completion with minimal day to day oversight.Acting as a hands-on data scientist responsible for the entire end to end process of model development, implementation, and maintenance of business-changing models and algorithms.What we’re looking for... You'll need to have: Bachelor's degree or four or more years of work experience.Four or more years of relevant work experience. Even better if you have: Advanced degree in Statistics or Computer Science.Expertise and experience using R, Python, and Spark.Expertise and experience using Hadoop/HDFS.Expertise and experience using H20.ai.Expertise and experience using Spark ML.Familiarity with Tensor Flow.Familiarity with Big Data Cloud platforms, in particular AWS EMR.Familiarity with Pega Systems’ Decision Hub.Familiarity applying machine learning to solve other AI problems such as NLU/NLP, Voice Biometrics, Text Mining, and Intelligent Process Automation.Strong analytical and research capabilities.Expertise in statistical techniques and quantitative methodologies that are used in Machine Learning applications.Demonstrated ability to evaluate machine learning tools, platforms, and architecture.Aptitude for synthesizing information and conveying complicated information clearly.When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}