{"jobID": "2828736190", "jobLocation": "Rolling_Meadows_IL", "jobTitle": "Finance & Analytics Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.ajg.com", "Headquarters": "Rolling Meadows, IL", "Size": "10000+ employees", "Founded": " 1927", "Type": " Company - Public (AJG) ", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Aon, Marsh & McLennan Companies, Willis Towers Watson"}, "estimatedSalary": "96000", "jobDescription": "Arthur J. Gallagher & Co., one of the world's largest insurance brokers, provides a full range of retail and wholesale property/casualty (P/C) brokerage and alternative risk transfer services globally, as well as employee benefit brokerage, consulting, and actuarial services in the United States. We also offer claims and information management, risk control consulting, and appraisal services to clients around the world.  The Finance  & Analytics Manager will support Gallagher’s $4B Brokerage segment. The  manager will be responsible for using client, underwriting, claims, and policy  data to investigate financial and operational trends. The individual will work  closely with business leaders to understand issues facing the business and  perform the proper research to answer those questions. The manager will also interact  with IT and other data governance groups as part of Gallagher’s effort to  integrate new data elements into our global data warehouse. Responsibilities:  ·  Develop relationships with management to gain a  deep understanding of the business and identify opportunities to influence  revenue growth and margin improvement.  ·  Lead efforts to research new underwriting data  stored in our central data warehouse. Identify business opportunities to  monetize this data.  ·  Educate IT on the monetization opportunities for  new data elements and work with them to structure data in a manner that enables  reporting and analysis.  ·  Work with IT to normalize data elements from  different sources. Ensure proper controls and processes are in place to  guarantee data reliability and timeliness.  ·  Integrate new data attributes into reports and  dashboards for measuring management’s progress on priorities.  ·  Research trends and communicate opportunities  and issues to management.  ·  Lead a team of 1-3 analysts. Ensure analysts  have proper and continued feedback. Create development plans that improve  technical and leadership skills.Requirements:·  Bachelor or Master’s degree in a financial or  mathematical field (Finance, Math, Actuarial, Data Science, Economics).  ·  Necessary analytical and technical skills to  manipulate and interpret large amounts of information.  ·  Strong oral and written communication skills,  including an ability to simplify technical concepts and analysis for  non-technical audiences.  ·  Strong organization and planning skills are  needed to manage multiple priorities with tight deadlines.  ·  Strong problem-solving skills and an ability to  produce results in an evolving environment.  ·  Experience leading and developing a team of  analysts. Preferred Requirements:·  A background in insurance, insurance brokerage,  or financial services.  ·  Experience in a larger organization where the  candidate has participated on projects with multiple departments. Candidate  will have the requisite relationship-building and leadership skills to  understand, negotiate, and deliver on their project responsibilities.  Exposure  to big data tools and programming languages. Ability to lead analysts using  these toolsKey Characteristics:Critical Thinking, Complex Problem Solving, Deductive Reasoning, and Mathematical Reasoning.Excellent Judgment & Decision Making skills.Excellent Communication Skills.Ability to explain data science to business/non-technical audiences.#LI-CS1U.S. Eligibility Requirements:Interested candidates must submit an application and resume/CV online to be consideredMust be 18 years of age or olderMust be willing to submit to a background investigation; any offer of employment is conditioned upon the successful completion of a background investigationMust have unrestricted work authorization to work in the United States. For U.S. employment opportunities, Gallagher hires U.S. citizens, permanent residents, asylees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H or L visas), such as students in practical training status. Exceptions to these requirements will be determined based on shortage of qualified candidates with a particular skill. Gallagher will require proof of work authorizationMust be willing to execute Gallagher's Employee Agreement or Confidentiality and Non-Disclosure Agreement, which require, among other things, post-employment obligations relating to non-solicitation, confidentiality and non-disclosure Gallagher offers competitive salaries and benefits, including: medical/dental/vision plans, life and accident insurance, 401(K), employee stock purchase plan, educational expense reimbursement, employee assistance program, flexible work hours (availability varies by office and job function) training programs, matching gift program, and more.Gallagher believes that all persons are entitled to equal employment opportunity and does not discriminate against nor favor any applicant because of race, color, religion, sex, age, veteran status, disability, national origin, or any other legally protected status. Equal employment opportunity will be extended in all aspects of the employer-employee relationship, including, but not limited to, recruitment, hiring, training, promotion, transfer, demotion, compensation, benefits, layoff, and termination. In addition, Gallagher will make reasonable accommodations to known physical or mental limitations of an otherwise qualified applicant with a disability, unless the accommodation would impose an undue hardship on the operation of our business."}