{"jobID": "2791911128", "jobLocation": "Houston_TX", "jobTitle": "Computational Scientist - Epidemiology", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "The ideal candidate for the Computational Scientist position in Epidemiology at MD Anderson Cancer Center will meet the preferred experience skill sets listed in the job descriptionKey FunctionsDevelop, implement, maintain, and oversee next-generation sequencing (NGS) data processing pipelines in a high performance computing environmentDevelop, implement, and execute algorithms for whole exome and whole genome NGS and SNP array analyses for detection of copy number variationWork closely with clinicians and biologists to provide customized bioinformatics/computational support throughout their studies.Extract and integrate internal and public genomic and clinical data to produce standardized data sets that can be distributed within MD Andersons’ computing environment and used by clinicians and researchers.Develop software modules to regularly perform standard data analysis routines in an automated fashion and provide visualization tools for clinicians and researchers to explore the results.Systematically explore and mine multi-dimensional data to validate experimental findings or formulate hypotheses to provide directions of further studies. Work with bioinformaticians, IT personnel, and other researchers to respond to new technologies.Identify issues of practical or theoretical importance and drive to solutions through innovative mathematical/computational approaches. Evaluate existing algorithms and develop new algorithms and user friendly tools for modeling genomic variation that can be deployed to MD Anderson or larger research communities.Collaborate with team members, including trainees and collaborating PI’s, to support varied computational biology tasks and support innovative computational solutions problems in genetics, genomics and cancer biology.Other duties as assigned.EDUCATION Required: Bachelor's degree in Biomedical Engineering, Electrical Engineering, Physics, Applied Mathematics or related field.  Preferred: Master's degree in Biomedical Engineering, Medical Physics, Electrical Engineering, Physics, Signal Processing, Software Engineering, Applied Mathematics or related field. EXPERIENCE Required: Five years experience in scientific software development/analysis. With preferred degree three years experience required.  Preferred: Working experience in mining genomic and clinical data. Applicants with experience in machine learning, mathematical/statistical modeling, simulation, network analysis and experience in data integration, data mining, NGS data analysis (mutations, structural variations, and expression). Proficiency in at least one programming language such as C/C++, Perl, Python, or JAVA. Proficiency in a statistical software environment, such as R, S-PLUS, or SAS.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law.  http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html "}