{"jobID": "2679479687", "jobLocation": "Mountain_View_CA", "jobTitle": "Director / Principal Scientist, Computational Biology", "companyRating": "4.9", "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "297000", "jobDescription": " With the worlds largest database of more than three million genotyped and deeply phenotyped, consented research participants, 23andMe is at the forefront of using human genetics to advance biomedical research and transform healthcare. Join our growing team of computational biologists in translating genetic discoveries into insights into molecular biology of human traits and diseases! Who you are We are looking for a colleague with extensive experience in computational biology and human genomics to lead a group of computational biologists. This group will tackle problems associated with driving discovery from genomic data while working with our therapeutics group to convert genetic associations into potential drug targets. Biological interpretation of the unparalleled wealth our genetic and phenotypic data requires efficient computational methods to augment our data with public or internally generated high-throughput genomic and functional data. Ideal candidates will have a substantial record of developing robust tools that drive discovery and interpretation of biological systems. They will have significant experience in the application of cutting-edge machine learning and statistical methods to large-scale genomic datasets, including whole-genome DNA sequencing, exome sequencing, and RNA seq. Experience with methods to address fine mapping questions, such as eQTL/sQTL/pQTL methodologies, is a plus. We are very collaborative, and a demonstrated track record of collaborating and communicating successfully with other scientists is essential. The questions we are working on and the scope of our vision mean that most of the necessary tools and methods have yet to be developed anywhere in the world.  Candidates should have multiple years of experience leading teams to develop and implement novel methods and bioinformatics tools, executing independently developed ideas, and a demonstrated ability to clearly and effectively communicate with a wide range of internal and external audiences. In addition, candidates should have multiple years of experience managing a group of scientists and a demonstrated track record of leading a research program.  We encourage presentation and publication of research results. The full list of our publications can be seen at https://research.23andme.com/publications/. What youll doRecruit, supervise, develop, and mentor junior scientists.Design, implement and manage execution of complex, cross-functional, long-term projects to develop or use methods/tools to analyze human genomic data and drive discoveries in human health, including the identification of novel therapeutic opportunities.Contribute ideas and expertise to help shape the strategy of our research program.Work collaboratively with members of the Research, Therapeutics, Engineering, and/or Product teams to develop and execute our research program to meet company goals.What youll bringPh.D. in Computational Biology or related field (Biomedical Informatics, Bioinformatics, Computer Science, Machine Learning, Mathematics, Statistics, Physics).Strong background in machine learning, statistics or algorithms development.Extensive experience in writing robust code; strong programming skills in Python or R.Hands-on experience working with very large genomic datasets.Knowledge of statistical genetic methods, including GWAS, PheWAS, burden testing, etc.Demonstrated fluency with tools and methods for sequencing data analysis (WGS, RNA-seq, and/or ChIP-seq).Multiple examples of successful collaboration.Excellent verbal and written communication skills.For senior scientists: significant post-graduate work in academic or industry setting.For principal scientists: in addition to requirements for senior scientists, experience leading/managing a group of scientists.About Us 23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.  At 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.  Please note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}