{"jobID": "2828049646", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Data Scientist Job Number: 113997220Santa Clara Valley, California, United StatesPosted: Jun. 26, 2018 Job SummaryImagine what you we could do together. At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The Identity Management Systems is seeking a Data Scientist with strong analytical skills and technical experience in both applied business analytics and software engineering. To work where dynamic, smart people and inspiring, innovative technologies are the norm.Key Qualifications Significant experience applying one or more of the following analytical methods: regression (preferably mixed models), data classification and reduction (e.g. cluster, factor, principle components, decision trees), Bayesian inference or other advanced machine learning techniques.Hands on Experience in Scala,Java, Spark or PythonProven technical database knowledge (Oracle, Hadoop, NoSQL, data modeling) and experience optimizing SQL queries on large dataIn-depth understanding of XML2+ years of experience working with TableauExceptional interpersonal skills, for collaborating across many participating teams.Able to work effectively on sometimes ambiguous data and constructs within a fast changing environment, tight deadlines and priority changes. DescriptionSupport Identity Management Systems Team with analytics for customer profiles, in sights on data quality and provide deeper outlook of information dynamics. Generate high level summary reports and trends/dashboards using Tableau. Develop enterprise-scale solutions to ingest high volume data and build solutions that can provide adhoc analysis both for daily Operational challenges and executive asks. Work multi-functionally with various business and Services teams on reciprocal customer analytic projects Conceive and design end to end optimized data platforms and customer analytic scripted solutions using Hadoop, RDBMS Scala, Java and Spark. Manage business analytic projects through all phases, including data quality, data modeling, algorithm/KPI development, statistical analysis, data visualization and presentation of results and work."}