{"jobID": "2791365824", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.captechconsulting.com", "Headquarters": "Richmond, VA", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Accenture, North Highland, Deloitte"}, "estimatedSalary": "77000", "jobDescription": " Data Engineer  Chicago, IL, USA Full-timeCompany DescriptionCapTech is an award-winning national management technology-consulting firm with an enterprising, entrepreneurial environment. We have achieved four straight years ranked in the Top 10 of Consulting Magazine's Best Firms to Work For, including a #5 ranking overall in 2015. Additionally, we placed 28th within the Vault Consulting 50 for the second year in a row, including a #5 ranking in work/life balance.  At CapTech you'll experience a flat organizational structure with access to constant learning -- where your career path isn't set in stone, and you have unlimited potential for growth. CapTech is based upon a culture of mutual respect. We look for, and hire the best. The creatively innovative, the technically insightful, the driven, the self-managed, the value conscious, the caring, and the gracious person - these are all qualities that we look for along with a love and a passion for the work that we do.Job DescriptionThe Data Engineer role falls into the Data Management & Business Intelligence practice area at CapTech, through which our consultants provide a broad spectrum of services to help our clients define and implement a strategy to deliver lasting and mission-critical information capabilities. Our Data Integration consultants bridge the gap between the business and IT side of companies. By partnering with clients to fully understand both their business philosophy and IT strategy, CapTech consultants maintain the vision that data integration should be built to help the organization make better decisions by providing the right data at the right time.  Specific responsibilities for the Data Engineer position include:  Design, develop, document, and test advanced data systems that bring together data from disparate sources, making it available to data scientists, analysts, and other users using scripting and/or programming languages (Python, Java, C, etc) Evaluate structured and unstructured datasets utilizing statistics, data mining, and predictive analytics to gain additional business insights Design, develop, and implement data processing pipelines at scale Present programming documentation and design to team members and convey complex information in a clear and concise manner. Extract data from multiple sources, integrate disparate data into a common data model, and integrate data into a target database, application, or file using efficient programming processes. Write and refine code to ensure performance and reliability of data extraction and processing. Communicate with all levels of stakeholders as appropriate, including executives, data modelers, application developers, business users, and customers Participate in requirements gathering sessions with business and technical staff to distill technical requirements from business requests. Partner with clients to fully understand business philosophy and IT Strategy; recommend process improvements to increase efficiency and reliability in ETL development. Collaborate with Quality Assurance resources to debug code and ensure the timely delivery of products. Some of our technologies might include: HDFS, Cassandra, Spark, Java, Scala, Informatica, SQL Server, Oracle, Ab Initio, Kafka.QualificationsSpecific qualifications for the Data Engineer position include:  Hands on experience with Azure required Development experience building ETL graphs using the Ab Initio GDE, EME and Co-Operating system Strong SQL development skills Development experience with at least two different programming languages (Python, Java, C, etc.) Development experience with Unix tools and shell scripts Development experience with at least two different database platforms (Teradata, Oracle, MySQL, MS SQL, etc.) Minimum of 3 years experience designing, developing, and testing software aligned with defined requirements Experience tuning SQL queries to ensure performance and reliability Software engineering best-practices, including version control (Git, TFS, JIRA, etc.) and test driven development Exposure to Business Intelligence tools such as Business Objects, Informatica, SSRS, Cognos, MicroStrategy, Tableau, QlikView, SpotFire, etc.Additional InformationWe offer challenging and impactful jobs with professional career paths. All CapTechers can keep their hands on technology no matter what position they hold. Our employees find their work exciting and rewarding in a culture filled with opportunities to have fun along the way.  At CapTech we offer a competitive and comprehensive benefits package including, but not limited to:  Competitive salary with performance based bonus opportunities Single and Family Health Insurance plans, including Dental coverage Short-Term and Long-Term disability Matching 401(k) Competitive Paid Time Off Training and Certification opportunities eligible for expense reimbursement Team building and social activities Mentor program to help you develop your career At this time, CapTech cannot transfer nor sponsor a work visa for this position. Applicants must be authorized to work directly for any employer in the United States without visa sponsorship. Candidates must be eligible to work in the U.S. for any employer directly (we are not open to contract or \"corp to corp\" agreements).  CapTech is an equal opportunity employer.  CapTech is a Drug-Free work place.  Candidates must have the ability to work at CapTech's client locations.  All positions include the possibility of travel.  CapTech has not contracted/does not contract with any outside vendors in its recruitment process. If you are interested in this position, please apply to CapTech directly. I'm interested"}