{"jobID": "2722516198", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist – Autonomous Systems", "companyRating": "3.8", "companyInfo": {"Website": "www.siemens.com", "Headquarters": "Munich, Germany", "Size": "10000+ employees", "Founded": " 1843", "Type": " Company - Public (SIE) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " GE, ABB, Philips"}, "estimatedSalary": "102000", "jobDescription": "Division: Corporate TechnologyBusiness Unit: Corporate TechnologyRequisition Number: 220094Primary Location: United States-New Jersey-PrincetonAssignment Category: Full-time regularExperience Level: Mid levelEducation Required Level: Doctorate DegreeTravel Required: 10%Division Description:Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability and internationally for more than 165 years. As a global technology company, Siemens is rigorously leveraging the advantages that this setup provides. To tap business opportunities in both new and established markets, the Company is organized in nine Divisions: Power and Gas, Wind Power and Renewables, Energy Management, Building Technologies, Mobility, Digital Factory, Process Industries and Drives, Healthineers and Financial Services. Our support functions are split into two organizations, Corporate Core and Corporate Services. These organizations provide essential services to better enable responsible and profitable growth. For more information, please visit: http://www.siemens.com/businesses/us/en/Job Description:Do you want to drive the revolution from automated to autonomous systems in real industrial applications?Here’s the right opportunity for You!Join our research group Autonomous Systems and Control located in Princeton, NJ, and investigate new autonomy functions for diverse application areas such as flexible manufacturing in smart factories, smart grid, intelligent transportation systems, and robotics. We support our business units from the early phase of identifying opportunities through designing algorithms and building prototypes up to validating these prototypes in the field. Our close contact to different business units provides the opportunity to participate in projects in the areas of power system automation, factory automation, intelligent traffic systems, power generation, renewables integration, mobility etc., making for an exciting and challenging environment. Have a look at our recent Picture of the Future dossiers on Autonomous Systems and on Energy Systems to get an overview of Siemens’ recent developments in this area.Siemens BackgroundFor more than 170 years, pioneering technologies, and the business models developed from them, have been the foundation of Siemens’ success. Our central research and development unit, Corporate Technology (CT) plays an important role in this. Together with its global network of experts, CT is a strategic partner to Siemens’ operative units. It provides important services along the entire value chain – from research and development to production and quality assurance, as well as optimized business processes. The support provided to the businesses in their research and development activities is ideally balanced with CT’s own future-oriented research. Siemens’ central research and development arm sees itself as a strategic partner to the company’s businesses. It plays a key role in achieving and maintaining leading competitive positions in the fields of electrification and automation while at the same time helping Siemens fully tap into the growth field of digitalization. We at Corporate Technology are more than employees: We are actively helping to make people’s lives a little better every day. Would you like to be a part of that? Then join us. We offer you a high level of practical relevance as well as an opportunity to individually contribute your knowledge and your visions around the world. Whether you’re helping to develop products for the operating units or working in interdisciplinary projects for the business areas: At Corporate Technology you’ll be working in the heart of Siemens’ technological research together with the best.What are my responsibilities?You will develop innovative autonomy functions for industrial applications like smart factories, smart grid, or intelligent transportation systems based on machine learning, optimization, and advanced automatic control methods.You will get to implement these functions in proof-of-concepts and solutions in feasibility studies, quick prototypes, technical specifications, and eventually into larger systems and product components.Be able to test and validate these solutions in laboratory and field tests.Get to identify, define, acquire and lead industrial R&D; projects.Work with our business units to understand algorithm requirements and deliver solutions.Be able to protect the results of your work through patent applications and publish protected results at conferences or in top journals.What skills are needed to qualify for this job?Ph.D. in Engineering, Mathematics, Computer Science, or related fields with strong focus on machine learning, optimization, and automatic control required; post-PhD experience in the same field, e.g. in an industrial research center is a plus.Strong theoretical background and practical experience in different machine learning, optimization, and automatic control methods like reinforcement learning, nonlinear and mixed-integer programming, and model-predictive control, e.g. proven through at least 3 years research in this field.Good knowledge of at least one industrial application domain like flexible manufacturing, robotics, power system, intelligent transportation systems, i.e. proven through at least 3 years research in this field.Proven ability to develop new research ideas as demonstrated by a strong publication record and early developments to the level of a working system prototypes as well as involvement in writing funding proposals for research grants.Good knowledge of tools and languages typically used to support design and validation of machine learning, optimization, and controller design, e.g. C/C++, MATLAB, Simulink.Excellent interpersonal and communication (verbal & written) skills in English required.Successful candidate must be able to work with controlled technology in accordance with US Export Control Law. US Export Control laws and applicable regulations govern the distribution of strategically important technology, services and information to foreign nationals and foreign countries. Siemens may require candidates under consideration for employment opportunities to submit information regarding citizenship status to allow the organization to comply with specific US Export Control laws and regulations. Additional information on the US Export Control laws & regulations can be found on http://www.bis.doc.gov/index.php/policy-guidance/deemed-exports/deemed-exports-faqs?view=category&id;=33##LI-JA1"}