{"jobID": "2564063684", "jobLocation": "San_Francisco_CA", "jobTitle": "Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.leadstackinc.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The successful candidate will have exceptional business understanding and data analysis skills. The position requires the ability to interact with business partners to understand their needs and translate these into KPIs/metrics, to select and analyze data and uncover the key factors driving the KPIs, and to communicate the results to a non-technical business audience. Depending on experience, the successful candidate may also be tasked with operationalizing the insights, driving change management and ensuring adoption with business. Advanced knowledge of analytics tools, including Excel, Business Objects, Tableau, and SQL is required, experience with Salesforce is a plus. Relentless curiosity, able to work independently while seeking guidance at appropriate times, sound business judgment, and strategic thinking are essential.  Deliverables include detailed business analysis, analytic models, reporting and assisting with creation of dashboards, training materials and presentations for Salesforce executives. The role requires interaction with various areas of the organization, excellent communication skills (written and spoken), and provides exposure to senior executives.  Responsibilities: Work with business partners to understand business challenges, KPIs that need to be improved and metrics driving the businessAcquire, transform, manipulate and analyze data from multiple sources, ensure data qualityIdentify KPIs, develop reports and dashboards, draw key insights and leverage them to help set the strategic agenda for the business. Deliver insights & recommendationsWork directly with Data Warehouse and Big Data team to process customer usage, product, sales, marketing and system interaction dataAssist in developing and delivering presentations for senior executivesSupport adoption, change management and training efforts in business unitsPrepare ad-hoc analysis in the support of specific initiativesAssist in troubleshooting operational issues as they surface; propose changes to systems/ processes to fix root causesWork collaboratively across the IT, distribution and product organizations as well as finance, and other supporting groups.  Desired Skills/Experience:2-3 years of experience focused on data analysis, quantitative analysis and business reasoningBachelor’s degree in a technical or business field from an accredited university.Self-starter and high degree of motivation to go above and beyond the task at handExceptional problem solving skills: demonstrated ability to understand business challenges, structure complex problems, develop solutionsStrong presentation skills, especially related to building compelling PowerPoint presentationsWork experience in consulting, finance, or product management is a plusExperience with SQL and Business ObjectsExperienced in using Office tools (Excel, Powerpoint or GDoc equivalents), Tableau or Business Object to create reports and presentations.Experience with Salesforce technology (Reporting, Wave) strongly desired.Experience with Data Science, Statistical Analysis and development in R a definite plus. Background in consulting is a plus."}