{"jobID": "2823540528", "jobLocation": "Meridian_ID", "jobTitle": "Research Scientist - Data Modeling", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "90000", "jobDescription": "Company Overview Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.  Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer? Group/Division The Film and Scatterometry Technology (FaST) Division provides industry leading metrology solutions for worldwide semiconductor IC manufacturers. The FaST Division portfolio of metrology products includes hardware and software solutions for optical film thickness, optical critical dimension (CD), composition, and resistivity measurement systems. These products are essential for the IC manufacturers as they provide critical metrology capabilities for the development and implementation of their advanced IC processes. The FaST division is committed to support our customers to achieve performance entitlement of our solution and we effectively partner with our customers from their early research and development phase to the high volume in-line manufacturing implementation specific for their process needs. The division consists of a global team located in US, Israel, China, and India. Responsibilities The engineer will Identify, analyze, mine, and interpret trends or patterns in complex data sets. Analyze and Interpret data using statistical techniques and data models.  The engineer will design, develop and validate data models for further analysis using the state-of-the-art methodology such as machine-learning. He or she will be able to locate and define new improvement opportunities in the metrology and beyond. Preferred Qualifications M.S. in informatics, statistics, applied mathematics or related field. Successful candidate shall have technical expertise regarding data models, statistical techniques, machine learning for data, data mining and related techniques. He or she shall have strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy, and strong communication skills  Knowledge on metrology and/or semiconductor process is a big plus but it is not necessary Minimum Qualifications B.S. in informatics, statistics, applied mathematics or related field. Equal Employment Opportunity KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}