{"jobID": "2796322043", "jobLocation": "El_Monte_CA", "jobTitle": "Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.eastwestbank.com", "Headquarters": "Pasadena, CA", "Size": "1001 to 5000 employees", "Founded": " 1973", "Type": " Company - Public (EWBC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Chase, Bank of America, Wells Fargo"}, "estimatedSalary": "56000", "jobDescription": " For more than 40 years, East West Bank has served as a pathway to success. With over 130 locations across the U.S. and Greater China, we are the premier financial bridge between the East and West. Our teams of experienced, multi-cultural professionals help guide businesses and community members on both sides of the Pacific looking to explore new markets and create new opportunities. And our sustained growth and expertise in industries like real estate, entertainment and media, private equity and venture capital, high-tech and aviation help build sustainable businesses and expand our employees’ potential for career advancement.  Headquartered in California, East West Bank (Nasdaq: EWBC) is a top performing commercial bank with an exclusive focus on the U.S. and Greater China markets. With assets of $37.7 billion, we’re ranked among the 30 largest banks in the United States and currently top 5 in “America’s 100 Best Banks” by Forbes, a list where we've consistently been in the top 15 since 2010. With a strong foundation, an enterprising spirit and a commitment to absolute integrity, East West Bank gives people the confidence to reach further.  We are currently seeking a Data Analyst with banking or treasury management experience. The Data Analyst will define and execute on analytics and reporting to support EWB's Global Transaction Services (GTS) business unit. This position requires excellent analytical and communication skills and an entrepreneurial spirit to improve processes. The individual will work closely with product managers, sales, relationship managers, finance, marketing, bank partners, vendors, and the leadership team to understand the information need, define data requirements, design feasible reporting solutions, and provide ongoing support to business partners. Produce and create standardized reports on a monthly and ad hoc basisPerform ad hoc data mining and report generation for the Global Transaction Services TeamProvide solutions and insight to product managers, sales, relationship managers, finance, marketing, bank partners, vendors, and the leadership team in identifying strengths, weaknesses, opportunities, and threats within business contextPerform related operational and administrative functions as directed by managementCompile and maintain documentation (such as procedures, guides, instructions, etc.) for critical applications, reports and daily business analytics processesIdentify opportunities for data report automation and work with IT to materialize such opportunities.Provide regular updates to the management team, business units and business partners (as applicable) regarding related project(s)Identify data quality issues and work with business partners to ensure data is updated and maintainedLiaise between various business partners to achieve technical solutions based on operational needsOther various duties and special projects as need demandsBachelor's degree in finance, business, engineering, science or related experience preferred5 years of experience in business analytics in commercial banking or treasury management preferred2 years of experience on a project team a plusAdvanced skill in Microsoft Office required; strong VBA a plus2 years of experience using relational database programming; SQL Server a plusExperience as a business liaison within a project teamAbility to multi-task effectivelyExperience with FIS Core Banking Systems preferredAbility to shift priorities quickly and still make deliverables on scheduleSkilled at consensus building and conflict resolution managementAbility to analyze government regulations, bank policies, and procedure manuals and interpret context and impact to current business flowsAbility to identify and solve problems quicklyStrong ability to influence resultsStrong written and verbal skills to communicate effectively with various teams and organizationsStrong inter-personal relationship skills that build partnership and trust #CB"}