{"jobID": "2835510129", "jobLocation": "Springfield_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.quadrint.com", "Headquarters": "Bethesda, MD", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Scientist Provide statistical and mathematical support in assisting the agency analyze and interpret a wide range of data to help the agency understand and improve our customers experience. Required Skills:Must have an active TS/SCI clearanceDue to the nature of the government contract requirements and/or clearance requirements, US citizenship is requiredBachelor's Degree in Economics, Statistics, Operations Research, Computer Science, Information Systems, Engineering or similar quantitative disciplineDemonstrated extensive knowledge of, and proven success with a role, executing various aspects of the business or information technology-related client engagements and/or projects within a professional services environment, including knowledge of an industry or functional domain and expertise in at least two of the following areas: Statistical Analysis and TechniquesMachine Learning model and algorithm design and developmentBusiness, Federal, Human Capital or Operations Analysis within mission, marketing, operations or workforce planningDemonstrated significant experience working with analytical models or techniques and the ability to apply such methods to an applicable challenge within the larger field of expertise. This background should include: Advanced analytics techniques (regression, simulation, etc.)Visualization techniques and toolsApplicable sources of external, internal or new data sources to support analytic methods and visualization techniquesExperience with the Agile development approachProficiency in at least one of the following languages for use in data manipulation, extraction or programming: Python, R, Java, SQL, or similarMinimum Years of Experience: 1-3Desired Skills:Experience working within the Intelligence Community (IC) or military organizationsAnalyzing large and complex data sets to solve business challenges and present insights to non-analytics minded individualsCollaborating and contributing as a team member: understanding personal and team roles, contributing to a positive working environment by building solid relationships with team members, proactively seeking guidance, clarification and feedbackIdentifying and addressing client needs, building relationships with clients, developing requests for information, demonstrating flexibility in prioritizing and completing tasks, communicating potential conflicts to a supervisor Ability to work independently in a fast paced, constantly changing environment  Ability to interact and work in a teaming environment Quadrint, Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, marital status, protected veteran status, status as an individual with a disability, or any other, or any other protected status."}