{"jobID": "2311340945", "jobLocation": "Detroit_MI", "jobTitle": "Software Engineer - .NET", "companyRating": "3.6", "companyInfo": {"Website": "www.quickenloans.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Citi, Bank of America, Wells Fargo"}, "estimatedSalary": "75000", "jobDescription": " Who We AreWe’re America’s largest mortgage lender, closing loans in all 50 states. J.D Power ranked Quicken Loans “Highest in Customer Satisfaction in Primary Mortgage Origination” for the past eight consecutive years, 2010 – 2017. The company was also ranked highest in the nation for client satisfaction among mortgage servicers by J.D. Power for four consecutive years, 2014 through 2017, each year the company was eligible. There’s a simple reason we’ve been so successful: We care about the people we work with.  If you’re tired of stuffy, bureaucratic workplaces, then you’ll be delighted to find something different here. We strive to make a creative, fun and collaborative environment you simply won’t find anywhere else. Quicken Loans was named #1 in ESSENCE Magazine’s first ever list of “Best Places to Work for African Americans” in 2015. We've been on Computerworld's \"Best Places to Work in IT\" list for 13 years running, hitting #1 the last five years. We were also ranked #14 in FORTUNE Magazine’s list of \"100 Best Companies to Work For\" in 2018, remaining in the top-30 for the past 15 years.What You'll Do/NeedQuicken Loans is looking for a passionate and driven Net Software Engineer. The Net Software Engineer designs, modifies, develops, writes and implements software programming applications and components. This sharp minded team member supports and/or installs software applications and components. This resourceful individual works from written specifications and pre-established guidelines to perform the functions of the job and maintains documentation of process flow. ResponsibilitiesCollaborate with other engineers, developers, architects, QA, system engineers and product managers in solving new and existing technical issuesUnderstand requirements, implement designs, provide administration tools, and documentation for specific projectsDevelop in C# environment, developing web applications, WPF, WCF, and web servicesPerform regular on-call dutiesParticipate in Design and Code ReviewsFollow and enhance existing development processesMeasure and verify that new and old code has acceptable performance and scalabilityMaintain ownership of the projects assignedConsistently meet project deadlinesRequirements.Net and Object Oriented programming experience including .Net 2.0/3.0/3.5 Framework and C#.Next and SQL Server experienceExperience building ASP.NET applicationsUnderstanding of IIS/Webservice/XML/XSLExperience with software lifecycleBachelor’s degree or significant relevant experience What You'll Get Excellent benefits package that includes a 401(k) match, medical/dental/vision, and much moreOpportunities to participate in professional and personal development programs, including personal empowerment coaching, leadership training and ongoing personal growth trainingOther incentives, contests and rewards, including trips, event tickets, cash prizes and moreWhy We're Different Corporate politics not your strong suit? The anti-corporate culture of Quicken Loans gives our team members the initiative to build solutions together and grow both personally and professionally. At Quicken Loans, we’re in the business of putting roofs over our clients’ heads, but we certainly aren’t putting ceilings on our team members’ careers. If you’re interested in working in a place with a philosophy that’s truly different, apply today.  Quicken Loans is an equal opportunity employer. Quicken Loans received the highest numerical score in the proprietary J.D. Power 2010–2016 Primary Mortgage Origination and 2014–2015 Primary Mortgage Servicer StudiesSM. 2016 Origination (or Sales) based on 4,666 total responses and measures experiences and perceptions of consumers who originated a new mortgage, surveyed in July–August 2016. 2016 Servicing based on 5,922 total responses and measures experiences and perceptions of consumers with their current mortgage servicer, surveyed in March–April 2015. Your experiences may vary. Visit JDPower.com.Quicken Loans is the #1 online lender and the second largest retail mortgage lender in the U.S., according to National Mortgage News, Quarter 2, 2016.Apply"}