{"jobID": "2705219306", "jobLocation": "Chantilly_VA", "jobTitle": "Data Scientist - Visallo", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "135000", "jobDescription": " Data Scientist - Visallo Req #: 205688Location: Chantilly, VA USJob Category: Information TechnologySecurity Clearance: TS/SCI with PolygraphClearance Status: Must Be CurrentJob Description What You’ll Get to Do:  You will plan and implement security measures to protect our clients information systems; review and respond to security alerts, scans, and audits; investigate suspicious alerts and logs, tune security log analysis and alert systems; coordinate security incident response; test and maintain the integrity of our security monitoring systems; and report on information systems security status, standards compliance, and deficiencies.  More About the Role: Performs security analysis of large network devices and systemsKnowledge of stand-alone automated configuration management systems (e.g.: Chef Solo, Ansible, Kickstart)Knowledge of IT defensive best practicesAbility to pay attention to details, ensuring accuracy in documentation and data.Construct and exploit open source and classified threat intelligence to detect, respond, and defeat advanced persistent threats (APTs)Fully analyze network and host activity in successful and unsuccessful intrusions by advanced attackersConduct advanced threat hunt operations using known adversary tactics, techniques and procedures as well as indicators of attack in order to detect adversaries with persistent access to the enterpriseCreate and add custom signatures, to mitigate highly dynamic threats to the enterprise using the latest threat information obtained from multiple sourcesCorrelate data from intrusion detection and prevention systems with data from other sources such as firewall, web server, and DNS logsNotify the management team of significant changes in the security threat against the government networks in a timely manner and in writing via established reporting methodsCoordinate with appropriate organizations within the intelligence community regarding possible security incidents You’ll Bring These Qualifications: Must have an active TS/SCI with PolyBachelor’s degree in a related scientific or technical disciplineThree or more years of experience as a data scientist, working in mixed-specialty teams (e.g. teams of software developers, analysts, and data scientists)Ability to work in a fast-paced environment of rapidly changing requirementsKnowledge of the Intelligence Community's mission, vision, goals, and valuesPossession of solid oral and written communications skillsISSA/TS credentials  Experience in the creation and adjustment of Visallo Software Data ModelExperience performing Extract, Transform, Load (ETL) manipulations on both custom and commercial data sourcesExperience prototyping visualizations within Visallo Software These Qualifications Would be Nice to Have: Experience in basic server hardware setup and configurationExperience in installation and maintenance of Visallo Software What We Can Offer You: We’ve been named a Best Place to Work by the Washington Post.Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives.We offer competitive benefits and learning and development opportunities.We are mission-oriented and ever vigilant in aligning our solutions with the nation’s highest priorities.For over 55 years, the principles of CACI’s unique, character-based culture have been the driving force behind our success. Job Location US-Chantilly-VA-VIRGINIA SUBURBAN  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}