{"jobID": "2628929718", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.creditsesame.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Credit Karma, NerdWallet, Bankrate"}, "estimatedSalary": "74000", "jobDescription": " Credit Sesame is the nation’s leading financial & credit wellness brand, driven to help people achieve their financial goals.  Since 2010 we’ve led millions of consumers to personal financial growth at no cost to the consumer. Our truly free service gives members a customized financial dashboard complete with their credit score, credit report card, and debt analysis. As part of our commitment to improving our member’s financial lives we also give free identity theft protection and personalized recommendations to assist in saving money, accessing credit, and improving creditworthiness  We are looking for a senior data analyst who can help drive business intelligence efforts and support the growth of the analytics team. This role provides an opportunity to solve the company’s most interesting problems and develop new business strategies  What will you do?  Regularly mine data from large SQL databases  Build models that lead to better insights and business understanding  Design and maintain reports and dashboards to track and communicate Credit Sesame’s key performance indicators  Assure quality and data integrity for revenue and business development  Interact with data source owners and participate in developing project plans.  Provide original insights beyond the scope of supporting reactive  requests  Mentor and guide junior team members Qualifications 4+ years of relevant experience  Mastery of SQL  Excellent programming logic with comprehension of at least one scripting language  Exposure to Statistics, Econometrics, Data Science, and Machine Learning concepts and tools  Adaptable in a startup environment with the ability to move quickly  Past experience in financial services/technology and/or a passion for FinTech  eCommerce background preferred  Engineering/technical background analyzing large data sets.  Advanced skill level utilizing Python and R, to analyze and solve business problems.  Experience as an analyst in the following areas; marketing, email and customer insights.  Extensive A/B testing knowledge and application, to support the product team.  Quantitative degree preferred.  Masters’ degree a plus.  Why Credit Sesame?  Work with purpose - join us as we empower consumers to achieve their financial goals  Fun and casual work environment  Catered meals twice weekly  Comprehensive medical, dental, vision insurance  Equity in a startup backed by top-tier VCs  Gym in building and monthly fitness reimbursement  Open paid time off  Stocked kitchen with tasty snacks and drinks  One block from Montgomery Street Bart  Company outings throughout the year  Growth opportunity in a fast-growing company  The best co-workers in Silicon Valley"}