{"jobID": "2724609319", "jobLocation": "Los_Gatos_CA", "jobTitle": "Software Engineer/Data Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.netline.com", "Headquarters": "Los Gatos, CA", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "85000", "jobDescription": " Join our core engineering team that is developing NetLine's next generation lead-generation and online marketing solutions. Our team is working on a number of cutting-edge problems including building massive company and user profile databases, automating the process of gathering and verifying data, high traffic web applications, in-depth analytics and web-based marketing automation applications. Our software is built using Perl, PHP, Python, MySQL, memcache, Javascript & jQuery. RESPONSIBILITIES:Build systems to gather data from the web and other sources and cleanse, merge, structure and standardize it. Build scalable solution that can support 50-100M records per database.Design, build, document, test, release and support new components of our web-based user-facing applications.Maintain and support existing web applications by fixing critical bugs and adding new features.Analyze traffic and usage patterns and make recommendations for optimizing the performance and effectiveness of the applications.Build up Machine Learning (ML) expertise to apply ML to predictive targeting of ads to people, ranking sales leads and various other problems.Collaborate with other engineers on team projects, design reviews and code reviews. REQUIREMENTS:BS in Computer Science; MS preferred.1-3 years of work experience.Experience using Perl, PHP, Python or C++ in a Unix/Linux environment.Experience using databases and MySQL.Experience with algorithms and machine learning.Strong verbal, written and interpersonal communication skills.High levels of energy and creativity, and an enthusiasm for solving challenging problems."}