{"jobID": "2817690306", "jobLocation": "Seal_Beach_CA", "jobTitle": "Flight Data Technical Specialist", "companyRating": "3.5", "companyInfo": {"Website": "www.boeing.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1916", "Type": " Company - Public (BA) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Lockheed Martin, Northrop Grumman, Airbus"}, "estimatedSalary": "71000", "jobDescription": " Company  The Boeing Company  Job ID ********* Date posted 06/13/2018 Location  Seal Beach California United States Job Description The Boeing Company is seeking a Flight Data Technical Specialist (Mid-Level) to provide customer support within Boeing Commercial Airplanes Services in Seal Beach, CA. POSITION RESPONSIBLITIES: Evaluates information to define, document and maintain coverage of an airplane system, as related to flight crew operations procedures, operations manuals, checklists, and flight operations data.  Provides assistance and coordination with airline personnel to resolve flight crew operations issues and provides consultation related to in-flight emergencies and accidents.  Under the direction of the model engineer and model editor, converts engineering data for use by flight crews; develops flight operations data to support customer, regulatory agency, industry and company  requirements.  Assists with collecting information on customer publishing systems and digital data needs.  Assists with obtaining regulatory authority certification/approval of flight operation and engineering documents.  Relocation Assistance, based on Eligibility.  Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.  Division  BCA Engineering  Relocation Assistance Available  Yes. Available for eligible candidates, if authorized. Qualifications This position must meet Export Control compliance requirements, therefore a US Person as defined by 22 C.F.R. 120.15 is required. US Person includes US Citizen, lawful permanent resident, refugee, or asylee. Basic Qualifications (Required Skills/Experience): Bachelor's degree is required  3 or more years of experience working around live aircraft and flight operations Preferred Qualifications (Desired Skills/Experience): The ideal candidate will typically have at least 5 to10 years' experience in support of aerospace products, which should include commercial or military airplane flight operations. Typical Education/ Experience: Bachelor's and typically 6 or more years' related work experience, a Master's degree and typically 4 or more years' related work experience or an equivalent combination of education and experience.  Experience Level  Individual Contributor  Job Type  Standard  Travel  No  Contingent Upon Program Award  No  Union  No  Job Code GKF7P3"}