{"jobID": "2836710827", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data AnalystPosition Number: 289868Location: Plano, TXDesired Skill Set: Data Analysis, SQL, TypingPosition Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Title: Customer Data Quality Analyst  Duration: 12 months+  Location: Plano, TX Summary:The Business Intelligence organization manages business (non-technical) functionality of the enterprise customer master database. Major areas of responsibility for this group include:Performing manual data corrections, both proactively and in responsive to problem ticketsIdentifying data-quality trends which may indicate application or system-integration defectsWorking with information-technology resources to perform root-cause analysis for incorrect dataTracking identified data-quality issues for resolutionCoordinating with information-technology resources to prioritize system/integration issues for resolutionDeveloping and maintaining procedural documentation around data-corrections processesRepresenting the BI organization on initiatives which impact customer dataDeveloping and executing user-acceptance and regression test plans for defect fixes, enhancements, and project implementationsTraining incoming team members in these job functionsParticipating in other Business Intelligence data-quality initiatives as neededThe training period is extensive due to the complexity of the applications and research requirements, so the first few months of work are primarily data-entry, with new responsibilities added as the resource becomes proficient in each new task. What is the project(s) name?  BI Data Quality  What specific Client departments will they interact with? Business IntelligenceBusiness Technology SolutionsCustomer Assistance CentersCSC OperationsLegal / ComplianceOther business groups as needed/appropriate What phase is the project currently in? This is an ongoing core-support effort with some dependencies on other projects which affect team workloadRequirements:Must Haves:Typing ~30 WPMProficiency with Microsoft Office applicationsTech-savvy (will be utilizing 6+ enterprise application + MS Office)Basic data-analysis aptitudeWillingness to travel to Torrance for several periods of training (week at a time)OrganizedDetail-orientedConscientiousLogicalAn effective verbal and written communicatorNot expecting to do coding, programming, or any other hands-on technical workAble to create and maintain documents in Word, Excel, etc.One nice-to-have would be experience is creating and executing user-acceptance tests, but that can be trained for.Preferred/ Nice-to-haves:Experience with Microsoft Access databasesHyperion and/or SQLExperience with integrated enterprise applicationsExperience with basic compliance requirements in finance industryRecent college graduate would be preferred"}