{"jobID": "2838080142", "jobLocation": "Torrance_CA", "jobTitle": "Production Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.varite.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This job exist to ensure timely and accurate site supply chain SAP transactions as well as to lead the reconciliation actions necessary to resolve inventory and cost transaction discrepancies. Provide professional administrative support including expertise in the Microsoft Office Suite in a fast-paced, total quality environment with limited supervision, performing diversified administrative duties, confidential record and file maintenance and mail distribution. Duties include administrative project management, regular use to major site electronic databases, limited scheduling and planning of employee events, responding to general questions for the organization, and assistance in preparing reports and presentations. ACTIVITIES: Responsibilities include but are not limited to: Key job responsibilities as PDA:On an on-going basis maintain/ensure accurate inventories, NOT just at month end. This includes creation and management of plant cycle counting system for all plant raw materials. On an on-going basis, support the Business Cost Accounting in performing/complying with required inventory and cost verification initiatives: Annual Stock Take Observations (STOs), Sarbanes Oxley compliance audits as directed by the corporate finance department. Create, maintain and verify the accuracy of BOMs, routings, perform raw material receipts. Work with Torrance logistics technicians and purchasing to trace raw materials not received. Maintain list and system for identifying slow moving raw materials. On an on-going basis, support the Site Logistics Coordinator, Production Scheduler, and Plant Process Engineer. Act as short term backup (estimate 1 2 day terms) for Production Scheduler role in entering/re-arranging SAP production orders (if needed) and raw material tracking/elevating purchase requisitions.Provide weekly reports/metrics on raw material inventory (including bulk raw materials) to the plant operations including the plant production scheduler.Initiate and lead the inventory discrepancy Root Cause Investigations and resolve the discrepancies to prevent recurrence. Key job responsibilities as Administrative Assistant:Supports Requisition Data entry for Maintenance Department.Supports accounts payable to make sure invoices are paid on time. Works with vendors on goods movement and deliveries.Using SAP, enter purchase requisitions and process it for payment in SAP. Reconciles Goods Receipts into SAP.Work with corporate purchasing to resolve invoicing issues.Orders office supplies, coffee, printer supplier, paper supplies.Maintains services such as janitorial, vending machine, uniforms, printer and copiers, etc. Office contact for Avaya phone system including setting up new employees and troubleshooting. Responsible for the administration of bi-weekly payroll for all hourly employees using Kronos time keeping system. Plant Library administrator and document administrator using document management database (AIMS).Designated document control coordinator for the Client Coating Resins Torrance site.Manages operational records: BOP, shift critical checklist and mail distribution.HSEQ responsibilities: Employee is expected to maintain a healthful and safe working environment and is further expected to:Meet all legal, regulatory and other *requirements of the site through general awareness and training. Participate in HSEQ *activities provided by the site management. Client Coating Resins and Client, Inc. Identify and communicate the potential gains and possible improvements related to the work environment and management system through employee suggestion programs, during group meetings, or through *other identified communication tools.Report all health, safety, environmental and quality (HSEQ) near-miss, accident or injury incidents to their supervisor and the HES Coordinator or site manager through *means identified during orientation or *refresher training. Remain in compliance with the *rules, *standard procedures and *work instructions related to the specific job title and site location.Complete *assigned training through Client learning management system or attendance to assigned Web-Ex or Instructor Led Training (ILT) classes.Employee will be provided tools and references during orientation or during initial and refresher training to ensure his/her access to and knowledge of these expectations.CONTEXT AND ENVIRONMENT: This is a plant-based position that will work closely with plant operations, scheduling, purchasing and accounting. ACCOUNTABILITIES:Work with the plant operations and Process Engineer to maintain integrity of production routings. Take independent action; influence events to achieve results; seize opportunities in a responsive manner; have a bias for action and taking appropriate risks.Contribute to effective team output by cooperation, participation and a commitment to shared vision and goals.QUALIFICATIONS / EXPERIENCE REQUIRED:HS Diploma required. Associates or Bachelors degree in Business or Supply Chain discipline (preferred)Minimum 2 years Manufacturing, Supply Chain or Logistics experienceMinimum 2 years MRP experience required. SAP experience (preferred) Physical inventory, cycle counting techniques/methodology knowledge with variance investigation experience. Data reporting and analyses: Utilize the business data warehouse and canned report queries along with Excel, to generate, analyze, communicate, and visualize data trends and data accuracy improvement opportunities. Apply"}