{"jobID": "2834847512", "jobLocation": "McLean_VA", "jobTitle": "Intelligence Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.saic.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (SAIC) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Booz Allen Hamilton, CACI International, CSRA"}, "estimatedSalary": "58000", "jobDescription": " Intelligence Data Analyst (Job Number:437628) Description: Joining our Intelligence Data Analysts will afford you the ability apply and enhance your skills with developing, running, and analyzing results of complex queries against massive scale data stores/data processing environment(s). You will also increase your skills with the following: Manipulating high-volume structured and unstructured data to perform analysis and generate reporting/products.Using analytic techniques and tools performing technical targeting analytic support to the Sponsor Agency.Developing and using computer languages (e.g. Python, R, Pig, Java, C, SQL, ECL) to perform large scale parallel processing of data, and to develop, validate, and use methodologies to support analytic requirements in Clustered Computing environments.Performing All-Source data analysis to perform technical targeting analytic support in the Intelligence Community.ICAF*Qualifications:Required Education and Experience:Bachelors and two years or more experience.Intelligence Data Analysis experience.Current active TS SCI with Polygraph security clearance.Desired Experience:Graduate degree in computer science, information systems, engineering, or other scientific or technical discipline.Demonstrated practical experience using open source Enterprise Control Language (ECL) and the open source High Performance Cluster Computing (HPCC) platform.Demonstrated experience using analytic techniques and tools performing technical targeting analytic support to the Sponsor Agency.Demonstrated experience developing custom algorithms to support analytic requirements against massive data stores.Demonstrated practical experience directly supporting the Sponsor, performing technical analysis or targeting support using massive data processing systems.10K SAIC Overview:SAIC is a premier technology integrator providing full life cycle services and solutions in the technical, engineering, intelligence, and enterprise information technology markets. SAIC is Redefining Ingenuity through its deep customer and domain knowledge to enable the delivery of systems engineering and integration offerings for large, complex projects. SAIC¿s approximately 15,000 employees are driven by integrity and mission focus to serve customers in the U.S. federal government. Headquartered in Reston, Virginia, SAIC has annual revenues of approximately $4.5 billion. For more information, visit saic.com. For information on the benefits SAIC offers, see ( My SAIC Benefits. EOE AA M/F/Vet/Disability  Job Posting: Jun 22, 2018, 8:41:32 PM  Primary Location: United States-VA-MCLEAN  Clearance Level Must Currently Possess: Top Secret/SCI with Polygraph  Clearance Level Must Be Able to Obtain: Top Secret/SCI with Polygraph  Potential for Teleworking: No  Travel: Yes, 10% of the time  Shift: Day Job  Schedule: Full-timeSDL2017"}