{"jobID": "2777057314", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Machine Learning Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "155000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. Senior Machine Learning EngineerLocation: San Francisco (SoMa) The Senior Machine Learning Engineer within the cloud-engineering group will deliver optimizable interactions across PlayStation experiences and systems by designing, coding, training, documenting, cost-effectively deploying and evaluating very large-scale machine learning systems.  We are looking for someone who can build delightful products and experiences for millions, in an agile environment, alongside an excellent cross-functional team across Engineering, Product and Design. Further, they will mentor others in machine learning technologies, tools and processes, as they help to advance our technical objectives and architectural initiatives.  Qualifications: MS with a specialization in machine learning and hypothesis testing. PhD preferred6+ years of work experience in building software solutions that ideally include: recommender systems, personalization, forecasting, conversational systems, outlier detection, and hypothesis testingExpert analytical and problem-solving skills; proficient in data-driven clustering, classification, ranking, and estimation techniquesExperience with machine learning frameworks such as MLlib, TensorFlow, Caffe, or PyTorchExperience programming in Python, Java, Scala, or similar modern languageExperience with Agile/Scrum software development methodologies; experience with engineering best practices Preferred qualifications: Experience with open source tech stack such as Spark, Presto, Apache Zeppelin, and Apache ParquetExperience in developing for a distributed environment Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.  We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.  We sincerely appreciate the time and effort you spent in contacting us and thank you for your interest in PlayStation.  #LI-SA1"}