{"jobID": "2803579637", "jobLocation": "Chicago_IL", "jobTitle": "Environmental Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.gza.com", "Headquarters": "Norwood, MA", "Size": "501 to 1000 employees", "Founded": " 1964", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " GEI, Haley & Aldrich, Inc, AECOM"}, "estimatedSalary": "48000", "jobDescription": " Huff & Huff, Inc. a subsidiary of GZA (H&H;/GZA) is currently seeking an Environmental Scientist to support our environmental natural resources practice in our Oak Brook, Illinois, office. The successful candidate will have a solid educational background, and must be self-motivated with a professional attitude.  As an Environmental Scientist, you will work on a fast-paced team of Scientists, Engineers, Project Managers, and Principals. We are seeking a mid-level Environmental Scientist with experience in natural resource and environmental field work and supporting report preparation. The qualified candidates must have a minimum of 3 - 5 years of professional experience with the following environmental activities: Wetland Delineations;Wetland and Stormwater Permitting;Floristic Quality Assessments;Erosion and Sediment Control Monitoring; Our close-knit culture here at H&H;/GZA will allow you to grow professionally. You will be mentored by seasoned professionals, who will in turn look to you to share technical knowledge and ideas. Our success relies on this collaborative environment. Between field work projects, you will work in a professional office setting, preparing detailed and accurate field documentation, data analysis and reporting. Qualifications:BS/MS in Biology, Environmental Science, Engineering, or Natural Resources or related fieldStrong Microsoft Office Word and Excel skillsKnowledge of AutoCAD and GIS preferredPlant identification experience preferred (emphasis on wetland plants)Understanding of Soil Erosion and Sediment Control Best Management Practices preferredStream Survey Experience a plus (fish, mussels, macroinvertebrates)NEPA experience and field experience a plusWater Quality issues/evaluationsAvailability to work Monday through Friday and some evenings and weekendsAbility to travel locally and regionallyA valid driver’s license in good standingAbout GZA:Professional development and enrichmentStable work environment Generous, company-subsidized benefits package, including medical, dental, vision and 401K retirement plan  GZA GeoEnvironmental, Inc. is an Affirmative/Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, national origin, ancestry, sex, sexual orientation, physical or mental disability, citizenship status, marital or veteran status, age or other protected status.This is a full time position"}