{"jobID": "2837233573", "jobLocation": "Summit_NJ", "jobTitle": "Senior Principal Scientist, Translational Development", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employer is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture. Context: Employer Corporation, headquartered in Summit, New Jersey, is an integrated global biopharmaceutical company engaged primarily in the discovery, development and commercialization of novel therapies for the treatment of cancer and inflammatory diseases through gene and protein regulation.  Employer R&D; is at a critical and exciting phase of development. As it expands and integrates its portfolio, there is an opportunity for a dynamic and resourceful individual to lead our efforts in Translational Development at our site in New Jersey. Translational Development at Employer Translational Development is part of the Global Research and Early Development organization in Employer and leads early stage clinical, pharmacological and translational research and development activities for the pipeline and supports late stage portfolio for regulatory, translational development and life cycle management. Translational Development is in the process of organizing a late translational group to support multiple disease areas of interest including MDS/AML, Myeloma, Lymphoma, CLL or other hematological malignancies. This group will integrate scientific and business insights of multiple functions and lead the development of translational strategies at the franchise level and implement them in project teams to maximize the potential of Employer drugs. Summary: Reporting to the Disease Leader, Translational Development, the Senior Principal Scientist, Translational Development will be part of the late translational group based in Summit NJ and will be leading translational projects in the area of responsibility . Key responsibilities of this role is to act as the translational representative in Project teams for Employer drugs and assume primary responsibilities for supporting projects and key strategic areas. Technical Skills:Basic understanding of Multiple Myeloma and/or other heme malignanciesBroad understanding of drug discovery & development especially late stage development and approval process and life cycle managementKnowledge of biomarker discovery and development: assay development/validation, clinical discovery of biomarkers, MoA research, knowledge of platformsAuthoring of biomarker portion of clinical protocols, drug study reports, regulatory submissionsAnalysis of biomarker data in preclinical and clinical settingBasic understanding of technical aspects of companion diagnostics development; partnerships, due diligence experience, project experience (IDE development; Diagnostic protocol etc.)Life cycle management, IIT studies, collaboration experience is criticalProven scientific/leadership expertise (working in teams, managing people/projects)Proven publication recordStrong verbal and written communication skillsAbility to synthesize complex scientific and business problems into strategy and tacticsBasic understanding of IP, contracting terms and provisionsResponsibilities:Represents Translational Development in Project team/Franchise team, other cross-functional teams as neededCreates disease specific translational goals and is accountable for their deliveryResponsible for the development of the translational section of Employer clinical protocols in trials and represents biomarker plans at key review meetings and plans executionLeads the analysis of biomarkers for Employer clinical studies by working with relevant functions and CRO as needed and generates Biomarker study reportLeads the review of external preclinical proposals, key IIT proposals that include correlativesDevelops yearly budget for translational program for assigned projectsCreates SOW and interfaces with CRO for execution of services Maintains and oversees biomarker inventory for Employer clinical trials and collaborative samples Assists in managing key collaborative projects Assists in the development of disease specific strategy for Employer Supports regulatory submissions, regulatory interactions, writes translational sections for regulatory response and answers to regulatory queries.Communicates regularly and prepares and makes presentations within the department and externally as requiredSupervises scientific and technical staff for research and assay development, execution and analysisParticipates in translational research in the Summit lab of EmployerQualifications:Strong background in cancer biology, especially hematological cancersExtensive working knowledge of biomedical research methodologies and current state-of-the art genetic analysis technologiesExperience in clinical development process in an industry settingExperience in clinical assay development, clinical biomarker discovery is essentialKnowledge of GLP, assay validation methodologies, and regulations that apply to clinical laboratory studies that support regulatory submissions is requiredAbility to manage scientific collaborations and contracted researchProven written and oral communication skillsEffective team building and teamwork skills with multiple functionsDetail-oriented with the ability to identify and implement creative solutionsAbility to prioritize and manage time efficientlySome experience with supervision and mentoring of laboratory/ scientific staff is desirableOther Attributes:Able to anticipate problems at project level.Proven track record of scientific approach to complex problem solving.Demonstrate in-depth, scientific-directed, innovative thinking.Advises on departmental goals.Recognizes interrelationships of facts/factors, processes, and systems.Recognize risk and propose contingency plans.Acts as a resource to peers in developing new, innovative approaches to experimental design.Independently (or using collaborations) develop scientific direction for assignments.Recognize cross-functional issues .Communicates within the larger organization.Develops constructive relationships across organization to achieve the goals of the function and the business through leadership roles on cross-functional/divisional teams.Communicates within the larger organization and external community.Provides expert guidance to multi-disciplinary teams and senior management.Requirements & Education: PhD in life sciences or medical sciences, and a minimum of 8 years of directly relevant biotechnology or pharmaceutical industry experience. Candidate must be detail-oriented with excellent record keeping and organizational skills. Must be a highly flexible, results oriented, independent self-starter who enjoys working in a fast paced dynamic environment.  #LI-POSTEmployer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Employer complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Employer in the U.S."}