{"jobID": "2782430240", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Modeling Analyst", "companyRating": null, "companyInfo": {"Website": "www.keakitech.com", "Headquarters": "Honolulu, HI", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Modeling Analyst  Location  TX - San Antonio  Job Code  4571  # of openings  1  Apply Now Ke`aki Technologies is looking for qualified Data Modeling Analyst to support an Air Force Medical Services (AFMS) contract by providing expertise in the areas of Advanced Statistical Analysis and Methods including Data Modeling / Predicitive Analytics.DUTIES INCLUDE:Explore data, identify problems and develop analytical plans accordingly.Write detailed specifications for analysis plans and data files.Apply descriptive and multivariate statistical methods.Analyze data and interpret results to identify significant differences in relationships.Evaluate sources of information to determine any limitation in terms of reliability or usability.Evaluate procedures used to obtain data to ensure validity, applicability, efficiency and accuracy.Identify relationships and trends in data, as well as any factors that could affect results.Validate, manipulate and perform data analysis on large datasets and “big data”.Interpret and present results in a way that allows for effective decision making.Develop system and service line‐specific data models to aid descriptive and predictive analysis of the AFMS patient population and healthcare system.Develop, maintain and utilize data management techniques such as relational databases to manage the flow of information between organizations and various information systems within the AFMS, MHS or other government agencies, where appropriate.Build predictive models using a variety of statistical, established and innovative, techniques.Assess and continually monitor the performance of predictive models and the impact on related outcomes.Develop automatic generation of standard updates covering modeling and performance metrics.Test and evaluate new software packages.Provide consultation to clients or colleagues.REQUIRED SKILLS AND EXPERIENCE:Expert knowledge of relational database software; proficiency in applied statistics using SAS, SQL or other statistical programs.Prior experience implementing or supporting clinical information systems (CHCS, AHLTA, and/or Essentris experience preferred, but not required). Five (5) years’ experience in the area of medical/clinical/health data, health care data analysis and management.Two (2) years’ experience working in the area of quality improvement. Two (2) years’ experience developing and deploying clinical performance metrics.Proficiency with basic SQL for data manipulation and/or SAS Institute’s statistical analysis software package.One (1) year of software management and data retrieval experience.Proven ability to synthesize disparate facts from multiple sources and coalesce into an accurate and useful analytic product, incorporating Service and MHS strategic goals for use by leadership in both tactical and strategic decision making.Demonstrated ability to provide accurate and timely analytical products containing well‐reasoned and cogent discussion points providing leadership with substantiated options or courses of action.Demonstrated ability to organize/participate/lead working groups to develop analytic products and byproducts or to develop/understand processes leading to effective optimization of analytic efforts.Demonstrated ability to effectively and clearly communicate analytical discoveries and appropriate recommendations/mitigation strategies to all levels of customers including Senior AFMS leadership.Demonstrated advanced proficiency in Microsoft Office products PLUS additional software/hardware skills and capabilities.Ability to critically examine and evaluate, problem-solve.Demonstrated ability to undertake and complete multiple tasks with multiple deadlines simultaneously.Ability to deliver products on time, on schedule, within budget.Flexibility and ability to adapt to rapidly changing and often time-constrained environment.Ability to acquire skills/capabilities necessary to meet growing needs/demands of systems/software/hardware.DEGREE/EDUCATION/CERTIFICATION REQUIREMENTS:Master’s degree in Statistics, Mathematics, Computer Science or related quantitative field of study or equivalent combination of education and experience. CITIZENSHIP/SECURITY CLEARANCE REQUIREMENTS:Must have an active Tier 3 background check to obtain a common access card (CAC)Must be a U.S. CitizenThe Alaka`ina Foundation Family of Companies (FOCs) is comprised of industry-recognized government service firms who are designated as Native Hawaiian Organization (NHO)-Owned and fall into the respective categories of standard Small Business, 8(a) certified Small Disadvantaged Business (SDB), and HUBZone. The FOCs includes Ke`aki Technologies, Laulima Government Solutions, Kūpono Government Services, Kāpili Services, and Po`okela Solutions. Alaka`ina Foundation activities under the 501(c)3 principally benefit the youth of Hawaii through charitable efforts which includes providing innovative educational programs that combine leadership, science & technology, and environmental stewardship.For additional information on Ke`aki Technologies, LLC, please visit www.alakainafoundation.com.We are an Equal Opportunity/Affirmative Action Employer of individuals with disabilities and veterans. We are proud to state that we do not discriminate in employment decisions on the basis of race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. If you are a person with a disability and you need an accommodation during the application process, please click here to request accommodation. We E-Verify all employees."}