{"jobID": "2665502564", "jobLocation": "Glenview_IL", "jobTitle": "Category Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.na.com", "Headquarters": "Glenview, IL", "Size": "201 to 500 employees", "Founded": " 1919", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Category Data Analyst Location  IL - GlenviewApply NowNorth American is a recognized leader in distribution, supply chain synchronization, and integrated business solutions. Founded in 1919, North American has built an innovative and highly specialized business practice helping companies improve supply systems that have grown inefficient, non-customer-centric and costly. Commercial Products Group — Complete facility supply management, sanitary maintenance programs and foodservice disposables. Packaging Systems Group — Full-service packaging solutions from equipment and supplies to technical service and support. NVISION Marketing Supply Chain Group — Streamlines the supply chain of marketing organizations to create a single point of control for how marketing materials are managed, produced and distributed. Position Overview We are currently seeking a Category Analyst with strong project management, analytical and product management skills. Reporting to the Category Project Manager, this position will interact with all aspects of the Commercial and Industrial sales team, purchasing and cross-functional team. The primary responsibility of this position is to lead primary tasks/projects on key sales programs and work closely with sales and category leadership to develop reporting and business analytic tools. Responsibilities Include:Work on projects supporting gross margin cost improvements, financial analysis on key business issues, and reporting.With direction from the Category Project Manager, drive system enhancements and user training relating to category management projects.Maintain project plan and key milestones to ensure timeline and budget achievement.Responsible for identifying, interpreting and analyzing trends to achieve company’s business goals.Develop reporting capabilities and monitor system to identify areas of improvement for sales and category teams.The ideal candidate will have:2-5 years experience in business analytics, change management and/or process improvement.Proven working experience as a data analyst or business data analyst.Ability to conduct cost and benefit analysis.Advanced Microsoft application experience.Excellent verbal and written communication skills.Ability to prioritize and manage multiple assignments and meet tight deadlines. This position offers a competitive starting salary and comprehensive benefits program.  North American (and its subsidiaries) is an Equal Opportunity Employer. This means that we consider all applicants for employment and employees eligible for employment without regard to race, marital status or civil union status, sex, age, color, religion, national origin, veteran status, mental or physical disability, sexual orientation and/or any other characteristic protected by law. We also provide reasonable accommodations to our applicants and employees with disabilities in order to assist them in the performance of their essential job functions."}