{"jobID": "2817183327", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.porsche.com", "Headquarters": "Atlanta, GA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "139000", "jobDescription": "Job Description With headquarters in Ludwigsburg (near Stuttgart, Germany) and offices in Berlin and Silicon Valley, Porsche Digital is a wholly-owned subsidiary of Porsche AG and serves as it’s digital competence center.  By putting the customer at the heart of our values, we seek to discover and enhance the digital experiences, develop new products, services and features, as well as identifying new business models and opportunities for Porsche and our partners. We are looking for a Senior Data Scientist to join our Silicon Valley team and help create new and engaging data-driven services & products by leveraging and smartly combining customer & vehicle data. Senior Data Scientist ResponsibilitiesAnalyze and combine (customer-) data from different sources e.g. vehicle, smartphones, websites, social-feeds and company CRM- databases to drive the development of new so far non existing products and services and help to optimize and improve existing customer facing products and business strategies.Collaborate closely with internal “subject matter experts” e.g. (vehicle-) engineers, product-owners, product-marketing, etc. to help understand the potential of smart data-analytics for internal product-improvement as well as new data-driven customer-solutions. This includes working with stakeholders throughout the organization to identify relevant data-points that can be leveraged to improve the (digital) customer experience.Work together with internal counterparts to establish a new (cloud based) data-architecture that enables the development and implementation of new and unique data models and algorithms as well as machine learning capabilities to facilitate new digital products and services.Use predictive modeling to generate entirely new customer experiences and help optimize revenue generation, ad-targeting and other business outcomes.Develop processes and tools to monitor and analyze model performance and data accuracy & assess the effectiveness and accuracy of new data sources and data gathering techniques.Senior Data Scientist Skills We’re looking for someone with 5-7 years of experience manipulating data sets and building statistical models, has a Master’s or PHD in Statistics, Mathematics, Computer Science or another quantitative field Knowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.)Experience working with and creating data architecturesStrong problem solving skills with an emphasis on product development.Knowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks.Extensive background in data mining and statistical analysisAble to understand various data structures and common methods in data transformationExcellent pattern recognition and predictive modeling skillsAbility to identify (and verify with data) new opportunities by combing business, customer & product information and being able to transfer technical knowledge & insights into business valueCoding knowledge and experience with programming languages such as: C, C++, Java, JavaScript, etc.Knowledge & experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.Experience querying & manipulating large data sets using statistical computer languages: R, Python, SLQ, etc.Experience using web services: Redshift, S3, Spark, DigitalOcean, etc.Experience creating & using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.Experience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc.Experience visualizing/presenting data for stakeholders using: Periscope, Business Objects, D3, ggplot, etc."}