{"jobID": "2805335811", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate HR Business Partner", "companyRating": "3.2", "companyInfo": {"Website": "www.gsn.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Big Fish Games, DoubleDown Interactive, Zynga"}, "estimatedSalary": "102000", "jobDescription": "GSN Games is looking for an Associate HR Business Partner to join our team in San Francisco! About GSN Games HR: From recruiting to employee engagement, we make sure our teams have everything they need to create amazing games. We manage benefits, coordinate professional development opportunities, host office happy hours, and more!  The Associate HR Business Partner will partner closely with management and business leaders across our various studios and shared services to provide guidance, direction and influence that promote our business goals and objectives. Other responsibilities include but are not limited to; new hire onboarding, employee relations, employee engagement initiatives, as well as managing the responsibility of building a strong corporate culture in our west coast offices. What You'll Do:Working closely with management throughout the organization, execute people strategies that support our business goals and objectives and enable growth for the businessRespond to employee inquiries and concerns related to HR and ensure a timely and courteous resolutionConduct new hire orientation with new employees in both the San Francisco and Palo Alto offices.Partnering with management, provide guidance in resolving employee relations issues ranging from performance management, retention, talent development and employee engagementConduct research on HR best practices and trends and make recommendations for improvementsAssist with the coordination of company culture initiatives in the San Francisco and Palo Alto offices, such as volunteer days or office eventsAssist with HR projects and reporting as needed About You:Bachelor's degree, preferably with a focus in HR or a related discipline (Psychology, Sociology etc.)3+ years' experience in a dynamic HR role. Strong preference will be given to candidates who are coming from the games, e-commerce, or computer software industriesAbility to effectively build relationships by establishing trust and credibility as well as influence employees at all levels of the organizationExcellent verbal, written and interpersonal communication skillsAbility to keep confidentiality in all HR mattersAbility to maintain a positive and professional attitude, particularly in all employee facing situationsVersatility, flexibility, and a willingness to work within constantly changing priorities with enthusiasmWillingness to travel to our Palo Alto office as neededAbout Us: GSN Games delivers social casino and skill-based games designed to fuel every player’s inner winner. Founded in 1999, the company has evolved into one of the world’s top game publishers and creators. Its collection of social casino games includes GSN Casino and Bingo Bash, both top 10 grossing iPad apps, as well as Wheel of Fortune Slots: The Ultimate Collection, Solitaire TriPeaks, Mirrorball Slots, Fresh Deck Poker and more. GSN Games also features WorldWinner.com and the WorldWinner app, where players can compete for real money in skill-adapted versions of the biggest game franchises of all time. Owned by Sony Pictures Entertainment and AT&T; Entertainment Group, GSN Games operates eight locations worldwide across Boston, San Francisco, Palo Alto, Washington, D.C., London, Barcelona, Bengaluru and Zaporozhye, Ukraine. Connect with us on Twitter @insidegsngames, on Instagram @gsngames and on LinkedIn at https://www.linkedin.com/company/gsn."}