{"jobID": "2776312556", "jobLocation": "Englewood_Cliffs_NJ", "jobTitle": "Country Analytics Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.unilever.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1872", "Type": " Company - Public (ULVR:LN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Procter & Gamble, Nestlé, Johnson & Johnson"}, "estimatedSalary": "119000", "jobDescription": "Background & Purpose of the JobFor Unilever to remain competitive in the future, the business needs to continue its path to become data intelligent. The Information and Analytics team is responsible for building data, data science and analytics as a core capability to help the business become data intelligent and drive business and organization performance. The team will deliver advanced products at scale and work closely with the market teams to ensure that decisions in Unilever are augmented with insight & recommendations wherever possible. There are five major themes to the Information and Analytics strategy:Deliver Intelligent systems at scale. Powering Business (cross functional) and Customer Development area through data and analytics. Building out the right applications to enable business teams to move faster, with more accurate and future looking decisions leveraging Big Data & Data Science Winning disproportionately in Markets. We believe that the best way to move the needle for Unilever in Analytics is to work with leading geographies to create analytics products that make a significant impact on our businessDrive Unilever to assisted and predictive decision-making. The future is about assisted decision-making with machines (AI/Cognitive Computing/Machine Learning) unlocking the insights from vast deluge of consumer, customer & internal data, and presenting this in a way that is simple for our teams.Make data a true asset. Better data and data science access for every part of Unilever, across the 3 data framework (Connectivity, Growth, Continuous Improvement) and leading through the Enterprise Data Executive.World-class Information: One Version of the Facts. Continued excellence in delivery of diagnostics and insights to focus attention when and where it matters with a focus on Big Bets, Strategic Initiatives and Leadership team reporting Who You Are & What You’ll DoThe role has three main accountabilities:Owns the delivery of the I&A; analytics and data plan for the market (asking as the chief analytics officer for the market), including landing of existing analytic products (including change management plan), co-creation of analytic innovations, and acquisition of new data that is market specific.Partners with market general manager, Finance, and CD VPs to align to top analytics and data priorities for the market; ensures funding sufficiency from the market and / or ITIB.Works with priority CCBTs and CD to identify market wide business issues. Translates requirements to and insights from the in-market data scientist team needed to address these opportunities.Specifically, this role will focus on working on in-market business issue coming from CCBTs and CD leadership. It will help identify common themes amongst CCBTs to build repeatable models against (e.g. improving pricing execution and SPI compliance) and partner with US leadership to support growth from consumer data, retailer data, etc and land global programs requiring data and analytics.You’re a born leader: Serve as the trusted data and analytics consultant for CCBTs and key leaders who provides products-solutions that rapidly solve for business issuesYou’re a strategy guru: Development of the annual analytic and data market plan with funding sufficiency from the market and ITIB (if innovation)You’re a dot connector: Delivery of the total joint business plan priorities between ETS I&A; and the marketYou’re a teacher: Ensure the career development of the in-market data scientist team as a talent pipeline into the cluster hubs.You’re a changemaker: Own the change management (ways of working in the market – partnering with HR, CCBT and CD leaders) required to ensure landing of I&A; productsYou’re an innovator: Accountable for innovating at least 1-2 new data and analytic methodologies driven by local needs which feed into I&A;’s global product pipelineWhat You’ll Need To SucceedM.B.A. in a relevant field (Business Analytics, Operations Research), or PhD, M.S. in a relevant technical field (Operations Research, Computer Science, Statistics, Business Analytics, Econometrics, or Mathematics) Overall experience of 8-10 years preferredStrong track record of working with senior business leadership (VPs ) to drive definition, alignment, and support for application of analytics and data to address complex business issues (e.g. centralization of promotion spending decisions) Ability to rapidly connect match analytics and data products to business needsExpert knowledge in statistics (Regression, Clustering, Random Forrest, Decision Trees, Optimization, Time Series, Probability, and other related advanced methodologies)Working knowledge to apply Microsoft Azure and Cortana to develop scaled analytic models in the cloudAbility to manage multiple requests and priorities simultaneously in a highly VUCA and competitive marketPassion for empirical research and for answering hard questions with dataAbility to apply an agile analytic approach that allows for results at varying levels of precisionAbility to communicate complex quantitative insights in a precise, and actionable mannerWhat We Can Offer YouCulture for Growth | Top Notch Employee Health & Well Being Benefits | Every Voice Matters | Global Reach | Life at Unilever | Careers with Purpose | World Class Career Development Programs | Check Out Our Space | Focus On SustainabilityUnilever is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities Applicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law Employment is subject to verification of pre-screening tests, which may include drug screening, background check, credit check and DMV check. "}