{"jobID": "2770331428", "jobLocation": "Ne_Jersey", "jobTitle": "Lead Country Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.unilever.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1872", "Type": " Company - Public (ULVR:LN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Procter & Gamble, Nestlé, Johnson & Johnson"}, "estimatedSalary": null, "jobDescription": "Background & Purpose of the JobFor Unilever to remain competitive in the future, the business needs to continue its path to become data intelligent. The Information and Analytics team is responsible for building data, data science and analytics as a core capability to help the business become data intelligent and drive business and organization performance. The team will deliver advanced products at scale and work closely with the market teams to ensure that decisions in Unilever are augmented with insight & recommendations wherever possible. There are five major themes to the Information and Analytics strategy:Deliver Intelligent systems at scale. Powering Business (cross functional) and Customer Development area through data and analytics. Building out the right applications to enable business teams to move faster, with more accurate and future looking decisions leveraging Big Data & Data Science Winning disproportionately in Markets. We believe that the best way to move the needle for Unilever in Analytics is to work with leading geographies to create analytics products that make a significant impact on our businessDrive Unilever to assisted and predictive decision-making. The future is about assisted decision-making with machines (AI/Cognitive Computing/Machine Learning) unlocking the insights from vast deluge of consumer, customer & internal data, and presenting this in a way that is simple for our teams.Make data a true asset. Better data and data science access for every part of Unilever, across the 3 data framework (Connectivity, Growth, Continuous Improvement) and leading through the Enterprise Data Executive.World-class Information: One Version of the Facts. Continued excellence in delivery of diagnostics and insights to focus attention when and where it matters with a focus on Big Bets, Strategic Initiatives and Leadership team reporting This is an exciting new role in the Data Science and Analytics group in Information & Analytics, which is tasked to deliver maximum value from data to drive business and organization performance. The ETS I&A; In-Market team helps markets win with data, data science, and analytics in a way that leverages the close engagement/ relationship with CCBTs and CD leadership with a (highly technical) data science hub team so that they can solve for both large transformation programs and near term business problems.The ETS I&A; In-Market team is composed of business interpreters, data scientists, and data experts who can: quickly understand the business context problem, apply advanced mathematics and/or statistics to large data sets; and operate in cloud based environments where data, models, and user interfaces reside in the same platforms-core technologies. Who You Are & What You’ll DoThe position will lead a small team of individual contributor roles working closely with the business interpreter and CCBT and CD teams. This position is expected to lead the small team while being ‘hands on’ applying own data science skillsets. This role will also manage third party contractors as required.Works with the business interpreter to fully understand the business problem and how to deliver relevant insights that lead to actions.Gathers, analyses, and model data to solve complex business problemsBuilds Diagnostic and Predictive Models to solve the business problem applying range of techniques across classical statistics, Machine Learning and deep learning. Power fast paced analytics experimentation (80> of time) through hands on data science solution building and creative approaches to solve ‘one of a kind’ problems. Once proven industrialise the analytics solution (20 > of time) in partnership with the central data science hub with emphasis on (i) tuning the model for high accuracy (ii) coding it for optimal speed and scaleYou’re a born leader: Manage small team of data scientists who are delivering according to priorities set forth by market and / or function.You’re a strategy guru: Build data-science and algorithmic solutions to address business problems requiring descriptive, diagnostic, predictive, and / or prescriptive analyticsYou’re a dot connector: Drive new value from insights from connecting external and internal data sourcesYou’re an innovator: Innovate new data and analytic methodologies driven by local needs which feed into I&A;’s global product pipelineWhat You’ll Need To SucceedB.S. or M.S. in a relevant technical field (Operations Research, Computer Science, Statistics, Business Analytics, Econometrics, or Mathematics). Preferred experience in ‘digital native’ company applying advanced analytics with clear vision for applying previous experience in consumer goods Strong track record in solving analytical problems using quantitative and statistical approaches Expert knowledge in statistics (Regression, Clustering, Random Forrest, Decision Trees, Optimization, Time Series, Probability, and other related advanced methodologies)Expert knowledge of an analysis tool such as Angoss, KNIME, Spotfire, Microsoft PowerBI, and Tableau Expert knowledge working with and coding in R, R Shiny, and Microsoft Azure Machine LearningAbility to manipulate and analyse complex, high-volume, high-dimensionality data from varying sources (Nielsen, SAP, Retailer ePOS; both structured and non-structured data)Experienced knowledge working with large data sets, experience working with distributed computing tools a plus (Map/Reduce, Hadoop, Hive)Experienced knowledge working in Microsoft Azure and applying Cortana to develop scaled analytic models in the cloudExperienced knowledge with relational and columnar databases – SQL is a plusPassion for empirical research and for answering hard questions with dataAbility to apply an agile analytic approach that allows for results at varying levels of precisionAbility to communicate complex quantitative insights in a precise, and actionable mannerStrong communication skills and ability to work with peers and demonstrate vertical and lateral influence.What We Can Offer YouCulture for Growth | Top Notch Employee Health & Well Being Benefits | Every Voice Matters | Global Reach | Life at Unilever | Careers with Purpose | World Class Career Development Programs | Check Out Our Space | Focus On SustainabilityUnilever is an organization committed to diversity and inclusion to drive our business results and create a better future every day for our diverse employees, global consumers, partners, and communities. We believe a diverse workforce allows us to match our growth ambitions and drive inclusion across the business. Equal Opportunity/Affirmative Action Employer Minorities/Females/Protected Veterans/Persons with Disabilities Applicants and employees are protected from discrimination under Federal law. For more information, please see EEO is the Law Employment is subject to verification of pre-screening tests, which may include drug screening, background check, credit check and DMV check. "}