{"jobID": "2835258260", "jobLocation": "Rockville_MD", "jobTitle": "Tableau Data Visualization Analyst", "companyRating": null, "companyInfo": {"Website": "www.consultnet.com", "Headquarters": "South Jordan, UT", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Location: Rockville, Maryland  Our client, a full-service Information Technology (IT) company, focused in Federal and Health IT sector. We are seeking a Tableau Data Visualization Analyst. Qualifications:Bachelor's degree in Management Information Systems, Design, Human Factors, Computer Science or related discipline (e.g., Economics, Mathematics, Computer Science, Information Technology, and Computer Engineering); Master's degree is preferred.2+ years of data visualization experience.At least 1 year of experience with SPSS, STATA, R, or SAS is a plus.At least 3 year of experience working with Tableau visualization software a MUST, experience with other visualization software's/tools like, QlikView, or D3 preferred.At least 1 year of Experience with analytics, database, or business intelligence preferred.At least 1 year of Strong SQL querying experience.At least 1 year of experience with prototyping/mock-ups/storyboards.At least 2 years of Object Oriented Programming with languages such as Python, C, C++ or Java is a plus.Some experience with web development: HTML5; CSS; JavaScript.An understanding of UI/UX design concepts.Excellent problem-solving skills.Excellent oral and written communication skills.Strong analytical aptitude and an understanding of statistical methods.Applicants selected will be subject to a Public Trust background security investigation and may need to meet eligibility requirements for access to sensitive information. US Citizens or Permanent Residents preferred. Be a part of the ConsultNet difference. As a leading national provider of IT staffing and solutions, ConsultNet delivers exceptional services to startup, midmarket and Fortune 1000 companies across North America. Since 1996, we've partnered with clients to create rewarding opportunities for our consultants, successfully building teams that have surefire results.  In the past two years alone, we have placed more than 1,500 consultants in contract, contract-to-hire, or direct placement opportunities. We understand communication is key to finding the right job that matches your skills and career goals. For us, it's not just the work that we do; it's how we do the work. Our breadth of offerings extends to multiple IT positions in major markets throughout the country, see more at www.consultnet.com. provided by Dice Analyst, Business Intelligence, C++, CSS, Database, Development, Java, JavaScript, Management, Object Oriented Programming, Programming, Python, SAS, Security, SQL, UPS, UX"}