{"jobID": "2824107681", "jobLocation": "Weehawken_NJ", "jobTitle": "Financial Wellness Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.liniumrecruiting.com", "Headquarters": "Albany, NY", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our client, a multinational financial services company, is seeking a Financial Wellness Data Analyst in their Northern New Jersey location. Your experience and skills: – a degree in an analytical field such as engineering, mathematics, accounting, finance, economics, or information technology  – a solid understanding of the wealth management and/or banking industry  – 5+ years of data analysis experience  – Experience with project management  – Highly skilled in Microsoft Access and Excel, with experience creating complex forms and reports in Microsoft Access  – working knowledge of Structured Query Language (SQL) is preferred Skills/ Attributes: – capable of amassing data and information from multiple sources and consolidating into a comprehensive data warehouse for intuitive use by business partners  – able to synthesize multiple data points and sources to define and implement key reporting for internal and external stakeholders  – willing to work long hours when necessary and consistently contribute to the forward growth of the business by \"thinking out of the box \"  – excited to contribute to a new business line within our client's Wealth Management with aggressive growth targets  – able to manage multiple, concurrent projects as ad-hoc requests are needed for senior management Why Work With Linium?Why Consider a Contract/Temp Role?Find jobs with companies that may rely only on Firms for hiringGet a foot in the door with an amazing company, while earning a paycheckUse your assignment to evaluate your future employer and make sure it is a good fit for youUse the positions to fill in the \"gap” while you're looking for a permanent roleDevelop new skills, experiences & references –build your resumeLinium's services are FREE to all job seekers!Visit us online at:www.liniumrecruiting.comWhat to expect once you've applied: Once your resume has been received, The Linium team will review your credentials to match your qualifications against all of the open positions, including the one you applied for. If you are qualified for any of the current job openings, a member of the Linium team will contact you. We Care! We understand job searching is stressful! We know that finding a better job to advance your career and your income is important. We will be there every step of the way helping you navigate through the complexities of job searching in today's economy. As an Equal Opportunity / Affirmative Action Employer, by choice, Linium will not discriminate in its employment practices due to an applicant's race, color, creed, religion, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity or expression, age, national origin, marital status, citizenship, physical and mental disability, criminal record, genetic information, predisposition or carrier status, status with respect to receiving public assistance, domestic violence victim status, a disabled, special, recently separated, active duty wartime, campaign badge, Armed Forces service medal veteran, or any other characteristics protected under applicable law."}