{"jobID": "2625837653", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist II", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": "Updated: October 5, 2017Job ID: 213280Status: Full-TimeRegular/Temporary: RegularLocation: San Antonio, TX, United StatesCome Work at HJF! The Henry M. Jackson Foundation (HJF) is looking for a Research Scientist IIto support research and program objectives at the Naval Medical Research Unit ‐ San Antonio (NAMRU‐SA). HJF provides scientific, technical and programmatic support services to NAMRU-SA at Fort Sam Houston, TX. ESSENTIAL JOB DUTIES: Apply the latest scientific knowledge towards the solution of a broad range of theoretical and practical problems, including:  Develop and conduct protocol‐driven scientific research addressing various aspects of military medicine, including, but not limited to: hemorrhage and resuscitation, immunomodulation, directed energy bioeffects, and bioassay development; Provide support for writing protocol‐driven research proposal, animal use protocol, human use protocols, technical report, final reports, and peerreviewed manuscripts; Evaluate data sets (provided by the government and collected by the contractor); Develop presentation materials, Standard Operating Procedures, and present findings at technical and professional meetings; Prepare experimental subjects, set‐up experimental equipment, and aid in training and development of experimental subjects for experimental procedures in accordance with approved animal or human use protocols; Provide support in development of establishment of in vivo and in vitro model systems, data acquisition, and data analysis; and Serve as technical or peer advisor to more junior scientists and as an advisor resource person for other team members.Required Knowledge, Skills, and Abilities: Must have excellent communication skills and the ability to clearly convey scientific information and data to peers and flag level officers. A known intellect and expert in their field of expertise and highly sought after as a presenter and lecturer at professional conferences and symposiums. Experience presenting and writing peer‐reviewed scientific articles. Knowledge of preparation and presentation of scientific articles including formatting, writing, and graphic presentations. Experience in using electronic/computer media for presentations and/or briefs. Ability to utilize microcomputers, Internet, online literature searches, and web software and procedures. Ability to produce ready‐to‐publish articles with review for scientific content only. Must have worked as an Assistant Professor or Associate Professor at the university level or as an Industry Scientist. Experience serving as Principal Investigator and/or team leader. Ability to assume responsibility for and have knowledge of all phases of the research process, including problem definition, planning, budget formulation execution, and analysis, interpretation, and reporting of findings.Minimum Education/Training Requirements: Possess PhD with 6 years of experience (Masters with greater than 8 years of experience will be considered). Doctorate degree must be in one of the following fields of higher education: Environmental Health Sciences (including: Chemistry, Occupational Epidemiology, Pharmacology, or Toxicology), Physiology, Neurophysiology, Neuroscience, Immunology, Microbiology, Biochemistry, Cell Biology, Molecular Biology, or related fields.The Henry M. Jackson Foundation for the Advancement of Military Medicine, Inc. (HJF) is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or other status protected by law. Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Director of Human Resources."}