{"jobID": "2829533363", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.paladin-inc.com", "Headquarters": "Dallas, TX", "Size": "501 to 1000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TEKsystems, Randstad US"}, "estimatedSalary": null, "jobDescription": " Paladin Consulting is currently hiring a Data Scientist to join our team working onsite at our client's office located in Dallas, TX.  We work with companies that offer environments for our employees to contribute, learn, and advance their career. We treat you like you are part of the family.  Job Title: Data Scientist  Work Location: Dallas, TX.  Duration: direct hire Education/Experience Required:Bachelor or Master's (preferred) degree in Computer Science, Math or Scientific Computing, Data Science/Analytics, Business Intelligence, Economics, Social Sciences.6+ years of relevant experience in Data Analytics.Job Description & Responsibilities: The Data Scientist will be responsible for providing advanced analytics, developing predictive models and Machine Learning/AI solutions for Brinker CRM/Loyalty, Digital Marketing, and other data-intensive areas, such as Talent analytics, Financial forecasting, Operational analytics, etc. Analyze Loyalty program performance; design and measure tests; develop advanced segmentation; conceptualize and design the algorithms for individualization of the offers and content with the goal of optimizing revenue.Estimate the impact and ROI of different marketing initiatives in the Digital and Traditional media; provide thought leadership for the advertising agency and the marketing team in terms of designing media tests and measuring their results;Provide actionable, comprehensive, data-driven answers to business questions using the variety of the available data sources (transactions/sales, media consumption, social data, guest satisfaction, operational data etc.).Visualize the data and communicate the insights and results to the leadership.Must Have Skills & Qualifications:Extensive hands-on experience with development of predictive models and machine learning/AI-based solutions.Experience in one or more of the following areas: Digital Marketing, CRM analytics, Market research, financial analysis, IT-Business Intelligence.Hospitality/Retail experience is a strong plus.Strong SQL skills.Experience in developing machine learning and artificial intelligence algorithms using Python, R, C++, and Java.Experience in working with distributed computing i.e. Hive SQL, Pig, Java Map/Reduce, and Apache Spark.Strong knowledge of statistics.Advanced proficiency in data visualization (Tableau).Is there anything pertinent with the day-to-day activity that was NOT listed in the job posting on LinkedIn? Manage people (leadership skills), forecasting sales and labor (finance partnership), not interested in Oil and Gas or Consumer goods candidates.Ability to effectively visualize data highlighting important insights and conveying the story by using charts and tables.Ability to thrive in dynamic fast paced environment.Superb multitasking skills: ability to effectively work on multiple projects and ad-hoc analytical requests with tight deadlines.Must be a self-starter, able to work independently and take initiative to find solutions for business requirements.Highly collaborative work style; must work well with people.Ability to maintain confidentiality on proprietary business information.Ability to extract, process, and analyze large volumes of diverse structured and unstructured data to produce meaningful insights that can be linked to business results.For more information or to view other opportunities, visit us atwww.paladininc.com.Paladin is an EEOC employer. We drug test and background check!"}