{"jobID": "2781668584", "jobLocation": "Washington_DC", "jobTitle": "System Administrator (Journeyman)", "companyRating": "4.5", "companyInfo": {"Website": "www.chameleonis.com", "Headquarters": "Saint Louis, MO", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": " TitleSystem Administrator (Journeyman)LocationNational Capital Region / Washington, D.C.Chameleon Integrated Services, a fast-growing certified Small Disadvantaged Business (SDB) and a graduate of the Small Business Administration 8(a) Business Development program, with a strong track record working within the DOD and Federal Government agencies, is looking for a high performing Stystem Administrator in the National Capital Region. The System Administrator (Journeyman) will focus on the implementation, deployment, and sustainment of leading-edge technologies that is revolutionizing federal IT infrastructure. This is an excellent opportunity for a System Administrator who is CCNA-certified and interested in further developing their career and actively pursuing advanced certifications such as CCNP and CCIE. A successful candidate will have a CCNA or equivalent; and CompTia Security +This opportunity will place you as the journeyman on software-defined networks and sustainment issues involving complex IT environments. You will support major programs and initiatives within the Department of Defense (DoD) and achieve centralized network control and significant improvement to critical network performance and monitoring. The position is part of a small, motivated team of architects, engineers, and developers who are focused on the design, development, and deployment of infrastructure, across the Enterprise ecosystem. As such, this position will require a professional who isknowledgeable in software architecture, software development and software integration. Duties include but are not limited to:-Maintains smooth operation of multi-user computer systems, including coordination with network engineers.-Monitors and manages system resources, including CPU usage, disk usage, and response times to maintain operating efficiency.-Performs systems security administration functions, including creating user profiles and accounts.-Other duties may include setting up administrator accounts, maintaining system documentation, tuning system performance, installing system wide software and allocating mass storage space.-Interacts with users and evaluates vendor products.-Makes recommendations to purchase hardware and software, coordinates installation and provides backup recovery.-Develops and monitors policies and standards for allocation related to the use of computing resources. May be assigned responsibility for less experienced staff. Basic Qualifications-Minimum 4-8 years IT experience, 5 years supporting large-scale enterprise-level services.-Minimum education BS/BA-ITIL Foundation certification, desired-Active Secret Security Clearance-Must have strong interpersonal, written, and oral communication skills-Highly self-motivated and directed, with keen attention to process & detail.-Able to effectively prioritize tasks in a high-pressure ever evolving environment.-Self-starter who exudes positive energy and can rally those around them to a common goal-Strong executive / customer facing & presentation skills as well as having a proven analytical and problem-solving abilities.Contingent upon award“Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status”Company & Workplace EnvironmentWe understand that retention of a highly qualified workforce is just as important as initial hiring and staffing. We're committed to keeping our employees abreast of industry trends, educational opportunities and rapidly changing technologies. As a team, we set the stage for important, meaningful work by providing a flexible, dynamic working environment that challenges our employees to grow personally and professionally.A Culture of SuccessWe succeed as a team. Each project is staffed to meet the requirements and objectives of that particular mission, but in every case, we rely on each other to create a comprehensive solution to meet our customer's needs. Our success isn’t simply financial, it’s also personal. We encourage relationship building with our partners and customers and emphasize the need for continued personal growth. Our commitment to innovation starts with employees and partners that share our passion for technology, business process optimization and outstanding user experiences.Diversity in the WorkplaceChameleon Integrated Services is an Equal Opportunity Employer. We are committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law.While the Company is committed to following this principle in every facet of employment, all employees share in the responsibility to promote and foster a favorable work environment.Our Commitment to U.S. VeteransWe have a particular passion for our veterans. We understand the values and challenges faced by those who had the dedication and commitment to serve our nation.We are focused on growing and promoting veteran success and have a demonstrated ability to further that same service in support of our customers. If you have honorably served, we would love to hear from you!"}