{"jobID": "2806995090", "jobLocation": "Kalamazoo_MI", "jobTitle": "Associate Scientist", "companyRating": null, "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Associate Scientist Organization  Eurofins Lancaster Laboratories Professional Scientific Services, LLC Location  MI, Kalamazoo Job Code 12504Apply NowEurofins Lancaster Laboratories PSS is searching for an Associate Scientist in Kalamazoo, Michigan. Associate Scientist responsibilities include, but are not limited to, the following : · Design and execution of experiments, protocol development, data collection, summary, analysis, and reports to supervisors and project team members.  · Set-up and operation of lab scale centrifuges, lyophilizers, spray drying, pH-meter, particle size equipment, DSC, and fundamental understanding and experience with control systems (lyophilization controllers).  · Experience in analytical methodologies such as HPLC, Spectrophotometry, Capillary Electrophoresis, ELISA etc  · Data entry, verification, and reporting, record keeping, in accordance with scientific protocol and applicable Standard Operating Procedures The ideal candidate would possess : · Excellent communication, organizational, record keeping and computer literacy skills.  · Ability to develop and maintain effective, trusting work and customer relationships.  · Self-starter, able to prioritize work and work efficiently with minimal supervision  · Ability to handle change (changing workloads) and multitasking with ability to work with deadlines.  · Previous experience in formulation development or analytical chemistry labs is desirable  · Strong computer, scientific, and organizational skills  · Excellent communication (oral and written) and attention to detail  · Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude  · Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Work environment: The person filling this position works in a BSL-2 laboratory. There may be exposure to animal pathogens, chemicals, and bio hazardous materials. There may be handling of, and/or exposure to, zoonotic organisms.  · Work will be conducted in both lab and office facilities.  · Lifting: May include occasional lifting up to 40 pounds.  · Occasionally more than 40 hours per week may be required, including weekends. Basic Minimum Qualifications : · Bachelor's degree in biology, chemistry, or other related degree concentration, or equivalent directly-related experience (two years of directly related industry experience is equivalent to one full-time year of college in related major)  · 1-5 years previous laboratory job experience required. Previous experience in biological / biopharma formulation or analytical characterization of formulations/biologics is preferred.  · Experience in development of injectable formulations, lyophilization, spray drying and working experience of aseptic procedures  · Experience working in a GLP/GMP environment and/or an understanding of GLP/GMP regulations/procedures.  · Authorization to work in the United States indefinitely without restriction or sponsorship  Position is full-time, Monday-Friday, 8 a.m.-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of Kalamazoo, MI are encouraged to apply.  As a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options. To learn more about Eurofins, please explore our website www.eurofinsus.com.Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer.In 1987, Eurofins Scientific was founded in Nantes, France, with four employees to market the SNIF‑NMR technology. During the past 30 years, Eurofins has grown to be a world leader in laboratory testing services with a network of 375 laboratories across 41 countries in Europe, North and South America and Asia-Pacific and over 30,000 staff.Eurofins is the world leader in the food, bio/pharmaceutical product testing. It is also number one in the field of environmental laboratory services and one of the global market leaders in agroscience, genomics, discovery pharmacology, and central laboratory services."}