{"jobID": "2778382316", "jobLocation": "Crystal_City_VA", "jobTitle": "Senior PeopleSoft Application Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.coresysconsulting.com", "Headquarters": "Alexandria, VA", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Manages the software application development, configuration, unit testing and deployment and integration of technical solutions for the IPPS-A project. Provides data models from business systems planning and data requirements planning. Responsible for designing, developing, and supporting application solutions and re-engineered components based on client requirements. Provides input for systems development and data base administration from a data point of view. Performs business and technical designer functions, including making contributions to business and technical architecture components of the enterprise solution. Apply subject matter expertise to identify, develop, and implement techniques to improve engagement productivity, increase efficiencies, mitigate risks, resolve issues, and optimize cost savings on the IPPS-A project.  Duties and Responsibilities: Responsibility over technical solution design, development, deployment/cutover, and implementation - covering all technical aspects of the PeopleSoft implementation lifecycle.Provides hands-on technical solutions to business challenges & translates them into process/technical solutions.Responsibility over the design, development and delivery of one or more PeopleSoft application development components, including reports, interfaces, conversions, and implementation of custom solutions.Interprets requirements, performs highly complex analyses and presents options and recommendations to obtain desired results.Develops advanced technological ideas and guides development into a final product.Demonstrate leadership in the areas of planning, co-ordination and meeting customer expectations.Manages the modeling of applications throughout the development lifecycle.Ensure all tasks and milestones associated with technical design, configuration and unit testing are completed according to project management guidelines.Leads design and development activities within specific application software languageProvides daily supervision and direction to the technical staff.Responsible for managing client relationships within context of the individual role.Ability to meet deadlines and manage multiple, dynamic priorities.Effective communication skills and demonstrated experience working in a team-oriented environment. Required Qualifications: Bachelor’s degree in Computer Science or Information Systems or other technically relevant degree10-12 years of overall technical experience in system design, project development and production support of large applications/systems.8+ years PeopleSoft experience with minimum of 4 years technical experience with PeopleTools 8.49 or aboveProven track record of successful implementation of all project life cycle stages from requirements gathering through implementation and enhancements.Technical development experience with PeopleSoft Time and Labor/ Absence Management / Global Payroll preferred.Experience with PeopleSoft HCM 9.x, 9.2 preferred.Good working knowledge of one or more PeopleSoft Advanced Tools such as Application Package, Component Interfaces, Integration Broker, Business Interlinks, Workflow, Object Oriented PeopleCode etcStrong knowledge of Oracle databases, UNIX environment, UNIX shell scripts, SQL and PL/SQL, and XML and encryption technologies.Versed in the design, development and implementation of PeopleSoft ERP applicationsPossesses extensive knowledge of application modeling principles, concepts and techniquesAbility to work collaboratively in a team environment with a strong focus on customer service and solution ownership.Must have strong analytical skills and can demonstrate strong problem solving skillsAbility to communicate in a clear and concise manner and success working in Integrated Product Teams (IPTs)Ability to obtain Security+ CertificationAbility to obtain active Secret clearance Desired Qualifications: Experience with PeopleSoft HCM 9.x in HR, Payroll, Benefits, ESS, MSS, Time & Labor preferred.Security+ CertificationUnderstanding of application modeling principles, concepts and techniques such as UML class diagrams, understanding of entity relationship diagram standards such as IDEF1x, and understanding of the DOD Architecture Framework (DoDAF); experience preferred.Must be a US Citizen and possess a Security Clearance due to Federal Contracting Requirements About Us: CoreSys Consulting is a Veteran Owned Small Business (VOSB) working primarily within the US Department of Defense. The CoreSys leadership team has over twenty years of project planning, execution, and maintenance of Information Technology (IT) systems. We specialize in Custom Application Development, Enterprise Architecture and Governance, DoD Architectural Framework (DoDAF), Service Oriented Architecture (SOA), CIO Support, Application Transformation and Modernization, J2EE Solutions, Data Warehousing, etc. Employees are eligible to participate immediately in CoreSys Consulting Services competitive employee benefits package, which includes medical, dental, vision, disability and life insurance as well as participation in our 401k program with a company match."}