{"jobID": "2802005810", "jobLocation": "San_Diego_CA", "jobTitle": "Virtual - Sr. Business Intelligence and Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": "66000", "jobDescription": "The Senior Business Intelligence Analyst, who reports to the Manager - B.I. & Analytics, supports platform and account leadership team to develop business intelligence processes and tools using formal and informal data to help customers and sponsors define and achieve their goals. The role will uncover several perspectives on a problem or opportunity, determining any and all drivers towards or barriers to successful performance, and makes recommendations based on what is discovered. Job Responsibilities:Data ManagementDeep understanding of contract key performance indicator and reporting requirements and client expectations. Devise and promote creative data visualization to derive actionable intelligence.Financial modeling, analysis and compilation of quantitative data.Forecast/trending of performance data.Process mapping and efficiency analysis.Lead problem solving teams to develop recommendations based on data interpretation and analysis to transform behaviors and techniques.Develop automated tools and dashboards with IT team to provide real-time insights to business data.Use of advanced statistical concepts to determine significant sources of variability.Provide subject matter expertise for all data related processes and analyses. Analyze trends of monthly Key Performance Indicator results for performance improvement concepts.Create, maintain, and optimize the account wide dashboard. Draft and distribute reports weekly, monthly, quarterly, and annually. Technical LearningPicks up on technical things quickly; can learn new skills and knowledge; is good at learning new industry, company, product, or technical knowledge; does well in technical courses and seminars. Any and all other duties and tasks assigned. Knowledge, Skills and Abilities:Education / TrainingHigh School or Equivalent Bachelor’s degree in Engineering, Finance, Information Technology, or related field, preferred.Years of Relevant Experience2 years’ experience minimum 2-4 years’ experience preferredSkills and KnowledgeHigh level skill with Microsoft Office (Excel, Word, PowerPoint, Access and Outlook) required SharePoint experience a plus.Experience with other data and statistical applications are a plus (PowerPivot, Tableau, SAS, Access, Minitab, Sigma Excel, SQL)Other AbilitiesCan deal comfortably with more senior managers; can present to more senior managers without undue tension and nervousness; understands how senior managers think and work; can determine the best way to get things done with them by talking their language and responding to their needs; can craft approaches likely to be seen as appropriate and positive.Physical Work Requirements and Work ConditionsSedentary work. Exerting up to 10 pounds of force occasionally and/or negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects, including the human body. Sedentary work involves sitting most of the time. The worker is not substantially exposed to adverse environmental conditions (such as in typical office or administrative work.JLL is committed to developing and maintaining a diverse workforce, and strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship. Please visit www.JLL.com for additional information on JLL’s commitment to equal opportunity.JLL Is an Equal Opportunity EmployerJLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veteran’s status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf. If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at careers@am.jll.com"}