{"jobID": "2746917607", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher - Predictive Market Making Team (Equities/Futures)", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a quantitative researcher for the electronic market making team. The focus will be on designing predictive trading strategies using statistical and theoretical approach for electronic market making on domestic and international exchanges. The role will involve researching short-term alphas and designing trading strategies which can be traded at scale across different exchanges, symbols. This role is about designing the core strategies and trading signals. Requirements:Experience working with large noisy data (ideally very large time series)and extracting signals.Experience with predictive methods.Strong programming skills (Python/R).Solid understanding of machine learning algorithms.Expertise in: statistical inference, pattern recognition, signal processing.Research oriented disposition, you’re a scientist at heart.Very strong in statistics and probability. This is your passion and your focus.Very strong mathematical skills (likely competed and won national / international math competitions in school).Good communication skills.You enjoy working within a team and thrive when working in an environment with smart people on your level.Results oriented.Focused.Detail oriented.High achiever.A self-starter and passionate about learning.Always questioning.Pragmatic and practical.Nice to have:Experience designing market making strategies for another trading company.A strong understanding of how markets work / operate (Central limit order-book, dark pools / exchanges, designing / testing ideas short term price action, event and stat-arb strategies that operate at the sub-second – 30 second level)Education:PhD from a top school in a subject with a heavy focus on statistics and probability. If you would like to be considered for the position of Quantitative Researcher, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team"}