{"jobID": "2675812976", "jobLocation": "Scotts_Valley_CA", "jobTitle": "Manufacturing Lead (Coating)", "companyRating": null, "companyInfo": {"Website": "www.thresholdenterprises.com", "Headquarters": "Scotts Valley, CA", "Size": "201 to 500 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DetailsLevel ExperiencedJob Location Scotts Valley Headquarters - Scotts Valley, CAPosition Type Full TimeEducation Level High SchoolSalary Range UndisclosedTravel Percentage NegligibleJob Shift DayJob Category ManufacturingDescriptionSummary of Job Duties: Assist Supervisor with supervision and coordination of all shift departmental personnel. Helps meet daily production schedule and accomplish department goals. Assist supervisor were necessary assistance is needed in the Manufacturing Department. Specific Job Duties - Must be able to train/qualify in the following areas:Help supervise and coordinate all shift departmental personnel within the Manufacturing Department.Help in organizing and prioritizing all Manufacturing runs.Perform training and cross-training in all skill areas.Assist the Manufacturing personnel working in various areas with any small mechanical problem or priority questions that may arise.Perform janitorial/housekeeping duties as directed.Perform miscellaneous Manufacturing duties as required.Monitor all Manufacturing production runs in all areas.Perform all other tasks as assigned by Threshold management.QualificationsMinimum Qualifications Required:Must have problem solving skills, a sense of priority, organizational/administrative skills, should be proficient in written and verbal communications.2. A thorough knowledge of SOPs, GMPs and general Manufacturing operations.1 + year(s) of experience in lead or foreman capacity.Must have the ability to use good judgment, follow detailed instructions.High School diplomaBe responsible for quality and timely completion of Manufacturing runs.Lift up to 50 lbs.Skills and/or Training Desired:Leadership capabilities, skilled in basic computer use and software (i.e. Windows operating system, MS Word).Mechanical experienceManufacturing experienceNAV"}