{"jobID": "2807705553", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst II", "companyRating": "4.0", "companyInfo": {"Website": "www.uship.com", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "SRA Data Analyst IIJob Responsibilities:Use relevant information to uncover meaningful behavioral relationships.Discover, analyze and quantify trends and correlations.Create reports for management as needed.Make strategic recommendations backed up by quantifiable data.Track, monitor, and report on new initiatives.Create products based on corporate needs as justified by quantifiable data.This position will be as much a project management role as an analytics role.Job Requirements:Bachelor's degree or higher in computer science, mathematics, statistics, actuarial science, or other very quantitative, mathematical field.Experience with quantitative analysis.Solid understanding of databases and data mining.Solid understanding of web traffic metrics (visits, unique visitors, etc.) and conversion.Ability to research and find resolution to technical data/reporting issues.Experience in an entrepreneurial/start-up environment.Knowledge of internet related business metrics including SEM/SEO/CPC/CPA, etc.2+ years experience leading projects from start to finish working with product managers, developers and cross-functional teams.Our Ideal Candidate might also have:Experience with SQL database design, data warehousing, or administration.Expert Excel user/pivot tables.Experience with Tableau or other BI tool.Ability to present data findings/trends in a consumable and concise way (both verbally and in presentations) and make recommendations based on findings.Why work at uShip?Competitive Salary100% Paid health and dental insuranceEquity/Stock OptionsAnnual uShip Free Shipping Allowance ($500)Open PTOFlexible schedulesFree lunch, snacks, and drinksDog friendlyCasual dress codeAnd so much more!Company Overview uShip is the worlds first and largest shipping marketplace. Consumers and businesses can compare and book bids from hundreds of thousands of customer-reviewed transportation service providers, ranging from independent owner-operators to the largest freight carriers and brokers. Customers save money and service providers use their empty cargo space everyone wins! Were an Internet company focused on solving a real-world problem and having loads (pun intended) of fun along the way. Our service providers were even featured in A&Es; real life drama, Shipping Wars.  Since launching uShip in 2004, our mission has been to be the worlds leading online solution for shipping anything, anytime, anywhere. We are passionate about empowering buyers and providers of transportation services to efficiently conduct business on an unbiased, transparent and competitive platform. uShip is headquartered in Austin, TX."}