{"jobID": "2825099247", "jobLocation": "San_Antonio_TX", "jobTitle": "Water Resources Planner/Scientist - Water Business", "companyRating": null, "companyInfo": {"Website": "www.bv.com", "Headquarters": "Overland Park, KS", "Size": "10000+ employees", "Founded": " 1915", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Business Title Water Resources Planner/Scientist - Water Business  Requisition Number 35822BR  Salary Plan ENS  Grade 131  Division Water  Employee Type Full Time  Visa Sponsorship Available? No  Relocation Available? Yes  Division Marketing Statement Black & Veatch is a leader in watershed resource planning and management, offering expertise across the entire water cycle, from source water to receiving water. We understand the issues involved in providing integrated water resource planning efforts that include ground water, surface water and/or alternative water supplies. Knowledge of the latest technology and skill in the use of the most up-to-date tools - including geographic information systems (GIS), demand management programs, groundwater models like MODFLOW, integrated decision support models like GoldSim and Stella, water quality models like WASP and EFDC, as well as an understanding of current and pending regulations - enable us to offer complete services. Black & Veatch takes pride in our professionals' ability to see the entire water resource picture, often helping clients realize more water resource security and overall long-term cost savings. With an integrated global workforce of highly skilled and experienced scientists, engineers and technicians, we are well-equipped to handle all water resource concerns. In addition to receiving top rankings in many engineering journals, the Water business has helped to shape regulatory approaches and develop innovative technologies, which further distinguish Black & Veatch from other engineering firms.  Primary Purpose Black & Veatch has an exciting opportunity for a Water Resources Planner/Scientist in Texas.  Within our U.S. planning and water resources business, we have seen consistent growth driven by our clients' needs to address challenges stemming from water scarcity, groundwater depletion, drought resiliency/reliability/vulnerability, climate variability, water rights issues, and evolving reuse regulations and implementation. In Texas, we anticipate more and more focus on integrated water resource planning and design as the State's population increases and water resiliency, reliability, and vulnerability issues become more pressing. This represents a strategic business opportunity for Black & Veatch, and the Water Resources Planning position is designed to help the company execute projects in Texas and across the country by providing world-class planning and water resource services.  Principal Duties and Responsibilities Lead scenario planning efforts for integrated water resource projectsProvide water demand estimates and conservation assessmentsDevelop groundwater and surface water management strategies and assessmentsSupport planning-level estimates of project costsSupport innovative water supply planning services, including reuse and brackish water desalinationSupport water resources marketing efforts and build relationships with key water resource planning leaders and decision makers throughout the state Minimum Qualifications Minimum of 3 years' of experience performing duties similar to those of an Environmental Scientist 4. All applicants must be able to complete pre-employment onboarding requirements (if selected) which may include any/all of the following: criminal/civil background check, drug screen, and motor vehicle records search, in compliance with any applicable laws and regulations.  Preferred Job Qualifications 10+ years of water resource and planning workExperience in a comprehensive reporting and client-facing presentationsExperience leading project tasks and executing water resource planning projectsKnowledge of Texas water laws for surface water, groundwater, and reuse/recycled waterKnowledge of Texas Environmental Flow Standards and environmental issues across the stateStrong data analysis skillsUnderstanding of stormwater and flood water issues as a result of both storm events and hurricanesHave an understanding of water supply applications and models, including: o MODFLOW  o TCEQ Water Availability Models  o TWDB Groundwater Availability Models  o GoldSim, STELLA, RiverWare packages  EEO Statement Equal Opportunity Employer - Minority/Disabled/Veterans/Females  Locations TX-Austin  TX-Dallas  TX-Fort Worth  TX-Houston  TX-San Antonio  Recruiter Chris Aguilera"}