{"jobID": "2679576245", "jobLocation": "Austin_TX", "jobTitle": "PRINCIPAL DATA SCIENTIST BL LAB", "companyRating": "3.5", "companyInfo": {"Website": "www.homedepot.com", "Headquarters": "Atlanta, GA", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (HD) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Target, Walmart"}, "estimatedSalary": "160000", "jobDescription": "Position Description:POSITION PURPOSE A Principal Data Scientist is capable of performing new innovative research to solve difficult business problems. Principal Data Scientists are responsible for thought leadership of analytics and software design in taking the solution from concept to final prototype. Responsible for resources from the data science team and defines tasks within the business problem to parallelize and deliver a solution in the shortest amount of time. Principal Data Scientists are expected to not only contribute to projects as the hands-on expert levelresource,but also provide thought leadership to data scientists and the company as a whole. This role will: Work with merchants and other business experts to define an distill requirements for analytic solutions Define best in class analytic methodology and facilitate adoption of that methodology by the data science team Design analytic solutions leveraging advanced statistical modeling and optimization that are best suited to solve the business problems Lead internal data scientists to deliver advanced analytics solutions. Provide thought leadership and establish a technical strategy and roadmap for advanced analytics Communicate timely and effectively both verbal and written to the peers, team, managers, and Home Depot Stay current with advancements in optimization, statistical modeling, programming techniques and advocates them where appropriate.MAJOR TASKS, RESPONSIBILITIES AND KEY ACCOUNTABILITIES 35%-Designs and develops solutions that leverage statistical analytics and optimization to derive business insights. 35%-Partner with internal cross-functional teams and lead data scientists to develop advanced solutions. 20%-Seeks further knowledge on key developments within data science, technical skill sets, and additional data sources within Home Depot. 10%-Define clear communication mechanisms to the head of data science to ensure projects are on time and on budget.NATURE AND SCOPE This position reports to the Head of Data Science.  This position has no direct reports.ENVIRONMENTAL JOB REQUIREMENTSEnvironment: Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable. Travel: Typically require less than 10% of the time.ESSENTIAL SKILLS: MINIMUM QUALIFICATIONS Must be eighteen years of age or older.  Must be legally permitted to work in the United States. Education Required: Bachelor's degree Years of Relevant Work Experience: 6 years Physical Requirements: Frequent periods are spent standing or sitting in the same location with some opportunity to move about; occasionally there may be a need to stoop or lift light objects (typically less than 8 pounds).Preferred Qualifications:The knowledge, skills, and abilities typically acquired through the completion of a PhD degree with 5+ yrs of experience or Masters with 8+ years of experience in the domain of data science. Knowledge, Skills, Abilities, and Competencies:Work experience with SQL, Teradata, Google Big Query and/or other comparable database systems. Expert knowledge of R, Python or other statistical computing programming languages. Recent publication in peer-reviewed journal relevant to data science Experience managing groups of PhD level data scientists.  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}