{"jobID": "2831692872", "jobLocation": "Arlington_VA", "jobTitle": "CR.03.00.Analyst, Data Management", "companyRating": "3.4", "companyInfo": {"Website": "www.etrade.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Company - Public (ETFC) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "E*TRADE is a leading financial services company and a pioneer in the online brokerage industry. Having executed the first-ever electronic trade by an individual investor more than 30 years ago, the company has long been at the forefront of the digital revolution, offering easy-to-use solutions for individual investors and stock participants. Founded on the principle of innovation and determined to level the playing field for individual investors, E*TRADE delivers digital platforms, tools, and professional assistance to help investors and traders meet their near-and long-term investing goals. The Company provides these services both online and through its network of customer service representatives and financial consultants – over the phone at two national branches and in-person at 30 E*TRADE branches.Analyst, Data Management will be a vital member of the Enterprise Data Management Office (EDMO). You will be responsible for supporting the development of the EDMO and partnering with stakeholders throughout the firm to implement data management initiatives across the enterprise.  In this role, you will be working with various lines of business to identify and create data definitions with the end goal of creating an enterprise-wide data glossary. You will also establish data lineage which includes mapping out end-to-end data flow to the source system and help us to develop data quality rules and processes to establish and execute a data quality program. RESPONSIBILITIESSupport the development of the EDMO and implementation of data management initiatives throughout the firmGather, analyze, document and manage business and user requirements (both functional and non-functional) to address business needs.Reading and reviewing technical documentsFacilitation of data lineage; moving organization through the iterative processFoster a corporate culture that recognizes data as an enterprise assetPartner with technology infrastructure and business units to:Inventory and classify data elementsEstablish data dictionaries and data lineage within a centralized enterprise data management toolDefine and implement data quality rules, and measure and report performance against them on a recurring basisEnsure adherence to data governance is present, documented, and maintainedEnsure readiness for Comprehensive Capital Analysis and Review (CCAR) data submissionsEstablish and maintain positive working relationships with many stakeholders, including, but not limited to, colleagues within the EDMO, data curators, data owners, partners within technology infrastructure and business units, and senior managementLiaison with industry experts to maintain an awareness of, and become an advocate for, data management industry best practices and trendsBasic1-3 years of work experience in data management and/or the financial services industryPreferred1-3 years of experience in regulatory/risk/compliance,a plus2+ years working cross-functionally in an enterprise environment,a plusExcellent communication skills – both written and verbalProficiency with an enterprise data management tool, such as Collibra, is preferredGood business acumen in financial servicesAn enthusiastic work ethicExceptional interpersonal and communication skills, with experience collaborating with both internal and external partnersExperience managing projects from beginning to end, with a record of strong planning and execution skillsThe ability to multi-task and maintain timeliness and qualityExcellent organizational skills and attention to detail We offer a competitive and comprehensive benefits package. Please visit https://www.etradecareers.com/why-work-at-etrade/employee-benefits/ to learn more about the opportunities.  E*TRADE Financial is an Equal Opportunity Employer who encourages diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, age, disability, citizenship, marital status, sexual orientation, gender identity, military or protected veteran status, or any other characteristic protected by applicable law."}