{"jobID": "2744300401", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist (EG)", "companyRating": "4.0", "companyInfo": {"Website": "www.pros.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (PRO) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Vendavo"}, "estimatedSalary": "91000", "jobDescription": "Why PROS? This is a unique opportunity to join the market leading company that has not only has 30+ years of proven success but also has a significantly under penetrated opportunity in a $30B addressable market.  PROS culture and the truly extraordinary people who work here are at the very core of our success. We have a passion for what we do, and we won’t stop until we’ve delivered on our promises. We’re committed to the success of our customers. That’s why we think harder and dream bigger – so our customers can go even further than they ever imagined possible.  Our people make PROS stand out from the rest. if you want to be a part of something truly extraordinary, come help us shape the future of how companies compete and win in their markets. PROS is always looking for talented candidates. Specifically, we are always looking to connect with candidates with the below skill set. If we don’t contact you immediately; a contact may be coming later. We want to ensure we know the right people; when we are ready to hire! Applying is the best way for us to consider you now or in the future!Data ScientistData Scientist Reporting to the Senior Director of Science, the Data Scientist is a primary team member who works to innovate, test, discover, apply, and support forecasting models and statistical algorithms for PROS’ SaaS (Software as a Service) products.  Supporting the Forecast Data Scientist is a high-performance team of professionals from Data Science, Development, Marketing, Product Management, and the Office of the CTO.  PROS is powering modern commerce with dynamic pricing science! A Day in the Life of the Data Scientist -About the role:Create, implement, and improve statistical algorithms in PROS’ software products to help generate forecasts and predictive recommendationsExplore potential innovations to forecasts and predictive guidance through various techniques which could include machine learning, artificial intelligence, cognitive computing and other progressive technologies and ideasHelp diagnose problems reported by our customers who are using PROS forecasting functionalityRun simulations and test new ideasDesign specifications, with examples and test cases, for implementing forecasting and predictive algorithms into our softwareCollaborate with other data scientists and cross-functional teams to identify innovation opportunities and possible solution ideasRequired Qualifications - About you: We are looking for candidates who possess the combination of the following achievements, skills and behaviors: Advanced degree (Ph.D. preferred) in statistics, econometrics, applied mathematics, or a related fieldExperience using statistical models for forecasting / predictive analyticsExcellent written and verbal communication skillsProgramming skills in at least one of the following: R, Python, Java, Matlab, C/C++Thrives in a collaborative team environment: likes to work with othersSelf-starter with clear career goalsAbility to apply creative thinking to find innovative solutions to business problemsPositive mind-set and optimistic outlook who can contribute to a positive work cultureExcellent referencesSkills & Personal Characteristics:OwnershipPassion:PrideTrustIntegrityInnovationCustomer CentricityWork Environment: Most work activities are performed in an office or home-office environment and require little to moderate physical exertion. Work activities may require periods of extended hours, critical deadlines and stressful situations. To successfully complete the tasks of this position, individuals must be able to communicate clearly (in writing and orally), comprehend business terminology, interpret numerical data.  This job description is intended to convey information essential to understanding the scope of the job and the general nature and level of work performed by job holders within this job. This job description is not intended to be an exhaustive list of qualifications, skills, efforts, duties, responsibilities or working conditions associated with the position. The Company - PROS: PROS Holdings, Inc. (NYSE: PRO) is leading the shift to modern commerce, helping competitive enterprises create a personalized and frictionless experience for their customers. Powered with Dynamic Pricing Science, PROS solutions make it possible for companies to price, configure and sell their products and services with speed, precision and consistency across all sales channels. Our customers lead their markets across more than 10 sectors, and benefit from 30 years of accumulated knowledge and data science infused into our purpose-built solutions. PROS drives more than 200 million prices and 1.7 billion forecasts every day for enterprises in more than 30 industries around the globe. Our mission is to help companies and the people who work for them outperform. To learn more, visit pros.com."}