{"jobID": "2815357847", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Warehouse Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.t-3.com", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " GSD&M, R/GA, SapientRazorfish"}, "estimatedSalary": "75000", "jobDescription": " T3 is looking for a cross-functional data scientist, with an emphasis on CRM systems and analysis, to assist our clients in quantified decision making. We're looking for an analytical mind to uncover relevant, actionable insights and collaborate with other disciplines and client teams to act on them to drive improvement in conversion, retention and customer value. You will be able to work well with strategists, technologists and client-side digital marketing teams. You'll also bring a passion for testing and data-driven marketing to help shape national initiatives and go-to-market strategies. Responsibilities:Write subqueries in SQL with aggregate functions, conditional logic, and joins to extract datasets from Enterprise Data Warehouse.Perform complex Ad-Hoc queries, analyses and segmentation studies that combine multiple tools and data sources and types to extract insights from tests.Perform analyses on multivariate tests, compile results and present them to stakeholders in a timely manner.Manage data quality assurance, identify data collection issues.Evolve and standardize overall analysis approach, including reports, dashboards and templates.Plan and deliver CRM strategies across the company, encouraging customer acquisition and retention.Monitor and maximize customer segmentation strategies, ensuring maximum profitability.Working with client to ensure the database is segmented effectively for targeted marketing activities.Developing testing strategies for all aspects of the CRM to ensure the most effective approach for the client.Collaborate on developing and evolving a practical learning agenda and testing schedule with Project Managers, Designers and Technologists for CRM app elements and user journeys and triggers."}