{"jobID": "2835735768", "jobLocation": "Austin_TX", "jobTitle": "Accounting Systems and Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.epicor.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Oracle, SAP, Infor"}, "estimatedSalary": "36000", "jobDescription": " Job Title: Accounting Systems and Data Analyst  Requisition Number: 18001434  Location(s): Austin, TX Company Overview: Epicor is one of the world's leading software companies,with more than 20,000 customers in over 150 countries using our products toeffectively and efficiently automate and streamline their essential businessfunctions. With industry specific solutions for the manufacturing,distribution, retail and service industries, Epicor products allow our customersto focus on core, revenue generating activities. Epicor is privately owned byKKR & Co. and produces approximately $900M in annual revenue with around4,000 employees. Role Summary / Purpose: Epicor Software Corp. is seeking a manager to join the accountingteam to serve as a business systems and data analyst. They will manage our technologyimplementations, identify process improvements, create process documentationand serve in a support role for various aspects of our accounting functions. Theposition is based in Austin, TX. EssentialResponsibilities:Responsible forthe development of custom data extracts and reports.Maintain EpicorERP (E10) system entity structure and other system-related Operations processesOversee supportand issue resolution for Epicor ERP usersMaintain usersecurity access for Epicor's applicationsCoordinate with ITfor Accounting and Finance as issues ariseHelps identify, recommend and implement quality improvementopportunities.Partner with ITorganization to collaborate on projects that impact the accounting organizationSupport Epicor'sProfessional Services team with E10 implementation phases (international), asneededWork together withEpicor Business Leads to address key system control gaps and areas ofinefficiencyManage and respondto E10 system issues (incidents) submitted via ServiceNow toolOrganize anddirect the implementation of change management requests on behalf of accountingusersRegular statusmeetings with management (stakeholders) regarding privileged access andcritical system issuesRegular trainingsessions for E10 user access administrators and IT support; create and maintainKnowledge documentsAssists on specialprojects and provides ad hoc reports as neededSpecific Projects:Partner with SOX Compliance teamto implement compensating/mitigating controls for high risk areas such asexcessive and inappropriate access to Security Manager and superuser groups.Develop Super User groups byprocess track for use by Business Leads and IT troubleshooting (temporaryaccess)Work with Product Developmentteam to escalate and track critical changes impacting controls over financialreportingRevise, add or rearrangeSecurity Groups and/or Security ID's to address user access SOD issues, asneededAssist the Compliance team withrequired E10 audit documentation requestsClean up \"orphan\" menu access on system report so that no manual modificationsare neededLead in training new users onusing Epicor ERPAbility to understand financialinformation flows from various ERP source systems to Hyperion consolidationsystemQualifications/Requirements:Bachelor's Degree from a top university with a preference in Finance, Accounting, Information Technology and or related discipline.An MBA, CPA, or CMA is preferred.A minimum of 7 years of professional experience is required. Experience with multinational corporations is preferred.Detailed operating knowledge of E10 programs and configuration (subject matter expert)Experience with using and/or implementing software.Proficient with MS Office and advanced knowledge with Excel, including power pivot tablesExperience with Business IntelligenceExperience with MS SQL Server Database & SQL language is a plus but not a requirement.Experience with running queries and setting up reports using Oracle's Essbase is a plus but not a requirement.Experience with self-service ETL/visualization tools (Noetix, Tableau, Power BI, Alteryx) is a plus but not a requirement.Basic understanding of GAAP and/or financial statement presentationSelf-starter with demonstrated success in driving positive change in a fast-paced and ambiguous environment.Ability to work independently and with ambiguity; detail-oriented and execution focused.Strong written and verbal communication skills, highly collaborative.Adaptability - Commitment, self-confidence and willingness to embrace changeDependability and Reliability - Initiative, consistently meets deadlines, concentration and desires accountability for their workProblem Solving - Attention to detail, eager to learn and develop new solutions, persistence in driving improvement, and process drivenCustomer Service Orientation - Consistently meeting and anticipating the needs of internal customers, and respecting others and fostering positive working relationshipsAbility to handle multiple priorities, work under time constraints, meet deadlines and work independently FOLLOW US ON LINKEDIN -SDL2017"}