{"jobID": "2817712840", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.agilent.com/go/careers", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (A) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Illumina, Danaher"}, "estimatedSalary": "138000", "jobDescription": " Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at ***************.  At Agilent, we're focused on making the world a safer and healthier place. The digital channel group at Agilent is leading the digital transformation of traditional business process and customer interaction with Agilent. The digital channel is seeking a Data scientist to join our newly formed global digital analytics team as we build out our innovative data analytics capabilities.  You will be responsible for end to end analytics initiatives: identify business case, craft data analytics approach, conduct deep dive insights extraction or predictive models or optimization algorithm, interact with business functions, and measure the business impact of the analytics initiatives. Whether you are working on web content personalization or using IoT data to create the most compelling customer offerings, you will take part in lifting business and data analytics to a new level. There will not be a shortage of puzzles for you to solve.  You will apply data analytics rigor, business acumen, unbounded creativity, and clear communication to:  Understand business strategy and questions, design applicable data analytics approach, hand on extract insights from data or build predictive and optimization models, work with business to implement, and measure business impact.  Identify patterns in large data sets. Such as uncover customer behavior on digital properties, either website or mobile devices. Identify key drivers of website visitor experience and revenue growth.  Use machine learning and predictive modeling to develop data driven solutions that drive substantial business value in key digital transformation areas  Work across ecommerce store, digital marketing, content creation, operations, product team, and upper management.  Fully leverage all available online and offline data sources to create a holistic view.  Serve as a subject matter expert on web analytics and data science and stay abreast of data science best practices and new applications in machine learning, big data analytics. }, { label: Schedule Full-time }, { label: Requirements Qualifications: Graduate degree in math, statistics, engineering, operational research, computer science, and other quantitative fields is required.  5+ years of hands on working experience with Python, R, SQL and database structures.  Google Cloud and Google Analytics 360 working knowledge is a plus.  Solid statistics or data analytics approaches, methods, applications to real world issues.  A passion for data analytics.  Ability to interact with a diverse group of subject matter experts and other technical and non-technical cross-functional team members within a large global organization.  Creative, innovative, persistent, and forwarding thinking  Self-starter who can work independently for new initiatives. A true team player who are not only open to different ideas but also goes out of way to help colleagues.  Keep up with new tools and knowledge in both data analytics and digital technologies.  Agilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.  For more information about equal employment opportunity protections, please view the 'EEO is the Law' poster available here ***************************************************************** *********************************************************************************************** Agilent Technologies, Inc., is committed to diversity in the workplace and strives to support candidates with disabilities. If you have a disability and need assistance with any part of the application or interview process or have questions about workplace accessibility, please contact +1-************ (US and Canada only) or email ***********************. EOE AA M/F/Vet/Disability }, { label: Travel Required Yes, 25% of the Time }, { label: Secondary Locations }, { label: Duration Not applicable"}