{"jobID": "2817188545", "jobLocation": "Redwood_City_CA", "jobTitle": "Sr. Digital Analytics Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.imperva.com", "Headquarters": "Redwood City, CA", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Public (IMPV) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " F5 Networks, Checkpoint Technologies, Cloudflare"}, "estimatedSalary": "132000", "jobDescription": "Senior Digital Analytics Manager  Cyber Security is a big deal. Its in the news, growing rapidly, a critical tool for every company, and our specialty.  Imperva is a public company (NASDAQ) and cybersecurity leader that delivers best-in-class solutions to protect data and applications on-premises, in the cloud, and across hybrid environments.  Our customers include leading enterprises, government organizations, small businesses, and service providers.  The Senior Digital Analytics Manager will be a key player in the Marketing Operations Center of Excellence (COE) -- focused on marketing performance management, which includes data, analytics and measurement, strategic planning, and marketing resource management.  This role is best suited for an analytical thinker who is passionate about using data and business intelligence to move the organization forward. Ideally, s/he has subject-matter-expertise and proven abilities in digital measurement strategies and analysis.  Candidates should possess an understanding of B2B marketing, with a strong background in data and financial analysis, and have the ability to develop strong collaborative relationships across the broader marketing, sales operations, and IT apps organizations.  This position reports to the Director of Marketing Operations Center of Excellence Key ResponsibilitiesDigital Data AnalyticsFunction as the lead analytics partner for digital marketing: Own end-to-end performance on all core performance marketing metrics.Take ownership of all datasets for measurement of digital marketing performance and reporting to cross-functional stakeholders, including leadership in marketing, sales, and productLead design and implementation of experimentation necessary to improve channel efficiency, drive growth, and inform marketing investment decisionsCollaborate with marketing leadership to develop strategy, standards, goals, and KPIs throughout the entire marketing funnel from inquiry to opportunityUtilize quantitative inputs to identify trends and behaviors and subsequent actions needed to drive improvements in the online channel and making actionable recommendations to key stakeholders.Monitor, analyze, and report on the health of marketing performance, including pipeline contribution, program ROI, customer acquisition/penetration, and activity.Determine impact-level marketing measurement and KPIs on marketings contribution to the businessBuild actionable marketing reports ensure that measurement drives performance review of key functions and campaignsExtract insights on behavior of customers acquired through performance channels using analytics tools, data platforms, and internal databasesIdentify, define, and analyze populations (segments) that frequent the website based on IP address, activity history, and other factors.Help to drive data strategy development and infrastructure deployment, including technology ownership and marketing process governanceMarketing AlignmentBuild highly effective working relationships with the broader marketing team, sales, finance and IT.Gather and disseminate internal and external marketing best practicesDeliver effective change management and communications for technology implementation, data policy and process re-engineering within marketingKnowledge & Skills8+ years experience in marketing measurement and dashboard reporting for technology companies, with thorough understanding of web analytics and KPIs.Experience in data-driven marketing strategy, planning, financial management, budget allocation and organizational alignmentExperience in translating business objectives into marketing goals and measurementAbility to translate quantitative data into actionable recommendationsStrong analytical skills with ability to drive meaningful actions from large data setsExperience with SQL / R, and BI tools, especially Tableau, is highly sought after.Ability to think out of the box and test new, creative approaches and strategiesAbility to multi-task and prioritize in a fast-paced and dynamic work environmentAn organized individual with great attention to detail and focus on quality of resultsA self-motivated individual; a good team player; someone who takes accountability and ownership of his/her own workExcellent communication skills, including demonstrated proficiency in oral, writing and presentation abilities in a business-focused setting, to varying audiences.Familiarity with Salesforce, Marketo, PowerPoint, Excel, and Word requiredBachelors degree requiredOur Company: Imperva® (NASDAQ: IMPV), is a leading provider of cyber security solutions that protect business-critical data and applications. The companys SecureSphere and Incapsula product lines enable organizations to discover assets and vulnerabilities, protect information wherever it lives on-premises and in the cloud and comply with regulations. The Imperva Application Defense Center, a research team comprised of some of the worlds leading experts in data and application security, continually enhance Imperva products with up-to-the-minute threat intelligence, and publish reports that provide insight and guidance on the latest threats and how to mitigate them. Imperva is headquartered in Redwood Shores, California. To learn more visit www.imperva.com, www.incapsula.com, our blog, on Twitter Legal Notice: Imperva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, pregnancy, age, sexual orientation, gender identity, marital status, protected veteran status, medical condition or disability, or any other characteristic protected by law. LI-MM1"}