{"jobID": "2658301723", "jobLocation": "Sunnyvale_CA", "jobTitle": "Algorithm Engineer/Scientist", "companyRating": null, "companyInfo": {"Website": "www.baidu.com", "Headquarters": "Beijing, China", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (BIDU) ", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Baidu ISA team (intelligent silicon and architecture) is looking for world-class engineers in Sunnyvale CA, Seattle WA, Beijing China, and Shanghai China to research, develop, design and implement AI chips that are suitable for cloud computing, autonomous driving, digital assistant, etc. Join us and you will have the fantastic opportunity to learn these cutting-edge technologies and design the AI chips that will be used extensively internally & externally.  Job Description: Research deep learning algorithm in various fields such as computer vision, speech processing, advertisement recommendationComply deep learning algorithm in various scenarios such as the autonomous driving car, smart home, data center, etc.Utilize AI chip hardware to co-design with software and optimize the algorithm and system in AI application scenarioCreate solutions for the integration of model compression, hardware abstraction and software development Preferred Experience: Master/ Ph.D. degree in Computer Science/Electrical Engineering or related field or equivalent practical experience5+ years of experience in one or more of the following areas: machine learning, computer vision, image processingKnowledge of deep learning algorithms(DNN,CNN,LSTM,GRU) and AI frameworks (TF/Caffe/PaddlePaddle/etc.)Experience in publication of relevant papers in CVPR, ICCV, NIPS, ICLR, ICML, TPAMI and other related academic conference journalsExperience in CPU/GPU/XPU VerificationStrong programmer; Skill in learning the latest algorithms and theories by reading the essaysFast learner with entrepreneur & research spirit; Good communicator and team playerMandarine speaker preferred"}