{"jobID": "2768436800", "jobLocation": "Chicago_IL", "jobTitle": "Director of Quantitative Research", "companyRating": "3.6", "companyInfo": {"Website": "www.eggstrategy.com", "Headquarters": "Boulder, CO", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "279000", "jobDescription": " COMPANY BACKGROUND Egg Strategy is a well-established, global marketing consultancy serving primarily Fortune 500 Companies around the word across a range of CPG, Lifestyle and Health/Pharma categories. We have rapidly growing offices in Chicago, Boulder, and New York. Over the past decade, we have brought our clients strong connections to the pulse of everyday life with a passion for understanding how people connect with brands today. On that foundation, our team of research experts, strategists and innovators collaborate with forward-thinking clients to transform human insights into powerful brand and company growth.  We have built our expertise in four key areas:  We are expert insight hunters using cutting edge qualitative and quantitative methodologies  We are highly respected quantitative partners validating growth moves and opportunities  We create strong brand and portfolio strategies that inspire growth  We create new brands and products with our proven innovation expertise JOB DESCRIPTION We’re are looking for a DIRECTOR of QUANTITATIVE RESEARCH ( a mid-level leadership position), specifically focused on the CPG marketplace, in our CHICAGO office. The successful applicant will have a demonstrable track record of quantitative expertise and hands-on project and team management experience grounded in a deep passion for scoping out, crafting, guiding and delivering actionable insights focused on brand strategy. Candidates should be seasoned research and team managers, either on the client and/or consulting side, from a well-regarded company and have the presence to lead savvy clients in the understanding and implications of our work.  DESIRED SKILLS & EXPERIENCE 8+ years of smart thinking and quantitative research management and delivery on big brands. First consideration will be given to candidates who are excelling at other strategy and innovation agencies but who are looking to showcase their skills on a higher-profile set of challenges.Preferred: a record of quantitative experience in the Consumer Packaged Goods (CPG) space, including a deep understanding of CPG categories, brands and products and attendant competitive landscapes.Preferred: graduate training in quantitative research analytics, generally and specific to market segmentation, choice modeling applications, key driver analysis, and predictive analytics.Solid experience and facility working with and training juniors on standard and advanced analytic methodologies and software (e.g., Excel, SPSS, SAS, R).Proven experience with both primary and secondary research and be able to both execute on and guide/train juniors in advanced analytic capabilities (e.g., factor analysis, cluster analysis, correlational and descriptive analyses, advanced modeling (all variants of regression, including multivariate, logistic, multinomial logistic, random forest, etc.), and choice modeling (conjoint, discrete choice, MaxDiff, etc.The ability to communicate both the details of and higher level insights from complex quantitative analyses in a clear, precise, and actionable manner. Must be able to work not only independently but also collaboratively and as a leader within a teamHave a strong “front of the room” presence in client interactions and presentations, with the ability to earn the confidence of our clients and to lead them towards making well-informed, smart decisions about their brand.Have a keen interest in working with very growth oriented, fast moving and competitive clients who are leaders in high-volume, dynamic categories such as CPG, pharma, biotech and lifestyle including: food, beverage, beer, spirits, restaurants, fashion, and entertainment. In sum, we are looking for someone who is driven to challenge the status quo of existing analytical thinking and statistical methodologies. If this sounds like you, please send us a resume and a note about yourself demonstrating why you’re uniquely qualified to join our team. We’re looking forward to learning more about you!"}