{"jobID": "2746952654", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher / Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Big Data and technology driven systematic trading firm who specialise in using innovative statistical and machine learning techniques to gain an edge in the markets is looking to hire PhD and Post-Doctoral level research scientists to join a collaborative and collegial team of likeminded professionals.  The opportunity will allow individuals access to cutting edge tools and technology, with a flat operational structure that truly supports and encourages individuals to be creative in their methods and solutions. The role will involve applying innovative statistical techniques to very large sets of financial data to find patterns in the noise and then turn these signals into implementable trading strategies.  The firm cultivates an intellectual environment that is a-typical of a financial institution and a meritocratic compensation arrangement that rewards individuals for the impact they have made. No one works longer than 8-5 and working hours are flexible. This culture is a large part of the success of the firm and a driving factor behind the firm’s growth as individuals will be interacting with the founders of the company on a daily basis and not just given the chance to but pushed to make a significant impact from day 1.  If you have a background in statistical and/or machine learning with an intellectual curiosity and entrepreneurial drive and wish to work with some of the top data scientists and quantitative researchers in the world we would be interested in letting you know more about the company and finding out more about your background and research interests.  Candidate profile PhD in Mathematics, Statistics, Computer Science, Physics, Engineering or similarAcademic or Industry experience using modern statistical techniques to analyse large data sets.Exceptional mathematical abilities as evidenced through publication of research and/or success in mathematical competitions (IMO, Putnam Prize, etc)Experience in applied researchPrograming experience is required"}