{"jobID": "2830907211", "jobLocation": "Chicago_IL", "jobTitle": "Analytics Consultant", "companyRating": "3.3", "companyInfo": {"Website": "www.wsp.com", "Headquarters": "Montreal, Canada", "Size": "10000+ employees", "Founded": " 1959", "Type": " Company - Public (WSH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " WorleyParsons, SNC-Lavalin"}, "estimatedSalary": "81000", "jobDescription": " From aging assets and funding shorOrganizationlls to evolving government priorities and emerging disruptive technologies, today’s infrastructure owners and operators are facing a multitude of challenges. In response, clients are increasingly leveraging our multi-disciplined expertise, solutions-focused approach and ability to deliver to support them as they work to meet today’s needs and tomorrow’s challenges.  This environment has led to rapid growth for the US Advisory practice, as we’re now located in 30+ offices across the U.S. We plan to continue that growth and aim to expand our team by 25 percent this year. We are looking for motivated candidates who want to join our group of trusted advisors in delivering important, high-quality and high-value work to our clients and their stakeholders, while helping to shape the future growth of the nation’s built environment.  Plan, procure, develop, manage, finance, invest, and transform – come help us to change the future!  Company is currently initiating a search for an Analytics Consultant with our Enterprise Management & Strategy Business Line. Location is flexible with a preference for Washington, D.C., Denver, or Chicago.  Primary Roles and Responsibilities  Actively contributes to client relationship development (both internally and externally)  Works within a multi-disciplinary team to support, and/or lead the sourcing and delivery of complex consulting projects across infrastructure sectors  Independently perform qualitative and quantitative analyses, document findings, present project oCompanyomes and manage client relationships  Support the professional growth of our junior consultants within the practice area  Job Requirements Minimum Qualifications Bachelor’s degree in business, economics, engineering, or related field  5+ years’ experience in directly relevant consulting field  Strong written and oral communication skills  Strong interpersonal skills and high emotional IQ  Strong quantitative skills and ability to use analytical tools to solve problems  A strong team player who can get things done, can provide leadership when needed or be led when required  An ability to share knowledge informally and formally  Preferred Qualifications  Graduate degree in relevant field"}