{"jobID": "2805684036", "jobLocation": "Kalamazoo_MI", "jobTitle": "Buyer I", "companyRating": null, "companyInfo": {"Website": "www.synovos.com", "Headquarters": "Radnor, PA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Buyer is primarily responsible for routine MRO procurement transactions within the Synovos software system, and/or the client's CMMS system. The Buyer ensures materials are accurately ordered and entered into the site's procurement system. This position is responsible for placing routine orders to be processed and expedited in a timely and efficient manner, and employ problem solving methods to resolve issues with delivery, price or any other order issues. It is incumbent upon the Buyer to develop and maintain strong client relationships, keep an open line of communication, and maintain control of all aspects of purchasing. Follow all site Safety and Security Procedures at all times, attend required safety trainingsPlace mainly stock buys per the Stock Replenishment/Re-Order Report, cutting PO, verify unit of measure, estimated delivery dates (EDDs) and verifying costMaintain the vendor database and setup local vendors as needed. Follow preferred supplier program as instructed by corporate office adhering to prescribed goalsGenerate purchase orders (POs) using Synovos or client CMMS purchasing system. Verify quoted prices when generating a PO for any item including reorders. Updating POs, pricing updates and delivery dates as needed or when changedExpedite orders, manage status of purchasing needs via the creation of Non-Stock and Stock PO using the site''s \"Open Order Report.\" Regularly check Open Order Report and communicate delays or issues to supervisor and client as required. Ensure timely delivery of items, keeping supervisor and client informed of delivery statusEstablish and build relationships with client's employees, within the maintenance, facilities, planning or other affiliated departments in order keep abreast of client needsRoutinely monitor reports such as Run PO Cost Analysis Report to flag purchases outside guidelines and to maintain target pricing. Also monitor Shared Savings Report for any discrepancies on guarantee and to make corrections as neededWork with Manager/Buyer to obtain quotes on items not pre-sourcedReview invoices for price and/or quantity discrepancies and follow guidelines to resolve discrepancies, with a focus of assisting Site Manager or Supervisor in reducing discrepancies (IDRs)Work with Site Manager to streamline processes and implement quality improvements, documenting any changes into the Synovos system or site SOPAdhere to min/max levels as required at specific siteRoutinely perform duties of Attendant including: cycle counting, cleaning the storeroom, issuing materials, receiving and putting away stock, and other storeroom duties as directed or neededRequired SkillsStrong organizational and time management skillsSolid interpersonal skills including verbal and written communicationHighly detail oriented and good problem-solving skillsProficiency in basic ExcelComputer literacy - Windows Operating System, Microsoft Office and ability to learn and demonstrate proficiency in the use of the ERP systems (i.e. SAP, Maximo, etc.)Required Experience0-2 years of purchasing experience; high school diploma required; two year degree preferredBasic knowledge of MRO materialsExperienced at working with customers in a corporate or professional environment Job Location  Kalamazoo, US-MI "}