{"jobID": "2724998148", "jobLocation": "Reston_VA", "jobTitle": "Sr. Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.navient.com", "Headquarters": "Wilmington, DE", "Size": "5001 to 10000 employees", "Founded": " 2014", "Type": " Company - Public (NAVI) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " NavientNavient's Internal Audit department works to promote an effective internal control environment through risk-based audits, controls testing, pre-implementation reviews, special projects, and risk and control education. Audits and reviews are focused in many areas such as information technology, operational, and regulatory compliance, as well as company governance and financial functions. To support the audit process, Navient has a dedicated Data Analytics (DA) team that works with the Internal Audit team on a project by project basis to automate testing where possible and perform testing on large datasets with computer-aided audit techniques.  Navient has a great opportunity for a Senior Data Analyst. The Senior Data Analyst with the support of the DA Director will (1) Lead the planning, design, and presentation of analytics to assist the Internal Audit team with specific audit testing. (2) Independently test risk areas to ensure compliance with internal policy and regulatory requirements. (3) Ensure all assigned test work is adequately documented in accordance with the department's policies and procedures and Institute of Internal Auditors (IIA) standards. (4) Understand, track, assess, and follow up on deficiencies/exceptions noted during testing. (5) Summarize and effectively report testing results both orally and in writing to the audit team and/or management. (6) With the support of the DA Director, perform special projects as necessary. (7) Assist in developing and overseeing both the data analytic staff and staff auditors. (8) As part of Data Analytics testing, evaluate the state of management's documentation and testing of controls. (9) Grow Internal Audit's inventory of data and administer the Internal Audit Data Warehouse.  Our office is conveniently located across the Toll Road from Reston Town Center and is equipped with a work out center, on site cafeteria, and is situated directly adjacent to the Reston metro stop opening in the future.  ESSENTIAL FUNCTIONS:  1. Assist with planning and lead execution of data analytics to assist the Internal Audit team in the performance of specific audit testing and to address risk areas and test controls against internal policy and regulatory requirements  2. Assist in management and development of data analytic staff and staff auditors  3. Assist in the planning and execution of special projects, administrative activities, and investigations as needed.  * Bachelor's Degree - Mathematics, Statistics, Computer Science, Information System Management, Data Analytics or Engineering 3-5 years of auditing, analytics, data mining, programming, or relevant work experience is preferred.1-2 years of supervisory experienceMust demonstrate experience in planning and executing projects from start to finish while supervising staffMust demonstrate experience in: Relationship Building and Talent Management.Strong interpersonal and organizational skillsAbility to work with others in a team environmentIndependent thinking and problem-solving skills.Excellent written and verbal communication skillsAbility to multi-task varying priorities and meet deadlinesSolid analytical aptitude and research skillsWorking knowledge of MS Office suite software (e.g. Word, PowerPoint, Access)Ability and willingness to travel out of town on a periodic, as needed, basis (approximately 15-25% of the time)  TECHNICAL requirements:  * Sound understanding of internal control processes.Working knowledge of database management systems and relational database structure.Ability to collect and analyze complex data, evaluate information and systems, draw logical conclusions, and provide consistent quality output.  Strong proficiency and experience using:  * SQLR or PythonAdvanced Excel.Demonstrated experience in analysis and presentation of data.Experience working with a variety of information systems and data files, including large and complex datasets.Adept at development of analytics, documentation and report writing.  Proficiency in all or some of the following is preferred:  * SAS/ Excel (VBA)/Other statistical programming languagesTableau/Other business intelligence software  Preferred Qualifications:  * CIA or CISA is preferred. CPA is plus.Experience working in Internal Audit, Data Mining/Analysis, Data Research and Quantitative Analysis, Risk Management, or Regulatory Compliance functionExperience in a Public Accounting environmentFinancial services and/or student loan experience  All offers of employment are contingent on standard background checks. Navient and certain of its affiliated companies are federal, state and/or local government contractors. Should this position support a federal government contract, now or in the future, the successful candidate will be subject to a background check conducted by the U.S. Government to determine eligibility and suitability for federal contract employment for public trust or sensitive positions. Positions that support state and/or local contracts also may require additional background checks to determine eligibility and suitability.EOE Minority/Female/Disability/Protected Vet/Sexual Orientation/Gender Identity Navient Corporation and its subsidiaries are not sponsored by or agencies of the United States of America.  Navient is a drug free workplace.  Full-time  Reston, VA  Apr 5, 2018"}