{"jobID": "2635307949", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Project Assessor- ENV", "companyRating": null, "companyInfo": {"Website": "www.partneresi.com", "Headquarters": "Torrance, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SUMMARY Partner is seeking full-time Project Assessors to complete Phase I& II Environmental Site Assessments, within the Detroit, MI region. The ideal candidate will have 3+ years of experience performing Phase I ESAs. Positions are available in regional offices and remotely based on current need. ESSENTIAL DUTIES& TASKSComplete and finalize specific project tasks accordingly to deadlines and within budgetProject research (historical, analytical, etc.)Communication with client and subject site representativesData compilation and organizationReport authoringPreparation of quality supporting documents (site figures, appendices, etc.)Other tasks as assigned by the Project Manager associated with report deliverable schedule and planRESPONSIBILITIESConduct project research as applicable to scope of work (historical, analytical, etc.)Data compilation and organizationConducting site reconnaissance, including sampling activities, if necessaryTechnical report authoringPreparation of quality supporting report documents/filesEffectively communicate project progress and issues with the Project ManagerMaintain communication with team members throughout the course of the projectPlan, schedule and track project timelines and milestones to ensure project progress status is on scheduleUnderstands the assessment’s potential impact on the transaction processIdentify and resolve issues with projects.Deliver appropriate progress reports (verbally or by email) to the clientCoordinate and respond to requests for changes in project scopeKNOWLEDGE, SKILLS, AND ABILITIESExcellent communication skills (internal and external)Ability to work on projects concurrentlyProven ability to successfully deliver a quality product on timeExceptional writing skillsAbility to cultivate strong relationships within a teamQUALIFICATIONSBachelor Degree from accredited university in biological/physical sciences or engineering discipline5+ years relevant experience in environmental consultingProjects involve a degree of travel. Candidate must have a valid driver’s license and provide own transportation to and from project sitesPHYSICAL REQUIREMENTSMust be able to read, write, speak& comprehend EnglishMust be able to communicate clearly in person and over the telephoneVisual acuity adequate to perform job duties, including reading information from printed sources and computer screenRequires frequent bending, reaching, standing, walking, sitting, pushing and pulling exerted regularly throughout the work shiftWe will consider qualified applicants who have criminal histories in a manner consistent with the law. Learn more about Partner Engineering and Science, Inc. at www.partneresi.com."}