{"jobID": "2821612119", "jobLocation": "Canoga_Park_CA", "jobTitle": "Staff Scientist, Molecular Biology", "companyRating": null, "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": null, "jobDescription": " Job DescriptionWhen youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.  The Staff Scientist, Molecular Biology serves as a technical lead to explore new technologies and identify creative and robust solutions to overcome current technological limitations in molecular diagnostic products for the HLA genes or other relevant target genes. This role will be under the guidance of R&D; Director and Sr. R&D; Director.  Responsibilities: A highly competent and motivated individual with industrial or equivalent experience in developing molecular diagnostic products of complex gene systemsWorking knowledge of the latest DNA sequencing using NGS technology, DNA isolation and quantification, advanced gene amplification methods, Sanger sequencing, and molecular affinity based assay and other relevant technologies and good knowledge of application of such; leverages business acumen and subject matter expertiseActively participates in setting function/department objectives to meet goals and objectives, communicates and functions effectively in a multi-team environmentExperience in leading and mentoring scientists in designing experiments and interpreting complex data to test models, and solve challenging issues to improve product performance with innovative approaches; guides successful completion of major projectsConstructs and verbally delivers technical presentations that articulates the complete, hypothesis driven experimental path, all relevant outcomes including technical challenges, successes, failures and the key conclusions, including recommended next stepContributes the function/team through leadership, guidance and advise in the related areas of scientific expertiseCommunicate with other departments as a technical representative to assist in process improvement, customer inquiries, staff training as neededAuthors and/or edits internal and externally facing technical documents, such as application notes and user guidesWorks with Supervisors and Managers across the organization to effectively obtain and allocate resources to complete programs and projects on timeMinimum Qualifications:Ph.D. in Molecular Biology, Biochemistry, Immunology, Cell Biology, Genetics or a related discipline in Biological Sciences AND 5 years of postdoctoral experience focusing on NGS technology and its application, hands-on research and new method development experience preferably in an industrial setting or equivalent; OR a masters degree in Molecular Biology, Biochemistry, Immunology, Cell Biology, Genetics or a related discipline in Biological Sciences AND 7 years of industrial experience in product development focused on NGS technology and its application, hands-on research and development experienceStrong collaborator who can drive challenging products forward in designing, developing and launching competitive diagnostic kits in a cross-functional environmentDemonstrated knowledge in relevant field such as HLA genes or polymorphic gene analysis, genomics, nucleic acid analysis, sequencing, gene amplification, hybridization, molecular cloning in terms of theory and the latest laboratory techniques and proceduresAbility to conduct independent research and development work with a goal-oriented instruction in the relevant area using sound scientific approaches, guide technical areas, be able to make decisions in designing, performing, analyzing, and presenting experimental resultsPrevious experience and familiarity with reagent production, assay streamlining, reagent benchmarking, under GMP and ISO environment, and international QA/Regulatory standardsAvailability to work outside of normal working hours and be able to travel to visit collaborators as neededAbility to communicate clearly both in writing and verbally, using proper English grammarWorking Conditions:Able to work in a laboratory environment and also often in front of a computer monitorAbility to lift laboratory equipment and devices on occasionComfortable with occasionally using of biohazards and toxic chemicalsPreferred Qualifications:Knowledge of gene analysis methodology, including up-to-date knowledge of genomics research using Genbank human database with computer programs including MS Office Suite and statistical analysisExperience in a clinical diagnostic laboratory environment At Thermo Fisher Scientific, each one of our 50,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer. Apply today http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}