{"jobID": "2769214495", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst - Contingent", "companyRating": "3.7", "companyInfo": {"Website": "www.bytecubed.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": "***Candidates Must be a US Citizen with an active TS/SCI Security Clearance***ByteCubed, a cutting-edge technology firm, is seeking a GIS Data Analyst to join our company that believes small empowered teams of talented professionals can make impactful change. ByteCubed is a results-oriented consulting firm, dedicated to providing innovative yet cost-effective solutions to our federal and commercial customers. We specialize in acquisition innovation, decision support, and science and engineering.  We ensure our clients success by developing a deep understanding of their critical needs and teaming top technologists with domain experts to develop tailored and reliable solutions. At ByteCubed, we are committed to providing the best in customer service and to helping our customers accomplish their missions. Required Qualifications · 3 to 10 years of demonstrated experience in programming skills  · Ability to write scripts including Python and JavaScripts  · Superior knowledge of feature data services, data modelling, ESRI ArcGIS and ArcServer  · Superior knowledge of geospatial database content management and data format conversion  · Knowledge of coordinate systems (latitude and longitude, UTM) and their conversions  · Knowledge of projections and their properties and conversions  · Knowledge of symbolization rules (how symbols are used to portray features) and generalization rules  · Minimum 2 years of experience working with data quality control tools including ArcGIS Data ReViewer  · Proficient with ESRI Workflow Manager WMX and TAM  · Experience working with geospatial data in a multi-user enterprise environment  · Demonstrated ability with SQL Preferred/Desired Qualifications · Experience with combining digital cartography, computer technology, GIS, cartographic and geospatial production techniques, remote sensing, photogrammetry, and digital data formats  · Understanding of cloud architecture Education / Certification · A Bachelors Degree in a field related to the support services may count for up to four (4) years of this experience  · A Masters Degree in a field related to the support services may count for up to two (2) additional years of this experience Clearance Requirements · Due to the nature of the program, candidates Must be a US Citizen with an active TS/SCI Security ClearanceByteCubed is an Affirmative Action/Equal Opportunity Employer committed to providing equal employment opportunity without regard to an individuals race, color, religion, age, gender, sexual orientation, veteran status, national origin or disability."}