{"jobID": "2783381308", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " American College of Obstetricians and Gynecologists (ACOG), a membership organization dedicated to the advancement of women’s health care in Washington, DC, is currently seeking a SeniorData Analyst to establish and lead ACOG’s data collection, management and analysis activities.  As a member of the IT team, we are counting on you to leverage our data toolset and electronic data warehouse to produce reports and visualizations, providing an opportunity to directly influence the organization’s culture by utilizing data insights for business decisions and in direct support of our members. In this role, you will also chair the interdepartmental team empowered to define, implement and manage ACOG’s data enablement program. To be successful in this position, you must be proficient in Microsoft SQL and have hands-on experience with a leading data visualization product. This is an exciting, new role for someone to positively impact our business, our members and the many women that they serve. Provide guidance to organization-wide analytics operations to ensure adherence to data quality standardsImplement tools and strategies to translate raw data into valuable business insightsAnalyze data source systems to determine data availability and qualityBuild data analytics and reporting solutions, to include third party dashboard platform and PowerBI products, that will deliver trusted reporting enabling data-driven decisionsLeverage hands-on experience to administer, manage and implement changes to ACOG’s SQL environmentDevelop and utilize deep understanding of third party data lake and warehouse platform architecture, data repositories and data integration functionality to oversee operational activities and data strategyChair interdepartmental team to establish and maintain an effective data governance program with policy implementation and enforcementManage the development and release of data, reporting and analytics changes to productionContinuously identify and implement data, reporting and analytics process improvementsAssist with defining the data, reporting and analytics roadmap and long-term strategyBachelors Degree in a relevant field (i.e. Statistics, Data Management, Computer Science, Finance, Economics, etc.)Minimum of three years of practical experience SQL experience including complex selection queries and performance considerations (SSRS & SSIS a plus)Working knowledge of relational and dimensional data modeling techniquesMinimum of two years of experience utilizing business intelligence/data visualization tools such as Microsoft PowerBI or TableauSolid understanding of data analysis techniques and processes coupled with a curious attitude toward information that can be gleaned from dataExperience translating analysis results into business recommendationsMust be detail orientedAbility to effectively communicate with staff at all levels throughout the organizationAbout ACOG American College of Obstetricians and Gynecologists (ACOG) is a membership organization dedicated to the advancement of women’s health care through continuing medical education, practice, and research. When you join ACOG, you’re joining an organization that promotes growth, development, and flexibility. People who work at ACOG are driven to reduce barriers to contraception for all women, regardless of income, employment, or state of residence. Why ACOG?Our passionate team! Our team is led by experts in reproductive and maternal-fetal medicine, patient safety, and health care policy. We strongly believe in equal access for all women to high quality, safe health care. Our obsession with reducing maternal mortality, protecting access to contraception coverage, and addressing health disparities, has led to great strides in federal and state legislation. Join our team and help us advance the ob-gyn profession and women’s health care.We love to learn! As an educational organization, ACOG provides learning opportunities to members and employees alike. Our learning opportunity benefits include tuition reimbursement, onsite instructor-led trainings, leadership development programs, and participation in professional organizations.Our Perks 100% Paid Parental Leave – Breastfeeding Friendly Workplace – Work/Life Design (i.e. flexible work schedule) – Commuting Allowance – Generous Paid Time Off – Holiday Pay – Community Volunteering Opportunities – Generous 401(k) Company Contributions – Health Insurance – Learning Opportunities and Tuition Reimbursement – Company-Sponsored Team Outings ACOG is an EEO employer committed to providing equal employment opportunities to all applicants and employees. As a federal government contractor and in accordance with applicable laws, regulations, and Executive Orders, the College takes affirmative action to ensure that applicants and employees covered are not discriminated against because of their race, color, religion, national origin, sex (gender), age, disability, pregnancy, marital status, sexual orientation, personal appearance, gender identity or expression, family responsibilities, political affiliation, veteran status, genetic information, or any other characteristic that is protected by applicable law. For more information about your equal employment opportunity rights, please view this poster: EEO is the Law. The College also participates in E-Verify."}