{"jobID": "2800597906", "jobLocation": "Arlington_TX", "jobTitle": "Senior Analyst, Enterprise Supply Chain Data Systems", "companyRating": "2.5", "companyInfo": {"Website": "www.triumphgroup.com/companies/triumph-aerostructures-vought-aircraft-division", "Headquarters": "Berwyn, PA", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " Overview  Triumph Group designs, engineers, manufactures, repairs and overhauls a broad portfolio of aviation and industrial components, accessories, subassemblies, systems and aircraft structures. We partner with original equipment manufacturers (OEMs) and operators of commercial, regional, business and military aircraft worldwide, to provide products and services that solve their hardest problems. So whatever the part, component or complexity of assembly, Triumph is committed to quality, service and meeting the specialized needs of each customer.  Triumph participates at all levels of the aerospace supply chain from single components, to complex systems, to aerospace structures and their contents. We provide solutions for the entire product life cycle of an aircraft from raw material to aftermarket service. Our unique ability to integrate a broad range of products and capabilities is our competitive advantage. Responsibilities Key role within Triumph Group's Enterprise Supply Chain Team that supports/leads the continued development of the Qlik Sense and SharePoint Applications. This role directly reports to the Director of Enterprise Supply Chain Cost Management & Data Systems and is responsible for interpreting business users needs/requirements and developing Qlik Sense and SharePoint solutions. Drive the integration of manual/semiautomatic Excel based tracking/reporting into automated Qlik BI dashboards directly pulling from direct data sources to support the Enterprise, Business Unit and Site Supply Chain Teams.  A Successful candidate must have sound judgment, strong interpersonal skills and customer service mindset to explain complex technical issues in business terms to the Enterprise Supply Chain Team. Must be able to work within a dynamic and matrixed organization and on cross functional teams. Preferred candidate will be able to provide training to the Enterprise, Business Unit and Site Supply Chain Teams on Qlik Sense Dashboards and SharePoint Workflows, while resolving issues that range from basic to highly complex technical issues. This role requires strong analytical skills as well as the ability to communicate/translate large data sets into compelling business terms. The individual must be comfortable working independently as well as in a team environment with remote global stakeholders.  A strong candidate will have a great opportunity for accelerated advancement within Supply Chain Management and Information Technology from the experience gained by working on high impact projects and exposure to senior levels of the organization. Will have the ability to work across multiple sub functions to get exposure to different aspects of the Supply Chain and Information Technology. Need to have a can do/go getter attitude that looks to further develop personal and data systems skill set as well as Triumph Group. Key Accountabilities:Supply Chain Data Systems focal that supports the further development of the Qlik Sense and SharePoint Applications.Developing BI Solutions to support supply chain performance reportingOptimizing dashboards with the focus on usability, performance, flexibility and standardizationData modeling, cleansing and transformation activitiesEnd-to-end implementation of BI projects to develop automated KPI reportingStreamlining Supply Chain SharePoint site andDeveloping workflows to enhance business user process value#LI-KD1#GDOORQualificationsBachelor's Degree is requiredMBA/Master's Degree is a plus1-2 years of relevant experience in supply chain systems (ie SAP ECC, MES, Syteline)1-2 years of development experience in Qlikview or Qlik SenseProficient knowledge of the Qlik proprietary programming language is preferred1 year of Alteryx ETL/data blending is a plus1 year of BI Solutions supporting supply chain performance reporting is preferredManufacturing experienceAerospace experience preferredStrong MS Office Suite, Excel & PowerPointMust have the ability to prioritize requirementsAbility to travel 10-20%SDL2017"}