{"jobID": "2759673742", "jobLocation": "Reston_VA", "jobTitle": "Data Analyst (SQL)", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "77000", "jobDescription": " American Institutes for Research (AIR) is a leading professional services firm with a growing software engineering and product development team. We design and build things that are inspiring and make a real impact in the online testing industry. We are currently seeking a Data Analyst (SQL) to join our software development group in either our Washington, D.C. or Reston, VA office.  Be part of something innovative and cutting edge. Join our team of more than a hundred software engineers, designers, project managers and software specialists that are smart, creative and excited by what they do. Some of our ground-breaking work includes:advanced computer-adaptive algorithms (only one thats peer-approved in the country)mobile support for the user interfaceslearning management systems with social media featuresuser interfaces that are universally accessible to people with or without disabilitiesinnovative, machine-scorable items The Data Analyst (SQL) will be primarily responsible for the following: Integrate data from multiple data sets, analyze and interpret complex data sets and make findings relevant and actionable for both internal and external stakeholdersExperience in setting up, deploying, configuring, and monitoring multiple systemsProvide timely, accurate and reliable management reporting and analysis of dataCreate innovative solutions to an extensive range of complex data analysis requestsAssist in the development of additional information system projects, as neededVerify data quality to ensure accurate analysis and reportingBachelors degree in MIS, Statistics, mathematics, Business Management or a related fieldMinimum of 2 - 4 years of demonstrated experience (coursework or professional experience) with databases, SQL query development and at least one scripting language (Python, R, or other)Detail-oriented with excellent analytical and quantitative skillsDemonstrated ability to apply innovative and resourceful solutions to solve challenges and the ability to meet detailed project goals while working independentlyExcellent written and verbal skills with the ability to clearly organize thoughts and/or document content and convey complex concepts effectively regardless of audienceProficient with Microsoft SQL Server and SQL Reporting Services, Microsoft Excel, Microsoft Access and other database toolsLI-AS1"}