{"jobID": "2834440500", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Analyst – Mac Product Quality", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "88000", "jobDescription": "Data Analyst – Mac Product Quality Job Number: 113414705Santa Clara Valley, California, United StatesPosted: May. 18, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The people here at Apple don’t just create products — they create the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.  Our Product Quality Engineering team is looking for a dynamic, analytics-minded and driven analyst to join the team. You will partner closely with Engineering, Operations and AppleCare groups throughout the product life cycle to enable success. You will focus on end to end quality reporting, improved data analysis capability and speed for problem solving.Key Qualifications Working knowledge and theory of Quality Methods, Design of Experiments, Statistical Process Control methodsSolid technical database knowledge (SQL or variants)Expertise is managing and manipulating large data sets (Python, R, JMP, Excel or equivalents)Expertise in creating ad hoc and regular visualized reporting (Python, R, Matlab, Tableau or equivalents)Proven track record of managing and driving projectsExcellent written, verbal and presentation communication skills in EnglishAble to develop and present conclusions based on analysis to senior leadersTechnical knowledge related to electronics and mechanical assemblyExperience working with internal customersExceptional ability to build relationshipsData-driven and results-oriented approach to problem solvingEnthusiastic and motivatedAbility to travel internationally 20% DescriptionIn this role you will design, test, and implement a highly scalable data solution to support module (IQC), FATP, OQC, and field data to support statistical data analysis efforts.  Provide solutions to integrate parametric data for key quality test stations in the factories.  Architect solutions for automating data acquisition for OQC and Reliability data for contract manufacturers with the capability to link with other product data sources (IQC, Final Assembly, and customer experience data).  Implement automated reporting systems for critical business areas (Cpks, SPCs, and trend charts, and Health Charts).  Audit Factory data warehouse solutions for data integrity, scalability, and quality.  Travel as needed to the contract manufacturing facilities to set up, integrate, resolve and manage data issues.EducationBS or MS degree in Engineering, Math, Statistics, Data Mining, Machine Learning, Analytics, Econometrics, Mathematics, Operations Research, Industrial Engineering, or related field  Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}