{"jobID": "2796829379", "jobLocation": "Los_Angeles_CA", "jobTitle": "Finance Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.lootcrate.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Loot Crate was founded in 2012 around a simple idea: put the awesomeness of Comic-Con in a box. Today, we ship some of the coolest geek, gaming, and pop-culture collectibles and accessories to a subscriber base in the hundreds of thousands (with no signs of slowing down) making us one of the top subscription box services in the world! Weve assembled an amazing team of passionate, ambitious, impossibly nerdy people who cultivate our amazing fan community, provide support of the highest caliber, and generally just sit there radiating niceness. Were always on the lookout for fun, hard-working new people to join our team and make Loot Crate even better.  As a Finance Data Analyst at Loot Crate, you will be responsible for delivering key metrics and insights to our finance, product development, and growth marketing teams. As a member of the Brand Finance team, you will make evidence-based recommendations, model business case scenarios, track marketing performance and opportunities, and more. Most important, you will help business partners derive actionable insights from rich customer, marketing, and transaction data sets to drive strategic decision-making.  A strong candidate for this role will be very comfortable writing SQL queries and have a solid understanding of how BI tools (Looker, Tableau) apply business logic.  RESPONSIBILITIES Query SQL database and BI tools such as Looker and Tableau for key business metricsCreate dashboards to track customer and subscription acquisition costs, as well as revenue metrics. Generate brand insights and analysis from these dashboards.Create financial models and collaborate with Finance leadership to perform revenue and profit forecastingOwn reporting for revenue recognition and deferred revenuePerform deep-dive analysis of our rich data set of marketing costs and performance data, glean meaningful insights and communicate them in a business-friendly mannerAnalyze our e-commerce funnel data (visitors, conversion) and highlight opportunities for the Brand and Technology teamsGenerate key financial health metrics for investor diligence and other finance-related reporting SUCCESS FACTORS A structured and methodical mindset when approaching new data sets and analysisStrong collaboration and people skills - be able to surface data discoveries to the right stakeholders and frame them in a business contextWillingness to weather the peaks and valleys of a start-up businessBecome an expert in Loot Crate business logic and BI tools SKILLS & QUALIFICATIONS Bachelors degree in Business, Economics, Mathematics, or other highly quantitative fieldTwo years in a role requiring full-stack solutions for business questions (end to end creation of a deliverable which may involve gathering requirements, partner management, data extraction, report creation, and presentation)Strong proficiency in SQL and experience with BI tools such as Looker and TableauSolid familiarity with financial analysis (cost analysis, revenue forecasting, modeling)"}