{"jobID": "2822986324", "jobLocation": "Dallas_TX", "jobTitle": "Financial Analyst (Finance Data Coordinator)", "companyRating": "3.7", "companyInfo": {"Website": "www.legrand.us", "Headquarters": "West Hartford, CT", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Telecommunications", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Schneider Electric"}, "estimatedSalary": "64000", "jobDescription": " Financial Analyst (Finance Data Coordinator)  Location US-TX-Dallas  # Positions 1 Experience (Years) 3 Category Accounting / Finance Position Description  At a Glance Legrand has an exciting opportunity for a Financial Analyst (Finance Data Coordinator) to join the BCS Lighting Controls Team in Richardson, TX.  This financial analyst position for BCS Lighting Controls serves as the main point of contact for sales reporting, sales commission and related questions and will directly interface with external sales agencies, as well as the internal sales and customer care teams. They are responsible for sales reporting to sales and commission reporting and analysis related to the internal and external sales team. Other responsibilities include managing the financial portion of all rebate arrangements and sales incentive programs, being the main contact for any sales commission issues and other tasks as needed.  What Will You Do? Main Job Duties: Calculate commission for all sales representatives & research and resolve all discrepancies. Prepare and process timely and accurate commission payments Calculate distributor rebates Prepare monthly journal entries and account reconciliations relating to rebate, commission, and sales incentive programs Prepare sales reporting to include daily sales dashboard and monthly sales summaries Create ad hoc reports for management, sales managers and distributors Prepare reporting received by customers for distribution to sales and management Work on transfer report and point of sales report provided by distributor Process warranty payments Ad hoc analysis for sales Performs other similar and related duties as requiredQualifications Basic Qualifications: Bachelor's degree Finance or Accounting . Minimum 3 years of relevant professional experience in Finance or Accounting.Preferred Qualifications: Good organizational and time management skills and attention to detail. Understand flow and proper business document requirements Demonstrated customer service skills and have a strong customer orientation. Excellent computer skills including email software, web browsers, and strong skills in the Microsoft Office Suite, specifically Word, Excel, and PowerPoint. Basic knowledge of other related data systems and programs, such as, JD Edwards, Sequel, Salesforce.com and Smartsheet. Working knowledge of Business Intelligence and Data Warehouse applications, such as, Microsoft Power BI. Company Info  About Legrand Every day, Legrand brings power, light and data to millions of spaces around the world. Legrand is a global, publicly-traded company listed on the Euronext ( Legrand SA EPA: LR ) with 36,000 employees worldwide, a market cap of $16B, revenue of more than $5 billion, with products sold in 180 countries. Legrand is listed on the Forbes Global 2000 as one of the world's best employers. For more information, visit legrand.com .  About Legrand North and Central America Legrand North and Central America (LNCA) employs over 5,000 associates in 60 locations, working in 6 product categories (Electrical Wiring Systems, Building Control Systems, AV, Data Communications, Power Distribution and Control, and Lighting). LNCA offers distinctive benefits like high employer 401K match, above-benchmark paid maternity leave, paid time off to volunteer, and an active women's network. LNCA is an employee-centered, growth company with tremendous opportunity. For more information, visit legrand.us .  About Legrand's Building Control Systems Division Legrand's Building Control Systems (BCS) division includes the Wattstopper and Solarfective product lines. Wattstopper offers the most comprehensive line of simple, scalable and flexible energy efficient lighting controls and solutions for commercial and residential applications. These products, programs, and services have been helping customers save energy, meet green initiatives and comply with energy codes for more than 30 years. Solarfective gives Legrand customers the most energy efficient, easy-to-use advanced shading and lighting control solutions. For more information, visit lerand.us/lighting-controls-building-systems .  http://www.legrand.us  http://www.youtube.com/legrandna  http://www.linkedin.com/company/44580  http://twitter.com/legrandNA  EOE Minority/Female/Veteran/Disabled  Options  Apply for this job online Apply  Share  Refer this job to a friend Refer  Sorry the Share function is not working properly at this moment. Please refresh the page and try again later.  Share on your newsfeed "}