{"jobID": "2612793390", "jobLocation": "Dallas_TX", "jobTitle": "Loopback Analytics - Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.loopbackanalytics.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About the Job Do you want to work at one of Dallas Business Journal's Best Places to Work in North Texas? And with one of the SMU Cox School of Business fastest growing privately held companies? If so, we want to talk to you! We are looking for a Business Intelligence Analyst, experienced in working with large data sets and mining them for unique insights and opportunities. The position is a critical part of the Looback Solution Management team and will be responsible for contributing to multiple aspects of the data analytics process. Responsibilities:Drive analytics exploration of large data sets into actionable insights for clientsDesign, develop and maintain interactive dashboards and reportsWork closely with business and account leads to identify opportunities to improve intervention programs and targeted outcomesCollaborate with ETL and Operations teams to enhance existing data processesApply critical thinking skills to effectivevly perform quality assurance on other team members analysis and their ownGrow core data analysis and exploration skills amongst team membersRequirements:Personal Characteristics:Exhibits a \"self-starter\" mindset in taking ownership over delegated responsibilitiesStrong analytical and problem solving skillsCapable of leading a team throughout an analytical investigationCapable of independently researching the underlying business drivers relevant to an analytical investigationAble to work on multiple initiatives concurrentlyDemonstrated commitment to continual learning (E.g. Udacity, Coursera, edX)Required Experience/Skills:Bachelor's or Master's degree2-7 years of experienceStrong knowledge of industry best practices surrounding data exploration, analysis, visualization and interactive dashboardsAblity to formulate analytical lines of inquiry based on business drivers and address them in large data setsAbility to create effective and insightful visualizations for client consumptionAbility to articulate complex analytical insights to clients through executive level presentationsSQL, T-SQL, and experience with a Business Intelligence system/toolDesired Experience/Skills:Power BISQL Server Reporting Servies (SSRS)R ecosystem (RStudio, DPlyr, Shiny, ggplot2, etc.)Machine Learning ModelingTravel:NoneAbout the Company: Loopback Analytics is a data analytics pioneer in the healthcare industry. The company's comprehensive management platform improves patient care coordination by ensuring patients get the right intervention at the right time. This employer will not sponsor applicants for employment visa status (e.g., H1-B, OTP) for this position. All applicants much be currently authorized to work in the United States on a full-time basis. All qualified applications will recieve consideration for employment without regard to race, color, religion, sex, or national origin. For immediate full-time consideration, please send your resume to careers@loopbackanalytics.com."}