{"jobID": "2831651517", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Supervision Analyst/ Supervision Analyst – Data Librarian focus", "companyRating": "3.8", "companyInfo": {"Website": "www.chicagofed.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1914", "Type": " Government", "Industry": " Government", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Sr. Supervision Analyst/ Supervision Analyst – Data Librarian focusWholesale Credit Risk Center – Supervision and Regulation DepartmentThe Senior Supervision Analyst/Supervision Analyst will support core supervisory activities of the Risk Specialist Division related to Wholesale Credit Risk and Stress Testing. The analyst will accelerate the development of research data services through collecting and organizing financial, technical, statistical, operational, or examination data for report preparation and analysis. The analyst also will be responsible for management of data throughout its lifecycle. Further, the analyst will assist in methods for data stewardship include managing, describing, preserving, and making data accessible to appropriate audiences. Principal Duties and Responsibilities:· Conduct day to day management and delivery of multiple data processes liaising with business unit teams and other operations teams.· Ensure data governance principles are adhered to ensuring all procedures are efficient, clearly documented and maintained.· Partner with internal teams to negotiate, procure, and communicate appropriate use of vended data products.· Responsible for the creation and socialization of metadata· Develops and maintains communication vehicles to disseminate information to key constituents throughout the Division, the Department and the System· Participates in System-level and ad-hoc projects which may include working with staff from other Reserve Banks and the Board of Governors· Develop and maintain strong relationships with internal stakeholders and peers – provide ad hoc support to investigate, quantify and resolve data queries· Collects and organizes financial, technical, statistical, operational, or examination data for report preparation and analysis, for inclusion model or data analysis projects, or for inclusion in formal presentations· May manipulate data from a variety of sources· Presents analysis to a variety of audiences· Organizes presentations and roundtables on data issues· Performs other duties as assignedSenior Supervision Analyst level· Bachelors’ degree in Information Science, Library Science, Computer Science, or equivalent experience; Master’s preferred· Five plus years of direct work-related experienceSupervision Analyst Level· Bachelors’ degree in Information Science, Library Science, Computer Science, or equivalent experience · Over three years of direct work-related experienceKnowledge & Skills· Intermediate proficiency with SQL required· Experience with Data Modeling/Database Design· Data migration (ETL) experience· Experience with scripting languages (i.e. Python, R) preferred· Experience with Git preferred· Strong attention to detail · Excellent customer service, communication, organizational and interpersonal skills. Independent thinking and decision-making abilities Other RequirementsApplicants must be a U.S. Citizen or hold a green card with the intent to become a U.S. CitizenAs a condition of employment, Federal Reserve Bank of Chicago employees must comply with the Bank’s ethics rules which generally prohibit employees, their spouses/domestic partners, and minor children from owning securities, such as stock, of banks or savings associations or their affiliates, such as bank holding companies and savings and loan holding companies. If you or your spouse/domestic partner or minor child own such securities, and would not be willing or able to divest them if you accepted an offer of Bank employment, you should raise this issue with the recruiter for this posting, who can provide you contact information for our ethics official if necessary."}