{"jobID": "2795180602", "jobLocation": "Troy_MI", "jobTitle": "Automotive Data Analyst- Finance", "companyRating": "3.1", "companyInfo": {"Website": "www.jdpower.com", "Headquarters": "Costa Mesa, CA", "Size": "501 to 1000 employees", "Founded": " 1968", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Nielsen, TNS Global"}, "estimatedSalary": "49000", "jobDescription": " As part of J.D. Power’s Power Information Network (PIN) Navigator (Lender) team, your primary focus will be supporting our automotive lending clients in optimizing their usage of the PIN Navigator Product. J.D. Power’s PIN data contains millions of data points of annual new and used vehicle purchase transactions, coupled with consumer credit scores, that we use to understand the dynamics of the automotive Lending industry. You will work directly with clients to optimize Navigator product usage via product training and Best Practices Sharing, Analyze Data to provide Industry Insights, support the Navigator Director in New Product Development and solicit New Client acquisitions. Our engagements support Lender Market Share, Product Pricing optimization for Loan and Lease and Risk Analysis for the financial services in the very exciting, dynamic and complex automotive lending industry. Responsibilities:Provide support and training to automotive lending clients. (Ensure effective usage of the PIN tool, train clients new users, demonstrate new products and solutions)Evaluate and analyze the automotive lending marketplace to provide Industry Insights to be utilized by both clients and the automotive industry.Support the Director of PIN to create new products and enhance existing products.Solicit potential lender clients as well as demonstrate new product enhancements to existing clients.Assist in improving the quality, operation, and usability of the PIN Navigator databaseQualifications:Automotive Lending Industry Experience RequiredBA/BS degree in Business related field: Economics, Statistics, Engineering, Accounting, Business Administration, Computer Science etc. required [Masters / MBA desirable]5+ years of relevant experience*Strong proficiency in Excel (ability to work with large, complex and dynamic datasets) and PowerPoint as well as balance of Microsoft Office SuiteKnowledge of and interest in the automotive lending industry highly preferred, experience with consumer products or with management consulting firms also preferredOutstanding communication skills (written and oral) with ability to think quickly on feetOutstanding analytical/problem solving and data analysis skills (ability to see the story through the data)Ability to interact effectively with people including senior management both within clients and internally at J.D. PowerThrives on tackling difficult problems in a dynamic and fast-paced environment.A combination of an advanced degree and corporate work experience, or analytical extracurricular /entrepreneurial activities and corporate work experience, will also be consideredThe Career Opportunity: This role will use your analytical, business, and client-facing communication skills, while leveraging your knowledge of the automotive lending industry. You will also be comfortable with pursuing new business development opportunities enabling your career growth within the PIN Lending and Automotive Teams."}