{"jobID": "2690286543", "jobLocation": "Austin_TX", "jobTitle": "Senior Scientist, Research", "companyRating": null, "companyInfo": {"Website": "www.asuragen.com", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Luminex, Natera"}, "estimatedSalary": null, "jobDescription": " Asuragen is seeking outstanding Ph.D.-level scientists who can work as part of a Research group that is charged with creating innovative amplification-based assays for the detection and quantification of nucleic acid and/or protein biomarkers. This high-impact position will help expand Asuragen’s molecular diagnostics portfolio that currently influences over 15 million patient management decisions each year.  The Senior Scientist position requires scientific creativity, independence, and technical leadership within Asuragen’s R&D; team to develop and optimize sample-to-answer workflows for nucleic acid-based tests. This role will support technology initiatives to enable novel multiplexed PCR assays that can resolve multiple classes of DNA, RNA, and protein markers. Assays are designed using fast-and-simple methods that can be broadly deployed in kitted diagnostic products and integrate reagents, instrumentation, and analysis algorithms and software. Additional responsibilities include leading scientific collaborations, conceiving and preparing grant applications, writing peer-reviewed manuscripts, and sparking new patent applications. Successful candidates will join a fast-growing company of nearly 150 employees focused on enhancing patient care through the development of cutting-edge diagnostic assays in disease areas spanning genetic disorders and cancer. Qualifications:A Ph.D. degree in biology, chemistry, biomedical engineering, or related fieldExpertise in multiple technologies/fields, including innovative and ideally highly multiplexed PCR methods, and the ability to combine insights from different disciplines to leap technical barriersA strong track record of independence, innovation, and productivity through multiple peer-reviewed publications and/or patentsSuccessful project outcomes through internal and external collaborationsExcellent written and verbal communication skillsAbility to analyze complex data with relevant statistical methods and clearly present information to technical and non-technical audiencesA passion for improving patient care through diagnostic technologies, particularly in genetics and oncologyPreferable Experience and Skills:At least 2-4 years post-Ph.D. laboratory experienceConception and development of novel amplification methods, including immuno-PCR and related techniques, for the sensitive detection or quantification of multimodal biomarkers in clinical specimensExperience writing or contributing to research grant applications (NIH or other)Experience organizing, analyzing, and/or visualizing molecular datasets using Python or REffective management of one or more junior scientistsExperience with capillary electrophoresis instrumentation or nanopore-based sequencing would be a plus About Asuragen  Asuragen is a molecular diagnostics company that is using genomics to drive better patient management through best-in-class clinical testing solutions. The Company enlists a breadth of technologies and talent to discover, develop and commercialize diagnostic products and services with efficiency and flexibility for internal projects and partners in biotechnology and pharmaceutics. Asuragen is located in Austin, Texas, which is consistently ranked in the top 10 of “best of” lists of US cities and offers a superior lifestyle along with top-notch technology, educational, and business benefits. The Company provides a competitive salary, medical, dental, disability and life insurance, a 401(k) plan with company matching, an employee bonus plan, and a tuition reimbursement plan."}