{"jobID": "2764029111", "jobLocation": "Rolling_Meadows_IL", "jobTitle": "Data Analytics Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.ajg.com", "Headquarters": "Rolling Meadows, IL", "Size": "10000+ employees", "Founded": " 1927", "Type": " Company - Public (AJG) ", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Aon, Marsh & McLennan Companies, Willis Towers Watson"}, "estimatedSalary": "77000", "jobDescription": "Arthur J. Gallagher & Co., one of the world's largest insurance brokers, provides a full range of retail and wholesale property/casualty (P/C) brokerage and alternative risk transfer services globally, as well as employee benefit brokerage, consulting, and actuarial services in the United States. We also offer claims and information management, risk control consulting, and appraisal services to clients around the world.  Arthur J. Gallagher Risk Management Services, Inc. is the U.S. retail property/casualty brokerage division of Arthur J. Gallagher & Co. Our advisors specialize by industry and coverage types—developing solutions uniquely tailored to individual client requirements. We deliver a full range of insurance and risk management products and services, including traditional and loss-sensitive coverages, captives, alternative risk solutions, and financial products to clients around the world. For additional information, please refer to Career Opportunities with Arthur J. Gallagher & Co.Position Summary:The Business Intelligence Specialist designs and develops solutions to advance business performance.Essential Duties and Responsibilities:Researches, analyzes, and reports information from a variety of sources, including vendor databases, primary sources, web site sources, and printEvaluates sources of information for relevance, dependability, accuracy and overall cost effectiveness. Interprets the impact of events and macro trends on the industryPerforms industry competitor analyses that respond to the needs of the organization to produce strategic conclusionsPerforms competitive assessments using analytical toolsMay take on several components of a project or a complex component of a projectTroubleshoots basic problems and recommends appropriate actionsRequired:Bachelor's degree5 or more years related professional work experience required Desired: Strong analytical skillsU.S. Eligibility Requirements:"}