{"jobID": "2836025231", "jobLocation": "Warren_NJ", "jobTitle": "Data Analyst, Senior", "companyRating": "3.2", "companyInfo": {"Website": "www.fiserv.com", "Headquarters": "Brookfield, WI", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (FISV) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " FIS, Jack Henry & Associates, NCR"}, "estimatedSalary": "82000", "jobDescription": " Position DescriptionWHAT DOES A GREAT DATA ANALYST IV DO?  You will play an integral part in ensuring executive and leadership reporting provides a true and complete picture of how the business unit is performing across multiple operational quality and software development metrics. This position will work with various functional areas of Investment Services and varying levels of leadership. Once in the role fully, duties will help analyze and report metrics that allow leaders to assess how well Investment Services is serving their clients.  AS A DATA ANALYST, YOU CAN LOOK FORWARD TO:  Acquiring data from primary or secondary data sources, cleaning and normalizing the data, and maintaining the databases that form the foundation of the operational quality and software development metrics. Collaborating with various functional areas to document operational quality issues and record them objectively and consistently. Monitoring the data quality and call out or resolve issues as necessary. Analyzing the results to identify trends and help develop actionable plans that drive improvement of key metrics. Identifying system owners, data stewards and key partners for process, establish relationships between groups to ensure better process outcomes. Helping to define new data collection and analysis processes required as metric requirements change. You will perform advanced ad hoc analysis, using MS Excel, MS Access, or SQL, to resolve results, data accuracy, and relationships between different data sets. Creating monthly CIO MS PowerPoint slides for the business unit Presidents operation review meeting.  BASIC QUALIFICATIONS FOR CONSIDERATION: Bachelors Degree in Statistics, Economics, Accounting, Business, or related field.  - 5 years in MS Excel, MS Access  - 5 years in Data Analysis & Reporting, Data Management, Business Intelligence  - Ability to analyze large datasets.  - Strong verbal and written interpersonal skills.  - An analytical mind and inclination for problem-solving.  - Attention to detail.  - Ability to travel up to 10%  PREFERRED QUALIFICATIONS FOR CONSIDERATION:MS SQL Server and/or SSRS  - Project Portfolio Management software experience.  WHAT WE DO: Fiserv Investment Services is a division of Fiserv, (NASD: FISV). We make it easy to invest and manage money. For over 30 years, we have served the wealth management industry by providing solutions that connect investment firms with their investors.  There are over 4 million investment portfolios and $1.7 trillion in assets managed on our unified wealth platform. The platform includes configurable modules for planning, proposal generation, model management, trading, reporting and analytics. Our Wealth Management Network seamlessly connects over 350 managers, broker dealers, banks and advisors to help them handle their investments.  Fiserv is an Equal Opportunity Employer/Disability/Vet.  Fiserv is an Equal Opportunity Employer/Disability/Vet. Visit http://www.careers.fiserv.com/eeo for more information."}