{"jobID": "2835262293", "jobLocation": "Round_Rock_TX", "jobTitle": "Artificial Intelligence/Machine Learning/Data Science", "companyRating": "4.0", "companyInfo": {"Website": "www.o2inc.net", "Headquarters": "Irvine, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "Sr. Consultant - Artificial Intelligence/Machine Learning/Data Science As AI/ML/DS lead, you work closely with development teams to ensure accurate integration of artificial intelligence/machine learning models into firm platforms.You will contribute to application testing and provide customer focus to produce high quality products globally. This role reports to the IT Sr. Manager.Role Responsibilities - Work as an independent yet integral member of a team to develop innovative and creative AI / ML /DS solutions for Dell Applications, specifically related to EIS Organization.Develop and maintain high quality Python code under Linux for general purpose PCs. Test and debug software on multiple technologies.Plan and execute complex and challenging technical projects - Possess strong interpersonal skills and consistently demonstrate ability to work in a team environment and with cross-functional global teams,Maintain state-of-the-art technical expertise in artificial intelligence, machine learning and software programming. Generate intellectual property - Expert-level knowledge in learning algorithms such as inverse reinforcement learning, deep reinforcement learning and probabilistic inference for decision support systems.Knowledge and hands-on expertise in deep neural network topologies such as convolutional nets, recurrent nets, RBMs, causal reasoning, probabilistic programming.Mathematically minded with experience in manipulating high-volume, high-dimensionality data from varying sources to highlight patterns, anomalies, relationships and trends with machine learning techniques.Develop requirements and evaluation methods for artificial intelligence technologies and benchmark vendor technologies - Experience in algorithm development, prototype system development and prototype software implementation on hardware platforms.Aid in the design, build and implementation of AI solutions for our proof of concepts and experiments, including working closely with external vendors to implement AI solutions.Provide expert peer review for new AI concepts, partners and vendors - Help shape and drive our AI strategic thinking and thought leadership - Build and develop our internal and external networks with AI experts, including AI vendors and academia,Promote AI across the organization - Educate our people in AI-related topics and broaden our AI knowledge - Effective verbal/written communication along with strong interpersonal skills. Team player.This position is responsible for timely and accurate completion of other tasks as defined by the Manager. Requirements - Bachelor of Science in Information Technology or equivalent with 10+ years of overall IT experience - 2-5 years AI work experience,Experience in designing, building or implementing AI business solutions is essential,This role is all about delivering practical AI pilots in a business environment and is less about developing the theory,2+ years of experience with Machine Learning, Statistical Models, and Natural Language Processing - Experience with Python, TensorFlow, Keras, StackStorm, other AI/ML Frameworks.Solid understanding of Data Structures, Algorithms & Object-Oriented design concepts - Excellent academic qualifications is essential with a strong preference for a post graduate qualificationprovided by Dice Artificial Intelligence/Machine Learning/Data Science,AI/ML/DS lead"}