{"jobID": "2670656340", "jobLocation": "Emeryville_CA", "jobTitle": "Data Scientist ~ Scientific Computing", "companyRating": "4.0", "companyInfo": {"Website": "www.amyris.com", "Headquarters": "Emeryville, CA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Public (AMRS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "158000", "jobDescription": "Data Scientist 2, Scientific Computing Amyris has developed a high-throughput genetic engineering platform for designing and building custom microbes to serve as living factories. Using an industrial scale fermentation process, our microbes convert cheap sugars into a wide variety of high value target molecules, including medicines, fuels, and commodity chemicals. While providing low cost, high quality malaria medication and renewable substitutes for fuels and chemicals, our end products directly impact millions of lives while reducing humanity's carbon footprint. We are pragmatic idealists seeking a profitable way to make the world a better place.  Within Amyris R&D;, we are searching for a highly energetic, curious, and self-motivated scientist with a strong background in statistics, computing and biology to join our Scientific Computing team. Research at Amyris is a highly multidisciplinary effort that needs brilliant contributions from life sciences and engineering disciplines in order to take projects from concept to market. From hacking directly on DNA in the lab to full scale factory production, every aspect of our work is facilitated and accelerated by quantitative science and software & hardware automation. Scientific Computing helps bench scientists design better microbial strains using genotype specification languages and high-level functional ontologies of parts and pathways; and helps model & learn from high-throughput, multivariate phenotype, NGS, and ‘omics data to rapidly drive the design-build-test-learn cycle. Key ResponsibilitiesIteratively develop computational algorithms, analysis and visualization tools to meet evolving scientific needs and to aid rapid data-driven decision making. Data types include: genotype (NGS), phenotype (metabolomics, proteomics, GC/MS, spectroscopy, fermentation), material flowBuild version-controlled, computable workflows to analyze rich, high-throughput phenotype dataInteract closely with biology, analytical chemistry, and fermentation scientistsCollaborate with automation engineers and software developers of in-house enterprise systems to mine experimental data and metadataRequired QualificationsDegree in quantitative discipline such as computer science, mathematics, computational biology, electrical engineering, bioengineering. Ph.D. plus 2-4 years experience, or M.S. plus 8 years experience. Industry experience strongly preferred.At least three years experience in analyzing & visualizing large scientific datasets representing biological & chemical phenotypesIndustrial programming experience, i.e. having written or maintained large codebase using software best practices (e.g. unit tests) and distributed version controlExpert coder in either Python or ROutstanding communication and interpersonal skillsAbility to thrive in a fast-paced yet intellectually rigorous environmentCreativity, independent thinking, and passionExperience with the following a plusBackground in mass spectrometry informatics, HTS, spectrophotometry, or industrial fermentationExperience in a microbiology or synthetic biology setting Amyris, a leader in industrial synthetic biology, uses its innovative bioscience solutions to achieve renewable products by converting plant sugars into hydrocarbon molecules. Amyris’ molecules are used in wide range of specialty & performance chemicals, flavors & fragrances and in applications ranging from cosmetics to biofuels. Learn more at www.amyris.com.  As a VEVRAA Federal Contractor, Amyris is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. Amyris complies with applicable state and local laws governing nondiscrimination in employment.  For a full list of our current openings, please visit our website . "}