{"jobID": "2823491382", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analytics Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.gotinder.com", "Headquarters": "West Hollywood, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "119000", "jobDescription": "Tinder brings people together. With tens of millions of users and a presence in every country on earth, our reach is expansive and rapidly growing. Tinders Business Analytics Team is looking for a Data Analytics Manager to join our growing team.  The analytics team owns the decisions made with our data. We develop a deep understanding of both the business and its data to provide recommendations and proposals for prioritizing initiatives, product launches, and evaluating company performance. We establish close working relationships with teams across the company - including Product, Marketing, Engineering and Finance - and partner with them to design A/B tests, evaluate features, track KPIs, and conduct research on user behavior.  We're looking for a hands on people manager who is passionate about serving as a critical partner to the business and leading, mentoring, and developing a team of analysts. The ideal manager is both a player and a coach, comfortable developing data-driven insights via ad hoc analyses, presentations, and automated reports and dashboards but also managing other analysts on how to overcome roadblocks in their on analyses and organize their efforts for success. This role will require extensive experience with SQL, data wrangling, and statistics. Key Roles and Responsibilities:Partner with stakeholders across the business to develop a thorough understanding of their business needs and design solutions to empower them with dataLead, develop and grow a team of high performing data analystsBalance priorities as an individual contributor on cross-functional teams while also maintaining responsibilities of organizing and assisting other analysts to maximize their contributionsMaster and own the analytical understanding of customer behavior and business performance across numerous aspects of our productFind the story in the data and communicate insights and opportunities with executives and other internal teamsSupport Tinders data needs by using SQL to query Amazon Redshift (and soon Apache Spark)Skills Required:7+ years of analytics experienceMinimum of 3+ years of experience leading and managing high performing teamsDemonstrated experience being the analytics leader for a product or feature from start to finish, across multiple sprints of iterative test and learn cyclesAbility to think objectively and interpret meaningful themes from quantitative and qualitative dataAbility to build constructive and effective relationships with a broad and diverse group of business partnersProactive and independent leader with practical business sense and bias for actionProficiency with SQL requiredScripting skills, preferably in Python. Strong Python/NumPy/PANDAS skills a plusKnowledge of statistics, specifically experimental design and analysisProficiency in Microsoft Excel and Microsoft PowerPointFamiliarity with common KPIs, metrics, and growth experimentsExperience with consumer mobile products preferredAs part of our team, youll enjoy:The hustle of a startup with the impact of a global businessTremendous opportunity to solve some of the industrys most exciting problemsWorking with an extraordinary team of smart, creative, fun and highly motivated peopleComprehensive health coverage, competitive salary, 401(k) match and meaningful equityUnlimited vacation and flexible working hoursDaily catered lunches, an endless supply of refreshments, basketball court, fitness classes and social eventsModern, uplifting work environment in an ideal location"}