{"jobID": "2817669791", "jobLocation": "Washington_DC", "jobTitle": "Data Reporting Analyst Online Reporting System", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "52000", "jobDescription": " Job Location US-DC  Job ID 9395  Job Location United States  Category Project Management  Overview  The American Institutes for Research (AIR) is a leading professional services firm with a growing Reporting Team. We are pioneers in the design and building of online reports using innovative, cutting-edge technology that are based on powerful, behind-the-scenes analysis of student test score data, making a real impact for teachers and students across the country.  We are currently seeking a Data Reporting Analyst - Online Reporting System to join our Score Reporting team in the Washington, DC (Georgetown) office. Responsibilities The Data Reporting Analyst - Online Reporting System will have the following responsibilities:  Reporting/Data Analysis Responsible for gathering online reporting specifications across multiple clientsMaintains and manages existing reporting and data processesImplements processes and procedures to improve the quality check of data in the online reporting systemsUses documented logic to query the data for anomalies or inconsistenciesConducts rigorous quality assurance checks on systems data integration for all online reports across multiple clientsProven ability to understand technical concepts, including data relationships and software configuration. Project Management Works with program managers, designers, and software project managers to implement updates and enhancements to the online reporting systemDevelops and manages schedules and key milestones for multiple reporting projectsWorks on multiple projects simultaneously, with an inherent ability to work well under tight timelines, and have strong problem-solving capabilities. Communications Leads all client communications regarding technical data requirements, reporting specifications and issues/resolutionsLeads and facilitates client meetings to gather reporting specifications for online reportsTrains end users to access and understand online reporting toolsProvides training and technical guidance to less senior staff, where appropriate, and serving as point-of-contact for problem resolution Building Relationships Builds credibility with others and encourages strong working relationships.Creates a work environment in which others feel comfortable sharing thoughts and feedback.Monitors client's satisfaction and takes appropriate action.Resolves issues and concerns raised by clients or internal teams. Data Design Thinks strategically about uses of data and how data use interacts with data designVisualizes data creatively in a variety of formats to provide relevant insights to families, schools and districtsWorks with senior psychometricians and clients to establish new measures and visual displays to communicate the measuresQualifications Bachelor's degree in a Statistics, Economics, Educational Measurement, or a related field required and 5-8 years of project and client management experience Master's degree in Business Management or Educational Measurement and 3-5 years of project and client management experience a plusExperience working with online systems is preferred.Experience with programming, data analysis or data reporting in any industry is desired.Must have the ability to work with a matrix team that includes graphic project managers, designers, developers and software testers. Must have strong knowledge of Excel.Must have excellent client communication skills.LI-DG1 Options"}