{"jobID": "2679888442", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "150000", "jobDescription": " We are now looking for a Research Scientist  NVIDIA is hiring Research Scientists for its Deep Learning Compiler team. Academic and commercial groups around the world are using GPUs to power a revolution in deep learning, enabling breakthroughs in problems from image classification to speech recognition to natural language processing and artificial intelligence. Join the team which is developing advanced technology for the software which will be used by the entire deep learning community. What you'll be doing: In this role, you will be doing research on problems of program synthesis and optimizations for computational graphs for NVIDIA GPUs. The goal of this work will be to advance the state of the art in program synthesis to the problem of data parallel GPU code. In particular the problems of interest will be drawn from computational graphs as encountered in inference and training workloads. You will develop, both, online and offline techniques for use in the production compiler NVIDIA is developing. You will deploy your research to automatically produce high performance code, often, matching and exceeding the abilities of GPU architects in new ways to generate high performance libraries  You will also have the opportunity to publish your research in peer reviewed conferences and journals. As part of you role you will also be responsible for technology transfer to production groups. What we need to see:Masters or PhD or equivalent experience in Computer Science, Computer Engineering, or related field.4 years of relevant work or research experience in compiler optimizations, synthesis, super optimization and computer architecture.Be able to work independently, define project goals and scope, and lead your own research and development effortsExcellent programming and software design skills, including debugging, performance analysis, and test design.Experience with the following technologies is a huge plus: deep learning models and algorithms, and deep learning framework design.Strong communication skills are required along with the ability to work in a dynamic product oriented team. A history of mentoring junior engineers and interns is a bonus.Ways to stand out from the crowd:Knowledge of CPU and/or GPU architecture. CUDA or OpenCL programming experience desired but not required NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people in the world working for us. If you're creative and autonomous, we want to hear from you!  NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.#deeplearning"}