{"jobID": "2827325123", "jobLocation": "Princeton_NJ", "jobTitle": "Principal Scientist, Translational Bioinformatics, Head of Immunoscience and Small Molecule Immuno-o", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " We are seeking an experienced bioinformatician to lead our Translational Bioinformatics team responsible for Immunoscience and small molecule Immuno-Oncology (IO). This team of approximately 5 Ph.D. level bioinformaticians is responsible for advancing Bristol-Myers Squibb's industry leading Immunoscience and small molecule IO pipelines through the strategic application of cutting edge bioinformatics approaches. The computational scientists in this group analyze both pre-clinical and clinical data sets including RNA-Seq, Exome and Whole Genome Sequencing, single cell sequencing, and high throughput proteomics in order to nominate novel drug targets, enable patient enrichment strategies, and prioritize indications. The group interacts with and influences all aspects of drug discovery and development at BMS.  The successful candidate will provide strategic and technical leadership to build a world-class bioinformatics team. They will work closely with key stakeholders across discovery and clinical development to identify the highest priority scientific questions and devise experiments and strategies to address them. QualificationsPh.D. in bioinformatics, biology, genetics, biochemistry, or a similar discipline7 or more years experience in the pharmaceutical or biotech industriesPrevious line management experience preferredStrong strategic and technical leadership skillsSolid understanding of ImmunologyExcellent written and oral communication skills, including an ability to converse with computational scientists, experimentalists, and cliniciansFamiliarity with clinical trial design, clinical trial processes, and clinical trial data analysisExtensive experience analyzing and interpreting NGS dataHands-on experience with relevant public domain data sets including 1KG, Exac, GnomAD, and TCGAFluency with Linux based high performance compute environments, R/Bioconductor, and reproducible research practicesResponsibilitiesPartner with key stakeholders across the company to set and implement bioinformatics strategyRecruit and develop talentSet priorities, balance team workloadCommunicate effectively to build support for work and align with organization"}