{"jobID": "2703027204", "jobLocation": "Newark_NJ", "jobTitle": "VP, Data Analytics", "companyRating": null, "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": null, "jobDescription": " Prudential Financial is seeking an enthusiastic Data Analytics leader, to help drive its centralized advanced data analytics capability to the next level. We are looking for someone who understands data modeling techniques and has tremendous expertise in simplifying the complex. This role will require a unique combination of skills: strong business acumen with a history of using data to solve business problems, deep analytical skills, ability to drive and own business relationships, a strategic and technical mindset as well as the ability to lead and grow analytical teams. The successful candidate will have a passion for data, technology, building out new capabilities, and creating a fun and inquisitive environment.  The right person will lead teams of data scientists, who are working diligently on problems that can impact underwriting, product pricing, need based solutions targeting and risk management within our workplace businesses of Retirement and Group Insurance. Responsibilities for this position include building the framework, sourcing, leading, and presenting forward-thinking, high-impact Data Analytics projects focused on key strategic initiatives for Prudential and its customer segments. You will lead teams in an exciting and engaging environment, where you will be encouraged to expand your skills, test your creative boundaries, share new ideas, and most importantly – have fun.  This position reports to the Head of Data Analytics in the Customer Office. Our team merges the entrepreneurial spirit of a start-up with the stability of one of the world’s most established financial services companies. We operate in a fast-paced environment and need someone who takes initiative and is excited about being part of a cultural and business transformation. ResponsibilitiesLead teams from project scoping to final solution in a cross-business capability dedicated for using advanced data analytics to solve complex business problems.Develop and maintain relationships with senior executives in the business lines. Build in-depth knowledge of the business success drivers, industry trends, regulatory issues and competitive marketplace to develop value added business solutions.Drive pragmatic approaches to solving key complex business problems through data analysis, predictive modeling and machine learning techniques. Ability to bring the right data technique to solve the problem in an explainable manner to the business.Lead verbal and written communications with colleagues and business partners at all levels to clearly articulate the findings of analytical models and assist in driving solutions.Advise on implementation of advanced data analytics models with effective and practical short- and long-term actionable solutions within the businesses.Grow the data and technical environment at Prudential by bringing new technologies and techniques to create efficient process around data extraction, aggregation and analytics.Contribute Prudential’s cultural transformation from a product-centric to a customer-centric orientation, especially by improving the data and analytics environment overall.Initiate and manage strategic external partnerships to supplement internal advanced data analytics capabilities, as desired.Advanced degree in Mathematics, Statistics, Engineering, Computer Science, or a quantitative discipline, plus a minimum of 8-10 years of relevant work experience in data analytics, market research, customer knowledge, or consulting.Superior communication and persuasion skills; talent for storytelling, visualization and creating insights from data to deliver practical recommendations for business action.Consultative nature, with a proven track record of using data to provide actionable business results.Proven relationship building and collaboration skills; ability to influence and drive outcomes in large, matrixed and complex organizations.Experience managing teams of data scientist and analytical professionals.Accustomed to managing multiple teams on different projects. Experience managing projects, budgets and schedules to successful completion.Prior experience with building custom statistical models, analyzing unstructured data, and/or machine learning is highly desirable.Entrepreneurial spirit, persistence, and resilience; comfort with and ability to thrive on and drive change while navigating ambiguity.Financial services industry experience a plus."}