{"jobID": "2831111730", "jobLocation": "Mattawan_MI", "jobTitle": "Associate Scientist - Study Directors - DMPK", "companyRating": null, "companyInfo": {"Website": "www.criver.com", "Headquarters": "Wilmington, MA", "Size": "5001 to 10000 employees", "Founded": " 1947", "Type": " Company - Public (CRL) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "For 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we’ll help you build a career that you can feel passionate about.Job Summary We are seeking an Associate Scientist for our Study Director - DMPK Team located in Mattawan, MI. The  Associate Scientist in Laboratory Sciences is responsible for developing and validating methods to quantify chemical entities according to applicable Standard Operating Procedures (SOPs) and/or GxP regulations. The individual in this role is proficient in the use of instrumentation and laboratory techniques and in the execution of method development and validation procedures. An Associate Scientist is expected to work independently, participate in process improvement initiatives, and may function as a Principal Investigator or Study Director.The following are the minimum requirements related to the Associate Scientist position.PhD in relevant field and 0-2 years of relevant experience; orMS/BS/BA in relevant field and 5-7 years of relevant experience; orHS/GED/Associates and 10+ years of relevant experience.Proficient using laboratory software applications (i.e., LIMS and data acquisition software).Working knowledge of GxPs and industry guidance documents.Ability to work extended hours beyond normal work schedule to include, but not limited to, evenings, weekends, extended shifts and/or extra shifts, sometimes on short notice.Familiarity with Microsoft Office Suite.Ability to work under specific time constraintsAbout MPI Research, a Charles River CompanyMPI Research is a premier non-clinical contract research organization (CRO) providing comprehensive testing services to biopharmaceutical and medical device companies worldwide. About Safety AssessmentCharles River is committed to helping our partners expedite their preclinical drug development with exceptional safety assessment services, state-of-the-art facilities and expert regulatory guidance. From individual specialty toxicology and IND enabling studies to tailored packages and total laboratory support, our deeply experienced team can design and execute programs that anticipate challenges and avoid roadblocks for a smooth, efficient journey to market. Each year approximately 120 investigational new drug (IND) programs are conducted in our Safety Assessment facilities.About Charles RiverCharles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients’ clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.With over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client’s unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.At Charles River, we are passionate about our role in improving the quality of people’s lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.For more information, please visit www.criver.com.Charles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet"}