{"jobID": "2831927024", "jobLocation": "Houston_TX", "jobTitle": "Production Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.tgs.com.ar", "Headquarters": "Ciudad de Buenos Aires, Argentina", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Public (TGS) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " TGS provides multi-client geoscience data to oil and gas Exploration and Production companies worldwide. In addition to extensive global geophysical and geological data libraries that include multi-client seismic data, magnetic and gravity data, digital well logs, production data and directional surveys, TGS also offers advanced processing and imaging services, interpretation products, permanent reservoir monitoring and data integration solutions. Job Summary:The Production Data Analyst will process & quality control all data, research customer inquiries, proactively review the data to identify areas for improvement or infill, load portions of new data into their respective models. Focus will be on supporting the Production Data and Scout Card data products and processes. Duties and Responsibilities: Monitor status of automated data parsing and loading processes for Production Data and Scout Card data streams.Work with operational and development staff to review and resolve process failures.Review and QA new data not passing through the automated processes.Utilize appropriate applications, tools or methods associated with support of Production Data and Scout Card data (e.g. Longbow, Production Data QA Tool, basic SQL queries, etc.).Act as a subject matter expert on production data for TGS.Provide TGS management, operations and development with direction and strategy for supporting various end-user applications and data file export formats for both products.Document and monitor requests for data and application enhancements.Proactively review data for areas requiring improvement, change, or infill.Monitor and track data reporting details for all data sources.Perform other duties as related to the Production Data and Scout Card data products.Ensure clear, concise, and timely communications regarding activities, progress, and critical issues.Take responsibility for your own safety and the safety of other employees, and comply with all instructions given regarding health, safety and the protection of the environment.Ensure the correct use of safety devices and protective equipment as required and report any hazards, accidents or injuries to your immediate supervisor.This position will report to the Supervisor, Production Data and will be expected to liaise with other internal department staff and external clients as needed.Job Requirements (Education and Experience): Bachelor of Science degree in related field, or minimum 5 years related industry experience preferred.Proven analytical skills.Basic SQL query skills with solid database conceptual knowledge preferred.Proficient in MS Office Word, Excel, PowerPoint, Visio, SSMS.Qualifications (Knowledge, Skills and Abilities): Excellent time management, organizational, and communication skills.Displays willingness to make decisions, exhibit sound and accurate judgment, support and explain reasoning for decisions, include appropriate people in decision-making process, make timely decisions.Demonstrates a commitment to team goals through attitude, contribution and cooperation, and sharing of info.Ability to develop innovative approaches and ideas to achieve goals, solve problems, and improve performance. Receptive to new ideas, methods, technologies.Pursues training and development, strives to continuously build knowledge, skills and abilities.Demonstrated self-starter with a drive for results"}