{"jobID": "2613114711", "jobLocation": "Chicago_IL", "jobTitle": "Arity - Senior Data Analytics Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": "114000", "jobDescription": "Where good people build rewarding careers. Think that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.Job DescriptionArity Arity is a new technology company that uses advanced predictive analytics to help partners evaluate risk and make sense of everyday experiences. Our proprietary algorithms analyze billions of data points, distilling the flood of information into simple, actionable insights. Chief among these is the Arity Driving Score, which models billions of miles of driving and claims data to assess risk, gauging each driver’s likelihood of an event.  Founded by The Allstate Corporation, an organization synonymous with protection and preparation, Arity is born from a long-standing commitment to deep customer understanding and future-focused innovation. Fueled by the curiosity of a startup, our expertise begins with connected car, providing applied insights that meet insurer and transportation/mobility company needs and enhance driver safety, connectivity and value.  Don’t miss this opportunity to join a team where your innovative thinking and technology skills can improve the safety of those on the road and further enhance the car-ownership experience. The Team Data science incorporates techniques across many disciplines – including mathematics/statistics, computer programming, data engineering and ETL, software development, and high performance computing – with traditional business expertise with the goal of extracting meaning from data to optimize future business decisions. Individuals in this field should be fluent in several of these disciplines and sufficiently proficient in others to effectively design, build, and deliver end to end analytics products. Arity Data Science and Analytics is responsible for aligning with and contributing to company-wide objectives by identifying new product opportunities and enhancing current capabilities.The Role Arity Data Analytics Engineers are responsible for working as members of a product team to design and scale out business solutions and/or research data files using appropriate ETL tools and software to provide documented, trusted and actionable results or data. This role will execute new ETL work tracks from inception and prototyping to fully developed solutions. The role is responsible for data manipulation, providing best practices, data interpretation and training on products or research data. This person works directly with data scientists, developers, and product managers on needs and tactical solutions. This is a highly dynamic position that requires a high degree of flexibility, intellectual curiosity, and the ability to rapidly adapt to changing business needs, new technologies, and data sources. This role requires a high degree of business acumen in order to provide the best technical solutions. This person should establish themselves as a department subject matter expert on research solutions to support corporate goals. Key ResponsibilitiesProvide support on requirement development and assist in documenting requirements.Develop analytic data sources for use by data scientists, research, and business users.Connect raw data to business meaning/use and understand data generation and flows in context of business impact. Communicate anomalies and work towards resolution.Execute rapid development of new data and analytic work tracks with fast iteration over quick sprints.Break down business problems into solvable components by assessing the requirements and/or business implications to arrive at recommended solutions.Develop and deliver the data infrastructure required to support needs of predictive modeling and analytics.Oversee the development of new concepts and proof of concept designs of moderate complexity.Ensure prototypes meet the organization standards to allow transfer to production, if applicable.Promote using multidisciplinary approach to solving problems combining technical expertise with analytics and business knowledge.Work with data scientists on cross functional teams; requiring subject matter knowledge in the business as well as advanced analytics.Leverage fluency in multiple parallel processing/programming and software/programming languages such as SQL, PL/SQL, Spark, Python, and Scala.Promote an environment that supports innovation and process improvement.Mentor other team members in a business technical environment.Participate in the process of interviewing and hiring appropriate technical resources.Job QualificationsBachelor’s and/or Master’s degree in a field such as Computer Science, Mathematics, Data Architecture, or equivalent skillsStrong development knowledge and experience in key languages and environments such as Python, SQL, PL/SQL, and noSQL and relational databases.Strong development knowledge and experience in big data stack, such as Spark and Scala.Advanced data sourcing and content management skills.Experience in interviewing and hiring technical resources.Experience in time and task management.Demonstrates sufficient capability to learn new technologies and follow industry trends.Strong attention to detail.Intermediate written and verbal communication skills including the ability to effectively collaborate with multi-disciplinary groups and all organizational levelsThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen. Good Work. Good Life. Good Hands®. As a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video. Allstate generally does not sponsor individuals for employment-based visas for thisposition. Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.  For jobs in San Francisco, please see the notice regarding the San Francisco Fair Chance Ordinance.  For jobs in Los Angeles, please seethe notice regarding the Los Angeles Ordinance.  It is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era. ABC"}