{"jobID": "2819741668", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Engineer - Strategic Projects", "companyRating": "4.5", "companyInfo": {"Website": "www.lucidworks.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Elastic, FAST, Endeca Technologies"}, "estimatedSalary": "170000", "jobDescription": " Data Engineer – Strategic ProjectsDo you want to work with a distributed, eclectic team of software developers, data scientists and engineers from the beginning of the ideation phase of product research and development, through to trying out these ideas on customer data, all the way back into our core product itself?  As a Data Engineer in the Office of the CTO, your role requires some hands-on applied data science/data engineering with real-world data, some software development of extensions of Lucidworks product line, and some end-to-end demos and proof-of-concepts to show off new ideas for data-driven end products.  This role in particular will involve exploring new technologies which Lucidworks may not fully utilize yet: a connector to a new database or NoSQL engine or distributed filesystem, or an RPC connection to an external Voice-to-Text or Image Search system, or validating the idea that running Lucidworks product suite on top of an alternative cloud platform will work as desired.  The product lifecycle you’ll participate in is probably a little different than traditional tech companies: you will occasionally work directly with customers, building individualized extensions to our systems as essentially part of a technical product marketing effort, then working to generalize these solutions to work in a broader environment; then, for some of these projects, you will work directly with the Product Engineering organization to productionalize your work, helping shepherd it into the final product release.  You have at least 2-4 years of software industry experience working with Service Oriented Architecture handling data driven products such as Search, Recommender Systems, and/or Machine Learning as a Service. Personality Profile:  – Curious, natural problem solver, great listener, great communicator.  – Startup Energy: driven, resourceful, creative, passionate, self-motivated.  – Team Player: friendly, helpful, engaging, dependable, company focused, eager to collaborate.  – Confidence without attitude. Knowledge of and experience with the following is required: – Java, Scala and/or other JVM languages  – RDBMS, JDBC, SQL  – ETL pipelines and data cleaning  – Service Oriented Architectures (HTTP, REST, RPC, etc)  – Search engines like Lucene/Solr or Elasticsearch Nice-to-haves include experience with: – Distributed compute systems like Spark (including Spark ML) or Map-Reduce  – Applied Machine Learning (classification, clustering, recommenders, basic natural language processing), at a level of usage and understanding, if not algorithm implementation  – Text relevance (for search, NLP, and/or classification or recommenders)  – Writing/debugging/modifying Solr plugins  – Familiarity with production deployments on tools like Kubernetes and Docker  – Working with / consulting for customers to improve their data products  – Javascript (esp. Angular.js)  – Python (including numpy, pandas, sklearn, etc)  Lucidworks is an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  U.S.-based candidates only for this role, but we are a geographically distributed team, with team-members working from home (and occasionally co-working spaces) in the Seattle, Raleigh-Durham, and metro-D.C. areas currently, so you should be West Coast (Seattle or SF preferred), Raleigh/Durham, or Washington DC based.  If this sounds like a fit for you, we’d love to hear from you: careers@lucidworks.com"}