{"jobID": "2762251775", "jobLocation": "Berkeley_CA", "jobTitle": "Senior Technical Account Manager", "companyRating": "4.5", "companyInfo": {"Website": "www.endsight.net", "Headquarters": "Berkeley, CA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " We are looking for Senior IT Consultants, Engineers, Systems Administrators, and IT Architects who are ready to take the next step in their career, but don’t want to be tied down to a single network. Endsight Technical Account Managers act as the IT Manager/Director for approximately 35 assigned accounts, representing roughly 1,400 users. They are responsible for overall IT strategy, network design, lifecycle management, budget negotiation, and general account management. Make no mistake, an IT career with a Managed Service Provider is a challenging thing! It’s fast paced, yet you’ll have tremendous opportunity for experience with the newest platforms and environments. At all times you’ll be supported by amazing teammates who want you to succeed and thrive. We know our most important assets are PEOPLE like you, and we’re looking forward to having you meet our team! These are the skills applicants should have or be looking to refine.  SENIOR TECHNICAL ACCOUNT MANAGER JOB REQUIREMENTS: 5+ years of experience in Information Technologystrong communicationaccount management skills  Senior Technical Account Manager Responsibilities:  Technology/Engineering · Preparation, delivery, and management of client IT strategy  · Regular review of client support incidents, alerts, and network performance  · Design networks to meet client business requirements, while maintaining Endsight standards · Maintain current knowledge in: o Microsoft Server operating systems  o Windows and Apple client operating systems  o Hardware infrastructure  o Virtualization Technologies  o Networking  o Security  o Disaster recovery and business continuity  Account Management  · Perform regular analysis of client efficiency and develop suitable action plans to address concerns  · Review and approve client invoices for billing  · Resolve client issues with service  · Develop client relationships  · Coordinate rollout of Endsight Services  Business Acumen  · Communicate/consult with C level executives  · Understand how IT impacts client business  · Establish business justification for IT needs  · Negotiate budgets  Our Culture  We strive towards improving the quality of EVERYTHING we touch.  We always have each other’s back and pursue an environment with a simple mandate: Be cool to each other.  We pursue learning and growth and are unashamed to take pride in our work. We believe that connecting emotionally to our work product is essential to a fulfilling career.  We take the long view with clients, employees, and all aspects of our business.  No matter who we are, we are always authentic!  We believe that courage has a place in the work environment and together aspire to “be courageous”. We believe that we can accomplish more than we ever realize by being willing to act in the face of our personal fears.  We hold each other accountable and we own our share when things go wrong.  We bring positive energy.  Life at Endsight is about finding fulfillment for ourselves by pursing results for others. We work for our clients and our colleagues with an ambition to pursue “excellent customer experiences at EVERY opportunity”. Our vision is to be a lot like a great university. A place where employees come, make life long connections with other incredible people, and go through intense personal and professional growth; a place where the best people in the industry come to be treated with respect and are given the opportunity to do meaningful work."}