{"jobID": "2699812143", "jobLocation": "Los_Angeles_CA", "jobTitle": "Microsoft Analytics Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "85000", "jobDescription": "Job Description IBM Global Business Services (GBS) is a team of business, strategy and technology consultants enabling enterprises to make smarter decisions and providing unparalleled client and consumer experiences via Cognitive data analytics, cloud technology and mobile app development. With global reach, outcome-focused methodologies and deep industry expertise, IBM GBS empowers clients to digitally reinvent their business and get the competitive edge in the cognitive era in over 170 countries.  IBM is a leader in this global transformation, and there is no better place to launch or further your career. World-class learning opportunities, mentoring and a flexible work environment  you will find a wealth of opportunities within IBM to create the career youve always imagined.  IBM GBS Enterprise Applications is seeking keen-minded Microsoft Analytics Consulting Specialists. In this job role, you'll use your expertise to provide best-in-class analytics based business solutions to help clients achieve their business objectives. Roles and responsibilities include participating in all aspects of the implementation. This role will have emphasis on client facing skills including defining and analyzing business requirements and working with customers to educate on analytics in business. Successful candidates will have experience with data mining, data modeling, process modeling, and a keen insight for translating requirements into a robust design enabling the configuring and customizing of Microsoft based Analytics and Cognitive solutions.Successful candidates will demonstrate the following capabilities: Deliver complex high quality solutions to clients in response to varying business requirementsEducate a project team on an Analytics Software Implementation/Development LifecycleEvangelize PowerBI, Cortana Intelligence Suite, Analytics Platform System (APS)Educate clients on SQL Server 2014+ Analytics features and capabilitiesDeliver and develop Custom Applications, PowerBI(Cloud and Desktop), SQL Server Analytics Platform Solutions and other Microsoft BI products (SSIS and SSRS)Previous experience with implementing custom applications in .NET / SQL Server environment pot .NET 3.5Utilize and lead workshops to assist clients in implementing Analytics solutionsBe a member of a team using an agile methodology and deliver Analytics Implementations Bottom line? We outthink ordinary. Discover what you can do at IBM. Be part of a team that is delivering exceptional value by bridging technology and expertise. Collaborate with extraordinary, insightful professionals in an environment that cultivates creativity and individuality. BENEFITS Health Insurance. Paid time off. Corporate Holidays. Sick leave. Family planning. Financial Guidance. Competitive 401K. Training and Learning. We continue to expand our benefits and programs, offering some of the best support, guidance and coverage for a diverse employee population. http://www-01.ibm.com/employment/us/benefits/https://www-03.ibm.com/press/us/en/pressrelease/50744.wssCAREER GROWTH Our goal is to be essential to the world, which starts with our people. Company wide we kicked off an internal talent strategy program called Go Organic. At our core, we are committed to believing and investing in our workforce through: Skill development: helping our employees grow their foundational skillsFinding the dream job at IBM: navigating our company with the potential for many careers by channeling an employees strengths and career aspirationsDiversity of people: Diversity of thought driving collective innovation In 2015, Go Organic filled approximately 50% of our open positions with internal talent that were promoted into the role. CORPORATE CITIZENSHIP With an employee population of 375,000 in over 170 countries, amazingly we connect, collaborate, and care. IBMers drive a corporate culture of shared responsibility. We love grand challenges and everyday improvements for our company and for the world. We care about each other, our clients, and the communities we live, work, and play in! http://www.ibm.com/ibm/responsibility/initiatives.htmlhttp://www.ibm.com/ibm/responsibility/corporateservicecorps Candidates from all locations considered; however candidates that live in or near one of the following cities preferred: Atlanta, Chicago, Columbus, Houston, Dallas, Raleigh, Washington DC Metro Area, Piscataway, Philadelphia. GBSEA17RWMS Required Technical and Professional Expertise Bachelor of Science or Bachelor of Arts with Math/Statistics Based Technical Experience RequiredAt least 4 years experience in configuration and development of SQL Server Analysis Services, SSRS, SSIAt least 4 years experience in SQL Server infrastructure optimizationAt least 1 year experience in PowerBI or Analytics Platform System (APS)At least 4 years experience in extending Analytics solutions with other Microsoft technologies and tools such as custom development SharePoint solutions, ASP.net, VB, .Net, C#, javascriptAt least 3 year experience in application development of .NET / SQL Server business solutionsAt least 3 year experience in Azure applicationsAt least 3 year experience in Office 365 integrationAny Microsoft SQL Server Certification Preferred Tech and Prof Experience At least 5 years experience in configuration and development of PowerBI or Analytics Platform System (APS)At least 5 years experience in SQL Server Integration Services (SSIS) or SQL Server Reporting Services (SSRS)At least 5 years experience in extending Analytics solutions with other Microsoft technologiesAt least 1 year experience in PowerBI, APS, SSIS or SSRSAt least 1 year experience in Azure Machine learningAt least 1 year experience with regression analysis and statistical modelling in MicrosoftAt least 1 year experience with R based programming in any Microsoft supported languageExperience with migrating from Tableau, QlikView, IBM SPSS, Cognos to other Analytics/BI PlatformMasters in statistics heavy degree planMicrosoft Certifications EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}