{"jobID": "2832810834", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist - TS/SCI Required", "companyRating": null, "companyInfo": {"Website": "www.talentsavant.com", "Headquarters": "Seattle, WA", "Size": "1 to 50 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "ACTIVE TS/SCI CLEARANCE REQUIRED. The Data Scientist position is a client-facing (C-Level) role requiring both technical and business analytics knowledge and skills. In this role you will:Working with client stakeholders to identify business problems of significant value.Translating business problems into specific requirements to develop analytics solutions.Working closely with customer and company leadership to set strategy and define success criteria for a project.Ensuring successful deployment of clients analytics solutions and leveraging pre-existing analytics industry knowledge and technical integration and development skills to ensure project success.Supporting clients who seek to develop their descriptive, predictive, and prescriptive analytics capabilities.Disseminating broad knowledge of analytics tools, applications and techniques.Qualifications:4+ years experience in business and technology consulting services with a strong track record of progressive experience and responsibility. Military and Intelligence Community (IC) analytical experience is a plus.Experience in the analytics space, preferably at the program implementation level.Knowledge of data modeling, data warehousing, database design, data mining techniques, data search indexing, business intelligence, big data ecosystem, microservice design/orchestration, and web services.Broad Knowledge of analytics vendors, platforms, and marketplace, especially SPSS, SAS, R, Matlab, Celect, DataRobot, Netica.Understand the difference between basic and advanced analytics techniques and when each should be used.Strong consulting service skills including effective verbal and written communication.Additional Details:Location of Position: Northern Virginia (Springfield, Chantilly, Mclean)Travel Required (CONUS/OCONUS): CONUSIf travel is required, how much? Work Schedule (Shift etc.): Day Shift8570 Requirements: PreferredSo what does our client do? They arean Information Technology firm, technology innovator and leader in the delivery of Business Intelligence (BI)/Analytics, Data Warehousing (DW)/ETL and Software Development & Integration services. We have extensive experience implementing Data and Analytics Solutions across the Public Sector, primarily in the Department of Defense (DoD) and Intelligence Communities.Apply Now!"}