{"jobID": "2836982160", "jobLocation": "Parsippany_NJ", "jobTitle": "Research Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.ferring.com", "Headquarters": "Saint-Prex, Switzerland", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "DESCRIPTION: Ferring Pharmaceuticals is a globally recognized, research-driven, biopharmaceutical company with more than 65 years of history. Headquartered in Switzerland, Ferring is privately owned with over 5,700 employees in nearly 60 countries. In the United States, Ferring identifies, develops and markets innovative products in the fields of reproductive health (infertility), urology, gastroenterology, endocrinology, women s health (obstetrics/gynecology) and orthopaedics. Ferring s US operations employ approximately 800 people.  People Come First At Ferring. The Ferring Philosophy places people at the heart of what we do. This guides our relations with patients, physicians, employees, and other stakeholders. We invite you to share our passion for people and the power of science. SUMMARY: Position will be responsible for product formulation feasibility to assess life cycle management opportunities and to evaluate new product development prospects, via internal research and via external partnerships and collaborations. RESPONSIBILITIES:Plan and execute early phase formulation work of solid, semi-solid and liquid dosage forms.Organize and evaluate results. Present and defend project results primarily internally, but also externallyOutsource pharmaceutical development activities to CROs/CMOs including selection of CROs/CMOsLead and coordinate external activitiesInitiate and introduce new scientific knowledge into the area and keep an updated scientific and regulatory knowledge in defined fieldsParticipate in technology transfer both internally and externallyWrite study protocols, reports and regulatory documents, and write and review SOPsMaintain and continuously improve the formulation lab and GMP pilot plant, including all equipment and instrumentsWork according to safety and quality regulations/guidelines (SOP s)REQUIREMENTS:Minimum B.Sc. in Pharmaceutical Science or related. M.S/Ph.D is an assetMinimum 6-8 years experience in pharmaceutical industryProven skills in pre-formulation and dosage form designStrong understanding of QbD and experimental designExperienced in the pharmaceutical GXP regulated work We are proud to be an Affirmative Action/EEO Employer. EOE Minorities/Females/Protected Veterans/Disabled  We maintain a drug-free workplace and perform pre-employment substance abuse testing.  If you need assistance during the application process due to a disability, please email careers@ferring.com LOCATION: Parsippany"}