{"jobID": "2705505575", "jobLocation": "Chicago_IL", "jobTitle": "Senior Applied Data Scientist, Commercial", "companyRating": "4.6", "companyInfo": {"Website": "www.civisanalytics.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "Are you a self-starter? Do you want to work where you can make an immediate impact? Are you interested in using data science to solve big and important problems in new ways — like helping a green energy startup find new areas of growth, figuring out how to increase participation in vital social services, or completely changing the way that large brands engage with consumers? Civis Analytics is looking for a Senior Applied Data Scientist to join our team!  Civis Analytics was born on the campaign trail, with CEO Dan Wagner and our founding members spearheading the 2012 Obama for America analytics team. Since then, our DC and Chicago teams have been building software and growing rapidly among a steadily developing client base in education, energy, government, healthcare, media, nonprofits, and politics. It’s our mission to empower organizations to find truth and guide actions that will change their world for the better.The Applied Data Science (ADS) team is the advisory arm of Civis Analytics, working closely with companies, nonprofits, and campaigns to help solve their toughest challenges with data science.Senior Applied Data Scientists structure difficult problems, analyze large data sets, build predictive models, collaborate in cross-functional teams, create and deliver presentation materials, and manage the completion of client projects.Civis Analytics has opportunities for applicants who are seasoned professionals, brilliant newcomers, and anywhere in between. We are looking for detail-oriented individuals from diverse backgrounds with demonstrated quantitative and problem-solving skills. We value creativity, hard work and on-the-job-excellence and offer competitive compensation and benefits packages. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States.ResponsibilitiesManages data science projects for clients from beginning to endStructure complex client problems to be solved using imperfect dataWork with cross-functional teams of engineers, data scientists, social scientists as necessaryEnhance, find patterns in, and build predictive models on large data setsTranslate findings into clear, actionable, and timely insightsCommunicate findings to clients with various skill levels and in various rolesCreatively identifies opportunities to convert insights from client engagements into scalable decision applications, and collaborates with other teams to build these toolsAssists Applied Data Science Managers in new business development, including scoping projects, writing proposals, and building and maintaining case studies and other project collateralWorks independently and pro-actively, asks for help when needed, both of peers and supervisorsTeaches and mentors Applied Data ScientistsTravel requirements: Minimum QualificationsBachelor’s degree in an analytical subject (statistics, math, economics, physics, political science, etc)Experience working with large and messy data sets (SQL experience is a plus)Proficiency with statistical packages (R, Python, STATA, etc) and proven ability to work pragmatically with statistical conceptsExperience working with presentation and data visualization software, such as Microsoft Office or TableauExcellent interpersonal and communication skillsPreferred QualificationsExperience framing analytics results within appropriate business context, and communicating these results to stakeholders at all levelsExperiencing mentoring more junior members of a teamPractical understanding of and experience with predictive analytics and machine learning"}