{"jobID": "2831655903", "jobLocation": "Sacramento_CA", "jobTitle": "Accounts Receivable", "companyRating": "3.9", "companyInfo": {"Website": "www.ibs-team.com", "Headquarters": "Sacramento, CA", "Size": "51 to 200 employees", "Founded": " 1977", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "17", "jobDescription": " We are seeking a talented and motivated Accounts Receivable team member who is excited to work for a stable and successful global organization based in Sacramento. Inland Business Systems is owned by Global Imaging Systems, a wholly-owned subsidiary of Xerox Corporation. The company provides a broad line of office technology solutions including the sale and service of copiers and other automated office equipment, network integration services, and electronic presentation systems. The company is also a disciplined, profitable consolidator in the highly-fragmented office technology solutions industry. Key Responsibilities:Resolving problem customer accounts; providing direct assistance where necessary.Become a resource to our customer by providing the needed information to help them pay their invoices.Runs reports and reviews status of customer accounts.Reviews and approves contract cancellations within approved limits; forwards to contract billing.Reviews and recommends write-offs, if necessary.Creates new customer accounts in system including setting credit limit following established process.Maintains effective communication channels throughout organization regarding customer issues.Sends collection letters, sets/releases credit holds and handles billing disputes.Researching customer's problems and payments received.Return duplicate payments back to customers.Reconcile customer's accounts; Process credit card payments.Writes and updates Accounts Receivable procedures.Monthly statements and other administrative duties as necessary.If necessary due to shortage on staff: Phone/Reception back up, answer incoming calls, take messages, transfer to voicemail and/or greet customersSkills Required:High School Diploma/or GED equivalent required.Three to five years related experience; or equivalent combination of education and experienceAbility to calculate figures and amounts such as discounts, interest, commissions, proportions, and percentages.Ability to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.Very proficient computer skills. Able to quickly learn and use new systems or programs.Accuracy, detail orientation and initiative.Good written and verbal communication with customers, vendors, and coworkers.Windows, Microsoft Office, Outlook, Internet Explorer, Excel, Word, Outlook, 10-Key and type a minimum 40 wpm.Must be able to pass a background check and drug screen.Come join our team!Inland Business Systems, a Xerox Company.0"}