{"jobID": "2591420621", "jobLocation": "Alexandria_VA", "jobTitle": "Sales and Management Trainee", "companyRating": null, "companyInfo": {"Website": "www.unitedelectric.com", "Headquarters": "New Castle, DE", "Size": "201 to 500 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Graybar Electric, Dominion Electric Supply"}, "estimatedSalary": null, "jobDescription": "Who we are:Headquartered  in Wilmington, Delaware, with 21 locations across Delaware, Pennsylvania, New  Jersey, Maryland and Virginia, United Electric is a nationally recognized, 100%  employee-owned general line distributor of sophisticated electrical design and  application products and systems. We have some of the best in their fields  working for us, and we are known for the superior knowledge of our  employee-owners and the outstanding service they provide to our customers. Position Summary: United  Electric is looking for motivated and hardworking people to join our small but  mighty sales team in Alexandria, VA! The  ideal candidate likes to have fun but also knows how to get stuff done. If the chance to be a top performer in a  rapidly growing territory excites you, then you could be the next  employee-owner to join United! This position rotates  through Counter Sales and then to Inside Sales/Business Development on the way  to becoming an Outside Sales Representative. Along  the way, our Sales and Management Trainees engage in training classes, webinars  and on the job training designed to accelerate his or her understanding of why  customers buy and how to make yourself valuable and profitable. We are an  organization that recognizes talent and provides the opportunity for training  and development for your career growth.  Once  outside, the sales person: Calls on Construction, Industrial  & Institutional customers.Drives the sales strategy in each  account through the development of long-term relationships.Provides customer service and  satisfaction through sales to purchasing agents/buyers, project managers,  engineers, facilities maintenance workers and finance and accounting  representatives.Qualifications:A high degree of interpersonal understandingExperience in effective conflict resolutionMinimum HS DiplomaAssociate’s degree preferredCompensation and Benefits:We offer attractive compensation and benefits which include:Health, Dental, and Vision InsuranceDisability Insurance and Life Insurance401(K) and Stock OwnershipPaid Vacation and holidaysEducational BenefitsWellness ProgramsWork/Life BalanceWe are an equal employment opportunity  employer."}