{"jobID": "2661380330", "jobLocation": "Washington_DC", "jobTitle": "Computer Scientist - Direct Hire Authority", "companyRating": "4.2", "companyInfo": {"Website": "www.af.mil", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1947", "Type": " Government", "Industry": " Government", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Duties  Help Duties Summary The mission of the United States Air Force is to fly, fight and win...in air, space and cyberspace. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do. This is a Public Notice for positions being filled under the Direct Hiring Authority (DHA) for Domestic Defense Industrial Base Facilities and Major Range and Test Facilities Base, NDAA 1125 (a) and (c). Positions may be filled as permanent, temporary or term with a full-time or part-time work schedule. Pay will vary by grade level and geographic location. Under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. Please read this Public Notice in its entirety prior to submitting your application for consideration. You are applying to a resume database, your resume and any documents submitted will be retained for six months and may be used at any time during this period. When a position is requested to be filled under the Direct Hire Authority, a list of applicants may be provided to management for review and possible selection. You will not receive any notifications and your resume will not be reviewed for qualifications until a position is requested to be filled. This Public Notice may be used to fill positions in other equivalent pay systems. This public notice may be used to fill one or more vacancies at any time without notification. Duties and responsibilities vary and may increase according to the grade level. This public notice may also be used to fill target grades (e.g. WG-08 Target WG-10). Learn more about this agency  Responsibilities  General Schedule Salary Table for \"Rest of US\" (RUS) was used, salaries may vary dependent upon location selected. Please refer to the Salary Tables link for more information: https://www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/2017/general-schedule/ Link to GS Qualifications for additional information: https://www.opm.gov/policy-data-oversight/classification-qualifications/general-schedule-qualification-standards/#url=List-by-Occupational-Series  Travel Required Occasional travel - You may be expected to travel for this position. Supervisory status  No  Who May Apply This job is open to… This public notice is to gather applications that may or may not result in a referral or selection.  Questions? This job is open to 1 group.  Job family (Series)  1550 Computer Science  Requirements  Help Requirements Conditions of Employment U.S. Citizenship is requiredMales must be registered for Selective Service, see www.sss.govTotal salary varies depending on location of positionPCS expenses if authorized will be paid IAW JTR and Air Force RegulationsRecruitment incentives may be authorizedThis posn is subject to provisions of the DoD Priority Placement Program Conditions of employment: 1.) Some positions may be deemed drug testing designated positions and require participation in random drug testing. 2.) Incumbent may be subject to pre-employment drug testing as a condition of employment, and participation in random drug testing. 3.) Appointment may be contingent upon passing a physical examination. 4.) Incumbent may be required to obtain and maintain appropriate background investigation or security clearance. 5.) May be required to drive a motor vehicle. A valid driver's license may be required for the position. 6.) Employee may be required to work other than normal duty hours, to include evenings, weekends, and/or holidays. 7.) Shift work and emergency overtime may be required. 8.) Employee must maintain current certifications depending on series. 9.) PCS or moving costs may be paid for approved positions, dependent upon Organizational needs and authorization. 10.) Recruitment incentives or bonuses may be available for approved positions. **There may be additional conditions and/or requirements as determined by the position being filled.** Qualifications  EXPERIENCE: Applicants will be rated in accordance with the OPM Qualification Standards; for additional information refer to the General Schedule (GS) qualifications link above. Position requirements vary dependent upon the specific series and grade, you must meet any minimum experience or training requirements per OPM qualifications standards and show through experience and/or training that you possess the quality level of knowledge, skill and ability necessary to perform the duties of the position at the level for which applying.  Education IF USING EDUCATION TO QUALIFY: You MUST provide transcripts to support your educational claims. Education must be accredited by an accrediting institution recognized by the U.S. Department of Education.FOREIGN EDUCATION: Education completed in foreign colleges or universities may be used to meet the requirements. You must show proof the education credentials have been deemed to be at least equivalent to that gained in conventional U.S. education program. It is your responsibility to provide such evidence when applying.  Additional information Interagency Career Transition Assistance Program (ICTAP): For information on how to apply as an ICTAP eligible click here. To be well-qualified and exercise selection priority for this vacancy, displaced Federal employees must be rated in the \"Highly Qualified\" or \"Best Qualified\" Category on the rating criteria for this vacancy. You must submit a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting position, grade level, and duty location.Employed Annuitants (Reemployed Annuitants): Applicants in receipt of an annuity based on civilian employment in the Federal Service are subject to the DoD Policy on The Employment of Annuitants. Click here for more information.Temporary and Term Appointments: If you are selected for a temporary or term position in the competitive service, your appointment may be extended to the maximum period allowed by law without further competition. Additionally, if you are serving on a term appointment in the competitive service, you may be converted to a career or career-conditional appointment without further competition. NOTE: Current federal civilian employees may apply for this position and if selected, a break in service of at least 3 days may be required prior to appointment to this position.Selective Service: Males born after 12-31-59 must be registered or exempt from Selective Service. For additional information, click here.Direct Deposit: All federal employees are required to have direct deposit. If you have questions regarding this announcement and have hearing or speech difficulties click here. Read more  How You Will Be Evaluated You will be evaluated for this job based on how well you meet the qualifications above. Your latest resume will be used to determine your qualifications. Your application package (resume, supporting documents, and responses to the questionnaire) will be used to determine your eligibility, qualifications, and quality ranking for this position. Please follow all instructions carefully. Errors or omissions may affect your rating or consideration for employment. To apply for this position, you must provide a complete Application Package which includes: 1. Your Resume (your latest resume will be used to determine your qualifications) If you submit more than one copy of your resume, only the most recent (latest) version will be reviewed. The latest timestamp will be used to determine which version of your resume is \"most recent.\" It is your responsibility to check the status and timestamp of all documents you submit as part of your application. If your resume includes a photograph or other inappropriate material or content, you will not be considered for this vacancy. For qualification determinations your resume must contain hours worked per week and dates of employment (i.e., hours per week and month/year to month/year or month/year to present). If your resume does not contain this information, your application may be marked as insufficient and you will not receive consideration for this position. 2. Additional Required Documents (see Required Documents section below). Ensure all submitted documents contain your full name, address, phone number, and last four digits of your social security number. Read more  Background checks and security clearance  Security clearance  Public Trust - Background Investigation  Required Documents  Help Required Documents The following documents are required and must be provided with your application for this Public Notice:Online Application - QuestionnaireResume - must include beginning and ending month and year for each employment periodTranscripts - if qualifying based on education or positive education seriesRegistration/License - active, current registration/license if applicable for the positionVeterans' Preference - a copy of your DD Form 214 which must include character of service or a Statement of Service/Proof of Service which must include service dates and character of service. In addition, if claiming 10-point preference you must submit a VA Letter or a disability determination from a branch of the Armed Forces (or documentation of Purple Heart, if applicable) and a SF 15 (Application for 10-point veteran preference).ACTIVE DUTY SERVICE MEMBERS: The VOW Act Chapter 21 of Title 5, United States Code (U.S.C.), Section 2108a, requires Federal agencies treat active duty service member as veterans, disabled veterans, and preference eligible, when they submit, at the time they apply for a Federal job, a \"certification\" of active service in lieu of a DD-214, assuming the service member is otherwise eligible. A \"certification\" letter should be on letterhead of the appropriate military branch of the service and contain (1) the military service dates including the expected discharge or release date; and (2) the character of service. The service member's military service dates are necessary in order to determine whether he or she meets the definition of \"veteran\" under 5 U.S.C. 2108(1). The \"certification\" must reflect the service member is expected to be discharged or released from active duty service in the armed forces under honorable conditions not later than 120 days after the date of submission. The \"certification\" must be signed by, or by direction of, the adjutant, personnel officer, or commander of your unit or higher headquarters and must indicate when your terminal leave will begin (if applicable), your rank, dates of active duty service, the type of discharge and character of service (i.e. honorable). Further, under paragraph (h) of the rule, agencies are required to verify a qualifying separation from military service prior to appointment, through the DD-214 or other appropriate documentation. Your preference and/or appointment eligibility will be verified prior to appointment. Active duty members that fail to provide a valid \"certification\" of service with their initial application will be found \"not eligible.\" Military members may be appointed before the effective date of their military retirement/separation if member is on terminal leave.  If you are relying on your education to meet qualification requirements:  Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.  Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.  Benefits  Help Benefits  A career with the U.S. Government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Learn more about federal benefits.  Review our benefits Eligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time, or intermittent. Contact the hiring agency for more information on the specific benefits offered. How to Apply  Help How to Apply The complete Application Package must be submitted by 11:59 PM (ET) on 11/09/2018. To preview the Application Questionnaire, please click the following link: https://apply.usastaffing.gov/ViewQuestionnaire/10070933 To begin the process, click the Apply Online button to create an account or log in to your existing USAJOBS account. Follow the prompts to complete the application questionnaire. Please ensure you click the Submit My Application button at the end of the process. If you are unable to apply online, view the following link for information regarding Alternate Application.PLEASE NOTE: It is the applicant's responsibility to verify that information entered and/or uploaded, (i.e., resume) is received, accurate, and submitted by the closing date. You may verify your documents have been processed with your application package successfully. You can access your USAJOBS account to do so by clicking here. Uploaded documents may take up to one hour to clear the virus scan. Human Resources WILL NOT modify or change any answers submitted by an applicant. Read more  Agency contact information Total Force Service Center  Phone  1-800-525-0102  Email  DO.NOT.EMAIL@CALL.ONLY  Address  Tinker AFB 3001 Staff Drive Tinker AFB, OK  US  Learn more about this agency  Next steps  Upon the submission of your application package to USAJobs.gov, you will receive an automatic reply from OPM informing you that your application has been submitted, received and is being processed. If you provided an email address, you will receive an email message acknowledging the receipt of your application. Your application will remain active through the open period of this Public Notice. Once this Public Notice closes, you must reapply. You will not receive any additional notifications and your resume will not be reviewed for qualifications until a position is requested to be filled. After you submit your application, you will be contacted only if further evaluation or interviews are required or upon selection.Read more  Fair & Transparent  Fair & Transparent  The Federal hiring process is setup to be fair and transparent. Please read the following guidance.  Equal Employment Opportunity Policy  The United States Government does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor.  Equal Employment Opportunity (EEO) for federal employees & job applicants Read more Reasonable Accommodation Policy  Federal agencies must provide reasonable accommodation to applicants with disabilities where appropriate. Applicants requiring reasonable accommodation for any part of the application and hiring process should contact the hiring agency directly. Determinations on requests for reasonable accommodation will be made on a case-by-case basis.  A reasonable accommodation is any change to a job, the work environment, or the way things are usually done that enables an individual with a disability to apply for a job, perform job duties or receive equal access to job benefits.  Under the Rehabilitation Act of 1973, federal agencies must provide reasonable accommodations when: An applicant with a disability needs an accommodation to have an equal opportunity to apply for a job.An employee with a disability needs an accommodation to perform the essential job duties or to gain access to the workplace.An employee with a disability needs an accommodation to receive equal access to benefits, such as details, training, and office-sponsored events. You can request a reasonable accommodation at any time during the application or hiring process or while on the job. Requests are considered on a case-by-case basis.  Learn more about disability employment and reasonable accommodations or how to contact an agency. Read more Legal and regulatory guidance  Financial suitability  Social security number request  Privacy Act  Signature and false statements  Selective Service  New employee probationary period  This job originated on www.usajobs.gov. For the full announcement and to apply, visit www.usajobs.gov/GetJob/ViewDetails/482813300. Only resumes submitted according to the instructions on the job announcement listed at www.usajobs.gov will be considered.  View Map  Please wait while map is being generated.  Close  Beginning of a dialog window for the agency announcing this job. It begins with a heading 2 called \"Learn more about Field Operating Offices of<"}