{"jobID": "2750160302", "jobLocation": "Hayward_CA", "jobTitle": "Digital Services Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.fremontbank.com", "Headquarters": "Fremont, CA", "Size": "501 to 1000 employees", "Founded": " 1964", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Bank of the West, Bank of America, Wells Fargo"}, "estimatedSalary": "66000", "jobDescription": "Fremont Bank founded in 1964, is one of the oldest independently owned banks in the Bay Area and is one of the top rated mid-tier banks in the nation. Voted a Top Workplace for 2017 and for the past seven consecutive years, Fremont Bank has an immediate opening for a Digital Services Data Analyst in Hayward, CA.Position Overview The Digital Services Data Analyst will be the subject matter expert for all data relating to Digital Banking Services. They will be responsible for architecting, analyzing, interpreting and reporting on data from multiple sources with various tools. Duties of the Data Analyst frequently include importing, cleaning, transforming, validating, and modeling data with the purpose of understanding or making conclusions from the data for decision making purposes. The Data Analyst is responsible for running queries, reporting data and/or providing access to a limited number of database users. The Data Analyst will be responsible for improving data quality and for designing or presenting conclusions gained from analyzing data using statistical tools like Microsoft Excel, Tableau and Cognos. Role and ResponsibilitiesPerform business and data analysis for digital services and products as well as branch data, supporting bank strategy and team initiatives, and collaborating with Business Analysts, Program/Product Managers, Operations, and IT.Maintain several Tableau Interactive Dashboards and Cognos reports to facilitate day to day activities.Recognize opportunities to develop new Dashboards from Spreadsheet data or directly from various source systems.Monitor multiple internal IT systems and ensure the data quality is consistent and clean.Audit the data flowing from internal transaction systems into the data warehouse and subsequently into the front end tools (Tableau and Cognos).Review and log all bugs via a service desk and work with the internal data warehouse teams to resolve the issues.Work with the data governance team to scrub or cleanse the data in source system and augment the data if the data does not exist in the source system.Minimum QualificationsBachelor's degree preferred; equivalent work experience may be considered in lieu of a four year degree; MS/MBA a plusMinimum 3-4 years’ experience in report writing using business intelligence tools including but not limited to, Cognos and Tableau2+ years' experience in Online, Mobile and Payments dataSequel server and data base experienceProven experience working with Excel and developing and maintaining various analyses and reporting toolsPositive, team-oriented and enthusiastic attitudeKnowledge of commonly used financial industry concepts, practices and guidelinesExcellent oral communication and technical writing skillsStrong research, analytical, planning and organizational skillsAbility to make objective observations, examination, evaluations and recommendations"}