{"jobID": "2688752258", "jobLocation": "Oakland_CA", "jobTitle": "Counseling Enriched Program Director - $5k SIGN ON BONUS", "companyRating": "3.6", "companyInfo": {"Website": "www.ebac.org", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 1952", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "Counseling Enriched Program Director - ($5k sign on bonus)  EBAC improves the well-being of children, youth and families by reducing the impact of trauma and social inequities and is committed to building a comprehensive, place-based continuum of accessible, trauma-informed and culturally relevant services that build resiliency, aid in recovery and, where possible, prevent exposure to adverse childhood experiences.  Our staff seeks to reduce barriers that contribute to disparities in wellness for socio-economically disadvantaged and racially marginalized families and to create communities where all children and families have supports to reach their full potential. A. FUNCTION The Counseling Enriched (CE) Program Director is responsible for the development, direction and monitoring of the psychotherapeutic/educational counseling enriched (CE) programs. These programs include elementary, junior high and high school programs in Oakland and San Leandro, CA. Provides leadership and direction to staff, and administers services and compliance aspects of the programs. Responsible to proactively identify, cultivate and manage the implementation of service delivery expansions. B. QUALIFICATIONS LCSW, LMFT with ability to provide clinical supervision preferred. Masters in clinical social work, education, psychology or public health field required. Preference given to candidates able to provide clinical supervision, individual and/or group. Five years of experience in child/family clinical practice with diverse population and experience must include provision of clinical services to child populations in milieu settings and impacted by trauma and social inequities. At least five years’ experience working with and/or supervising multidisciplinary teams in a school/milieu setting. Knowledge and competency in providing trauma-informed care and trauma-focused models to children impacted by adversity and developmental trauma. Excellent administrative, clinical and supervisory skills (CAMFT supervisor certificate desired.) Excellent written and oral communication skills; organizational and multi-tasking skills.Excellent understanding of ERMHS; special education regulations, and IEP process and demonstrated professional experience in partnering effectively across systems and with school district and special education department.C. RESPONSIBILITIES (Those with an asterisk are essential duties.)  *Coordinate the development and implementation of education, mental health and casework modalities of the school based day treatment and counseling enriched classroom programs. *Coordinate the treatment planning process through direct supervision of staff. *Responsible for recruitment, hiring, training, supervision and evaluation of mental health staff, including Program Coordinators/Clinicians and Behavioral Health Counselors, and assist school district in the recruitment, hiring and evaluation of educational staff. Coordinate the intake and evaluation of children referred for services. Collaborate with teachers and school district staff to create specific educational programs for students. Provide crisis intervention with children in the milieu. *Provide weekly individual and group clinical supervision and other consultation to Mental Health Clinicians as needed. *Provide individual and/or group clinical supervision and consultation and training to each contingent of the multi-disciplinary team. *Maintain close contact/liaison with the school district and the Alameda County Behavioral Healthcare Services. *Ensure compliance with Federal, State and local laws and regulations and with terms of contracts with funding sources. *Develop and maintain program budget and monthly forecast. *Provide direct oversight and coordination of EBAC Clinical Services Division Clinical Training Program and Practicum placement. Work closely with community partners regarding placement, referrals, and other ancillary services. Attend and actively participate in large management and other inter-agency meetings. Utilize Operations Manual and oversee inclusion of periodic policy/procedure updates.Monitor employee work schedules and approve employee timesheets for forwarding to HR within the required time frame. 16. Other duties as assigned.D. WORKING CONDITIONS and JOB SETTINGWork requires daily traveling between classroom sites and may be performed in classroom or office on diverse school campus settings.Work is directly with children who struggle with moderate to severe behavioral challenges, can at times become aggressive; therefore, full mobility is required for standing walking, sitting, using hands, climbing, balancing, stooping, kneeling, crouching, and crawling.Must be able to complete certification in crisis prevention interventions including de-escalating trauma-informed verbal interventions and physical holds as a last resort to prevent physical harm or injury to children in care. Must complete certification in non-violent crisis intervention as provided by Crisis Prevention Institute, Inc. Noise levels may be high at times. Periodic lifting up to 25 pounds is required. EBAC offers a uniquely generous time off package and an outstanding benefits package that includes health; chiropractic; dental; voluntary life insurance (for yourself and your family), AD&D; and SDT; accident and critical illness coverage (for yourself and family); flexible spending for medical, child care and commuter benefits; 403b retirement program; legal insurance; and, agency paid life insurance and long term disability coverage.  East Bay Agency for Children is an equal opportunity employer and encourages diverse candidates to apply by sending a cover letter and resume to group10@ebac.org, or by fax to 510-268-0143. Please use the job title as the subject. No phone calls please."}