{"jobID": "2803041339", "jobLocation": "The_Woodlands_TX", "jobTitle": "Senior Quantitative Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.talenenergy.com", "Headquarters": "Allentown, PA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "116000", "jobDescription": " Job DescriptionTalen Energy is currently seeking an experienced Senior Quantitative Analyst to join our growing team in our Woodlands, TX office! Please see below for the essential functions and qualifications! Essential FunctionsAssist Commercial team procuring and cleaning data to be used for analytics.Assist in producing analytical reports related to power and natural gas markets.Support Talen’s wholesale power business through the development of fundamental analyses around the natural gas, electric energy and capacity markets.Provide support in development of pricing, calibration and hedging models for power and gas business.Support the Commercial function and Talen more broadly through the performance of ad hoc fundamental analysis and data retrieval.Support structured deal valuations.Assist in portfolio VAR, GMAR estimation.Assist in building out front office tools for portfolio management and in the automation of existing tools and processes.Perform related job duties as assigned.Minimum QualificationsGraduated with BS/MS/PhD in Mathematics, Physics, Electrical Engineering, Financial Engineering, Computer Science or equivalent.Knowledge, Skills and AbilitiesStrong understanding of power markets, ISOs, transmission systems, and the data tools used by market participantsExperience in programming Object Oriented Language (e.g. C++, Java, etc), Python, VBA, R, SQL, MATLABMust have good verbal and written skills and the ability to work in a team environmentTime TypeFull timeNumber of Openings1Note: You will have an opportunity to add attachments to your application. Please use this opportunity to upload your resume, cover letter, and any relevant documents ."}