{"jobID": "2802728056", "jobLocation": "Somerville_NJ", "jobTitle": "Principal Project Manager Scientist, Biosurgery R&D;", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "147000", "jobDescription": " Ethicon, a  member of Johnson & Johnson's Family of Companies, is currently recruiting  for a Principal level Project Manager/Scientist to  be located in Somerville, NJ.  The Biosurgery platform in The Ethicon  Franchise, a member of Johnson & Johnson's Family of Companies, is  recruiting for an Project Manager/Principal Scientist position located  in Somerville, New Jersey. From creating the first sutures, to  revolutionizing surgery with minimally invasive procedures, Ethicon has made  significant contributions to surgery for more than 60 years. Our continuing  dedication to Shape the Future of Surgery is built on our commitment to help  address the worlds most pressing health care issues, and improve and save more  lives. Through Ethicons surgical technologies and solutions including sutures,  staplers, energy devices, trocars and hemostats and our commitment to treating  serious medical conditions like obesity and cancer worldwide, we deliver  innovation to make a life-changing impact  Thriving on a  diverse company culture, celebrating the uniqueness of our employees and  committed to inclusion. Proud to be an  equal opportunity employer.  The Project  Manager/Principal Scientist manages projects and conducts research directed  toward discovery and/or development of Biosurgery products including hemostats  and sealants.  As a Project Manager/Principal Scientist  responsibilities will include: Project Leadership and ExecutionCollaborate with or lead cross functional  project teams in a matrix environment to drive team accountability for  deliverables and ensure projects meet milestonesGuide project team activities to meet project  and business objectives including approval of project recommendations through  governance; Drive team accountability for deliverables and ensure projects meet  milestonesProactively identify and escalate risks and  issues to relevant stakeholders; lead development and delivery of tactical and  achievable mitigation and contingency planningDevelop, manage and maintain up-to-date MS  Project Timelines inclusive of all critical milestones, key interdependencies  and resource constraints, while applying appropriate project scheduling  techniquesMonitor project status and execution; report  timely updates via Project Templates, Project Dashboards and Update Forms; and  develop agendas, minutes, metrics, etc. for the teamsDemonstrate business acumen, project  management, communication, process management and team performance managementDeliver transparent, timely and effective  verbal and written communication to teams, stakeholders and appropriate levels  of the organization Lead  \"lessons learned\" exercises, share lessons among project leaders and  other teams, integrate lessons into existing processes, tools and templates Technical  ResponsibilitiesCollaborates  with in-house teams, cross J&J; teams, and external partners to identify  product development opportunities and to execute existing projectsDevelops  concepts and designs for surgical products including biologics and synthetics.Coordinate and  participates in preclinical evaluation of prototypes and optimization of  products for developmentSupports  Operations group in transferring manufacturing processes from R&D; to  OperationsPrepares  technical reports and presentations that accurately describe the available  data.Prepares  technical sections of regulatory submissions and responds to questions from  regulatory authoritiesFollows  current biomedical literature and patent literature in Biosurgery fields.Provides  technical leadership to project teamsQualificationsA minimum of a Master's Degree (or equivalent) in Chemical Engineering,  Biochemistry, Biomaterials or Biomedical  Engineering, or other relevant field is requiredAn advanced degree (PhD, MBA, etc.) in a business or related field is  preferredA minimum of 8 years of relevant experience in product development is  requiredA minimum of 5 years experience in Project  Management is requiredA proven record of Project management, leading  multifunctional teams and cross-functional team management experience is  required; multi-discipline experience preferredDemonstrated proficiency in MS Project or  other Project Management tools is required.Familiarity with IND, PMA,  BLA, and MAA processes required.Experience working in a  Regulated industry is requiredExperience working in a  Lab environment is requiredPMP or other Project Management certification  is highly preferredExperience in combination Products  is preferredExperience in vitro and ex  vivo methods for characterizing prototypes and products is preferredExperience in developing  and validating biochemical test methods for finished products and raw materials  is preferredProven problem-solving  skills using analytical technologies is preferredDomestic and international travel up to 10%  is required for this position.Primary Location United States-New Jersey-Somerville Organization Ethicon Inc. (6045) Job FunctionR&D;Requisition ID7277180327"}