{"jobID": "2690454711", "jobLocation": "San_Francisco_CA", "jobTitle": "Junior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.caissallc.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Role: The Jr. Data Analyst works in a fast-paced environment, whose primary responsibilities include the processing of complex investment data. Jr. Data Analysts must demonstrate a high attention to detail and must be able to double check their work for accuracy. Candidates should be comfortable working in a team environment, while also juggling multiple priorities independently, on tight deadlines. The candidate will work closely with team members in our NYC offices so efficient communication skills are a must. We have a fun and casual office atmosphere, but everyone works diligently to get the job done. Responsibilities:Review raw investment data received in various formats and standardize its processing.Use internal proprietary tools to manipulate and migrate investment data into the Platform.Review and analyze investment transactions and financial statements.Qualifications:1 - 2 years of experience.Expertise with MS Office applications (Excel, PowerPoint, Word, Outlook, etc.); especially Excel.Highly analytical and quantitative.Meticulous attention to detail.Data Entry experience is strongly preferred.Ability to thrive in a fast-paced environment.Ability to work independently as well as work collaboratively as a team.A quick learner with strong work ethic.Candidate must be client service oriented and demonstrate an ability to problem solve.Ability to handle multiple tasks, meet reporting deadlines, and demonstrate the ability to prioritize the workload.Strong communication skills, including the ability to speak and write in English with a high degree of fluency.Perks:Monthly Travel StipendFree breakfasts, lunches, and dinnersPTO and Holidays.Health Insurance Caissa, LLC is an equal opportunity employer."}