{"jobID": "2780579930", "jobLocation": "Redwood_City_CA", "jobTitle": "Quantitative Analyst / Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.wealthfront.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": "At Wealthfront we have an ambitious vision to optimize and automate all your personal finances. By delivering our service exclusively through software, we can also offer very low fees and account minimums. Over the past six years our clients have rewarded us with $10 billion to manage and we have attracted some of the best venture capital firms in the business including Benchmark Capital, Greylock, Index Ventures and Social Capital. We recently closed a $75 million round of funding from Tiger Global and are rapidly growing our team.We are seeking a quantitative analyst / data scientist to join the Quantitative Research team at Wealthfront. The primary responsibility of the role is to investigate and develop proprietary, automated investment strategies addressing our clients' various investment problems. Your focus will span topics related to asset allocation, portfolio construction, optimization, tax efficiency, trade execution, behavioral finance, and will afford you the opportunity to work with a proprietary dataset spanning the investments of hundreds of thousands of clients. Successful candidates will combine an ability to derive and apply quantitative models to the empirical analysis of financial and client data. Code and models are the way we express insights and analysis, thus you need to be comfortable working with large datasets and writing significant amounts of R code. Responsibilities Build reproducible backtests for proposed models / algorithmsContribute to the deployment and implementation of differentiated investment servicesContribute to the development of infrastructure for modelling, optimization, backtesting, analytics, and data managementInvestigate, identify, and acquire internal / external datasetsCollaborate with other teams (engineering, product, design, marketing, and compliance) to commercialize new products and ongoing enhancements to existing productsRequirementsBS or Masters Degree in mathematics, statistics, economics or computer science (or a related quantitative discipline). If you are thinking about doing a PhD someday, chances are youll love our team.Experience analyzing complex data and building statistical modelsProgramming proficiency in R or Python (you have written massive amounts of code, employing revision control, and testing)Programming competency in SQL preferred Bonus Points Programming competency in Java, ScalaExperience with AWS cloud computing technologiesAbout Wealthfront:For more information please visit www.wealthfront.com.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}