{"jobID": "2822552060", "jobLocation": "Bedminster_NJ", "jobTitle": "Drug Safety Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.mallinckrodt.com", "Headquarters": "Hazelwood, MO", "Size": "1001 to 5000 employees", "Founded": " 1867", "Type": " Company - Public (MNK) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Job Description  The primary responsibilities of the Safety Scientist (SS) are to perform safety data analysis, medical writing and project management. The SS is an integral part of a safety management team. The initial task of any safety issue evaluation is to ensure that all relevant data has been accessed and made available for the analysis. In the case of post-marketing safety analyses, this requirement invariably involves the design and execution of a sufficiently robust search strategy. The definition of “sufficiently robust” consists of two qualities:  a search strategy that is broad enough to ensure that all relevant cases will be found, either in the scientific literature or the safety/clinical database, the search is efficient. Efficiency is a measure of non-relevant cases returned in the search.  The SS will be responsible for medical writing of safety deliverables. Lastly, the SS will be responsible for Project Management for each safety data analysis performed. The Safety Scientist will establish and maintain positive and mutually rewarding relationships with all Mallinckrodt personnel involved in pharmacovigilance (PV) globally and domestically to ensure Global PV compliance. The Safety Scientist will be involved in other tasks for Global Pharmacovigilance as needed and will be cross-trained to handle other functions as deemed necessary.  Principal Responsibilities  The SS is responsible for collecting all safety data relevant to the issue to be evaluated. The execution of this task is typically a joint effort between the Global Safety Lead (GSL) and the SS for medically complex topics.  SS is to organize all available data into subgroups by decreasing levels of rigor. The most rigorous (reliable) data being those derived from controlled non-clinical experiments or controlled clinical trials. The least rigorous data are those data derived from spontaneous, non-medically confirmed post-marketing reports, for example..  Once all relevant safety data have been assembled as indicated above, the SS will assemble an initial draft and begin a preliminary analysis to look for patterns or trends consistent with the hypothesis(es) developed with the GSL.  The SS is then responsible for the assembling of the initial draft written document, circulating it to required stakeholders for review and comment, incorporating relevant comments (and addressing comments not taken), pre-final draft and final document.  The SS must arrange for independent review of all health authority documents or signal evaluation reports for completeness and accuracy (Quality Control). The author SS is responsible to supply to the reviewing SS (or designee) all source documents used in the production of a given deliverable. The authoring SS will ensure that all findings are addressed to the satisfaction of the reviewer before finalizing the document for sign-off.  The SS is also responsible for obtaining any required signatures for final documents and archiving the documents and supporting materials including completed QC checklist and the final approved document.  The SS is responsible for Project Management. The SS is expected to manage the production of assigned documents to agreed timelines. This may include coordinating input from multiple stakeholders, assuring uniform style and formatting, assembling supporting documents (bibliographies, CIOMS I, MedWatch forms, etc.) and managing the overall production .  Attend seminars to stay current with relevant global regulatory requirements and guidances regarding drug safety and pharmacovigilance.  Work in conjunction and effectively communicate with Product Monitoring, Medical Information, Regulatory Affairs (RA), International RA, Clinical Operations, Sales, Legal, Marketing, Quality Assurance and other department personnel.  Participate in team activities concerned with the safety, development or support of products as necessary.  Department specific/Non-essential responsibilities:  Other duties as assigned with or without accommodation.  Minimum Requirements  Experience / Skills:  Education:  Minimum of a Bachelor’s degree with a healthcare certification or required (i.e. RN, RPh, PharmD). Advanced degree preferred. Candidates with a related science degree and requisite pharmacovigilance experience are also considered.  Experience:  A minimum of 5 years clinical/practical experience in a relevant clinical environment required. A minimum of 3 years experience with reporting post-marketing adverse events in the pharmaceutical industry including experience with an industry standard drug safety database preferred. Thorough knowledge of US and ICH safety reporting regulations and guidelines. A knowledge of MedDRA and MedDRA search strategies. A understanding of the limitations of safety databases and spontaneous reporting. Strong project management and medical writing experience required.  Skills/Qualifications:  Knowledge of the clinical areas for which Mallinckrodt markets products.  Knowledge in the review and analysis of the medical literature.  Demonstrable skills in reviewing and summarizing medical records.  Excellent verbal and written communication skills including excellent telephone etiquette. Must be comfortable handling discussions with patients and health care providers on health and medical topics.  Strong experience in computer applications such as Microsoft Word, Excel, Microsoft Access, and Power Point, and a willingness to expand and increase competencies.  Extensive experience in the reporting as well as managing of adverse event reports.  Experience in writing safety summaries.  Other Skills:  Committed, self-motivated team player  Exceptional problem solving skills  Ability to meet the demands of a position in a dynamic organization  Ability to operate independently by planning, scheduling and arranging activities in accomplishing objectives.  Ability to meet internally and externally required deadlines  Outstanding organizational abilities"}