{"jobID": "2828421745", "jobLocation": "Sacramento_CA", "jobTitle": "Analytic Consultant 3 Speech Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.wellsfargo.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1852", "Type": " Company - Public (WFC) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Job DescriptionAt Wells Fargo, we want to satisfy our customers financial needs and help them succeed financially. Were looking for talented people who will put our customers at the center of everything we do. Join our diverse and inclusive team where youll feel valued and inspired to contribute your unique skills and experience.Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.The Payments, Virtual Solutions, and Innovation (PVSI) team includes Operations, Consumer Credit Card, Retail Services, Consumer Deposits, the Innovation Group, Treasury Management, Merchant Services and Wells Fargo Virtual Channels and the professional services teams that partner with these businesses. PVSI's focus is on delivering the next generation of payments and deposit capabilities and advancing our digital and online offerings to design new customer experiences and products. Its guiding principles are to start with the customer, move faster, and partner effectively.Wells Fargo Virtual Channels (WFVC) is part of the Payments, Virtual Solutions and Innovation (PVSI) business division. WFVC serves consumer and small business customers through digital (online, mobile, and social) and contact centers (phone, email, and correspondence). We provide customers with convenient ways to manage their accounts, enable digital payments, provide solutions that meet their financial needs, and more. WFVC serves over 27 million customers through our digital channels and support over 5.8 billion customer interactions annually through digital and contact centers.We are looking for an experienced analyst with a focus on contact center analytics and information technology to join the Speech Analytics Team. In this role you will specialize in analyzing customer/banker interactions from recorded calls using voice analytics technology.As an analytics consultant for our Spanish language queue, you will work closely with business managers and subject matter experts to understand their business objectives, needs, and priorities to perform the necessary analysis and produce the supporting details to make recommendations that will help drive improvements within WFVC. You will support the speech analytics manager in preparing and delivering executive-level presentations to communicate your findings and recommendations.In this role you will:Spend most of your time developing queries using Spanish words and phrases and listening to recorded calls in SpanishUtilize Speech Analytics technology to identify key insights derived from customer interactions primarily in our Spanish language queues and help transform those insights into recommendations for improvements within WFVCUnderstand and interpret results of complex speech analytics queriesPartner with vendor resources to refine and improve queries to maintain a high confidence level in the query resultsThe most successful candidate will have:Proven analytical and query building skills with the ability to frame issues and opportunities, get team commitment, draw out best ideas, and drive execution based on statistical analysis and trendsAdvanced knowledge of contact center technologyThe ability to understand various nuances of the Spanish language (e.g., slang, variations of phrases, etc.) that may occur in discussions between customers and phone bankersPresent and articulate findings using tools such as Excel and PowerPointImportant Notes:During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume prior to submitting your application for consideration. If you are a Wells Fargo Team Member, in your Jobs Profile ensure that your email address is valid and updated to an address that can receive external emails outside of the banking network and is a different email address than the one you originally used when you joined Wells Fargo. Initial contact with you will be made via e-mail. Please check your e-mail regularly for updates.Depending on the volume of applications received, this job posting may be removed prior to the indicated close date. If you do not apply prior to the closing of this posting, we encourage you to apply for other opportunities with Wells Fargo Bank.Required QualificationsBilingual speaking, reading, and writing proficiency in Spanish/English5+ years of reporting experience, analytics experience, or a combination of both; or a BS/BA degree or higher in a quantitative field such as applied math, statistics, engineering, physics, accounting, finance, economics, econometrics, computer sciences, or business/social and behavioral sciences with a quantitative emphasis and 3+ years of reporting experience, analytics experience, or a combination of bothDesired QualificationsExperience using speech analysis technologyAdvanced Microsoft Office (Word, Excel, Outlook and PowerPoint) skillsOutstanding problem solving skillsStrong presentation skillsStrong root cause analysis skillsKnowledge and understanding of database querying and creating ad hoc reporting results using SQL or similar querying methodsAbility to create and deliver dynamic presentationsExperience conducting root cause analysis for data-driven process-related improvementsExcellent verbal, written, and interpersonal communication skillsExtensive knowledge and understanding of research and analysisStrong analytical skills with high attention to detail and accuracyOther Desired QualificationsExperience providing analytical support to multiple business lines in a contact center environmentKnowledge and understanding of Nexidia Speech AnalyticsExperience using data visualization tools such as MicroStrategy or Tableau including report creation, dashboards, and graphical data representationStreet AddressSD-Sioux Falls: 301 E 58th Street North - Sioux Falls, SD MN-Shoreview: 1801 Parkview Dr - Shoreview, MN CA-Sacramento: 2125 Butano Drive - Sacramento, CA TX-Westlake: 1301 Solana Blvd - Westlake, TX UT-Salt Lake City: 5201 Amelia Earhart Dr - Salt Lake City, UT SC-Columbia: 101 Greystone Blvd - Columbia, SC VA-Roanoke: 7711 Plantation Rd - Roanoke, VA NC-Charlotte: 401 S Tryon St - Charlotte, NC CA-Oakland: 1901 Harrison St - Oakland, CADisclaimerAll offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act.  Relevant military experience is considered for veterans and transitioning service men and women.  Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation."}