{"jobID": "2822957646", "jobLocation": "Wixom_MI", "jobTitle": "Maintenance Coordinator", "companyRating": "3.7", "companyInfo": {"Website": "www.synovos.com", "Headquarters": "Radnor, PA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Summary: The Maintenance Coordinator role serves as the principal liaison between EHSS and facility contractors while performing specific scheduled maintenance duties. The Coordinator is focused on Maintenance and Reliability improvements and EHSS enforcement by all facility contractors. This role supports the client EHSS Manager in ensuring the efficient running of the facility. Essential Duties:Support oversight of contractors for completion of work at the site in the areas of HVAC, construction, and other contracted facility servicesPerform basic general PM including filter changes, belts, hoses and light bulbsSupport client through monitoring and oversight of completion of contractors’ work at the siteKeep current on client’s site plan maintenance needs weekly, monthly and quarterly on machinesAssist in monitoring and inspection of equipment for normal function between scheduled plant maintenanceProvide input to development and implementation of elements of the site SHEMSSupervise contractors resolving any issues or problems as identified and communicate regularly with client EHSS manager and Synovos Program Manager to keep all parties updated. Escalate critical issues as necessary Required SkillsKey RequirementsDegree in Mechanical Systems preferred; High School diploma requiredTechnical Certifications a plusComputer proficiency in Microsoft Office products; ability to understand and work inFacility Mechanical SystemsMinimum three years’ experience in Facility Maintenance and SchedulingLeadership experience and supervising direct or indirect reportsStrong communication skills, both written and verbalExcellent customer service and customer relationship management skills Required ExperiencePhysical RequirementsFrequent walking and standingUse computers for recordkeeping, using keyboard, mouse and repetitive or fine hand movementAbility to lift and carry up to 40 pounds unassisted and up to 80 lbs. assistedAbility to obtain forklift license and use hand trucks, forklifts, hoists, conveyors, or other handling equipment to move material within the storage facility in excess of 40 lbs.Often reaching, bending, stooping, and twisting to handle inventory Job Location  Wixom, US-MI "}