{"jobID": "2560055874", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.generaldynamics.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1952", "Type": " Company - Public (GD) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " Job DescriptionGeneral Dynamics Health Solutions/ARMA would like to meet candidates interested in human performance and behavioral health careers. Schedule a time to talk to us at one of our Virtual Job Fairs, Oct. 24-26. Please schedule a time that works best for you. Interviews can be done from the comfort of your home, car or on a work break. We are excited to talk with you!!  Click here to set up your virtual interview.  General Dynamics Health Solutions/ ARMA has an opening supporting the DOD Human Performance and Behavioral Health Services.  GD Health Solutions/ARMA have an exciting opportunity for individuals who are interested in supporting warriors with increased combat effectiveness, resiliency to show a measurable reduction in down time and create optimal performance on the targets. Additionally, this position will help to support and build stable families and support systems.  General Dynamics Health Services / ARMA has an opening for a Data Scientist:  The Data Analyst, also referred to as the Data Scientist, shall be proficient at entering, cleaning, and conducting basic data manipulation and analysis.  Operating in consultation with program staff and the Government’s biostatistician, the data scientist shall build and disseminate databases and spreadsheets designed to record related programmatic dataThe contractor shall provide consultation and assistance to supported units and staff to identify opportunities and methods for capturing data relating to programs and initiatives. The contractor shall prepare reports and presentations that accurately convey data trends and associated analysis.Education Bachelors (BA/BS) in quantitative science, social science or related fieldQualificationsTS/SCI Clearance for Ft. Bragg locations; SECRET for all other locationsThe contractor shall possess a bachelor’s degree in quantitative science, social science or related discipline.The contractor shall be proficient with the suite of Microsoft Office programs, including Word, Excel and Access.The contractor shall have a basic proficiency with commonly used statistical software application (e.g. SPSS, SAS, and R).The contractor shall possess excellent communication skills and shall be highly detail oriented and organized.Proficiency may be demonstrated through work history or a history of publications or a combination thereof.As a trusted systems integrator for more than 50 years, General Dynamics Information Technology provides information technology (IT), systems engineering, professional services and simulation and training to customers in the defense, federal civilian government, health, homeland security, intelligence, state and local government and commercial sectors. With approximately 32,000 professionals worldwide, the company delivers IT enterprise solutions, manages large-scale, mission-critical IT programs and provides mission support services. GDIT is an Equal Opportunity/Affirmative Action Employer - Minorities/Females/Protected Veterans/Individuals with Disabilities.#CJPOST#DICE#CB"}