{"jobID": "2837882917", "jobLocation": "Rockville_MD", "jobTitle": "Data Analyst - Rockville Regional Offices", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "68000", "jobDescription": " The data analyst is responsible for providing analytical support to all HP PMO functional areas including project management, training and process improvement. This includes performing statistical analysis on sets of health plan departmental data and creating appropriate graphical displays to share pertinent data with key audiences. It also includes partnering with Executive Consultants, process improvement consultants and business analysts to provide additional analytical support as needed which may include data gathering and coordination with key stakeholders to gain access to relevant data. Essential Functions: Performs analysis on sets of health plan data and indicates key trends in the data analysis. Responsible for understanding data and its relevancy to the project or business environment. Uses a variety of tools to extract data.  Creates visual charts and graphical data displays in a way that is easy to read and interpret by end user.  Leads data collection and analysis for HP PMO department.  Partners with other analysts and data owners throughout the organization to decipher data requirements on behalf of HP PMO.  Contacts key individuals in the organization to assist in data gathering efforts.  Coaches and informs key stakeholders and HP PMO staff on analytical methodologies and data analysis techniques.  Recognizes, and works effectively, in complex, political, and ambiguous situations. Uses organization and personal influence strategies to encourage desired behavior among those involved to reach goals of project.  Perform other duties as assigned. Basic Qualifications: Experience  Minimum five (5) years of analytical experience required, preferably within a health care environment.  Minimum two (2) years of experience with statistical/data analysis required. Education Bachelor's degree in statistics, business administration, mathematics or related field OR four (4) years of experience in a directly related field.  High School Diploma or General Education Development (GED) required.  License, Certification, Registration  N/A Additional Requirements: Excellent communication and interpersonal skills required.  Exceptional analytical skills and project tracking skills required.  Mastery with key analytical software (i.e. Microsoft Excel, Chart Runner, Minitab, etc.) and Microsoft Office tools required (Project, Word, PowerPoint, Excel).  Proven track record of providing quality and accurate data analysis required. Preferred Qualifications: Minimum five (5) years of data analysis experience in a health care project management environment preferred.  Master's degree in business administration, mathematics or related field preferred.  Knowledge of health care operations preferred.  Knowledge of Six Sigma methodologies preferred. "}