{"jobID": "2591206139", "jobLocation": "San_Jose_CA", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": null, "jobDescription": " In the mission towards continuously promoting consumer creativity and imagination, Adobe has recently launched the Emerging Product Group to explore next-generation product opportunities empowered by artificial intelligence. We are looking for creative and self-motivated talent to fit in the position of Computer Scientist to help drive forward our mission. As a computer scientist, you will work closely with other researchers and engineers on exploratory projects that directly impact millions of customers. Individuals in this role are expected to have strong expertise on machine learning, optimization methods and computational statistics with an emphasis on their applications of real-world scenarios. The ideal candidate will have a strong interest on solving challenging optimization problems and prototyping for real-world applications.  What you’ll do Our team works like a startup inside Adobe, making this is a unique “best of both worlds” opportunity. If you’d love the flexibility and personal impact of joining an exciting startup but also dream of having the deep resources, cool perks and global launch stage that only an industry leader like Adobe can offer, this is where you belong.You’ll have strong input on the direction of this new product category while working directly with the experienced startup entrepreneurs leading this project.Understanding of core CS including data structures, algorithms and concurrent programmingCollaborate with other researchers, engineers, designers, and product managers.Make an impact while building a rewarding career at a new growing division within Adobe What you need to succeed M.S. or Ph.D. in Computer Science, Electronic Engineering, Statistics, Applied Mathematics, or related technical fields.Strong passion for algorithm prototyping, software engineering, and product development.Extensive experiences solving challenging real-world data driven problems with machine learning and/or deep learning.Strong programming skills in C/C++ and python.Ability to work independently and strong communication skills within and across teams. At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status.Adobe"}