{"jobID": "2835261072", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Data Scientist Engineer (Statistical & Python exp)", "companyRating": "3.4", "companyInfo": {"Website": "www.xoriant.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "133000", "jobDescription": "Job Title –Sr. Data Scientist Engineer (Statistical & Python Must)Duration: 1+ Yrs.Location: Mountain View, CAMode of interview – Face to faceABOUT CLIENT IT's a fast growing, venture backed and operationally profitable FinTech startup with offices in San Francisco, CA and Mountain, CA. We are looking for a talented Data Scientist who can help fuel our growth by leading data science deliverables. As a leader in our engineering organization, you will have the opportunity to build a world-class recommendation engine that will provide customized experiences for our users. We are one of the fastest growing startups in personal finance space that is revolutionizing the way people maintain and improve their credit and loans to save money. Located in Downtown Mountain View and San Francisco, and backed by top tier investors, we are a game changing company with a disruptive technology and analytics. JOB DESCRIPTION Use predictive modeling to build data-driven insights to improve insights for prospective and current customers Serve as a champion of sound decision-making at all levels of the company  Desired Skills and Experience 3-5 years of experience in Data Science B.S. in engineering, applied math, statistics or other quantitative field; M.S or PHD preferred Strong in Python, statistical analysis, tools and modeling Industry experience in mining data, performing feature reduction, building models and externalizing them for production environment Strong oral and written communication skills; extremely attentive to detail Ability to thrive in a fast-paced startup environment  ///////******Any query please call on 408 550 1287********////////////- provided by Dice  5 yrs Data Scientist , M.S/Phd , Statistical , Python"}