{"jobID": "2801924535", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.fibroblast.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description The Data Scientist will work on Fibroblasts initiatives in the areas of advanced analytics, business intelligence, client reporting solutions, algorithm development, and machine learning. This position reports to the Lead Data Scientist under the Product group. While this position may require some travel (1-2 days / month), the candidate must live in the Chicago area. You are responsible forDevelopment of advanced analytics on proprietary application data, healthcare claims data, and other integrated data sources in service of our analytics products and services:Advanced data mining and normalization of large healthcare claims data sets across multiple sources and formatsTechnical design and implementation of data sets and models to further our product offering in the areas of machine learning and algorithm developmentRoutine and ad-hoc reporting on customer dashboards, business insights, and performance reportsDevelopment of internal operational dashboardsContinued development of our data visualization/presentation methodology and deliveryContinued development of our analytics technical infrastructurePresent complex analytics deliverables in a clear and concise manner to non- technical customer stakeholders.Collaborate with contractors and/or vendor resources on data projects as needed To succeed in this role, you should have the following skills and experience Bachelors or Masters degree in Math, Statistics, Computer Science, Artificial Intelligence or other related fieldExperience in the healthcare industry or work with health care data such as claims, EMR exports, etc.At least 3+ years experience with advanced statistical analysis, data modeling, predictive modeling, machine learning, ETL process, and data mining in application to real-world problems using large healthcare data sets.Strong data engineering skills including: database architecture, data warehousing, SQL, Hadoop, Python, C/C++, Perl, MatLab, SAS, R, EDM, Amazon S3Strong experience with BI data visualization tools such as Tableau, Qlik, Domo, Highcharts, etc.Experience with customers and conducting presentationsStrong ability to actively participate in Project PlansStrong written and verbal communication skills What were offering Competitive salaryStock options in a growth-stage companyMedical, dental, and vision insuranceLife insurance, disability benefits, and 401k RetirementUnlimited vacationHigh-energy work environments at our office in MATTER, a community of over 200 healthcare focused companiesMembership at MATTER, providing:Participation in a strong community of start-up entrepreneurs and engineersFree access to MATTER networking and educational eventsOpportunities to access and build relationships with MATTER mentors and industry and investor partnersThe latest equipment including Macbooks and large monitorsWeekly sponsored team happy hoursTons of snacks and catered lunch weeklyDiscounts on tons of useful services (Zipcar, etc.) About Fibroblast  Fibroblast automates the referral and population health management processes by empowering providers and their administrative staff with an easy to use, end-to-end referral management platform. Our secure, HIPAA-compliant platform enables office staff to source referrals and schedule provider appointments at the point of care. Fibroblast can be used as either as a stand-alone solution, or tightly integrated with existing EMR, PM, eMPI, analytics, or disease registry systems as desired. Fibroblasts proprietary, intelligent patient-provider matching algorithm takes into account a variety of variables to drive referrals to the most appropriate in-network providers delivering the highest quality, lowest cost care.  To learn more, please visit http://www.fibroblast.com"}