{"jobID": "2764007138", "jobLocation": "Dallas_TX", "jobTitle": "Senior Data Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.neimanmarcus.com", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": "COMPANY OVERVIEWFor over a century, Neiman Marcus Group has served the unique needs of our discerning customers by staying true to the principles of our founders: to be the premier omni-channel retailer of luxury and fashion merchandise dedicated to providing superior service and a distinctive shopping experience in our stores and on our websites. Neiman Marcus Group is comprised of the Specialty Retail Stores division, which includes Neiman Marcus and Bergdorf Goodman, and our international brand, mytheresa.com. Our portfolio of brands offers the finest luxury and fashion apparel, accessories, jewelry, beauty, and home décor. The Company operates more than 40 Neiman Marcus full-line stores in the most affluent markets across the United States, including U.S. gateway cities that draw an international clientele. In addition, we operate 2 Bergdorf Goodman stores in landmark locations on Fifth Avenue in New York City. We also operate more than 40 Last Call by Neiman Marcus off-price stores that cater to a value oriented, yet fashion minded customer. Our upscale eCommerce and direct-to-consumer division includes NeimanMarcus.com, BergdorfGoodman.com Horchow.com, LastCall.com, and CUSP.com. Every day each of our 15,000 NMG associates work towards the goal of enabling our customers to shop any of our brands \"anytime, anywhere, and on any device.\" Whether the merchandise we sell, the customer service we offer, or our investments in technology, everything we do is to enhance the customer experience across all channels and brands.Job SummaryNeiman Marcus Group has an immediate opening for a Senior Data Engineer reporting to a Director of Advanced Analytics. This position performs data engineering functions to facilitate data scientists and analysts develop insights into customer behavior to enable decision making relating to promotions, events and marketing programs for all brands both in stores and online.Job DutiesLead data engineering activities in data science projects while collaborating with team members and multi-organizational stakeholders.Partner with internal and external entities to acquire and delivery dataPerform hands-on aggregation, extraction, transformation, and loading of data from multiple internal and external sources Support in the development and/or implementation of predictive models, natural language processing, segmentation strategies, optimization algorithms, and data mining analysesSupport in data transformation and feature engineering for the development of Artificial Intelligence/Machine Learning models.Job RequirementsExperience in data aggregation, ETL, delivery, and governanceStrong in data cleaning, shaping, and wrangling Strong coding skills in SQL; and Python, Java, or ScalaStrong shell scripting and system admin skills in Unix/Linux Experienced in working with enterprise data warehouse and HadoopExperience in working with distributed computing i.e. Hive, Apache SparkExperience in working in cloud environment such as AWS to manage dataPerform data processing in both enterprise data warehouse and Hadoop environmentsAbility to fine tune Hadoop processes to improve end user experience and computing performanceEager to learn machine learning and deep learning to progress towards data science track.Exceptional standards for quality and strong attention to detailExperience with full lifecycle agile application development in supporting analytic requirementAbility to manage multiple projects and business requestsA Bachelor’s or Master’s degree in Computer Science, Computer Engineering, or other STEM related fields"}