{"jobID": "1934957830", "jobLocation": "Houston_TX", "jobTitle": "Business Analyst- Associate Data Management", "companyRating": null, "companyInfo": {"Website": "www.globalnest.com", "Headquarters": "Morganville, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job title: Business Analyst- Associate Data ManagementDuration : 12 MonthsLocation : Houston TX The Associateof Data Management will develop knowledge of the various EDI, email and webscraper transactions between Constellation and the utilities serving our customers, as well as the flow of transactions through Constellation’s billing, customer relationship management (CRM), and pricing applications.  Perform responsibilities in compliance with all key company controls (Sarbanes-Oxley).  Exercise independent judgment to investigate and resolve issues related to customer historical and monthly usage. Work with senior team members to compare and evaluate alternative courses of action. Independently execute appropriate course of action to fully resolve issues. Significant issues frequently include, but are not limited to: obtaining missing data related to account attributes or usages, analyzing and validating data discrepancies and resolving various system generated work queues due to data failing the usage process flow.  Monitor transactions received from Utilities and EDI vendor to ensure account attributes and usages are accepted timely, accurate and completely.  Monitor utility transaction requirements for rule and business process changes of material significance that affect Client systems and processes.  Professionally represent Client in handling and resolving customer issues related to account attributes and usage with utility supplier support teams.  Apply knowledge on cross functional teams and projects across the organization.  Demonstrate flexibility and aptitude for quick learning by cross training across multiple regions. Regulated and/or deregulated energy industry experience a plus.Knowledge of Retail Power “Order to Cash” processes and associated risks.Microsoft Excel, Access, SQL, Siebel and Lodestar experience preferred"}