{"jobID": "2797076738", "jobLocation": "Sterling_Heights_MI", "jobTitle": "Configuration Data Management Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.baesystems.com/us", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Northrop Grumman, Lockheed Martin, Raytheon"}, "estimatedSalary": "51000", "jobDescription": "Job Description Ensure application of organizational Data Management (DM) processes to program in accordance with DM plan. Perform DM tasks that include monitoring the review and approvals Contract Data Requirements List (CDRL) to ensure they are approved and delivered to the USG customer on schedule.  Work with various team members in supporting and maintaining program PDM (EPDM/WindChill) System file structures, workflows and ensure accuracy of links to the program electronic notebook system. This includes development and maintenance of the program DM plan and data management training materials.  Ensure proper training regarding processes, data markings, contract requirements and review/approval process is completed and complied with. This includes Supplier Data Requirements List (SDRL) requirements.  Review contracts requirements regarding Contract Data Requirements List (CDRL), data markings and data assertion rights. Work the team members regarding those requirements, training and compliance.  Support the delivery of the Technical Data Package (TDP) and maintenance of the TDP. Support ISO, CMMI, Defense Contract Management Agency (DCMA), Quality and corporate audits. Prepare and support CM CDRL deliveries.  Perform data management activities related to the design, development and production of complex systems and equipment primarily for the US government customer. Typical Education & Experience Typically a Bachelor's Degree and 2 years work experience or equivalent experience Required Skills and EducationBachelors degree preferably in a technical discipline with a minimum of 2 years of relevant experience; or an Associates degree with 4 years of relevant experience. DoD experience preferred.Working knowledge of relevant data management and configuration management, such as:Military standards including: MIL-HDBK-61A, MIL-STD-31000Industry standards including: EIA-649B, ISO 10007, CMMIDrawing standards including ASME standards such as MIL-STD-100.Excellent computer skills with MS Office suite to prepare appropriate reports and documents.Preferred Skills and EducationFormal training in Data Management (DM).The motivation to maintain proficiency and professional currency in the discipline.Ability to communicate effectively both orally and in writing.Attention to detail, coupled with good time management and organization skills.Sound interpersonal skills for interfacing and coordinating with company personnel, customers, and suppliers.Ability to make decisions using sound judgment while complying with policies, procedures, appropriate principles and applicable state and federal laws and regulations.Ability to develop and maintain professional and effective relationships with internal and external customersAbout BAE Systems Platforms & Services BAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services. Platforms & Services designs, develops, produces, supports, maintains, modernizes and upgrades armored combat vehicles, wheeled vehicles, naval guns, surface ship combatants, commercial vessels, missile launchers, artillery systems, military ordnance, and protective wear and armor. Equal Opportunity Employer: Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity/Gender Expression"}