{"jobID": "2837271900", "jobLocation": "Cerritos_CA", "jobTitle": "Healthcare Data Analyst Consultant", "companyRating": null, "companyInfo": {"Website": "www.judge.com", "Headquarters": "Wayne, PA", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Adecco, Kforce"}, "estimatedSalary": null, "jobDescription": " Our client is currently seeking a Healthcare Data Analyst Consultant in Cerritos, CA. This job will have the following responsibilities:Collaborates with the data warehouse analysts in the establishment and adherence to business rules.Provides business knowledge regarding the appropriate use of data elements and cooperates with reporting personnel from other areas to establish and maintain these common business rules.Tracks and prioritizes projects through coordination and negotiation with client to improve the efficiency of information/project plan generation.Evaluates and triages potential projects and studies based on the value, cost benefit analysis and the urgency of the request.Performs strategic data analysis (data mining) and research as appropriate to support business needs (e.g., disease management, provider profiling, etc.).Develops good understanding of relevant business processes, goals and strategy in order to provide analysis and interpretation.Collaborates with business user to define media, frequency and audience for distribution of information.Develops action plans to address areas for improvement identified through data analysis and business expertise and communicates action plans to client.May assist in the planning of initiatives to address areas for improvement.Qualifications & Requirements:Requires a BS/BA degree; at least 3 years related experience in analysis and reporting.Knowledge and understanding of data warehouse data structures and data flows and standard Business Information tools and programming/query languages.Excellent communication skills.Must have experience with SSRS, Tableau, and SQL Server Management StudioJudge Group Job Order ID: 575223 Salary: Open  Company Description:Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.  The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}