{"jobID": "2754855996", "jobLocation": "Allendale_NJ", "jobTitle": "QC Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "QC Scientist We are seeking a highly motivated QCScientist who is interested in joining our fast-paced, dynamic environment.  The QC Scientist will be a member of the HCATS Quality Control Department. The QC Department is responsible for the validation life cycle of quality control methods covering a wide array of techniques. The QC Scientist will be responsible for performing GMP laboratory testing in the areas of flow cytometry, cell viability, cell counting and sorting, endotoxin testing and additional bioassay related analysis. The QC Scientist will perform clinical laboratory tests according to effective Standard Operating Procedures and approved protocols including maintaining equipment and records by following Good Documentation practices. The Quality Control Scientist will also lead and execute method qualification as a part of technical transfer activities from Product Development to the QC laboratory. The successful candidate must be able to work collaboratively with other team members across sites and projects. This position is based in Allendale, NJ.Responsibilities:Support internal and external customers to ensure that proper and timely execution of all aspects of the clinical analytical method life cycle across HCATS clients.Support routine GMP testing as assigned. Mentor and train team membersEvaluate corporate and regulatory requirements along with coordination of activities for implementation of these requirements.Write the contents of Analytical Method Transfer and Validation life cycle documentation including master plans, protocols, test methods, and reports.Create validation project plan i.e., timelines and resources and provides status updates to management. Utilize statistical tools for evaluation of method validation and trending data.Identify, evaluate, and implement continuous business process improvements.Perform troubleshooting activities with respect to methods/assays, equipment malfunctions and investigations (Deviations and OOS).Provide support during laboratory investigations.Train QC personnel during method transfer and validation. Provide support during equipment qualification.Consistently produce high level of documentation accuracy and clarity according to cGMP documentation practices.Ability to set deadlines and prioritize work for self, group members, and support groups involved. Ability to review/approve work performed by coworkers for accuracy and alignment with procedures.Knowledge and Experience:BS in analytical chemistry or other scientific field with 8 years of experience in the areas of method development, validation, and transfer; or MS/Ph.D. in Analytical Chemistry or other scientific field with demonstrated experience in Quality Control laboratories for biotechnology products.Direct GMP Experience, Proficiency in project management skills and toolsStrong background and in-depth knowledge in analytical chemistry e.g. Flow Cytometry, ELISA, HPLC, CE, PCR, etc.Must have extensive knowledge and experience of QC assay development, transfer and validation, along with cGMPs.Strong Quality orientation with attention to detail required. Analytical and problem solving skills required.Excellent communication skills, both written and verbal, with all levels of the organization, including the ability to state opinions clearly, ask questions, seek clarification, communicate facts objectively, challenge when appropriate, and pursue issues to resolution.Excellent presentation skills. Ability to communicate to upper management, across departments and within the immediate QC team.Ability to create and manage work plans and timelines and independently manage competing priorities with limited instruction.Highly motivated individual with good interpersonal skills that have proven effective in managing relationships and negotiating solutions while maintaining a level of approachability with colleagues both internal and external.Flexible and able to adapt to company growth and evolving responsibilities.Candidate Profile:Strong business acumenRelevant IT skills (able to work with Visio, Microsoft Project and Excel)Ability to think strategically and tactically (detail-oriented)Strong collaborative and influencing skills and ability to work well in a cross-functional, matrixed environmentMust have the ability to handle multiple priorities, maintain confidentiality and interface with individuals from various departments and various companies at various levels.Must be flexible and will be expected to contribute to an exciting, productive and scientifically rigorous working environment with flexible working schedules.Ability to work in a fast-paced environment in results oriented fashionStrong team-oriented, interpersonal skills are essentialAnalytical and problem-solving skillsStrong written and oral communication skillsExcellent organizational skills and attention to detailMeeting management/facilitation skills/teamworkAbility to multi-task is essentialFlexible and able to adapt to company growth and evolving responsibilitiesMeets the Following Quality Standards:Each employee is to practice teamwork and lateral service to create a positive work environment.Each employee will understand his or her work area at HCATS, a Hitachi owned company, goals as established in the strategic plan.All employees will understand the needs of their internal and external customer so that we can deliver the service they expect.Uncompromising levels of cleanliness is the responsibility of every employee.Each employee will use proper telephone etiquette in representing the company.Each employee is responsible to take pride and care in his or her personal appearance. All clothing and uniforms are to be clean.All employees are to know their roles during emergency situations and are aware of fire and life safety response processes.All employees are to notify their supervisor immediately of hazards, injuries, equipment or assistance that they may need in performing their job functions.All employees are to keep proper maintenance and repair of all company equipment and notify their supervisor of any issues.Protecting the assets of HCATS, a Hitachi owned company, is the responsibility of every employee.Each employee will take personal responsibility for his/her timeliness and attendance record to ensure an efficient company.All employees will sign and adhere to the company's Confidentiality Agreement.About Us Hitachi Chemical Advanced Therapeutics Solutions, LLC (formerly PCT Cell Therapy Services, LLC), is an industry leader in contract development and manufacture of cell therapy products. PCT works with its clients to overcome the fundamental challenges of cell therapy manufacturing by providing a wide range of innovative services including product and process development, full scale cGMP/GLP manufacturing, engineering and automation, cell and tissue processing, logistics, storage and distribution, as well as expert consulting and regulatory support.  Our mission is to provide our clients with high quality, scalable, innovative, reliable, and cost efficient manufacturing platforms and services to advance commercialization of cellular therapies. We are in the business of developing innovative service products for cell therapy manufacture; selling these to senior leaders in charge of development programs in collaboration with their subject matter experts; and delivering these service products for the development and execution of cell-based therapy manufacturing directly to clinical and commercial development teams around the world.  Please connect with us on LinkedIn at https://www.linkedin.com/company-beta/94955/jobs/  Follow us on Twitter @PCTcelltherapy"}