{"jobID": "2836366259", "jobLocation": "San_Diego_CA", "jobTitle": "Bioinformatics Scientist 1", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "112000", "jobDescription": "ResponsibilitiesIllumina develops tools for the discovery of genetic variation and the analysis of its biological significance. The Application Informatics group is involved in a diverse range of bioinformatics activities within Illumina, including targeted sequencing, RNA sequencing, and genotyping bead arrays. Members of the team work in close collaboration with wet lab scientists to support and optimize assay development. In addition, the team is responsible for defining and creating workflows that enable simplified analysis of customer data, integrating best-in-class community tools as well as developing new methods and algorithms. Team members also translate these analysis workflows into Illuminas cloud computing environment. The ideal candidate will be able to work in a cross functional team, translating the challenges faced by the group into bioinformatics solutions. The position requires a strong background in both statistics and algorithms development. We are seeking an exceptional individual to contribute to innovative methods which transform sequencing results into discoveries and clinical insight to improve patient care, with a focus on long read technologies.RequirementsStrong background in algorithms and software developmentNext Gen sequencing technology, tool usage, and data analysisUnderstanding & usage of biostatistics and bioinformatics algorithmsCritical problem solving and data analysisProficiency in programming in C, C++, C#, or JavaScripting experience with Python, R or PerlSuperior written and verbal communication skillsEducationMasters or PhD in computer science, bioinformatics, or equivalentBiology knowledge strongly preferred Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at 858-255-5081. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}