{"jobID": "2733359345", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.bmoharris.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1882", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " J.P. Morgan, Bank of America, U.S. Bank"}, "estimatedSalary": "85000", "jobDescription": "Assist the US Corporate Treasury team, with developing, enhancing, implementing and maintaining enterprise-wide quantitative risk and financial forecast modeling used in the CCAR, asset & liability management, and stress testing process. This involves analyzing large financial data sets, developing leading model methodologies, and applying those methodologies to build robust forward looking models that link macro-economic variables and other business drivers to project business activity and profitability. The individual will also provide input to the framework for model development, including financial forecasting principles and standards, ensuring understanding, acceptance and mitigation of risks from the use of models, and the corresponding roles and responsibilities inherited from such use. The details are summarized as follows:Analyze financial data to extract relevant information that can help Line of Business and Treasury to better manage multiple financial products and processes.Develop and maintain various quantitative CCAR, asset and liability management assumption, and stress test models. The model building includes, but is not limited to the acquisition of financial data (internal and/or external), analyzing the data, design and implementation of multiple models that are linked to macroeconomic scenarios as provided by the Federal Reserve or internally developed by the bank, or that quantify the behavior of products in varying economic conditions over time. Recommend potential model methodologies and develop models for forecasting asset balances (including loans and deposits), loan spreads, funding costs, noninterest income and noninterest expense based on macroeconomic scenarios.Document and communicate model results and methodologies to external and internal stakeholders, in clear and concise fashion, both verbally and in written form.Skills:3 years of strong hands-on computing development skills, particularly statistical and database modeling tools (SAS, R, SQL, Python, Hadoop, Access/VBA etc.), ability to adapt to various programming languages and environments.Strong data analysis skills, dealing with large data sets to extract relevant information.Effective presentation and communication skills; Ability to convey complex concepts and outcomes to non-subject matter experts. Experience with statistical/econometric modeling techniquesEducation and Accreditations: Master’s degree in a quantitative field (Statistics, Mathematics, Engineering, Economics, Mathematical Finance) and/or combination of quantitative and business degrees preferredInterest in financial products and aptitude to learn We’re here to helpAt BMO Harris Bank we have a shared purpose; we put the customer at the center of everything we do – helping people is in our DNA. For 200 years we have thought about the future—the future of our customers, our communities and our people. We help our customers and our communities by working together, innovating and pushing boundaries to bring them our very best every day. Together we’re changing the way people think about a bank.As a member of the BMO Harris Bank team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one – for yourself and our customers. We’ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we’ll help you gain valuable experience, and broaden your skillset.To find out more visit us at https://bmoharriscareers.com.BMO Harris Bank is committed to an inclusive, equitable and accessible workplace. By learning from each other’s differences, we gain strength through our people and our perspectives. BMO Harris Bank is an Equal Opportunity Employer for all, inclusive of Minorities, Women, Veterans, and Persons with Disabilities."}