{"jobID": "2836628857", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.imcworldwide.org", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " International Medical Corps is an Equal Opportunity Employer.  Start Over with Job Search If you already have a profile? Please login here  18-157: Data Analyst  Country:Los Angeles, CA or Washington, DCDepartment:Human Resources Essential Job Duties/Scope of Work:  Management and coordination: Effective policy development and implementation; Cooperative arrangements; Dedicated department / focal point committed to PSEA.  Engagement with and support of local community population: Effective and comprehensive communication from HQ to the field on (a) what to do regarding raising beneficiary awareness on PSEA and (b) how to establish effective community-based complaints mechanisms.  Prevention: Effective and comprehensive mechanisms to ensure awareness-raising on SEA amongst personnel; effective recruitment and performance management.  Response: Internal complaints and investigation procedures are in place  Main Responsibilities  Works with all departments to ensure continuous improvement in reinforcing processes to protect employees, volunteers and beneficiaries with regard to SEA and Safeguarding violations Supports internal PSEA and Safeguarding investigations.Reviews information related to incoming allegations to determine preliminary assessment of the caseEnsures that PSEA and Safeguarding tracker system and follows up with investigators on a regular basis to ensure that data is up to date and correctAnalyses data and prepares reports to determine trends in types and numbers of allegations, common issues and potential risks as required.In conjunction with Compliance unit manages and continuously improvesNavex/Ethics point reporting systemRemains up to date with relevant trends and activities with regard toSafeguarding and SEA globallyMaintains complete confidentiality with respect to the information acquired through the compliance process and all associated activitiesQualifications:Advanced degree with proven experience in data collection;Proven ability to handle and deal with sensitive information;Previous experience with employee investigations;Demonstrated report writing skills;Ability to display data and trends from employee investigation reports."}