{"jobID": "2816494719", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - California", "companyRating": "3.3", "companyInfo": {"Website": "www.teradata.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (TDC) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " EMC, IBM, Oracle"}, "estimatedSalary": "180000", "jobDescription": "Senior Data Scientist Data Scientists at Think Big Analytics help our customers solve some of the most challenging business problems using machine learning and artificial intelligence. We are partners in our customer's success, focusing on delivering insights and value that impact their business. We simplify the complexity around data science, helping C-level executives as well as data science practitioners navigate the highly dynamic field. We are looking for experienced, hard-working and talented Senior Data Scientists that have a passion to help businesses have a positive impact lives of millions of people every day. Join us in our pursuit for wisdom. Key Responsibilities:Lead and mentor a distributed team of data scientists and developers to define and execute data science solutions that address client use cases and business requirementsBusiness development and sales by engaging prospective clients, developing proposals and guiding sales teams to promote data science consultingPerform hands on data exploration and modeling over a variety types of data (e.g. text, sensor, image, audio, etc.) using big data technologiesAnalyze business and operational data to identify and correct business problemsSimplify and communicate the complex to business leadersDevelop algorithms, platforms, and re-usable software, services and applicationsEngage brand building activities such as publishing and speaking engagementsBasic Qualifications: Bachelors in Computer Science, Engineering, Mathematics, Economics, Statistics, Finance, or related field. 4+ years relevant experience in predictive modeling and analysis. 4+ years of experience with machine learning, data mining, and analytics techniques 4+ years of experience in R, Python, Weka, SAS, Matlab or other statistical/machine learning software. Strong communication, analytical and collaborative problem-solving skills. Ability to travel to client sites as required.Preferred Candidate: MS/PhD in Computer Science, Engineering, Mathematics, Economics, Statistics, Finance, or related field. 2+ years of experience with software development, continuous development/integration, etc. Experience with AWS, Azure, Google Cloud or Oracle Cloud services (e.g. S3, Redshift, EC2, etc.) Experience with NoSQL, parallel or distributed programming (e.g. Hadoop/Spark) Experience with Graphical Processing Units (GPUs) and CUDA programming. Experience with one or more of these or similar Natural Language Processing, Computer Vision, Deep Learning, Speech Recognition and Statistical Optimization methods. Experience in business development and sales. Managing client relationships and leading additional sales activities.Experience managing or mentoring data scientists. *Our total compensation approach includes a competitive base salary, 401(k), strong work/family programs, and medical, dental and disability coverage."}