{"jobID": "2674302576", "jobLocation": "Washington_DC", "jobTitle": "Lead Data Analyst, Knowledge, Data, Learning, and Training Project", "companyRating": "3.8", "companyInfo": {"Website": "www.dexisonline.com", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " About UsSince 2001, Dexis has provided innovative management solutions for a secure and prosperous world. In the last three years alone, Dexis has worked in 90 countries supporting critical missions of agencies in the global development and security assistance space. With triple digit growth in recent years, Dexis was ranked in the top 10 consulting firms by funding at the US Agency for International Development in FY16 and FY17. Dexis was also among the highest rated employers on Glassdoor, where many of its 250-plus employees cited a people-centered leadership and culture as the main drivers to its success.  Dexis is seeking an experienced Lead Data Analyst for an anticipated five (5) year USAID funded Feed the Future Knowledge, Data, Learning, and Training (KDLT) Activity that will provide the USAID Bureau for Food Security (BFS), Feed the Future Missions, interagency partners, and implementing partners with concrete support and tools to capture, share, and access knowledge that helps improve the effectiveness of Feed the Future programs, leading to improved nutrition and reduced poverty in Feed the Future focus countries.  KDLT will serve as a specialized, responsive, and well-integrated mechanism to increase BFS' capacity for, and quality of knowledge-sharing, data management and analysis, organizational learning, and training, in support of adaptive management of Feed the Future, in alignment with the Global Food Security Strategy (GFSS).  This is a long-term position expected to start in September 2018. The position is contingent upon award.Responsibilities Provide on-demand, accurate data analysis and visualization to support learning and adaptive management of Feed the FutureManage and/or utilize large U.S. Government databases;Work with BFS to produce guidance on performance analysis by missions;Conduct on-demand quantitative and qualitative analyses of Feed the Future Monitoring System (FTFMS) data, internal performance management materials, external data sets, and USAID surveys and evaluations to provide context and inform potential program actions; help answer questions in the Feed the Future Learning Agenda; and provide input to strategic planning, policy development, performance monitoring and reporting, program design, speeches, Congressional inquiries, and other program documents related to the Feed the Future initiativeDevelop tools and methods for capturing and sharing knowledge from Feed the Future activities that are coming to a closeDevelop surveys and other feedback mechanisms to obtain stakeholder input on Feed the Future programsQualificationsA Master’s degree or higher in Data Analysis, Statistics, or related areasFour (4) years or more of relevant experience in data analysis in the international development sector;Demonstrated qualitative and quantitative analytical and visualization skills, including command of statistics, sampling methodologies, and use of data analysis software such as SPSS, STATA, NVIVO, etc.;Strong analytical, critical thinking, and communication skills to include technical writing and editing;Experience in the gender dimensions of data collection, evaluation design, and analysis;Knowledge of U.S. Government foreign assistance in agriculture and food security activities and policies preferred Dexis is an equal opportunity employer offering employment without regard to race, color, religion, sex, sexual orientation, age, national origin, citizenship, physical or mental handicap, or status as a disabled or Vietnam Era veteran of the US Armed Forces."}