{"jobID": "2819579571", "jobLocation": "San_Francisco_CA", "jobTitle": "Systems Specialist", "companyRating": "3.3", "companyInfo": {"Website": "www.eci.com", "Headquarters": "Boston, MA", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Position Summary: Systems Specialist is responsible for assisting with the implementation and proactive maintenance of all aspects of our clients’ technology. Act as a technical lead in selected service projects such as implementations, upgrades and relocations. Other responsibilities include troubleshooting service impacting issues, hardware/software installations and upgrades.As a Systems Specialist you will also be responsible for assisting Client Technology Managers and Senior Engineers to evaluate current infrastructure and create technology opportunities that will enable a client and ECI to be successful. Systems Specialists will regularly interface with high profile financial industry clients on a day to day basis thus requiring the highest level of presentation, communication and professionalism. Communicating and interfacing with various internal departments. It is expected that the Systems Specialist uses this opportunity to improve their skills and grow in their career Position Responsibilities: Assist CTM and/or Senior Engineer with project and service deliveryWork with services team for proactive management of client rosterContribute to the global committees and help with the development and writing of technical standardsUtilize and maintain both technical standards and client documentationAchieve metrics as set forth by the management team (e.g. billable utilization, client satisfaction)Act as an escalation point for junior level employees, and assist them with troubleshooting technical issuesParticipate in on-going training initiatives to improve skills by obtaining technical and/or non-technical certifications throughout the yearProvide technical coverage to clients either ad hoc or based on recurring schedule as requiredPerform planned and/or unplanned after-hours work for clients due to projects, emergencies, or the like Position Requirements: College diploma or University degree in the field of Computer Science or equivalent field and/or related experience with a minimum of 3 years of end user and server supportAdvanced Knowledge of Microsoft Windows Server, Active Directory and ExchangeExperience with MDM Solutions (Blackberry Enterprise Server, Good, Airwatch, MobileIron, and XenMobile)Experience using and troubleshooting Remote Access Services– Citrix XenApp, Citrix NetScaler, and Microsoft Remote Desktop ServicesExperience using and maintaining spam filtering technologies such as Symantec, Global Relay, Barracuda, Cisco IronPort, and Proof PointGood understanding of networking concepts, including LAN/WAN, DHCP, DNS, Routing, Switching and FirewallsConceptual understanding of cybersecurity best practicesExperience with building servers, both physical and virtualExperience with maintaining and troubleshooting Data Backup and Recovery with Symantec Backup Exec or similar Enterprise SoftwareGood knowledge of basic cybersecurity tools, including next generation antivirus, endpoint protection, DLP solutions and disk encryptionSome scripting knowledge, preferably with PowerShellExperience with Virtualization (VMware, Hyper-V, XenServer)Ability to adapt and learn new technologies based on business needs Working Conditions: Ability to work under a moderate noise level (i.e., working on an open floor with printers, telephones, and computers; or working in a datacenter)Ability to be flexible and successfully respond to multiple work pressuresWilling to work extra hours as needed; including late nights and weekendsSitting or standing for extended periods of timeDexterity of hands and fingers to operate a computer keyboard, mouse, power tools, and to handle other computer componentsThe majority of work will be performed at client locations which may vary in terms of quality of workspaceMust be able to lift, carry, and reposition all parts of user workstations, servers, network appliances, printers and other information technology equipment as requiredConsecutive hours spent at a time sitting in front of computer monitor and using keyboard and mouseCommuting from one client location to another as needed Preferred Skills: Financial Industry Experience including familiarity with market vendor applications (Bloomberg/Thompson Reuters)Understanding of the business and operations of an alternative financial firmAdvanced knowledge of AWS, Azure, Office 365. NOTE: This is not intended to be an all-inclusive job description. You may perform other related duties as requested to meet the ongoing needs of the organization.  We offer competitive salaries and our generous benefits package includes health and dental insurance at great employee rates, life insurance, short/long term disability, paid time off and holidays and performance incentives. Come work for the leader in cutting edge technology and see for yourself how we value our clients and employees alike.  ECI is an equal opportunity employer. In accordance with anti-discrimination laws, ECI prohibits discrimination and harassment of any type and affords equal employment opportunities to employees and applicants without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. ECI conforms to the spirit as well as to the letter of all applicable laws and regulations."}