{"jobID": "2797911208", "jobLocation": "Chicago_IL", "jobTitle": "Marketing Data Analyst Intern", "companyRating": "4.2", "companyInfo": {"Website": "www.maestrohealth.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zenefits"}, "estimatedSalary": "40000", "jobDescription": " TO APPLY: EMAIL YOUR RESUME TO JOBS@MAESTROHEALTH.COMWe are an employee health & benefits company with a tech-meets-service platform that simplifies and personalizes how employees and employers shop, enroll and live with their benefits. Our innovative technology makes it easy for employees to choose the right benefits plan while equipping HR with the tools they need through one partner, one service team, one platform, one portal.  Maestronites are brought together with a passion to disrupt the status quo by reimagining employee health and benefits. This passion has driven us to create the first complete platform that optimizes the entire benefits experience for everyone. Our people, passion and platform are united by our mission: to make employee health & benefits people-friendly again.  This Marketing Data Analyst Intern is a paid position. WHAT YOU’LL BE DOING:Scrub/consolidate listAppend & verify emailsAudit bounced emailsManage list vendors, audit resultsClean survey dataStandardize questions and answersConsolidate data from different eventsSalesforce implementationEnter individual web leads per current processGather and clean data for missing value in Salesforce.com (Lead Source_Specific)Monitor and optimize Pardot dynamic listPull list from SalesforceMonitor keywords in PardotUpdate competitor list, customer listOther various data projectsWHAT YOU NEED:Loves dataProficient in Microsoft Office Applications, Pardot, and Salesforce.comFamiliarity experience with Google AnalyticsProfessional and personable demeanorOrganized, with an ability to prioritize time-sensitive assignmentsCreativity and problem solving skillsExperience identifying segmentation variables through dataset analysisAbility to take direction and constructive feedbackWillingness to ask questions, learn new skills and execute on a planWHY WORK AT MAESTRO HEALTH? We have great perks in each of our offices, along with a fun, energetic and fast-paced environment, and what will really drive you is our vision. Maestro Health is making employee health & benefits people-friendly again by making healthcare easy to understand, tools easy to use and costs easy to control. We are aiming to become a household name within the employee health & benefits space.  We can’t do that without great people. We want to hear “WOW! That was the best job and business experience I ever had!” from every Maestronite – past, present and future. You should be personally challenged, laugh, work your tail off and look forward to coming to work. Are you ready to become a Maestronite? Let’s do this. Maestro Health is an equal opportunity workplace. We are committed to equal opportunity regardless of race, color, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability or veteran status.  TO APPLY: EMAIL YOUR RESUME TO JOBS@MAESTROHEALTH.COM"}