{"jobID": "2790119504", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Analytics Consultant, Decision Analytics", "companyRating": "3.2", "companyInfo": {"Website": "www.exlservice.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1999", "Type": " Company - Public (EXLS) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " OverviewSenior Analytics Consultant EXL (NASDAQ:EXLS) is a leading operations management and analytics company that helps businesses enhance growth and profitability in the face of relentless competition and continuous disruption. Using our proprietary, award-winning Business EXLerator Framework™, which integrates analytics, automation, benchmarking, BPO, consulting, industry best practices and technology platforms, we look deeper to help companies improve global operations, enhance data-driven insights, increase customer satisfaction, and manage risk and compliance. EXL serves the insurance, healthcare, banking and financial services, utilities, travel, transportation and logistics industries. Headquartered in New York, New York, EXL has more than 24,000 professionals in locations throughout the United States, Europe, Asia (primarily India and Philippines), Latin America, Australia and South Africa.  EXL Analytics provides data-driven, action-oriented solutions to business problems through statistical data mining, cutting edge analytics techniques and a consultative approach. Leveraging proprietary methodology and best-of-breed technology, EXL Analytics takes an industry-specific approach to transform our clients’ decision making and embed analytics more deeply into their business processes. Our global footprint of nearly 2,000 data scientists and analysts assist client organizations with complex risk minimization methods, advanced marketing, pricing and CRM strategies, internal cost analysis, and cost and resource optimization within the organization. EXL Analytics serves the insurance, healthcare, banking, capital markets, utilities, retail and e-commerce, travel, transportation and logistics industries.  Please visit www.exlservice.com for more information about EXL Analytics.Responsibilities Emphasis is on end-to-end delivery of analysis and guiding junior staffContribute to how analytical approach is structured for specification of analysisContribute insights from conclusions of analysis that integrate with initial hypothesis and business objective. Independently address complex problemsParticipate in design of analysis and modeling approach with managers and modelersExtremely comfortable working with data, including managing large number of data sources, analyzing data quality, and pro-actively working with client’s data/ IT teams to resolve issuesExtremely comfortable with Tableau and other BI tools, creating business dashboards that are actionable and comprehensiveExtremely comfortable with learning new programming languages, knowledge of Google Big Query will be a significant plusUse variety of analytical tools (SAS, CART, SPSS etc.) and techniques (regression, logistic, GLM, decision trees, machine learning, artificial intelligence etc.) to carry out analysis and drive conclusionsReformulate highly technical information into concise, understandable terms for presentationsQualificationsMaster’s or Bachelor's degree in math, statistics, economics, computer engineering or related analytics field from top-tier universities with strong record of achievement.Tableau, Google Big Query is a mustAbility to generate insight from large amounts of dataStrong communication skills and ability to manage clients and liaise with the offshore team and manage delivery2-4 years of consulting, analytics delivery experienceVery strong analytical skills with the demonstrated ability to research and make decisions based on the day-to-day and complex customer problems requiredWhat we offer:EXL Analytics offers an exciting, fast paced and innovative environment, which brings together a group of sharp and entrepreneurial professionals who are eager to influence business decisions. From your very first day, you get an opportunity to work closely with highly experienced, world class analytics consultants.You can expect to learn many aspects of businesses that our clients engage in. You will also learn effective teamwork and time-management skills - key aspects for personal and professional growthAnalytics requires different skill sets at different levels within the organization. At EXL Analytics, we invest heavily in training you in all aspects of analytics as well as in leading analytical tools and techniques.We provide guidance/ coaching to every employee through our mentoring program wherein every junior level employee is assigned a senior level professional as advisors.Sky is the limit for our team members. The unique experiences gathered at EXL Analytics sets the stage for further growth and development in our company and beyond. \"EOE/Minorities/Females/Vets/Disabilities\"EEO StatementEEO/Minorities/Females/Vets/Disabilities"}