{"jobID": "2814723221", "jobLocation": "Redwood_City_CA", "jobTitle": "Scientist (Application)", "companyRating": "3.1", "companyInfo": {"Website": "www.genapsys.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Illumina"}, "estimatedSalary": "99000", "jobDescription": " At GenapSys we are working to change the world of healthcare and diagnostics. At GenapSys, we are developing a DNA-sequencing technology that will revolutionize the world of healthcare. Our system will enable fast, accurate, and ultra-low cost genetic tests in order to better understand (and ultimately treat) genetic diseases such as Cancer, Parkinsons, Diabetes, and Alzheimer's, just to name a few. GenapSys was founded by Dr. Hesaam Esfandyarpour and incubated over 6 years (2004-2010) at Stanford University.  Our team brings together an incredibly diverse and multidisciplinary set of backgrounds and skills from electrical and mechanical engineers to physicists, chemists, microfluidic engineers, molecular biologists, bioinformaticians, mathematicians and more. Together we will advance scientific and medical knowledge and improve human health through cheaper, faster, and more accurate DNA sequencing technologies. We are working cross-functionally to make a great impact in the world join us on that mission!  Were looking for a talented and organized team player to work at a fast-paced startup. This individual will be eager and enthusiastic, and someone who wants to take on many responsibilities. In essence, this position requires someone who is willing to roll up their sleeves and work hard to push product development forward. ResponsibilitiesImplement novel and existing NGS applicationsDevelop, optimize and perform NGS workflow steps, including sample preparation, library preparation, amplification and sequencingPerform molecular biology assay development on GenapSys sequencing and sample preparation platformsData driven - critically analyze and derive insights from experimental data, esp. NGS data, using standard and custom NGS bioinformatics toolsIndependently design experimental plans, execute experiments, perform in-depth data analysis, and present results and conclusions for internal review. Demonstrate exceptional time management skills and a can do approach to the challenges at handCollaborate effectively within a multidisciplinary organizationRequired QualificationsPh.D. level Scientist with outstanding expertise in genomics, molecular biology, and product development. Preferably 2+ years of experience after Ph.D. in industry or academic setting.Background in either: Molecular Biology, Bioengineering, Cell Biology or similar.Extensive hands-on experience with nucleic acid and sample preparation technologies is a must.In-depth knowledge and hands-on assay development experience with genomic applications such as resequencing (SNV and indel), structural variations (CNV, translocation, etc.), metagenomics, and transcriptomics is absolutely required.Being in the loop of current and evolving trends in the NGS field is highly desirable.Taking an analytical approach to problem-solving (experience with statistical tools for experimental analysis, e.g. Excel, Matlab, JMP).Familiarity with genomic databases and standard bioinformatics tool, preferably experienced with custom analysis tools, e.g. Matlab, Pearl, R.Understanding and experience in product development are highly desirable.Demonstrated independence in leading projects and troubleshooting.What we offer:An amazing mission: Enabling everyone to decode the living world!Competitive compensation and stock optionsCompetitive benefits: medical, dental and vision benefits for employees and dependents, fully sponsored life, short and long-term disability insurance, and 401(k) retirement savings plan.Free daily catered gourmet lunches and snacksWeekly fancy High Tea and happy hoursFree complex onsite gym membershipCasual, but high-performing work environmentA diverse and inclusive workplace where we learn from each other is an integral part of GenapSys' culture. We actively welcome people of different backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and a great place to work. Join us and help us achieve our mission!Note to Recruiters and Placement Agencies: Genapsys does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any Genapsys employee. Genapsys will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered the property of Genapsys."}