{"jobID": "2836359463", "jobLocation": "Houston_TX", "jobTitle": "Senior Research Scientist - Part-time (non benefits)- Experimental Therapeutics", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " This is a part time position non benefits eligible position. SUMMARY The primary purpose of the Senior Research Scientist position requires ability to prioritize and perform tasks on projects to ensure timely completion. Is able to organize and maintain the research laboratory and laboratory records. Develops new procedures and improves upon existing techniques relevant to the research. Keeps organized and detailed experimental records documented in laboratory books and computer files. Aides in other laboratory supervisory duties assigned by principal investigator. JOB SPECIFIC COMPETENCIES Core Facility Management and Consultation Perform complex maintenance on four NMR spectrometers which requires specialized knowledge of these complex pieces of equipment. This includes filling each magnet with liquid nitrogen on a weekly basis, as well as shimming and ensuring that the spectrometers are performing to specifications in terms of signal to noise, pulse width, line shape, and other pertinent parameters.Troubleshoot problems with the spectrometers and work with Bruker to have problems repaired under current service contract terms. A service technician from Bruker, Inc., will fill the magnets with liquid helium. Determine when technician will be at MDACC, coordinate the liquid helium fills with Bruker, Inc., and ensure that an adequate supply of the cryogen is on site for this purpose.Administer the computer system for the spectrometers and molecular modeling.Train all institutional and external faculty, post-docs, and students to run 1D, 2D and 3D spectra, and interpret these spectra.Consult with users and provide guidance on which type of experiment to run, parameters for spectra acquisition and processing. Collaborate with researchers at MDACC to solve structures of their compounds. Core Safety and Supply Management Keep up to date on the latest techniques in NMR spectroscopy and implement these to assist our faculty in their research. Run spectra for those faculty, post-docs, and students who do not have the expertise to operate the spectrometer. Interpret or assist in the interpretation of these spectra as needed.Order and keep track of supplies. Keep adequate records of instrument use and bill users. All these require walking from one area to another through MDACC to deliver and pick up information.Attend annual fire and chemical safety sessions, as well as mandatory training such as Universal Precautions. These guidelines follow OSHA guidelines and are required for JCAHO certification. Education Required: Ph.D. in Natural Science, related field or medical degree.  Experience Required: Five years of experience in experimental or scientific work.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}