{"jobID": "2817483829", "jobLocation": "Dearborn_MI", "jobTitle": "254896 - Data Scientists Modeling", "companyRating": "4.0", "companyInfo": {"Website": "www.rgbsi.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Kelly Services, TEKsystems, Randstad US"}, "estimatedSalary": "80000", "jobDescription": " RGBSI, a leader in the staffing industry, is dedicated to providing the highest quality of services to our clients and employees. We are proud to be the primary staffing partner to top companies in the automotive, aerospace, IT, media & entertainment, sports, energy, and finance industries. As a result of our clients' continued growth, we are looking for energetic, personable professionals to partner with these leading US companies. Position Description:In this role, you will support the development of optimization models by assembling data from a variety of sources as a member of the Advanced Operational Analytics team in the Global Data, Insight & Analytics.The developed models and insights obtained from data analysis will provide decision support to other organizations such as Product Development, Corporate Strategy, and Sustainability.Additionally, you will support initiatives to leverage unique data streams using predictive analytics, and quantify the customer value of vehicle design choices and implemented technologies.Skills Required:A data analytics role including running queries, compiling data, and manipulating data from separate sources to form unified sets for analysisPredictive analytics including machine learning and experience writing algorithms in Python, Scala, or similar languagesBig Data technologies in the Hadoop ecosystem (HDFS, MapReduce, Hive, Spark, Hue, Zeppelin, etc.), and command line experience with loading and manipulating files within HDFSOptimization techniquesExperience Required:2+ years in one or more of the primary skills listedFluent in QlikView, including day-to-day programming in Qlikview, and demonstrated Customer Satisfaction of the QlikView Dashboard which she/he developed independentlyHandle data flow from High Performance Computing (HPC) /s thru HadoopUse Hive to process data in HadoopIngest data, store and analyze locally in one or both of the 2 approaches below with one or more of the Software tools listed: o Dynamic i. Spark ii. Scala iii. Pyspark  o Static i. Matlab ii. Python iii. Alteryx Display the results dynamically in QlikView which is developed in parallel with all of the aboveEducation Required:PhD in a quantitative field, such as Engineering, Math, Statistics, or Computer Science We offer attractive, competitive compensation and benefits including, medical, dental, vision, longevity bonus, holidays, 401k, Short Term Disability, AD&D; and Tuition Reimbursement. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more.  RGBSI is a Multi-National Corporation headquartered in Troy, MI with branches throughout the USA, Canada, China, Germany, Mexico, Singapore, UK, and India.SDL2017"}