{"jobID": "2811993604", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Computational Biologist - Epigenetics in Metabolism", "companyRating": "4.3", "companyInfo": {"Website": "www.vai.org", "Headquarters": "Grand Rapids, MI", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " Computational Biologist Pospisilik Lab  Epigenetics in Metabolism  The Van Andel Research Institute (VARI) is an independent and world-class biomedical research institute dedicated to determining the fundamental molecular origins of disease and translating those findings into effective therapies. VARI is home to more than 300 scientists and staff that work in on-site laboratories and collaborative partnerships that span the globe.  VARI's research pillars, built upon epigenetics, cancer and neuro-degeneration research, will see the addition of a brand new inter-program initiative focusing on metabolism and metabolic (re)programing, starting at the end of 2018.  The Pospisilik lab, a founding member of this metabolism focus, tries to understand the epigenetic and evolutionary basis of disease heterogeneity, non-Mendelian phenotypic variation, and intergenerational control, and is seeking a full-time Computational Biologist to join the team. The successful candidate's will build upon our recent epigenomic analyses from both targeted and consortium (International Human Epigenome Consortium [IHEC/DEEP]) efforts which have identified chromatin-based mechanisms for buffering diabetes and beta-cell dedifferentiation (Lu / Heyne, Cell Metab 2018), establishing bi-stability and disease canalization (Dalgaard, Cell 2016), and producing intergenerational disease responses to diet (Oest / Lempradl, Cell 2014). Current projects extend these and previous works dissecting human, mouse and fly phenotypic variation, as well as novel signaling modules that link metabolism, to adipose tissues browning, inflammation and even hypothalamic nutritional state. A primary focus will be to model and dissect what we believe to be the first mammalian developmental 'switch' genes that triggers distinct 'on' and 'off' epigenetic disease states in mouse and man.  The successful candidate will be an independent and motivated team player with strong communication skills and a strong interest in epigenetic control, heterogeneity, patterns, disease physiology, and thinking in abstract computation spaces. They will cherish efficiency and be results oriented. If successful, you will:Support data management, script dissemination, and analysis of genomics, epigenomics and metabolomics dataWhere necessary develop, maintain, and support computational biology pipelinesPerform data mining at scale on both local and (where feasible) cloud pilot resourcesPreprint and publish results and novel methods, serving as primary or contributing authorAnticipate and keep abreast of new developments in bioinformaticsInteract and liaise with consortium efforts and joint analysesHelp mentor graduate students and postdocs with significant bioinformatics in their projectsEXPECTATIONS The following expectations should be met within the first 3 months. Within 1 month Develop a solid understanding of at least one major project, adapt to VARI computing landscape, and demonstrate analytical efficiency and reproducibilityWithin 3 months Acquire significant data, prepare informative summaries of interim analyses, and take over maintenance and development of analytical pipelinesQUALIFICATIONS You possess a Master's degree in computational biology, bioinformatics, mathematics, statistics, computer science, or relevant discipline (a BSc with experience will be considered).  As the ideal candidate, you will have: working knowledge of 1+ scripting language (e.g. R, python) and systems language (e.g. C)substantial experience analyzing NGS data (e.g. RNAseq, ChIPseq, ATAC, WGBS, Hi-C)an understanding of molecular biology and epigenetics (not absolutely required).a commitment to open, collegial, reproducible science, and the betterment of society. We are particularly interested in candidates with additional orthogonal experience such as facial recognition and human genetic association analyses.  If you possess these attributes and desire to help us drive science from the bench to the clinic, while benefiting from a highly generous compensation package; we would welcome speaking with you and encourage you to apply today!  VAI is actively striving to diversify its workforce and strongly encourages qualified individuals from underrepresented groups to apply.  About Grand Rapids, MI  Van Andel Research Institute is located in downtown Grand Rapids, MI,the second largest city in Michigan. Grand Rapids offers a remarkable combination of cosmopolitan atmosphere and small town warmth, known for its philanthropic and sustainability-driven community, and is ranked 19th in \"America's Top 100 Places to Live.\"  Located on the banks of the Grand River, Grand Rapids offers all the big-city excitement you'd expect from a million-resident metropolis, featuring hundreds of restaurants and nightspots, theaters, museums, sports and concerts. The safe and clean downtown is surrounded by an eclectic mix of walk-able neighborhoods.  With a medical and life sciences industry boom, strong entrepreneurial activity, dedication to green building and living, and innovative employers, Grand Rapids' diverse economy continues to grow, offering endless career opportunities."}