{"jobID": "2836054113", "jobLocation": "Princeton_NJ", "jobTitle": "Senior Research Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.syneoshealth.com", "Headquarters": "Raleigh, NC", "Size": "10000+ employees", "Founded": " 2017", "Type": " Company - Public (INCR) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " The research scientist is responsible for coordinating and carrying out the full spectrum of activities related to the development and validation of bioanalytical methods according to client requests and within the required timeframes.  MAJOR RESPONSIBILITIES:  * Develop, validate and optimize bioanalytical methods by using analytical techniques. * Process, analyze and interpret bioanalytical data. * Responsible for finding solutions to problems related to the application of bioanalytical methods. * Assist in improving laboratory activity processes (method development, validation and sample analysis). * Write and review bioanalytical method SOPs. * Review scientific literature in order to guide the development of bioanalytical methods. * Document activities related to the development and validation of bioanalytical methods. * Can be called upon to assist with the training of employees related to research and development and validation. * Assist in competitive intelligence by developing and testing new analytical instruments. * Coordinate the resources used during the development and validation of bioanalytical methods. * Carry out support tasks to meet the needs of laboratory users. * Can be called upon to perform all biological sample processing and analysis activities. * Can be called upon to supervise the work of associate research scientist.  Qualifications  Position in US * Bachelors Degree in Science. * In lieu of degree, four years of experience in bioanalysis or related field. Relative alternate certification may be considered acceptable. This determination ensures the jobholder has sufficient technical ability to perform the role.  MINIMUM TRAINING & EXPERIENCE REQUIRED:  * Two to 4 years of relevant work experience would be considered an asset. * Experience in regulatory context will be considered an asset. * Must demonstrate good computer skills especially in the utilization of Microsoft Word, Excel and analytical software."}