{"jobID": "2580620695", "jobLocation": "N_o_n_e", "jobTitle": "Data Scientist | Global Data & Content", "companyRating": null, "companyInfo": {"Website": "www.solera.com", "Headquarters": "Westlake, TX", "Size": "5001 to 10000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Mission  Solera is the world’s leading provider of software and services to the automobile insurance claims processing industry. Created in 2005 with a vision to transform the way the industry operates, Solera is now active in over 80 countries across six continents.  Our Global Data & content team develops global solutions and is part of an ambitious new program to redesign the way we extract insights from the data. Not only the team is responsible for the insights, but has control on the end to end process, starting from data acquisition. You will be exposed to learning new technologies and will have the opportunity to develop yourself professionally. We are organized as a tribe, with multiple squads and no hierarchies, just a group of volunteers willing to make our future happen. “In the beginning, software was 20% of the process and the human was 80%. If you fast forward into the future, where we are today and across the next five years, software moves to become 80%.” This opportunity is to be based at Solera offices in Westlake, TX (Dallas / Fort Worth area).  Position 80s Develop and implement processes and systems to extract knowledge or insights from dataDevelop technical solutions that will streamline the current data development processesAct as a funnel for ideas and collaborate with different teams to create new solutionsResearch & identify new technologies to drive internal innovationSolve complex business problems in a timely and robust mannerCreating automated anomaly detection systems and constant tracking of its performanceExtract huge volumes of data from multiple internal and external sourcesExplore and examine data from a variety of angles to determine hidden weaknesses, trends and/or opportunitiesCommunicate predictions and findings to management and IT departments through effective data visualizations and reportsROLE REQUIREMENTS:Enhance data collection procedures to include information that is relevant for building analytic systems.Solid problem-solving skills, supported by a logical, methodical and thorough approach to implementation.Specify quality checks that assure QA in data and one SVOTExcellent interpersonal and communication skills to establish and maintain collaborative work relationships at all levels.Excellent writing and oral communications skills in EnglishMust be able to finish tasks with minimum supervisionQualificationsMust Have:Educated to degree level from a numerate discipline (preferably Computer Science)Hands on with “can do” attitudeData mining knowledge and experienceData modeling experienceBig Data Processing Platforms: Hadoop, Spark, Flink, etc.OptimizationScripting Languages (R, Python) and ability to learn new coding languages and programsSoftware development principles (design patterns, etc.)Highly Desirable:Understanding of machine learning techniques and algorithms (k-NN, Naive Bayes, SVM, Decision Forests…)Visualization tools (Desirable Qlik Sense or Microstrategy)Agile methodologiesPlatform experience, JIRA, ConfluenceBig Data architecture (i.e. kappa, lambda…)Experience with NoSQL databases, such as MongoDB, Cassandra, HBaseSoft Skills:High communication skillsTeam playerIntellectual curiosityAnalytical skillsSelf-managementPro-activityOut of the box thinkingBenefits:Highly competitive pay and health & wellness plans.No B.S. policy that promotes transparency and accountability.Beautiful and uncommon workspaces to collaborate and unwind.Free gym membership (to the awesome gym that’s right next to our office)Free meals, healthy snacks (like nuts and yogurt parfaits), some indulgent snacks (like baked chips and dark chocolates), and refrigerators full of juices, teas and other life-essential beverages (including Red Bull)The latest and greatest in all things technology.Lots and lots of awesome cars.An ice cream truck that’s always loaded."}