{"jobID": "2765843010", "jobLocation": "Vienna_VA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.ntconcepts.com", "Headquarters": "Vienna, VA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " Are you someone who enjoys working with data and statistics? Are you interested in expanding your knowledge base? If so, NT Concepts has an exciting opportunity for you. We are looking for someone who possesses analytical capabilities, an innovative mindset, and a passion for solving problems.  The selected Junior Data Scientist will work with developers, other data scientists, and a variety of other technical staff to design robust, dynamic data machine learning models. The output of these models will integrate into new and existing user interfaces and dissemination capabilities. The candidate will work in a mixed technical environment and have the desire to research, design, and develop machine learning models in an agile fashion with predominantly geospatial applications.  Required Qualifications: -Enjoys working in a team environment  -Possesses a BA or BS degree in CS, Physical Science, or Math  -Ability to apply college level mathematics and statistics to real world problems  -Experience with geospatial visualization tools  -Practical experience with the machine learning life cycle, to include ontology engineering, labeling, training, testing, validating, and visualizing.  -Experience working in various development environments  -Experience with statistical software  -Ability to obtain a security clearance  #JT Founded in 1998, NT Concepts is a woman-owned technology solutions company focused on data analytics, software engineering, investigative services, and geospatial information systems. We provide a broad range of Federal Civilian, DoD, and Intelligence Community customers with solutions for enterprise, cloud-based, and mobile environments. NT Concepts is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer (M/F/D/V), making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.  All resumes are held in confidence. No recruiters or agencies without a previously signed contract. No faxes please. Only candidates whose profiles closely match requirements will be contacted during this search. NT Concepts participates in E-Verify. If you need a reasonable accommodation for any part of the employment process, please send an e-mail to jobs@ntconcepts.com and let us know the nature of your request and your contact information. Reasonable accommodations are considered on a case-by-case basis."}