{"jobID": "2820346438", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.iic.com", "Headquarters": "Rochester, NY", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Client is the leading provider of antibody reagents to the research immunology community, is seeking an outstanding Scientist I to join our highly motivated Research Development team.  The Scientist I is responsible for the development and evaluation of new reagents and enhancements to existing reagents.  The Associate is responsible for routine, accurate and timely testing of experimental samples according to standard protocols and operating procedures.  The ability to execute scientific experiments of moderate scope is key.  The successful candidate is expected to set up and execute these experiments, be detail oriented, skilled at data analysis and trouble shooting and will be accountable for preparing and presenting data at lab meetings.  The Scientist I will prioritize daily workload and work with some supervision.  The associate will participate in the review of data, report results, and complete all required documentation and database entries.  In general, the Scientist I will receive specific instructions and ongoing guidance regarding required tasks and expected results. DUTIES AND RESPONSIBILITIES: looking for someone with Flow Cytometer experience Responsible for the execution of experiments with varying complexity using multi-color Flow Cytometry.Independently analyze own research data, solve problems with appropriate guidance and effectively plan follow up experiments.Analyze data and report test results including completion of all required documentation and database entries as required by QC protocols or operating procedures.Demonstrate the ability to interpret and present data of moderate to high complexity within the team environment and with members from other teams.Routine, accurate and timely completion of all assigned experimental tests. Will be expected to efficiently prioritize individual workload.Expected under supervision to develop skills and exercise judgment in troubleshooting routine assigned test procedures and in recommending appropriate corrective actions.Keeps abreast of the basic requirements for compliance in own area of work and complies with those requirements.Promotes a safe work environment. Participates in Environmental, Health and Safety programs. Addresses corrective actions whenever a hazard is identified.Performs other related duties and assignments as required.KNOWLEDGE AND SKILLSRequires hands on experience designing, performing, and analyzing flow cytometry experiments, preferably on Client flow cytometers (LSRII, LSR Fortessa, Canto, Aria).Desired software skills: Client FACS Diva, FlowJo, FCS Express, and Microsoft Office Suite.Effective interpersonal skills, must be able to work in a cross-functional team-oriented environment to achieve organizational goals.Effective written and oral communication skills.Demonstrated ability to follow established policies and procedures.Demonstrated ability to keep neat, accurate, and complete records.Effective analytical and problem solving skills.EDUCATION AND EXPERIENCERequires a Bachelor's degree in cell biology, immunology or related scientific discipline and a minimum of 1-4 years of laboratory experience."}