{"jobID": "2796617314", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.gqrgm.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Senior Data Scientist, Los Angeles DATE 14 Jul LOCATION Los Angeles COMPENSATION Competitive KEY SKILLS DESCRIPTION  SUMMARY  Leading Financial institution is seeking a Senior Data Scientist to develop and implement predictive models and scorecards for multiple business areas (Risk, Marketing, Revenue, etc.).  JOB DESCRIPTION  Top Finance firm is looking for a Senior Data Scientist to create scorecards and predictive models in order to provide valuable analytical insights for the business. This firm has seen recent & rapid growth across the entire business, especially with regards to their Data Science, Analytics and Scoring teams. Therefore, they are in need of additional experienced data scientists to assist in model development.  Key Responsibilities:  This data scientist will participate in all stages of model development (data collection, model development, validation, testing and optimization)  Analyst will use a number of statistical techniques (regressions, data mining, clustering, multivariate modeling, etc.) to provide actionable insights  Successfully communicate and present analytical results to both technical and non-technical audiences.  Qualifications  Master’s degree in quantitative or scientific field. (PhD preferred)  3-5+ years’ relevant industry experience  Outstanding programming skills in R, SAS, SQL, Python  Extensive knowledge of advanced predictive techniques (regressions, GLMs, multivariate analysis, etc.)  Superior communication abilities; efficiently relay results to senior management  CONTACTAPPLY | data.americas@gqrgm.com  VISIT US | www.gqrgm.com  LOS ANGELES | 1.310.807.5030  10877 Wilshire Boulevard, Los Angeles, CA 90024 | Office Hours: 7.00-20.00 PDT  NEW YORK | 1.212.763.8333  340 Madison Avenue, New York, NY 10173 | Office Hours: 8.00-20.00 EDT  LONDON | 0203.141.8000  Westminster Tower, London SE1 7SP| Office Hours: 8.00-20.00 GMT  HONG KONG | 852.3678.6738  2 Exchange Square, 8 Connaught Place, Central | Office Hours: 9.00-21.00 HKT  GQR Global Markets  We are committed to protecting and respecting your privacy. Information on our privacy policy, together with our terms of business are available at www.gqrgm.com.  For the latest vacancies, please join our group on Linkedin: http://www.linkedin.com/groups?gid=1615777&trk;=myg_ugrp_ovrWhile a resume is preferable we also welcome tentative enquiries from well-qualified persons. To speak with an  agent please contact one of our regional offices. Utmost confidentiality and discretion is assured."}