{"jobID": "2834638457", "jobLocation": "Santa_Maria_CA", "jobTitle": "Entry Level Engineer or Scientist", "companyRating": null, "companyInfo": {"Website": "www.scsengineers.com", "Headquarters": "Long Beach, CA", "Size": "501 to 1000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Golder Associates, Tetra Tech, Bryan A. Stirrat & Associates"}, "estimatedSalary": null, "jobDescription": "Job SummaryTo support our ongoing environmental consulting business efforts, SCS Engineers is looking for an entry-level candidate to become a long term asset within our well established practice in Santa Maria, CA. We are looking for a talented entry-level professional with experience and/or education in environmental studies, engineering, land use planning, or similar fields to join our team and further their professional development.Essential Duties and ResponsibilitiesField work including surveys, inspections, GPS data gathering, etc. Hiking/driving in varied terrain and weather is sometimes required.Office based tasks including but not limited to: mathematical calculations, report writing, creating site plans and facility diagrams, permit application preparation, map making, etc.Business development including but not limited to: proposal preparation, meeting with clients, and attending industry related conferences/trade shows.Participating in team activities including staff meetings, training, and community events.Occasional travel out of the region or the state of California may be required but is generally infrequent and rarely exceeds one week in duration.QualificationsBachelor's Degree or higher required; Preferably a Bachelor of Science Degree in Environmental, Chemical, Mechanical, or Civil Engineering, Environmental Studies, Biology, Urban Planning, Geography, or similar field.0-2 years of professional level job experience or internships related to environmental studies, engineering, or similar field required.1-3 years of non-professional work experience required which can include common retail, clerical, food service, or other jobs which demonstrate the employee’s ability to common work place expectations (dress code, attendance, work ethic, etc.)Strong communication skills, oral and written (technical) are necessary.Working knowledge of Microsoft Office applications including Word, Excel, PowerPoint, and Outlook required. Experience with using AutoCAD or ArcGIS preferred but not required.Valid driver's license with a driving record in good standing required. SCS Engineers offers excellent opportunities for career advancement and a competitive compensation package, including: medical, dental, vision, 401K, ESOP, paid holidays and PTO.  SCS Engineers is an Equal Opportunity Employer (EOE). SCS provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran or disabled status.  If you have questions, difficulty using our online system and/or you need an accommodation due to a disability then please contact us about your interest in employment at recruiting@scsengineers.com."}