{"jobID": "2836057741", "jobLocation": "Kenilworth_NJ", "jobTitle": "Associate Principal Scientist, Bioassay Development", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are seeking a highly motivated associate principal scientist to join our Biologics Analytical Sciences team within Biologics BioProcess organization at Merck-Kenilworth. The qualified candidate will be responsible for development of fit-for-purpose surface plasmon resonance (SPR) and automated potency assays in the assessment of biological activity and characterization for various early and late-stage biologics such as antibodies, bispecifics, multifunctional proteins, and antibody drug conjugates; other reponsibilities include development of new assay platforms and benchmarking current approaches/techniques to the industry standards. The candidate will be expected to communicate results effectively in presentations to stakeholders in partner organizations or at external scientific meetings, to write technical reports, and to participate in cross-functional teams.  Qualifications  Education:  A degree in biochemical and biological sciences/engineering: Ph.D. degree with 4+ years or M.S. degree with 12+ years of professional drug development experience in the pharmaceutical industry.  Required:  Expertise in SPR/Biacore assay development, troubleshooting, and data analylsis/review/interpretation of protein-ligand interactions.  Expertise in automated liquid handling devices such as instruments made by Biomek, Tecan, Hamilton, etc.  Expertise in developing potency-based immunoassays for biotherapeutic drug candidates.  Experience in applying a variety of biochemical, biological, and immunological techniques (ELISA, cell-based assays, FACS, MSD, EnVision, ForteBio, etc.).  Experience with QbD and statistical analysis (DoE, JMP, Design Expert, etc.).  Experience in various aspects of drug development (pre-clinical,early, and late stage) and lifecycle support, and ability to develop useful strategies and tactics to meet regulatory milestones.  A strong team player with excellent oral and written communication skills; ability to work independently to develop and design experiments, critically evaluate data, and troubleshoot.  Strong ability to deliver complex objectives under aggressive timelines in a rapidly changing environment.  Preferred:  Working knowledge of biological assay qualification, validation, and transfer to an cGMP environment.  Experience in bioassay development for modalities such as bispecifics and multifunctional proteins is highly desired.  Experience in effectively managing analytical development and testing activity at external vendors such as CROs.  Working knowledge of regulatory and industry guidelines in the area of bioassay development.  Experience in authoring of regulatory submissions"}