{"jobID": "2788551148", "jobLocation": "Rockville_MD", "jobTitle": "Business Systems Data Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.netimpactstrategies.com", "Headquarters": "Falls Church, VA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "Job Description We have an opportunity for a Business Systems Data Analyst to join our talented Professional Services team. The successful candidate will provide project coordination support services to the client on the Business Support System (BSS) Mapping Project. Typical responsibilities include:Develop Visual Paradigm knowledge articlesDevelop data repositoryDiagram NCI, NIH, and HHS systems and their connectionsManage the NCI Support System Architecture (SSA) Working GroupDevelop knowledge articles on Visual Paradigm diagramming best practicesDiagram NCI, NIH, and HHS systems along with their system connectionsConduct second level outreach to document business processes associated with the systemsManage the client SSA Working Group relationships, perform assessments for uploading and diagramming systems information on the Visual Paradigm collaboration server, and develop an client portfolio of business support systems with collaboration from the client SSA Working GroupConsolidate findings from the client SSA Working Group and assess the results to determine the best practices in documenting, categorizing, and describing client systemsRequired SkillsA BA/BS degree in Computer Science, Information Systems, or other related Business degrees6 years of experience, 2 years as a Project Manager for the PMO ConsultantExperience in developing process flow diagrams and systems documentationAssertiveness and self-confidence in dealing with issues and in broadly communicating information across the organizationStrong leadership as well as oral and written communication skills are requiredDeveloped problem-solving and analytical abilitiesStrong customer service and interpersonal skillsExcellent presentation & communication skills in both oral and written formGenuine desire to learn is essentialExperience working in the Federal GovernmentDesired SkillsCertified as a Project Management Professional (PMP)Certified in Information Technology Infrastructure Library (ITIL)Experience working in Visual ParadigmExperience in establishing and developing services is a plusPrior work experience in a scrum based agile environment is a plus This position is located in Rockville, Maryland.  In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Work Environment: All employees are responsible for their own safety, as well as that of others in the workplace. To help us maintain a safe workplace, everyone must be safety-conscious at all times. This position is performed in a typical office environment. The noise level in the work environment is usually quiet to moderate. Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this job, the employee is regularly required to talk or hear. The employee frequently is required to stand; walk; use hands to finger, handle or feel; and reach with hands and arms. Disability Specifications: NetImpact Strategies will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990. About Us NetImpact Strategies Inc. is a SBA certified 8(a) and Economically Disadvantaged woman-owned, small business with deep expertise in the areas of Portfolio Management, Governance, Financial Management and Budgeting, Acquisition Support, Program and Project Management and Quality Management.  We have been delivering positive impacts to our clients across the federal civilian and DoD sectors. Our solutions empower sound decision-making and management practices, to enable government agencies to serve effectively as good stewards of taxpayer dollars while meeting their mission. At NetImpact Strategies, Inc. we are passionate about what we do and take pride in our work every step of the way. Commitment and accountability are at the core of our relationships. We believe in doing the right thing because it is the right thing to do.  NetImpact Strategies, Inc. provides results oriented services. Working collaboratively with our clients, we provide solutions that address the unique needs of each client. The successful outcome of our efforts is measurable results.  NetImpact Strategies, Inc. is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or any other basis prohibited by applicable law. Recruitment, training and development, transferring and promotion practices are performed without regard to the above listed items."}