{"jobID": "2828126182", "jobLocation": "Bethesda_MD", "jobTitle": "Data Analyst / Senior Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.aledade.com", "Headquarters": "Bethesda, MD", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are seeking key members of our analytics team to guide the vision, design and development of analytic data products at Aledade. The Analyst will work closely with all divisions of the company including executive leadership, product development and adoption, business development, ACO operations, and technology. The role includes participating in the idea generating and business requirements gathering processes and developing novel, high quality data products. The ideal candidate will have a strong background in health care analytics, an understanding of population health strategies, and a passion for having a direct impact on primary care practices and contributing to a data-driven organization. Key responsibilities include:Executing analysis and reporting projects from start to finish with the goal of identifying opportunities for improving population health, monitoring key performance indicators, and assessing impact of Aledade population health initiatives. This includes:Working with analytics leads and key stakeholders to understand business needs and designing data products that meet those needsAssisting with the development and documentation of technical specificationsAssisting with the design and implementation of data warehouse tables or views to support analysis and reportingConducting rapid exploratory analyses and working with key stakeholders to interpret results and iterate on final product designDesigning and conducting evaluation studies to assess the effectiveness and impact of Aledade population health initiativesDeveloping interactive dashboards, reports, and data visualizations that communicate insights from the data and inspire actionProviding support to users of data products and conducting ad hoc analyses to support Aledade corporate and field teams when neededPreferred qualifications:Excellent quantitative analysis abilities, grounded in epidemiology, biostatistics, health informatics, health care analytics or related fieldAbility to analyze data to produce accurate and unbiased results and tell the story of those results in data visualizations, dashboards, and reportsAdvanced data management and data manipulation skills, including a strong foundation in SQL programmingExperience building data products in Tableau (or other similar business intelligence software, though Tableau experience strongly preferred)Experience with health care data sources such as claims, electronic health record, event notification, clinical, and patient reported dataKnowledge of standard methods for measuring health care utilization, spending, quality, and outcomes; risk adjustment; provider profiling; and related analytical tasksIntense attention to detail and data quality assurance"}