{"jobID": "2733426670", "jobLocation": "Chicago_IL", "jobTitle": "Medical Technologist / Medical Laboratory Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.sinai.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1918", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Advocate Health Care, Resurrection Health Care, University of Chicago Hospital"}, "estimatedSalary": "25", "jobDescription": "GENERAL SUMMARY: Process patient samples and perform a variety of moderately and highly complex clinical laboratory tests as authorized by the Section/Technical Supervisor. Report the results of the laboratory tests performed in order to assist in the diagnosis of disease and the monitoring of the patients' condition. Adhere to the laboratory's quality control policies and standard operating procedures to insure the accuracy of test results and result reporting. Perform duties and responsibilities as a productive team member.ESSENTIAL FUNCTIONS AND DUTIES: Independently perform a variety of clinical laboratory tests within expected turnaround time for priority assigned, i.e. STAT, Urgent, and Routine. Determine acceptability of patient samples based on established departmental guidelines and notify appropriate personnel (nursing unit/out patient clinic) of all specimens identified as unacceptable for testing; document to whom the specimen rejection was reported in the LIS. Perform, interpret, and document routine equipment calibration, maintenance procedures and function checks. Trouble-shoot instrument malfunctions within established parameters. Correlate lab data with other clinical and laboratory data, as needed. Perform evaluation and validation procedures for new methodologies. May prepare reagents utilized in performing tests. May monitor levels of laboratory materials and supplies to ensure uninterrupted laboratory services. Record, verify, and file all results of specimen examinations and tests performed following established protocol for enter/edit results in the lab computer system (Meditech). Immediately notify physician and/or responsible person in patient care area of critical value results and document to whom the results were reported in LIS. Follow established computer downtime procedures, as needed. Participate in laboratory quality improvement activities, projects or studies. Process proficiency testing samples in the same manner as patient specimens. Identify problems that may adversely affect test performance or reporting of results and take appropriate corrective action. Notify appropriate supervisory personnel of action taken. Review safety manuals/policies & procedures on annual basis and participate in annual safety training. Use appropriate personal safety wearing apparel and safety equipment in the performance of assigned duties; adhere to established safety standards and practices. May perform audits of safe work practices and work environment in the department. Provide physician and other health care workers with accurate information concerning testing protocols, testing methods, specimen requirements, patient test preparations, limitations of lab procedures, as well as, general laboratory department operations; respond to technical questions consistent with level of training and experience. May assist in training new employees and/or students. May prepare and present continuing education lectures for department staff. May perform blood specimen collection from patients in all age groups. Recognize and assist other personnel in the completion of work to assure efficient, timely lab services.MINIMUM EDUCATION: Bachelor's Degree in a chemical, physical, biological, clinical laboratory science or medical technology from an accredited institution or equivalent education/experience. Eligible for certification by the American Society of Clinical Pathologists (ASCP) or National Certification Agency (NCA) or equivalent.REQUIRED LICENSES, CERTIFICATES, REGISTRATIONS: Certification by the American Society of Clinical Pathologists - MT(ASCP) - or National Certification Agency - CLS(NCA) - or Medical Laboratory Scientist (MLS) or equivalent."}