{"jobID": "2829106529", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst (Analytics in Finance)", "companyRating": "3.6", "companyInfo": {"Website": "www.grubhub.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Public (GRUB) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " DoorDash"}, "estimatedSalary": "70000", "jobDescription": "Got a taste for something new? We’re Grubhub, the nation’s leading online and mobile food ordering company. Since 2004 we’ve been connecting hungry diners to the local restaurants they love. We’re moving eating forward with no signs of slowing down.  With more than 80,000 restaurants and over 14 million diners across 1,600 U.S. cities and London, we’re delivering like never before. Incredible tech is our bread and butter, but amazing people are our secret ingredient. Rigorously analytical and customer-obsessed, our employees develop the fresh ideas and brilliant programs that keep our brands going and growing.  Long story short, keeping our people happy, challenged and well-fed is priority one. Interested? Let’s talk. We’re eager to show you what we bring to the table.  We are looking for a data analyst, who will be instrumental in visualizing business trends and insights across the company. The Finance team is the analytical engine of the company - we surface data-driven insights that drive strategy and optimal decision making for the leaders across the organization. We need data, reporting and analysis to do this! In this role, you will need to understand effective dashboard design and translate analytic requirements into dashboards/reporting to help analyze trends.  To succeed in this role, you should love both getting to the ‘truth’ of data and optimally visualizing data/insights in tools like Tableau, ReDash and Excel. Produce actionable dashboards and reporting that show key performance indicators, identify areas of opportunity for current operations and display root cause analysis of trendsProactively identify opportunities to simplify, automate and scale our suite of reportingPartner with business leaders to translate analytic needs into reporting requirementsHelp define the data assets that enable analysis for departments across the companyDrive data accessibility, accuracy and quality by partnering with our Data and Technology groupsBe curious! Find data nuggets, trends and other analytical goodies that help us grow faster and generate more profit2+ years of experience in a data/BI roleProficiency in Tableau and SQLProven track record of successful dashboard development and adoption by business usersStrong familiarity with data warehouse environments (e.g., AWS and Presto)Ability to balance speed and accuracy - we work quickly but smartlyNimble mindset - our business is growing and evolving quickly, you’ll need to too!Unlimited paid vacation days. Choose how your time is spent.Never go hungry! We provide weekly GrubHub/Seamless credit.Regular in-office social events, including happy hours, wine tastings, karaoke, bingo with prizes and more.Company-Wide Initiatives encouraging innovation, continuous learning and cross-department connections. We deliver favorites every day. Join us as we move eating forward.  Grubhub is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. The EEO is the Law poster is available here: DOL Poster. Grubhub is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to TalentAcquisition@grubhub.com and let us know the nature of your request and your contact information."}