{"jobID": "2746263439", "jobLocation": "Foster_City_CA", "jobTitle": "Research Scientist II, Fibrosis", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "151000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities: We are seeking an exceptional scientist to join the Fibrosis Biology group at Gilead. This position offers a unique opportunity to drive research efforts to discover and develop novel therapies for the treatment of chronic metabolic and fibrotic diseases. This individual will support discovery and translational research efforts aimed at identifying and characterizing novel therapeutic targets and advancing discovery research projects through to clinical development.  Gilead Sciences is a world leader in antiviral research having developed small molecule compounds that have revolutionized the treatment of HIV, HCV, and HBV. Over the last 5 years, Gilead has significantly broadened its scope to encompass unmet medical needs in chronic fibrotic diseases including non-alcoholic steatohepatitis (NASH) and diabetic kidney disease (DKD). Gilead has developed a pipeline of investigational compounds which are currently in late-stage clinical trials for NASH. Our research team is intensively engaged in the discovery and development of additional small molecule and antibody therapeutics and combination therapies for patients with advanced liver fibrosis. This position provides an exciting opportunity to have high-impact participation in the growth of these new therapeutic areas within an established research group focused on developing drugs for fibrotic diseases. Essential Duties and Job Responsibilities: The successful candidate will work in a project team-based research structure to lead or support biological investigations of new and established projects within Research. The candidate will be expected to significantly participate in and lead discovery efforts for fibrosis targets including defining and implementing critical path studies needed to support hypothesis-based research and will manage these activities in our group across multiple project teams. The candidate will also oversee and/or directly manage new and established external collaborations. The successful candidate will participate as an engaged member of a highly interactive biology department. Knowledge, Experience and Skills: Applicants must have a PhD with relevant postdoctoral training and 3+ years industry/academia experience required . The candidate will have a strong track record of scientific accomplishments, demonstrated by peer-reviewed scientific publications in high impact journals. Preference will be given to candidates with direct expertise in identifying and validating molecular targets that contribute to the pathophysiology of NASH. This should include an understanding of molecular pathways that contribute to metabolic dysfunction, inflammation and liver fibrosis and in applying cell-based assays to interrogate drug targets and therapeutics in relevant cell types including hepatocytes, myofibroblasts and immune cells. The candidate should be fluent in the use of molecular techniques to evaluate signaling networks (western blot, ELISA, proteomics), gene expression analysis (RT-PCR, Nanostring, RNA-seq), and will have a working knowledge of functional genomics and pathway analysis. The ideal candidate will have experience applying data from human transcriptomics and genomic databases to enable target discovery and validation. A working knowledge of the design and execution of in vivo pharmacology studies with relevant preclinical models is a plus.  This individual will have demonstrable skills and experience in hypothesis-driven biological research. Strong communication skills required, with an ability to communicate and scientifically engage individuals across a large breadth of levels and translate ideas and data into concise written and verbal communications. Previous experience managing scientists is required.  #LI-KW1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}