{"jobID": "2731838485", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Inference, Guest Activation", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": "Note: Due to volume of applications we receive, we kindly ask that you only apply to a maximum of one Data Scientist role from among those posted. This does not preclude you from being considered for multiple roles. Thank you. Airbnb has become a global platform connecting people to unique travel experiences, at any price point, in more than 34,000 cities and 190 countries. Continuing to grow this network for users from so many different countries requires robust data products.  The Airbnb user journey starts with our team. The Guest Activation team ensures that guests are successfully able to signup, login and book on Airbnb and inspires trust among the guest and host community.  Here are some projects and problem spaces we’re currently focusing on: Understanding the impact of removing mandatory sign-up in our mobile apps,Identifying the optimal moment in the user journey to prompt user sign up,Understanding how to facilitate seamless booking for guests while ensuring quality stays for our host communityGrowing our guest community in emerging markets through experimentation and partnershipsand many more! We have a strong team of Data Scientists, our work is highly sought-after, and our impact on the business is tremendous. If you have a proven background in this field and are excited to help build Airbnb’s community, we want to hear from you.  Some examples of traits we value: A passion for Airbnb’s mission of helping people Belong AnywhereAbility to write clean and concise code, especially in R or Python3+ years in industry experience and a Master's degree in a quantitative field, PhD is a plusSolid understanding of statisticsAbility to use data to influence business partnersNice to have: experience with data ETL, building and maintaining data pipelines."}