{"jobID": "2803127661", "jobLocation": "Houston_TX", "jobTitle": "Water Resources Scientist/Engineer Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Tetra Tech is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees-16,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion dollar company with local, client-focused delivery in 400 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams.Tetra Tech's Houston and San Antonio offices are seeking a Water Resources Science/Engineering student to fill a Summer Internship. The successful candidates will work as a team member to support water resources projects, typically under the direct supervision of a Project Manager or Task Lead. This position will potentially support federal, state, and municipal projects involving BMP design, watershed modeling, and water quality restoration planning. The desirable candidates should be enthusiastic, detail-oriented, communicative, and willing to learn new skills. RESPONSIBILITIES: Conduct research related to water resources studies including scientific, engineering, planning and policy topics Compile and compute a variety of data, and help to catalog and manage databases Analyze watershed and water quality data using GIS and statistical techniques Support watershed and water quality model setup, calibration, validation, and application Develop or prepare descriptive charts, figures/maps, and tables/matrices Support water resources planning through application of quantitative and qualitative evaluation techniques Perform writing assignments to contribute to project documentation and deliverables such as memos and reports"}