{"jobID": "2824123352", "jobLocation": "San_Antonio_TX", "jobTitle": "Research Scientist, Senior Biomedical Research Associate, and Biomedical Research Associate", "companyRating": "3.8", "companyInfo": {"Website": "www.keakitech.com", "Headquarters": "Honolulu, HI", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " Research Scientist, Senior Biomedical Research Associate, and Biomedical Research Associate Location  TX - San Antonio Job Code 4662 # of openings 3Apply NowLaulima Government Solutions is looking for a qualified Research Scientist, Senior Biomedical Research Associate, and Biomedical Research Associate to support an orthopedic trauma program in San Antonio, TX. ​​Each position varies in support requirements: Research Scientist to advise and lead the OT multifunctional animal research team in all aspects of conducting animal research to include: experimental design, protocol preparations, submissions, IACUC approvals, protocol execution, data collection, and interpretation; additionally the research scientist performs tissue level quantification and analysis of therapeutic compounds and their metabolites using mass spectrometry and high performance liquid chromatography.Qualifications: Knowledgeable in a relevant field of the life sciences. Ability to independently plan, execute, analyze, and report on their research through their graduate dissertation. Will be expected to execute their assigned tasks, and to share their findings with other members of the project team. Expected to write reports and publications, and present their findings in meetings.Senior Biomedical Research Associate to provide assistance with animal research on orthopedic injury, tissue regeneration using stem cell therapy and scaffolds; and the prevention of infection; by assisting the OT multifunctional research team with all aspects of conducting animal research to include: surgical procedures, animal handling, imaging, microscopic and molecular techniques; Performs 3-D image reconstruction and quantitative analysis of X-rays, MicroCT scans and CT Scans; performs bio-luminescence and fluorescence detection and analysis with photon capturing/counting technologies. Qualifications: Desires experience with a variety of the field's concepts, practices, and procedures. Follows instructions and guidelines to perform the functions of the job, including but not limited to relevant Standard Operating Procedures, national standards of research technical accuracy, and/or other written guidelines provided. Plans and accomplish goals, participates in development of research work plans, proposals, budgets, and agreements.Biomedical Research Associate to provide research support on orthopedic injury, tissue regeneration using stem cell therapy and scaffolds; and the prevention of infection; by supporting the OT multifunctional research team with all aspects of conducting animal research to include: surgical procedures, animal handling, imaging, microscopic and molecular techniques. Qualifications: Desires knowledge of commonly-used concepts, practices, and procedures within the particular field. Relies on instructions and pre-established guidelines to perform the functions of the job, including but not limited to relevant Standard Operating Procedures, national standards of research technical accuracy, and/or other written guidelines provided.​​ALL POSITIONS SUPPORT ASPECTS OF THE FOLLOWING PROGRAM OBJECTIVES:Conduct animal research to satisfy mission support requirementsProvide laboratory research to satisfy mission support requirementsProvide data analysis, publications, and presentationsDraft, revise, and submit DHP, intramural, and extramural funding proposals to satisfy mission support requirements. Works in collaboration with industry and academic partners to execute research to satisfy mission support requirements​Provide assistance with research on orthopedic injury, tissue regeneration using stem cell therapy and scaffolds and the prevention of infectionPerform imaging techniques and procedures to assess injury and healing of bone and soft tissue; and infectionPerform microscopic, molecular and biochemical techniques and analysis of cells and tissueProvide general laboratory, record, and tissue depository maintenanceProvide support with research on orthopedic injury, tissue regeneration using scaffolds; and the prevention of infectionPerform imaging techniques and procedures to assess injury and healing of bonePerform microscopic, molecular and biochemical techniques and analysis of cells and tissueProvide general laboratory, record, and tissue depository maintenanceDESIRED SKILLS/EXPERIENCE:Four years of experience in similar position support Federal and/or DoD programsCITIZENSHIP/SECURITY CLEARANCE REQUIREMENTS:Must be able to pass a background check to obtain access to customer facilityMust be a U.S. Citizen The Alaka`ina Foundation Family of Companies (FOCs) is comprised of industry-recognized government service firms who are designated as Native Hawaiian Organization (NHO)-Owned and fall into the respective categories of standard Small Business, 8(a) certified Small Disadvantaged Business (SDB), and HUBZone. The FOCs includes Ke`aki Technologies, Laulima Government Solutions, Kūpono Government Services, Kāpili Services, and Po`okela Solutions. Alaka`ina Foundation activities under the 501(c)3 principally benefit the youth of Hawaii through charitable efforts which includes providing innovative educational programs that combine leadership, science & technology, and environmental stewardship.  For additional information on Laulima Government Solutions, LLC, please visit www.alakainafoundation.com. We are an Equal Opportunity/Affirmative Action Employer of individuals with disabilities and veterans. We are proud to state that we do not discriminate in employment decisions on the basis of race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. If you are a person with a disability and you need an accommodation during the application process, please click here to request accommodation. We E-Verify all employees."}