{"jobID": "2829821845", "jobLocation": "Jackson_MI", "jobTitle": "Senior Business Intelligence Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.henryfordhealth.org", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1915", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "The Senior Business Intelligence Analyst delivers high quality, complex and timely reports to various business units across the organization to support a wide range of initiatives including Business Intelligence, Performance Improvement Activities, Corporate Compliance, Regulatory Reporting and Organizational Strategies. Performs, communicates and makes recommendations of database, statistical and report findings. Acts as a project manager for data/analysis/reporting projects that cross organizational lines. Identifies and seeks to address opportunities for improvement in data collection and/or current reporting processes. Collaborates with various teams and staff members to ensure that data are generated and logged accurately and meet reporting requirements. Serves as Functional System Manager for various software systems including, but not limited to; MIDAS+ Care Management, MIDAS+ Statit PPR, EPSI, Premier Quality Advisor, and Information Builders WebFocus.Minimum Education: Bachelor’s Degree with a concentration in Information Management, Computer Science, Finance, Accounting, Business Administration or Healthcare Administration with a minimum of 3 – 5 years’ experience, or equivalent business, statistical analysis, and complex reporting experience in the healthcare field with a minimum of 10+ years’ experience. Minimum Work Experience: Minimum of 3 – 5 years’ experience Required Skills, Knowledge, and Abilities: Advanced knowledge of computer software systems.  Advanced Excel skills; proficient with other Microsoft Office applications.  Excellent analytical and problem solving skills.  Logical and efficient, with keen attention to detail.  Knowledge of statistical concepts.  Effective written and verbal communication skills.  Ability to effectively speak and present to large crowds.  Willingness to teach and educate others on various financial processes.  Demonstrates leadership ability, communication and interpersonal skills necessary to interact with management, staff and other internal and external customers.  Ability to manage multiple priority projects simultaneously under tight deadlines.  Self-motivated and directed, and able to exercise independent judgment and take action on it. Preferred Qualifications: Master’s degree in Information Management, Computer Science, Finance, Accounting, Business Administration or Healthcare Administration.  Previous experience in healthcare related field.  Proficient in building and utilizing Access databases."}