{"jobID": "2817024937", "jobLocation": "Arlington_VA", "jobTitle": "Research Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.rsginc.com", "Headquarters": "White River Junction, VT", "Size": "51 to 200 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "RSG is seeking a Research Data Analyst. This position is based in our Arlington, Virginia or White River Junction, Vermont office.AS A RESEARCH DATA ANALYSTYou are part of a team that applies smartphone-based GPS survey research and analytics with the goal of better understanding behavioral change due to transportation innovation and technology. Your team conducts market research in sectors such as public and private transportation, household travel behavior, future mobility, autonomous vehicles, transportation network companies (TNC), and mobility service providers (MSP). You work on all phases of the market research process including designing and implementing research approaches and survey questionnaires; administering surveys and monitoring data; performing data preparation and database management; conducting analysis; and writing reports and presentations based on findings. You are also interested in working on survey datasets in conjunction with different types of datasets such as massive passively-collected location data, commercial marketing data, and publicly available demographic or geospatial data.  You are curious about the future of transportation mobility and its many economic and social implications. You are a strong blend of practical technical skills, research-based analytic skills, and solution-oriented project implementation skills. You are a team-player, self-motivated, a clear and concise communicator, and dedicated to high-quality work. You understand that the pace of technology and the resulting insights from data are changing quickly, thus requiring an attitude of flexibility and adaptability. REQUIRED QUALIFICATIONS Bachelor’s degree or higher in a relevant field of study such as statistics, math, economics, engineering, geography, market research, data science, or a similar field0-5 years of professional experienceInterest and/or experience in transportation, travel behavior analytics, and survey market researchInterest and/or experience in using Python, R, SQL, PostgreSQL, GitHubOutstanding communication and teaming skills with colleagues and clientsAbility to write clearly and succinctly in a variety of formats (e.g., email, reports, presentations)Ability to prioritize multiple competing objectives and deadlines across projects Position is based in Arlington, Virginia or White River Junction, Vermont.  RSG is not currently accepting H-1B applicants for this position. EEO/AA Employer/Vet/Disabled.NOTES: 2 openings.  Additional Salary Information: Salary commensurate with experience"}