{"jobID": "2754825101", "jobLocation": "Princeton_NJ", "jobTitle": "Process Development Scientist 1 (Downstream)", "companyRating": null, "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": null, "jobDescription": " Job DescriptionProcess Development Scientist 1 (Downstream)Requisition ID: 67214BR When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals. Location/Division Specific Information Princeton, NJ How will you make an impact? In this role, you will: Provide routine analyses as assigned in a biology environment by following standard practices. Assist with internal development of scalable processes with improved product yield and reduced costs in a biologics environment. Make detailed observations and reviews, document, and communicate test results. Maintain lab equipment. What will you do?Conduct routine tasks and sample analyses to support process development.Record results in notebook accurately, clearly, and regularly.Assist with preparing protocols, reports, and test methods.Maintain and ensure safe laboratory environment and work practices.Help to maintain laboratory and order common supplies.Execute, record, and evaluate experimental data appropriately, including the writing and revising of process development reports and technology transfer protocols as needed.Learn and assist with the development of recombinant protein (including mAbs) purification processes, including chromatography process, ultrafiltration/diafiltration, nanofiltration, process characterization and optimization, process scale up, scale down model qualification, and viral clearance validation.How will you get here?EducationBachelor's degree in biology, chemistry, biochemistry, chemical engineering, or a related field required.Experience0-2 years of experience in protein purification.Experience with AKTA, Unicorn software, and/or chromatography (HPLC) highly preferred.Technical writing experience highly valued.Knowledge, Skills, AbilitiesGood foundation in general scientific practice, principles, and concepts of discipline.Basic knowledge of GMP/GLP regulations in cGMP/cGLP manufacturing environment preferred.Good lab skills.Good problem-solving and critical thinking skills.Effective communication skills.Good MS Excel and Word skills.Ability to execute tasks and studies based on the deliverables.Ability to analyze and summarize routine scientific data.Excellent organization skills.Ability to properly document work and write reports.Ability to function in a rapidly changing environment.Strong attention to detail and ability to adhere to standards procedures.Physical Requirements: Position requires ordinary ambulatory skills and physical coordination sufficient to move about office locations; ability to stand, walk, stoop, kneel, crouch periodically for prolonged periods of time; manipulation (lift, carry, move) of light to medium weights up to 50 pounds; arm, hand and finger dexterity, including ability to grasp and type for prolonged periods of time; visual acuity to use a keyboard, computer monitor, operate equipment, and read materials for prolonged periods of time; ability to sit, reach with hands and arms, talk, and hear for prolonged periods of time. Lift objects up to 50 lbs. to a cart and push cart short distances on a regular basis. Stand up to 60% daily. Walk within lab and between buildings daily. Repetitive hand motions.  At Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.  Apply today! http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}