{"jobID": "2829548918", "jobLocation": "Rosemead_CA", "jobTitle": "Data Science Senior Specialist - Energy Procurement", "companyRating": null, "companyInfo": {"Website": "www.sce.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1879", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionENERGY FOR WHATS AHEADAre you looking to make a difference in your career? Were working on smarter grids, cleaner energy and tools to help people manage energy more efficiently. AboutEnergy Procurement Management (EPM) Organization: The (EPM) Organization ensures that SCE customers have enough electricity to meet their needs, through the output of SCE-owned generation plants and the purchase of electricity from independent generators. We engage in multi-year contracts from both conventional and renewable generators, and conduct day-ahead and real-time trading to serve our customers electricity demands.Position Overview:The Energy Procurement Data Science Senior Specialist will be responsible for working closely with business clients, subject matter experts, information architects, data engineers, and other team members to turn data into critical information and knowledge that can be used to make sound business decisions in SCEs Energy Procurement and Management (EPM) organization. The successful candidate will lead the development of predictive and prescriptive models using advanced statistics and machine learning methods to solve business problems in the energy portfolio planning, trading and market operations, and settlements and contract management groups.  The Data Scientist will be a creative thinker who will be responsible for modeling complex analytical problems, discovering insights and identifying opportunities through the use of statistical, algorithmic, data mining and visualization techniques. In addition to advanced analytical skills, the individual in this role should be proficient at preparing and integrating large, varied datasets, overseeing the implementation of advanced analytical solutions on an EPM data analytics platform, and communicating results.  The position will work in cross-functional project teams and reports directly to the Principal Manager of EPM Systems and Analytics. The successful candidate will have strong quantitative skills, extensive experience with modern data analytics, familiarity with big data systems, and extensive knowledge of information technology systems.Typical Responsibilities: Provide direction for data analytics in support of EPMs energy portfolio planning, trading and market operations, and settlements and contract management groupsParticipate in or lead data analytics projects that perform functions such as: access, validate, and analyze electricity usage and production data from customer meters, generators and DERs; identify behind-the-meter renewable generation resources and electric vehicle charging patterns; utilize weather data to perform analytical tasks across EPM; and other similar projectsDevelop procedures and data pipelines to extract and prepare large data sets from sources such as the energy markets, customer meter data, and transmission and distribution SCADA data to support data analytics projectsHelp improve existing quantitative models using advanced analytical toolsProvide advanced analytics expertise to EPM by participating in cross-functional predictive and prescriptive analytical projectsDemonstrate the Company values of safety, integrity, excellence, respect, continuous improvement and teamwork through decisions and actionsQualificationsMinimum Qualifications:Bachelors Degree in Computer Science, Engineering, Statistics, Information Technology, Business or related discipline3 years of experience in implementing information systems3 years of experience working with advanced analytical systems such as R, Hadoop, SAP HANA, SAS, Spark or similar systemsDemonstrated experience developing, implementing and integrating IT systems in the electric utility or similar industryDemonstrated experience participating in cross-functional project teamsDemonstrated experience in data modeling and knowledge of SQL, XML, etc.Demonstrated ability to learn and apply new technologies for data analyticsDesired Qualifications:Advanced degree in Computer Science, Engineering, Statistics, Information Technology, Business or related discipline or equivalent experienceExperience consulting with clients on the initiation, scoping, development and implementation of data analytics or IT projectsFive years of experience managing cross-functional project teamsIn-depth understanding of data analytics, data engineering, and data management processesDemonstrated experience in IT project management and agile development practicesDemonstrated experience providing consulting and advisory servicesExcellent written and verbal communication skillsCommentsThe primary work location for this position is Rosemead, CARelocation is available for qualified candidatesCandidates for this position must be legally authorized to work directly as employees for any employer in the United States without visa sponsorship.Southern California Edison, an Edison International (NYSE:EIX) company, serves a population of nearly 15 million via 5 million customer accounts in a 50,000-square-mile service area within Central, Coastal and Southern California. Join the utility leader that is safely delivering reliable, affordable electricity to our customers for over 125 years.SCE is a proud Equal Opportunity Employer and will not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or any other protected status."}