{"jobID": "2485615755", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist, Advanced Analytics", "companyRating": null, "companyInfo": {"Website": "www.hitachipowersystems.us", "Headquarters": "Basking Ridge, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company: Hitachi America, Ltd. Division: R&D;/Big Data Lab Location: Santa Clara, CA Status: Regular, Full-Time Summary Hitachi America,  Ltd. (http://www.hitachi-america.us/)  has openings for Research Scientists in the Big Data Laboratory located in Silicon  Valley. The mission of this laboratory is to help create new and innovative solutions  in big data and advanced analytics. The laboratory focuses on research,  technology innovation, proof-of-concept activities, technical marketing and  business development for novel big data solutions, leveraging Hitachi’s  technologies, reinforcing Hitachi’s messaging around big data, and establishing  Hitachi as a leader in big data.  We are seeking research  scientists in deep learning and reinforcement learning to create innovate algorithms  and solutions for smart industry, social innovation and the Internet of Things.  The successful candidate will have an  opportunity to solve challenging real world problems, work on massive industrial  data and to contribute solutions that will benefit society. This position is a  perfect match for a visionary scientist who is passionate about the unlimited  potential of machine learning/AI/data mining/statistics for solving real  problems and empowering society, industry and the things that matter.  More information  about the research done at the Big Data Laboratory can be found at:  http://www.hitachi-america.us/rd/about_us/bdl/  More information  about Hitachi IoT technology in Smart Industry can be found at:  https://www.hitachivantara.com/en-us/solutions/iot-insights/industrial-iot.html  Responsibilities:  · Research and develop innovative data analytics algorithms and solutions for smart industry, social innovation and the Internet of Things  · Prepare and execute proof-of-concepts of the solutions with customers  · Work with business units to commercialize the successful proof-of-concepts  · Protect Hitachi’s IP through patents and other activities, and publish technical results in leading venues to establish Hitachi as a leader in big data and advanced analytics.  · Ph. D degree in Computer Science or related field  · Strong research experience in machine learning algorithms such as classification, regression, and clustering - Knowledge of time series analysis techniques is a plus.  · Research experience in deep learning,  reinforcement learning and other machine learning algorithms is a plus.  · Good programming skills and knowledge of data science tools and libraries in R, Python or MATLAB - Knowledge of big data platforms such as Hadoop and Spark is a plus.  · Self-motivated and passionate about solving real-world problems and building innovative systems with big data analytics.  · Demonstrated ability to effectively create and deliver technical communications, including patent applications, presentations, papers, and reports.  · Ability to collaborate successfully with R&D; co-workers, Hitachi group company customers, partners, engineers, and business units in Hitachi with the goal of commercializing the proposed solution.  · Ability to travel within the US and internationally as needed. EOE-Females/Minorities/Protected Veterans/Individuals with Disabilities"}