{"jobID": "2826785285", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Research Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.quantlab.com", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": " We are seeking to fill the role of Quantitative Research Scientist in Houston, TX, Chicago, IL and New York, NY as part of our Research team. The successful candidate will be an independent thinker with a track record of innovative problem solving in a theoretical and preferably computational discipline—industry experience in a quantitative position is not required. What you’ll do: We are interested in you if you are remarkably responsible, both on the individual level and as part of a team, and love to share, debate and communicate with other team members to find the best solutions to multifaceted problems. What you’ll have: We are interested in both soon-to-be/recent graduates and experienced professionals who possess the following: M.S. or Ph.D. in a technical field like math, physics, engineering or similar fieldAdvanced knowledge in at least one of the following: Probability Theory and Statistics, Stochastic Processes, Time Series Analysis, Stochastic Calculus, PDEs, or any heavily theoretical area of math, physics or engineering.Experience in scripting (Python, Perl, etc.) and C++ programmingGood verbal and written communication skillsAbility and desire to work both independently and as a part of a teamBonus Points:A C++ guruWhat you’ll get:The unique opportunity to work alongside talented and passionate experts who take pride in delivering resultsAttractive compensation and bonus structureGenerous benefit plan structure including an option for fully paid health insurance premiums for individualsFree catered lunches every day with snacks and beverages provided dailyCasual dressWho we are: Quantlab Financial, LLC is a dynamic, technology-driven firm supporting a large-scale quantitative trading operation across a wide range of global financial markets. Founded in 1998, Quantlab is an established presence and one of the pioneers in quantitative investment management with a track record of consistent profitability under varying market conditions.  Quantlab Financial supports a very successful proprietary trading organization (similar to a hedge fund, but no outside investors, so we are much more stable). We invest heavily in the latest technologies, seeking to optimize performance and minimize latency throughout our trading systems. Why you should work with us: Technology and Scientific Research are central to our business and key to our success. We are constantly pushing the boundaries of technology, from high performance computing (HPC) clusters attached to petabytes of storage, to ultra-low latency hardware (FPGA, RF, servers and switches), to highly optimized operating systems, and applications developed in-house. Quantlab attracts very talented and collaborative people who bring fresh and interdisciplinary solutions to trading. Our business casual environment has an entrepreneurial spirit that encourages creativity, agility, and continuous improvement."}