{"jobID": "2625551137", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Product Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.apptimize.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Leanplum, Optimizely, Taplytics"}, "estimatedSalary": "134000", "jobDescription": "ABOUT OUR CULTUREWe are devoted to personal and team growth. We work together to become more badass, and to dominate new problems and questions. We are ambitious about constantly improving. Video showcasing our team: https://www.youtube.com/watch?v=b-HNOKoVQbwABOUT APPTIMIZEApptimize is about helping mobile teams accelerate their innovation processes through A/B testing, instant updates, and feature flags. Founded in 2013, we are 40+ people, have raised $20M+, and work with customers like the Wall Street Journal, Runtastic, Hotels.com, Trulia, and HotelTonight. Our technology lets mobile teams execute on and figure out their mobile strategy through realtime UX changes, A/B testing, targeting, feature flags, and analytics. Our customers have seen significant increases in revenue and within weeks testify that Apptimize \"pays for itself.\"https://www.quora.com/What-tools-are-there-for-performing-A-B-testing-in-native-mobile-applications/answer/Antoine-Sakho?srid=u4ybVevo customer story https://www.youtube.com/watch?v=AI-Gvo7DDj8HotelTonight case study https://www.youtube.com/watch?v=vH5_RHC8UtQABOUT THE ROLEWe are looking for an energetic product manager who is both strategic and deeply technical. Multi-billion dollar companies use our product to inform their mobile strategy, and we must constantly push the boundaries of whats technically possible. Youll work closely with our engineering team, meet with customers to understand their challenges, and stay abreast of changes in the industry, to ensure we have the leading and most innovative mobile solution on the market.RESPONSIBILITIESDeeply understand our technical differentiators, and how we can leverage them in new and strategic waysKeep up-to-date with mobile trends - everything changes quickly in this space, and we need to be and stay at the forefrontWork closely with our (technical) customers - learn their challenges, what makes them tick, the problems they face, and solutions we can offerDrive end-to-end delivery of new product features, and spearhead our go-to-market strategy around themDefine, prioritize and improve the metrics that make Apptimize a great product choiceREQUIREMENTS5+ years experience in an engineering or product role, preferably in mobileExceptional communication, leadership and technical skillsAbility to wear multiple hats, and to thrive in a demanding and fast-paced environmentComfortable jumping between the strategic and the tacticalMotivated self-starter, flexible and adaptable to change"}