{"jobID": "2605885995", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Scientist InternDo you love Disruptive Technology, Big Business Opportunities, Space, Big Data Analytics, Computer Vision or AI? We do! At Slingshot, we are charting the intersection of GIS, remote sensing imagery, machine learning, and big data technology!Slingshot employs team members from a variety of disciplines, including technical and engineering fields. We are a small team with plans for rapid growth. We currently looking to fill a new position as a Data Scientist in the Los Angeles facility. You will be in an internship position performing the exploration and application of any data and approach that will help us build solutions for our customers.The ideal candidate will have an in-depth knowledge of deep neural network, clustering, collaborative filtering, and classification techniques with experience in designing and building highly scalable distributed ML models. Research background in Remote Sensing, Computer Vision, Environmental Modeling and Mathematics are a plus.Slingshots interns will gain experience in the design and implementation of state-of-the-art machine learning algorithms in distributed machine learning frameworks such as Spark while working directly with expert engineers and highly experienced project managers. Interns will work in an agile team environment directly partnered with the project manager, data architects, software engineers, and business analysts to facilitate the development of Slingshots data platform architecture and analytical tools for delivery of user-specific products.This is an exciting opportunity for talented and hard-working students who are interested in developing the next-gen geospatial AI to gain hands-on experience developing next to top-rated developers and world class mentors.Your ResponsibilitiesResearch and model real world systems and behavior based on actual observationsHelp develop (large-scale) simulations to assess a new products complexity, yield, and feasibilityConceive of and implement experiments to test hypotheses regarding (statistical) behavior of data/models/productsHelp develop training and cross­-validation data sets for machine learning algorithmsTranslate product management, engineering, and business constraints and queries into tractable data science questionsIterate rapidly on everything; all of the above happens in a relatively fast paced business driven environment, you must be comfortable with that.Develop and evangelize our data science knowledge baseAssist in business plans/models for new servicesJob Requirements (unless you convince us otherwise):Excellent critical thinking capabilitiesMaster's Degree, or equivalent experience in Statistics, Machine Learning, Computer Science, Economics or fields with heavy focus on these disciplines.Demonstrable practical experience working with large and noisy datasets.Superb communication skills. Youll need to be able to explain yourself and your methods both within the company.Excellent data analysis & visualization skills in PythonStrong Unix/Linux skillsMust be a U.S. citizen authorized to work in the U.S.Your commitment:Full Time InternshipIf youre interested in this role, let us know. Tell us what excites you and why you would be a good fit. Looking forward to hearing from you!"}