{"jobID": "2820990209", "jobLocation": "San_Francisco_CA", "jobTitle": "Corporate Solution Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.saucelabs.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": " The Corporate Solution Engineer is the technical representative to our customers, and will actively evangelize, position, and sell the technical, architectural, and business value of the Sauce Labs testing cloud. The candidate will work closely with multiple Account Executives to co-own the sales and technical consultative strategy to become the trusted advisor for our customers and win their business.  The Corporate Solution Engineer will meet with our mid-market customers, primarily virtually and occasionally in-person, interpreting their needs, developing, prototyping and delivering solutions to provide the best possible Sauce experience for the customer. The candidate may be new to Solution Engineering, but has experience working with development, testing, and associated management, and should feel comfortable speaking in front of an audience. Job Duties and Responsibilities:Work closely with the sales team and leadership to develop and execute a strategy to win net new customers and drive expansion in our base to meet or exceed quarterly revenue targets.Using repeatable processes and tools, establish technical credibility with customers.Prescriptively map customer business and technical challenges to Sauce solutions.Deliver high impact product demonstrations based on the customers environment and testing needs.Ability to manage detailed and complicated Proofs of Value with prospects and customers.Support Marketing activities by working trade shows, reviewing documentation for technical accuracy and hosting introductory webinars as requested.Work well in a distributed team atmosphere.Establish confidence in Sauces recommendations via industry and product expertise, technical whiteboarding, RFP/RFI responses, and product roadmap discussions.This is a non-travel position, with possible rare exceptions.Knowledge, Skills and Abilities:Excellent communication and presentation skills with a demonstrated ability to read and own a room.Minimum of 2 years of experience working for a technology cloud vendor.A track record of curiosity and willingness to learn new skills.Self starter, not afraid to get your hands dirty.Familiarity with Selenium and/or appium is a plus.Grasp of programming concepts in various languages including but not limited to Python, Ruby, Java, PHP and .NET.Solid understanding of Agile development methodologies including CI.Familiarity with proxy servers, network troubleshooting and firewall configurations.Familiarity with open source testing frameworks, methodology and principles. Familiarity with SaaS solutions, concepts and business models.Bachelor's degree in Computer Science, Mathematics, or Engineering preferred."}