{"jobID": "2796728050", "jobLocation": "Chicago_IL", "jobTitle": "Research Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.norc.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1941", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "Research Scientist - AP-NORC Center for Public Affairs ResearchApply #493359/Regular Full-Time/Chicago – 55 East Monroe Street, IL/AP-NORC Center for Public Affairs ResearchJOB DESCRIPTION:The Associated Press-NORC Center for Public Affairs Research is seeking a dynamic and innovative researcher with expertise in the areas of data journalism, public opinion research, media audience research, and/or youth research to support the development of our expanding public affairs research practice. The Research Scientist’s primary responsibilities include working closely with the Center’s leadership team to develop new research specializations and projects, identify new business opportunities, develop and maintain funder and client relationships, and secure contracts and grants for research and journalism initiatives.DEPARTMENT:The AP-NORC Center is a joint research initiative created by The Associated Press (AP) and NORC at the University of Chicago. The Center combines the expertise of NORC, one of the world’s premier social science research organizations, with the unparalleled reach of AP, the essential global news network whose news reports are seen every day over all media platforms and formats by more than half the world’s population. The Center’s mission is to conduct rigorous research on key social problems and policy issues and to disseminate this research widely using the full power of AP’s global reach, thereby providing insight for informed decision-making.RESPONSIBILITIES:Providing research expertise and serving as a subject matter expert to obtain funding for, plan, and execute research studies.Contributing to strategic projects, including the new AP VoteCast product, by providing technical input and direction to staff regarding research design, questionnaire content, data analysis, and study conclusions.Independently drafting and managing contract proposals and grant applications including estimating project budgets.Communicating effectively with key strategic partners inside and outside of NORC, as well as current and prospective funders and clients to advance the Center’s strategic initiatives.Conducting business development research and using business intelligence tools to evaluate specific opportunities.Managing small teams to carry out strategic initiatives and business development opportunities, including monitoring and oversight of finances and administration for the projects.Serving as a primary funder and client contact for overall project quality and delivery.REQUIRED SKILLS:Bachelor's degree required, Master's or PhD strongly preferred.At least 6 years experience managing client relationships, complex projects, and budgetary oversight in academic research, consulting, market research, public relations, private sector, or non-profit settings.Candidates should have experience with the design and execution of social science research and disseminating research findings across a variety of platforms. Specific experience in news consumer research and trends in journalism preferred, but not required.A demonstrated record of developing new business relationships and securing funding from non-profit and commercial organizations.The candidate must have excellent oral and written communication skills and an aptitude in leading and working with project teams as well as coordinating on work conducted across the Center.Training in an array of social science, journalism, and marketing disciplines will be considered.ABOUT NORC:NORC at the University of Chicago is an objective, non-partisan research institution that delivers reliable data and rigorous analysis to guide critical programmatic, business, and policy decisions. Since 1941, NORC has conducted groundbreaking studies, created and applied innovative methods and tools, and advanced principles of scientific integrity and collaboration. Today, government, corporate, and nonprofit clients around the world partner with NORC to transform increasingly complex information into useful knowledge.  NORC conducts research in five main areas: Economics, Markets, and the Workforce; Education, Training, and Learning; Global Development; Health and Well-Being; and Society, Media, and Public Affairs.  We provide comprehensive and integrated services that span the research cycle, and offer solutions that anticipate and address critical needs in research and data science. We approach all work with deep technical expertise, a spirit of collaboration, and a commitment to scientific integrity.A TRADITION OF EXCELLENCE:As one of the oldest not-for-profit, academic research organizations in the United States, and through its affiliation with the University of Chicago, NORC maintains the highest standard of professional excellence and scientific rigor, and is committed to broad dissemination of its findings.A PASSION FOR INNOVATION:NORC’s subject matter experts and survey professionals develop and employ innovative study designs, research methods, and technical applications to derive meaningful and accurate results.A COMMITMENT TO COLLEGIALITY:NORC cultivates an interdisciplinary culture of achievement in which senior investigators from diverse fields and professional backgrounds collaborate with the next generation of researchers in an open, collegial environment.EEO STATEMENT:NORC is an affirmative action, equal opportunity employer that values and actively seeks diversity in the workforce. NORC evaluates qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, sexual orientation, gender identity, and other legally- protected characteristics.5.31.2018/ Back"}