{"jobID": "2815356853", "jobLocation": "Crystal_City_VA", "jobTitle": "Data Analyst Lead - PeopleSoft", "companyRating": null, "companyInfo": {"Website": "www.coresysconsulting.com", "Headquarters": "Alexandria, VA", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Data Analyst Lead will manage a team of fewer than five (5) data analysts to effectively identify data needed for extensive PeopleSoft Training, create the data needed for Army business processes, and replicate the data for multiple users and classroom instances.The lead is expected to have significant hands-on experience with the required toolsets, and the role is very hands-on. The lead performs all of the same activities as the data team members, including creating data supporting each IPPS-A release.Possesses knowledge of PeopleSoft Data Structure and design. Manages data for the Army Human Resources Hands on training domains, with increasing complexity through future releases.Familiar with Army Personnel and Pay business processes and the data dependencies.Prepares and edits program documentation. DUTIES AND RESPONSIBILITIES: Analyze training products to identity data needsDetermine data feeds into IPPS-A and associated transaction tables to be updatedServe as a subject matter expert to create, test, document and explain data in support of IPPS-A trainingFacilitate data review sessionsAssign data per number of users in each classroom instanceCreate classroom activity sheets and associated data sheets to be used in training deliveryWork closely with the Functional Team, Enterprise Learning Management, Security Applications, and SCRUM Application and Training DevelopersREQUIRED QUALIFICATIONS: - Bachelor degree or equivalent years of experience a minimum of 5-7 years of related experience. Must have an Active Secret clearanceAdvanced hands-on Structured Query Language (SQL) skillsProficient with PeopleSoft and creating data in support of learningMust be able to lead team to provide professional and technical directionUnderstand documentation and following standardsDESIRED QUALIFICATIONS: Hands-on training experienceExperience preparing and delivering oral presentationsData Development or Training experience for Army or DoD personnel or pay systemExperience developing training material and explaining functionality in terms understandable by usersKnowledge of current HR data, as found in the Standard Installation Division Personnel System (SIDPERS), Army Training Management System (ATMS), Army Organization Structure (AOS), Total Army Personnel Data Databases (TAPDBs) etc.Knowledge of Army Training and Doctrine Command (TRADOC) policies, guidance, standards, and procedures for implementation of automated systems training, to include New Equipment Training, Integrated Training Systems, Institutional, Operational and Self-Development Training DomainsKnowledge of the Army Learning Concept for Training and Education 2020-2040Must be a US Citizen and possess a Security Clearance due to Federal Contracting Requirements About Us: CoreSys Consulting is a Veteran Owned Small Business (VOSB) working primarily within the US Department of Defense. The CoreSys leadership team has over twenty years of project planning, execution, and maintenance of Information Technology (IT) systems. We specialize in Custom Application Development, Enterprise Architecture and Governance, DoD Architectural Framework (DoDAF), Service Oriented Architecture (SOA), CIO Support, Application Transformation and Modernization, J2EE Solutions, Data Warehousing, etc. Employees are eligible to participate immediately in CoreSys Consulting Services competitive employee benefits package, which includes medical, dental, vision, disability and life insurance as well as participation in our 401k program with a company match."}