{"jobID": "2697471874", "jobLocation": "Chicago_IL", "jobTitle": "eGRC Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.theocc.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CME Group, Intercontinental Exchange, DTCC"}, "estimatedSalary": "72000", "jobDescription": " Job Details:The eGRC Data Analyst will be responsible for ensuring data quality standards are met to achieve the organization’s vision for the eGRC platform, RSA Archer. This individual will review various datasets within Archer to ensure data is complete, accurate and valid. Additional responsibilities include, but not limited to analyzing and performing trend analysis to identify potential errors within Archer and identify data enhancements to mature and provide assurance for management reporting. Maintain data quality standards through various data analytic procedures.Extract and collect data from various modules within Archer for analysis.Parse and review Archer data which includes, but are not limited to datasets from authoritative bodies, such as the SEC, widely recognize risk and control frameworks, organizational policies and procedures as well as the risks and control activities.Mine and analyze datasets to identify incomplete or inaccurate records to remediate upon.Perform root cause analysis and prepare action plans for the remediation effort.Create reports to help detect data exceptions which may adversely impact the system and usability for end users.Identify data trends and key metrics to enhance the data model for reporting.Develop and maintain various reports for internal and external end users.Provide support on special projects as needed by the ERM leadership team. Qualifications/Education/Technical Skills: Strong research and analytical experience with data and data models.Strong experience with Excel or other data analytic tools.High level understanding of business operations and IT processes.Strong analytical, problem solving, and collaborative skills with the ability to exercise mature and timely judgment.Ability to work in a fast-paced environment with constant change.Must have excellent verbal and written communication skills.Experience with Microsoft Office desktop and server-based tools (MS Project, Word, Excel, PowerPoint, and Visio).Experience with data analytic tools.Experience working with eGRC platforms.Bachelor’s degree in related fields (Accounting, Data Science, Computer Science, Information Systems, Mathematics).3+ years of experience working a data analyst and/or data quality assurance2+ years working in Audit, Compliance, Information Technology / Security and/or risk and control related roles.CPA and CISA preferredStep 1 When you find a position you're interested in, click the 'Apply' button. Please complete the application and attach your resume. Step 2  You will receive an email notification to confirm that we've received your application.Step 3  If you are called in for an interview, a representative from OCC will contact you to set up a date, time, and location. For more information about OCC, please clickhereOCC is an Equal Opportunity Employer"}