{"jobID": "2758808015", "jobLocation": "Chicago_IL", "jobTitle": "Director of Data Engineering", "companyRating": "4.4", "companyInfo": {"Website": "www.jellyvision.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " We here at Jellyvision are the proud parents of ALEX®, an interactive employee communications platform that happens to share some DNA (and a sense of humor) with the smash-hit trivia video game YOU DONT KNOW JACK®, created by Jellyvision's founder. ALEX makes navigating tricky decisionslike choosing and using employee benefits or improving your financial wellnesseasier, faster, and more helpful, not to mention entertaining. The success of the ALEX platform has exceeded our wildest dreams, (except for the part right before we woke up where our mom was riding a giraffe), which is why we need talented folks like you to help us help ALEX take over the worldercontinue to grow and succeed. SO, WHATS THE JOB? Jellyvisions gone through some tremendous change recently, growing from 200 to 400 people, while evolving from a services to product to products company in the span of just a couple of years. We have an exciting road map, including new products and believe the best is yet to come. On the data side, we have an incredibly nuanced and powerful user analytics and audit tool, but with recent improvements in efficiency we want to do more. A lot more. Were looking for a Director of Data Engineering to help us level-up and empower our data science and data engineering initiatives with both technical vision and strong people leadership. WHO ARE WE LOOKING FOR?A technical leader This person will lead the engineers in working with the Data portion of our Product Management team to set the long term vision and the short term roadmap for our data experiments, data infrastructure and data products. This person will also work closely with our architects and the Product Engineering Director to make sure we have agreement and execution around our engineering principles.Strong experience leading teams that build data pipelines and implement data solutions Working directly with our data engineers and architects, this role will be responsible for connecting business context to technical options. Were looking to make measured investments in our data capabilities, and this role will be key to evaluating build vs. buy decisions, illuminating risks, and helping the team make smart choices in their time and technology.A great manager of people and builder of teams a coach, mentor, helpful problem solver, someone who likes building organizations where people love to come and do their best work, while having fun doing it. Someone who can help people enjoy the tasks they are doing, give them ownership over their work and help them grow in their careers.A great communicator We need someone who can help build trust and get buy-in from leaders across the organization, both in engineering and more broadly. This person will be interacting with our senior leadership to help us set a roadmap for data initiatives, so this has to be someone who can explain the value of our data strategy to leaders from Sales and Marketing as easily as engineers and data analysts.An excellent hiring manager with a deep network to tap who wants to partner with our People team to help us make sure we find, woo, retain and grow very smart, kind, collaborative, and hard-working technical talentExperience with business intelligence, predictive analytics, and machine learning a strong plus.THE SPECIFICS The Director of Data of Engineering will report to the VP of Engineering. Given that this is a leadership role, you can expect to regularly interact with our Executive Leadership team, including the CEO and other senior leaders throughout the organization as we plan our product roadmap, new product initiatives and technology vision.  You will be initially responsible for 1 engineering team, comprising 1 manager and several senior individual contributors as direct reports totaling about ~10 engineers. You will be chiefly responsible for delivery of data science and data engineering efforts to align with our company goals in the most efficient, productive and delightful manner. This will include experiments, infrastructure, productized insights and data products themselves. To accomplish this, you will also be responsible for partnering with the Director of Product Engineering to improve processes and standards such as engineering levels, hiring practices, and standards across your managers and teams.  You will be working alongside our other Directors in technology including: Director of InfrastructureDirector of QADirector of Client SolutionsDirector of ITDirector of Product Engineering This is a really key role for Jellyvision. We think we have cracked the nut on our current data efforts, and think there is a ton more we can do across our existing data in terms of sellable insights, data driven engineering and applied data science. We just need someone who can help us realize the potential in our team and in our software. We also need someone who knows how to celebrate wins, sees the glass as half full, and wants the work to be fun and enjoyable. ANYTHING ELSE? We share a commitment to excellence and a desire to work in a comfortable, friendly atmosphere, so we only hire nice, bright, funny people who are willing to work hard. Our credo is a simple one: be helpful. And we think we can be most helpful if our workforce is as diverse in thought, perspective, and culture as the people who use our products. We are looking to add amazing folks to our team who will bring diversity across many lines, including race, ethnicity, religion, sexual orientation, age, marital status, disability, gender identity, sex, and country of origin. ARE THERE ANY PERKS? Yes, we love perks.Competitive pay, 401(k) with matching and benefits. We pay 100% of the cost of premiums for medical, dental, vision, disability and life insurance for our employees (as long as you qualify for our tobacco-free discount; if youre a tobacco user, your medical premiums will be higher than $0). We also cover a really nice chunk of the cost of premiums for spouse/dependent medical, dental and vision insurance.Casual dress and a flexible schedule. Come in a sweatshirt, jeans, whatever, like everyone else here.Creative work environment. We are lucky to work in a place that is full of intelligent, talented and innovative folks. Although most hours the place is deathly quiet (we're a focused bunch), this is punctuated with hilarious outbursts and general merriment, which makes a nice way to spend the day.Free food. Every week, we stock our kitchen with free healthy snack foods, and we have a catered lunch every other week to give people a reason to hang out and eat together.Easy transportation and lots of love for folks who bike to work. Were really close to the North/Clybourn red line stop and the Halsted (#8) bus (right by the Apple Store and Mega Whole Foods too), and we have a transit FSA that allows you to dedicate pre-tax dollars to public transportation expenses. A number of our employees like to bike to work, so we also have bike storage, showers and lockers in the office. And for those without their own bike in the city, we offer free divvy memberships complete with Jellyvision bike helmets you can borrow from the office.Did we mention our yoga and meditation classes? We bring a pro instructor right to the office. Fully subsidized by Jellyvision and fully optional, btw.Oh! And we have a massage chair. Not just any massage chair, my friend. Its the Renew 2 Zero-Gravity Massage Chair by Brookstone®. Feeling a little stiff? Sit down. Relax. Feel better? Good. Okay, back to work.AND HOW DO I APPLY? We look forward to hearing about you and what you do. Make sure your application includes: A cover letter that highlights three reasons you think youd be great for the gig, focusing on how your past experience has prepared you for this kind of position. Writing is key to all we do, and we weigh cover letters heavily. We love a cover letter that really shows us your personality (check out our company bios to see the wide range of personalities weve already got in house), but dont stress if youre not a comedian. You dont have to be funny. Just be yourself. Were mostly interested in learning who you are, what you love to do, and why youd love to do it here with us.Your resumeYou will receive an auto-reply confirming that we've received your application. Please know that every single application we receive is read by a real live human being. However that kind of thoughtful review takes time, so it may take us a little while to get back to you (but we will, we promise). In the meantime, NO FOLLOW UP PHONE CALLS OR EMAILS, PLEASE. Its not that we dont love hearing from you. Its just that time spent responding to follow ups could be spentwellreading your application. Please rest assured that if you received a confirmation from Recruiting Robot, weve got your application, and will get back to you really soon. We knew youd understand.  If you still have pressing questions in the meantime, please feel free to check out our handy-dandy FAQ page! Thanks for your interest in Jellyvision!"}