{"jobID": "2699870804", "jobLocation": "Reston_VA", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.altruistahealth.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " ZeOmega, MedHOK, Wellcentive"}, "estimatedSalary": "78000", "jobDescription": "JOB ANNOUNCEMENT Altruista Health, Inc., is seeking a highly qualified candidate to join our dynamic and growing health care technology company as a Data Analyst. Recently named one of Deloittes fastest growing technology companies, Altruista Health is a leading provider of patient-centric and customizable care management and population health solutions for health plans and providers throughout the United States. Driven by a passion for innovation and technology, were building solutions that positively impact peoples lives. If you're looking for opportunities for career advancement while performing meaningful work with great people, come join one of the Washington Metropolitan areas fastest growing companies! Highlights include: A competitive compensation packageHigh quality health care planDental, vision, disability, and life insurance coverage401(k) Plan with matching contributions and no waiting periodSUMMARY The Data Analyst assists the Data Interface Solutions Team and Clients with questions regarding GuidingCare Front-end application and verifies data is correct per incoming data files from Clients. ESSENTIAL DUTIES AND RESPONSIBILITIESReceives and answers questions from both Client and Data Interface Solutions Team regarding GuidingCare.Facilitates discussions for new or changing requirement requests between Clients and the Data Interface Solutions Team.Maintains strong knowledge of GuidingCare Front End functions and/or limitations to ensure changes and specifications align to the function and capabilitiesFunctions as a SME regarding data and capabilities to be able to troubleshoot issues for clientsTranslates client needs into actionable requirements and items that need to be addressedProvides realistic expectations to clients regarding data requests and the associated feasibility and level of effortOther work related duties as assigned QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCEBachelors degree in Computer Science, Information Systems, Healthcare Management and 3-5 years of related experience is requiredMasters degree preferred CERTIFICATIONNone COMPETENCIESKnowledge of or ability to understand GuidingCare Front End functions and/or limitationsAbility to listen to and understand the needs of clients and staffDemonstrated ability to follow through,Ability to research, prioritize, multitask, organize, and problem solveAbility to translate complex requirements into actionable requirementsAbility to pay attention to details, clearly define business need and solution approach (standard configuration, workaround, or custom enhancement)Must have excellent knowledge in MS Project, MS Word, MS Excel, MS VisioAbility to work with offshore teams and clients in various time zones PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.  Tasks involve some physical effort, i.e. some standing and walking, or frequent light lifting (5-10 lb.); minimal dexterity in the use of fingers, limbs, or body in the operation of office equipment. Tasks may involve extended periods of time at a keyboard and extended periods of sitting at a workstation or desk. Tasks require:Sound perception and discriminationVisual perception and discriminationOral communications abilityWORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The tasks will generally be performed in a typical office environment. BACKGROUND CHECKS/FEDERAL HEALTHCARE PROGRAM EXCLUSION LISTS SCREENING Candidates for this position will be required to undergo a pre-employment background check. All Altruista Health employees are subject to monthly screening to ensure that they have not been excluded from the Federal Healthcare Programs (using the OIG and GSA Exclusion Lists). The Companys pre-employment background check and OIG/GSA Exclusion Lists screening program is administered in compliance with all federal, state and local laws. LOCATION/TRAVEL Preference will be given to candidates who will work from Altruista Health's headquarters, located in Reston, VA. This position may require up to 25% travel. EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER Altruista Health is an Equal Opportunity Employer and supports diversity in the workforce."}