{"jobID": "2818132826", "jobLocation": "La_Porte_TX", "jobTitle": "Manufacturing Technology Electrical Engineer/Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.chemours.com", "Headquarters": "Wilmington, DE", "Size": "5001 to 10000 employees", "Founded": " 2015", "Type": " Company - Public (CC) ", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": "PLEASE USE A WEB BROWSER OTHER THAN INTERNET EXPLORER IF YOU ENCOUNTER ISSUES (CHROME, FIREFOX, SAFARI, ETC.)As we create a colorful, capable and cleaner world through chemistry, we invite you to join our team to harness the power of chemistry to shape markets, redefine industries and improve lives for billions of people around the world.  Manufacturing Technology Engineer - E&I; Process Control Engineer  The Chemours La Porte facility located in La Porte, TX has a Manufacturing Technology Engineer E&I; Process Control Engineer position available. This is a highly visible, key role within the Company and the Technology function. This position will report to the Manufacturing Technology Manager  The responsibilities of the position include, but are not limited to, the following: Chemours is a global Fortune 100 company, operating in many countries today. We are looking for people who have a passion for delivering innovative, sustainable solutions that meet our customer needs for a better, healthier, safer life. Chemours offers an exciting place to work where thousands of innovations are introduced every year. You will have opportunities for growth through involvement in our Fluorine enterprise. .At Chemours, you will find sustainability in our vision, our business and your future. If you want to work on the leading edge of your field and have a desire to make a difference, join Chemours.The LaPorte, Texas site is one of the larger and more diverse sites in Chemours. Currently it employs approximately 165 people and manufactures sulfuric acid and Hydrogen Fluoride in two units. The site is located within a relatively short commute to many of Houstons eastern suburbs.The site is looking to add a strong professional to support two units that are critical to the Chemours Fluoroproducts businesses including Teflon® and SUVA® supply chains. More specifically, this position will provide overall unit electrical power and instrument systems support. Position Duties: Maintain and support PLCs, DCSs and area power distribution systems.Act as E&I; liaison with site design contractor for small and large capital projects. More specifically, this will involve Writing or approving project scopesMarking-up and approving all E&I; drawingsEstablishing and maintaining installation details and standardsRepresenting business unit at PHAsAssuring adherence to standards (ie. safety interlock)Providing E&I; construction, check-out and start-up support.Design and implement process control improvements.Provide guidance and training for E&I; reliability personnel, mechanics and other specialist.Assist operations in troubleshooting instrument/electrical problems.Maintain P&I;'s loop sheets, electrical drawings, safety interlock test procedures, control valve specifications and other essential E&I; documentation so they are current and complete.QUALIFICATIONS: In order to be qualified for this role, you must possess the following:  Education: BS or MS in Electrical Engineering  Minimum Requirements  B.S. in Electrical Engineering or other B.S. engineering discipline (ie. Chemical or Mechanical) with strong understanding of power distribution systems.  Five years of experience in manufacturing plant operations  Optional Qualifications  1. Process control theory (PID, ratio control, etc.)  2. Fundamental knowledge of basic process instrumentation selection/specification, calibration and troubleshooting.  3. Specific, fundamental understanding of analyzers (pH, conductivity, etc.).  4. Honeywell TDC3000 knowledge in  Specifying equipment,  Configuring network, data points, graphics,  Writing and reading CL programming, and  System backups.  5. Process monitoring capability to set-up database, building displays, creating reports.  6. Capability to maintain and develop batch sequencing logic in both DCSs and PLCs  7. Capability to tune controllers.  8. Understanding of weighing systems to provide design and troubleshooting support.  9. Safety and process interlock understanding Including fundamental knowledge of international safety interlock standards.  10. Capability to design, troubleshoot and support area electrical & instrument systems.  11. Thorough knowledge of E&I; drawings including electrical schematics, logic diagrams and P&I; diagrams.  Core Competencies - Teamwork/Collaboration - Managing For Productivity - Innovation - Engagement - Embracing Change - Communicating With Impact - Business Acumen - Build Sustainable Customer Relationships - Analysis And Judgement  3-5 years in MT organization  The following skill sets are preferred by the business unit: Six Sigma green belt or black belt certification if preferred Chemours is an equal opportunity employer.  Chemours is an E-Verify employer.  Candidates must be able to perform all duties listed with or without accommodation  At Chemours, you will find sustainability in our vision, our business and your future. If you want to work on the leading edge of your field and have a desire to make a difference, join Chemours and discover what it means when we say We Are Living Chemistry."}