{"jobID": "2756098602", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst (Hospital-Based) - Houston, TX", "companyRating": "3.1", "companyInfo": {"Website": "www.uhs.com", "Headquarters": "Minneapolis, MN", "Size": "1001 to 5000 employees", "Founded": " 1939", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "Job Description:The Data Analyst for our onsite biomedical hospital based program is responsible for the management, reporting and audit of data in the medical equipment database to ensure inventory accuracy, equipment specific details, and service coverage.• Manage equipment database for content and accuracy.• Manage warranty expirations and update schedules as necessary• Manage Vendor Contract equipment inventory lists. Update Vendor Management with status changes• Develop and implement equipment inventory audits• Develop monthly service reporting calendar and provide reports as required• Develop and maintain Committee Meeting Calendar • Provide inventory, service history, and work order reports as requested• Other duties as assigned.Knowledge, Skills, Abilities and Other CharacteristicsTime management and organizational skills.Ability to multi-task.Good communication skills, both written and verbal.Flexible in work schedule in order to meet customer needs.Ability to apply technical, industry and product expertise to increase efficiency and reduce duplication of effort.Goal-oriented.Background RequirementsBachelor’s degree or equivalent experience.1-2 years experience in inventory managementThe numbers tell it all. UHS has been in business since 1939; it operates through 85 districts and serves customers in all 50 states.Our motto? Quality. Value. Service. All of us. All the time. Now, find out what that means to you. Compensation includes base wage, 401(k). Full time opportunities offer health/dental and tuition reimbursement. Excellent career pathing opportunities as well. Learn more. Apply online today!We are proud to be an EEO/AA Employer/Vet/Disabled. We maintain a drug-free workplace and perform pre-employment background and drug testing.Primary Job Location:Memorial Hermann - Texas Medical CenterAdditional Locations (if applicable):Job Title:Data Analyst - 360 ProgramsCompany:Universal Hospital ServicesLocation City:HoustonLocation State:Texasv2"}