{"jobID": "2776426912", "jobLocation": "Dallas_TX", "jobTitle": "Technical Instructor - Data Engineering", "companyRating": null, "companyInfo": {"Website": "www.perscholas.org", "Headquarters": "Bronx, NY", "Size": "51 to 200 employees", "Founded": " 1994", "Type": " Nonprofit Organization", "Industry": " Education", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Year Up"}, "estimatedSalary": null, "jobDescription": "REPORTS TO: Managing Director, Platform by Per Scholas - Dallas LOCATION: Dallas, TX  Platform by Per Scholas is a new, large-scale, customized training effort and has contracted with a large US-based technology services company to train local talent for in-demand technology roles. We are a small, multi-disciplinary team seeking individuals who can ensure the success of this new initiative. WHO WE ARE LOOKING FOR: Per Scholas is seeking a multi-talented Instructor and Technology professional to deliver high-quality instruction to a diverse student population who are seeking to acquire skills and credentials that will prepare them for entry- to mid-level career opportunities in technology.  The Instructor must be a talented and passionate Big Data Developer with a deep understanding of Object-Oriented design and extensive experience in Java, Big Data, and Hadoop technologies. You must be self-directed, self-motivated, and comfortable making intermediate-level decisions to adapt processes and curriculum delivery based on industry demand and class needs. We are looking for someone who is both business savvy and has technical knowledge and experience to meet the talent gaps among employers in the industry. The right candidate is able to apply industry experience to a classroom setting while identifying the skill levels of students and aligning instruction to fit students needs using course materials and hands-on instruction. The Instructor collaborates with peers in working with students, and works with the Managing Director to improve policies and procedures, identify and develop new and relevant training, and assist with strategic planning. WHAT YOULL DO:Deliver training preparing students for entry-level to mid-level careers in Information Technology, which includes daily instruction, assessment administration, attendance, one-on-one tutoring, evaluation and monitoring of individual student progress daily, addressing student violations with students in a consistent manner, and moreWork in collaboration with the Director of Social Ventures & Innovation to identify and continually evaluate and evolve the training as demand new technologies become available.Work closely with the Platform Program team to identify student needs, provide necessary support, establish individualized plans for student achievement, and participate in regular student status meetings.Maintain and update Salesforce with student grades, certification, scores, and progress notes.Provide students with insight on career tracks within the field and advise on career opportunities and types of positions that would be commensurate with their skills and credentials.Work with the Program team to recommend students for particular employment opportunities.Create, submit and maintain training curricula for approval and files.Work closely with staff in other sites to ensure the integrity of implementing our modelOrder books, materials, vouchers for exams in advance of training.WHAT YOULL BRING TO US:Professional QualificationsBachelors Degree in Information Systems, Information Technology, Computer Science or equivalent and 5-plus years IT work experience, or an Associates Degree in a computer discipline with at least 5 years IT work experience.Strong team orientation desire to be part of a national learning team and to lead the team in the areas of technology.Strong interpersonal skills experience working with diverse individuals and groups with varying learning styles; experience in workforce development a plus.1-2+ years of teaching experience beneficial; Experience with curriculum, syllabus development and lesson planning a plusExperience with methods and strategies to explain and scale down severe topics to students from varying educational backgrounds.Experience with student assessment; and a talent to continuously evaluate the curriculum to identify what is working and what improvements can be made.Technology QualificationsRequired: Java, Oracle DB, JDBC, Data Modeling and Data Warehousing, Hadoop, HDFS, MapReduce, Data Transfer (Sqoop), Pig and Hive using HortonWorks.Preferred: Excel, SDLC, Coding Practices, Shell ScriptingPersonal CharacteristicsYou thrive in a creative, inventive, fast-paced startup environment with people who are passionate about their work and mission.You are data-driven, result-oriented and a forward-looking catalyst for social change.You have a collaborative and flexible work style. Youre excited to work cross-functionally with other departments and independently.You have the ability to teach in a highly interactive and hands-on styleYou have a passion for teaching othersYou are an effective communicator with strong oral and written skills.You are detail oriented, with exceptional organizational and time management skillsYou can balance multiple projects and tasks, and independently prioritize your workload.You stand behind our mission, believing that individuals from any community should have access to well-paying career positions, and that talent should be recognized and recruited from many diverse sources.WHY WORK HERE? We believe our staff is the heart and soul of the organization. Our workplace culture is challenging, supportive, collaborative and mission-driven. We take a genuine interest in career paths and work-life balance, and welcome contributing ideas from staff at all levels. Working at Per Scholas means working somewhere full of engaging, savvy, diverse people who care deeply about pushing our work forward.  Youll enjoy a welcoming and casual professional environment, self-development opportunities, innovative technology, and benefits like health care and a 401K match. If you want to work in a progressive organization, where you can build something meaningful and have fun while doing it, we would love to hear from you. ABOUT PER SCHOLAS:Per Scholas is a national nonprofit that drives positive and proven social change in communities across the country. Through rigorous and tuition-free technology training and professional development, we prepare motivated and curious adults who are unemployed or underemployed for successful careers as IT professionals, and we create on-ramps to businesses in need of their talents. Today we provide our solutions in six cities across the country: Atlanta, GA; Greater Cincinnati, OH; Columbus, OH; Dallas, TX; the National Capital Region; and New York. To date, Per Scholas has trained over 7,000 individuals, helping them build lasting, life-changing skills and careers in technology. Platform by Per Scholas, a new series of customized training tracks that put students in direct hiring pipelines with major technology employers, is an extension of the Per Scholas workforce development model. Platform students receive tuition-free hands-on training, career development resources and interview opportunities with technology employers to help take their career to the next level. QUESTIONS? If you have any questions about this role, please feel free to email our Talent team at jobs@perscholas.org. We look forward to viewing your application!  Learn more at perscholas.org and platformbyps.org. Equal Employment Opportunity We're proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity or national origin. See our full EEO statement here."}