{"jobID": "2722247992", "jobLocation": "Dearborn_MI", "jobTitle": "Board Certified Behavior Analyst (BCBA)", "companyRating": null, "companyInfo": {"Website": "www.centriahealthcare.com", "Headquarters": "Novi, MI", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Center for Autism and Related Disorders"}, "estimatedSalary": null, "jobDescription": " OverviewEvery child deserves the brightest future and Centria Autism Services is on a mission to help children with Autism Spectrum Disorder (ASD) have the best developmental experience possible while acquiring the skills to succeed in the world on their own terms. Too many children with ASD are untreated or undertreated and Centria is committed to reaching every child in need and their families with interventions based on the principles of Applied Behavior Analysis that meet – and exceed -- best practices. Our Optimal Outcomes Model(TM) looks at the whole-child, engages families in aspirational treatment planning and leverages team-based care to allow BCBA’s to focus on clinical issues and support Centria’s dedication to quality, family satisfaction and developmental outcomes. Founded in 2009, Centria now operates in 10 states and is working hard to develop approaches to sustain quality while reaching tens of thousands of children across the country; we use data-driven analytics and sophisticated software platforms to constantly evaluate our quality and performance, and develop new approaches to supporting our clients and their families on their journey.  Check out what it's like behind the scenes....  https://www.youtube.com/watch?v=1Tsc87L_Vf4Responsibilities1. Provide supervision to Behavioral Technicians working with your clients. One hour of supervision/10 hours that the technician works. During this time, offer training in the principles of ABA to both staff and parents. Also, encourage parents to participate in parent-training sessions.Train each staff member on their client’s specific behavior treatment plan before services begin.Continuously track data in weekly progress notes in the form of charts, graphs, etc. to ensure treatment is effective. Revise treatment and teaching procedures as needed.Track due dates of 3 month reviews and 6 month VB-MAPP/ABLLS. 2. Develop child-specific behavior plan in accordance with the principles of ABA. Monitor and adjust behavior plan throughout treatment period in accordance with the child’s progression.Implement new and remove old programs once mastery criterion is achieved.Submit weekly progress notes for each client with what was covered during supervision, progress on goals, and behavior graphing. 3. Conduct behavioral assessments. VB-MAPP or ABLLS at intake and every 6 months, thereafter.Functional Behavior Assessments (FBAs) 4. If certified, Conduct ADOS diagnostic.  5. Assist in developing corporate structure and in the creation of policies and procedures. Participate in weekly small group meetings and monthly large group meetingsDevelop and take on projects to improve client service and satisfactionDevelop and take on projects to improve employee performance, retention, and satisfaction.Develop quality initiatives that will improve referral source satisfaction as measured through number of referrals and subjective survey methods.General help to manage office staff for maximum efficiencyMaintain knowledge of different programs and certifications. 6. Supervising those employees who are working towards certification for BCBA, BCaBA or RBT.  7. Promote the growth of Centria Healthcare and assist in pursuit of business opportunities Building relationships with current referral sourcesPursuing and building relationships with new referral partners.Physical Requirements: The physical demands and characteristics of the work environment described here are representative of those that will be encountered by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  1. Employee must be able to able to lift 50 lbs. frequently.  2. Required to perform activities that entail: fine motor skills, kneeling, sitting on floor level, or standing.  The above list reflects the essential functions and other job functions considered necessary of the job identified, and shall not be construed as a detailed description of all work requirements that may be inherent in the job, or assigned by supervisory personnel. This job description is used as a guide only and not inclusive of responsibilities and job duties.Qualifications1. Graduate of a BACB accredited college or University.  2. Certified by the BACB as a BCBA.  3. Prior ABA training required.  4. A minimum of one year working with children with autism spectrum disorders.  5. Previous experience in supervision preferred.  6. Work positively and favorably with consumers, families, and staff.  7. Demonstrate compassion, responsibility, and cheerful attitude.  8. Excellent communication skills, analytical and observation skills. Knowledge of crisis management preferred."}