{"jobID": "2832935885", "jobLocation": "Plano_TX", "jobTitle": "Python Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sigconsult.com", "Headquarters": "Fort Lauderdale, FL", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " ComforceHealth, TEKsystems, Allegis Group"}, "estimatedSalary": null, "jobDescription": "Python Data Analyst Summary: Signature Consultants is seeking a Python Data Analyst for an opportunity in Plano, TX. The Python Data Analyst is responsible for the design, development and administration of transactional and analytical data constructs/structures, and will be coordinating others work while involved with multiple work streams. Included within those responsibilities are the areas of data access and delivery technologies. Successful candidates should have expertise in data quality, data organization, metadata, and data profiling. He or she will be working with data set sizes in excess of hundreds of millions of records, and may provide technical support on data warehouse teams. Requirements:Demonstrated ability to move from one sequential assignment to the next (work environment and priorities can change quickly depending on business needs)Demonstrated ability to move data between production systems and across multiple platforms5+ years' experience with Financial Services clientsExperience with major querying tools desiredNo OTJ except for data and systems trainingDesired Common skill sets - Oracle, VB and UNIX 5+ years' experienceOLAP/SQL Tools 5+ years' experience with MVS, Teradata, SAS, Brio or comparableHyperion desiredAbility to communicate strategies and processes around data modeling and architecture to cross functional groups and senior levelsAbility to influence multiple levels on highly technical issues and challengesRequired skillset: Strong Python, SQL, Spark, Unix skills, familiarity with AWS cloud and Big Data Tools, familiarity with SAS, familiarity with reporting tools/visualizationsAbout Signature Consultants, LLCHeadquartered in Fort Lauderdale, Florida, Signature Consultants was established in 1997 with a singular focus: to provide clients and consultants with superior staffing solutions. For the eighth consecutive year, Signature was voted as one of the \"Best Staffing Firms to Work For\" and is now the 14th largest IT staffing firm in the United States (source: Staffing Industry Analysts). With 26 locations throughout North America, Signature annually deploys thousands of consultants to support, run, and manage their clients' technology needs. Signature offers IT staffing, consulting, managed solutions, and direct placement services. For more information on the company, please visit www.sigconsult.com. - provided by Dice  Python Data Analyst"}