{"jobID": "2723939812", "jobLocation": "Addison_TX", "jobTitle": "Sr Scientist SCR (Clin)", "companyRating": null, "companyInfo": {"Website": "www.marykay.com", "Headquarters": "Addison, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JOB PURPOSE  Provide a high level summary of the overall purpose, scope and objective(s) of the job that explains why the job exists.  Responsible for developing, designing, and executing moderately complex biophysical research and claims substantiation studies both in-house and off-site. Perform routine laboratory experiments based on existing biophysical studies, quantify data, conduct statistical analyses, interpret test results, verbal and written communication of study results , and makes claim-related recommendations to various product departments. This position supports various Research & Development groups including Product Development and Global Brand Development as part of the New Product Development process. ESSENTIAL DUTIES AND RESPONSIBILITIES List duties and responsibilities that illustrate how the job is accomplished. Include for each the complexity/scope, independent judgment/ decision making and impact of errors. Include approximate percentage of work time spent on each item. Percentages must add up to 100&. Conducts biophysical studies requiring an intermediate level knowledge of statistical analysis, study design and project development. Projects can require complex design using methodological precedents as guidelines. The incumbent develops or is assigned a project with direct application to product development, designs appropriate research methodology, and conducts research with limited technical guidance. 25&Investigate and design unique test methods to support novel instrument product substantiation. Knowledgeable of a wide range of biophysical techniques and methodologies applicable to solving complex problems, and knowledgeable of outside testing laboratories which can perform analyses critical for solving complex problems 25>Works cooperatively with other work groups as part of new product development. Completes assigned project responsibilities, communicating individual plans, results, and issues promptly to maximize team success. Work is performed with limited direction. 15&Oversees designated areas of biophysical testing, including product preparation, instructions, study execution, preparation of case report forms, and data for analysis and reporting. Complete statistical analysis for evaluation of study data set and provides business implication/interpretation to data; Communicate results through written top lines and final reports. May be required to present data in group settings and report data to various teams through verbal presentations as requested by supervisor. 25&Participates on project, research, and organizational teams. Represent the department in providing solutions to a variety of problems as requested by Supervisor. Provide solutions for formula modifications and project direction. Assists project team with incorporating results into team decisions. With management input, determines if advanced statistical analysis is appropriate for data interpretation and implications of results. Assists in reviewing various product claims documents for technical accuracy, including evaluation of corporate product vision statements (CPV), market advertising copy for product labels, inserts. 10& In addition to the above, incumbent is expected to meet the required competencies for this position as defined in the competency profile.  KNOWLEDGE, SKILLS AND ABILITIES  Indicate the required minimum level of education, experience and skills generally required to successfully perform the responsibilities of the position.  Education BS/MS degree in science related fields.  Experience 3/1 through work experience in one or more of the cosmetic, chemical, pharmaceutical, or medical device industries. Must be able to apply standard scientific principles, concepts and techniques to develop, design and interpret scientific studies. Regularly reads and understands concepts from the published literature and applies this learning to biophysical study design and research for product claim substantiation.Must have efficient written and oral communication skills in order to write accurate reports and memos and effectively interact with co-workers, supervisor, management, and other MKI technical groups.Must be able to manage multiple projects simultaneously with limited supervision. Must be detail-oriented.Must possess interpersonal skills to effectively work with other members of a team to accomplish group goals.Must understand and be able to apply appropriate statistical analysis dependent upon study design and utilize appropriate methodology in testing evaluation as defined in department protocols.Must be proficient in Microsoft Office programs (Word, Excel, & PowerPoint)Ability to perform duties under direction and independently perform assignments with only general criteria for expected results and in determining technical objective of assignments.Proficient understanding of Good Laboratory Practice guidelines and laboratory standards."}