{"jobID": "2701241887", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.newcareers.com", "Headquarters": "Harrisonburg, VA", "Size": "1 to 50 employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION OVERVIEW:Our client, located in San Diego, CA is looking for a Senior Data Scientist for detailed analysis work in a client facing role supporting account acquisitions, application decisioning rules, and account management. This is a financial services company which requires significant experience in the financial services, or banking, or fraud protection industries. Our client offers an exceptional benefit package and work/life balance resulting in very low turnover and long employment tenures. If you're looking for a position you can enjoy for years to come working on innovative technologies within an industry leader, this could be the position for you! This is a Direct Hire position, not C2C, not contract, with no visa sponsorships available of any kind, and we do not work with any third party consulting firms. You must currently live in the United States to be considered for this role. Please do not apply if you are looking for a contract position. This is not a remote position, and relocation is not available for this role, please consider that before applying. RESPONSIBILITIES:Explore new analytical solutions to data integrity and fraud detection and design innovative solutionsLead a variety of analytical projects from initial concepts through solution development, documentation, and implementationWork collaboratively across the organization establishing suitable analysis parameters and performance objectivesDetermine appropriate requirements for decision tools and implementation plansDeliver presentations and communicate effectively to end users with varying levels of technical knowledge on analysis resultsProvide analytical expertise and support to the field sales teamREQUIREMENTS:Bachelor's Degree is required, preferably in CS, Statistics, or MathematicsAdvanced to Expert level Financial Services or Fraud Analytical ExpertiseAdvanced to Expert data analysis and statistical modeling experience in a Unix/Linux environmentSAS programming experience is requiredExcellent communication skills are necessary and must feel comfortable presenting in front of groupsNICE TO HAVE SKILLS:R, Python, and/or Java development experienceAdvanced post-graduate degrees preferred This is a direct hire position with no visa sponsorships available, and we do not work with any-third party consulting firms.  Local candidates are preferred for this role because this company does not offer a relocation package, nor do they reimburse for travel expenses to the interview. Please consider that before applying."}