{"jobID": "2800363686", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst - Internal Audit", "companyRating": "3.4", "companyInfo": {"Website": "www.aon.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1892", "Type": " Company - Public (AON) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Aon is looking for a Data Analyst - Internal AuditOverview of Internal Audit Department: Aon's Global Internal Audit Department reports directly to Audit Committee of Aon Corporation’s Board of Directors. The global department has approximately 76 team members located in Chicago, London, Amsterdam, and Hong Kong and performs reviews in over 100 countries in all business lines. The department’s primary mission is to evaluate the adequacy of Aon’s internal control environment and to assess compliance with corporate policy and designated laws and regulations. Position Summary: This exciting position will impact the overall success of the Internal Audit Global Data Analytics Program through the development of innovative and advanced data analytics and visual reporting, building and maintaining effective processes around the analytics program, translating risk focused initiatives into advanced analytics that will serve to improve and optimize the departmental strategic initiative. This role also oversees and performs the data discovery, collection, and acquisition procedures, documents and maintains the library of analytics, and integrates analytics into the current process and designs analytic-enabled testing programs. This is a highly visible position collaborating across Aon with both technical leaders and business stakeholders. Ideal Candidate: The ideal candidate will have an ability to innovate, collaborate, and comfortable with ambiguity and working in uncharted territory. Have a deep interest in combining data science, business concepts, and technology. Have an analytical mindset, exceptional analytical and problem-solving skills.  This progressive individual will engage cross functionally with global teams, internal leadership, and external resources; to facilitate understanding and access to data necessary to achieve data analytics objectives. This is a highly visible position requiring excellent visual reporting, written and verbal communication skills and the experience and ability to manage multiple projects simultaneously in a matrix environment. Key Responsibilities:This role represents a critical component to our growth strategy and is where much of the innovative early thinking takes place on fraud detection and other data driven risk analytics projectsYou will have an opportunity to apply your expertise in an innovative way and be part of our exciting growing teamYou will collect requirements and design advanced analytics ranging from descriptive to predictive models, machine learning techniques and further AI and RPAYou will function as a subject matter expert in our global audit projects reviewing areas where advanced analytics, machine learning, AI and RPA are utilizedYou will monitor incoming data analytics request, execution of analytics as requested, and distribution of the results in an efficient and effective mannerPlan and moderate the periodic data analytics champions meetings and communicate required information with the teamDevelop, implement, support, and maintain data analytics protocols, standards, and documentationAs part of the analytics services, analyze complex data, identify anomalies, trends, risks, and provide useable insight to improve internal controls.Prepare documentation and analytic dashboards/reports that effectively and efficiently provide summarized results, analysis, conclusions to stakeholders, with supporting details readily available.Address ad-hoc analytics requests and facilitate needed data acquisition, as needed, to support internal projects, special projects, and investigations.Contribute to internal activities for overall process improvement, efficiencies, and innovationCommunicate the data requirements and ensure the global team receives access to the source information needed, understanding of the data relationships to the business processes.Assist global teams with the use of inquiry of key systems to facilitate understanding of data in the business process.Participate in department technology leadership work streams on support, knowledge management processes and use of tools.Prepare written summaries to accompany results and maintain documentationAble to understand business requirement and communicate effectively with business stakeholdersClearly explain what the data and results indicates and how it can be utilized to support the project objectivesSkills Required: The role requires a mixture of multidisciplinary skills ranging from an intersection of data science, communication and business acumen. The key skills required for this position are: Data Science and Data AnalyticsExperience in gathering, cleaning and analyzing large sets of data2+ years of experience in database management systems such as SQL, Oracle, or other RDMSMinimum one year of experience with analytics/statistical software language such as R, Python, or othersSignificant experience in gathering, cleaning, and analyzing large sets of data (1TB)Sound knowledge of data management and data privacy conceptsExposure to cloud ERP systems such as Workday Finance is a plusETL and exposure to multiple cloud and hybrid application connection methodologies is a plusStatistical computing package e.g. SAS, SPSS and others is a plusBusiness AcumenMinimum 2+ years' of experience working in Data Analytics with a business teams such as Internal Finance, Audit, IT and or similar environmentAbility to learn, adopt, and apply Aon business/concepts in short amount of timeDevelop analytics solution using your technical and business domain knowledgeVisualization & ReportingExperience with QlikView/QlikSense, Tableau or alternative data visualization packagesAbility to visualize the analytics results in effective mannerHave an artistic approach when creating dashboards and reportsAble to collect, analyze requirements from global teams and develop visualization and reportingCommunication & PresentationStrong communication skills and a desire to work in a team environmentExperience communicating technical concepts to a non-technical audienceExcellent verbal and written communication skillsStrong organizational and multi-tasking skillsWork Experience: 2+ years of data analytics experience with a professional services firm, business facing teams finance/internal audit/analytics group, or similar environment. Professional Education: BA or BS in management information systems, computer science, finance, business, operations management, statistics, engineering, or related field required. Certification in visualization software(s) is a plus. Advanced degree in above areas is a plus. We offer you A competitive total rewards package, continuing education & training, and tremendous potential with a growing worldwide organization. Our Colleague Experience: From helping clients gain access to capital after natural disasters, to creating access to health care and retirement for millions, Aon colleagues empower results for our clients, communities, and each other every day. They make a difference, work with the best, own their potential, and value one another. This is the Aon Colleague Experience, defining what it means to work at Aon and realizing our vision of empowering human and economic possibility. To learn more visit Aon Colleague Experience. About Aon: Aon plc (NYSE:AON) is a leading global professional services firm providing a broad range of risk, retirement and health solutions. Our 50,000 colleagues in 120 countries empower results for clients by using proprietary data and analytics to deliver insights that reduce volatility and improve performance.  By applying for a position with Aon, you understand that, should you be made an offer, it will be contingent on your undergoing and successfully completing a background check consistent with Aon's employment policies. Background checks may include some or all of the following based on the nature of the position: SSN/SIN validation, education verification, employment verification, and criminal check, search against global sanctions and government watch lists, fingerprint verification, credit check, and/or drug test. You will be notified during the hiring process which checks are required by the position.  Aon provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, age, disability, veteran, marital, or domestic partner status. Aon is committed to a diverse workforce and is an affirmative action employer.  DISCLAIMER:  Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time."}