{"jobID": "2745362762", "jobLocation": "Piscataway_NJ", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.primussoft.com", "Headquarters": "Duluth, GA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "122000", "jobDescription": "Description: Administrator performs the installation, configuration, and day-to-day tasks associated with ensuring the smooth and efficient operation of a WebSphere runtime environment, to include the design and implementation of infrastructure from specifications, configuration and deployment of applications, connecting to back-end resources, and advanced troubleshooting of moderately complex software applications. Deployment, administration and operational support of (production, staging, test and development) environments for multiple projects using WebSphere Application Server. Under general direction, devises or modifies procedures to solve complex problems. Work with the development staff to determine project requirements for test/production environments. Competent to work at the highest technical level of all phases of applications server activities. Keep current with emerging software enhancements, security patches and bug fixes. Monitor application server performance and respond appropriately. Modifies, installs, and prepares technical documentation for system software applications. Monitors systems capacity and performance, plans and executes disaster recovery procedures, and provides Tier 2 technical support. Provides high level written communications such as white papers, decision documents, or research papers Identify, escalate and document production impact issues for the environment to confirmed delivery for client and business notification. Position requires the candidate to be highly flexible in hours of work because of its customer-facing, highly available infrastructure necessity. Experience with Web-based applications, SOA (Services Oriented Architectures) and Web application servers ( BEA Weblogic, Websphere). Competency in relational database structures and SQL. 5 to 7 years of experience. **Please insert your unique job description or complete each of the sections below***JOB TITLE: Please indicate true job title if the selected Fieldglass option is too general or too specific. JOB DUTIES: Candidate will be building and enhancing our real-time streaming analytics platform at Client's leveraging text analytics tools + machine learning algorithms to gain insights into various data streams. MUST HAVE SKILLS:Must have experience developing with IBM InfoSphere Streams or similar real-time analytics tool.Experience with unstructured data parsing using tools such as IBM Watson Explorer Content AnalyticsExperience with machine learning leveraging Tensor Flow or other similar Python or R packages.REQUIRED SHIFT: Standard business hours + presence on some production changes after hours"}