{"jobID": "2837672035", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Analyst Quality Operations", "companyRating": "3.4", "companyInfo": {"Website": "www.morningstar.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (MORN) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Thomson Reuters, FactSet, Bloomberg L.P."}, "estimatedSalary": "70000", "jobDescription": " The Group: The Product Capabilities group is a product development  organization that provides software platforms, services, and  components fueling Morningstar s product portfolio across client  segments. This diverse set of teams develop software for truly  differentiated capabilities, including robo-advice engines, research  software, portfolio software, and investment reports. This group is  also responsible for Morningstar s web-based Cloud and  native-app Mobile platforms. Nearly every Morningstar product  leverages something from the capability teams, whether as a building  block or an entire application. We build software users love, at  scale.  The Role: Morningstar s Advice Engines team helps investors reach  their goals by incorporating proprietary research and methodology into  sophisticated analytical engines that power internal and external  applications. The team is seeking a quantitative analyst to bring a  unique perspective to quality assurance and operational workflow  management. In this role, you will work alongside research, product  management, development, and quality assurance teams to gain in-depth  understanding of complex financial planning and investment management  methodologies and implementation. Combining analytical skills with  product knowledge and operational expertise, you will take ownership  of applying innovative testing strategies to ensure application  quality. In this role, you will have the opportunity to develop into a  product specialist involved in all phases of product life cycle. Responsibilities: Develop in-depth understanding of Advice Engines methodologies,  operations, and implementations (including Wealth Forecasting Engine,  Automated Portfolio Construction, etc.)  Develop innovative test strategies and tools for multidimensional  problem space  Develop, execute, and maintain regression and impact analysis test  suites  Lead the execution of product maintenance activities  Participate in functional, performance, and automated testing  activities  Develop the ability to serve as a conduit between product,  research, technology, and external clients  Use data driven decisions to develop and test hypotheses to guide  next steps in product development, testing, and client support  Function as an integrated and engaged member of scrum team Minimum requirements: Bachelor`s degree in information technology, mathematics,  engineering, or similar field  Demonstrated skill in at least one scripting language such as  Python, Ruby, R, etc.  Some knowledge and willingness to learn more advanced models (e.g.  optimization, Monte Carlo simulations, etc.)  Familiarity with Agile development framework and experience  working as a member of a scrum team  Ability to implement basic hypothesis testing  Strong attention to detail, excellent verbal, written, and  analytical skills  Knowledge of web technology and XML and proficiency with Microsoft  Office  Ability to multi-task and manage several projects at any given  time  Knowledge of established QA practices and the software development  lifecycle  Demonstrated skill in at least one statistical package, fluency  with quantitative techniques, and familiarity with SQL, and a  demonstrated ability to extract data from any relational database  001_MstarInc Morningstar Inc. Legal Entity"}