{"jobID": "2767424361", "jobLocation": "San_Francisco_CA", "jobTitle": "Health Data Analyst IV", "companyRating": "3.2", "companyInfo": {"Website": "www.blueshieldca.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 1939", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": "Collects, analyzes and synthesizes data; develops information to guide business decision making for BSC populations' health management, cost of health care management, quality of care, and network design and strategies. Responsibilities Low Complexity: one or two sources of data, descriptive statistical methods, one or two clinical areas. No coordination with analysts in other Departments is required Moderate Complexity: three or four sources of data, univariate statistical methods, statistical graphics, three or four clinical areas. Requires consultation and coordination with analysts in other Departments but not reconciliation of analytical approaches High Complexity: more than four sources of data, multivariate statistical methods, statistical graphics more than four clinical areas. Requires consultation and coordination with analysts in other Departments and reconciliation of analytical approaches Mastery of Medical Informaticist I, II & III responsibilities. Conducts independent analysis of high complexity under minimal supervision and guidance. Develops innovative analyses and reports using understanding of the business need for information. Develops analytical methods so that they may be subsequently delegated for production to Informaticists at lower levels. Produces analysis of high complexity under the guidance and direction of Medical Informaticist IV, supervisor or manager. Communicates analytical results in presentations, abstracts, graphs or summaries with minor editing and input from supervisor or manager. Develops documentation and creates and executes workplans for analyses of high complexity. Workplans may coordinate the activities of Informaticists at lower levels and may involve collaboration with more than one team. Designs, builds, and enhances data systems and analysis methods so that they better serve complex, high level reporting requirements. Critically reviews and revises existing analytical processes for currency, efficiency, and sufficiency. Identifies existing inefficiencies and problems and takes action to implement solutions. Anticipates unrealized problems and and takes action to implement solutions. Designs, implements, and manages complex data structures and analysis systems. Creates system QA processes and documentation. Functions as facilitator and mentor for analysis workgroups. Provides training and mentoring for team members on best practices for analysis and reporting; assists in the development of supplemental analytic training tools and materials; conducts formal training sessions for lower level analysts and analysts in other Departments. Supplies consultative advice to analysts in other departments and business units regarding standard business rules and analytical methods. Provides coordination and oversight of the peer review of analyses for accuracy and completeness. Assesses business risks associated with analytical processes and data systems and develops strategies to mitigate risks. Uses appropriate technical, clinical, and financial knowledge to assess the completeness and reliability of data and the validity and accuracy of analytical results. Produces accurate work under tight deadlines Communicates analytical results so that they are easily understood by non-technical persons. Continuously refines and expands the technical, clinical, and financial content knowledge required to successfully complete these duties. Other duties as assignedAdditional Job Description:Analyze changes in provider reimbursement terms and recommends more cost-efficient alternatives. Develop models; collect and evaluate data, analyze results. Summarize detailed revenue/expense data and compare summarized claim data against fee schedules and contracts. Produce contract performance reports, modeling of reimbursement rates, evaluation of financial contract modifications and compiling and monitoring key managed care statistics. Conducts analysis, pricing and risk assessment to estimate financial outcomes. Provides financial information to produce revenue forecasts and financial reports. Provides financial analyses, responses and communication to product areas.May gather, analyze, prepare and summarize recommendations for financial payments/plans. Design and produce analyses/reports for department and/or management. Responsible for comprehensive and accurate peer review of other analyst work product. Education/Requirements Requires an MPH, MBA, MS, MA, RN, or RHIA in health science, quantitative social science, public health, health svcs research or business, or BA/BS with demonstrated equivalent work experience. PhD or MD strongly preferred. Knowledge: Requires mastery of at least five of the following and facility with at least two additional of the following (must include two of the health/clinical knowledge categories): clinical coding, clinical treatment, large-scale health databases, health statistics (e.g., epidemiology or health services), program evaluation methods, data management methods, econometrics, quality measurement methods, mathematical/statistical modeling, statistical graphics, process control statistics, health insurance business principles, general business/finance principles. Must have sufficient familiarity with the technical, clinical, and financial concepts necessary to adequately perform the duties described above. Skills: Requires ability to use MS Office, esp. Excel and Access, Unix, SQL/PL-SQL, SAS, SAS/Stat, SAS/Graph, and any specialized SAS packages required to exercise specific Knowledge capabilities (SAS/Macro, SAS/ETS, Enterprise Miner, etc.) with minimal supervision and support. Competencies: Must be able to develop computer programming systems using Base SAS, SAS Macro Processing, and PL-SQL. Must be able to develop programs and scripts that can be used to repeatedly generate reliable results, such as summary data tables or routine analysis. Must be able to calculate multivariate statistics and to prepare complex statistical graphics (star plots, diagnostic regression plots, etc.). Must be able to design applied statistical clinical studies. Requires expert knowledge of clinical risk adjustment, burden of illness scoring, episode analysis, and provider profiling. Must exhibit level-appropriate competence in Departmental competency dimensions (Communication, Agile Learning, Business Knowledge, Creativity, Critical Thinking, Customer Focus, Drive for Results). Certifications: SAS Certified Base Programmer Credential or equivalent required. SAS Certified Advanced Programmer Credential or equivalent required. Minimum Experience Level Requires five to 10 years experience in Health Care (managed care, academic, or gov't payer), Typically has 5 or more years experience as a Health Data Analyst, Medical Economist or related role in a health care setting.Job Required Education/Experience:College degree with at least a minor in mathematics, statistics, computer science or equivalent business experience. Typically requires at least six years of professional experience for lead level.Typically requires at least three years of health care industry backgroundStrong analytics skills and technically savvyBe fluent in excel. Experience with VBA Coding is ideal.Be comfortable working with data. SAS experience or programming experience with data is desired.Have intellectual curiosity and be a self-starterStrong problem-solving skills"}