{"jobID": "2822137800", "jobLocation": "San_Francisco_CA", "jobTitle": "Regulatory Affairs Specialist", "companyRating": null, "companyInfo": {"Website": "www.entrotechlifesciences.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We looking to fill an open Regulatory Affairs Specialist position at our small, but growing medical device company located in downtown San Francisco, CA. The ideal candidate is a highly-intelligent, self-motivated and personable individual seeking to build upon their previous Regulatory Affairs experience and help our company organically grow from a small start-up into a large Life Sciences company. Primary responsibilities include:• Managing and Maintaining ISO 13485 & FDA Medical Device cGMP-compliant Quality Management System • Supporting & guiding Sales, Marketing, Manufacturing, and R&D; teams with regulatory compliance • Performing risk management activities, adapting and enhancing existing QMS standard operating procedures (SOPs) • Maintaining Design History Files and Lot History Files for multiple medical devices currently on the market • Preparing FDA filings for novel medical devices (510k, PMA, etc.) • Analyzing data & writing professional reports • Conducting audit readiness activities Secondary responsibilities include:• Planning and Managing R&D; & commercialization cross-over activities (labeling changes, design up-revisions, documentation for scale-up) • Assisting with the design, development, & testing of new medical products • Co-developing regulatory-compliant press releases, marketing brochures, product artwork, etc. • Creating, preparing, & reviewing business presentations & documents Candidate Requirements:• Bachelor’s degree (STEM, medical, or law background strongly preferred but not required) • Previous Regulatory Affairs and Quality Management Systems experience (Med Device/Biotech/Pharma strongly preferred) • MUST be a team player with strong written & verbal communication skills • Ability to quickly learn new skills to interface and support outside business units • Diligent, self-motivated w/ strong work ethic, & ability to meet deadlines • Strong attention to detail • In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document IRS I-9 About entrotech life sciencs inc.:Our small teams of talented scientists/engineers design, develop, manufacture, & commercialize life-saving, breakthrough medical technologies. If you are interested in working on small teams to develop new medical devices that solve some of the most challenging problems in healthcare and medicine- look no further. Our mission is simple: Saving Lives. No matter where a patient is- on the battlefield, in the middle of surgery, or in an ambulance- our company is strictly focused on creating medical devices that save lives. We create, develop, manufacture, and commercialize medical devices that solve some of the most challenging and important problems in medicine today. Our company has two primary areas of focus: 1) Infection Prevention medical devices for hospital use, and 2) Medical Trauma and Casualty Care devices for First Responders and Battlefield medics. entrotech life sciences inc is a small, growing medical device start-up company based in San Francisco's Financial District. Our small teams take projects from ideas and prototype devices all the way through FDA clearance/approval and hospital/battlefield use. We have over 10 medical devices currently on the market, and many more in various stages of development and commercialization. www.entrotechlifesciences.com www.entrotech.com"}