{"jobID": "2809469543", "jobLocation": "San_Francisco_CA", "jobTitle": "Algorithm Engineer/Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.motivworks.com", "Headquarters": "Seattle, WA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": " At Motiv we are creating a revolution in wearable technology. We see a future where we can learn more about ourselves, what motivates us, and discover meaningful insights to reach our personal goals. That is why we are designing the first solution that will truly become an extension of you.  Something so small and comfortable that you will forget you are wearing it, so subtle that you will never have to take it off, and so stylish that you will never want to take it off.  And it is what is inside that really counts. Motiv's advanced sensors and analytics provide real and actionable insights to connect the dots in your life and discover new patterns to help you achieve your very best. What you will bring We are hiring an Algorithm Engineer/Data Scientist that is passionate about taking wearable technology to the next level. This position will report to our Director of Data Science, who has track record of delivering top-performing wearable products to the consumer market. We are looking for someone that is exceptionally excited about working with stochastic biological signals to derive meaningful consumer insights. This individual must be meticulous and tenacious in their pursuit of high-performing wearable solutions. What you will get We are a very small team of A+ players. Accordingly, you can rest assured your hard work will be deeply valued. Additionally, you will have the opportunity to see your innovations impact and evolve our product into a market leading wearable technology. We offer a competitive compensation package with meaningful equity and health benefits. Join our quickly growing team of amazing people and you will most certainly enjoy your days at our casual, creative, and innovative SOMA office. Where you have been Minimum of 3 years experience deploying production-grade algorithms preferably in the wearable technology and/or medical device sectors. Minimum of a Bachelors of Science in a discipline such as Electrical Engineering, Computer Science, Mathematics, or similar technical field. MS/PhD candidates are preferred. However, relevant experience and the ability to develop production-ready algorithms are more important than educational pedigree. Background in signal processing and machine learning with the desire to stay current in those fields. Should be familiar with techniques for adaptive filtering, classification, model generation, and clustering. Experience prototyping algorithms in Matlab or Python. Experience deploying algorithms to one or more of the following: device firmware, mobile applications, and/or cloud-based solutions. Strong awareness of computational complexity and available resources is mandatory. Ability to read, understand, and prototype algorithms based on published scientific literature. Experience with accelerometer and photoplethysmography signals is desired. Experience with gesture recognition is preferred. Fluent in C and MATLAB or Python. Is a friendly and articulate team player. Is able to interact with the hardware, firmware, software, and design teams to design, deploy, and debug product features."}