{"jobID": "2706213183", "jobLocation": "Marina_del_Rey_CA", "jobTitle": "Sr. Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.dollarshaveclub.com", "Headquarters": "Marina del Rey, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "154000", "jobDescription": " ROLE SUMMARY:  Were seeking a Senior Software Engineer who specializes in data pipelines, large-scale data processing and distributed systems. This DATA ENGINEER will be a member of the Data Science & Engineering Team, which is a Center of Excellence for Data Science, Data Transport and Cluster Computing at DSC. They will operate in a cross-functional squad with business stakeholders, product managers and engineers from other teams to create data-enabled features in both internal and customer-facing applications. Key to success in this role will be strong curiosity and drive to learn technologies and architectures that create scalable, reliable and secure data services.  RESPONSIBILITIES: Architect and maintain our data Infrastructure on AWS, including:Data Lake (Redshift)Cluster computing resources (Apache Spark)Distributed messaging and streaming platforms (Apache Kafka)Distributed storage (S3)Design and implement data applications on cluster computing and streaming enginesDesign and implement data processing microservices and pipelinesIntegrate with our vendors to collect and ingest second-party data into our data lakeWork with data scientists to enhance our software with the latest in machine learning algorithms and predictive modelsCollaborate to ensure the integrity and cleanliness of data sources, and to support the requirements of downstream data consumersMentor and guide team membersEstablish and communicate team standards and best practicesCollaborate in a cross-functional squad with business stakeholders, product managers and engineers from other teams to create data-enabled features in both internal and customer-facing applications QUALIFICATIONS: Enthusiasm to work in a fast-paced engineering teamBS or MS in Computer Science or a related technical field; or equivalent work experience4+ years of prior experience with general software development3+ years experience working with data infrastructure in several of the categories listed aboveFluency in SQL or equivalent query languageExpertise in Python, Java, Scala or similar programming languagesExperience working in the following domains is preferred: data mining, machine learning, statistical modeling, distributed systems, stream processing, data warehousingExpertise with the following is a big plus: Spark, MapReduce, Kafka, Kinesis, Storm, Redshift, PostgreSQL, Apache Airflow, Python, NumPy, SciPy DSC CULTURE:  We work in an open-air, freshly renovated office in the heart of Silicon Beach. As we disrupt industries and unseat corporate giants, our plan is to think big, but stay small. No egos. No jerks. No prima donnas. Just awesome folks who live and breathe collaboration and dig the perks like haircuts, weekly food trucks, and team happy hours. And yes, we have snacks. -----------  Dollar Shave Club is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, [sexual orientation], national origin, disability, or protected veteran status. Reasonable Accommodation: Dollar Shave Club provides reasonable accommodation so that qualified applicants with a disability may participate in the selection process. Please advise us of any accommodations you request in order to express interest in a position by e-mailing: accommodations@dollarshaveclub.com  Please state your request for assistance in your message. Only reasonable accommodation requests related to applying for a specific position within Dollar Shave Club will be reviewed at the e-mail address supplied.  Dollar Shave Club will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.  Thank you for considering a career with Dollar Shave Club  #LI-CB1"}