{"jobID": "2823350173", "jobLocation": "Berkeley_CA", "jobTitle": "Web Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.3drobotics.com", "Headquarters": "Berkeley, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": "About 3D Robotics: 3DR makes advanced drone technology accessible to the construction, mining, and surveying industries for use in data analysis, mapping, 3D modeling and more. 3DRs flagship enterprise product Site Scan is a complete camera to cloud system that makes it safer and easier than ever for enterprise and commercial users to collect and process aerial data, perform inspections, and improve business operations. For more information on 3DR, please visit 3DR.com. The Role: At 3DR we are building the best aerial analytics package, Site Scan. We are looking for a front end developer to enhance the web team and work directly with product and design teams to build and deliver a platform of tools and visualizations that meet the high demands of our customers. You: 3+ years frontend experienceUndergrad degree in computer science or similar (multidisciplinary, weird minors, and circuitous careers a plus)Deep JavaScript and HTML standards knowledgeCSS fluent, comfortable with SASS or LessHave shipped a single page React appCommitment to quality through intelligent testingFamiliar with user experience and interaction design principlesUnderstand business goals and can work as part of a team to achieve themPro-active, detailed, communicative and organized - you take pride in your workBonus Points for: Experience with GIS and/or mapping applicationsRapid prototyping skillsProven history of open source contributionsWebGL experienceWhy you should work with us: We'll trust you to do things rightYou'll feel satisfied that you're creating something that people loveBuild a product for customers, not advertisersWe'll pay you a competitive salary plus equity, along with all the traditional benefits and some not-so-traditional ones, like an unlimited vacation policy"}