{"jobID": "2720096328", "jobLocation": "Romulus_MI", "jobTitle": "Dock to Driver Training Program: Detroit", "companyRating": null, "companyInfo": {"Website": "www.hollandregional.com", "Headquarters": "Holland, MI", "Size": "5001 to 10000 employees", "Founded": " 1929", "Type": " Subsidiary or Business Segment", "Industry": " Transportation & Logistics", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Con-way Freight, Dayton Freight, Saia LTL Freight"}, "estimatedSalary": null, "jobDescription": " OverviewWith nearly 90 years’ experience, Holland knows how to take care of our customers while providing a solid work environment for our employees. Discipline to its core values of Hard Work, Integrity, Respect, Excellence and Safety has allowed Holland to grow into a company with over 8,000 employees and more than $1 Billion in annual revenue, while being honored as a Quest for Quality award winner for 30 consecutive years! With a track record of long term employees, Holland offers more than a job, we offer the opportunity for a career. Come discover your direction with Holland and join the recognized leader of next-day delivery in the less-than-truckload industry!ResponsibilitiesMonth 1: You will learn dock operations and forklift training  Month 2: Combination dock operations and work with a personalized Driver Instructor  Month 3: Attend predetermined CDL school with paid tuition  Month 4: Customized training for LTL industry with personalized Driver Instruction  Month 5: Additional training by current professional Driver  Month 6: Training completed  Once you complete the program you will receiving the following benefits: Company paid Health InsuranceVacation, Holiday and Sick payOver Time by the day (over 8 hrs)Pension BenefitsDirect Deposit5% Wage Increase after 1 year, 2 years, and 3 yearsCost of living increases are included in contractQualifications21 years of age or olderForklift experience preferredClean Motor Vehicle RecordPass pre-employment drug screen and background checkPass Department of Transportation PhysicalAbility to obtain their Hazmat and TankerMay also be required to pass additional pre-employment testing/assessments Holland, a part of YRC Worldwide, is an Equal Opportunity/Affirmative Action Employer Minorities/Females/Persons with Disabilities/Protected Veterans.  #CB#"}