{"jobID": "2695715603", "jobLocation": "Dallas_TX", "jobTitle": "Director, Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "us-jobs.kpmg.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1987", "Type": " Subsidiary or Business Segment", "Industry": " Accounting & Legal", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " PwC, Deloitte, EY"}, "estimatedSalary": "163000", "jobDescription": "Known for being a great place to work and build a career, KPMG provides audit, tax and advisory services for organizations in today's most important industries. Our growth is driven by delivering real results for our clients. It's also enabled by our culture, which encourages individual development, embraces an inclusive environment, rewards innovative excellence and supports our communities. With qualities like those, it's no wonder we're consistently ranked among the best companies to work for by Fortune Magazine, Consulting Magazine, Working Mother Magazine, Diversity Inc. and others. If you're as passionate about your future as we are, join our team.KPMG is currently seeking a Director to join KPMG Lighthouse – Center of Excellence for Advanced Analytics.  Responsibilities: Developing partnership relationships with the client's executive level personnel and manage multiple and/or complex consulting projects at one or more clients through hands on deliveryRetrieve, prepare, and process a rich data variety of data sources such as social media, news, internal/external documents, emails, financial data, and operational dataAnalyze and model structured data and implement algorithms to support analysis using advanced statistical and mathematical methods from statistics, machine learning, data mining, econometrics, and operations researchPerform Statistical Natural Language Processing to mine unstructured data, using methods such as document clustering, topic analysis, named entity recognition, document classification, and sentiment analysisTranslate advanced business analytics problems into technical approaches that yield actionable recommendations, in diverse domains such as risk management, product development, marketing research, supply chain, and public policy; communicate results and educate others through insightful visualizations, reports and presentationsPerform exploratory data analysis, generate and test working hypotheses, and uncover interesting trends and relationships Qualifications: A minimum of ten years of relevant experience and strong knowledge in at least one of the following fields: statistics, data mining, machine learning, statistics, operations research, econometrics, natural language processing, and/or information retrieval and a minimum of ten years of management consulting, advisory, professional services and/or Big 4 consulting experienceMaster's degree or PhD from an accredited college/university in one or more of the following: Computer Science, Statistics, Mathematics, Engineering, Bioinformatics, Econometrics, Physics, Operations Research, or related fieldsProposal development experience including the ability to effectively sell business solutions to clients; $3M+ in delivered revenueDeep experience in extracting, cleaning, preparing, and modeling data; command-line scripting, data structures, and algorithms; and working in a Linux environment and proficiency in analysis packages (e.g. R, SAS, Matlab) and programming languages (e.g. Python, Ruby, Java, Scala)Ability to translate engagement objectives to a project plan with milestones, and resource/technology requirements, and teach, lead, and manage projects to successful execution; Ability to work across multiple engagements with clients to assess needs, provide assistance, and resolve problems, using excellent problem-solving skills and verbal/written communication to non-technical audiences; Experience developing partnership relationships with the client's executive level personnelAbility to travel up to eighty percent of the time. Must be able to work in the United States without sponsorship of a VISA.KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. All qualified applicants are considered for employment without regard to race, color, creed, religion, age, sex/gender, national origin, ancestry, citizenship status, marital status, sexual orientation, gender identity or expression, disability, physical or mental handicap unrelated to ability, pregnancy, veteran status, unfavorable discharge from military service, genetic information, personal appearance, family responsibility, matriculation or political affiliation, or other legally protected status. KPMG maintains a drug-free workplace. KPMG will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable local, state or federal law (including San Francisco Ordinance number 131192). No phone calls or agencies please."}