{"jobID": "2738734789", "jobLocation": "Plano_TX", "jobTitle": "Sr. Data Protection and Privacy Analyst", "companyRating": null, "companyInfo": {"Website": "www.radgov.com", "Headquarters": "Fort Lauderdale, FL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title: Sr. Data Protection and Privacy Analyst  Department: Infrastructure and Security  Location: Plano, TX  Reports To: Sr. Director, Head of Governance and Privacy  Status: Contract  Overview:  Ariba, Inc. is the leading provider of collaborative  business commerce solutions. Ariba combines industry-leading software as a  service (SaaS) technology to optimize the complete commerce lifecycle with the  world's largest web-based community to discover, connect and collaborate with a  global network of trading partners and expert capabilities to augment internal  resources and skills, delivering everything needed to control costs, minimize  risk, improve profits and enhance cash flow and operations – all in a cloud-based  environment. Whether you’re  buying, selling or managing cash, you can do it more efficiently and  effectively in the Ariba®  Commerce Cloud. Over 300,000 companies, including more than 80 percent of the  Fortune 500, use Ariba’s  solutions to drive more efficient inter-enterprise commerce.  Security and Privacy are vital components of SAP Ariba's  success as a cloud company. Our customers entrust us with their Confidential  Business Transactional Data and some Personally Identifiable Information because  of the value that we add by processing that data for them. SAP Ariba’s Trust Office team is  responsible for identifying, assessing and managing threats, vulnerabilities,  and associated risks to Ariba’s  information assets and resources. This includes providing expertise and  operating and maintaining various integrated security technologies to protect  the integrity, confidentiality and availability of all information resources  throughout a highly distributed cloud environment. Success will depend upon building  rapport and credibility with multiple stakeholders across SAP Ariba. As a  leader in Cyber Security, this candidate will have opportunities to mentor,  support, and contribute to goals and initiatives that ensure the secure usage  of technology, industry standards, and best practices. If you want to be a game  changer in building confidence in the cloud for our customers, consider joining  our team. We are looking for ambitious people who thrive in a dynamic  environment, are passionate about security and ready for a challenge.  The Data Protection and Privacy analyst is accountable for  the development and implementation of the GDPR privacy program across the SAP  Ariba products, operations and services, in alignment with the SAP Data  Protection and Privacy Office (DPPO) and Legal team. This will involve  establishing process and tools for implementing program compliance and helping  to ensure SAP Ariba's compliance with the EU GDPR.  •  Continue and enhance the existing program for data privacy to continually improve  compliance.  •  Work closely with Product Management and Engineering on data privacy  requirements relating to the design and delivery of products and services and  ensure compliance. Implementation of data protection by design and by default  in SAP Ariba products.  •  Perform Data Protection and Privacy assessments for product, service and  infrastructure components through interviews and questionnaires to analyze  personal data processing.  •  Evaluate technical and operational threats to the rights of customer users,  review control design and implementation evidence, analyze the effectiveness of  safeguards, identify gaps, assess and quantify risks, ensure transfer to the  risk register, risk mitigation and mitigation plans.  •  Establish and maintain KPIs and performance dashboard.  •  Maintain documentation and reporting on SAP Ariba privacy program.  Requirements  To be successful, the ideal candidate must be passionate  about our customers, partners and technology. Success will depend upon building  rapport and credibility with multiple stakeholders across SAP Ariba. As a  leader in Privacy, this candidate will have opportunities to mentor, support,  and contribute to goals and initiatives that ensure the secure usage of  technology, industry standards, and best practices.  •  5+ years of experience in data protection and privacy compliance and risk  management.  •  Understanding of technology use, trends and risks in a business context and  environment.  •  Demonstrated experience working with regulatory requirements and standards  (PCI-DSS, SOC 2, BSI, GDPR etc.) and frameworks (ISO 27000, COBIT, ITIL, NIST,  ISF, OWASP, etc.).  •  Deep understanding of International privacy laws, regulations and best  practices.  •  Experience in building and maintaining privacy programs and controls.  •  Must have a strategic mind-set to see the “big  picture” and ensure a  clear focus on the go forward agenda and the ability to make decisions  balancing cost/opportunity and risk.  •  Strong verbal and written communication skills and ability to influence others  •  Must be self-organized, goal/execution oriented  • Must take immediate responsibility in an ongoing critical  program  The ideal candidate will also have the following  qualifications and skills:  •  Excellent planning ability and business acumen.  •  Impeccable ethics and judgement.  •  Demonstrated ability to learn quickly, prioritize multiple urgent tasks, and  deliver results in a fast-paced environment with extremely tight deadlines.  Education  •  Bachelor’s Degree in  MIS, Computer Science, or other related field.  •  At minimum one of the following industry certifications: CIPP, CIPM and/or CIPT  Ariba, Inc. is an EEO/Affirmative Action employer and does  not discriminate based on race, religion, color, national origin, gender,  sexual orientation, age, disability, veteran status, or any other protected  category."}