{"jobID": "2732565320", "jobLocation": "McLean_VA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.csg-llcusa.com", "Headquarters": "Kissimmee, FL", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Government", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Consulting Services Group, LLC (www.csg-llcusa.com)Consulting Services Group (CSG) is a niche provider of intelligence related support services.Clearance Requirement:Active TS/SCI clearance with poly is required.Benefits:Salary We offer competitive compensation packages with plenty of opportunity for advancement.Health Insurance CSG will pay 100% of the employee’s health insurance premium. Family insurance options are available through payroll deduction.Dental Insurance CSG will pay 100% of the employee’s insurance premium. Family insurance options are available.PTO (Paid Time Off) CSG grants a total of 160 PTO hours per year. We recognize 10 federal holidays (4 floating).Senior Data Scientis - McLean, VAGENERAL PURPOSE:The position requires an active TS/SCI with Polygraph security clearance. The Data Scientist will be expected to build statistical models, test hypotheses, interpret, summarize, visualize, and succinctly report on data holdings. The Data Scientist will perform research on various data sources, to include unstructured data and social media (e.g. Twitter, Facebook, and YouTube) using quantitative and qualitative content analytics. The Data Scientist will plan, organize, arrange, and implement training and outreach activities for various projects and programs across the larger data science community. The Data Scientist will construct and perform complex database search queries in multiple databases.ESSENTIAL DUTIES/RESPONSIBILITIES: • Data manipulation, analytic/business insight tools, and data visualization experience • Experience constructing and performing complex database search queries • Experience/ knowledge of computer science concepts, data architecture, and experience/knowledge of programming and statistics • Experience working with statistical packages (e.g. SPSS, R, or SAS) • Experience/knowledge of social network and link analysis tools (e.g. NodeXL, Palantir, i2 Analyst ' s Notebook) • Experience working and successfully collaborating with IC all source analysts • Ability to communicate technical findings to non-technical audiences • Foreign Language experience is a plusQualifications Required:Education: Bachelor's degree in related discipline and 8+ years' experience, or master's degree in fields such as mathematics, engineering, social sciences and 5+ years' experience.Other: • No OCONUS travel is required • Minimal local travel in the DC metro area required • 15% Shift Differential is paid to those personnel assigned to the night shift"}