{"jobID": "2803808470", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Management Platform Analyst", "companyRating": null, "companyInfo": {"Website": "www.teamone.com.sa", "Headquarters": "Riyadh, Saudi Arabia", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Team One C.O.R.E.C = Collaborative Builds and sustains strong, genuine relationships with people of all levels and takes positive steps to extend network and cultivate connections. O = Optimistic Is utterly reliable, always delivering on promises and maintains the highest standards of honesty and integrity. R = Results-Driven Acts strategically to exceed goals and has the ability to adapt to changes in process and execution. E = Entrepreneurial Constantly looks for and identifies actionable and thought provoking opportunities for the company and executes them. GENERAL SUMMARY:  We are looking for a person with strong digital media or analytics background to join the Digital Analytics team. The DMP Analyst will report to the Associate Director of DMP (Data Management Platform) and support media campaign audience strategy, website personalization, and audience insights for client strategy. Responsibilities: Consult with media strategy teams to provide recommendations and execute creation of audience targeting segments for digital campaigns.Leverage DMP to provide customer profiling and recommendations during strategic planning and post campaign measurement process. Create regular audience profiling to be distributed internally and with clients.Develop testing and audience strategies for website personalization.Serve as a subject matter expert on DMP capabilities. Provide onboarding education to new team members and stakeholders.Provide support for cross-channel campaigns, personalization, sales attribution and performance optimization to maximize return on investment.Support data onboarding in the DMP and create data categorization rules. Manage and update DMP taxonomy. Provide limited technical support for data onboarding and organization.Keep on top of industry trends and ad technologies, and provide industry learnings to internal team.Provide support to the Digital Analytics team and the Strategy department on additional projects as necessary.Experience: 3 - 4 years of experience in digital programmatic media preferred. Education: Bachelors degree is required. Skills and Abilities: Hands on experience working in a programmatic platform with a mind for strategy, preferably on a self serve programmatic media team or at a DSP platform company (DBM, Trade Desk, Brightroll, etc).Solid understanding of leveraging data from the DMP to drive targeting solutions across all digital properties. Experience working in Oracle Bluekai DMP is preferred but not required.Experience in multi-channel marketing and personalization is a bonus.Strong analytical skills to draw conclusions from data and provide actionable insights.Strong knowledge of digital ad serving, tracking and implementation.Knowledge of Microsoft Excel (e.g., spreadsheet formatting, pivot tables, graphs, vlookups). Strong proficiency in Microsoft Word and PowerPoint.Strong cross-functional communication skills and project management skills.Experience with automotive is a bonus but not required."}