{"jobID": "2627852647", "jobLocation": "Chicago_IL", "jobTitle": "Workday Data Consultant", "companyRating": "3.9", "companyInfo": {"Website": "www.collaborativesolutions.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Meteorix, OneSource Virtual, DayNine Consulting"}, "estimatedSalary": "67000", "jobDescription": " Collaborative Solutions is a leading global Finance and HR Transformation consultancy that leverages world-class cloud solutions to help deliver successful outcomes for its customers. As one of the longest-tenured consulting partners with Workday, Collaborative Solutions has a 98% customer satisfaction rate and has executed over 325 Workday Financial Management, Human Resources, and Payroll deployments for global Fortune 500 companies, medium-sized businesses, and education and government institutions.  Collaborative Solutions is seeking a Data Consultant experienced in Human Capital Management. As a Data Consultant at Collaborative you will guide clients through the transformation, implementation and operation phases of a Workday implementation. Responsibilities:Become a Workday HCM product expert with knowledge of design, configuration, testing, and implementation.Design and generate data tracking and monitoring tools, and develop reports with accurate, easy to read, useful informationUtilize your technical aptitude to convert and map data sources into data conversion templates via iLoads.Guide clients through the data extract and cleansing process, including iLoading customer data, moving configuration from tenant to tenant, and configuring business processes and security.Create ETL scripts to transform and load data, and create strategies to improve and normalize client dataLead the validation of data loaded into WorkdayRegularly engage and support the client through all phases of the project, ensuring a smooth transfer from legacy systems to the Workday HCM solution.Perform multiple tasks under limited direction, while regularly keeping the client, your project team and your Engagement Manager abreast of changes or progress related to the project.Act as a mentor to fellow consultants and analysts, including providing support for shadow assignments.Actively participate in update training and internal opportunities to share one’s skills and learnings with others within the organization.Skills & Requirements:Ideally, 2-5 years of PeopleSoft (or other ERP) Data Conversion or HCM implementation experienceWorkday experience a plusExperience with data conversion, data mining, and data loadingAdvanced experience of Excel, some VB is also preferredAbility to travel approximately 15-25%Equal Opportunity statement: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or status as a Vietnam or disabled veteran. Disability statement: Because we do business with the government, we must reach out to, hire and provide equal opportunity to qualified people with disabilities. If you’d like to voluntarily submit your disability status to us, please use the url in this posting to complete the Voluntary Self-Identification of Disability form and send it to EEO@collaborativesolutions.com. Any answer you provide will be kept private and will not be used against you in any way. https://www.dol.gov/ofccp/regs/compliance/sec503/Self_ID_Forms/VoluntarySelf-ID_CC-305_ENG_JRF_QA_508c.pdf  For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser."}