{"jobID": "2737654314", "jobLocation": "Summit_NJ", "jobTitle": "Scientist - Engineer, Upstream – Downstream Biologics Manufacturing", "companyRating": null, "companyInfo": {"Website": "www.celgene.com", "Headquarters": "Summit, NJ", "Size": "5001 to 10000 employees", "Founded": " 1986", "Type": " Company - Public (CELG) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Scientist - Engineer, Upstream – Downstream Biologics Manufacturing Req #: 1801201Location: Summit,  NJ USJob Category: Research and Early DevelopmentWork Location: 556 Morris Avenue CELSUMWEST 07901Organization: Celgene CorporationSchedule: 40Shift:Employee Status: Full timeJob Type: RegularJob Level:Travel:Other Locations:US- NJ- Summit West DescriptionCelgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, ​quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.Scientist - Engineer, Upstream – Downstream Biologics ManufacturingSummit, NJWe are currently looking for a Subject Matter Expert (SME) to join our Manufacturing Sciences team within the Celgene’s Biologics Development & Manufacturing Group.  As a member of the Biologics Development & Manufacturing group, the Engineer will provide technical and operational expertise to late stage clinical and commercial manufacturing campaigns for external programs. The focus of this position will be on either cell culture upstream operations or purification Downstream operation, but the ideal candidate should have adaptability to lead projects across upstream and downstream.  As appropriate, responsibilities include: Lead technology transfers from Biologics Development and external partners to the Celgene’s network of external CMOs. Technology transfer will include providing decisions for manufacturing implementation of processes and communicating the decisions to the technology transfer team.Technical lead for manufacturing issues during processing, which includes leading manufacturing technical investigations toward process impact assessments and ensuring timely completion and communications.Responsible for routine data trending of manufacturing data to fulfill regulatory/compliance requirements. This includes authoring quarterly trend reports and annual product reviews.Responsible for authoring various technical protocols and reports and regulatory documents.Actively pursue technical improvement projects and implement the changes through the global change control process. QualificationsAbility to work independently and lead a large cross-functional group.Good communication and project management skills appropriate for leadership of technology transfer projects.Comfortable analyzing scientific datasets/strong analytical skills with excellent written skills.Ability to work well in both individual and leadership capacities EducationKnowledge of cGMP, FDA/EMA regulations, Process Validation  Biochemistry, Bioengineering, Biochemical, Chemical Engineering or related discipline: Preferred - BA/BS + 2-4 yrs or MS and 1-3 in relevant experience in the Biotech / Biopharm industry.Celgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S."}