{"jobID": "2834330469", "jobLocation": "Chicago_IL", "jobTitle": "Accounting Business and Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.libertybank.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Liberty Bank for SavingsAccounting Business and Data Analyst Liberty Bank for Savings is celebrating 120 years of service to its communities! With five branch offices located on the north side of Chicago, we are currently looking for diligent, analytical, detailed and inquisitive self-starters to make an impact within the Bank. As part of the Accounting Team here at Liberty Bank, the role will entail exposure to and responsibility for accounting and financial related responsibilities, including data interpretation, reporting, trend analysis and ROI calculations. The role will also focus on learning and delving into existing software systems to help determine optimal usage. Key duties and responsibilities: · Assists with analyzing raw data from the Bank core system and other bank software for trends, interpretation, and offering better ways to report and utilize such information.  · Exposure to key accounting and financial processes, including the preparation of Bank monthly financial statements, various monthly board reports, the monthly ALCO report, etc., to build managements awareness of the performance of Liberty Bank.  · Performs analysis and provides accurate reports on Banks retail and loan products and services.  · Partakes in evaluating the effectiveness and ROI of Marketing, Retail, Lending and overall corporate initiatives.  · Researches and provide reports on historical and forecasted financial data for the organization, including economic trends and asset management.  · Researches peer financial activities and provide an indication of the competitions behaviors, statistical benchmarks and expense management.  · Upon acclimation to the Bank and it accounting and business routines and cycles, an opportunity to delve into the various software solutions utilized will be introduced, so as to uncover capabilities and functions that are not being optimized, or that can be incorporated in a more efficient and impactful manner.  · Participation in projects and change management initiatives to improve on processes which result in improved accuracy, better compliance, meaningful cost-savings, and improvement in efficiency.  We are seeking candidates who enjoy working with numbers and data, systems and software, have a strong sense of initiative and curiosity to delve in and learn new things, and can effectively present new ideas and offer suggestions for improvement and change! Education/Experience: · Bachelors degree in Accounting, Finance or Business Administration.  · 1-3 years prior accounting and finance experience desired. Skills/Abilities we are seeking: ~ Effective analytical and reporting capabilities.  ~ Strong math aptitude and ability to think critically.  · ~Good interpersonal skills and the ability to work both in a team and independently.  · ~ Ability to work on multiple projects and assignments simultaneously, and managing time and resources to ensure work is completed efficiently and within established timeframes.  · ~ High level of proficiency in Excel; strong working knowledge of Office and Adobe; ability to learn new software and systems.  Liberty Bank for Savings is an Equal Opportunity Employer (Minorities, Females, Protected Veterans and Individuals with Disabilities). Appropriate background checks will be completed.  A comprehensive benefits package offered for Full-time positions, including medical, dental and vision coverage, Life/STD/LTD plans, Flexible Spending Account, 401k+Profit Sharing Plan, Pension Plan, paid vacation, sick time and holidays. For more information on Liberty Bank, visit us online at: http://www.libertybank.com. To apply for this position, please email your resume and salary requirements to [Click Here to Email Your Resumé]"}