{"jobID": "2837760321", "jobLocation": "Kalamazoo_MI", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.zoetis.com", "Headquarters": "Parsippany, NJ", "Size": "5001 to 10000 employees", "Founded": " 1950", "Type": " Company - Public (ZTS) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Zoetis is a global animal health company dedicated to supporting customers and their businesses . Building on 60 years of experience, we deliver quality medicines, biopharmaceuticals and vaccines, complemented by diagnostic products and genetic tests and supported by a range of services. We are working every day to better understand and address the real-world challenges faced by those who raise and care for animals in ways they find truly relevant.  Zoetis discovers, develops and manufacturesa diverse portfolio of animal health medicines, biopharmaceuticals and vaccines designed to meet the real-world needs of veterinarians and the livestock farmers and companion animal owners they support. Zoetis has the first monoclonal antibody therapy for treating atopic dermatitis in dogs. We are currently seeking to fill new positions to support our growing biopharmaceutical portfolio.  Zoetis Veterinary Medicine Research and Development, Biologicals Formulation Sciences in Kalamazoo, MI is seeking a formulation scientist at Formulation Lead role.  The scientist is responsible for designing and conducting pre-formulation, formulation & process optimization studies, including scale-up, manufacture clinical supplies, and transfers to manufacturing facilities. The scientist is also responsible for working collaboratively with multi-disciplinary teams, author technical and regulatory documents, leading / supporting organization initiatives, assessing new capabilities / technologies. The selected individual is expected to have knowledge of advanced biophysical techniques, high throughput tools, stabilization of liquid and lyophilized formulations of proteins, experience with high concentration formulation development.  The responsibilities for this role will include but not limited to:  Design and conduct studies to characterize molecular and biophysical properties of peptides, proteins, monoclonal antibodies and other large molecules Design and develop parenteral biologic formulations (liquid and lyophilized, and other dosage forms) Design and perform commercial process development studies for drug products by using expertise/knowledge of scale-down/scale-up principles Manufacture and supply formulations/drug product to non-pivotal and pivotal clinical studies Collaborate with and support pilot plant and manufacturing scientists for successful technology transfer for manufacture of pivotal/commercial drug product supplies. Author technical reports and regulatory documents Coach/mentor junior staff within the group Lead matrix CMC teams that develop ABI processes, Analytical Methods and Drug Products for registration in global markets Keep abreast of relevant new technologies & regulatory expectations/requirements Ensure work activities are aligned with relevant Quality, regulatory and EHS requirements. Basic Qualifications  PhD in Pharmaceutics or Pharmaceutical Sciences or Chemical Engineering or related field with 6 + years of industrial experience in formulation development for monoclonal antibodies, proteins, peptides, vaccines.  Preferred Skills  Experience/ advanced knowledge of parenteral formulations development for biologics Advanced understanding of protein chemistry, degradation pathways, and general approaches for stabilization Advanced knowledge of biophysical techniques and ability to apply them for characterization and problem-solving during formulations development Ability to independently contribute from the bench Ability to coach, train and lead others in the design, execution and interpretation of experiments to drive the definition and optimization of formulations Good oral and written communication skills Full timeRegularColleagueZoetis is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status or any other protected classification. Disabled individuals are given an equal opportunity to use our online application system. We offer reasonable accommodations as an alternative if requested by an individual with a disability. Please contact Zoetis Colleague Services at to request an accommodation. Zoetis also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must possess or obtain authorization to work in the US for Zoetis. Zoetis retains sole and exclusive discretion to pursue sponsorship for the acquisition or maintenance of nonimmigrant status and employment eligibility, considering factors such as availability of qualified US workers. Individuals requiring sponsorship must disclose this fact. Please note that Zoetis seeks information related to job applications from candidates for jobs in the U.S. solely via the following: (1) our company website at site, or (2) via email to/from addresses using only the Zoetis domain of @zoetis.com. In addition, Zoetis does not use Google Hangout for any recruitment related activities. Any solicitation or request for information related to job applications with Zoetis via any other means and/or utilizing email addresses with any other domain should be disregarded. In addition, Zoetis will never ask candidates to make any type of personal financial investment related to gaining employment with Zoetis."}