{"jobID": "2793547738", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "2.1", "companyInfo": {"Website": "www.raise.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "About RaiseWe’re Raise, a leading retail payments company and the world’s largest gift card marketplace, that connects consumers to buy discount gift cards or sell their unwanted cards for cash. We’re partnered with over 400 national brands, offering retailers a new form of digital payment, while incentivizing consumers to make their money worth more.  Since our launch in 2013, we’ve saved millions of consumers more than $140 million! and have received $147 million in funding from investors including Accel, PayPal, Bessemer Venture Partners and New Enterprise Associates. Raise is headquartered in Chicago with an office in New York. About the Position Raise Data Scientists are a critical component of the cross-functional squads that make up the Raise technology organization, reporting directly to the Director of Analytics. As a Data Scientist at Raise, you are responsible for delivering data insights to a given Technology squad, while providing expertise in data collection, experiment design, and interpretation of statistics. You will be responsible for creating, analyzing and optimizing reports that help to drive critical product decisions. While working with your squad of designers, engineers and product managers, you will contribute by ensuring we build and test the features that drive incremental value in our products.  Because we care deeply about building great products for all kinds of people, we’ve spent a lot of time focused on creating a work environment that is inclusive, friendly and empathetic. Therefore, the best candidate for this role will focus on people first, consistently striving to support the success, satisfaction and empowerment of their own squad members, business partners and ultimately, Raise members. ResponsibilitiesWork directly with engineers, designers, and product managers to understand and satisfy members’ needs, while communicating and coordinating closely with business partners and leadershipExecute quantitative analyses that translate data into actionable insights that lead to innovationDevelop reports and dashboards that assist business stakeholders and further understanding of our productsCollaborate with engineers to collect new data sources into our data warehouse and data visualization platformDesign and evaluate new feature requests through online experimentation (A/B testing)Constantly learn, discover, and implement ways of improving your own knowledge and our shared workflows AbilitySkills & QualificationsAbility to perform ad hoc analyses, measure the validity of the results, and communicate actionable insights to decision makersProficiency in SQL and databasesExposed to ETL, data model design, and data warehouse conceptsExperience using cloud platforms such as AWS or GCP2+ years of experience in data modeling, statistical analysis and experiment designExcellent oral and written communication skillsExcellent collaborative skills with experience using git and GitHub is a plusExperience with Google Analytics or other online testing and web analytics platform is a plusExposure to software project management according to lean or Agile methodologies is a plusBA/BS degree or above in Mathematics, Statistics, Operations Research or related field of study or equivalent experienceBenefitsComprehensive benefits package including health, dental, vision, 401(K) with match that is 100% vested from day one, company paid short term and long-term disability and life insuranceFlexible Paid Time Off PolicyRaise Gives Back, paid time off for volunteeringPre-tax commuter program16 weeks paid maternity leavePaid parental leaveCredits for employeesCompany provided snacks, coffee and sodaVoluntary benefits like Pet Insurance and Identity Protection"}