{"jobID": "2837982076", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.unt.edu", "Headquarters": "Denton, TX", "Size": "5001 to 10000 employees", "Founded": " 1890", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": " The University of North Texas Libraries is seeking to hire a Data Analyst to join our Facilities&Systems; team. This multi-faceted position requires working closely with the leadership of an integrated division to prepare comprehensive action plans, including resources, time frames, budgets, and solutions for multi-system / integrated projects, programs, and tasks. General duties include oversight on data collection including data entry, quality control, database organization, and access; as well as IT/Facilities systems integration which may include programming, scripting, and designing custom modules/solutions.  Responsibilities of the position include, but are not limited to: Various coordinating tasks such as scheduling, asset management and risk managementData collection and compilationMaintaining systems and project documentationOrders and purchasesCorrespondences with external groupsData extractionReport/query creationData visualization The University of North Texas System is firmly committed to equal opportunity and does not permit - and takes actions to prevent - discrimination, harassment (including sexual violence), and retaliation on the basis of race, color, religion, national origin, sex, sexual orientation, gender identity or expression, age, disability, family status, genetic information, citizenship or veteran status in its application and admission processes, educational programs and activities, facilities, and employment practices. The University of North Texas System immediately investigates and takes remedial action when appropriate.  The University of North Texas System also takes actions to prevent retaliation against individuals who oppose a discriminatory practice, file a charge, or testify, assist or participate in an investigative proceeding or hearing."}