{"jobID": "2836680246", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " The University of Southern California (USC) is seeking a Data Analyst to support the Office of Professionalism and Ethics (OPE). Reporting directly to the Vice President of Professionalism and Ethics, the Data Analyst will be responsible for performing input and data analysis of complaints reported to the OPE, in addition to review of data regarding misconduct allegations and determination of preliminary assessments.  The Data Analyst will also assist senior data analysts in tracking complaints and the completion of investigations managed and monitored by OPE.  . Additional/Specific Accountabilities Include:Performs input and data analysis of complaints and subsequent investigations, including interpretation of results and identification of trends using investigation tracking software and other programs, as necessary.Assists senior data analysts in tracking complaints and the completion of investigations managed and monitored by OPE, utilizing knowledge and understanding of the university’s various workplace environments and structures. Follows up on incomplete components of data/complaints with relevant complainants, senior data analyst and/or available subject matter experts.Responsible for database management and development of reports. Prepares and maintains comprehensive reports regularly and as requested by relevant stakeholders and OPE’s Vice President or Director.Assists in developing processes and tools to confidentially collect, organize and disseminate information and statistics.Maintain knowledge of university-wide systems and processes, recommending enhancements and training opportunities, as needed. Ensure accuracy and compliance of data reporting systems and the tracking software, both conforming to university and industry standards.May lead staff or student workers, as assigned. Performs other related duties as assigned or requested. The university reserves the right to add or change duties at any time. The Ideal Candidate Will Have:Master’s degree; Bachelor’s degree (minimum) in business administration, legal studies, finance, auditing or similar ethics and compliance education.Three or more years’ experience in managing and analyzing complex data related to investigations, including the ability to identify trends.Demonstrated skills in collaboration, critical analysis, problem solving and discretion.Demonstrated attention to detail, and administrative/project management skills.Excellent oral and written communication skills.Proficient with Microsoft Office and investigation software."}