{"jobID": "2802528070", "jobLocation": "Mountain_View_CA", "jobTitle": "Clinical Product Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.livongo.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Why Livongo?Come for the Mission: Livongo empowers people with chronic conditions to live better and healthier lives. As the leading innovator in the digital chronic condition space, were connecting the pieces of the healthcare puzzle: treating and caring for the whole person physically and emotionally extending care and support beyond the doctors office, and applying real-time data to real-time solutions, across multiple conditions. We are experiencing astronomical growth and our success stems from our proven ability to make a real, measurable improvement in peoples health.Make an Impact: Top candidates are attracted to Livongo because they want their work to have impact. They want to accomplish something meaningful and make a tangible difference in other peoples lives. We combine smart digital technology with real-time, personal connections, to create amazing support systems for people with conditions like diabetes and high blood pressure. These conditions are currently costing the U.S. hundreds of billions of dollars, and our solutions reduce these costs while simultaneously improving outcomes, with a product people love using.We Believe in Our People: Like our health solutions, our working environment is people-centric. We focus on our members, our clients, and our employees. If were good to those folks, well succeed. We bring passion and excitement to the workplace, creating an inspiring environment powered by smart, fun, passionate individuals with wildly diverse professional backgrounds.We Are the Next Billion-Dollar Startup according to Forbes in their 2017 top 25 young companies list. Join us during this period of dynamic growth and innovation and help Livongo revolutionize the healthcare industry and impact millions of lives around the world.The OpportunityJoin Livongos mission to take medical care platforms to a new, digital level. Other companies have medical devices. We have a whole eco-system of digital, interactive, patient-focused chronic care platforms. Your work will help shape Livongo product development strategy, as we push the standard boundaries for treating patients with chronic conditions.In this cutting-edge Clinical Product Data Scientist role, you will leverage your data savvy and machine learning skills to build algorithms that will help people live healthier lives. Your statistical modeling skills will help Livongo quantify the impact of our clinical product suite on patient health and your analytical insights will shape the way we present clinical products to patients. Your results will influence and contribute directly to scalable machine learning systems. Through your work, everyone at the company will gain a deeper understanding of patient behavior and health, enabling Livongo to speed their ability to help more people, sooner. Responsibilities: Collaborate with Livongo product managers and clinicians to quantify the impact of Livongos clinical products on patient healthUse statistical/econometric/machine learning modeling, analyses and algorithms to design experiments, create and define metrics, and develop productsCommunicate and present the results of your models to non-technical audiences, effectively helping internal decision-makers plan and execute on product development strategiesBuild deep understanding and empathy for patient behavior and health using dashboards, models and analysesBuild reusable tools and methods that make the work faster: efficiencies add up fast!Candidate Profile:Great statistical/ML modeling skills1+ years of hands-on experience with basic ML and causal/econometric modeling such as DiD, PSM, BSTS, IV, RF, GBM, etc.An advanced degree in statistics, physical/biological sciences, economics, computer science, management science, operations research or similarA deep understanding of data and stats, as they relate to product and algorithm designsSpecific experience using causal methods to assess the effectiveness of product features or interventionsExcellent coding abilitiesExpertise in data wrangling using SQL, R, Python, etc.Pride in the craft of programmingExceptional communication and collaboration skillsEffectively collaborate with and influence a cross-functional teamStrong communication and presentation skills; ability to explain results clearly and humbly to key decision makersCreativity and resourcefulnessThe ability to turn complicated or ill-posed problems into simple, tractable onesInstinctive understanding of when to use a simple vs. complex solutionCreative approaches to challenging problemsHumanityA passion for creating a healthier worldFundamental respect for people, with the desire to use data for social goodDomain knowledge (a plus)A background in medical devices or applications is a big plus, for example experience with claims data, clinical analytics, population health tracking, etc.Livongo Health is on a mission to change how healthcare is delivered to people with chronic conditions around the world, starting with diabetes in the US.We are creating a smart data cloud capable of collecting and processing millions of data points from wearable devices, EHRs, and our cellular-connected blood glucose meters. We are also building delightful web and mobile front-end apps to provide consumers with intelligent workflows and visualizations to manage their chronic conditions effectively.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}