{"jobID": "2790878890", "jobLocation": "Santa_Clara_CA", "jobTitle": "Maps Data Infrastructure Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "125000", "jobDescription": "Maps Data Infrastructure Engineer Job Number: 113212866Santa Clara Valley, California, United StatesPosted: Jun. 19, 2018Weekly Hours: 40.00 Job SummaryDesign and implement frameworks to manage complex workflows and monitor data quality Design, build and deploy ETL pipelines that are efficient, reliable and easy to operate Research and build efficient and scalable data storage and retrieval systems that enable interactive reporting on high dimensional data Research and build the next generation data dashboard and visualization solution Build libraries and frameworks to empower data scientists to effectively work with our data products.Key Qualifications Strong understanding of object oriented design.Experience writing Hadoop and/or Spark jobs to process large amounts of data Proficiency in Java, Bash, Python, SQL, HDFS, and other Hadoop tools (ie Hive, Hue, YARN, etc).Experience with data visualization is plus.Experience with A/B experimentation is a positive.Experience with open-source projects beneficial.Aptitude to independently learn new technologies, prototype and propose software design and solutions required.Excellent communication skills; and the ability to work effectively across multiple multifunctional teams is required. DescriptionMaps Evaluation Metrics is responsible for defining, implementing and measuring actionable metrics summarizing the quality of algorithms, services and data. We achieve this by mining massive amount of rich data including human judgements, ground truth, and user feedback logs. We primarily work on Maps but our platform is used by other applications like Siri, iTunes and News. You will be working with some of the most unique and interesting data sets in the world. Data realms include geo spatial data, probe, search logs, traffic data, human judgements and A/B experiments data. You will partner with data scientists and engineers to acquire valuable signals on where and how we have the most opportunity to improve user experience for Apple customers around the world. You will build large scale data pipelines and end-to-end analytics solutions to transform rich data at Apple scale into actionable insights that directly impact customers. As a member of a small and dynamic team, you will have significant responsibility and influence for crafting all parts of the data platform.EducationBA, MS or PhD in Statistics, Computer Science, or other quantitative fields."}