{"jobID": "2816007403", "jobLocation": "Whippany_NJ", "jobTitle": "Sr. Analytics Consultant", "companyRating": null, "companyInfo": {"Website": "www.fstonetechnologies.com", "Headquarters": "Piscataway, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " CLIENT: Bayer  LOCATION: Whippany, NJ  DURATION: 1+ year with extensions RATE: 70-73Role Description: Sr. Analytics Consultant  The Analytics Consultant will work closely and take direction from, Analytics Practice Leads / Project Managers as well as Brand and Agency stakeholders as related to developing custom reports and reporting interfaces / dashboards and will include acting as a point of contact for implementation of report changes. A successful candidate will be able to perform individually and as a team member coordinating and executing business intelligence efforts including; data analysis, query development and report assembly leveraging google Analytics and Adobe Site Catalyst toolsets.  In addition to digital reporting experience, an ideal candidate will either have experience with other BI reporting applications (Tableau, Crystal Reports, etc.) and/or the ability and willingness to learn new applications quickly and often in a self-guided manner. Generally the candidate will be assigned to projects according to skill set and may be involved in multiple projects at a given time.  Supporting web development skills including HTML / CSS / Javascript and experience with one or more programming languages (PHP, .NET, Java, Javascript, MySQL, SQL, etc.) would be helpful. These additional skills may be leveraged directly as part of the developers primary report / dashboard development responsibilities. Required Skills: Demonstrated experience using Google Analytics and / or Adobe Site Catalyst to develop Dashboards and Custom Reports  Experience with digital marketing initiatives; web site traffic analysis, marketing campaign and promotional performance, social media conversion, etc.  Experience with Google Tag Manager Tag Development and Quality Assurance of those Tag  Familiarity of the Google 360 Platform  Must be able to comprehend requirements documents as related to business and functional needs and plan report development efforts accordingly  Work with the team to gather requirements, overlaying an analytics perspective  Create sustainable and efficient visualizations, emphasizing usability and good design practices  Test and monitor the underlying data, assuring quality and optimizing the data view that reports / dashboards use  Understand the techniques used in visual reporting Additional Qualifications: Support and execute reporting projects, including self-managing and prioritizing development tasks  Support quality assurance processes, and ensure standardization/uniformity around published reports / dashboards  Experience with relational databases, using SQL / MySQL is preferred  Help analysts troubleshoot data and query issues, working with IT support when needed  Develops understanding of the organizations services and systems in order to facilitate internal data practices and promote the effective use of data for decision-making  Demonstrated experience with Tableau, including working with Tableau Server General: Experience working with a variety of information systems and data files, including large and complex files, transforming raw data into finished products "}