{"jobID": "2822550667", "jobLocation": "Plano_TX", "jobTitle": "Global Principal Scientist", "companyRating": null, "companyInfo": {"Website": "www.pepsico.com", "Headquarters": "Purchase, NY", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (PEP) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unilever, Mondelez International, Amazon"}, "estimatedSalary": null, "jobDescription": " Lead Dips / Salsa technical projects through exploration of ingredients, formulation, process technologies, and packaging interaction  Gain critical experiences across key Innovation, Productivity, and Stewardship projects to build knowledge base as company’s subject matter expert and critical professional on Dips / Salsa platform  Explore new ingredients, products, and processes leveraging internal development and external resources.  Utilize experimental design and data interpretation tools to make technically sound recommendations.  Develop, plan, conduct, and coordinate product development initiatives.  Coordinate production at bench top, pilot plant, and manufacturing levels for shelf life, stability, sales samples, scale-up, and other needs  Interpret data and communicate impact to the business  Provide trial and commercialization support to products at manufacturing facilities  Effectively manage multiple projects (new, existing) and project types (Innovation, Productivity, and Brand Stewardship / Quality), develop work streams, define resource needs and drive alignment across R&D;  Input, review, and finalize formula specifications and ingredient specifications  Actively participate in marketing research programs including focus groups and other consumer research formats.  Perform basic economic evaluations on ingredients, suppliers, and formulations  Stay current on FDA regulations & other external factors to implement necessary changes & mitigate risks  Support talent development by providing guidance and oversight to less experienced developers and technicians.  Represent R&D; on multi-functional business teams  Influence others through strong communication & interpersonal skills  Qualifications/Requirements  M.S. or Ph.D degree in Food Science or Food Engineering field with 7+ years of experience  Strong knowledge in ingredient functionality & formulation chemistry, and demonstrated of product innovation  Experience in dips or spreads (ie. salsa, cheese, dairy, bean) or high moisture product development and manufacturing  Experience with vegetables (ie. tomatoes), dairy ingredient processing, and beans / legumes product development & scale-up  Experience with thermal processing calculations & commercial sterilization technologies such as hot fill, retort, and aseptic  Strong working knowledge of experimental design & product development protocols (from concept to execution), including formulation, stability testing, product/package interaction, sensory and consumer testing methodology.  Possess strong work ethic and ability to be a self-starter  Demonstrated ability to function effectively in a dynamic and fast-paced environment as well as manage multiple projects simultaneously  Adapts to change well with the personal leadership to influence and positively motivate self and peers.  Outstanding teamwork and communication skills  Strong organization, documentation, and formula management skills  Interest & desire for long term technical career in Dips / Salsa platform and high moisture foods"}