{"jobID": "2505711568", "jobLocation": "Irving_TX", "jobTitle": "Big Data - Principal Software Engineer / Machine Learning Developer", "companyRating": "3.4", "companyInfo": {"Website": "www.humana.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1961", "Type": " Company - Public (HUM) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cigna, Aetna, UnitedHealth Group"}, "estimatedSalary": "74000", "jobDescription": "Role: Big Data Principal Software EngineerAssignment: Consumer Analytics and Data StrategyLocation: Irving, TexasDo you get excited with Big Data and Machine Learning? Do you believe technology has a critical role to play in the ongoing healthcare industry transformation? Do you want to be part of a dynamic team that excels in implementing the best big data and machine learning applications? Are you ready to create something new that will positively affect the healthcare and technology industry in a noble and purposeful way?We are seeking a Big Data Principal Software Engineer to design and implement cutting edge machine learning solutionsExpectations:Design and develop big data and machine learning solutions for Humana Consumer AnalyticsPossess in depth understanding of computer science parallelism concepts and efficient data processing techniques suitable for machine learning applicationsArchitect and implement ETL solutions using best practices in Hadoop and Spark ecosystem. Understand available data, including both in structured and unstructured formats, and recommend effective ways for storage and analytical processingComfortable working in a fast paced agile environment, closely interacting with business and some of industry’s best software engineers and machine learning scientistsRole Essentials :BS in Computer Science or related fieldOpen source contributions and robust portfolio of shipped code at GitHubOverall 3 years of experience designing and implementing data processing and/or machine learning applications in big data environment2 years of experience with Hadoop and Spark1 years of programming experience using Scala3 years programming experience using one or more of Java, Python, CFamiliarity with open source machine learning libraries3 years of experience using SQL and traditional data warehouses. Experience with Oracle and IBM Netezza preferred3 years of experience developing over Unix/Linux environmentWorking knowledge of agile development techniquesWillingness to learn new technologies and comprehend unfamiliar data domains and new business processes quicklyRole DesirablesMS/Ph.D. in Computer Science or related fieldExperience implementing applications around Natural Language Processing and/or Deep LearningExperience with data visualization platforms like TableauRelevant certifications"}