{"jobID": "2837777547", "jobLocation": "Spring_TX", "jobTitle": "Data Support Analyst", "companyRating": null, "companyInfo": {"Website": "www.experis.com", "Headquarters": "Milwaukee, WI", "Size": "5001 to 10000 employees", "Founded": " 1953", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Robert Half, Adecco, Robert Walters"}, "estimatedSalary": null, "jobDescription": " **********LOCAL CANDIDATES ONLY**********  One of our direct clients located in Spring Texas has a 6-month contract position for a Data Support Analyst.  The primary customer point of contact for ALL questions related to Data\": data troubleshooting, configuration management support, data heath check monitoring and reporting, data bulk loads for project / new integration / cleansing / updates / migrations, integration specs for inbound & outbound data flow/connector with other systems, partner with other Information Technology (EMIT) and non-EMIT groups in the resolution of data related issues, run data quality metrics tools and taking action to correct issues, including root cause analysis for systemic problems, ensuring the data is in compliance with defined data standards, assist in promoting effective use of standard data management tools and processes, MoC data testing and troubleshooting. Position will receive direction and support. This position level would typically include junior Data Support Analyst performing mostly basic tasks. SKILLS AND QUALIFICATIONS Strong level of relational database concepts, ability to write complex SQL queries and scripts against highly abstracted model, experience in IT Change Control support with complex framework of integrations, ability to map logical / physical data models, gather / analyze / compare data via (tableau, excel pivot, access), be familiar with the data profiling concepts.  Transfer existing Access database into a usable database (e.g. another Access database, SQL, etc.)  Schedule Standard Schedule - 5 days on / 2 days off- Days On:5, Days Off:2  Cory Goldstein | Senior Key Account Recruiter  Office (908) 363-0985 | [Click Here to Email Your Resumé]  Experis, A Manpower Group Company  Experis is an Equal Opportunity Employer (EOE/AA)"}