{"jobID": "2583576375", "jobLocation": "Los_Angeles_CA", "jobTitle": "Scientist, Pharmacokinetics", "companyRating": null, "companyInfo": {"Website": "www.biophaseinc.com", "Headquarters": "San Diego, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "BioPhase Solutionsspecializes in recruiting top talented professionals for Southern California's Scientific community. We are currently looking for a Scientist, Pharmacokinetics to work for a leading Greater Los Angeles area biotechnology company.Scientist, PharmacokineticsJob Duties include:Undertake original and innovative research and techniques to develop, qualify or validate, and investigate ligand binding assays for the rapid and accurate analysis of large molecule therapeutics in biological matrices.Develop methods by applying and interpreting scientific theories, concepts, techniques, and regulatory requirements in bioanalytical studies.Implement design of experiments (DOE) and other systematic and statistical approaches to method development.Transfer developed assays to CRO’s, including travel and analyst training.Analyze samples for research studies, including performance of a qualified assay, SoftMax Pro 7 analysis, and WinNonLin PK parameter analysis.Author and review technical study reports and regulatory submissionsMaintain current knowledge of the field and area(s) of scientific expertise and developmentQualifications/Requirements: Minimum of a Bachelor’s degree in Biochemistry, Chemistry or Biology required. An advanced degree is preferred.10+ years of related biotech or CRO industry experience is required.The candidate must have proven proficiency in immunoassay development and be capable of working on multiple projects simultaneously. Prior experience working in a regulated GLP compliant environment is preferred.Experience in one or more immunoassay techniques (ligand binding assay: ELISA, MSD, Biacore, and/or bead arrays applicable to Pharmacokinetic, Immunogenicity, ± biomarker studies).High competence in common software and data analysis packages (eg, Microsoft Office Suite, SoftMax Pro, GraphPad Prism, JMP or MiniTab, WinNonLin). Experience in Design of Experiments (DoE) is highly preferred.Strong knowledge of FDA and ICH guidance document for critical reagents, bioanalytical method development, validation, and trending is essentialStrong communication skills and the ability to work with staff in other locations effectively.Please send resumes to gavin@biophaseinc.com or call (562)495-3200 x 4 and visit our website at www.biophaseinc.com for additional job opportunities!!!"}