{"jobID": "2617052691", "jobLocation": "Menlo_Park_CA", "jobTitle": "Advanced Computer Scientist, Human-Machine Collaboration", "companyRating": null, "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": null, "jobDescription": " The Artificial Intelligence Center of SRI International is looking to fill a research position in the area of intelligent user interfaces. SRI has a long history of innovative work in intelligent systems that interact with, learn from, and assist humans, including work on human-directable planning, mixed-initiative scheduling, learning from demonstration, and proactive assistance. The SRI-led CALO project under the DARPA PAL program gave rise to a number of successful start-up ventures, including Siri, Tempo AI, and TrapIt.  This position will focus on the development of innovative capabilities and enabling technologies in areas such as interactive machine learning, intelligent assistants, explainable autonomy, plan recognition, and user modeling. The research will target challenging real-world domains such as intelligence analysis, logistics planning, decision support, man-machine teams, and personalized training. Responsibilities will include contributing to existing research projects through concept design, algorithm development, and evaluation; publishing research results and formulating new research directions; and working within small teams to develop new projects related to intelligent user interfaces. Candidates for the position should have:Ph.D. in computer science (or related field)A track record of technical excellence in basic and applied researchA strong desire to see their ideas applied in practiceEnthusiasm for learning new technical disciplinesExcellent oral and written communication skillsThe ability to work effectively with diverse groups of people The position will be based at SRI's main facility in Menlo Park, California.Ph.D. in Computer Science. Expertise in agent-based systems, distributed AI, machine learning, and automated planning are highly desired. "}