{"jobID": "2702613894", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Data Scientist - Personalized Marketing", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "105000", "jobDescription": " Johnson & Johnson Group of Consumer Companies is recruiting for an Data Scientist Personalized Marketing to be located in New Brunswick, NJ or New York City, NY.  At Johnson and Johnson Inc., our purpose is to Bring Science to the Art of Healthy Living\" by providing consumers with some of the most world's most widely used and trusted brands including; Johnson's ® Baby, Neutrogena, Aveeno, Listerine, Tylenol, Calpol, Nicorette and many more.  On our growing global analytics team, we are looking for someone who wants to shape the future of personalized marketing for healthier more vibrant lives.  The ideal person is passionate about using data science to create more meaningful consumer experiences and reaching the right person, at the right moment, with the right content. They believe that people based marketing fueled by data is the future of marketing and want to shape new analytics capabilities in a context of purposeful, trusted brands.  Data Scientist will be a part of the Global team driving Analytics for Personalized Marketing and will partner closely with NA regional team. This is a hands-on role responsible for building and adapting transformational algorithms and data mining strategies to enable best in class personalized marketing Globally and in NA. You will have a direct impact on media ROI Globally, by enabling more robust data-driven media targeting and more relevant communications. You will shape and deliver best in class data audience segmentation, insights and consumer centricity.  You will have strong collaborative partnerships with multiple other functions: Consumer Insights and Analytics, Media Agency, IT, Brand Mangers, and various suppliers.Major Responsibilities:"}