{"jobID": "2695903535", "jobLocation": "San_Antonio_TX", "jobTitle": "Entry Level Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.labattfood.com", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1910", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "We are offering full-time positions to highly-motivated, tenacious career-seekers at our company headquarters in San Antonio. Business Analysts spearhead Labatt’s many continual improvement efforts by identifying problems and opportunities, making detailed assessments through interviews and quantitative analyses, working with internal software developers to codify robust, standardized processes and tools, and finally by working with business people to drive cultural and procedural changes. Business Analysts at Labatt follow our own specialized change management methodology that gains its inspiration from the tenets of Lean and Six Sigma as well as the philosophies of Demming and Drucker. By interfacing extensively with executives, operational managers, employees, engineers, vendors, and customers, Analysts are truly poised to gain dramatic insight into the food industry at large, and more importantly, into Labatt’s highly differentiated poise within the industry.As an Analyst at Labatt, you will:--Manage software development processes using Lean Startup and Agile methodologies--Aid in crafting and executing strategic initiatives--Solve some of the industry’s and our company’s hardest problems--Communicate excellently, assessing problems both abstractly and concretely--Analyze, and help the organization digest, large sources of data with untapped potential--Set individual and team goals and demonstrate the resourcefulness to achieve them--Hold yourself and your teammates accountable to achieving robust success--Live by a philosophy of genchi genbutsu--Learn continuously, through training, mentoring, and a strong culture of high-level reading Your direct manager is a corporate-level executive in one functional area of the business. Analysts who succeed at Labatt will settle for nothing less than the best, and have demonstrated this disciplined, accountable focus time and again in previous experiences, whether academically or at the workplace. A competitive undergraduate degree with outstanding marks is required. The Analyst position demands core values that constitute our company culture, including: a strong focus on excellence, hard work, integrity, teamwork, and customer-orientation."}