{"jobID": "2817497928", "jobLocation": "Brea_CA", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": "61000", "jobDescription": " The Business Intelligence (BI) Analyst has responsibility on an account/platform for data, reporting and analytics processes that touch all aspects of service delivery to be consistent with corporate standards. The role is critical to the success of the client relationship in driving performance management, process improvement and innovation thru fact-based decision making. Using experience, the individual will uncover several perspectives on a problem or opportunity, determining any and all drivers towards or barriers to successful performance, and makes recommendations based on what is discovered.  Job Responsibilities Understanding of contract key performance indicator and reporting requirements and client expectations.Devise and promote creative data visualization to derive actionable intelligence.Data modeling, analysis and compilation of quantitative data.Forecast/trending of performance data.Process mapping and efficiency analysis.Develop recommendations based on data interpretation and analysis to transform behaviors and techniques.Develop automated tools and dashboards to provide real-time insights to business data.Use of advanced statistical concepts to determine significant sources of variability.Provide subject matter expertise for all data related processes and analysesAnalyze trends of monthly Key Performance Indicator results for performance improvement concepts.Create, maintain, and optimize the account wide dashboardDraft and distribute reports weekly, monthly, quarterly, and annuallyDevelop visualization that will be used to tell a story and provide actionable intelligenceCompetenciesData Management - Ability to process large amounts of data in an organized manner.Comfort Around Higher Management - Can deal comfortably with more senior managers; can present to more senior managers without undue tension and nervousness; understands how senior managers think and work; can determine the best way to get things done with them by talking their language and responding to their needs; can craft approaches likely to be seen as appropriate and positive.Technical Learning - Picks up on technical things quickly; can learn new skills and knowledge; is good at learning new industry, company, product, or technical knowledge; does well in technical courses and seminars.Strong Communication ability to convey complex concepts into language that can be widely accepted; can easily articulate ideas and logic behind all approaches Knowledge, Skills&Abilities; Bachelor's degree in Finance, Information Technology or related field required2-4 years of work experienceTechnical Skills:High level skill with Microsoft Office (Excel, Word, PPT) required. SharePoint experience a plus.Strong experience working with relational databases and large data setsStrong SQL skills required; reading and writingStrong visualization skills with TableauExperience with other data and statistical applications (PowerPivot, SSRS, Access, Sigma Excel, PowerBI)#LI JLL Is an Equal Opportunity Employer  JLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veteran's status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.  For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf.  If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at careers@am.jll.com"}