{"jobID": "2663632884", "jobLocation": "Milano_TX", "jobTitle": "Data Analyst M/F-VIE-Milan", "companyRating": null, "companyInfo": {"Website": "www.societegenerale.com", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 1864", "Type": " Company - Public (GLE) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " BNP Paribas, Natixis, Calyon Securities USA"}, "estimatedSalary": null, "jobDescription": " EnvironmentYour environment At Societe Generale, you will be joining the Finance division of Global Banking & Investors Solutions (GBIS), one of the three pillars of SG that brings together Corporate and Investment Banking activities, Private Banking activities, Asset Management and Investor Services. This division oversees the quality and delivery of financial statements for GBIS, the independent certification of financial data for various activities, and also provides day-to-day explanations on profit and loss for market activities.In Milan based, will be part of Data Governance team, the VIE will be a Data analyst/ scientist to support the team that is part of Business Support dept.Data Governance provides a key contribution to Group value creation:Support and challenge all business lines, at every level of the organization to support decision making and “being driven by data”,Ensure the quality, consistency and timely accessibility of data through innovative solutions \"business intelligence\" in support of the 'identification and development of new business opportunities. Define, develop and implement the strategies and methods of management and use of data. MissionYour roleWithin Business Support dept. and Data Governance team, the VIE contributes to enrich the data quality stream.As such, the VIE will be involved in several topics as:Work with large amounts of data: facts, figures, and number managing. You will need to see through the data and analyze it to find and propose results.Data analysts are often called to present their findings, or translate the data into an understandable document. You will need to write and speak clearly, easily communicating complex ideas.Data analysts must look at the numbers, trends, and data and come to new conclusions based on the findings.Attention to Detail: Data is precise. Data analysts have to make sure they are vigilant in their analysis to come to correct conclusions.Define Dashboard with users stakeholder.Define control/automated alert on decisional dashboardHe/ She will also participate in the projects aimed at automating tasks mentioned above. He/ She will will be able to obtain a complete view of the activities of different business lines of SGSS in Italy.The VIE assignment in a nutshell This VIE in Milan is to begin as soon as possible but you need to plan 3 months between your application date and the beginning of your VIE assignment. It will last 18 months.  The VIE is a specific contract, under Business France’s eligibility criteria, opened to candidates under 28 and from the member states of the European Economic Space. Please see www.civiweb.com, in order to have more details regarding your financial indemnities. ProfileYour profileGraduate with a Master degree from Business school or University, majoring in computer science, engineering, statistics .A previous experience in Investment Banking would be appreciated.  You are fluent in English.  You are proficient in Office application.  EvolutionYour career pathTo facilitate the examination of your application by our English-speaking managers, we thank you for applying in English."}