{"jobID": "2833944231", "jobLocation": "Zeeland_MI", "jobTitle": "Senior Design Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.odl.com", "Headquarters": "Zeeland, MI", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " It’s fun to work in a company where people truly BELIEVE in what they are doing! We’re committed to bringing passion and customer focus to the business. Position Overview: Provides visual representations by conceptualizing, designing, and developing prototypes for new and existing products. Utilizes design and development software, tools and equipment. Participates in design reviews, DFMEA, and project activities to ensure that products move through developmental phases smoothly. Reviews the tolerance stack up analysis done by fellow designers. Leads and coordinates activities related to establishment of Design Engineering guidelines, procedures, and related processes. Researches, recommends and maintains CAD hardware/software tools, standards and equipment. Ensures that systems are current and adequate to perform design work. Participates in continuous improvement processes, implementing procedures and processes to improve efficiency of department. Participates in cross-functional teams related to product development. Serves as a liaison between individuals and units, internally and externally as needed. Essential Job Functions: -Physics/Basic Engineering Analysis At this stage, performing mathematical modeling for any phase of a program is second nature.The senior design engineer is highly proficient in framing design objectives in the language of physics.Will be able to evaluate the appropriate level of analysis (BEA, FEA, proto. test) as well as apply practical wisdom to determine the effort required to produce meaningful results.Viewed by the engineering community as analyst, problem solver and teammate.Is recognized as an expert in product area.Is competent enough in peripheral disciplines to take on assignments at an intermediate level or above.Has played a key role in developing or supporting the creation of templates and check sheets. -CAD / Drawing Creation Constructs sophisticated solid models and surfaces that are correct for all downstream activities.Works as fast and efficiently as the tool allows.Can create kinematic models and performs all necessary studies available in CAD tools.Able to create all required drawings.Able to mentor Novice and Intermediate Engineers.Manufacturing processes and datum schemes should be considered in the construction of the data.Can use PDM Works to add/remove parts, build assemblies, promote data through the life cycle process, conduct extended queries, understand BOM structures including parent/child relationships, version data and manage design alternatives.The user is also able to exchange data with suppliers and remote sites.Knowledgeable on the proper use of design guides and helps maintain the guides. -Product Cost Estimation and Optimization: Uses Indented Bill of Material with cost to evaluate every design decision.Understands product costs to the level of being able to propose changes for improvement.Has a deep understanding of the manufacturing footprint and incorporates this understanding in making design and cost decisions.Drives VA/VE to lower product cost. -Manufacturing Processes: This knowledge base refers to a thorough understanding of the specific manufacturing processes and assembly methods that will be used to make the final product, including process capability and control.It includes manufacturing knowledge of all components and subsystems, from raw material conversion to final system level assembly, and the associated Best Business Practice (BBP) processes. -Tooling: Thorough understanding of tooling considerations in the design of their particular product.Very familiar with tool design, development, and fabrication processes, and how these interact with product design and development.Thorough understanding of dimensional control considerations in the tooling.Ability to leverage this knowledge in optimized product and tool designs.Easily able to adapt the design to address tooling concerns. -Gauging: Understands production application of gauges for multiple product types and gauge configurations.Can establish gauge datum and clamp strategy and identify data acquisition method for each attribute.Demonstrates understanding of how gauges are used to improve design integrity and influence product development. -Innovation/Creativity: This criterion involves the belief that anything is possible and that customers want something different from what we've always done.The approach addresses product opportunities and challenges by drawing from diverse experience and knowledge to propose new and elegant solutions.The Senior Design Engineer can start with a blank sheet of paper and ideate product opportunities from scratch.The Senior Design Engineer can draw on product and process knowledge to create product that is truly novel with increased value for ODL and its customers.The Senior Design Engineer can intuitively determine validity of an idea, technically and commercially, without any need for time-consuming data acquisition. -Problem Solving & Critical Thinking: This skill refers to the individual's ability to use critical thinking to identify the issue and apply the appropriate problem solving approach.Recognizes the need for (KT) Problem Solving approach. Proficient in Pugh analysis to evaluate effective countermeasures. -Simulation / Analysis / CAE: This skill set refers to the design engineer's ability to use computer-based simulation and analysis tools (CAE).Able to formulate inputs, use CAE tools, and analyze results on complex problems without guidance. -Engineering Information Systems: Knows how to navigate in Oracle and perform search criteria.Understands tasks and routes.Can use the system to execute the design function of the Product Change Management procedure and the ECR/ECO process.Attends and provides input to Solidworks User Forums. Stays current on new revisions and helps plan and implement software upgrades. -Communication Skills: This skill set includes the ability to effectively communicate with all levels of people.This may include customers, project teams, management, etc.Communication skills span written, graphical, and verbal areas.Specifically, this skill includes reporting with succinct, visual communication of information; excellent writing and presentation skills; and good verbal communication. -Teaming Skills: Ensures that good positive relations are maintained and enhanced in all situations and environments. Contributes essential value to the teams he/she is on.Commands attention and respect from ODL employees, suppliers, and customers equal to (or beyond) title and positional authority.Stimulates performance in fellow team members through example.Has well-developed whiteboarding skills and regularly uses them in team situations. -Tactical Planning / Project Management: Familiar with traditional program management techniques and tactical planning tools.Generally a contributor, not a leader in planning efforts.Can be counted on to deliver programs and projects on time.Establishes tasks and priorities on a program.Efficiently utilizes time and resources.Effectively balances and executes multiple tasks with minimum guidance.Identifies demand conflicts and seeks guidance when appropriate. -Leadership: Demonstrates transparency; fully explains own position & confronts hidden agendas.Does the right thing without worrying about personal sacrifice.Lives the SSR culture and embraces ODL values.Drives Accountability is establishing clear, measurable goals; taking ownership of responsibilities and commitments to those goals; and moving others to take responsibility for their goals.Achieves results in an unstructured, ambiguous & changing environment.Addresses issues early to avoid surprises.Approaches obstacles as challenges to overcome & works around roadblocks.Candidate Requirements:Bachelor’s degree in Design, Engineering or related field preferred; equivalent experience may be considered.10-15 years related design experience with a variety of products.Ability to operate standard and specialized equipment and software effectively (i.e. AutoCAD, SolidWorks, etc.).Demonstrated ability to read and interpret engineering drawings and apply common engineering, design and drafting principles. Experience with tolerances, stack ups, and assemblies in accordance with industry standards and practices.Good organization skills with the ability to work on projects from beginning to end. Must be able to coordinate necessary resources and manage timing and implementation of projects.Ability to work independently under limited supervision while taking initiative and make decisions to achieve goals and complete projects.Demonstrated good communication skills to interact with internal and external contacts.Proven leader with demonstrated successes in departmental improvements. Sr Design Engineer TCA.docSr Design Engineer TCA.doc"}