{"jobID": "2794045360", "jobLocation": "Washington_DC", "jobTitle": "Safety Outcomes Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.medstarhealth.org", "Headquarters": "Columbia, MD", "Size": "10000+ employees", "Founded": " 1985", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": " Under general supervision of the Assistant Vice President, Safety and/or designee, plays a lead role with data management, mapping across multiple data sources, analysis, interpretation, and reporting related to patient safety via a variety of databases. Provides database management and outcome reporting for all MedStar Health acute and non-acute facilities through the use of quality and safety database systems to support quality and safety improvement. Leads the creation and analyses of targeted quality and safety datasets that identify both system-wide and site-specific areas for improvement. Provides expertise on the potential development of safety software that integrates data from multiple sources to provide new insights on safety hazards.Qualifications EDUCATION: Bachelors degree in information systems or data analytics, health care, business or an equivalent combination of education and experience. Masters level education/degree preferred. EXPERIENCE: 3 years experience in healthcare data systems and analysis; experience supporting customer groups through data analysis and data visualization. Clinical and/or operational database management experience is beneficial. Proficient in statistics. Experience with algorithm development to efficiently and effectively analyze structured and unstructured data. Experience with backend and frontend software development. LICENSE/CERT/REG: No special certification, registration or licensure is required. SKILLS: Ability to quickly grasp the operating tenets of application systems and put them to use in rapid fashion. Advanced competency with Microsoft Office, Visio, relational databases and data visualization tools such as Tableau required. Understands basic information visualization principles. Comfortable working with SQL: understand the difference and how to implement SQL updates, inserts, append, join and with commands. Basic data science skills. Excellent written and verbal communication skills.Job Duties: Analysis of Data: Performs complex and detailed clinical, operational and statistical data analysis with outputs that are clear and relevant to the users. Develops auditing processes to ensure quality control of the work, including documentation audit trails. Completes assignments in an efficient, quality-focused manner. Reports any safety issues through established clinical data and analytic processes for documentation and follow-up. Collaborates to identify appropriate techniques to gather data, streamlining and automating to the most prudent use possible. Contributes to the achievement of established department goals and objectives and adheres to department policies, procedures, quality standards and safety standards. Complies with governmental and accreditation regulations. Data Sources: Learns, understands and becomes proficient in relevant MedStar and external data sources and systems including but not limited to occurrence reports, risk management data, electronic health record data, patient complaint data and Vizient databases. Utilizes appropriate data sources, definitions, and integration for analysis as appropriate. Understands the limits of use for each data source as well as the differences between similar elements in different data sets. Demonstrates high proficiency with data mining, management, and visualization tools. Fosters data driven decision-making and a high reliability organizational culture. Generates reports and analyses to support safety related improvement projects, operational effectiveness, quality improvement, and as appropriate, health services research. Manages projects as assigned to meet established goals and timelines. Maps data from multiple databases that may be coded to different taxonomies; text mine and integrate multiple data sources in order to standardize language with the goal of more effective analytics. Participates in multidisciplinary quality and service improvement teams as appropriate. Participates in meetings, serves on committees and represents the department and hospital/facility in community outreach efforts as appropriate. Performs other duties as assigned. Presentation of Data: Presents complex data with simplicity of design in a clear, easy to understand format. Communicates complex ideas with clarity, precision, and efficiency in a manner that supports accurate comprehension by the recipient. Supports other members of the department by providing ad hoc technical assistance. Uses software analysis tools such as SAS, SQL and data visualization tools to report, analyze and interpret healthcare data; provides data support and responds to ad-hoc requests for customized data queries, reports and analyses.About MedStar Health MedStar Health is dedicated to providing the highest quality care for people in Maryland and the Washington, D.C., region, while advancing the practice of medicine through education, innovation and research. Our 30,000 associates and 5,400 affiliated physicians work in a variety of settings across our health system, including 10 hospitals and more than 300 community-based locations, the largest visiting nurse association in the region, and highly respected institutes dedicated to research and innovation. As the medical education and clinical partner of Georgetown University for more than 20 years, MedStar is dedicated not only to teaching the next generation of doctors, but also to the continuing education and professional development of our whole team. MedStar Health offers diverse opportunities for career advancement and personal fulfillment."}