{"jobID": "2668989530", "jobLocation": "Alhambra_CA", "jobTitle": "Device Engineer/Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.emcore.com", "Headquarters": "Alhambra, CA", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Public (EMKR) ", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sharp Electronics (US), Finisar"}, "estimatedSalary": "94000", "jobDescription": " Requisition Number 18-0012 Title Device Engineer/Scientist City Alhambra State CA Description EMCORE Corporation designs and manufactures Indium Phosphide (InP) optical chips, components, subsystems and systems for the broadband and specialty fiber optics market. EMCORE was the pioneer in linear fiber optic transmission technology, and today is  a leader in optical components, as well as a provider of complete end-to-end solutions for high-speed communications network infrastructures, enabling systems and service providers to meet growing demand for bandwidth and connectivity. EMCORE’s advanced optical  technologies are designed for cable television (CATV) and fiber-to-the-premise (FTTP) networks, telecommunications and data centers, satellite communications, aerospace and defense, wireless networks, and broadcast and professional audio/video systems. With  its world-class InP semiconductor wafer fabrication facility, EMCORE has fully vertically-integrated manufacturing capability and also provides contract design, foundry and component packaging services. EMCORE is headquartered in Alhambra, California, USA  with InP wafer fabrication operations in Alhambra, and ISO 9001 certified manufacturing in Alhambra and Beijing, China. For further information, please visit http://www.emcore.com.  EMCORE Corporation is seeking to fill the position of Device Engineer/Scientist at our Wafer Fab facility located in Alhambra, California. The candidate will be responsible for the design, optimization, wafer fabrication processing of III-V materials and device  testing/characterization for semiconductor lasers and photo-diodes. PRINCIPAL DUTIES AND RESPONSIBILITIES:Take technical ownership of chip design, work closely with various functions including MOCVD facility and processing group, to design and implement the processing of the structure. Develop an appropriate process for low cost and high-performance semiconductor  lasers for digital and analog applications In the device development phase, monitor and report on yield for III-V device wafers, coordinate reliability assessment of prototype devices, conduct FMA and implement corrective actions to achieve yield and reliability goals.Work cross functionally with manufacturing and marketing/sale department to improve the cost of manufacturing III-V devices. Support production in all technical aspects.Organize all the phases of product design reviews, generate production documentation, manufacturing process instruction, acceptance test procedure and transfer to production (NPI) as defined by EMCORE Development Procedure."}