{"jobID": "2741914434", "jobLocation": "San_Ramon_CA", "jobTitle": "Business Data Analyst(Banking)", "companyRating": "3.3", "companyInfo": {"Website": "www.ascent-sys.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Please contact Meera Makam at 925 627 4935 or email mmakam@ascentsg.com for any questions ??8 - 10 years of experience in IT including considerable experience in Finance and Data warehousing projects . * Atleast 5 years of experience in Banking Industry ?3 Years of Data warehousing experience and proficient SQL is must? Understanding of banking and trading books/GL and/or Master Data Management and/or Compliance and/or Regulatory reporting and/or CCAR and/or IFRS9 Experience in Data Profiling, Data Analysis, Data Discovery and Source to Target mapping document.?Excellent written and verbal communication Please contact Meera Makam at 925 627 4935 or email mmakam@ascentsg.com for any questions  Company Description:About Ascent:  Ascent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.  If you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}