{"jobID": "2698651220", "jobLocation": "Midland_MI", "jobTitle": "Home Health Nurse RN Float - Weekend", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "27", "jobDescription": " Position Information  FTE: 1.000000  Exempt: No  Float Days: 40 Hrs/Wk; 80 Hrs/Pay; Friday- Sunday 8:00AM- 8:00PM  Weekend & Holiday Rotation: Per schedule  Pay Grade: 13  Position Summary  The Staff Registered Nurse provides professional and comprehensive nursing care within the scope of agency services. The target patient population for this position are those requiring skilled clinical home care services. Activities of this position are patient focused and utilize the nursing process of assessment, planning, intervention, and evaluation in accordance with nursing practice standards, physician orders, and agency policies and procedures.  Responsibilities  ESSENTIAL:  Responsibilities: (20%)* Regularly assesses patient’s/client’s needs and provides skilled nursing services as prescribed by the physician authorized plan of care, and accepted standards of nursing practice. (20%)* Initiates plan of care for assigned patients and revises and adapts as necessary. (20%)* Provides nursing care (or arranges for services through specialized staff) through ongoing visits to a group of patients, sharing the patient caseload. (15%)* Coordinates patient care by evaluating outcomes and providing on-going feedback to others involved in care relative to patient status and changes needed on patient care plan. (15%)* Coordinates care provided by LPNs and Home Health Aides and supervises LPN as needed. (10%)* Notifies physician of changes in patient condition and care needs and obtains new orders as needed. OTHER DUTIES AND RESPONSIBILITIES: Coordinates care provided by LPN’s and Home Health Aides and supervises LPN as needed  Provides symptom management for discomfort related to end of life care  Provides patients/caregivers/physicians with the necessary information regarding the disease process and end of life care issues deal with issues of ethical concern  Implements preventative and rehabilitative nursing procedures and utilizes community and agency resources for optimum patient care.  Utilizes Agency documentation system to record services provided according to agency, professional, and program standards. Assists in maintenance of patient records.  Provides patients/caregivers/physicians with the necessary information to promote informed decision making leading to the achievement of optimal level of independence.  Participates in the clinical team in providing patients/caregivers with information required by regulatory agencies. Functions as part of multi-disciplinary team in coordinating care and prioritizing needs.  Establishes a Home Health Aide care plan and supervises the Home Health Aide according to Agency guidelines. May make joint visits with other disciplines to assure consistency of care.  Functions as part of multi-disciplinary team in coordinating care including planning for discharge.  Acts as a preceptor to provide educational visit opportunities for students and will participate in orientation of new staff as assigned.  Participates in Agency, community and/or home health organization activities as assigned appropriate.  Participates in staff meetings, in-service education programs, and other opportunities for learning.  Complies with documentation requirements for employee personnel and activity records as defined in Agency policy.  Carries out work according to Agency policies and procedures in such a manner as to appropriately reflect Agency standards for timeliness, accuracy, and productivity.  Maintains confidentiality of client and Agency information.  Adheres to the Agency standards related to personal appearance and behavior.  Participates in weekend and holiday rotations and on-call duties as identified in personnel policies.  Participates in Agency performance improvement process.  Assists in Agency community education activities as requested.  MidMichigan Health is a technology driven organization and employees need to demonstrate competency in Microsoft® Windows. An employee may be required to participate in further learning opportunities offered by MidMichigan Health.Other duties as assigned.Qualifications  Education: Associates DegreeNursing  Credentials:"}