{"jobID": "2735597393", "jobLocation": "Dearborn_MI", "jobTitle": "Transportation Modelling Engineer: Shared Mobility and Traffic", "companyRating": null, "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob Description The candidate will play a pivotal role in developing Fords transportation operating system (tOS). They will be an integral part of Fords \"Mobility Research\" department: a varied and interdisciplinary group within Research and Advanced Engineering that is dedicated to cutting-edge research to improve transportation accessibility, mobility, and sustainability for all. The candidate will help Ford to develop and simulate a variety of new mobility solutions, both for internal customers at Ford and for cities themselves. Specific responsibilities include: Develop and simulate innovative transportation concepts and solutions for cities, such as: Shared Mobility ServicesMultimodalityTransportation Network ResilienceConnected and Autonomous Vehicle (CAV) IntegrationTransportation Planning for Rapid UrbanizationIntegrate Ford concepts and solutions into traditional and new microscopic and mesoscopic transportation models. Some examples are traffic signal optimization, car-following behavior (including simulating mixed traffic with automated and manually-driven vehicle), and various shared-mobility models.Work with the team and external transportation partners, including commercial companies, universities, national labs, and government (e.g. MPOs and DOTs).Work with various groups within Ford: e.g. Ford Mobility and City Solutions, Strategy, Global Data Insights and Analytics, Automated Vehicles, and Product Development.Position Qualifications:Required:Master's degree in Civil Engineering, Urban Planning, Industrial & Operations Engineering (with a focus in transportation).2+ years experience in transportation modeling, including work on one or both of the following (coursework allowed): Hands-on microscopic traffic simulation using software programs such as PTV Vissim, Aimsun, TransModeler, etc. Self-coded approaches also acceptable (e.g. for dissertation work). Focus could be in areas such as traffic signals or car-following.Shared mobility modelling, such as on dynamic shuttles, shared automated vehicles, and/or mobility as a service.Preferred:PhD. In Civil Engineering, Urban Planning, Industrial & Operations Engineering (with a focus in transportation) or equivalent.Experience in transportation modelling/optimization approaches that deal will new mobility solutions. In addition to shared mobility modeling as mentioned above, other examples include connected vehicles (e.g. V2V and V2X), autonomous vehicles, multimodality, transportation accessibility, and journey planning.Experience in mesoscopic activity-based and/or agent-based transportation models, such as MATSim.Experience in mode choice and other aspects of user behaviorExperience working with city and government plannersExperience with using GIS The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities youd expect from a diverse global leader. Youll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always ready to go further.  Visa sponsorship may be available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status. "}