{"jobID": "2435744455", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Scientist, Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.omnisciencelabs.com", "Headquarters": "Palo Alto, CA", "Size": "1 to 50 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The PositionWe are looking for an expert Jack or Jill of all things data science to join our Applied Data Science team. This person will actively work to translate a customer business problem into an analytical solution leveraging our core technology. The types of problems we solve provide our clients with leading edge capabilities through transforming entire industries. This requires a tremendous amount of creativity and in-depth industry knowledge.What You Will Do• Rapidly prototype solutions in R, python, or something similar• Partner with cross functional teams across sales, engineering, and product development• Think critically about problems and debate methodology, but know when its time to roll up your sleeves to get things doneMinimum Qualifications• PhD in a Science, Math, or Engineering related discipline • Technical skills with R, Python, or distributed frameworks like MapReduce and Spark• A portfolio of machine learning projects or products• Math, statistics, and the ability to think critically on the flyPreferred Qualifications• Finance and insurance experience is a plus• Experience contributing to research communities and/or efforts, including publications at conferences, citations, etc.• Enthusiasm for advanced analytics and machine learningCompany OverviewOmniscience is a fast-growing, venture-backed, early-stage AI startup in the heart of Silicon Valley currently operating in stealth mode. We are the solution of choice for the Fortune 500. Insert glowing financial package here, but more importantly• We have built some of the largest revenue generating online systems in the world in areas of data science, systems engineering, and management. • Our team is shamelessly highbrow and cherishes market-driven scientific accomplishment. • We live by the ethos, \"there is no crowd at the last mile\". Working here will elevate your game. • We understand that only happy, healthy, intelligent, hard-working people can produce industry changing innovation in a sustainable manner.As an equal opportunity employer, Omniscience does not discriminate against any applicant or employee based on race, color, sex, sexual orientation, gender identity, marital status, religion, national origin, ancestry, age, disability, military or veteran status, genetic information or any other basis protected by applicable federal, state, or local laws.We do not accept resumes from head-hunters, placement agencies, or other suppliers that have not signed a formal agreement with us."}