{"jobID": "2823798757", "jobLocation": "Austin_TX", "jobTitle": "DATA ANALYST", "companyRating": "3.7", "companyInfo": {"Website": "www.underarmour.com", "Headquarters": "Baltimore, MD", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (UA) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Data Analyst at Under Armour, Inc.  Skip Navigation  Under Armour Careers  Menu Life At UALife At UAOverviewMission & ValuesBenefitsCultureTalent AreasTalent AreasOverviewCorporateRetailDistributionTechnologyWho We HireWho We HireOverviewStudentsWhere We LiveWhere We LiveOverviewBaltimore, MDAustin, TXSan Francisco, CAPortland, OROther U.S. LocationsGlobal Locations Search Jobs Shop UA******UASUA CorporateFollow usFacebookYouTubeTwitterLinkedINInstagramPinterestJoin Our Talent CommunityEnglishFranais Data Analyst ***** Austin, Texas 06/19/2018 Corporate  Save JobRemove JobView Saved Jobs View Benefits Later  Under Armour is all about performance. Because what we make empowers athletes in every form to push themselves, to turn good into great, and to stay hungry for whatever comes next. And this is exactly what we expect from each other.  Working with us means one key thing: no matter what you do, you see every day and every project as a chance to push your field forward. In every store and every office, we build teams where everyone is an MVP. And together we tackle every challenge head on. Because we work to push the gear, the game, and ourselves farther.  We're looking for people who do more than good work.  We're looking for the Best in Every Game.  Under Armour is the chosen brand of this generation of athletes... and the athletes of tomorrow. We're about performance - in training and on game day, in blistering heat and bitter cold. Whatever the conditions, whatever the sport, Under Armour delivers the advantage athletes have come to demand.  That demand has created an environment of growth. An environment where building a great team is vital. An environment where doing whatever it takes is the baseline and going above and beyond to protect the Brand is commonplace.  The world's hungriest athletes live by a code, a pledge to themselves and everyone else: Protect This House... I Will. Our goal is to Build A Great Team! Will YOU.Protect This House?!  Do you geek out at the intersection of statistics and storytelling? Are you passionate about finding the story the data is telling, and using it to help drive key decisions? Are you interested in helping shape the direction of the world's best fitness brand?  Let's talk.  The Under Armour team not only makes the best performance apparel and shoes on the planet, we also offer the world's most integrated digital health suite of apps, devices, and apparel. And we need a cutting-edge digital marketing analyst to help bring that story together. You / Data Analyst will partner with our marketing team derive insights from our digital health platforms that inform the clients' understanding of the digital health consumer and their own relationship with that consumer. The candidate will be part of the analytics team who supports tasks that include: In depth analysis of marketing and consumer data, includingUser behavior analysisSegmentation studiesDriver analysesAdvanced exploratory analytics to drive insightful and reportingPerformance metrics definition, algorithm development and automationReporting and visualizationIntegration with Engineering teamsRequirements building for feature development for use in analyticsInstrumentation optimization with development engineersComplex data analysis tasksData anomaly detection and correction modelingTransformation and manipulation scriptingConversion of data into stories for internal and external consumptionCross-team support for multiple application platforms and verticalsThe candidate must have experience with:Advanced degree in an analytical field (math, business, statistics, hard or social sciences) and 1-2+ years in data analytics, or BA in like field with 2-3+ years experienceUsing data to solve complex business questionsCommunicating data stories in written and verbal form to wide audiences of varying levels of sophisticationAdvanced SQL skillsJavaScript D3 libraries or Tableau visualizationProgramming in a scripting environment (e.g. Python) or ETL development experienceDexterity with an advanced statistical package (e.g. R, SciPy) At Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.  This Job FacebookTwitterLinkedInGoogle+ Related Jobs Product Analyst, Product Analytics Austin, Texas ******* 06/19/2018Product Designer Austin, Texas ******* 06/15/2018Project Manager - Platform Team Austin, Texas ******* 06/11/2018Copywriter/Content Strategist, Global eCommerce Austin, Texas ******* 06/05/2018Senior Software Engineer Austin, Texas ******* 05/30/2018 see What's Here  Each of our locations have its own advantages. Check here to see the restaurants, schools, and more around this office.See It Now  Sign Up For Job Alerts  Stay ready and on top with the latest career opportunities and UA news delivered right to your inbox.  Email AddressInterested InSearch for a category and select one from the list of suggestions. Search for a location and select one from the list of suggestions. Finally, click Add to create your job alert.  Category  LocationAdd Corporate, Austin, Texas, United StatesRemoveRemove Confirm Email Lighthouse This is where we are growing. Where we are going to build what's next. How we are making a major difference in the city that Under Armour calls home. Learn More Gen Fitness Our connected fitness team does one thing: build the next generation of fitness technology. Learn More Jobs By CategoryJobs By LocationJobs By Group This is our Universal Guarantee Of Performance.  We call it the UGOP. It means that every Under Armour product is doing something for you: it's making you better.  The logo is our guarantee.  At Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law. Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. Data Privacy Policy. EU Privacy Policy  Copyright 2018 Under Armour, Inc. All Rights Reserved. No imagery or logos contained within this site may be used without the express permission of Under Armour, Inc. EOE."}