{"jobID": "2832240328", "jobLocation": "Cypress_CA", "jobTitle": "Sr Business Data Analyst ( Remediation )", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "66000", "jobDescription": " We'll put you in the driver's seat on vital projects that have strategic importance to our mission of helping people lead healthier lives. Yes, we share a mission that inspires. We need your organizational talents and business discipline to help fuel ours. It's the opportunity to do your life's best work.(sm)  Use your sharp analytical skills to help us support, compile and report key information! Make solid recommendations based on the analysis and provide explanations for reporting results for both internal client management and our E&I; book of business.  As a Senior Business Data Analyst at OptumRx, you will grow and develop as you conduct and calculate outcomes of various research and analytic requests. You will be challenged to analyze, research, and interpret data for clients and business planning. As a key resource, you must maintain a high degree of accuracy along with attention to detail, excellent oral and written communication skills, strong personal work ethic and the ability to manage time to meet deadlines. Success in this role will require ability to prioritize and multitask, as well as being flexible, resourceful, and self-driven!  Youll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges. Primary Responsibilities: Support client issue remediation by reviewing and analyzing pharmacy claims (calculating before and after scenarios)  Review external auditor findings, for either agreement or disagreement  Research, analyze, and evaluate claims data to identify patterns and validate accuracy  Work closely with the client account team and other functional departments  Provide explanations, interpretations, and recommendations for reporting results as needed  Support various projects with financial impacts as needed"}