{"jobID": "2812792636", "jobLocation": "Austin_TX", "jobTitle": "Analyst, Investment Analytics & Data", "companyRating": "3.4", "companyInfo": {"Website": "www.dfaus.com", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Note to applicants: Resumes are required as part of your application. When applying from a mobile device or tablet, you may not be able to attach a resume. If you cannot attach a resume at the time of your application, you will receive a follow up email asking you to attach your resume from a computer.Job Description:Investment Analytics & Data (IAD) is part of the Research department within Dimensional. Data and data analysis are at the underpinnings of how Dimensional constructs and manages portfolios and works to provide the best investment experience possible for our clients. IAD is responsible for ownership of investment data, which means managing data from acquisition through distribution, driving analysis to create information from data, and creating the information and analysis consumed by internal and external reports. IAD is a hub group touching numerous areas of the implementation of the investments process and interacting with most other departments within Dimensional.  Responsibilities:  Our team seeks an intellectual and creative analyst or associate (DOE) within the Portfolio Analytics area to work on key projects spanning research and portfolio management within Dimensional. Success in the role will mean learning both the big picture and nuance of Dimensional’s investment philosophy and how it translates into the implementation of an investment process. Strong intellectual curiosity combined with an ability to dig into details is a prerequisite. The work is team-based and involves architecting systems, building systems and processes, maintaining data sets and tools key to portfolio decision-making, and performing and explaining ad hoc analysis. Success in the job, including career progression, will be driven by successfully maintaining the operational process driving Dimensional’s investments and executing on projects to enhance and improve these processes.  Qualifications: Bachelor’s degree, ideally in computer science, mathematics, engineering, economics – show us you have a capacity for and interest in quantitative work.Experience with programming in one or more languages – demonstrate the ability to code, to solve problems algorithmically.Understanding of financial markets and desire to learn more – know what Dimensional does.Experience with databases and large data sets – show you can work with and analyze data to provide meaningful results Knowledge of T-SQL and databases in general highly considered, as so much of the job involves pulling data from databases and performing analysis  It is the policy of the Company to provide equal employment opportunity for all applicants and employees. The Company does not unlawfully discriminate on the basis of race, color, religion, creed, sex, gender, gender identity, gender expression, national origin, age, disability, genetic information, ancestry, medical condition, marital status, covered veteran status, citizenship status, sexual orientation, or any other protected status. This policy applies to all areas of employment including recruitment, hiring, training, job assignment, promotion, compensation, benefits, transfer, discipline, termination, and social and recreational programs."}