{"jobID": "2815787227", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Production Supervisor - Weld, 2rd Shift", "companyRating": "2.6", "companyInfo": {"Website": "www.challenge-mfg.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": " The Group Leader is the front line of leadership at the plant level. Their purpose is to oversee all operations within their area (zone). The Group Leader is responsible for ensuring that Safety, Quality, Delivery and production Efficiencies meet the standards and expectation of internal and external customers. Group leaders are also moral builders and are responsible for creating a positive work environment for all employees. RESPONSIBILITIES AND RESULTS:Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Manage processes with detailed accuracy, and discipline.Coaches and assist all employees with problem solving, and personal issues.Train team members' on various processes, procedures and job tasks within their work zoneCertify team members' on individual workstations to satisfy each level of progression on the skills matrixEnsures quality standards are met.Ensures on time delivery is met according to customer demands, and scheduling.Pays close attention to detail. Example: Safety, Housekeeping, quality, performance, instructions given by management, and employee well-being.Incident reporting, and investigation of root cause for injuries, near misses, and manufacturing equipment incidents (i.e. mis-hit, tool crash, etc..).Monitors employee attendance, and disciplines accordingly in accordance with the employee handbook.Monitor production quality and throughput. Ensure that hour by hour boards, zone boards and other production monitoring systems are updated.Work with support groups to return processes to standard when abnormal conditions occur.Manages operations in accordance with attendance.Directs team leaders, material handlers, operators, and support groups on daily task.Conducts tool box talks daily to remind employees of all categories listed on the check sheet.Follows Company produces for production identification & traceability, containment of non-conforming material, inventory movements and production reporting.SKILLS AND KNOWLEDGE:Basic Measurement and gage use skillsManufacturing and quality experienceComputer skillsBasic Math skillsTeam building skillsTroubleshooting skillsProblem solving skills using disciplined methods to identify root causes (i.e. 5 Why)BEHAVIORAL REQUIREMENTS:Has high standards of performance for self.Takes responsibility for actions, results, and mistakes.Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress.Maintains positive relationships by constructively resolving conflicts.Uses feedback from others to continuously improve performance and work relationships.Moves within own and/or other work areas (flexes) to support plant flow.Works with sense of urgency to meet needs of customers.Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities.Maintains knowledge and skills to perform job effectively.Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.Looks for good in others; works collaboratively with others; shares information and knowledge.Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.SUPERVISORY RESPONSIBLITY:This position manages all employees of the assigned zone(s) within the department and is responsible for the performance management including hiring of the employees within their assigned area. WORK ENVIRONMENT / PHYSICAL DEMANDS:This is a high pace work environment that requires a sharp sense of your surroundings. Ability to be on your feet for long periods of time, and cover a lot of ground. In the summer months it does get very hot, and you must keep yourself hydrated. You must be able to lift up to 40lbs. REQUIRED EDUCATION AND EXPERIENCE:Minimum education: HS diploma or GEDThree to five years related experience in a supervisor position; or equivalent combination of education and experience.An Associate's or Bachelor's Degree is preferredOther Duties:Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}