{"jobID": "2738785776", "jobLocation": "Newark_NJ", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.horizonblue.com", "Headquarters": "Newark, NJ", "Size": "1001 to 5000 employees", "Founded": " 1932", "Type": " Nonprofit Organization", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " UnitedHealth Group, Cigna, Aetna"}, "estimatedSalary": "62000", "jobDescription": "Job Summary: This position will partner with auditors on the Compliance Audit team to create and maintain analytics to support the successful completion of audits; and promote the use of analytics where analytics can be leveraged to drive effectiveness and efficiency in audit planning, scoping, and testing. This position may also partner with other members of the Compliance team to create and maintain analytics to aid in the ongoing monitoring of business managements compliance with Federal and State laws and regulations.  Responsibilities:Collaborate with audit team members, Data Analytics, and business partners to gather requirements in support of analytics creation, prepares supporting audit documentation, and assists with business rules development.Assist with defining processes to incorporate data and analytics into the Compliance Audit process, including continuous risk assessment, periodic sampling and data-driven root cause analysis.Assist with the establishment of standard analytics definitions and documentation standards that are supported by clear data definitions and clear traceability to data sources.Analyze data results from multiple information sources to ensure reporting and analytic requirements have been met. In addition, provide clear, concise, and efficient summary analysis to audit team members.Build reusable analytics tools, templates and request forms; creates documentation for data governance and data sources such as data dictionaries; ensures data quality and validity checks.Employ appropriate analytics techniques to ensure data and result integrity. Perform formal quality reviews of data based on established guidelines.Partner with other members of the Compliance team to create and maintain analytics to aid in the ongoing monitoring of business managements compliance with Federal and State laws and regulations.Document all work in a clear and concise manner so that repeatable analytics can be performed again in the future. Remain abreast of the latest data analytics software tools, reports and conducts analysis most efficiently.May be asked to complete two to three audits from the annual Compliance Audit Plan.Collaborate with business unit personnel on the identification of effective data analytics techniques for ongoing monitoring of business unit processes and controls.Knowledge:Knowledge of and experience with various data analytics tools (i.e. Excel and Access). Experience with SAS and Tableau preferred.Ability to design and develop analytics to deliver meaningful insights (i.e. trends, patterns, root causes, etc.) to support compliance audits.Prefers knowledge of the Federal and State regulatory environment in the health insurance industry.Prefers knowledge and understanding of compliance auditing or internal auditing techniques.Organization and management of multiple priorities.Proficient in various data analytics tools and techniques.Data analysis in terms of identifying trends, patterns, and root causes.Proficient in various Microsoft software products.Written and verbal communication skills.Attention to detail.Listening skills.Education/Experience:Requires a Bachelor’s degree, preferably in a Quantitative field such as Analytics, Economics, Mathematics, Computer Science, Accounting, or Engineering.Requires a minimum of five years of data analytics experience (health care environment highly preferred).Prefers a minimum of 3 years of compliance experience in a health care environment.Prefers a minimum of 3 years of experience in compliance auditing or internal auditing. Horizon Blue Cross Blue Shield of New Jersey is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, protected veteran status or status as an individual with a disability and any other protected class as required by federal, state or local law."}