{"jobID": "2806309784", "jobLocation": "Lewisville_TX", "jobTitle": "Business Data Analyst (Fulfillment Operations)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Teladoc is hiring a Business Analyst to work out of our Operations department. In this exciting role, you will complete data gathering and recovery, trending and process analysis within a functional area as assigned and across multiple business functions with regard to touch points and shared member and client servicing responsibilities. You will also complete in-depth process mapping, time studies, and analysis of operational, member/provider and systems data to assess and forecast effectiveness of service delivery. Another part of your responsibilities will entail monitoring work queues and projects across multiple business functions to ensure quality, service and adherence to company policies and procedures. WHAT YOU WILL BE DOINGProvides project and data analysis leadership for process improvement projects across multi-functional and business segments.Collects, reviews, evaluates data against process, procedures and standards to analyze effectiveness and improvement opportunity.Monitors, audits and reports on analytics related to all direct mailConducts extensive review of project and work tickets across business functions to determine quality and timeliness of actions. .Partners with management, other business functions, and Operations to share process and performance data analysis drawn from phone, work ticket monitoring, systems for review, and to identify process improvement opportunity, training needs and management oversight.Manages productivity to ensure completion of required assignments within given timelines.Participates, as needed, in calibration sessions, meetings and communication sessions and/or creates communication tools.Maintains centralized policy and procedures and documentation including process flows for the function. Controls, monitors, and facilitates documentation of new of changes to policies and procedures within and across functional areas.Establishes and maintains effective cross-functional business partnerships across all levels of the department and organization.Initiates constructive feedback with employees and management on findings.WHAT YOU MUST HAVEBachelor's Degree with a minimum of two years of experience in operation data gathering or an associate's degree (or equivalent) with minimum 5 years operations experience.3-5 years advanced training and/or experience with advanced Excel and/or other data analysis and reporting software.Ability to create and sustain a track record of seeing the big picture, taking initiative and implementing solutions to meet established goals.Basic understanding of print productionKnowledge and skills in data gathering, trend analysis, and statistical process control.Ability to prepare extensive statistical reports.SDL2017"}