{"jobID": "2824404010", "jobLocation": "Santa_Clara_CA", "jobTitle": "Machine Learning Scientist - News", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Machine Learning Scientist - News Job Number: 113997915Santa Clara Valley, California, United StatesPosted: Jun. 22, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The News team at Apple is looking for smart, creative scientists and algorithm design experts to build a new generation of applications. You will contribute to applications and services including News on iOS that transform data into elegant products that delight, connect, and inspire users every day.Key Qualifications Strong software development practicesStrong Java experienceStrong background in Algorithms and Machine LearningStrong background in Deep Learning, Information Retrieval, or NLPExperience with Scala or Clojure is a plusExperience with Weka or scikit-learn is a plusExperience with text-related tasks such as named entity labeling, topic classification, clustering, and indexingExperience processing large-scale data sets using Mesos, Spark, or Hadoop DescriptionWe're looking for smart and original engineers and scientists with a deep background in computer science, especially machine learning, information retrieval, and scalable distributed computing. Your passion for leading edge technologies will be critical to your project and a key component to our team of world class engineers and designers who are driven to create the next big thing.  Join us to enhance the lives of millions of users. You will:  Design and implement production algorithms that process text and other data, and make the impossible possible  Prototype ideas and fail quickly  Communicate advances and ideas to a focused team  Develop innovative tools and metrics that change the way we look at problems  Join a thriving Machine Learning community at Apple ( https://machinelearning.apple.com)EducationPh.D. in computer science, mathematics, or related discipline."}