{"jobID": "2733640824", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.avaloncommunities.com", "Headquarters": "Arlington, VA", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Public (AVB) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Equity Residential, UDR, Essex Property Trust"}, "estimatedSalary": "92000", "jobDescription": " Job Details  Data Scientist  Apply NowPosition Type: Full Time Job Type: Exempt State::VA City:Arlington Brand:Corporate  OverviewAvalonBay is proud to be named one of Glassdoor's Best Places to Work in 2018.  AvalonBay Communities, Inc. is one of the nation's leading Real Estate Investment Trusts (REIT's), in the business of developing, redeveloping, acquiring and managing quality apartment communities in high barrier-to-entry markets of the United States. These markets are located in the Northeast, Mid-Atlantic, Southeast, Pacific Northwest and Northern and Southern California regions of the country. We currently own and operate approximately 80,000 apartment homes in the US and employ approximately 3,000 associates. We are looking for aData Scientist to join our Data Analytics team in Arlington, VA.ResponsibilitiesAt AvalonBay we are building the industry’s most advanced data science capability. Join a green-field opportunity to apply machine learning and statistical analysis to challenges in Revenue Management, Marketing, Operations, Customer Service and Investment for one of the largest REITs in the country. The Data Analytics role involves: Applying machine learning and statistical modeling to large datasets to develop business insightLead implementation of business solutions based on modeling and machine learning resultsWork with senior management and business analysts to identify strategic opportunities for data analytics impactWork with data engineering and IT to productionize machine learning solutionsCreate compelling data visualizations to support conclusions and provide recommendationsCommunicate recommendations effectively to senior managementQualificationsThis is a great opportunity for someone at the start of their Data Analytics career interested in expanding their skills and learning from the best in the industry.  Requirements: A master’s degree or Ph.D. from a statistics, mathematics, computer science, computational social science or operations research program.Solid background in the fundamentals of machine learning and statistical modelingExperience conducting analysis and writing analytic code in R or Python or similar analysis and modeling tools. Experience merging and analyzing large, diverse data sources. AWS/Hadoop/Hive/Pig and Spark a plus.Proficient with SQL and comfortable in a Unix/Linux environment.Experience in building production-level machine learning and predictive analytics models along with data pipelines.Experience creating data visualizations in Power BI, Tableau, D3 or similar.The ability to explain complex technical material to nontechnical audiencesAvalonBay conducts drug and background screening for all hires. Qualified applicants will be considered for employment consistent with the Los Angeles Fair Chance Ordinance and other applicable state and federal laws.AvalonBay is an Equal Opportunity Employer.#GD17Job ID 20065"}