{"jobID": "2804454757", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist, IdentityAI", "companyRating": "4.8", "companyInfo": {"Website": "www.sailpoint.com", "Headquarters": "Austin, TX", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (SAIL) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Oracle, IBM, One World Identity"}, "estimatedSalary": "133000", "jobDescription": " At SailPoint, we do things differently. We understand that a fun-loving work environment can be highly motivating and productive. When smart people work on intriguing problems, and they enjoy coming to work each day, they accomplish great things together. With that philosophy, we’ve assembled the best identity team in the world that is passionate about the power of identity.  As the fastest-growing, independent identity and access management (IAM) provider, SailPoint helps hundreds of global organizations securely and effectively deliver and manage user access from any device to data and applications residing in the data center, on mobile devices, and in the cloud. The company’s innovative product portfolio offers customers an integrated set of core services including identity governance, provisioning, and access management delivered on-premises or from the cloud (IAM-as-a-service).  SailPoint is looking for a Data Scientist that will lead the development of machine learning models that will be used within a brand-new product. This role will be critical in shaping the voice of this product and will provide candidates with the freedom to dig into different model options such as predictive analysis, clustering/topic modelling, classification and recommendations.  As one of the first members on the team, you will be integral in building this product and will be part of an agile team that is in startup mode. This is a unique opportunity to build something from scratch but have the backing of an organization that has the muscle to take it to market quickly, with a very satisfied customer base.  Voted a “Best Places to Work” – 9 Years in a Row. ResponsibilitiesPerform necessary data preparation and data-integrity-check tasks, including data cleansing, data imputation, feature selection, dimension reductionTraining, testing, and evaluation of machine learning models as part of deployment to production environmentDevelop appropriate metrics for continuous performance monitoring of machine learning models in productionTriage model-related issues in production, and perform root cause analysis of Data Science-related bug reportsDeploy customer-specific model implementations, including fine-tuning of model's hyper-parametersPerform ad-hoc analyses, communicate results to team and managementRequirements2+ years Data Science experienceUnderstanding of machine learning techniques and algorithms for clustering, classification, regression, anomaly detection, recommendationGood applied statistics knowledge, e.g. statistical inference, hypothesis testing, sampling, goodness of fit, mixture models, etc.Experience with common data science tools, e.g. R, PythonExperience with data warehouse querying tools such as MySQL, HiveExperience with cloud computing tools on AWS, Linux-based EC2, EMR instancesFollow software engineering best-practices, e.g. clear coding style, version control, etc.Great communication skillsBS in Computer Science, Statistics, Applied Mathematics, or a related fieldPreferredExperience with Scala/JavaExperience with large-scale, distributed tools such as H2O, Spark's MLlib, Python's Dask, CeleryExperience with data visualization tools, such as ggplot2, bokeh, plotly, D3jsExperience with rapid prototyping frameworks such as Shiny, FlaskExperience with Big Data technologies such as Spark, Hadoop, MapReduce, HDFS, EMR, Kinesis, or RedshiftExperience with NoSQL databases, such as HBase, Cassandra, Elasticsearch, or DynamoDBMS in Computer Science, Statistics, Applied Mathematics, or a related fieldCompensation and BenefitsExperience a Small-company Atmosphere with Big-company BenefitsCompetitive pay, 401(k) and comprehensive medical, dental and vision plansRecharge your batteries with a flexible vacation policy and paid holidaysGrow with us with both technical and career growth opportunitiesEnjoy a healthy work-life balance with flexible hours, family-friendly company events and charitable work All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status."}