{"jobID": "2799399063", "jobLocation": "Glendale_CA", "jobTitle": "Learning Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.ageoflearning.com", "Headquarters": "Glendale, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Disney Interactive Studios, Top Hat, Flocabulary"}, "estimatedSalary": "94000", "jobDescription": "Company Overview Age of Learning is a leading education technology innovator and producer of the multi-award-winning ABCmouse.com® Early Learning Academy, which serves millions of children. Based in Los Angeles, the company blends education best practices, innovative technology, and insightful creativity to bring learning to life for children around the world.  Age of Learning's content provides young learners, their families, and teachers with a comprehensive curriculum that includes thousands of highly engaging and effective learning activities designed to build a strong foundation for academic success.  The company's Education Access Initiatives reach millions of children by offering the full award-winning ABCmouse curriculum at no cost to teachers and community institutions such as libraries, Head Start programs, and community centers—including public housing authorities and after-school programs. Summary The Learning Scientist will be part of the Learning and Data Science team that implements applied research, learning analytics, and data mining methods to promote learner outcomes and system effectiveness.  The role reports to the Director of Learning and Data Science and will involve: Leading formative research studies to inform product design and implementationApplication of learning science theories to learning analytics and data mining effortsResponsibilitiesInitiate, design, and lead all aspects of formative design research studies in different learning settings (at schools, at home, via a tutoring platform, using existing user data, etc.) to guide product improvement and best-practice implementationSupport the team in conducting research-aligned learning analytics, psychometrics, and educational data mining to deliver insights for iterative design and implementationAct as an expert resource in learning sciences to support summative efficacy research efforts and marketing/sales campaignsParticipate in the formulation of a defensible set of frameworks, research syntheses, design principles, and white papers addressing aspects of the learning sciences and their application to digital learning productsRequired QualificationsMaster's Degree or higher with a focus on learning science, cognitive science, educational psychology, developmental psychology, learning analytics, educational technology, instructional systems design, or a related discipline2+ years of post-graduate research experience leading learning science research in technology, software, or digital learning productsFluency in learning theories, design-based research, formative evaluation methods, and validation techniquesKnowledge of experimental design and experience with implementing educational research studiesStrong understanding of how learning science literature affects learning architecture, learner experience design, and learner outcomesStrong quantitative research methods and analytical skills, preferably with experience with student data (e.g. using statistical methods for the social sciences, learning analytics, psychometrics, or related disciplines)Expertise in applying research and analytics findings to inform design of learning technologiesAbility to work in a collaborative, diverse, entrepreneurial environmentStrong collaboration and communication skills within a cross-functional team (e.g. learning designers, researchers, data scientists, and engineers)A record of research publications in peer-reviewed journals and presentations at professional conferencesPreferred QualificationsPhD with a focus on learning science, cognitive science, educational psychology, developmental psychology, learning analytics, educational technology, instructional systems design, or a related disciplineProficiency in R or Python (or analysis-related programming languages)Experience applying data science methods to large data sets, preferably in an educational context"}