{"jobID": "2828292528", "jobLocation": "Victoria_TX", "jobTitle": "Staff Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.golder.com", "Headquarters": "Mississauga, Canada", "Size": "5001 to 10000 employees", "Founded": " 1960", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " CH2M, Stantec, AMEC"}, "estimatedSalary": "48000", "jobDescription": " Golder Associates is a respected, employee-owned, global company providing consulting, design, and construction services in our specialist areas of earth, environment, and energy to various client sectors including Oil and Gas, Mining, Manufacturing, Power, Transportation, and more. From 180 offices worldwide, our more than 8,000 employees work with clients to manage their environmental and engineering activities in a technically sound, economically viable, and socially responsible manner.  The position will entail working with upper-level managers to complete engaging projects. Duties will include managing office- and field-based tasks, performing investigations and preparing technical reports. Specific duties may include:  Operating safely in the field (performing work safely is our highest priority); Performing field-based tasks such as multi-media sampling; soil boring and monitoring well installations; lithologic logging; and aquifer testing; Collecting and managing field and analytical data from investigations. Interpreting hydrogeological information and developing conceptual site models (CSMs) for assessment and remediation projects; Writing technical reports; Coordinating with contractors (e.g., drillers and analytical laboratories) to support project-specific objectives; and Communicating with Project Managers, team members and clients. Qualifications: BS/MS in Geology, Environmental Science, or a related field. Experience with implementation of assessment, investigation, remediation and monitoring tasks related to environmental projects preferred. Ability to perform field-based tasks. Availability for overnight travel. Strong technical and communication skills. OSHA 40-Hour HAZWOPER training is a plus. Required education: Bachelor's Our staff benefit from: An option to purchase shares in Golder Associates Career and personal development opportunities and support of personal growth Employee mentoring program Competitive benefits and remuneration packages Golder Associates Inc. is a drug free employer and undertakes drug and alcohol testing as allowed by law and pursuant to its Drug Free Workplace Policy. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability or protected veteran status. "}