{"jobID": "2827436194", "jobLocation": "San_Francisco_CA", "jobTitle": "Product Data Analyst - Uber Freight", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " As a Data Analyst within Uber Freights Engineering team, you help build the justification and reasoning for our product strategy decisions. Working alongside application and mobile engineers, user and workflow events are collected, analyzed, and presented in order for product and engineering managers to make data-informed (not -driven) decisions. You will contribute to the design of experiments that help arrive at conclusions, even in environments where there is limited data. A strong scientific-mindset is required, alongside technical, statistical and analytical skills to develop and test hypotheses. As a Data Analyst within Uber Freights Engineering team, you help build the justification and reasoning for our product strategy decisions. Working alongside application and mobile engineers, user and workflow events are collected, analyzed, and presented in order for product and engineering managers to make data-informed (not -driven) decisions. You will contribute to the design of experiments that help arrive at conclusions, even in environments where there is limited data. A strong scientific-mindset is required, alongside technical, statistical and analytical skills to develop and test hypotheses. What you'll do;Leverage data to perform intensive analysis across all areas of our business to drive product developmentIdentify key levers for growth & efficiency and work closely with product to transform hypothesis into product featuresDesign experiments and interpret the results to draw detailed and actionable conclusionsGenerate ideas for exploratory analysis to shape future projects and provide recommendations for actions to Product TeamsCreate dashboards and reports to regularly communicate results.Define and monitor key product metricsPresent findings to senior management to drive product decisionsCollaborate with cross-functional teams across disciplines such as product, engineering, operations, and marketing What you'll need;Bachelor's or higher degree in a technical field - engineering, economics, statistics or similar.3+ year of relevant experienceProficiency with SQL, and experience or familiarity with one additional scripting language.Strong background in, or comfort with, statistical concepts.Ability to facilitate experimentation and conduct experiment analysis.Laser-focused on the details, while keeping strategic priorities top-of-mindResponsible and reliable to the people you work with - this is a team effort!Growth mindset. You seek out learning opportunities for yourself and the team.Project management savvy. You demand the best from your peers to get joint projects done well.Responsiveness. You deliver timely, digestible answers to complex asks.Consistently think of ways to improve our products and the business."}