{"jobID": "2827043346", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.level-ex.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Analyst Located in Chicagos River North area, Level Exs fast-growing game studio is transforming the way surgeons hone their skills by practicing high-risk surgeries with the latest medical devices in our industry-leading mobile, AR, and VR titles. Our games are built using state-of-the-art graphics and physics tech, and deploy an arsenal of well-designed game mechanics to capture the thrill and challenge of performing real surgery. These games increase dramatically in difficulty as the player progresses, and are carefully crafted with professional level design, compulsion loops, flow channels, and deliberate gameplay balance. Backed by a mature art pipeline and latest-gen engine tech, were able to recreate surgery with spectacular realism. Our team unites award-winning game designers, developers, and artists with industry-leading surgeons, all passionate about using game design approaches to keep doctors across the world performing at the top of their game. Were looking for a smart, technical Data Analyst to join our team.What Youll Be Doing with Us Reporting into the Product Department helping to continually define the voice of the customer and business performance through data and analysis Responsible for data validity and availability across 4 live mobile titles, client projects, and future applications Delivery of cadenced reporting and analysis to clients on client content KPIs Administering our current analytics pipeline of Snowflake, PlayFab, LeanPlum, and AppsFlyer Writing SQL queries for analysis as well as minor ETL details (views, table updates, etc.) Writing new telemetry details to add or change existing event data Documentation of pipeline details, potential back end and front end changes, changes to telemetry, and syndicate these updates to the correct stakeholders Authoring JIRA/development job tickets and work with production/project management team to accurately dictate priority among the other asks of development time and effort Requirements gathering from multiple stakeholders across the company to ensure we are building the required event telemetry in our updates Working with Quality Assurance to ensure telemetry is correct prior to pushing to live environmentWho We Want To Meet 2+ years of analytics design and reporting for a startup, gaming company, and/or mobile app company Experience translating business requirements into new event telemetry Proven ability to grow at the pace of the company, while advocating for a strategic plan for the future Proven ability to project manage multiple needs/priorities from multiple stakeholders B.S. or M.S. in Computer Science, Analytics, Business Administration, or equivalent combination of education and experience Excellent verbal and written communication skillsBonus Points Awarded For Experience with Snowflake Experience with LeanPlum/AppsFlyer/PlayFab Experience with Jira and/or Confluence Experience with mobile telemetry concerns Experience building a 1st party telemetry pipeline using Amazon (or similar) products, relational databases, and visualization softwaresHow We Make You Happy Creating games that genuinely make a difference in peoples lives Competitive salary Paid vacation, sick days, and holidays Medical, dental and vision benefits 401k plan with matching, flex spending account, and commuter benefits Unlimited cold brew coffee, beer, and tasty snacks Flexible, reasonable work schedules in a team-focused environmentInterested? Send us your resume and a cover letter detailing why youre a fit to join our growing company to careers@level-ex.com. We look forward to hearing from you and exploring the possibilities.Candidates must be authorized to work and accept new employment in the U.S.No Agencies/Recruiters please"}