{"jobID": "2835275161", "jobLocation": "Edison_NJ", "jobTitle": "Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.thedenzelgroup.com", "Headquarters": "Allentown, PA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This is a hands on technical position requiring analytical, communication and data analysis skills. This position requires the documentation of data and visualization requirements. He/She will be required to understand and document business requirements, lead discussions with the business to obtain agreements on requirements, analyze data and if necessary validate /QA the requirements on the delivered solution.  Specific duties include but are not limited to:  Analysis of business requirements and defining functional specifications for the solution in the form of a Business Requirements and Specification document.  Document wireframes for data visualizations.  Document requirements in a clear, concise manner  Conduct requirements review sessions with business and IT development teams.  Use of SQL for data analysis and validating data.  Provide support to QA and UAT teams during testing of solutions, to ensure requirements are met.  Report progress and issues to Project Leader/Manager on a regular basis and ensure project schedules are met. QualificationsEducation and Experience: Bachelor’s degree or higher in Computer Science desired.  5+ years of relevant business analysis experience, working directly with end users.  3+ years of working with business intelligence tools, with at least 1+ year on Tableau.  2+ years of relevant experience working on Data analysis projects.  2+ years of relevant experience working with SQL for data analysis.  KW: Tableau, business intelligence, business analyst, data analyst, bi analyst, sql- provided by Dice  KW: Tableau, business intelligence, business analyst, data analyst, bi analyst, sql"}