{"jobID": "2833603338", "jobLocation": "Hamilton_NJ", "jobTitle": "Senior Scientist / Associate Research Scientist - ELISA HPLC ( SEC , IEX , Affinity ) cIEF", "companyRating": "3.3", "companyInfo": {"Website": "www.ppdi.com", "Headquarters": "Wilmington, NC", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "EXPECT MORE FROM YOUR CAREEREXPECT PPD PPD is a leading global contract research organization. At PPD we are passionate, deliberate, and driven by our purpose - to improve health.  PPD Laboratories offers the most comprehensive set of laboratory services available in the industry and continues to deliver innovative solutions to our clients through our collaborative approach, including PPD® Laboratories FSP. PPD® Laboratories FSP is a unique partnership that allows our clients to leverage the experience of our PPD staff, while allowing you, the employee, to gain direct experience working onsite at a pharmaceutical/ biopharmaceutical company, all while maintaining full-time benefits/advantages of being a part of PPD.  This position is on a client site that supports the process development of monoclonal antibody therapeutics and develops/validates the methods used for in-process/release/stress testing. As part of this overall goal, you would be required to perform routine and non-routine testing and assist in the pre-validation and validation experiments and creation and execution of experimental plan to support the method validation in a GMP environment. In addition, generating, documenting, and analyzing data for discussions and reports (e.g., method validation reports, technical reports) would be required. Responsibilities would include:Perform routine and non-routine testing to support the process development of monoclonal antibody therapeutics•Develop, validate, and transfer physicochemical methods•Test samples (in-process samples, drug substances, drug products) using spectroscopy, HPLC and UPLC (SEC , RP , IEX etc), capillary electrophoresis, ELISA, and qPCR•Train junior scientists and maintain and troubleshoot laboratory instruments•Keep real-time experiment records in ELN and prepare SOPs and reports•Contribute to departmental activities such as safety inspections and internal auditsEducation and Experience:Bachelor's degree or equivalent and relevant formal academic / vocational qualification Previous experience that provides the knowledge, skills, and abilities to perform the job (comparable 6 year) or equivalent combination of education, training,&experience.; ORMasters degree and previous experience that provides the knowledge, skills, and abilities to perform the job (comparable 4 year) OR PhD and previous experience that provides the knowledge, skills, and abilities to perform the job (comparable 2 year) Knowledge, Skills and Abilities:Hands-on experience in HPLC/UPLC (e.g. SEC, SEC-MALS, CEX, HILIC, affinity chromatography) SDS-PAGE, capillary electrophoresis (e.g., CE-SDS, cIEF), spectroscopy (UV/VIS), residual impurity analysis (e.g., ELISA, qPCR), cell based potency assay, and/or ELISA binding assayA clear understanding of method development and validation requirements per international regulatory guidelines for GMPAt least one year of cGMP experience in an industry setting is required.A thorough understanding of protein structure, chemistry, and stability attributesAn understanding of fundamental biopharmaceutical principles for the development of biologic drug candidatesBasic understanding of statistical data analysisAn ability to effectively and collaboratively participate in team discussions (e.g., communication of test results, OOT results, scientific principles)An ability to prepare clearly written documents (e.g., SOPs, technical reports, method validation reports)Excellent verbal and written communication skills.An ability to work independently with little supervision and be flexible with changing project timeline to support the process developmentExperience in the analysis of monoclonal antibody or the late stage biologics support is desirableFamiliarity with CMC is desirableAbility to independently perform root cause analysis for method investigationsProficiency on technical operating systemsProven problem solving and troubleshooting abilitiesProven ability in technical writing skillsTime management and project management skillsAbility to work in a collaborative work environment with a teamAbility to train junior staff Working Conditions Work is performed in a laboratory and/or a clinical environment with exposure to electrical office equipment.Occasional drives to site locations, occasional domestic travel.Exposure to biological fluids with potential exposure to infectious organisms.Rare exposure to skin and lung irritants, radiation, toxic materials and hazardous waste.Personal protective equipment required such as protective eyewear, garments and gloves.Exposure to fluctuating and/or extreme temperatures on rare occasions. Physical Requirements Ability to work in an upright and /or stationary position for 6-8 hours per day.Repetitive hand movement of both hands with the ability to make fast, simple, repeated movements of the fingers, hands, and wrists to operate lab equipment.Occasional mobility needed.Occasional crouching, stooping, with frequent bending and twisting of upper body and neck.Light to moderate lifting and carrying (or otherwise moves) objects including luggage and laptop computer with a maximum lift of 15-20 lbs.Ability to access and use a variety of computer software developed both in-house and off-the-shelf.Ability to communicate information and ideas so others will understand; with the ability to listen to and understand information and ideas presented through spoken words and sentences.Frequently interacts with others to obtain or relate information to diverse groups.Works independently with little guidance or reliance on oral or written instructions and plans work schedules to meet goals. Requires multiple periods of intense concentration.Performs a wide range of variable tasks as dictated by variable demands and changing conditions with little predictability as to the occurrence. Ability to perform under stress. Ability to multi-task.Regular and consistent attendance. PPD is an affirmative action employer that values diversity as a strength and fosters an environment of mutual respect. PPD provides equal employment opportunities without regard to age, race, color, pregnancy, national origin, religion, sex, gender identity, sexual orientation, disability, veteran status or other status within any other protected group."}