{"jobID": "2823451583", "jobLocation": "Washington_DC", "jobTitle": "IT Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.grantthornton.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1924", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Deloitte, KPMG"}, "estimatedSalary": "78000", "jobDescription": " Grant Thornton is seeking an Associate to join its Technology Strategy & Management service line and take an active role in engagement execution, project management and key business development activities.  Grant Thornton Public Sector helps executives and managers at all levels of government maximize their performance and efficiency in the face of ever tightening budgets and increased demand for services. We give clients creative, cost-effective solutions that enhance their acquisition, financial, human capital, information technology, data analytics, and performance management. For more information, visit grantthornton.com/publicsector.  At Grant Thornton, our professional staff applies traditional, cutting-edge approaches and methods to a variety of analyses. As part of our team, the Associate will utilize various methodologies and models to execute client projects. ESSENTIAL DUTIES:Review the existing data provided and identify current business architecture data, stakeholders, workflows, and systems and applications architecture data.Perform business requirements analysis, data analysis (capabilities, systems, and applications, data) and document data gaps.Organize and document the current state data, and identify any data not available.Conduct a series of interviews with Business and IT stakeholders/SMEs to verify, validate and collect the additional data.Document the data model using spreadsheets, tables, or visio workflow diagrams as required.Build visualization models of all the data collected including interpretation of the models using Tableau or PowerBI.Work with PM to consolidate the results of the analysis, data model, and visualizations into an EA Analysis Report that will be presented to the EA and business program offices’ management.Work with PM and project team to:Conduct Agile Sprint planning for the data analytics and modeling project.Develop the initial set of epics and user stories necessary for data analytics and modeling work to begin.Collaborate and communicate with all business and IT stakeholders/SMEs when documenting, analyzing and visualizing the current state data.Provide standard guidance for common terminology and, data dictionary with a glossary of terms for the key data.Meet or exceed targeted billing hours (utilization).Assist with business development activities, such as proposals, capture, account teams, whitepapers, conferences, and/or other thought leadership materials.Experience with Business, systems and data analysis, and being a facilitator.Working knowledge and experience analysis and modeling using the data analytics tools (Tableau and/or PowerBI tools). Agile Scrum (basic knowledge/ working experience)Experience with preparing well written communications for various stakeholders.IT Applications, systems, infrastructure and technologies (basic knowledge). Strong analytical and problem-solving & Communication Skills. Teamwork, collaboration. Adaptability skills.Critical thinking and observation skills.Bachelor’s Degree required from an accredited college or university in a related field.Ability to obtain and maintain certain job-related certifications if no job-related advanced degrees.U.S. citizenship may be required. Ability to work in the United States indefinitely required.Travel may be required.Ability to work overtime required on occasion.Ability to sit in an office environment for long periods of time.Ability to obtain and maintain a security clearance.Ability to communicate clearly in writing and verbally.Ability to obtain and maintain firm independence and abide by firm ethics requirements.Meet or exceed continuing professional education (CPE) requirements. Grant Thornton LLP is the U.S. member firm of Grant Thornton International, one of the six global accounting, tax and business advisory organizations. Grant Thornton’s Public Sector, based in Alexandria, VA, is a global management consulting business with the mission of providing responsive and innovative financial, performance management and systems solutions to governments and international organizations. Visit Grant Thornton’s Public Sector at www.grantthornton.com/publicsector.  It is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law. "}