{"jobID": "2782546773", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "1.9", "companyInfo": {"Website": "www.chicagointl.org", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " 1997", "Type": " School / School District", "Industry": " Education", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "WHO WE WANTThe ideal Data Analyst believes that data help us make better decisions and knows how to make meaning of data so that our network makes the best decisions possible. We want someone who:Can navigate large, complex data sets and analyze them effectively and efficiently.Translates analyzed data into a compelling and coherent story that can be acted upon.Partners with others to deeply understand anothers context and needs so that analyses are useful. If this sounds like you, continue reading to learn more about this role and our organization.WHAT YOU'LL DOThe Data Analyst supports the School & Student Success team in developing, rolling out, monitoring and improving data systems and tools for staff at all levels, from the central team to school staff. The Data Analyst also provides critical analysis and thought partnership with organizational, operator and school leadership to understand, interpret and use data to drive performance improvements. Together with the School & Student Success team, the Data Analyst will play an important role in developing and promoting a more data-driven culture across CICS. Specific responsibilities include:Reporting, Analysis and Data AdvisoryIdentifies, analyzes, and interprets trends or patterns in complex data setsInterprets data, analyzes results using statistical techniques and provide ongoing reportsConducts analysis and develops regular school, operator and organizational performance reportsDevelops customized data reports for schools, operators and central teamSupports senior leadership in setting and adjusting benchmarks for school, operator and organizational report cardsProvides capacity-building support to school, operator and central staff on the use of data tools and applicationsWHAT YOU BRINGBachelor's degree, preferably in analytics, math, data management or computer science contentStatistics/data analysis experience preferredStrong Microsoft Excel skillsExperience with school data and SIS applications such as PowerSchool, Schoolzilla and Tableau preferredEntry-level analyst role Skills & CompetenciesCommitment - You are passionate about the boundless potential of our students and working to provide high quality education options for all; your decisions are consistently made through the lens of what is best for studentsService orientation - You are committed to providing high levels of service to various internal and external stakeholdersTechnical expertise You have a strong familiarity with analytical skills, working with data sets, and managing/developing data systemsCultivating relationships and partnerships - You have a proven record of collaborating with team members and partners, as well as school leaders and school staff, to achieve ambitious goals; you quickly build trusting relationships and understand personal motivations; you value differing opinions and seek out dissenting perspectives to strengthen solutionsExcellent communication skills - You can translate complex content to key decision-makers and stakeholders, adapting framing and messaging based upon the audienceSuccessful in a fast-moving entrepreneurial environment - You thrive in a dynamic, fast-paced environment, able to strategically prioritize time and competing initiatives, focusing on those that will have the greatest impact on students; you achieve outcomes even in the face of obstacles and pressureConstant learner - You crave feedback and identify what you need to excel, striving to constantly improve upon the status quoWHO WE AREThe mission of the Chicago International Charter School (CICS) is to be a vibrant network of unique Chicago charter schools that prepares students to thrive in college and life and empowers educators to innovate and lead. We strive to be a hub of excellence and innovation in Chicago education where every student flourishes, every school meets the unique needs of its students and community, and every success catalyzes citywide improvement.CICS is entering an exciting time, embarking on the implementation of a new strategic plan. Joining our organization at this critical point in our history represents an exciting opportunity to be a part of shaping the new direction of the network. Our plan is to develop CICS into a consistently high-performing network of academically rigorous, pedagogically diverse, forward-thinking schools that prepare every student for success in college or career and the Data Analyst plays a critical role in meeting that ambitious plan.OUR VALUESOur values keep us honest and help us determine the best course of action to meet our mission and vision.We are determined optimists. We believe quality of our schools must match the boundless potential of our students. We are uncompromising on quality and equity, fueled by the urgency to improve, and grounded in the belief that anything is possible if we keep striving.We are driven to make the world better for students. Our core purpose is to improve our world through education. All decisions are made through the lens of what is best for students. We have the courage to make tough calls that benefit students in the long term and a deep commitment to our work.We nurture new ideas. We give brave approaches the space to take root and the support to flourish. We are driven by data, embrace constant iteration, and have the curiosity to learn alongside our students so we can constantly improve.We get stuff done. We believe in hard work and humility. We're focused on delivering results and we always maintain high expectations - for our students and for ourselves.We are powered by people and partnership. We value our partners and our relationships. We maintain trust through transparency, direct communication, and integrity. We work together with compassion and without ego because we know the best solutions are forged collectively.We prioritize diversity and authenticity. Diversity and authenticity are non-negotiable in education. We bring our whole selves to work and school, tackle questions of race and equity, listen, and tap into the power of our differences individually and as a network.WHAT WE OFFERAs CICS embarks on implementing its new strategic plan, it is an exciting time to join our organization. We offer a competitive compensation package, including: salary commensurate with experience; paid-time off; a benefits package including medical, dental, and vision insurance; a flexible spending account option; commuter benefits; disability as well as life insurance. In addition, youll have the opportunity to work alongside dedicated colleagues committed to providing high-quality, innovative educational options for families across Chicago. KEY RELATIONSHIPSReports to: Chief, School & Student Success Member of the School & Student Success teamInteracts with the CICS central team, school operators, school leaders and school instructional staffChicago International Charter School provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws."}