{"jobID": "2657216287", "jobLocation": "Redwood_City_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.anchorfree.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "Senior Data Analyst As a Senior Data Analyst you would be working with lot of data and get deep understanding of processes in our products and infrastructure. It will allow you to play bigger part in decision making about directions for our company activity - basically get some responsibilities of project manager.  Our infrastructure is full of tools for advanced(comparing with SQL) data exploration and model creating. Spark MLlib, Spark GraphX, Spark Dataframes, Zeppelin - all these tools supported and, if you feel strength in you to investigate deeply - you are welcome! You would get valuable experience in machine learning and statistical models. Responsibilities:Build regular reports, based on KPI descriptions.Assist project managers with looking on data from different angles.Interact with multiple teams to better understand structure and source of data.Analyze product metrics that affect AnchorFrees subscription revenues, such as upgrade triggers, payment flows and methods/APIs, pricing, landing pages and e-mail systemsRequirements:4+ years of successful experience as data analystProficiency in SQL. Good with statistics.Strong analytical and problem solving skills.Plus skills:Experience with TableauExperience with revenue analysis.Experience with big data tools: Hive, Impala, Spark.Experience in SaaS (Software-as-a-Service) products, Freemium or trial-to-pay model, pricing and checkout funnel optimizationTrack record of driving revenues from apps with millions of usersEntrepreneurial and result-oriented mindset. Strong sense of urgency and ownership.AnchorFree Compensation and Benefits:Competitive salaryExcellent employee stock option planRelocation assistance available$125 per month electric car incentivesFree food and drinksFoosball, Gym and showers, Pool table, Table TennisFREE Medical, Dental and Vision401kEasy Access to Caltrain and Light Rail (free pass)New Laptop (mac or pc) and MonitorEmployee discounts on HP, Apple and VerizonAbout AnchorFree:  AnchorFree believes that Internet Freedom, privacy and security over personal data are fundamental human rights. AnchorFrees mission is to provide secure access to the worlds information for every person on the planet. Founded in 2005 by two serial entrepreneurs, David Gorodyansky and Eugene Malobrodsky, AnchorFree has grown into a service with 500 million Downloads and 50 million active users in 190 countries. The Company has achieved profitability and is backed by $63 million from world-class investors, including Goldman Sachs, Esther Dyson (Board of WPP), Bert Roberts (former CEO of MCI), Doug Maine (former CFO of IBM), Subrah Iyar (founder of Webex). About the Product AnchorFree are the creators of a powerful technology platform that has been transformational for millions of people around the world, enabling connectivity, privacy, and freedom. The crown jewel of our family of products, Hotspot Shield is available for users on iOS, Android, PC and Mac. 200,000 new users download Hotspot Shield every day, making it one of the top 100 most popular iOS apps in App Store and the #1 top grossing app in the Productivity category. Powered by a proprietary VPN technology, Hotspot Shield is the worlds most popular Wi-Fi security application. Hotspot Shield is the #1 enabler for users to get Snapchat, Facebook, Twitter, YouTube in places where access to these apps or sites is restricted or censored. AnchorFree is also powering partners with its proprietary VPN technology available as an SDK, enabling app developers to integrate security, privacy and Internet freedom into their apps. About the Culture AnchorFree lives, sleeps, and breathes their core mission of enabling secure access to the worlds information for every person on the planet. AnchorFree is one of the few companies that is actually changing the world by providing users with basic human rights (Internet Freedom and Privacy), while driving solid year over year growth and shareholder value. Learn more about us here: AnchorFree website: http://www.AnchorFree.com  Hotspot Shield website: http://www.HotspotShield.com  Facebook: https://www.facebook.com/HotspotShield  Twitter: https://twitter.com/HotspotShield  Blog: http://blog.hotspotshield.com AnchorFree Compensation and Benefits:Competitive salaryExcellent employee stock option planRelocation assistance available$125 per month electric car incentivesFree food and drinksFoosball, Gym and showers, Pool table, Table TennisFREE Medical, Dental and Vision401kEasy Access to Caltrain and Light Rail (free pass)New Laptop (mac or pc) and MonitorEmployee discounts on HP, Apple and VerizonAbout AnchorFree:  AnchorFree believes that Internet Freedom, privacy and security over personal data are fundamental human rights. AnchorFrees mission is to provide secure access to the worlds information for every person on the planet. Founded in 2005 by two serial entrepreneurs, David Gorodyansky and Eugene Malobrodsky, AnchorFree has grown into a service with 500 million Downloads and 50 million active users in 190 countries. The Company has achieved profitability and is backed by $63 million from world-class investors, including Goldman Sachs, Esther Dyson (Board of WPP), Bert Roberts (former CEO of MCI), Doug Maine (former CFO of IBM), Subrah Iyar (founder of Webex). About the Product AnchorFree are the creators of a powerful technology platform that has been transformational for millions of people around the world, enabling connectivity, privacy, and freedom. The crown jewel of our family of products, Hotspot Shield is available for users on iOS, Android, PC and Mac. 200,000 new users download Hotspot Shield every day, making it one of the top 100 most popular iOS apps in App Store and the #1 top grossing app in the Productivity category. Powered by a proprietary VPN technology, Hotspot Shield is the worlds most popular Wi-Fi security application. Hotspot Shield is the #1 enabler for users to get Snapchat, Facebook, Twitter, YouTube in places where access to these apps or sites is restricted or censored. AnchorFree is also powering partners with its proprietary VPN technology available as an SDK, enabling app developers to integrate security, privacy and Internet freedom into their apps. About the Culture AnchorFree lives, sleeps, and breathes their core mission of enabling secure access to the worlds information for every person on the planet. AnchorFree is one of the few companies that is actually changing the world by providing users with basic human rights (Internet Freedom and Privacy), while driving solid year over year growth and shareholder value. Learn more about us here: AnchorFree website: http://www.AnchorFree.com  Hotspot Shield website: http://www.HotspotShield.com  Facebook: https://www.facebook.com/HotspotShield  Twitter: https://twitter.com/HotspotShield  Blog: http://blog.hotspotshield.com"}