{"jobID": "2799415201", "jobLocation": "Berkeley_Heights_NJ", "jobTitle": "Marketing Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.prac.com", "Headquarters": "Boston, MA", "Size": "1001 to 5000 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Arbella Insurance, Safety Insurance"}, "estimatedSalary": "61000", "jobDescription": " The Plymouth Rock Company and its affiliated group of companies write and manage over $1.3 billion in personal and commercial auto and homeowners insurance throughout the Northeast, where we have built an unparalleled reputation for service. We continuously invest in technology, our employees thrive in our empowering environment, and our customers are among the most loyal in the industry.  The Plymouth Rock group of Companies employs 1,800 people and is headquartered in Boston, Massachusetts. Plymouth Rock Assurance Corporation holds an A.M. Best rating of \"A-/Excellent\".  The Marketing Data Analyst supports the New Jersey business channels with analysis of business trends by agent. The analyst is responsible for analysis and recommendations for new marketing programs, creation of profit sharing plans, development of agent growth incentives, agent reports, underwriting metrics, and the management of the agent underwriting grading process. Role and Responsibilities:Assists with the creation of new growth and retention trend reports by agent.Upgrades existing reports to enhance efficiency, reduce redundancy, highlight trends, and increase ease of presentation.Develops UW statistics for enterprise and New Jersey channels.Creates and analyzes UW metrics for Independent Agent channel and recommends actions to minimize rate leakage.Reviews competitors compensation plans, recommends and implements new plans to maximize sales and retention.Analyzes competitive price change data, identifies trends and opportunities.Effectively uses available tools and data systems to analyze business issues within the company data/reports, troubleshoots when there are inconsistencies and communicates the results to Independent Agent channel management.Completes monthly and quarterly reports used to manage the channels performance, as well as ad hoc analyses as needed.Required Skills:Familiarity with database tools.Strong programming/query experience (SQL).Proficient Microsoft EXCEL skills.Excellent verbal and written communication skills.Ability to work independently and efficiently on a high volume of tasks.High Level of intellectual curiosity.Demonstrated problem solving experience gained through related coursework and work experience.One or more years of experience with relational database tools and concepts.BA/BS degree in quantitative field of study.Property and Casualty Insurance experience preferred."}