{"jobID": "2763427231", "jobLocation": "New_Brunswick_NJ", "jobTitle": "NeighborWorks VISTA, NJCC - Community Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.nationalservice.gov/programs/americorps", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "40000", "jobDescription": " NeighborWorks VISTA, NJCC - Community Data Analyst New Jersey Community Capital (NJCC) is a nonprofit community development financial institution (CDFI) with amission to transform at-risk communities through strategic investments of capital and knowledge. NJCC’s primarypurpose is to provide a critical mass of: a) capital investments, b) innovative housing interventions, and c) strategiclocal support and collaboration needed to foster the stabilization and revitalization of distressed neighborhoods inNew Jersey. Concurrently, NJCC maintains a high-performing loan portfolio and provides a reliable return to itssocially-motivated investors. NJCC is New Jersey’s largest community development financial institution (CDFI). Sinceits inception in 1987, NJCC has provided over $460 million in loans and investments, along with high-touch technicalassistance, to support the creation and preservation of housing, community facilities, and businesses in underservedLMI communities across the state. These investments have assured affordable housing, quality early care andeducation, and/or employment for almost 59,000 individuals in need.  Community Asset Preservation Corporation (CAPC) was formed in 2009 to acquire vacant and abandoned properties as a way of stabilizing and revitalizing communities hit hard by the foreclosure crisis. The concept was an outgrowth of efforts of local community development organizations to reclaim properties that had fallen into foreclosure. CAPC works with local community partners, builders, and contractors to rehabilitate the properties to fully functional and high quality affordable housing. CAPC is wholly owned by NJCC and together they strive to work with under-served populations throughout New Jersey. To promote stabilization and homeownership within communities, CAPC continues to grow and, together with NJCC, provide resources for homeowners including lease-to-own opportunities, financial education resources and scattered-site property management. Further help on this page can be found by clicking here.Member Duties : In order to better serve the different housing needs of communities around New Jersey, CAPC is proposing enhance our current data analysis capabilities through the coordination and management of a VISTA member. The VISTA will help to establish the following specific program components: a standard protocol for data collection, a set of specific data points for collection, a strategy for using the collected data to inform organization-wide decisions on future development.Program Benefits : Relocation Allowance  ,  Childcare assistance if eligible  ,  Living Allowance  ,  Choice of Education Award or End of Service Stipend  ,  Health Coverage*  ,  Training  .For details about AmeriCorps VISTA healthcare benefits, please visit http://www.vistacampus.gov/healthcare Terms : Permits working at another job during off hours  ,  Permits attendance at school during off hours  .Service Areas : Neighborhood Revitalization  ,  Housing  ,  Community and Economic Development  .Skills : Fund raising/Grant Writing  ,  Writing/Editing  ,  General Skills  . Refine SearchSUMMARYProgram Type: AmeriCorps VISTAProgram NeighborWorks VISTA, NJCC - Community Data AnalystProgram Start/End Date 08/27/2018 08/26/2019Work Schedule Full TimeEducation level College graduateAge Requirement Minimum: "}