{"jobID": "2835157646", "jobLocation": "Allen_TX", "jobTitle": "Big Data Science & Cloud Engineering Manager", "companyRating": null, "companyInfo": {"Website": "www.experianplc.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (EXPN) ", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Equifax, Acxiom, TransUnion"}, "estimatedSalary": null, "jobDescription": "The Experian CIS PD Data Technology group supports, maintains, provisions, and further evolves our world-class cloud-based analytical solution, on the Ascend platform. The group is looking to add to our established and growing team to ensure we achieve and exceed the high standards our customers and ourselves have come to expect. This leadership role will provide opportunities to work with our Support and Security leaders, as well as our partners in Product, Architecture, Analytics, and Sales as we come together to bring Ascend to even higher levels and support our customers as they attain even brighter insights. Essential Responsibilities:Ideal candidate will demonstrate ability to deliver results quickly while working in a dynamic, cross functional, team-oriented environmentLead the Ascend engineering and operations team in both the development and support of tools and applications to successfully achieve our business goals inclusive of security, customer satisfaction, and stockholder valueProvide the Ascend engineering and operations team guidance in cloud-based, big data solution operations developmentCollaborate with the CIS Product Marketing, CIS Architecture, and Global Architecture teams to continue to evaluate, recommend, and integrate new analytical tool and cloud technologyDemonstrate team success in support of the business goals through defined metrics, and reliable reporting strategies that effectively communicate successes and progress team to staff through executive levelsProvide line support to assist in troubleshooting and problem resolution as required, and called upon from time to time including off-hours support on an infrequent but as needed basisProvide technical guidance and hands-on validation of systems during the design, development, and testingMinimum of 4 years in progressive professional roles involving information security and/or IT managementA bachelor's degree in information systems or equivalent work experience in big data is preferredProven record of success in world-class enterprise big data engineeringExperience in launching and operating commercial big data solution -- Cloudera preferredExperience in operating and growing a cloud solution – AWS preferredExperience in designing and building big data technology solutions aligned to company standards and industry best practicesExperience working in a complex, matrix organization, and working with multiple stakeholders across functional and technical skillsetsExperience and working knowledge in applying information security methods, protocols and best practices to existing product is preferred. Managing portfolio of applications, system, and vulnerability remediation in an evolving DevSecOps culture and environmentExposure to security domain tools including those for encryption, public/private key, vulnerabilities, pen testing, cross-site scripting and scanning/remediationExperience in developing and coding secure applications. Java and C++ are preferred. Experience with .Net is a plusWorking knowledge of automation scripting required. Experience with Perl or Python is preferred, and other scripting experience is a plusWorking knowledge of both Windows and Linux environments is required, along with Hadoop. Cloudera is preferredWorking knowledge of automated configuration and deployment of tools is a plusKnowledge of software development practices and IT operations life cycles is requiredExperience working in Scrum Agile environment is preferredAbility to effectively work with business and other IT managersExcellent verbal and written communication skills. Ability to communicate effectively with development, operations, project, management, and business personnelApplies existing knowledge, and ability to learn and apply more. Tries new approaches and learns from each work assignmentDemonstrates flexibility within a variety of changing situations, while working with individuals and groups. Multitasks when required, and where minimal supervision is required – demonstrates ability to produce quality product and achieve assigned goalsStrong commitment to and understanding of software quality and security as is appropriate for high-availability, mission-critical systemsBenefits:Working for a leading FTSE 50 global information services company is just one of the rewards of joining Experian. Our benefits package is designed to reward contribution and loyalty and to attract the kind of talented individuals who have their pick of employers. That is why we offer a highly competitive package which comprises:Competitive base salaryAggressive bonus planCore benefits including: full medical, dental, vision, matching 401K and the opportunity to work with a global leaderExperian is listed on the London Stock Exchange (EXPN) and is a constituent of the FTSE 100 Index. Total revenue for the year ended March 31, 2017 was $4.3 billion. Experian employs approximately 17,000 people in over 40 countries. Experian is an Equal Opportunity Employer. Anyone needing accommodation to complete the interview process should notify the talent acquisition partner. The word \"Experian\" is a registered trademark in the EU and other countries and is owned by Experian Ltd. and/or its associated companies.EOE including Disability/Veterans"}