{"jobID": "2525509165", "jobLocation": "Glendale_CA", "jobTitle": "Analytics Manager, Product Marketing", "companyRating": "3.2", "companyInfo": {"Website": "www.legalzoom.com", "Headquarters": "Glendale, CA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Rocket Lawyer, LawDepot"}, "estimatedSalary": "121000", "jobDescription": " You like to solve real-world business problems by developing smart solutions. You are a hands-on person that finds the challenge of analyzing complex and disparate data exciting. You have data mining and analytical skills that allow you to be self-sufficient in handling and prototyping various projects. You are a team player and able to communicate (written and verbal) complex ideas efficiently in a fast-paced environment and with cross-functional team members. You have the ability and desire to constantly be learning about new tools and new approaches. You have a very good business understanding of all activities within hybrid business model (transaction and subscription).Working knowledge/familiarity with website, email and digital media analytics reporting suites (Google Analytics, DoubleClick, DSPs, and various attribution platforms etc.) is a plus! What you’ll do:Partner with Product Marketing Managers to provide insights into customer life cycle (from Acquisition to Retention) activities and make recommendation based on recent business trendsGather business requirements from end users and work with BI to create interactive dashboards in Tableau summarizing KPIsCreate what-if scenarios to model out impact of new initiatives and shift in business strategyProvide insights into monthly performance of business service line (s) for Executive Review meetingResponsible for assisting with budgeting and forecasting process on a quarterly basisPerform funnel analysis and provide insights into user behavior for desktop, mobile and mobile app experience using Google Analytics and Big Query dataWork closely with Sr. Statistical Analyst to provide behavioral analysis and insights on price, packaging and presentation testsProvide competitive analysis on various companies to identify market trends, pricing/business models, and methods of operationsMine internal and external datasets and perform segmentation analysis to look for opportunities You’ll work with Product ManagementMarketingSalesEngineeringBusiness IntelligenceRequirementsA BA/BS degree in Business Administration or a quantitative field such as Economics, Statistics, Computer Science, etc.Expert level knowledge of SQLWorking knowledge of Tableau or similar visualization tools4+ years of experience as Business Analyst or similar roleWorked extensively with marketing, finance, sales, and product teams with amazing successKnowledge of scripting language such as R and Python is a plusFlexible and able to prioritize and adapt to changing business needsAble to handle, prioritize, and manage projects in various states of completion Legalzoom is an Equal Opportunity Employer, dedicated to diversity.Required Skills Required Experience Job Location  Glendale, US-CA "}