{"jobID": "2817506738", "jobLocation": "Dallas_TX", "jobTitle": "Commercial Banking Project Catalyst - Data Delivery Technical Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Apply Now  Commercial Banking Project Catalyst - Data Delivery Technical Analyst  Req #: 180043492  Location: Dallas, TX,US  Job Category: Project Management Job Description: Project Catalyst is one of five major investments aligned to the Commercial Bank 2020 transformation agenda. The goal of this sales enablement effort is to deliver new technologies, data, and business processes to help our bankers optimize sales efforts and deliver a better overall experience to our clients.  As part of the Catalyst initiative, the Information Delivery team is responsible for creating a meaningful information experience for the CB sales force across any technologies or channels. The team designs end-to-end information flow, from origination and capture through preparation and use. By scoping data needs, executing against new data infrastructure, establishing proper control points, and designing information offerings, the team helps realize our overall vision for data.  The Technical Analyst be responsible for engaging with Business Analyst and Stakeholders and driving out meaningful User Stories/Requirements for technology to deliver within an agile methodology. This includes data identification, analysis and model creations. As the primary point for Technology s/he will be responsible for providing clarification, partnering with solutions and supporting technology with challenges or roadblocks impacting delivery.  A qualified candidate should have a foundational understanding of the Commercial and Investment Banking businesses and CB data.  The key responsibilities of this role include: Work with stakeholders and business analysts to gather, analyze requirements and assist the team in defining appropriate technology solutions for business scenariosDocumenting requirements with user storiesGuide developers within the team and ensure solutions are consistent and coherentAssisting in design sessions with the delivery team as neededIdentifying data modelling and systems integration approachesWriting Test CasesQA/UAT testing supportAssisting rollouts and helping with occasional production issuesDefine acceptance criteria using Specifications by Example Final Job Code and Officer title will be determined at time of offer, and may be different than this posting.  Knowledge and Skills Requirements 5-7 years of business/technical analyst experienceExpertise in advanced database, analytics and reporting tools and techniques based in SQL/Qlik/Hadoop and a strong aptitude for extracting and managing large, complex data sets from core databases through user-generated and pre-defined queries and processes.Expert skills in writing efficient and scalable SQL queries for RDBMS as well as Hadoop across highly disparate datasetsPrior experience in Relational Database Migration/Transition to Big Data environment will be plus.2+ years of commercial banking and/or investment banking experience preferredProven work experience collaborating in a cross-functional environment and influencing others to initiate a recommended course of actionExperience with Agile delivery methodologyProven track record of taking ownership and delivering results within an Agile delivery modelStrong attention to detail, with excellent organizational skills, ability to multi-task and manage prioritiesExcellent analysis, test planning, and activity planning skills"}