{"jobID": "2808093622", "jobLocation": "Arlington_VA", "jobTitle": "Statistical Data Analyst", "companyRating": "4.9", "companyInfo": {"Website": "www.intelliwaresystems.com", "Headquarters": "Fredericksburg, VA", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Government", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": "Overview: IntelliWare is a growing small business with an immediate need for a skilled and energetic Statistical Data Analyst to support a federal account. Clearance: Secret Clearance required, Top Secret Clearance preferred Description: The Statistical Data Analyst will analyze data integrity and consistency to obtain a quantitative basis for decision making and resource allocation. Additional responsibilities will include but not limited to; Analyze data integrity and consistency to obtain a quantitative basis for decision making and resource allocation.Provide intelligence and threat analysis of the information that is tailored to the government’s requirements.Provide written reports and populate DHS databases or any other designated database as required.Provide specialized analysis related to data integrity, content of information, and production support in the MongoDB environment.Evaluate new technological capabilities to enhance productivity and efficiency and provide recommendations for consideration to leadership.Conduct trend analyses and advanced technical research techniques based on the government’s requirements.Extract data and develop reports from the LeadTrac Mod system, Visa Security Program Tracking System, and additional case management systems, as required.Required Skills and Qualifications:Minimum four (4) years of related experience in analysis of bulk data sets to include entry and extraction of target data, statistical data, and reporting.Possess a core understanding and experience in navigating and writing queries for MongoDB and Microsoft Access environments.Experience with MongoDB.Strong understanding of coding principles, methodologies, and best practices.Education Requirements:Bachelor’s Degree requiredLocation: Arlington, VA (Crystal City, VA) Travel: Not Required Company Profile: IntelliWare is a privately-owned company founded to provide business and technical services to government and commercial clients. Our business philosophy is to hire the brightest, yet humble, people we can find and provide them with the team, training, and support they need to exceed our customers’ mission requirements. Our experienced, cleared, and professional workforce receives compensation and benefits that are intended to be among the best in our industry."}