{"jobID": "2623803506", "jobLocation": "Deerfield_IL", "jobTitle": "Analyst, Data Analytics", "companyRating": null, "companyInfo": {"Website": "www.walgreens.com", "Headquarters": "Deerfield, IL", "Size": "10000+ employees", "Founded": " 1901", "Type": " Company - Public (WBA) ", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " CVS Health, Target, Walmart"}, "estimatedSalary": null, "jobDescription": "Job Summary Collaborates with the account teams and contracting to identify and isolate variances resulting from over/under payment practices and factoring these into actual-to-expected results. Assist in the development of timely, innovative, objective analysis which lead to fact-based solutions for strategic business issues. Provides customer service to internal and external customers, including meeting quality standards for services, and evaluation of customer satisfaction. Job ResponsibilitiesAssists in the development and the utilization of innovative data visual presentation strategies to ensure data is conveyed in meaningful and interpretive formats for all audience levels.Assists in the development and implementation of innovative analytical and/or statistical methodologies and supporting tools for evaluating Company processes, business problems, and/or ROI of products and services.Collaborates with the account teams and contracting to identify and isolate variances resulting from over/under payment practices and factoring these into actual-to-expected results.Assists in the development and maintenance of an automated process to identify data and process integrity issues. Provides leadership with detailed recommendation for issue resolution. Identifies both up and down stream impact of identified issues and fully communicates with any impacted parties.Assist in the development of timely, innovative, objective analysis which leads to fact-based solutions for strategic business issues. Identifies, formulates, and drives problem definition and hypothesis formulation as it relates to the specific business environment. Synthesizes externally syndicated data with internal experience. Prepares standard and ad hoc management reports and presentations for projects. Utilizes query based tools to create and run queries used for data mining and analytics to support other job responsibilities and ad hoc projects.Performs specific tasks identified in the compliance monitoring program to include evaluation of definitions, price increase maintenance and network identification.Provides customer service to internal and external customers, including meeting quality standards for services, and evaluation of customer satisfaction.Works cross functionally with peers in Sales, Finance, Law, Contract Development, and Contract Operations. Walgreens, one of the nation's largest drugstore chains, is included in the Retail Pharmacy USA Division of Walgreens Boots Alliance, Inc., the first global pharmacy-led, health and wellbeing enterprise. More than 10 million customers interact with Walgreens each day in communities across America, using the most convenient, multichannel access to consumer goods and services and trusted, cost-effective pharmacy, health and wellness services and advice. Walgreens operates 8,175 drugstores with a presence in all 50 states, the District of Columbia, Puerto Rico and the U.S. Virgin Islands. Walgreens omnichannel business includes Walgreens.com. Approximately 400 Walgreens stores offer Healthcare Clinic or other provider retail clinic services.  As the neighborhood drugstore and retailer, our goal is to make health and happiness simpler, easier and within reach. And we remain a trusted wellness provider offering convenient access to important health services, such as immunizations and an array of pharmacy services that can help patients improve their health. To our team members, Walgreens represents a unique opportunity to excel in their careers in a welcoming and inclusive environment. We offer the chance to work in a truly supportive environment, and be a part of a progressive organization dedicated to the well-being of our customers, team members and the communities we all call home. Bachelor's Degree OR High School Diploma/GED and at least 3 years of experience in Finance, Economics, Accounting, Math, Business, Actuarial Science, or Computer Science.Experience collaborating with internal and external resources to assist in the development of strategies and project plans that meet department goals within budget and established timelines.Experience establishing and maintaining key relationships with internal (peers, business partners and leadership) and external (business community, clients and vendors) within a matrix organization to ensure quality standards for service.Experience developing ways of accomplishing goals with little or no supervision, depending upon oneself to resolve issues to ensure completed objectives and determining when escalation of issues is necessary.Experience using time management skills such as prioritizing/organizing and tracking details and meeting deadlines of multiple projects with varying completion dates.Experience in diagnosing, isolating, and resolving complex issues and recommending and implementing strategies to resolve problems.Experience with analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement of results and find solutions.Advanced level skill in Microsoft Excel (for example: using AVERAGE function, merging and centering cells, printing centered page and/or creating a pivot table).Advanced level skill in Microsoft PowerPoint (for example: changing picture styles, customizing animation and/or setting automatic slide timings).Advanced level skill in Microsoft Word (for example: adding developer tab, creating a macro, formatting table style, inserting comments and/or creating a mail merge).Willing to travel up to 10% of the time for business purposes (within state and out of state).Masters DegreeBachelors Degree in Statistics, Engineering, Computer Science or Information Systems.Knowledge of advanced coding languages (e.g. SAS, SQL, C++, etc.).Experience with system administration (e.g. PROS, Vendavo, Vistaar, Salesforce.com, SharePoint, Wikis, etc.).Experience with business intelligence tools in support of data analytics (e.g. Business Objects, Cognos, Tableau, PROS, etc).Experience with learn coaching, mentoring, and training staff.Knowledge of Pharmacy, Pharmaceutical Benefit Manager, Benefit Consultancy, or Managed Care company.Experience with working with pharmacy data at a retail pharmacy, Pharmaceutical Benefit Manager, benefit consultancy, or managed care company.Knowledge of pharmaceutical industry pricing.Experience with project management (for example: planning, organizing, and managing resources to bring about the successful completion of specific project goals and objectives).Knowledge of systems such as Remedy and GIS.Experience with data extraction, data mining, data acquisition, data profiling, and data warehouse management.Experience in a data warehouse/business intelligence/decision support systems environment or IT experience.Knowledge of statistical concepts and data mining techniques."}