{"jobID": "2768364865", "jobLocation": "Washington_MI", "jobTitle": "Branch Relationship Banker III", "companyRating": null, "companyInfo": {"Website": "www.huntington.com", "Headquarters": "Columbus, OH", "Size": "10000+ employees", "Founded": " 1866", "Type": " Company - Public (HBAN) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A Relationship Banker III plays a key role in helping our consumer and business customers by building relationships that provide opportunities to proactively recommend appropriate deposit, loan and other banking products.  Your responsibilities include: Proactively driving sales through walk-in customers, pre-set appointments, referrals from customers and other branch colleagues and partners.Educating and referring customers to other areas of the bank to deepen relationships and build strong internal partnerships.Being proficient in understanding and educating customers on consumer deposit products and consumer lending.Providing excellent customer service and effectively resolving customer issues.Adhering to all operational, security, risk and regulatory policies and procedures.Demonstrating acumen in sales, customer service, relationship management, banking, investments, consumer lending, business banking, business lending, communication and presentation.Maintaining your knowledge of all products, services, technology and policies. Basic Qualifications High School Diploma or GED2 years customer service and sales in banking, financial services or goal driven retail sales.1 year consumer and business deposit products & lending knowledge or,1 year of Business to Business sales experience Or Bachelor's Degree1 year customer service and sales banking, financial services or goal driven retail sales.1 year consumer and business deposit products & lending knowledge or,1 year of Business to Business sales experience Preferred Qualifications Career minded individuals that want to join an organization where they can gain experience and build a career. Huntington provides career paths and development plans to get you where you want to go.Bachelor's DegreeComfort with technology such as mobile services and online banking services are a plus. EEO/AA Employer/Minority/Female/Disability/Veteran/Sexual Orientation/Gender Identity  Tobacco-Free Hiring Practice: Visit Huntington's Career Web Site for more details.  Huntington does not accept solicitation from Third Party Recruiters for any position."}