{"jobID": "2546484114", "jobLocation": "Alhambra_CA", "jobTitle": "Device Design Scientist", "companyRating": null, "companyInfo": {"Website": "www.emcore.com", "Headquarters": "Alhambra, CA", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Public (EMKR) ", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sharp Electronics (US), Finisar"}, "estimatedSalary": null, "jobDescription": " Requisition Number 17-0071 Title Device Design Scientist City Alhambra State CA Description EMCORE Corporation is a leading provider of advanced Mixed-Signal Optics products that provide the foundation for today’s high-speed communication network infrastructures and leading-edge defense systems. Our optical chips, components, subsystems and systems  enable broadband and wireless providers to continually enhance their network capacity, speed and coverage to advance the free flow of information that empowers the lives of millions of people daily. The Mixed-Signal Optics technology at the heart of our broadband  transmission products is shared with our fiber optic gyros and military communications links to provide the aerospace and defense markets state-of-the-art systems that keep us safe in an increasingly unpredictable world. EMCORE’s performance-leading optical  components and systems serve a broad array of applications including cable television, fiber-to-the-premise networks, telecommunications, wireless infrastructure, satellite RF fiber links, navigation systems and military communications. EMCORE has fully vertically-integrated  manufacturing capability through its world-class Indium Phosphide (InP) wafer fabrication facility at our headquarters in Alhambra, California and is ISO 9001 certified in Alhambra, and at our facilities in Warminster, Pennsylvania and China. For more information,  please visit www.emcore.com.  EMCORE Corporation is seeking to fill the position of Device Design Scientist at our Wafer Fab facility located in Alhambra, California. PRINCIPAL DUTIES AND RESPONSIBILITIES:Take technical ownership of semiconductor lasers and photodiodes design, work closely with various functions including MOCVD facility and processing group, to design and implement the design structure/s. Integrate appropriate processes for low cost and high-performance  devices. In the device development phase, monitor and report on yield for III-V device wafers, coordinate reliability assessment of prototype devices, conduct FMA and implement corrective actions to achieve yield and reliability goals.Device modeling and simulation as well as data analysisWork cross functionally with manufacturing and marketing/sale department to improve the cost of manufacturing III-V devices. Support production in all technical aspects.Organize all the phases of product design reviews, generate production documentation, manufacturing process instruction, acceptance test procedure and transfer to production (NPI) as defined by EMCORE Development Procedure.Deploy Quality Management System as it applies to the scope of work."}