{"jobID": "2729435072", "jobLocation": "Reston_VA", "jobTitle": "Customer Success Manager", "companyRating": "4.1", "companyInfo": {"Website": "www.wipfli.com", "Headquarters": "Milwaukee, WI", "Size": "1001 to 5000 employees", "Founded": " 1930", "Type": " Private Practice / Firm", "Industry": " Accounting & Legal", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Baker Tilly Virchow Krause, BDO USA, CliftonLarsonAllen"}, "estimatedSalary": "80000", "jobDescription": "Create lasting, positive impact. By considering Wipfli LLP, you’ve decided to go beyond the ordinary public accounting and consulting firm. At Wipfli, we create positive impact and lifetime relationships by leading and working with an outward mindset. As a member of our team, you will be inspired to think freely and follow your passion, grow as a professional by developing your skills and commit to serving our clients and communities with honesty and integrity.  Wipfli has a broad national footprint with offices coast to coast — and we’re still growing! As an associate, you’ll have access to skill development and career opportunities, whether you want to move up or transition into another area of specialty. For some positions, we have the flexibility and technology to work from anywhere; whether it’s in the office, at home or at the client site.  Join a company focused on giving back to the greater good — at Wipfli, we’re committed to supporting the communities we do business in. To learn more about our volunteer efforts, who we are and what we do, visit wipfli.com.  Wipfli LLP is looking for a Customer Success Manager to help grow and maintain our consulting services practice. This position will ideally be located in our Reston, Virginia office. This professional will be responsible for working with existing Wipfli clients to renew software agreements and expand the relationship by promoting additional services. Nurture and manage ongoing relationships with C-level executives and IT management.Work collaboratively with Wipfli’s relationship executive to proactively contact clients to renew software agreements.Understand clients’ needs and position additional services to enhance the relationship.Proactively communicate and promote marketing events (e.g. webinars, events) to existing clients.Represent Wipfli at tradeshows and other sponsored marketing events.Work collaboratively with Wipfli’s relationship executive, services team, and leadership.Provide accurate activity reporting and revenue forecasts within CRM2-4 years of prior sales experienceBachelor's Degree in a related field or equivalent experienceExcellent verbal and written communication skills.Ability to manage time effectivelyOrganization and attention to detail.Build trust and rapport with clients and prospects through active listening and effective communicationAbility to quickly learn the business drivers, challenges, and goals of our clients to assist and recommend solutionsAbility to work independently.Professional assertivenessStrong business ethics and valuesWipfli is an equal opportunity/affirmative action employer. All candidates will receive consideration for employment without regards to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identify, citizenship status, veteran status, disability, or any other characteristics protected by federal, state, or local laws. A Wipfli recruiting team member will guide you through our evaluation and interviewing process, including communicating an update on your status as soon as possible."}