{"jobID": "2633265937", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst, Global Oil Markets", "companyRating": "3.3", "companyInfo": {"Website": "www.ihsmarkit.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 2016", "Type": " Company - Public (INFO) ", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Thomson Reuters, International Data Group"}, "estimatedSalary": "65000", "jobDescription": "Title: Data Analyst, Global Oil Markets Summary:  The Data Analyst will contribute to the IHS Markit’s suite of research services providing insights and analysis on oil and gas markets to financial industry clients. Scope of responsibilities include advanced data analysis, model development and research supporting the team’s content coverage across the oil market value chain including upstream, midstream and downstream. General Job Duties: · Research and Analysis Support: Perform advanced data analysis focusing on global commodity markets, particularly oil, refined products and natural gas liquids. Provide overall team support and field client requests  · Database Management and Model Development: Maintenance and improvement of team databases and models. Includes organizing, analyzing, entry of incoming information, troubleshooting and correction of errors. Contribute to the development of new models and data deliverables.  · Research and Analysis: Articulate key industry issues, insights, and market outlooks via written reports and presentations. Qualifications: · Bachelor's degree in engineering, finance, economics, political science, international relations or related fields. Graduate degree preferred.  · Familiarity with energy markets. Professional experience in oil or gas market analysis or consulting preferred (1-3 years of experience in relevant fields).  · Finance experience including coverage of commodity markets or energy equities preferred but not required.  · Strong quantitative skills and advanced proficiency in MS Excel essential. VBA proficiency preferred.  · Ability to work with large data sets.  · Good written and oral presentation skills in English.  · Must have the ability to work with limited supervision and have solid problem-solving, judgment and decision-making skills for activities of moderate complexity.  · Ability to work well in a team-oriented environment providing ideas and open feedback.  · Highly organized, creative and proactive to ensure deadlines are met consistently with high quality output.  It is the policy of IHS Markit to provide equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, IHS Markit will provide reasonable accommodations for qualified individuals with disabilities. We maintain a drug-free workplace. For candidates in the US, we are a participant in E-Verify (see link below).  EEO is the Law  EEO is the Law Supplement  Right to Work  Pay Transparency Policy  E-Verify"}