{"jobID": "2807720660", "jobLocation": "Washington_DC", "jobTitle": "Sr Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.amtrak.com", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1971", "Type": " Other Organization", "Industry": " Transportation & Logistics", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " SNCF, Bombardier Transportation"}, "estimatedSalary": "80000", "jobDescription": "Your success is a train ride away. Amtrak connects businesses and communities across the country and we move America’s workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees. Are you ready to join our team?SUMMARY OF DUTIES: The Senior Data Analyst provides analytical and technical support to the Pricing and Revenue Management department. This position is responsible for developing and tracking performance measures, conducting detailed analysis and generating and distributing monthly and weekly reports.     This position is responsible for analyzing ridership, revenue, and capacity data to identify increased revenue opportunities as well as the potential ridership and revenue impact of proposed pricing and capacity changes. In addition, the Senior Data Analyst position is responsible for making comprehensive recommendations based on sound business analysis and methodologies.     The position is also responsible for designing interactive web-based tools to facilitate the analysis of train performance in addition to managing quality assurance of multiple data sources. ESSENTIAL FUNCTIONS:• Support the creation and distribution of monthly reports. Develop and implement new reports to meet PRM requirements.Analyze ridership, revenue, capacity and inventory data to identify revenue and ridership opportunitiesMeasure the impact of PRM decisions.Presents findings, conclusions and recommendations to senior management.Assist in User Acceptance Testing, as required, through preparation of test data and test database environment and assist in the development and execution of test plans and test scripts. EDUCATION:Bachelor's degree in a quantitative field or equivalent experience. WORK EXPERIENCE:Experience with Microsoft Office (particularly Excel and Access) or other equivalent software.Experience with a database language such as SQL, SAS, Oracle or Microsoft Access.Demonstrated ability to conduct quantitative analysis, strong analytical and problem solving skills, with ability to analyze and interpret data.Must be detail-oriented.Must be able to prioritize competing demands. PREFERRED WORK EXPERIENCE:• Experience in data analysis.Working with and managing large data sets.Knowledge of pricing and revenue management concepts.Experience with statistical packages such as R or Python.Experience with Tableau, Business Objects, Crystal Reports, Microstrategies, or other data visualization software. COMMUNICATION AND INTERPERSONAL SKILLS: Must have excellent oral and written communication skills.    Requisition ID:35631 Posting Location(s):District of Columbia; Maryland; Virginia Personnel Area:DC04 Job Family/Function:Marketing Relocation Offered:No Education Requirements:Bachelors Degree Travel Requirements:Up to 25% Employment Experience Requirements:5 - 7 years of experience Amtrak employees power our progress through their performance. We want your work at Amtrak to be more than a job – we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals.  We proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities.  All positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. We appreciate your cooperation in keeping Amtrak safe and drug-free.  In accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions.  Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience.  Amtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status.  POSTING NOTES: Marketing || Corporate"}