{"jobID": "2830901401", "jobLocation": "Milpitas_CA", "jobTitle": "Incident Response Analyst (Information Security | Data loss Prevention)", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "21", "jobDescription": "Business Unit: The Legal Compliance Organization (LCO) team headquartered in Milpitas, CA provides legal guidance to further KLA-Tencors strategic objectives and protect and preserve the legal, ethical and financial integrity and reputation of the Company. With specific expertise in the areas of corporate law, commercial law, employment law, and intellectual property; the LCO offers strategic legal counsel that is informed by a clear understanding of the companys business objectives and expertise in the laws and regulations relevant to the business worldwide. Responsibilities: The InfoSec Security Analyst (Data Loss Prevention) will work as an integral component of the companys information security program.  The incumbent will focus on Data Loss Prevention and is responsible for developing processes, thresholds, rule creating, use cases and escalation paths for data loss events.  The candidate will be accountable for establishing consensus with stakeholders to reduce cyber risks while minimizing broader operational impact.  This role will interface with multiple stakeholders within the security and access organizations as well as business, compliance, legal and human resource partners. Key Responsibilities: Analyze data loss rules and alerts using existing toolsets to reduce false positives and to protect sensitive data.  Provide input to IT DLP team to tune data loss prevention platforms to ensure optimal coverage, thresholds, and workflows  Respond to DLP escalations from the security operations team  Create data prevention use cases for the Information Security Council  Work with appropriate business operating units to understand normal business practices for communicating sensitive data and tailor management response requirements accordingly  Innovate to build upon data loss prevention foundation and begin working across the security organization to begin development of an insider threat behavioural analysis capability  Develop an insider threat behavioural analysis capability using existing and new data protection platforms  Recommend improvement to the data protection toolsets  Develop requirements for escalation and logging in order to baseline data loss risk across the regions  Implement a process to support stakeholder interactions such that sensitive data is only transmitted with transparency and accountability through a defined process  May serve as Tier 2 and Tier 3 support for DLP suites. Preferred Qualifications: Deep understanding of data loss prevention technologies covering data at rest, data in use, and data in motion.  Ability to prioritize response activities based on intake queues and SLAs.  Ability to work across varying levels of technical competency in order to accurately communicate risk and mitigation activities.  Experience using Data Loss Prevention technologies (network and endpoint).  Strong Experience with unstructured data, file share and policy-based email encryption.  Understanding of behavioural analysis and anomaly hunting tactics.  Familiarity with building alerting, correlation and monitoring use cases within common log management suites.  Familiarization with case management and orchestration tools. Minimum Qualifications: 5 years' experience or comparable combination of degree and experience.  Kindly send your resume to Mohamed.Riyazudeen@kla-tencor.com  KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}