{"jobID": "2811731387", "jobLocation": "Kenilworth_NJ", "jobTitle": "Upstream Biologics Process Development Scientist", "companyRating": null, "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Eurofins Lancaster Laboratories PSS is searching for an Upstream Biologics Process Development Scientist in Kenilworth, NJ.  Upstream Biologics Process Development Scientist responsibilities include, but are not limited to, the following :Supporting the team in the set-up, operation, and associated analysis of mammalian cell culture and bioreactor processesGeneral operations such as bioreactor building/sterilization, cleanup and turnover of bioreactors to maintain a set run scheduleSampling including cell count and metabolite analysisPrepare solutions and culture mediaPerform data analysisMaintain records and test results following good manufacturing practices (GMP)Management of lab supplies and raw materialsWork independently and efficientlyDocument work clearly and perform tests accuratelyCommunicate effectively with client staff members The ideal candidate would possess :At least six months related laboratory experience including aseptic and cell culture techniques either in a lab scale or pilot scale settingGeneral laboratory skills, including experience with pipettesExperience using formulas and linking spreadsheets in ExcelStrong computer, scientific, and organizational skillsExcellent communication (oral and written) and attention to detailAbility to work independently and as part of a team, self-motivation, adaptability, and a positive attitudeAbility to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Basic Minimum Qualifications :Bachelor's degree in in Chemical Engineering, Biomedical Engineering, or Biological Sciences, or other related degree concentration, or equivalent directly-related experience (two years of directly related industry experience is equivalent to one full-time year of college in related major)Ability to work weekends and overnight hours as neededAuthorization to work in the United States indefinitely without restriction or sponsorship Position is full-time, Monday-Friday, 8 a.m.-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of Kenilworth New Jersey are encouraged to apply.  As a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.  To learn more about Eurofins, please explore our website www.eurofinsus.com .  Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer. "}