{"jobID": "2805417583", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.asurion.com", "Headquarters": "Nashville, TN", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Apple, SquareTrade"}, "estimatedSalary": "113000", "jobDescription": " Asurion is seeking a talented Senior Data Analyst to organize, interpret and present data thereby enabling increased consumer and carrier adoption, market share and customer engagement and satisfaction. You will partner with Product Managers, Designer and Engineers to drive adoption and engagement of our mobile applications across millions of devices and customers. You will understand the team's objectives and key results and determine the appropriate way to approach and measure performance. This role is based in San Mateo, CA.  Why Asurion?  Asurion is a $7B company that helps people around the globe balance the interdependence between life and technology. We build products that reach over 300M users through our partners--Verizon, Sprint, AT & T, DoCoMo and KDDIachieving double digit revenue growth year over year for the past 5 years.  The San Mateo office is our product development hub. Agile Journey teams have ownership to create solutions on products like a machine learning chatbot, an asynchronous technical assistant, and apps that use artificial intelligence and natural language processing to drive engagement with users to name a few.  Asurion has more cutting-edge technology than you can imagine. But at our core, we're about people. We believe our employees are our greatest asset and invest in their growth through a culture of learning. Our dynamic and rewarding environment ensures that every team member has the opportunity to reach their full potential. Responsibilities:Translate user interaction data into meaningful interpretations and product recommendationsUtilize data to make decisions and measure success yet also recognize and call out when data is not necessarily representing the complete pictureGenerate actionable product insights using traditional database tools and Big DataMentor junior team membersBuild a bridge between multiple teams to create a complete picture of customers' engagement with and usage of our app familyQualifications:Bachelor's Degree5+ years of data analysis experience in any related discipline (engineering, finance, operations, etc.)Proficiency with SQL queriesExcel and PowerPoint expertiseYou love to learn new skills, use new tools, and grow your experienceExcellent written and verbal communication skills, able to translate data findings into plain EnglishExperience working with engineers in an agile software development environmentDemonstrate the interpersonal skills to interface well with Engineers and Product Managers, and to message conclusions to an executive-level audienceYou know when to move fast and when to pause before taking actionYou bring an entrepreneurial mindset to your product endeavorsYou have strong empathy for your customers #LI-LB1 PRO00766 | San Mateo | California | US | 2018/04/24"}