{"jobID": "2715557442", "jobLocation": "Houston_TX", "jobTitle": "Senior Staff Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.terracon.com", "Headquarters": "Olathe, KS", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Kleinfelder, URS Corporation, PSI"}, "estimatedSalary": "51000", "jobDescription": " Senior Staff Scientist  21-May-2018 Service Line Environmental Job DescriptionGeneral Responsibilities:Terracon’s cultural resources management services are part of our Natural/Cultural Resources (NCR) Practice, and focus on compliance with Section 106 of the National Historic Preservation Act (NHPA) as well as applicable state and local regulations. This position involves desktop/literature reviews, pedestrian surveys (with shovel testing and/or backhoe trenching, as appropriate) as well as consultation with State Historic Preservation Officers (SHPOs) under Section 106 of the NHPA. The position requires evaluation of archeological sites for National Register of Historic Places (NRHP) eligibility. Understanding of the regulatory framework for both archeology and historic structures is recommended. Although this position does not require architectural evaluation of standing structures for NRHP eligibility, the individual would be responsible for understanding when such evaluations would be required and managing the work of architectural historians, who would conduct the NRHP evaluations. The position requires the individual to be capable of digging 8+ test holes (including screening) per day for archeological evaluation, which may span multiple days and involve out-of-town travel. The position requires consultations with federal agencies, state agencies, tribal groups, municipalities and other stakeholders. The individual will be expected to contribute to business development through preparation of proposals and statements of qualifications, presentations to clients, and active engagement in professional networking activities.Essential Role and Responsibilities:Follow safety rules, guidelines and standards for projects. Comply with state and local regulations, including contacting “One Call” prior to digging on job sites, as applicable. Participate in pre-task planning. Report safety challenges or concerns to management.Be responsible for maintaining quality standards, budgets and meet deadlines on projects. This includes adherence to Terracon’s quality processes and requirements for document quality control reviews.Prepare survey and excavation reports, site recording forms, research designs, permit applications, and other technical documents.Oversee field research, data collection, inventory, analysis, and final report production.Remain current with agency protocol for conducting cultural resources work, particularly in the states of TX, NM, LA, AR, and OK (and central Gulf Coast region).Maintain good working relationships with state and federal agency contacts and clients.Develop budgets, proposals, and prepare statements of qualification.May oversee work performed by lower level scientists/engineers, technicians, and subconsultants.Collaborates with management to develop client development plans.Develop professional relationships with existing and prospective clients.Contribute to business development through active engagement in professional networking activities outside of the office and presenting to existing and prospective clients.Requirements:Minimum of a Master’s degree in Archaeology, Anthropology, or closely related field.Must meet the requirements of Secretary of the Interior for qualified archeologist.Minimum of five (5) years of supervisory and fieldwork experience.Must meet the Secretary of the Interior’s qualifications as a Principal Investigator (PI).Emphasis/experience in central Gulf Coast region of archaeology is required with the ability to serve as a PI in one or more of the following states: TX, NM, LA, AR, and OK.Listed as a Registered Professional Archaeologist (or ability to obtain RPA status within one year of employment).Ability to dig up to 8+ test holes (including screening and completion of hand written forms) per day and traverse sites with uneven terrain and potentially brushy/woody vegetation while carrying a shovel, screen, notebook, water, and other personal protective equipment, as required by the job and task.Valid driver’s license with acceptable violation history.Project management experience is preferred.Exemption Exempt Requisition ID8828BRPosting Title Senior Staff Archaeologist Employment Type Regular, Full Time City, State (Office Location) Houston, TX About Terracon Terracon is a 100 percent employee-owned consulting engineering firm providing quality services to clients. Since 1965, Terracon has evolved into a successful multi-discipline firm specializing in environmental, facilities, geotechnical, and materials services. Terracon currently has more than 3,500 employees in 130 offices with services available in all 50 states. Terracon’s growth is due to valued employees exceeding expectations in client service and growing their careers with new and exciting opportunities in the marketplace. EEO Statement Terracon offers an excellent compensation and benefits package including: medical, dental, vision, life insurance, 401(k) plan, and paid holidays.  Terracon is an EEO employer. We encourage qualified minority, female, veteran and disabled candidates to apply and be considered for open positions. We do not discriminate against any applicant for employment, or any employee because of race, color, religion, national origin, age, sex, sexual orientation, gender identity, gender, disability, age, or military status. Job Category Scientist "}