{"jobID": "2776149515", "jobLocation": "Austin_TX", "jobTitle": "Sr Scientist", "companyRating": null, "companyInfo": {"Website": "www.fluenceportland.com", "Headquarters": "Portland, OR", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Private Practice / Firm", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Senior Horticulture Scientist  Fluence Bioengineering is looking for a Senior Horticulture Scientist to lead our research efforts to advance protocols for product deployment and development, supervise our team of scientists, and conduct applied plant physiology research.  Research will primarily be focused on the impact of light intensity and spectral light quality on plant growth and development to create value-added lighting solutions for the commercial horticulture industry. Additional research will focus on the influence of temperature, CO2 concentration, relative humidity, nutrient composition, and soil moisture content to make recommendations to growers on best management practices.  The ideal candidate will be a hands-on horticulture scientist with a passion for applied plant physiology research who uses problem solving and critical thinking skills to explore new territories of photobiology. The Senior Horticulture Scientist will have experience with horticulture lighting, commercial crop production, managing controlled environments, data collection, and statistical analysis. The Senior Horticulture Scientist will be a high performer, highly productive, articulate, focused, and have an attitude to get things done. Key functions include:Conduct in-house and collaborative research with third-party industry and academic partners to identify, develop, and launch innovative horticulture lighting solutions.Manage and develop strategic partnerships with industry and academic research institutions.Manage a team of scientists, and day-to-day operations of a research facility.Work collaboratively and strategically with marketing, sales, and engineering teams to ensure alignment with research goals/objectives and the needs of our customer base. Required Qualifications Master's Degree in horticulture, plant physiology, or related field5+ years of demonstrated research experienceProven ability to manage complex day-to-day operationsExperience propagating and growing plants in a controlled environment, along with pest and disease management, application of chemical control agents, and maintenance of facility recordsExcellent communication and presentation skills with ability to adapt quickly to meet audience needsEnjoy motivating and supervising staffAbility to participate in strategic planning Preferred Qualifications Ph.D. in horticulture or related fieldExperience working in the commercial produce, cannabis and/or lighting industry Working Conditions Position is in Austin, TX. Domestic and international travel will be required.SDL2017"}