{"jobID": "2830526308", "jobLocation": "Petoskey_MI", "jobTitle": "Cashier - Lears Road, Petoskey MI", "companyRating": null, "companyInfo": {"Website": "www.meijer.com", "Headquarters": "Grand Rapids, MI", "Size": "10000+ employees", "Founded": " 1934", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, Walmart, SpartanNash"}, "estimatedSalary": null, "jobDescription": "At Meijer, it's about our people and their success. Today, we have more than 65,000 employees with the strength to help you grow in any career direction you want, whether in our stores, distribution centers, manufacturing facilities or our Midwest corporate offices. It's your future, maybe it starts with Meijer. What You’ll Be Doing: As a Cashier, you will craft quality customer experiences by providing efficient, effective customer service in the checkout lane. You will create ‘WOW’ moments that have a positive and lasting impact on our customers. Complete transactions, handle money in all forms responsibly and maintain accuracy of point of sale purchasesUse good eye contact and body language, displaying a friendly and outgoing attitudeBe prepared to handle customer questions adequately and appropriatelyBuild trustful relationships with customers to encourage return visitsMeijer Rewards:Competitive Wages$1 per hour premium pay during peak summer months*Medical/Prescription/Dental/Vision Plan CoverageMeijer 401 (k) Retirement PlanPaid Days Off & Holiday PayTeam Member DiscountMeijer Scholarship Opportunities for Team Members and their immediate familiesLeadership Development Training OpportunitiesWhat are we looking for:18 years of age or olderDesire to work with customersPrevious retail or customer experience preferred but not requiredGood verbal communication skillsDetail oriented and organizedFriendly outgoing attitudeAbility to operate cashier register systemBe comfortable handling money and being responsible for itAbility to stand for long periods of timeAbility to lift, carry, push, pull, bend and twist while handling product *Premium pay begins 4/29/18 and ends 9/15/18"}