{"jobID": "2779370821", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.asml.com", "Headquarters": "Veldhoven, Netherlands", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (ASML) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Applied Materials, KLA-Tencor, Lam Research"}, "estimatedSalary": "165000", "jobDescription": "Data Scientist Location San Jose - CA, US Level Master Experience 0-2 Starter Functional Area Research & Development Electrical Engineering Mechanical Engineering Background Information Technology Physics / Mathematics Computer Science Travel Reference req2239IntroductionASML US, LP brings together the most creative minds in science and technology to develop lithography machines that are key to producing faster, cheaper, more energy-efficient microchips. We design, develop, integrate, market and service these advanced machines, which enable our customers - the world’s leading chipmakers – to reduce the size and increase the functionality of their microchips, which in turn leads to smaller, more powerful consumer electronics. Our headquarters are in Veldhoven, the Netherlands, and we have 18 office locations around the United States including main offices in Wilton, CT, Chandler, AZ and San Jose, CA.  We are proud of bringing together the brightest minds all over the world to tackle the most challenging problems in making faster and smaller chips. As part of our team, you will have the opportunity to go beyond yourself in developing more advanced techniques and push the technology boundaries.  ASML San Jose, CA is an industry leader in computational lithography for integrated circuits.　 Our Tachyon platform enables capabilities that address chip design, photomask making and wafer printing for semiconductor manufacturing and the LithoTuner platform enables lithography optimization for ASML’s leading photo lithography tools, known as ‘scanners’.Job MissionAdvanced Technology Development (ATD) Organization at ASML-Brion is looking for a data scientist who has a passion to build data products and data systems.  The ATD technology exploration team began to make the most use of a vast data acquired from our hardware and software products from 2014. As our vision expands, the opportunity to make important contributions to the company and to our customers through data analytics is also expanding. We seek a data scientist with practical experience in exploring big data opportunity at ASML-Brion. The Data Scientist will be responsible for utilizing disparate data sources in novel ways, with the aim of generating actionable insights. The insights can create new offerings or improve the capabilities, performance and efficiency of existing products and services throughout the company.Job DescriptionYou will work closely with individual team leads to formulate problem statements and work through the lifecycle of delivering these insights to production. You will design and organize large and complex data sets from varied sources, while thinking strategically about uses of data and issues such as scalability. You will deliver mathematical and statistical models with proven predictive power.　 Understand existing business flow and product features, dive into the underlying data, apply relevant data mining techniques and/or machine learning algorithms and propose data analytic product to improve the product intelligence.　Implement the applicable machine learning or statistics based algorithm for prediction and optimization and deliver the trained model to production.　Design, build, and support algorithms of data transformation, conversion, computation on Hadoop and other distributed big data systems.EducationPh.D. or M.S. of Computer Science/Engineering/Mathematics/Physics with experience of numerical modeling and simulation or equivalent experienceExperience-Familiar with popular machine learning techniques like neural network, SVM, random forest, etc.  -Experience in building machine learning models based real data using ML packages.  -Hands-on experience in data processing.  -Proficient in at least one of programming languages: Python, C++, Java.Personal skills-Familiar with different optimization algorithms.  -Experience with Hadoop ecosystem (HDFS, Spark, Hive, etc.).  -Experience with deep learning platforms (Tensorflow, Caffe, PyTorch, etc.).Context of the positionPHYSICAL DEMANDS AND WORK ENVIRONMENT  This position primarily works in an office environment. It requires frequent sitting, standing and walking. Daily use of a computer is required. May stand for extended periods when facilitating meetings.  The physical demands of the position described herein are essential functions of the job and employees must be able to successfully perform these tasks for extended periods. Reasonable accommodations may be made for those individuals with real or perceived disabilities to perform the essential functions of the job described.　Other informationEEO/AA (W/M/Vets/Disability) Employer"}