{"jobID": "2831147529", "jobLocation": "El_Segundo_CA", "jobTitle": "Battery Technology Scientist", "companyRating": null, "companyInfo": {"Website": "www.aerospace.org", "Headquarters": "El Segundo, CA", "Size": "1001 to 5000 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Requisition ID: 40252All Locations: El Segundo, CA (California) A trusted partner. A national resource. A leader in national security space. We are THE Aerospace Corporation. A team that takes pride in our readiness to solve some of the most complex technical challenges in existence. With challenges spanning clandestine to commercial, you’ll have the unique opportunity to work on projects that are literally evolving our nation&apos;s space and launch capabilities. We all share a common passion and aspiration – to serve a mission much bigger than ourselves. When you join our team, you’ll be part of a rare collection of thought leaders and game-changing innovators. Are you ready to launch your career?ResponsibilitiesThe Energy Technology Department's focus is to provide space and launch systems support including all cell and battery technologies. The department performs independent verification and validation of flight battery systems aboard spacecraft and launch vehicles. Our multidisciplinary staff provides technical oversight, research and development, satellite power system evaluation, acquisition, launch, and on-orbit operations. We provide laboratory capabilities and maintain strong links to the U.S. and international space battery community.Key FunctionsIndependently evaluates, selects, and applies engineering techniques, procedures and criteria, using judgment in making adaptations and modifications. Assignments typically have specified objectives. Contacts are primarily internal, with infrequent inter-organizational and outside customer contacts on routine matters.The candidate will provide scientific and engineering support as well as assist senior scientists and engineers in the research, testing, and evaluation of spacecraft batteries, solar cells and power systems.The successful candidate will be responsible for testing and analysis of spacecraft electrochemical cells and batteries.They will support senior staff in project design, research, analytical testing and evaluation.Candidate will be expected to perform analysis of cell and battery test data in order to provide technical assessments of the characterization and performance of the cell and battery system.Tests conducted will include performance characterization, life prediction, and failure analysis.This position can be filled as a Senior Member of Technical Staff or Research Scientist.QualificationsRequiredMaster's degree in a scientific related field with a minimum of 5 years of post-Bachelor's experienceExperience in physical chemistry, chemical engineering, material science or electro-chemistryExperience in nickel and lithium based chemistry for batteriesExperience using laboratory instruments, power supplies, software and data acquisition systems for computer test control systemsExperience in data analysis, use of data analysis tools and maintaining accurate test data recordsExperience taking direction from principle scientists and engineers as well as experience performing \"hands-on\" technical support for experiments and projectsExperience using Microsoft Office suiteAbility to travel as neededThis position requires the ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance. PreferredPhD degree in a scientific related field Three or more years of experience in Li-Ion battery science or engineeringKnowledge of programming languages (e.g., VB, C, C++, Labview, Java, Python)Experience with computer controlled automated test systemsRequirements for Research ScientistPhD degree in a scientific related field with 8 or more years of professional scientific or engineering experienceExperience in physical chemistry, chemical engineering, material science or electro-chemistryThree or more years of experience in nickel and lithium based chemistry for batteriesExperience using laboratory instruments, power supplies, software and data acquisition systems for computer test control systemsExperience in data analysis, use of data analysis tools and maintaining accurate test data recordsExperience taking direction from principle scientists and engineers as well as experience performing \"hands-on\" technical support for experiments and projectsExperience using Microsoft Office suiteAbility to travel as neededThis position requires the ability to obtain and maintain a security clearance, which is issued by the U.S. government. U.S. citizenship is required to obtain a security clearance. Preferred for Research ScientistPhD degree in Physical Chemistry, Chemical Engineering, Electro-chemistry or Material ScienceFive or more years of experience in Li-Ion battery science or engineeringKnowledge of programming languages (e.g., VB, C, C++, Labview, Java, Python)Experience with computer controlled automated test systemsPhysical RequirementsPerform general laboratory maintenance and safety dutiesSupport laboratory test equipment metrology practicesTranscript RequirementTranscripts are required for this position.Additional Requisition DetailsSystem Job Title: MEMBR-TCH STF SR Clearance Requirement: Secret Access: None Polygraph: None Relocation Available: Yes Employment Type: Regular Work Schedule: Full Time Company StatementThe Aerospace Corporation has provided independent technical and scientific research, development, and advisory services to national security space programs since 1960. We operate a federally funded research and development center (FFRDC) for the United States Air Force and the National Reconnaissance Office, and support all national security space programs. We also apply more than 50 years of experience with space systems to provide critical solutions to technologically complex systems in such areas as communications, shipping, law enforcement, and cyber, among others.From our inception, our highly skilled technical staff has focused on ensuring the success of every mission and developing the most effective and economic space-related hardware and software in the world. Our greatest asset is the technical expertise of our people. Our state-of-the-art laboratory facilities are staffed by some of the leading scientists in the world.Equal Opportunity CommitmentThe Aerospace Corporation is an Equal Opportunity/Affirmative Action employer. We believe that a diverse workforce creates an environment in which unique ideas are developed and differing perspectives are valued, producing superior customer solutions. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, gender, gender identity or expression, color, religion, national origin, sexual orientation, protected veteran status, or disability status.You can also review The Equal Employment Opportunity is the Law poster and the supplement, as well as the Pay Transparency Policy Statement."}