{"jobID": "2802559014", "jobLocation": "Boise_ID", "jobTitle": "Data Analyst - Technology Development", "companyRating": "3.6", "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": "50000", "jobDescription": "    Req. ID: 99041  Data Analyst   Job Description As a Technology Development (TD) Data Analytics Engineer at Micron Technology, Inc., you will be responsible for providing data collection, data analysis, and/or visualization solutions related to Fab operations, quality, variation, and yield to promote a data-driven benchmarking culture enabling TD to meet their strategic objectives in technology development and Micron’s position as a global leader in memory and storage solutions.     In this role you will interact and collaborate with several data systems, engineering, and manufacturing teams supporting all TD groups. You will interpret and communicate insights and analysis findings to operations and engineering teams. You will provide feedback and insight of partner requirements to the development teams creating new analytic tools. You be responsible for utilizing new and existing analytics tools to address process and product concerns from TD engineering teams as well as training them in their use. Your efforts will drive improvements to processes and enable TD to meet cycle time and transfer timelines.  Responsibilities and TasksPROVIDE ON-DEMAND DATA ANALYSIS OF ENGINEERING PROBLEM STATEMENTSMaintain an understanding of company and department strategies and goalsPartner with engineering teams to understand technology limitations and process gapsPerform data analysis and mining to help generate solutions to business and technical problemsUtilize analytics solutions created by the Data Science teams to address identified problems, enabling Technology Development to meet key cycle time and transfer schedule objectivesExplore relevant data through visualization and statistical methods   COLLECT, ORGANIZE, AND PREPARE DATA FOR ANALYSISCollaborate with stakeholders across Technology Development to develop best-in-class interactive experiences that meet the business objectives of the organization and advance our data visualization positioning and information-based decision makingWork with various volumes of data from multiple disparate sources and what is relevantManage and optimize data discovery, cleansing and integrityCollaborate with data architects (e.g. IS engineers, DBAs, Data Science) to ensure that data needed is availableDevelop and automate ETL jobs for various volumes of dataIdentify new data sources in the network that will create new insights to business needs   DRIVE DATA ANALYTICS SOLUTIONS TO ADDRESS BUSINESS OPPORTUNITIES AND VALUETranslate business problems into projects and solutionsUnderstand business processes (data sources and meaning)As required, provide feedback in analysis, design, statistical/model algorithm review, and testing sessions to the teams creating the analytics solutionsParticipate with developers on integration and user acceptance testing of data collection forms and analytics solutionsLearn to use data solutions and coach/mentor partner groups on data driven solutions and decision makingDemonstrate the functional and technical skills necessary to switch between various software, analysis and development technologies/frameworks, and merge them to provide the best solution   INTERPERSONAL COMPETENCIES:Deep interest and aptitude in telling stories with dataExcellent communication skills-both written and oralAbility to work through ambiguous situations to drive work product deliveryExceptional attention to detail and ability to progress multiple projects in parallelAbility to collaborate and build consensus for creative ideasMaintain a strong relationship with peer groups and leaders in other functional areasOffer and communicate strategic ideas and thinking to meeting TD objectivesBuild and maintain external and internal relationships to broaden influence and increase learning opportunitiesListen to customers and stakeholders input and feedback, and act to maximize benefit to Micron to meet corporate goalsKeep stakeholders and team members informed on project status, progress, roadblocks, and opportunitiesPromote world-wide knowledge sharing and transfer      AS REQUIRED, DEVELOP AND DELIVER TRAINING AND TRAINING MATERIALS ON CONTROL SYSTEMS AND RELATED TOPICS TO SUPPORT A TRAINED AND EFFECTIVE WORKFORCEPartner with Data Science and Engineering leadership teams to evaluate when analytics solution should be rolled out to a wider workforce instead of utilized by the Data Analytics teamWork with Workforce Development training group for internal training developmentDelivery of training / classesProvide overview information on available analytics solutions, enabling partner teams to understand the support availableOffer 1 on 1 support   Education Required Bachelor’s Degree  Computer ScienceApplied MathematicsStatisticsEngineering   Experience Required 2 years’ experience in any of the following:   Industry Experience    Qualifications Excellent customer service skills, an outgoing personality for working with several partner groups.Excellent verbal and written communication skills.Possess strong analytical, mathematical, problem solving skills.Capable of extracting data from any source.Proficient in at least one of Java, Python, NumPy, Perl, C/C++, SQL, NoSQL (Mongo DB, Hadoop, Cassandra), R, JMP, Machine/Statistical Learning, Tableau, Y3, DataNavigator, Teradata SQL, etc.Familiar with statistics (understand mean, sigma, p value, anova, regression, data mining concept, SPC, etc.) and willing to learn statistics extensively as an expert in the future.Passion for data analysis and delivering data solutions to help others make faster data driven decisions.Possess the ability to work in several areas of a development life cycle independently or as part of a team.Able to manage multiple projects and tasks concurrently.Self-motivated with the ability to work with minimal supervision.Active team participation, demonstrated teamwork, and consensus building skills.Experience working in a semiconductor manufacturing environment a plus. #LI-AD1  We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices.  Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters.  To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748).  Keywords: Boise || Idaho (US-ID) || United States (US) || Technology Development || Experienced || Regular || Engineering || #LI-CC2 ||   "}