{"jobID": "2675351718", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Computer Scientist, Research Lead", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": "Information Sciences Institute (ISI), a unit of USC’s Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina Del Rey, CA; one in Arlington, VA; and one in Waltham, MA. *This position is located in Marina del Rey, CA.* Information Sciences Institute (ISI) seeks a Senior Computer Scientist, Research Lead for its Artificial Intelligence division. Job Accountabilities:Develop, plan and pursue a research strategy, including funding opportunities.Plan and manage project finances, working with their supervisor and the business office when necessary. Alert ISI management in a timely manner to problems that are beyond their control.Recommend hires based on their goals, objectives, opportunities and funding. Recommend salaries, including raises, promotions, and reclassifications for people they may supervise.Successfully execute all research and administrative responsibilities associated with their awards.Contribute to the direction of the Institute through technical discussions and business development.Help ISI management identify strategic hires and other opportunities for growth in their area.Generates research ideas. Applies computer science principles and concepts in the planning, coordinating, and executing of research objectives. Contributes state-of-the-art technology and theories.Solves a wide-range of research problems in creative and effective ways. Selects methods and techniques for obtaining solutions.Writes articles for publication.Makes presentations at conferences, participates in workshops, and collaborates in specific areas of research.Stays informed of new developments and technologies by reading journals and other pertinent publications, maintaining contact with vendors, and participating in professional organizations, meetings and seminars. The University of Southern California values diversity and is committed to equal opportunity in employment.Minimum Education: Doctorate, Combined experience/education as substitute for minimum education  Minimum Experience: 5 years  Minimum Field of Expertise: Knowledge of research processes and computer science. Ability to take specific research problems, apply computer science principles, and derive solutions. May possess a specialized knowledge in one area such as linguistics, psychology, or physics, and be able to bridge the gap between that specialized knowledge and the physical constraints of machine architecture. Ability to interact with other project members in a positive and constructive manner to reach solutions to research problems."}