{"jobID": "2838072483", "jobLocation": "Houston_TX", "jobTitle": "Data Analytics&Solutions; Manager", "companyRating": "2.5", "companyInfo": {"Website": "www.murphyoilcorp.com", "Headquarters": "El Dorado, AR", "Size": "1001 to 5000 employees", "Founded": " 1907", "Type": " Company - Public (MUR) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Marathon Oil, Anadarko Petroleum, TOTAL"}, "estimatedSalary": "54000", "jobDescription": " At Murphy Oil Corporation, we believe the rich experiences and backgrounds of our employees strengthen our Company, create a productive workforce, and drive our success. We encourage you to apply for the positions for which you meet the qualifications.  Work Schedule: USA - 9 hrs / day - 4 hrs on Fri  Company: Murphy Oil Corporation  Division: Administration  Worksite: Houston - 0190  Location: Houston, Texas  Responsible for leading the department and key initiatives that support Murphy's enterprise data strategy and data analytics value chain. Plans and oversees critical technology programs focused on providing high-value data and advanced analytics capabilities to support business performance and decision making. Working in collaboration with data integrations and all Murphy applications, implements the strategy and roadmap for data and analytics platforms including Enterprise Data Reservoir (EDR), data science platforms, Spotfire, Microsoft BI, and Tableau (visualizations), Structured Data (SQL, Oracle), Semi/Unstructured Data (Hadoop), Superview Concepts (HANA), and Open Source technologies (Spark, Hive, Scala, Python), Cloud exposure (AWS, Azure), DevOps exposure (Jenkins, Docker, Maven, Ansible), and an understanding of ETL and API technologies (BAPI, API-Mulesoft).  This role will supervise a staff of data scientists/modelers/architects, business/reporting analysts, API (Mulesoft) developers and business intelligence developers comprised of both external (on-premise and offshore) and dedicated internal resources responsible for defining and implementing all core data and analytical platforms.  Collaborates with all IT departments globally to ensure delivery of solutions and integration with Murphy architecture and quality standards and provides a critical liaison role to Murphy's business developers and business embedded Data Science roles.  o Solid understanding of data management, data warehousing/lakes, and data analytics strategies and methods such as Inmon, Kimble, Data Vault, and Data Lake.  o Solid understanding of SCRUM or other agile methodologies  o Experience working with business leaders to develop strategies and execute programs delivering business value.  departments.  o Ability to communicate effectively at all levels of the organization (briefings, status reports, corporate communications, meeting facilitation, etc.)  o Proven ability to build and sustain excellent relationships, through clear and effective communication, with all levels of management across functions and time zones.  o Proven ability to influence, engage, and motivate direct and indirect reports, peers and clients and vendors in a matrix environment  o Minimum of 5 years of experience in managing IT projects and programs responsible for development and integration of data solutions with a minimum of 3 years of management/supervisory experience.  o Experience coordinating requirements and resolving conflicts with stakeholders from multiple departments.  Murphy Oil Corporation participates in the Department of Homeland Security U.S. Citizenship and Immigration Services' E-Verify program. Please read the E-Verify Notice-English / E-Verify Notice-Spanish and Right to Work Notice before proceeding with your job application.  For additional information, you may also visit the USCIS website.  Murphy Oil Corporation is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, genetic information, age, national origin, sexual orientation, disability, protected veteran status or any other category protected by federal, state or local law.  EEO is the Law Poster  EEO is the Law Supplement"}