{"jobID": "2722589300", "jobLocation": "Detroit_MI", "jobTitle": "Member Services Representative", "companyRating": "3.4", "companyInfo": {"Website": "www.rockconnections.com", "Headquarters": "Detroit, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Telecommunications", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": " Who We AreRock Connections is a growing strategic marketing company that helps clients increase their revenue from advertising dollars that they've already spent. Rock Connections primarily focuses on outbound contact center solutions, providing clients with everything from customer contact to call transfers to the full sale of goods, services and products. We're a proud sister company of Quicken Loans, America's #1 online mortgage lender, who has been rated one of FORTUNE Magazine's \"Best Companies to Work For\" for the past 10 years.What You'll Do/NeedWhen customers have questions or suggestions about a company's service or product, they turn to Member Services Representatives, or what we call Resoultion Specialists, for answers. Resolution Specialists provide specific information regarding the services, products or materials offered by a company. They answer phones, provide troubleshooting information, report and analyze customers' information and needs, issue billing details and open and close customer accounts. In summary, they are the direct link between a company and its existing and potential customers!  Qualified candidates for this position must have an appetite for excellence, outstanding communication and organizational skills, as well as the ability to readily build relationships over the phone! Additionally, a qualified candidate must be quality-focused, an effective team player and motivated to achieve a rewarding career within the organization. ResponsibilitiesAnswer inbound client service callsTransfer clients to the appropriate parties for assistanceUpdate and code member profiles to ensure the most up-to-date and accurate information is presentProvide clients with basic company information when askedPropose solutions to problems and utilize all available resourcesProvide clients with exceptional perceptions of our clientsRequirementsExceptional client service skillsExcellent verbal and written communication skillsStrong attention to detailA stable work historyA desire to learn and be part of a growing teamProficiency in the Microsoft Office suite What You'll Get Paid trainingStrong growth and leadership opportunitiesWhy We're Different Meet the anti-corporate culture of Rock Connections, where there's no daunting hierarchy, \"boss\" is a four-letter word, and if you work hard you're the one who will reap the rewards, both personally and professionally. More than any other place you'll work, we're dedicated to honing your skills, helping you grow and making sure you have plenty of fun while you're at it.  Rock Connections is an equal opportunity employer.Apply"}