{"jobID": "2709539344", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer / ETL Automation Developer (for healthcare analytics startup)", "companyRating": null, "companyInfo": {"Website": "www.1871.com", "Headquarters": "Chicago, IL", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Interested in being part of a small founding team, so you can see your direct impact on improving the healthcare industry? Want to be one of the rockstars building an innovative product from the ground up?  Validate Health is an early stage healthcare analytics company on a mission to improve accessibility to healthcare by enabling medical organizations to operate at stable and sustainable financial models. Validate was founded by a healthcare actuary from the largest medical records vendor who became a prominent thought leader in the transition to value based care and an alumnus from the U.S. Department of Health and Human Services serving as the healthcare data liaison between government and industry. Validate is now building its analytics platform that encompasses the accumulated wisdom of its experts and clients, in order to empower medical organizations to manage their own financial risk, while improving the clinical outcomes of their patients. We're looking for talented and driven contributors to join our team and be a part of this important moment in the healthcare industry.  As a Healthcare Data Engineer you will get to play a key role in the delivery of powerful data-driven products that enable sustainable value-based healthcare models.  ▪ Serve as the ETL expert for the company. Ingest, transform, cleanse and augment internal and external data assets.  ▪ Automate the processing of patient-level healthcare transactions, third party data sources and aggregated public health data.  ▪ Build algorithms for fuzzy matching, de-duplication and rule-based de-identification. Fully indulge your love for math, statistics and logical problem solving.  ▪ Leverage the main toolsets: Python, Anaconda stack (Jupyter Notebook, NumPy, Pandas, MatPlotLib/Bokeh, SciPy, Scikit-Learn), Postgres and several AWS services (EC2, RDS, S3, Lambda, Redshift).  ▪ Lead data modeling, database design and performance optimization. Write SQL for defining database objects and performing manipulations.  ▪ Continuously learn by investigating and adopting new technologies. Requirements ▪ BS/MS in computer science, math, statistics, engineering, or equivalent work experience.  ▪ 3+ years of full-time experience or demonstrated accomplishments in relevant subject areas.  ▪ Demonstrated mastery with Python and its data science ecosystem. Knowledge of other mathematics environments such as R, SAS, SPSS or Matlab is a plus.  ▪ Mastery of SQL, relational database optimization, stored procedures and data modeling. Familiarity with concepts used by ETL tools (such as SSIS, Informatica and Talend) is a plus.  ▪ Understanding of methods to ingest and process non-relational JSON and XML formatted data.  ▪ Experience with scalable cloud data services. AWS RDS and Redshift are preferred, but Azure or GCP are good too.  ▪ Familiarity with concepts used by ETL tools (such as SSIS, Informatica and Talend) is a plus.  ▪ Desire to be an expert in healthcare and passionate about making an impact in this field. Experience with healthcare claims and clinical data is beneficial. Understanding of HIPAA compliance is a plus.  ▪ Aptitude, attitude, curiosity and grit is what we care about. To that end, we are open to accepting candidates from non-traditional backgrounds. (Just tell us how your background prepares you for this position.)  ▪ Must be located in Chicago. Benefits ▪ We offer stock options, salary that grows with the company and health coverage.  ▪ You also get free lunch, coffee, drinks and beer. Friday happy hours.  ▪ Fun, energetic and rewarding learning environment.  ▪ Conveniently located in the Merchandise Mart in the Loop.  TO APPLY  ▪ Send in your latest resume to careers+1871@ValidateHealth.com  ▪ Write a note explaining what makes you particularly interested in Validate and this position specifically.  ▪ Feel free to include any links that you feel speak to who you are and your capabilities, such as to LinkedIn, GitHub, publications, blog or portfolio.  ▪ Add “VH Data Engineer via 1871” to subject line.  We value diversity and are an equal opportunity employer."}