{"jobID": "2818150041", "jobLocation": "Santa_Monica_CA", "jobTitle": "Quantitative Research Associate", "companyRating": "3.0", "companyInfo": {"Website": "www.wilshire.com", "Headquarters": "Santa Monica, CA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Check Into Cash, Speedy Cash, Ace Cash Express"}, "estimatedSalary": "108000", "jobDescription": " Wilshire Funds Management (FMG) is looking to identify candidates for an Associate position within its Investment Research Team. A division of Wilshire Associates, FMG is dedicated to provide innovative investment solutions in the areas of asset allocation, manager research, portfolio management, and risk management to clients. The Associate will conduct quantitative analysis to support various investment activities in the division. Specifically, he/she will contribute to the development of innovative investment strategies for systematic security selection, risk premia investing as well as for general capital markets research. The person will receive mentoring and support to help grow career expertise in the investment field, and he/she will be encouraged to pursue research ideas of interest with a creative thinking mindset. The individual will report to the Vice President in the Investment Research team within FMG. Key Responsibilities: (50%) Generating, communicating and testing original investment ideasReviewing cutting-edge researches in the industry or from the academiaDesigning capital asset market signals and back-testing signal implicationsCreating rule-based quantitative investment strategies(25%) Building systems to help quantitatively evaluate mutual funds, hedge funds and factor-based strategies across multi asset classes(25%) Developing asset allocation models, providing solutions to ad-hoc tasks, writing research white papers and presenting work resultsKnowledge, Skills and Abilities: Strong foundation in applied empirical analysis (experimental work in statistics, econometrics, and data science)Strong programming skills (proficient in at least one of Matlab, C++, R or Python)The ability to work effectively and productively in a collaborative team environmentThe ability to communicate clearly with colleagues and clients on various research topicsEducation and Experience: Ph.D. degree in mathematics, engineering, economics, finance, statistics, or other quantitatively focused programs preferred.Strong academic track record.1-3 years of experience in the financial industry preferred.Capital market experience a plus.Our Offer:An international, dynamic, entrepreneurial work environment.Competitive compensation package, including a bonus opportunity.3 weeks of vacation, 8 paid holidays per year.401(k)/Roth 401(k)/Medical/Dental/Vision insurance. Visit www.wilshire.com for additional company information.  Wilshire Associates Incorporated is an Equal Opportunity Employer, Minority/Female/Disability/Veteran.  Wilshire Associates Incorporated is an SEC registered investment adviser and required to track certain political contributions under Rule 206(4)-5. As such, you may be required to disclose your prior political contributions.  No phone calls please  PI102953621"}