{"jobID": "2836047825", "jobLocation": "Galveston_TX", "jobTitle": "Data Analyst / Data entry - Supporting an Avaya migration", "companyRating": null, "companyInfo": {"Website": "www.3coast.com", "Headquarters": "Webster, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Title: Data Analyst / Data entry - Supporting an Avaya migration  Job Number: SC15115  Duration: 12 months with possible extensions  Location: Galveston, TX Short Description: This person will analyze all telecom data collected during discovery and perform proper code entries in CommIT post migration for over 12,000 phones moving to the Avaya Aura platform. Complete Description: We are looking for someone with a strong foundation working with data and comfortable interacting with internal customers face to face or via phone. This individual will be proficient in utilizing Microsoft Office Suite with emphasis on MS Excel.  Work Schedule: Standard Monday - Friday, 8 am - 5 pm. During migration must be flexible to work nights and weekends. RESPONSIBILITIESAnalyze and verify all data acquired during the discovery phase of a project.Meet with department managers to review billing and acquire approval.Perform accurate data entry tasks into an online billing system.Have a working knowledge of Microsoft Office with an emphasis on Excel.Actively participate in the NEC to Avaya cutovers.Assist in customer training related to the features of Avaya phones.Define and update departmental telecommunications documentation.The employee is frequently required to stand, walk, and lift objects (up to 30 lbs. weight; up to 4 ft. height).QUALIFICATIONS:Required Experience: 6 months data entry experience  6 months experience in customer service or call center environment.  Clear communicator with exceptional people skills  Good organizational, troubleshooting and critical thinking skills.  Demonstrates proficiency in MS Office Suite with strong Excel experience.  Job Requirements  Title: Data Analyst / Data entry - Supporting an Avaya migration  Job Number: SC15115  Duration: 12 months with possible extensions  Location: Galveston, TX Short Description: This person will analyze all telecom data collected during discovery and perform proper code entries in CommIT post migration for over 12,000 phones moving to the Avaya Aura platform. Complete Description: We are looking for someone with a strong foundation working with data and comfortable interacting with internal customers face to face or via phone. This individual will be proficient in utilizing Microsoft Office Suite with emphasis on MS Excel.  Work Schedule: Standard Monday - Friday, 8 am - 5 pm. During migration must be flexible to work nights and weekends. RESPONSIBILITIESAnalyze and verify all data acquired during the discovery phase of a project.Meet with department managers to review billing and acquire approval.Perform accurate data entry tasks into an online billing system.Have a working knowledge of Microsoft Office with an emphasis on Excel.Actively participate in the NEC to Avaya cutovers.Assist in customer training related to the features of Avaya phones.Define and update departmental telecommunications documentation.The employee is frequently required to stand, walk, and lift objects (up to 30 lbs. weight; up to 4 ft. height).QUALIFICATIONS:Required Experience: 6 months data entry experience  6 months experience in customer service or call center environment.  Clear communicator with exceptional people skills  Good organizational, troubleshooting and critical thinking skills.  Demonstrates proficiency in MS Office Suite with strong Excel experience.  Job ID: SC15115-Project Data Analyst - A  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  3coast  To build lasting partnerships with clients by anticipating their needs and delivering innovative and differentiated business technology strategy, services and staffing solutions that drive business results. To foster a values-based culture where business success brings both personal and professional satisfaction, and people connect with each other in meaningful ways. To provide reward and recognition to employees for their contributions Contact Info Galveston, TXSally Culley"}