{"jobID": "2826005466", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.caci.co.uk", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " 1975", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Data Analyst ============ Req #: ******Location: Washington, DC USJob Category: Information  TechnologySecurity Clearance: DOJ MBIClearance Status: Must be  Obtainable Job Description The Data Analyst within the CACI Data Analytics lab is responsible for  providing data analytics support for projects related to  investigations and litigation cases. This includes supporting projects  from initiation to closure, developing deliverables and occasionally  serving as a primary point-of-contact for attorneys, investigators,  and case teams. Data Analysts integrate a wide variety of data types  and formats from primary and secondary sources through diverse  channels using a combination of methods that are researched and  employed by the Data Analytics Lab Management team. Data Analysts  develop, maintain, and enforce streamlined and efficient processes for  project lifecycles, from collection through transformation of data,  and assist senior staff in the creation and finalization of client  deliverables. Data analysts will occasionally manage the collection,  documentation, vetting and onboarding of data, including database  development and set up, and the loading of data into the appropriate  analytical tools. Must have the ability to guide and assist other team  members as required. POSITION SUMMARY: The data analyst is responsible for defining, developing, and  communicating data analytics solutions to support the customer. This includes:corresponding with key case personnel to elicit requirements and provide regular status updates, performing data analysis and modeling to understand and identify data relationships/trends/classifications/predictions, proposing reporting solutions that best present the information to the end user, and delivering the completed solution. This position requires strong analytical, problem solving, and  communication skills with a keen attention to detail. Additionally,  the problems and toolset are quite varied, and the candidate should  take the initiative to attack new challenges and learn new skills  independently. This person must be well organized and flexible. We  desire someone with diverse experience and skills in data analysis,  litigation support, statistical software, analytic programming  languages (Python, R, Java, SAS), visualization software, and database  management. RESPONSIBILITIES:Work with client case teams to identify their needs and jointly develop solutions through leveraging all available analytic and  visualization options Conduct regular consultations with clientsProvides regular status updates regarding assigned tasksEnsures successful completion of work, timeliness of deliverables, and quality control Build experience in all available analysis and visualization software QualificationsEDUCATION & EXPERIENCEBachelor s degree or equivalent; 3+ years of experience using analytics tools, methods, and visualization software Significant experience in one or more of the following tools isrequired:Tableau SoftwareIBM I2/EIAIBM Analyst NotebookDatabase (SQL Server, Oracle, PostgreSQL, MySQL)Programming and/or scripting (Python, R, Java)Natural Language ProcessingNeo4j or other graph databasesPalantir GothamNexidiaOther analytic and visualization toolsBackground in Law Enforcement, Data Science, Investigations, Data Analysis, Computer Information Systems, or Statistics Industry analytics/business intelligence knowledge including current industry trends, challenges, and data quality approaches Deep understanding of database, ETL, and analytics tools and concepts Must be able to work independently and prioritize work effectively, as well as to function as an effective team member in  a local and virtual team development environment Strong analytical and problem solving skills with an unsurpassed attention to detail Excellent communication (written and verbal) skillsExperience supporting federal agenciesSQL experience is requiredWhat We Can Offer You:We ve been named a Best Place to Work by the Washington Post.Our employees value the flexibility at CACI that allows them to balance quality work and their personal lives. We offer competitive benefits and learning and development opportunities. We are mission-oriented and ever vigilant in aligning our solutions with the nation s highest priorities. For over 55 years, the principles of CACI s unique, character-based culture have been the driving force behind our success.  Job Location  US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that  fuels innovation and fosters continuous improvement and success. At  CACI, you will have the opportunity to make an immediate impact by  providing information solutions and services in support of national  security missions and government transformation for Intelligence,  Defense, and Federal Civilian customers. CACI is proud to provide  dynamic careers for employees worldwide. CACI is an Equal Opportunity  Employer - Females/Minorities/Protected Veterans/Individuals with  Disabilities."}