{"jobID": "2791032608", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Business Intelligence Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.thereformation.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "115000", "jobDescription": "About Us: Reformation is a fast-growing company that is redefining fashion. We make killer clothes that don’t kill the environment and want our garments’ impact on the planet to be as low as possible. After all, there’s nothing less sexy than leaving a big nasty mess. Senior Business Intelligence Analyst At Reformation, data is the core of what we do. We are looking for a leader to drive our data and business intelligence strategy. This person will be designing and developing data systems as well as building automated reports for the purpose of tracking key sales metrics, sales and customer performance, forecasting, sales productivity and pipeline metrics. You will use your strong skills in data, business intelligence tools and report design to build best practice reporting & dashboards to increase efficiency and drive improvements in sales processes.  The Senior Business Intelligence Analyst will work with the BI tools including Big Query, Google Data Suite, and our CRM systems. This role requires an individual with technical background and understanding of sales reporting, sales analytics, data management, business intelligence solutions, superior communication skills and the ability to work and collaborate with key business partners. To be most effective, this person will need to be able to work both strategically and in the details. What You’ll Do:Own Company data analytics, reporting and data dictionaryProduce and deliver standardized and custom business intelligence dashboards to support business performance metricsSupport and develop data analysis frameworks that will support daily/weekly/monthly operational reporting and executive dashboardsEnsure consistent approach to sales reporting globally including report presentation, data consistency, communication and deliveryAnalyze and present data to high level decision-makers at the companyIdentify data requirements for specific project or report requests. Includes identifying data mapping and definitions required to fulfill requestsServe as the conduit between the business owners and the engineering teamWork with technology team upstream to ensure that systems are set up to capture business-impacting data; focus on data as a productWork with key business partners to understand dashboard requirements and determine consistent presentation method that will help with business needsDevelop and maintain data dictionary to ensure consistency across systems, reports and teamsUnderstanding of business intelligence tools and drive consistent usage and understanding of report delivery toolsUnderstand business drivers and strategic business vision and implement reporting solutions that support business requirements; have a keen focus on output and data visualization geared toward driving insight and actionTrain the trainers; teach company to self-serve using available data toolsWhat You’ll Need:Bachelor's degree5+ years of experience in BI, sales reporting and analyticsAnalytical, strategic thinker with vision, with the ability to execute on prioritiesAbility to effectively work under pressure and to meet challenging targetsStrong communication and presentation skillsStrong interpersonal and influencing skills, with the ability to build credible relationships with multiple functionsMicrosoft Excel Big Query, Google Data Studio SQL knowledgeAbility to identify and pursue new improvement opportunities in line with business plansRequires an excellent understanding of standard business practices related to Sales OperationsWho you are:You thrive in a fast-paced, results and team-oriented environment.You LOVE being hands-on and solving problems - you don’t see this as a task; it’s a passion.You have a passion for sustainability and want to be part of a team driving eco-goodness within fashion.You’re the type of team member who is willing to pick up slack and do the unglamorous tasks to help grow the company.Eager to be an integral part of the team that defines the culture of Reformation.Benefits & Perks:Health, vision, and dental insurance for eligible employeesPaid vacation, sick, holidays & volunteer time-off for eligible employeesMission based company + casual and entrepreneurial work environmentClothing discount, dog-friendly office, company events + parties and much moreTo Apply: Please submit your resume and a short cover letter telling us about yourself and why you are a great fit for Reformation! The Reformation is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, disability, or protected veteran status"}