{"jobID": "2836366337", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist 2", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "97000", "jobDescription": "All About UsAt Illumina, we apply innovative technologies for studying genetic variation and function, making studies possible that were not even imaginable just a few years ago. These revolutionary tools for DNA, RNA, and protein analysis are enabling rapid advances in disease research, drug development, and the development of molecular tests in the clinic.As a Scientist in Research and Technology Development at Illumina you will work in a dynamic, team-oriented environment and play a key role in creating the next generation of genomic tools. The position involves supporting the development of novel sequencing technologies through innovations in platform and sample preparation. You will be a key contributor to multidisciplinary teams developing and improving leading-edge technology platforms. A highly motivated and enthusiastic scientist with broad experience in instrumentation, molecular biology, and surface chemistry will be an ideal fit for this position.Tasks and Responsibilities:Design, develop and troubleshoot assays, chemistry and methods for monitoring interactions between molecules/biomolecules and polymeric materialsDevelop and implement tools, metrologies and test methods for the characterization of microparticles, polymers, hydrogels and other materialsGather, organize and analyze large data setsTroubleshoot and improve existing processes, tools and chemistries to create robust products and improve process performanceWork independently and within multi-disciplinarily project teams of scientists, engineers, programmers, and project coordinatorsEngage in clear and concise communication with colleagues and supervisors through oral updates, written reports and technical meetings.All listed tasks and responsibilities are deemed as essential functions to this position. However, business conditions may require reasonable accommodations for additional tasks and responsibilitiesRequired Skills & ExperiencePh.D. in Chemistry, Materials or Polymer Science, Biomedical Engineering, Physics or other related disciplineExtensive hands-on experience in one or more of the following disciplines: polymer chemistry, surface-mediated biochemistry, microfluidic assays, advanced materialsProven track record of creativity and innovation combined with the ability to complete complex tasks with minimum supervisionExperience with DNA sequencing, biochemical assays and molecular biology techniques.Experience in bio-conjugation and functionalization of advanced materials with molecules and biomolecules to modulate biomolecular reactionsHands-on experience in multiple techniques and methods for characterization of materials, surfaces, reactions and biomoleculesComfortable working in a fast-paced environment, setting and achieving goals independentlyMotivated, enthusiastic, hard-working, cheerful individual who wants to be part of a fast-paced and dynamic technology development TeamPreferred Skills & ExperienceBroad scientific knowledge on the fundamentals of materials science such as chemistry, physics, instrumentation set-ups, optics, thermodynamics, kinetics, spectroscopy.Bioinformatics, programming (Matlab, Python, Perl, R), and data analysis skills (such as DOE or other advanced statistical tools)Experience setting up and programming custom instrumentationSolid understanding of DNA and RNA enzymology including polymerases, nucleases, modification enzymes, etc. Experience developing and optimizing enzymatic processes. Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}