{"jobID": "2817571192", "jobLocation": "Southfield_MI", "jobTitle": "HR Coordinator (Regular-Full Time)", "companyRating": "4.0", "companyInfo": {"Website": "www.suncommunities.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Public (SUI) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Equity LifeStyle Properties, RHP Properties , UMH Properties"}, "estimatedSalary": "41000", "jobDescription": " We're looking for a customer service champion who has a passion for working with people! Our HR Coordinator will serve as a key resource by supporting various teams within the department, assisting new team members in the hiring process, and ensuring to provide excellent customer service. This is a great opportunity to establish yourself quickly in a fast-paced, new and exciting role! OVERVIEW As an HR Coordinator, you'll be responsible for providing administrative support to our recruitingï¿½team. You'll also play an important role in the success of the candidate experience for the onboarding of new team members. JOB DUTIESCoordinate new hire onboarding efforts through our electronic onboarding system and maintain regular contact with new hires to ensure completion of assigned pre-hire activities prior to scheduled start dates.Schedule interviews as needed.Attach notes, assessment results, and other pertinent documentation to candidate profiles in applicant tracking system.Initiate pre-employment test(s) and background screens.Design and post advertisements for open positions.Maintain eVerify process for new hires.Provide email, phone, and in-person support to employee and candidate requests.Maintain HR team’s social media sites including Twitter, Facebook, and LinkedIn.Assist with the maintenance of team member files.Work on various special projects related to recruiting.Provide general administrative support to recruitingï¿½team.Other duties as assigned.REQUIREMENTSBachelor’s degree in Human Resources or business-related field1-2 years administrative support experience1-2 years HR experience, preferredStrong computer skills with working knowledge of Microsoft Word, Outlook, and ExcelAbility to work independently as well as part of a teamAbility to multi-task and manage several projects simultaneouslyStrong organizational skills with ability to prioritize tasksAbility to handle sensitive data and maintain confidentialityBasic knowledge of HR functional areasExcellent verbal and written communication skillsHighly driven and goal-oriented with proven ability to meet established goals Apply"}