{"jobID": "2766775055", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst-CIVP5", "companyRating": "4.4", "companyInfo": {"Website": "www.e3federal.com", "Headquarters": "McLean, VA", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": " Civilian - E3s Civilian Division employees support clients across the Department of Commerce, Department of Justice, Department of Transportation, General Services Administration, National Institutes of Health, and more. We enable our employees to use innovative technologies, proven best practices, and efficient processes to provide exceptional service to our Federal clients. With careers in IT program management, acquisition and category management, shared services planning, and education and training, our employees can advance their careers, collaborate with their teams, and deliver excellent mission results.E3 Federal Solutions seeks Data Analysts to support the General Services Administration and work with a team of consultants and federal government stakeholders to support a program management office (PMO).  This role will directly support the Government PMO leadership with ongoing and future programs, research, business case development, stakeholder management, analysis and data collection, communication, and reporting needs to ensure effective PMO execution.  The Data Analyst will be responsible for the following: Produce and manage data including but not limited to, datasets tools, databases; spreadsheets, tables and other formats for data collectionCompile data and maintain information in various databasesResearch and transcribe data, run quality control reports, track unfinished reports, print reports, and distribute to appropriate partiesPerform office management duties, such as coordinate office activities to include scheduling meetings and maintaining calendars, manage incoming calls and visitors, and coordinate travel arrangementsRead, review and disseminate incoming correspondenceEstablish and maintain various filing and record management systemsDraft, proof, and process correspondence and other materialsResearch, compile, assimilate, and prepare confidential and sensitive documentsCollect and analyze data from completed Procurement Management Reviews (PMRs) and create reports, compile and analyze summary resultsBA or BS in related fieldMinimum 4 years of relevant experienceProficient in MS Office Suite applications (Outlook, Word, Excel, Access, Project)Ability to work with precision and accuracy in a fast-paced environmentAbility to be organized, detail-oriented, flexible, and dependableExperience working and interacting with high-level executives, public officials, and stakeholdersEffective written and verbal communication E3 Federal Solutions (E3) is an award winning Veteran Owned business specializing in helping Federal clients solve their most challenging business problems. Our motivated and technology-enabled workforce utilizes proven management and technical consulting practices and applies agile principles and data-driven decision making to enable our clients to better meet mission requirements. We create significant value for our clients by bringing subject matter expertise across the Federal marketplace in the disciplines of Acquisition Lifecycle Management, Program Management Support Services, Systems Engineering and Technical Assistance, and Facilities and Engineering Management. Excellence, Accountability, Community, Humility and Integrity are the core values of E3 as we become recognized leaders in the management consulting community as trusted partners to Federal agencies and to industry. We are an organization that offers both our employees and clients an exceptional experience; our culture is contagious, and we always maintain a genuine reputation.  As an Equal Employment Opportunity / Affirmative Action employer, E3 Federal Solutions (E3) is dedicated to making all employment decisions without regard to race, color, sex (including gender and transgender status), age, religion, national origin, disability, marital status, veteran status, registered domestic partner or civil union status, gender identity, medical condition, genetic information, sexual orientation, or any other protected status in accordance with applicable federal, state, and local laws. E3 hires and promotes individuals solely on the basis of their qualifications for the job to be filled."}