{"jobID": "2681729670", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Analyst, Scholarships & Enterprise", "companyRating": "3.9", "companyInfo": {"Website": "www.udacity.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": " Apply Now  Data Analyst, Scholarships & Enterprise  at Udacity  (View all jobs) Mountain ViewUdacity's mission is to democratize education. We're an online learning platform offering groundbreaking education in fields such as artificial intelligence, machine learning, robotics, virtual reality, and more. Focused on self-empowerment through learning, Udacity is making innovative technologies such as self-driving cars available to a global community of aspiring technologists, while also enabling learners at all levels to skill up with essentials like programming, web and app development. If you love a challenge, and truly want to make a difference in the world, read on!Udacity is looking for a Data Analyst who will (1) help shape and optimize enterprise training programs focused on cutting edge skills, (2) generate insights around how our students learn, and (3) inform and optimize our scholarships admissions processes. You will empower people around the world to expand their skill set and help leading companies leverage the latest technologies to develop powerful new products and services on a global scale.Responsibilities:Build dashboards and tools that provide insight around key metrics for our Enterprise and Scholarships teams, including enrollments, engagement, leading indicators, and more.Ad-hoc analysis and data modeling to understand and predict behavior trends, in order to optimize growth and engagementProvide organizational support to ensure data integrity, consistent data definitions, and efficient data storageCollaborate with cross-functional team members including product managers and software engineers to deliver compelling products/servicesQualifications:Background in applied math, computer science, statistics, or related technical field, and 3+ years of industry experienceApplied statistics skillsStrong data management skillsExperience with at least one scripting language (e.g. Python)Experience with relational databases and SQLWe are an equal opportunity employer and value diversity at our company. Women, people of color, members of the LGBTQ community, individuals with disabilities, and veterans are strongly encouraged to apply."}