{"jobID": "2821838549", "jobLocation": "Dallas_TX", "jobTitle": "Sr. Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.htrjobs.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client has an immediate opening for a Senior Data Scientist reporting to a Director of Advanced Analytics. This position performs data science functions in providing insights into customer behavior to enable decision making relating to promotions, events and marketing programs for all brands both in stores and online. Job DutiesLead data science projects independently while collaborating with team members and multi-organizational stakeholders.Perform hands-on advanced analysis in marketing science and business analytics on big data to promote growth and business developmentLeverage state-of-the-art data processing tools and/or analytical methodologies to drive improved decisionsSupport the team in development and/or implement various types of predictive models, natural language processing, segmentation strategies, optimization algorithms, and data mining analyses with a targeted result of increasing revenueJob RequirementsExperience in processing and performing multi-faceted analysis with customer/consumer behavior dataExperience in developing or enhancing models applying machine learning and artificial intelligence algorithms, statistical analysis, and natural language processingStrong coding skills in SQL; and Python, R, Julia, or Scala.Experience in working with distributed computing i.e. Hive, Apache SparkExperience in working with Unix/Linux environmentKnowledge of descriptive analytics and data visualizationExceptional standards for quality and strong attention to detailExperience with full lifecycle agile application development in supporting analytic requirementAbility to manage multiple projects and on-demand business requests simultaneously"}