{"jobID": "1888485983", "jobLocation": "San_Francisco_CA", "jobTitle": "Style Advisor", "companyRating": null, "companyInfo": {"Website": "www.knotstandard.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you interested in working with a fashion company powered by cutting edge technology and client interaction?  At Knot Standard, we build confidence in helping men look and feel anything but standard. We are committed to creating relationships, crafting custom high-quality products, and providing luxury experiences. We recognize that shopping and finding great fitting clothing can be a hassle for men. By combining state of the art technology and top-notch client interactions, Knot Standard makes this process easy and exciting.  Our Stylists have a strong affinity to luxury retail product, love working with people, and want to be part of a fast growing company. It is a hard work/high reward balance with industry leading compensation and benefits and bi-annual sales reward trips for high performance. We have three tiers of Stylists: Style Advisors, Senior Style Advisors, and Executive Style Advisors - based on experience and hitting sales goals. Our Style Advisors ultimately love what they do helping men look and feel their best every day. WHAT YOULL BE DOINGBecoming a menswear specialist based on our training & development of client measurements, fabric knowledge, customizations, alterations, and sales psychologyProactively building a book of clients through different prospecting efforts (outreach, events, etc.) and building upon recurring client relationshipsSetting appointments and meeting with clients in our showrooms to conduct personalized wardrobe planning for both casual and professional looksPersonally guide clients through the experience, taking measurements, and helping them sort through different fabrics, collar types, pockets, buttons, embroideries, and every detail that goes into ultimately hand crafting a one-of-a-kind custom garmentMaintaining personal relationships with our most exclusive clients from their first interaction with Knot Standard through purchase, delivery and ongoing ordersWorking with production team to improve service, order delivery, and product releasesWHAT WERE LOOKING FORExcellent client relationship skills (new business development, sales, client facing roles)Prior affiliation with successful customer-facing businesses, preferably in the luxury industry; having a natural ability to connect with clients and comfortably handle all personality typesStrong eye for detail & organizational skills. As a custom menswear company with customizations, measurements, and custom client experiences - it's all in the detailsExcellent communication & interpersonal skills; written and verbal, handling yourself with confidence internally to peers and externally to clientsIndependent decision making skills with the ability to self-manage; whether it be your book of business, or employee growth and developmentProficiency with technology and Excel ability to navigate and create basic formulasWHO YOU AREEnjoyable, personable, optimistic, and a team playerPassionate about the menswear industry and creating confidence with luxury clothingComfortable with being uncomfortable. In a high growth company, this is the only way we can learn from each other and improveAn entrepreneurial spirit - you take initiative to get things doneDriven to be involved and network, We are passionate about what we do, and what we do as a company, ultimately spreading the word and helping us grow as a businessContinually curious. With being a part of a competitive market, current and emerging trends, and having over 8,000 fabric swatches on file that can create endless customization combinations, youll always be learningResults-oriented with the ability to balance other business considerationsTenacious - you set goals and push yourself to achieve them (and sometimes beyond)WHO WE ARE In the current experiential economy, shoppers dont simply want to come to the retail theater and watch from the audiences seats. They crave to get up on the stage and become the star in the show that unfolds. And that is exactly the retail theater experience that custom menswear brand Knot Standard gives its customers. Forbes 2017 Knot Standard is a custom menswear company headquartered in New York City. Since 2010, our company has continued to expand to new markets, but our mission remains the same; to consistently offer premium service, selection combined with tradition and classic tailoring, for our client and his personal stylist to create the lifestyle our customer desires. We actively strive to build upon our pool of shared knowledge as Knot Standard attracts top performers from a variety of global industries; sales, fashion, technology, finance, fitness, and more.  We have seven appointment-only showrooms located in New York, Chicago, D.C., Houston, Austin, Dallas, and San Francisco; an online studio at KnotStandard.com, and two store-in-store concepts at Bloomingdale's on 59th St in New York City and in Bloomingdales Chicago. WHY YOU WANT TO WORK HEREOpportunity to be a part of a company powered by technology and client interactionCompensation is a mix of base salary, generous commission, and bonus, depending on experience high income potentialRewarding incentives for achieving your sales goals (bi-annual Sales Reward Trips and more)We professionally and personally invest in our employeesComprehensive benefits package, in addition to employee discount and fitness partnershipsIndustry related training, development, and mentorship from our team We look forward to learning about you! Please be sure to include a cover letter when applying."}