{"jobID": "2812259735", "jobLocation": "Chevy_Chase_MD", "jobTitle": "Data and Research Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.urc-chs.com", "Headquarters": "Bethesda, MD", "Size": "51 to 200 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " FHI 360, John Snow, Inc, RTI International"}, "estimatedSalary": "46000", "jobDescription": "University Research Co., LLC (URC) URC is a global company dedicated to improving the quality of health care, social services, and health education worldwide. With a non-profit affiliate, the Center for Human Services (CHS), URC manages projects in over 45 countries, including the United States.  Established in 1965, URC offers a range of technical assistance to strengthen health and social systems and service quality by empowering communities and health workers to identify and scale up locally appropriate solutions to critical problems. Internationally, we expand access to and improve the quality of services addressing maternal, newborn, and child health; infectious diseases, including HIV/AIDS, TB, and malaria; reproductive health and family planning; food and nutrition; and vulnerable children and families. In the US, we focus on improving communication related to issues like substance abuse, with a particular focus on reaching underserved populations.  URCs mission is to provide innovative, evidence-based solutions to health and social challenges worldwide. Please join us in carrying out our mission (http://www.urc-chs.com/). Project Overview: The Developing MCC-specific approach to Social and Behavior Change Communication in Multiple Sectors project will support MCC to conduct formative research, develop sector-specific SBCC tools, collect and analyze data to identify priority behaviors for change and conduct due diligence of proposed behavior change interventions. Activities will be carried out in multiple countries and internally within MCC. Initially, activities will focus on two countries and two sectors: Sierra Leone WASH and Morocco Education. Additional countries and sectors may include: Land in Morocco, Education in Cote dIvoire, and Energy in an additional MCC partner country. Roles and Responsibilities: The Data and Research Analyst will be responsible for the following:Support formative research to develop country- and sector-specific data collection tools which will lead to the identification of several priority behaviors with suggested solution pathwaysInterpret data and analyze results using statistical techniquesDevelop and implement data analyses, data collection systems and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintaining databasesIdentify, analyze, and interpret trends or patterns in complex data setsFilter and clean dataWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesRequired Qualifications:Masters Degree in a Social or Behavioral Science fieldExpertise with qualitative and quantitative methodsExpertise in quantitative and qualitative data software (i.e. Stata, Nvivo, MaxQDA, etc.)5 or more years of experience with data and research analysis5 or more years of experience working on international projectsDemonstrated experience summarizing and sharing the results of data analysisExcellent verbal and written communication skillsProficiency in French or Arabic strongly preferredURC is an E-Verify EmployerURC is proud to be an Equal Employment Opportunity employer. We value and seek diversity in our workforce."}