{"jobID": "1731123774", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Data Quality Analyst (Business Support Consultant II)", "companyRating": "3.9", "companyInfo": {"Website": "www.consumersenergy.com", "Headquarters": "Jackson, MI", "Size": "5001 to 10000 employees", "Founded": " 1910", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Job Title: Data Quality Analyst (Business Support Consultant II) Location: Grand Rapids Functional Area: Information Systems / Technology Employment Level: Professional (Non-Supervisor) Requisition #: 50872244 Apply By: 02/17/2016 Department Summary The primary responsibility of the Technical Business Support Consultant II is to provide analytic and strategic support to the Consumers Energy Business Center, located in Grand Rapids. This position provides advanced analytics and insights into multiple data sources in addition to supporting marketing strategies, communications, business plan deployment, business process changes, and other initiatives to recognize Business customer behavior, enhance business quality/effectiveness and support Corporate Breakthrough Goals. This position is one of a cross-functional strategist, acting as a conduit between IT and the rest of the business. The role focuses on bridging the gap between the technology teams and business teams. While not necessarily IT, this position understands the nuances, and, understands the business needs -- transforming disparate operational data into actionable insights that both the business and IT can understand. Job Description/Responsibilities Eliciting/Gathering Client Analytic Reporting Requirements: This position is responsible for defining the reporting requirements (functional) and the reporting systems (non-functional) that meet the Business users needs to perform specific reporting. This includes; requirements, scope, technical dependencies and resource allocation to achieve the clients objectives. (complex) Activities include: Support of Problem Identification this position is integral in fully understanding the clients data quality/reporting issues and challenges. Support Documentation of Quality Issues - this activity is handled through meetings (interviews) and gathering of supporting documentation (data). Support of Identifying Solutions - This position will perform advanced analytic tasks associated with investigation of our business to business customer relationships. The tasks will be expected to be performed independent of detailed guidance and instruction beyond an articulation of the end state goal. The position will elicit business to business customer relationship requirements using interviews, document analysis, requirements workshops, surveys, site visits, business process descriptions, use from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs. Leading oversight of customer data maintenance (complex) Activities include: Assisting in the Data Identification this position must have an intimate knowledge of where data is stored (both Front Office and Back Office applications with SAP), and how to best retrieve data for problem solution. All qualified applicants will not be discriminated against and will receive consideration for employment without regard to protected veteran status, disability, race, color, religion, sex, sexual orientation, gender identity or national origin. Knowledge and expertise of Business Objects/Business Intelligence a plus but not required. Presentation of Solutions This activity concerns recommendations for the maintenance of Business customer data and the documentation of the changes for shared organizational knowledge. This will require collaboration with other team members and internal clients (Business Center) on data issue resolution. Requirements/Qualifications Responsible for participating in cross-functional business & technology projects, including: project planning, project execution, project monitoring & controlling, project team oversight & leadership, research & analysis, and communications. Intimate knowledge of SAP and Fieldnet Demonstrated proficiency with Microsoft suite of products including Access, Word, Excel and Powerpoint Ability to understand and translate business data quality issues into actionable informational solutions. In-depth understanding of business systems and customer data Demonstrated critical thinking and inductive reasoning. Ability to determine the interrelationships between data solutions and client requirements. Ability to think analytically. Should be a problem solver. Ability to interact with internal and external customers to identify, research and analyze situations and relationships to resolve highly advanced problems. Knowledge and/or experience in utility practices and procedures. Excellent communication and facilitation skills (both with internal and external clients) Project design and management experience 4+ years minimum experience College degree in Business, IT or related fields. Company Overview Join a diverse and dynamic team that makes and delivers the most valuable services in the world: electricity and natural gas. At Consumers Energy, our customers are at the heart of everything we do. Our employees work around the clock to provide service to our customers in honor of our history and to fulfill our promise to Michigan - Count on Us! Consumers Energy, the principal subsidiary of CMS Energy and headquartered in Jackson, Michigan, provides natural gas and electricity to nearly 6.8 million of the Michigan's 10 million residents in all 68 Lower Peninsula counties. All qualified applicants will not be discriminated against and will receive consideration for employment without regard to protected veteran status, disability, race, color, religion, sex, sexual orientation, gender identity or national origin."}