{"jobID": "2788615893", "jobLocation": "Chicago_IL", "jobTitle": "Senior Scientist, Human Genetics", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "122000", "jobDescription": "The Genetics Research Center (GRC) is a newly created center of excellence for genetics and genomics that supports both Discovery and Development. The GRC will play an integral role towards our goal of developing world class genetics and genomics research, focusing on finding the right targets and helping us better understand not only human disease biology but also the behavior of and response to our drugs in clinical trials. As one of the pillars of the GRC, the Department of Human Genetics is responsible for analyzing and interpreting data from large genetic sequencing databases to identify and characterize novel targets for the treatment of diseases across multiple therapeutic areas. We have an exciting opportunity for a Senior Scientist, based in North Chicago, IL reporting to the Head of Human Genetics and Clinical Genetics. The level is commensurate with experience.Key Responsibilities Include:Devise and execute studies to determine genotype-phenotype relationships from large, human sequencing databases; work with computational biologists and others to develop and provide analytical support for mining and interpreting NGS and array data across multiple projects.Provide biological interpretation for genetic, genomic and epigenetic associations derived from large scale human genetic sequencing databasesCollaborate with Functional Genomics Group to design and execute studies to provide mechanistic understanding for genotype-phenotype relationshipsCollaborate with scientists across different Early Discovery therapeutic areas to interpret and incorporate genetic findings into new targets or for validation of existing targetsProvide support for external collaborations and consortia involving human geneticsBasic:The ideal candidate should have strong background in genetic association studies, rare disease analysis, and family based genetic studies. Candidates should have demonstrated ability to design and lead human genetics studies delivering novel genetic findings and medically relevant gene discoveries.BS, MS,MD, or PhD in Human Genetics, Molecular Genetics, or closely related field, with expertise in genetic association studies, rare disease analysis, and/or family based genetic studies. 12+ (BS), 10+ (MS), or 4+(Ph.D/MD) years of relevant experience. Experience working with large human genetic sequencing databasesExperience interpreting family-based and rare disease genetic studiesExperience with large-scale research projects involving next generation DNA sequencing data (e.g. whole exome and whole genome) as well as array based genotype dataStrong oral and written communication skills in a collaborative environmentKey Leadership Competencies: Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performanceLearns fast, grasps the ‘essence’ and can change the course quickly where indicatedRaises the bar and is never satisfied with the status quoCreates a learning environment, open to suggestions and experimentation for improvementEmbraces the ideas of others, nurtures innovation and manages to reality If applying to position via mobile device, you may be required to access PingID.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}