{"jobID": "2765823188", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst - Assurance", "companyRating": "3.7", "companyInfo": {"Website": "www.ey.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deloitte, KPMG, PwC"}, "estimatedSalary": "68000", "jobDescription": "Join our Core Business Services (CBS) team and you will help support the important business enablement functions that keep our organization running strong. As a CBS professional, you will work across teams to provide the knowledge, resources and tools that help EY deliver exceptional quality service to our clients, win in the marketplace and support EY’s growth and profitability. Major teams within CBS include Finance, Information Technology, Human Resources, Enterprise Support Services, Brand Marketing and Communications, Business Development, Knowledge and Risk Management.  With so many offerings, you have the opportunity to develop your career through a broad scope of engagements, mentoring and formal learning. That’s how we develop outstanding leaders who team to deliver on our promises to all of our stakeholders, and in so doing, play a critical role in building a better working world for our people, for our clients and for our communities. Sound interesting? Well this is just the beginning. Because whenever you join, however long you stay, the exceptional EY experience lasts a lifetime..Job Summary:Americas Assurance Business Analytics is an internal group that focuses on the development of the firm’s analytical capabilities to create models and provide business insights into different aspects of the audit practice like staffing needs, quality controls and others. The key client is the Americas Assurance Professional Practice group which delivers technical consultation and assistance on complex and sensitive financial reporting matters to our audit professionals.  The Senior Data Analyst is a part of the Business Analytics team and is responsible for the database management and data work to support data analytics and reporting related to the business and quality aspects of the firm’s audit practice. The Analyst will work with the team to further develop team’s database architecture, ETL processes, and firm’s reporting capabilities to improve our audit process. Key Responsibilities: · Support the team on the data sourcing, building, cleansing, validating and reporting  · Take ownership of technical side of the data building team and their quality control processes  · Maintain database performance; implement new releases; complete database maintenance requirements  · Recommend solutions by defining database physical structure and functional capabilities, database security, data back-up, and recovery specifications  · Responsible for database design and architecture including schemas, tables, views, and procedures  · Actively engage with the business and the team to create reports, dashboards and enablers (currently using SQL, Excel VBA and Tableau)  · Work mostly in SQL, R, SAS, and Excel VBA to satisfy ad-hoc requests  · Gain an understanding of the business, firm’s policies and the team’s processes and make recommendations accordingly  · Apply process and technology enablement knowledge to analyses and problem solving  · Use sound judgment and consistency in providing measurement results  · Supervise junior staff on the team  · Leading a team through large data warehouse transition  · Stay up to date on best practices within the field of data and database management and how to apply the modern database management, efficient data manipulation, and data validation techniques to ensure integrity and efficiency  · Identify, explain, and reconcile risk in the team’s current database practices and procedures  · Drive change within the team’s database structure, data validation and reporting practices to achieve efficiencies, transparency and risk mitigation  · Understand the needs of different (and consequences to different) end users when applying updates and changes to database architecture  · Ability to explain the ramification of decisions to both the technical and non-technical data users  · Understanding the threats and opportunities the profession and the firm is facing  · Some travel involved (not more than 25% of time)  · Extended hours often required To qualify, candidates must have: · Expert SQL skills (including SSIS)  · Advanced Excel skills  · Detail oriented  · Tableau (Preferred)  · VBA (Preferred)  · Comfortable in a rapidly changing environment, with competing and shifting priorities  · Strong communication skills needed to work with team members in other locations and to present analytical content to team leaders  · Strong project management skills and experience  · Interpersonal skills to partner with other departments and various management levels in the firm  · Master’s degree in Information systems or a related discipline required  · Minimum of 5-7 years of relevant work experience working with SQL Server Join us in building a better working world. Apply now.Join us in building a better working world. Apply now. EY, an equal employment opportunity employer (Females/Minorities/Protected Veterans/Disabled), values the diversity of our workforce and the knowledge of our people.  EY, an equal employment opportunity employer (Females/Minorities/Protected Veterans/Disabled), values the diversity of our workforce and the knowledge of our people."}