{"jobID": "1789101750", "jobLocation": "Gold_River_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.ptpinc.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About UsWe are a growing company with a solid customer base, excellent compensation and benefits, and a collaborative yet flexible work environment. If you enjoy challenging projects, using new technologies to deliver innovative business solutions, and you're interested in working for an entrepreneurial company, we may have a home for you.PTP is looking for a Data Scientist to join our Customer Experience practice. At PTP, we value aptitude and creativity as well as experience. We are a diverse organization and are looking for bright, passionate and committed professionals who strive to be the best at what they do.ResponsibilitiesUse machine learning techniques to create scalable solutions for business problemsAnalyze and extract key insights from rich stores of customer dataImplement highly innovative models for predictive learning for applications like recommendations and targetingEstablish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementationResearch and implement novel machine learning algorithms for new business problemsRequirementsPhD. in Computer Science with a focus on machine learningTrack record of having developed novel machine learning algorithms, SIGKDD/ICML/NIPSHands-on experience in predictive modeling and analysis over large volumes of dataStrong problem solving abilityStrong programming skills in C/C++ or JavaExperience with R/SAS/SPSSExperience with SQL and MPP databasesExperience with large scale distributed programming paradigms – experience with the Hadoop stack(HDFS/MR/Pig/Hive)Familiarity with AWS and other cloud-based technologies that can be used with large mapReduce effortsExperience in free-text analytics / natural language processing (NLP)Excellent written and verbal communication and skillsCompensation is DOE and is extremely competitive."}