{"jobID": "2574494585", "jobLocation": "San_Francisco_CA", "jobTitle": "Signal Processing and Data Analysis Scientist", "companyRating": null, "companyInfo": {"Website": "www.sano.co", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a Signal Processing and Data Analysis Scientist to be a part of the team that designs, implements, tests algorithms and conducts data analysis for Sanos novel sensor platform focused on continuous body chemistry monitoring. What you'll be doing:Mathematically model complex, stochastic physical phenomena associated with a wearable electro-chemical bio-sensor which is used for real-time, physiological analyte estimation.Develop new and improve existing signal processing algorithms for bio-sensor anomaly detection and correction.Implement new and existing proof-of-concept algorithms (for basic analyte tracking, subsequent real-time inference of user state, identification and estimation of meaningful, long and short-term metrics associated with user health) in production-quality, cloud-based software.Contribute to the design of experiments intended to isolate error sources. Statistically analyze the impact of errors on performance.What you'll bring:Experience in statistical modeling, time-series analysis, and signal processing (i.e., digital filtering, spectral analysis, probability, multi-dimensional random processes).Expertise using variety of classical and modern methods of statistical inference and learning (i.e., regression, point and interval estimation, hypothesis testing, classification, Markov-modeling, clustering) for solving practical problems.Expertise in Python (pandas, numpy, scipy, matplotlib) and best-practices methodologies (i.e., revision control, test-based development).Excellent written and verbal communication skills.Systematic thinker who displays a blend of theoretical rigor and practical, deadline driven task completion.Masters or Ph.D. in Engineering, Physics, Computational biology, Mathematics, Statistics or related field required with 8+ years of direct, relevant industry experience.Sano - Driven by the desire to understand the human body."}