{"jobID": "2589416909", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.novetta.com", "Headquarters": "Mc Lean, VA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Digital Reasoning, Unisys, Booz Allen Hamilton"}, "estimatedSalary": "112000", "jobDescription": " Are you passionate about solving challenging problems?  Do you thrive being a critical part of an elite team of like-minded people?  How would you like for your next career move to take you to the next level?  If any of this sounds appealing, look no further. Job Description: Candidate must collaborate with cross-functional team to deliver software and analytics directly to the customer. They will develop statistical and predictive models using software such as Apache Spark MLlib, Python, and/or R. They must deliver features with an agile iterative process. Will work with cloud and big data technologies including: Elasticsearch, Hadoop, AWS, C2S, and others. Basic Qualifications:Bachelor’s in Computer Science, Information Technology, or related field, or equivalent experience (post-graduate degree preferred)Proficient with data science software tools, such as Apache Spark MLlib, Python, and/or RDesired Skills:Experience with software development, particularly using JavaExperience working with visualization tools, such as D3.jsExperience working with JavaScript frameworks, such as jQueryExperience working with GIS tools and frameworks, such as GeoTools, GeoServer, PostGIS, and KMLAny experience working with text processing tools and techniquesDesire to learn new technologies and tools and willing to share your experience with the teamExperience in the Intelligence CommunitySo what does Novetta do? We focus on three core areas: Cyber, Entity, and Multi-Int Analytics. Our products are focused on processing and analyzing vast amounts of data in these core areas. Our services are focused on helping our customers move from complexity to clarity. At Novetta, we bridge the gap between what our customers think they can do and what they aspire to achieve. Our culture is shaped by a commitment to our Core Values:Integrity: We hold ourselves accountable to the highest standards of integrity and ethics. Customer Mission Success: Customer mission success drives our daily efforts—we strive always to exceed customer expectations and focus on mission success beyond contractual commitments. Employee Focus: We value our employees and demonstrate our commitment to them by providing clear communications, outstanding benefits, career development, and opportunities to work on problems and technical challenges of national significance. Innovation: We believe that innovation is critical to our success – that discovering new and more effective ways to achieve customer mission success is what makes us a great company.  Get a referral bonus for the great people you know! With our amazing referral program, you could be eligible to win outstanding rewards for referring qualified new hires to Novetta. Novetta is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law."}