{"jobID": "2799443371", "jobLocation": "Frisco_TX", "jobTitle": "Product Management Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.fiserv.com", "Headquarters": "Brookfield, WI", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (FISV) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " FIS, Jack Henry & Associates, NCR"}, "estimatedSalary": "126000", "jobDescription": " Position DescriptionWhat does a great Product Management Data Analyst do? As a Product Management Data Analyst, you equip and enable the organization with relevant business data that facilitates smartly focused programs to optimize revenue growth and client value. In your role, you will contribute to the success of the team and organization by leading pricing analysis projects in support of a broad scope of products delivered to credit unions. In addition, you will use your senior analytical abilities to lead and develop team projects in support of long range strategic planning, annual account operating plans, market opportunity attainment programs, and ad hoc product management data analysis.  - Collect, evaluate, and analyze product and market performance data to support and drive future business planning decisions  - Build pricing models to estimate financial outcomes of a product/service and assess performance against business goals  - Develop strategic insights about the market and competitive landscape that find opportunities for business growth  - Influence senior and executive leaders with pricing and data analysis  - Build presentations based on a variety of data analyses and deliver to internal partners  - Lead time-sensitive, executive-driven projects and ensure that deadlines are met  - Dedicatedly develop cross-functional relationships with business units within and outside of supported departments  - Effectively communicate and present findings through written and oral reports  - Lead and direct ad hoc reporting/projects to meet the needs of the business Required qualifications for consideration: - Bachelors Degree in Business, Finance, Marketing, or Product Management and/or equivalent required.  - 7+ years in data management and analysis with 3+ years of pricing analysis  - Experience in the financial services and banking technology industries is helpful  - Business/competitive analysis experience is a plus  - Applicable experience with market and value-based pricing models  - Knowledge of and proven experience in business analysis and reporting methods  - Position requires advanced skills in Excel and strong working knowledge of Microsoft Office applications (PowerPoint, Word, Outlook, SharePoint) Preferred qualifications for consideration: - Excellent interpersonal skills and confidence when communicating with executives  - Strong data modeling and analysis capabilities to allow executives and staff to simply understand complex concepts and understand the benefits and risks of available choices  - Self-starter able to take limited direction and build out high quality analysis and plans in a timely manner  - Ability to lead team efforts  - Ability to quickly understand disparate data points and tie together for significant analysis  - Highly inquisitive with dream to learn and chip in to group success. Fiserv is an Equal Opportunity Employer/Disability/Vet. Fiserv is an Equal Opportunity Employer/Disability/Vet. Visit http://www.careers.fiserv.com/eeo for more information."}