{"jobID": "2808199852", "jobLocation": "San_Francisco_CA", "jobTitle": "Intacct Senior Consultant – Technology Practice", "companyRating": "4.8", "companyInfo": {"Website": "www.crosscountry-consulting.com", "Headquarters": "McLean, VA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " MorganFranklin Consulting, Slalom, Deloitte"}, "estimatedSalary": "111000", "jobDescription": "CrossCountry Consulting’s Technology practice is quickly growing, and we are seeking talented professionals to join our office in the San Francisco Bay Area. Being part of our Technology practice is a unique opportunity to join a Practice that strives to provide a better experience for our premier commercial clients and our team. We combine the nimbleness of a boutique firm with the capabilities and stability of a Big 4 consulting firm. Our core values in action empower personal and professional development through excellence, collaboration, energy and impact. You can find out more about our award-winning firm on www.crosscountry-consulting.com and Glassdoor.Responsibilities Help clients navigate the selection, transformation, implementation and configuration of IntacctExperience and expertise in implementing one or more modules within a Financial System such as General Ledger, Billing, Receivables, Procurement, Payables, Expenses and Asset ManagementProvide clients with necessary functional/technical aptitude to configure the product to meet business requirements and design specificationsAssist Managing Consultants on projects toPrioritize clients interest and proactively listen to ensure that work exceeds their expectationsImplement performance improvement and cost-reduction initiativesContribute beyond client delivery with practice development, knowledge transfer, operational improvement and recruitingQualifications 2+ years of industry and/or consulting experienceFunctional/technical proficiency with implementation of at least one module within a Financial System solution (i.e. Intacct, SAP, Hyperion, etc.)Finance or accounting background with knowledge of Balance Sheet/General Ledger/Sub-Ledger concepts preferred (Chart of Accounts, Journal Entries, Intercompany transfers and allocations, AP, AR, trial balance data, General Ledger, Billing, Procurement, Expenses, and Asset Management)Experience in designing and facilitating setup and configuration of one or more modules (General Ledger, AP, AR, trial balance data, Billing, Procurement, Expenses)Experience working to develop and format data to meet the export/import requirements as defined by system rulesStrong leadership skills with the ability to foster an environment of collaboration and excellenceExcellent verbal and written communication skillsAbility to learn technology quickly through instruction and self-trainingStrong attention to detail with the ability to think from a “big picture” perspectiveCreativity, confidence, flexibility and a great sense of humorBachelor’s degree (or higherCrossCountry Consulting is the trusted partner and expert advisor to leading organizations that are dealing with pressing business needs. We help our clients transform their finance, accounting, operations, risk, and technology functions in order to effectively prepare them for complex change, optimized performance, and accelerated business growth. Our consultants work collaboratively with our clients to provide customized solutions to our clients’ specific and ever-changing needs.CrossCountryConsulting is built on the fundamental principles of dynamic growth and shared values. Our culture reflects an environment that nourishes and promotes excellent client service, team collaboration, and individual advancement."}