{"jobID": "2639483825", "jobLocation": "San_Francisco_CA", "jobTitle": "Licensed Insurance Agent", "companyRating": null, "companyInfo": {"Website": "www.healthmarkets.com", "Headquarters": "North Richland Hills, TX", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Humana"}, "estimatedSalary": null, "jobDescription": "Licensed Insurance Agent - Leads Provided!If you answer \"Yes\" to any of these questions then keep reading to learn about your \"Future Career\"! Do you wonder where healthcare is heading?Do you want to learn more about an industry that is never going away?Do you want to add value to people’s lives while earning income?Do you want to join an industry rich with opportunity?HealthMarkets thinks about these questions every hour of everyday and we pride ourselves on finding the answers! One answer that keeps coming back around is Supplemental Insurance. This simple answer will lead the charge in this ever changing industry. People want insurance choices and HealthMarkets has choices. Bring your questions and we will help you find the answers.What will HealthMarkets Do for You?Competitive Compensation: after hitting your training benchmarks, you will transition to a solid commission structure in the industryLead Programs Exclusive & Shared LeadsPre-Set AppointmentsMarketing InvestmentCorporate AdvertisingTechnology ToolsContinuous Training ProgramPortfolio of Products from Leading CarriersInvestment Stock Options PlanWhat Requirements build a successful business?Coachable, entrepreneurial and competitive spiritCompassion and passion for helping people and making a difference in their livesPrime listening skills with clear communicationThrive on prospecting, cold calling, canvassing and leveraging your territory to gather leads and new customersCompetitive spirit and driven by your own successSelf-disciplined, self-motivated, high energy and persistentA fun go-getterEarn Extra Credit with these Questions:Any Cold calling experience?Proficient in Microsoft Office applications including Outlook?Any CRM experience?Ability to successfully complete a pre-employment background check and drug screen?Why HealthMarkets?Let me share the landscape of healthcare. Millions of people are taking back control and purchasing Supplemental Insurance because people are having to make complex Health Insurance and Medicare choices on their own. We are passionate to help with these choices by helping Insurance Sales Reps build a successful business. Whether you are new to insurance, or experienced in insurance sales, you can join a proven leader.Know someone who is? Please share this job posting!"}