{"jobID": "2826349375", "jobLocation": "Santa_Clara_CA", "jobTitle": "Graphics Performance Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": null, "jobDescription": "Graphics Performance Modeling Engineer Job Number: 113628626Santa Clara Valley, California, United StatesPosted: Jun. 24, 2018Weekly Hours: 40.00 Job SummaryDo you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Technologies group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices.  The Graphics Performance Modeling Engineer will be delivering high-quality GPU performance models to meet the needs of GPU hardware development. This includes writing models for performance exploration, performance validation, and power estimation. You will collaborate closely with the architecture team, functional modeling team, and hardware design teams.Key Qualifications GPU modeling experienceGPU hardware and architecture knowledgeExpertise and knowledge of graphics rendering algorithmsExperience debugging unit and system-level performance issuesExcellent C/C++ programming and scripting skillsExpertise in 3D APIs is helpful (OpenGL, DirectX, Metal, etc.)Expertise in one or more GPU shading languages is a bonus (GLSL, HLSL, Metal, etc.)Experience with hardware design methodologies and tools is a plus (Verilog, DPI, design verification, etc.)Ability to work well in a team in order to be productive under aggressive product schedules Description- Your work will be highly visible and critical to improving the performance and efficiency of our future Apple GPUs. Develop, write, and debug GPU performance models in C/C++/SystemCRun, triage, and debug GPU performance testsAnalyze model results and propose architectural and micro-architectural changesAssist in performance and power test planningBuild automated flows and infrastructure for performance exploration and verificationEducationBS/MS/PhD CE, EE, or CS"}