{"jobID": "2565131974", "jobLocation": "Austin_TX", "jobTitle": "ML/DL Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.apninc.com", "Headquarters": "Newark, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Duration: 9 months Location: Austin, TX 78753Job Description: The ML/DL Data Scientist will lead the design efforts for to create industry-leading, turnkey AI systems and solutions for the rapidly growing intelligent data analytics needs of the industry. The ML/DL Data Scientist will help design and implement ML/DL systems for a wide variety of use cases and applications. Key responsibilities for this position include building models and developing algorithms for various use cases. A good understanding of natural language processing and image processing domains is required. The responsibilities also includes tracking and projecting the evolving needs of the ML/DL (Machine Learning/Deep Learning) community as well as understanding ML/DL systems architectures, hardware technologies evolution, emerging technology opportunities, and the maturing ML/DL applications software landscape and horizon. This position will work with other AI, Big Data and HPC architects, engineers, developers, product managers, and sales staff to ensure that new ML/DL solutions are best-in-class matched to customer needs, cost-effective, supportable, and have potential for significant impact and revenue. This technical position will maintain constant awareness of the emerging ML/DL techniques and will participate in research activities to maintain technical vision and perspective. The position will maintain regular communications with thought leaders in ML/DL, attend leading conferences to maintain connections and context. This position will also stay abreast of the market for ML/DL in different market segments and will help design and implement solutions for the leading customers.Responsibilities Provides technical and consultative support on solutions opportunities. Participates as needed in pre-sales qualifications and delivery of technical architectural design, strategies and plans for engagements; works on single workstream within broader project; support and instruct less experienced co-workers through formal training or on-the-job mentoring; trains customer personnel. Supports Sr. Consultant/PM for project related items and advises on effort required to perform assigned implementations. Regularly communicates project status and all customer issues to PM. Capable of leading a small team, understanding project goals, and providing guidance to achieve goals. Participates in solution and peer review process. Assists in the creation of proposals that address current and evolving client requirements. Establishes relationship with client technical counterparts. Participates in client meetings related to development efforts. Provides feedback on methodology and best practice collateral to competency lead. Understands that travel may be required for extended periods of time.Requirements:M.S. (or BSc + additional experience) in Electrical Engineering, Computer Science, Mathematics or StatisticsAt least one year experience in implementing ML/DL models and algorithms in production environments2+ year experience with proven record in the ML/DL and data analytics domainDeep understanding of various Machine Learning models and algorithmsProgramming experience in C/C++ and PythonFamiliarity with state-of-the-art techniques such as neural networks and their use cases such as image processing, natural language processing, speech recognition"}