{"jobID": "2674742723", "jobLocation": "San_Francisco_CA", "jobTitle": "Full Lifecycle Non-Technical Recruiter", "companyRating": null, "companyInfo": {"Website": "www.searchwizards.com", "Headquarters": "Sarasota, FL", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Full Lifecycle Non-TechnicalRecruiter –San Francisco, CAAre you passionate about the Talent Acquisition Profession and the impact you can make on the organizations you support? Do you enjoy being challenged and solving problems? Are you an energetic, results-oriented Professional with a competitive nature? If so, we want to talk to you.Search Wizards is a global provider of Talent Solutions. We have excelled at matching our clients’ staffing needs to the BEST Talent Acquisition Professionals in the market since 2000.If you are in the Talent Acquisition Profession make us your first call. This is all that we do and it’s all about YOU.Excited yet? Us too!We currently have a very exciting opportunity available for a Full Lifecycle Non-TechnicalRecruiter inSan Francisco, CA. This position will start as a 12 monthcontract with the potential to extend.As part of our client’s world-class recruiting team, you're charged with finding the most interesting candidates who bring an entrepreneurial spirit, a sense of scrappiness and a diversity of thought to all they do. You're responsible for guiding candidates through the hiring process and connecting them to the magic of working at their company. You are creative and driven, with an interpersonal savvy that allows you to develop lasting relationships with both candidates and Hiring Managers. You're also comfortable with numbers and drawing insights from analytics to make our hiring process smarter and more efficient. From generating pipeline to maintaining a successful offer acceptance rate, you manage the entire candidate process. By leveraging your knowledge of our clients' hiring needs and search requirements, you effectively match candidates with the roles in which they will be most successful.Top 3 DailyResponsibilities:Develop strong relationships with candidates, understanding their needs and helping them find a fit at the companyKeep partners apprised of and involved in work by communicating information and status to project leads and team members, coordinating work cross-functionally and influencing peers, project leaders and/or ManagersKeep candidates and Hiring Managers continually informed with quality communications throughout the hiring processOverallResponsibilities:Recruit top talent and achieve quarterly hiring goalsProvide an efficient and high-touch experience for every candidate from application stage to offer, evaluating skill level, driving the interview process and offer process, including reference checks, salary recommendations and closing of candidatesNegotiate complex offers to close candidates by leveraging your experience with competing for top technical talentBasic Qualifications:BA/BS degree or equivalent practical experience1-3 years full lifecycle experience in G&A; RecruitingStrong communication skillsAbility to navigate ambiguityAbility to build pipelines through proactive sourcing of passive candidatesProven ability of closing candidates in a highly competitive landscapePreferred Qualifications:Client facing experienceSearch Wizards is an equal opportunity employer.Search Wizards is known for its pioneering efforts and niche focus on Talent Solutions. We offer competitive rates, an excellent benefits package (healthcare and 401k), ongoing education, and more.StayConnected:WebsiteFacebookTwitterGlassdoorJOB ID: SE522304227"}