{"jobID": "2778694628", "jobLocation": "San_Francisco_CA", "jobTitle": "Design Strategist II", "companyRating": null, "companyInfo": {"Website": "www.fuseproject.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Were seeking a design-minded Strategist to answer the what and why of design. Strategists are fully engaged members of our team who bring a clear POV to our problem solving approach, helping clients and internal teams solve business and design challenges by unifying customer insights, the market landscape, product and brand positioning and creative thinking. Strategists support a range of design projects, including brand development, product and digital strategy, to future business mapping, and experience and service design.  The ideal candidate has experience working with a range of clients and stakeholders and is adept at sifting through the clutter of detail to identify a challenges essential questions and core insights.  Note: While we are fully welcoming of former designers, this role requires comprehensive strategy-specific experience.  Responsibilities include: Working directly with clients, fellow strategists and designers to establish relevant business and competitive context in order to set the stage for and fuel brand, product and businessOrganizing, conducting, analyzing and synthesizing primary and secondary research into actionable insightsFeeding into and/or leading brainstorms with a range of internal team membersDesigning client-facing presentations, which includes writing, thoughtful image finding, and designing visual information with the intent of telling a compelling storyWorking with teams of industrial designers, UX designers and graphic designers on the creative product and brand development process within tight, frequently changing timeframesActively participating in a variety of strategic and creative activities to translate business, customer, market and competitive realities into business, product and brand innovations for both large, existing corporations and not-yet-launched startup ventures Required skills/Experience: At least 4 years of experience in strategy consulting, design strategy or brand management and/or marketing or equivalent. Agency experience highly desirableMBA or graduate degree in related field highly preferredStrong understanding of, interest in and passion for designSolid analytical skills with an ability to gather, analyze, and quickly synthesis key information to objectively craft and support recommendations. Field research and ethnography experience a plusLove for collaboration with a readiness to jump in and work with a diverse group of people and spearhead brainstorms and conversations. Willing to put the good of the project before personal interestsOrganized, self-motivated and detail-oriented, with the ability to work autonomously and be a self-starter in a demanding environmentComfortable and willing to present and defend their strategic point of view with senior team members and internal leadership"}