{"jobID": "2795418270", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Pricing /Business Intelligence Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.kemper.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Insurance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Requisition Number KPL-186188SD Post Date 5/30/2018 Title Senior Data Pricing /Business Intelligence Analyst City Chicago State IL Description Position Summary:  Kemper has an immediate need for a skilled and motivated Senior Data Pricing / Business Intelligence Analyst to join a team supporting primarily Personal Auto and Homeowners insurance operations. This team will have an immediate and lasting impact on product  development and strategy, pricing, underwriting, call center operations, sales and marketing. This position is located at our corporate headquarters in downtown Chicago, IL. Position Responsibilities:Ensuring data integrity;Designing and developing new reports;Enhancing the efficiency and accuracy of existing reports;Delivering and presenting information to technical and non-technical audiences;Promoting optimal data governance processes and best practices across the team;Working to ensure speed-to-data excellence.Position Qualifications:6+ years of experience in data and business intelligence.Experience in the P&C; insurance industry is preferred.Bachelor’s degree in finance, business, computer science, actuarial science, or related field.Expert skills in Excel, VBA, SAS and SQL. Tableau experience is a plus.Strong data programming, analytical and problem-solving skills.Expert ability to identify and implement appropriate improvements in process and tools.Our employees enjoy great benefits:Qualify for your choice of health and dental plans within your first month.Save for your future with robust 401(k) match, Health Spending Accounts and various retirement plans.Learn and Grow with our Tuition Assistance Program, paid certifications and continuing education programs.Contribute to your community through United Way and volunteer programs.Balance your life with generous paid time off and business casual dress.Protect what you love with discounts on home and auto insurance products.Get employee discounts for shopping, dining and travel through Kemper Perks. Kemper at a glance  With $8 billion in assets, Kemper is one of the nation's leading insurers. The Kemper family of companies specializes in home, auto, life, health and valuables insurance products for individuals, families and businesses.  Kemper’s underwriting companies* are rated A- (Excellent) by A.M. Best Company, the leading insurance industry rating authority. Kemper services six million policies and ranks among the top 25 personal lines property and casualty writers and the 2016 Ward’s  50 Top Performers list of life insurance companies. Alliance United Insurance Company is not rated. We value diversity and strive to be an employer of choice. An Equal Opportunity Employer, M/F/D/V MO +CB -ZR +GD -IN -MSJ -PT"}