{"jobID": "2582276214", "jobLocation": "Washington_DC", "jobTitle": "P-12 Senior Data and Policy Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.edtrust.org", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Description  The Education Trust, named one of the three most effective education organizations on Capitol Hill, seeks a P-12 Senior Policy and Data Analyst to support the work of the organization’s division of Program and Policy.  Reporting to the Director of P-12 Policy Development, the Senior Policy and Data Analyst will develop and conduct data and policy analyses to inform and support the organization’s policy agenda, which aims to ensure that all students receive the educational opportunities they need and deserve.  We are fierce advocates for the high academic achievement of all students – pre-kindergarten through college, particularly those of color or living in poverty. Through both research and advocacy, our goal is to close the gaps in opportunity and achievement that affect millions of young people across the U.S. – especially those from low-income families, or who are Black, Latino or American Indian. We work alongside parents, educators, policymakers, and community and business leaders across the country in transforming schools and colleges into institutions that serve all students well. Lessons learned in these efforts, together with unflinching data analyses, shape our state and national policy agendas. For additional information on The Education Trust, please visit www.edtrust.org. The P-12 Senior Data and Policy Analyst’s responsibilities include but are not limited to the following: Develop and conduct data and policy analyses related to trends in opportunities to learn and in student outcomes, with a focus on identifying and remedying disparities.Participate in the development of recommendations for federal and state policy related to early childhood education, school and district accountability and improvement, and college/career readiness.Design analyses that demonstrate how policy proposals may play out in the field to inform the organization’s policy recommendations.Develop materials (reports, briefs, PowerPoint presentations, web content, etc.) to advance our policy agenda.Represent The Education Trust and its policy agenda with various audiences, including policymakers, journalists, educators, and advocates.Respond to data and policy inquiries, including requests to review and comment on external policy proposals, from staff and external audiences.Provide support to policy and data staff across the organization, including state offices. We are looking for a combination of the following qualifications and experience: At least 3-5 years of experience conducting policy and data analysis in education, preferably on issues related to equity and improving opportunity and outcomes for low-income students and students of color. Knowledge of early childhood education policy and/or policy pertaining to English learners preferred.Demonstrated experience with using data to support policy development.Knowledge of research methodology, evaluation and statistics to be able to understand and interpret the validity and significance of findings.Demonstrated proficiency with statistical analysis and working with large data sets using SPSS, SAS, STATA, R, or Excel.Ability to translate and communicate results of complex analytic and research findings to diverse audiences.Ability to work independently and collaboratively in developing analyses, collecting and analyzing data, and presenting findings.Understanding of federal and state policy contexts that affect P-12 education, and thoughts about how to improve these policies.Excellent analytic and communication skills (both oral and written, and in a variety of formats and contexts).Possession of a doctorate, master’s degree, or equivalent in education, psychology, or related field.Passion for improving the educational experiences and outcomes for low-income students and students of color, and an unwavering belief that these students could be much more successful if institutions better served them;Self-starter mentality and the ability to work independently;A demonstrated commitment to excellence;Healthy respect for colleagues;Goal-oriented, project-oriented, and achievement-oriented;Strong sense of honor and integrity;A warm, personal style with a good sense of humor. Salary is commensurate with experience and qualifications. The Education Trust offers a comprehensive benefits package."}