{"jobID": "2826586362", "jobLocation": "Santa_Monica_CA", "jobTitle": "Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.apexlifesciences.com", "Headquarters": "Glen Allen, VA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " A well-regarded company focusing on patient therapies is seeking a Scientist, In Vivo Pharmacology to join their team. This is a great opportunity to work for an industry leader! DUTIES & RESPONSIBILITIES:Independently interact with Contract Research Organizations (CROs) to support in vivo studies related to the development of productsWork with a cross-functional research team to advance the development of products and provide input into project directionIndependently plan experiments and interpret data as required for projectSuccessfully execute and document laboratory procedures and experiments with great attention to detailOther duties as assignedREQUIREMENTS:Ph.D. degree in immunology or a closely-related field with 3 years of relevant post-doctoral laboratory experience in cellular and/or tumor immunology (industry experience preferred)Knowledge of cell trafficking to the tumor microenvironment in vivo is preferredPrior experience of managing/mentoring research associate level staffPrior experience of culturing primary human cells and cell linesExperience with retroviral and/or lentiviral transduction of primary cellsProficiency in the in vitro analysis of immune cells, including multi-parameter flow cytometry, Luminex® assays and qPCRKnowledge of relevant emerging technologies, for example, Droplet DigitalTM PCRSelf-motivated and willing to accept temporary responsibilities outside of initial job descriptionAbility to work in a highly collaborative environmentAbility to think critically, and demonstrated troubleshooting and problem solving skillsStrong organizational and record-keeping skillsExcellent interpersonal, verbal and written communication skillsComfortable in a fast-paced small company environment with minimal direction and able to adjust workload based upon changing priorities EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178."}