{"jobID": "2792511837", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr Director of Data Science", "companyRating": null, "companyInfo": {"Website": "www.axs.com", "Headquarters": "Los Angeles, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Were always looking for bright, entrepreneurial and fun people to help us grow!  AXS is a company whose core values reflect a culture that celebrates individual differences, collective achievements, and respect of one another. We start small and are never afraid to try (Be The Spark). We believe open, honest, and proactive communication builds trust and empowers us to be our best (Make it Personal). We handle our problems constructively and together (Be Real). We go above and beyond to build something truly special and lasting (Bring Your A Game). Most importantly, we celebrate and communicate our success by recognizing each other across all teams and levels of our organization (Pat The Back).  Our culture is a representation of who we are now, and who we aspire to be in the future. If you are looking for a fast-paced environment where collaboration, accountability and visibility enable you to make a difference every day, then AXS may be a perfect match.  Were seeking a Senior Director, Data Science to join our team. This role will be focused on analyzing complex data structures to generate useful business insights, developing predictive models, key driver analysis and customer segmentation. The Senior Director of Data Science will provide analytics support across multiple departments, deriving high-quality data focused insights to achieve long-term goals and objectives. What youll be doing(duties and responsibilities)Build/grow a data-driven strategy and culture that encompasses data acquisition, leading business intelligence and reporting tools, data science initiatives and advanced analytics.Provide analytics expertise, data engineering knowledge along with market analysis tools to both create and collaborate on the roadmap for AXS big data and analytics initiatives.Identify key trends, issues and opportunities to optimize our e-commerce business, marketing spend, and maximize profitability and ROI.Manage platforms to reflect actionable insights from complex data stores through the development and interpretation of statistical analysis and predictive models.Create data based recommendations and test out strategies that would improve core business metrics.Collaborate with other functional teams to understand the impact of analysis across multiple areas of the business.Provide clear, concise, and actionable recommendations to business stakeholders and executive leadership.Develop and manage in-depth quantitative analyses and predictive models utilizing a combination of tools including: SAS, Python, R, SQL, and Excel.Skills and experience were seeking:Deep experience in analytics platforms like Adobe AnalyticsExperience in audience data management platforms (DMP)Deep experience in managing analytics for e-commerce businessesStrong business skills to connect business drivers to metrics Headquartered in Los Angeles, California, AXS is a leading ticketing, data, and marketing solutions provider in the US, UK and Europe. The company and its solutions empower more than 200 clients  teams, arenas, theaters, clubs and colleges to turn data into action, maximize the value of all their events and create joy for fans. AXS is an enterprise event technology platform that services venues, promoters and sports teams; providing fans the opportunity to purchase tickets directly from their favorite venues via a user-friendly ticketing interface. AXS serves all phases of the event life-cycle beyond just ticketing, through its consumer facing website, AXS.com and the AXS App. To learn more about the company and our employment opportunities, please visit us at www.axs.com"}