{"jobID": "2757337004", "jobLocation": "San_Diego_CA", "jobTitle": "Clinical Informatics Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.humana.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1961", "Type": " Company - Public (HUM) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cigna, Aetna, UnitedHealth Group"}, "estimatedSalary": "88000", "jobDescription": "Role: Data Scientist, Clinical InformaticsAssignment: Transcend InsightsLocation: San Diego, CATranscend Insights®, a wholly owned subsidiary of Humana Inc., is redefining how population health is managed, measured and implemented by providing The Platform for Population Wellness. Our HealthLogix™ technology platform and unified solution suite helps health systems, care teams and patients transition from episodic to proactive care for long-term wellness. By providing solutions and insights that support a more proactive, person-centric approach to care, we are powering a better care experience, giving people the freedom to make confident decisions, and helping to empower care teams, not tools, to improve the health and long-term wellness of populations.Transcend Insights and Humana need your analytical skills to help us tell a compelling story about healthcare today. Through the strategic interpretation of data, we provide our consumers—physicians, patients, and other members of the care team--with meaningful insights about the choices they make and help them lead their best lives. We’re passionate about combining and analyzing diverse types of data to extract new, actionable discoveries about our members and their health-related behaviors. We encourage you to dive into your passion for data and use analysis to help us tell the health-and-wellness stories of our members. We’re looking for driven, innovative people who are interested in using their data-mining and analytical skills to help our consumers achieve lifelong well-being and help Humana make lasting, positive changes in the healthcare industry.As a Data Scientist, Clinical Informatics, you’ll apply your analytics and practice management expertise to add value to the work we’re doing at Transcend Insights.Apply understanding of clinical and financial metrics to various data sets to help in the creation and implementation of clinical and business strategy"}