{"jobID": "2618650539", "jobLocation": "San_Marcos_CA", "jobTitle": "Massage Therapist", "companyRating": null, "companyInfo": {"Website": "www.elementsmassage.com", "Headquarters": "Englewood, CO", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Massage Envy, Massage Heights, Massage Luxe"}, "estimatedSalary": null, "jobDescription": " Elements Massage of San Marcos is looking to hire highly skilled Massage Therapists who are passionate about helping people and love what they do. We are seeking therapists who are customer focused, compassionate, personable, and willing to follow the proven Elements service path to be part of our progressive team.  New grads as well as seasoned Massage Therapists may apply. Possible advancement opportunities, as we open additional studios. What we ask of you:Have a heart and passion for healing peopleKnowledge of Swedish and Deep Tissue Massage requiredKnowledge of other various modalities preferred (sports, trigger point, hot stone, prenatal, etc.)Ability to perform moderate to deep pressure massage for several consecutive hoursBe customer service oriented and able to communicate effectively with clientsPass background checkMust have a CMT certification through California Massage Therapist Council (CAMTC) with over 500+ hours and adhere to local and state licensing laws and regulationsCarry liability insurance from ABMP, AMTA or other similar organization. If you are not currently insured, Elements has established a discount program for you to purchase Professional Liability insurance through ABMPBe a team player!Minimum requirements:Must be available to work a minimum of 3 shifts per weekAble to work an average shift length of 4 to 6 hours with the possibility of completing 4 to 6 massages in one day.Preferred but not required:Certifications in hot stone therapy and/or prenatal massageWe provide you everything you need to be successful:Competitive ratesRetention bonusesFlexible schedulesBreaks as required by lawHeated, hydraulic tablesLinens and lotionsDiscounted liability insuranceContinuing education training and certification on certain massage protocolsFree monthly massagePaid trainingWork with a multitude of clientsClosed on major holidaysA studio with 7 comfortable rooms, including one couples roomA studio focused only on massageSupportive and understanding management team. Elements Massage is a non-smoking work environment. WHO WE ARE: Elements Massage was founded by Michele Merhib, a Licensed Massage Therapist and recent inductee into the Massage Therapy Hall of Fame. We care for our Massage Therapists the same way we care for our clients. We will invest in your personal and professional growth by providing ongoing training. Elements Massage now has over 150 massage studios nationwide and is growing rapidly.  Our goal is to be the go to place to work for the best therapists in North San Diego County.  Apply today by replying to this ad with a detailed resume, including professional references. Be sure to include hours of education and modalities practiced and certified in, as well as schedule availability.  Apply"}