{"jobID": "2670656274", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.slalom.com", "Headquarters": "Seattle, WA", "Size": "5001 to 10000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Accenture, Deloitte, Avanade"}, "estimatedSalary": "115000", "jobDescription": " Slalom is a purpose-driven consulting firm that helps companies solve business problems and build for the future, with solutions spanning business advisory, customer experience, technology, and analytics. We partner with companies to push the boundaries of what’s possible—together.  Founded in 2001 and headquartered in Seattle, WA, Slalom has organically grown to nearly 4,000 employees. We were named one of Fortune’s 100 Best Companies to Work For in 2016 and are regularly recognized by our employees as a best place to work. You can find us in 25 cities across the U.S., U.K., and Canada. Job Title: Data Scientist Responsibilities: Deliver solutions leveraging latest ML techniques, including exploratory data analysis, feature engineering, model selection, model evaluation and cross-validation, and deployment and productionalization at all scales Collaborate with client data science teams to enhance, scale, and operationalize existing modelsCommunicate effectively with both technical and nontechnical stakeholdersProvide thought leadership on latest ML/AI technologies and applications to client industry and use casesConduct and support white-boarding sessions, workshops, design sessions, and project meetings as needed, playing a key role in client relations.Qualifications:Experience with core quantitative analysis techniques (e.g., predictive modeling, machine learning, artificial intelligence or natural language processing—neural networks (including DNN and RNN)Strong interest in applying data science to solve real-world business problems Exceptional analytical, conceptual, and problem-solving abilities.Quantitative background with 3+ years of experience using data to solve problems and answer questionsWorking knowledge of Python, R, or other advanced analytics platformsExperience with ETL and manipulation of DataKnowledge of relational and dimensional database structures, theories, principles, and practicesHighly self-motivated to deliver both independently and with strong team collaboration.Strong written and oral communications along with presentation and interpersonal skills.Strong aptitude & desire for learning new technologies and analytics techniques.Nice to have:Graduate degree in a technical field (computer science, applied mathematics, statistics, etc.)Familiarity with advanced analytics techniques for unstructured dataExperience running distributed processing on Hadoop or SparkExperience with solution architecture on cloud platforms such as Azure, AWS, etc.Experience using data visualization tools such as Tableau, Qlik, or Power BI Slalom is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}