{"jobID": "2824966675", "jobLocation": "Webster_TX", "jobTitle": "Senior Data Analyst - Business Analytics", "companyRating": "2.5", "companyInfo": {"Website": "www.wfscorp.com", "Headquarters": "Doral, FL", "Size": "1001 to 5000 employees", "Founded": " 1984", "Type": " Company - Public (INT) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " At World Fuel Services, our employees are the key to our global success.We are industry leaders due to the innumerable talents of our approximately 5000- strong professional team. Our people thrive in an entrepreneurial and culturally-diverse environment, where innovative thinking, collaboration and efficient execution are highly valued. Our high-performance culture is what allows us to drive sustained growth. Stronger together, we promote an environment where individuals can thrive.  When you click 'Apply', you will need to click on 'Create Account'. By creating an account, you will be able to view your applications and their statuses. Your password must contain 1 upper case letter, 1 number, and 1 special character.  World Fuel Services is an equal opportunity employer committed to a diverse and inclusive workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin or any other characteristic protected by law.  World Fuel Services is looking for a senior data analyst to synthesize and leverage our aviation and transactional datasets to drive improved business performance and enable data-driven technology products. This is an outstanding opportunity to join a passionate leadership team who is committed to making data-driven decisions in a rapidly changing market. A successful candidate in this role will play an instrumental part in our pursuit of developing and maturing our team's use of data analytics, modeling and visualization to move from basic metrics reviews to applied business intelligence and data-driven action. If you have been dreaming of doing analytics and turning your insights into action, this could be your next job. Responsibilities:Mine vast aviation and transactional data sets to develop new insights for growth and performanceExtract, transform, load and blend data from multiple sourcesWork closely with leadership teams to prioritize business and information needs and to drive our analytics strategyIdentify, analyze and interpret trends and patterns in complex data setsUtilize advanced analytics tools, such as Tableau and Alteryx, to analyze data, develop reports and provide data-driven actionable recommendationsCollaborate with product teams to design, measure and prioritize investments to drive profitable growth utilizing both operational and financial dataAbility to ramp up on industry context so that actionable business insights can be developed from our data sets Develop prototypes, proof-of-concepts, algorithms, statistical models, and custom analysisDevelop standard procedures to manage data and automate analyticsCreate in-house applications leveraging APIs from internal and external data sourcesJob Requirements:Strong business analysis experience or trainingAt least 3-5 years of experience working with large data sets, preferably in an analytics roleExpert knowledge of and experience with data blending - advanced data analytics software(Tableau and Alteryx preferred but not required), databases (Oracle, SQL Server, etc.) and ExcelStrong analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presentation of findingsPrior experience in Engineering, Business Analysis, Analytics, Business Intelligence or Statistical Data AnalysisBachelor's Degree with a concentration in a quantitative, scientific or business field. Advanced degree preferred MBA or Master's with business analytical skillsExperience in Aviation industry Preferred#LI-AS1#ZPSDL2017"}