{"jobID": "2825098876", "jobLocation": "Seal_Beach_CA", "jobTitle": "Wiring Data Integration Engineer - Mid level", "companyRating": "3.5", "companyInfo": {"Website": "www.boeing.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1916", "Type": " Company - Public (BA) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Lockheed Martin, Northrop Grumman, Airbus"}, "estimatedSalary": "101000", "jobDescription": " Seal Beach,California,United States  6B1BP3Wiring Data Integration works with Airline Customer findings of inconsistencies within the Wiring Diagram Manuals (WDM) and System Schematic Manuals (SSM) for all the electrical wiring within that Customers specific aircraft. Coordinating communication between Fleet Chiefs, Service Engineering, Design Engineering, and the WDI Team to resolve issues is the norm. As the owners of the WDM and SSM for each delivered aircraft, WDI ensures the Customer has quality documents and keeps said documents current. In addition, when changes to a delivered Aircraft configuration are requested by the Customer, the WDI Team manages the incorporation of the Customer requested changes into the Manuals.  The successful candidate will possess the following general and technical competencies: Communication, Decision Making, Interpreting Engineering Data, Quality Orientation, and Maintenance and Retrofit. Primary Responsibilities:Analysis of complex aircraft wiring designs and design changes to ensure they are properly documented in Customer Manuals.Work alongside the greater Maintenance Engineering team where aircraft integration knowledge is beneficial in supporting overall airplane fault isolation, maintenance, and continued airworthiness processes and procedures.Performs customer interface to support customer inquiries and develops technical solutions for Customer issues/concerns.Develops new procedures and techniques to ensure end product accuracy.Participates in organizational activities that influence the Aerospace Industry.Involves detailed knowledge of airplane configuration data management systems and develop systems including eMOD, APC, Equipment Manager, My Boeing Fleet, LOPAs, WIRS, FASTR, IVT, CATIA, BOLD, REDARS and BCS.Avionics/Electrical/Communication/Navigation. Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world. This position must meet Export Control compliance requirements, therefore a US Person as defined by 22 C.F.R. § 120.15 is required. US Person includes US Citizen, lawful permanent resident, refugee, or asylee.Basic Qualifications (Required Skills/Experience):Bachelors degree or higher in Engineering or related technical disciplineDesired Qualifications (Preferred Skills/Experience):Experience using maintenance documents or airline experienceExperience with analyzing and interpreting engineering data for inclusion into maintenance manuals and technical publications.FAA Airframe and Powerplant license or equivalentDegree from an ABET accredited programDegree and typical experience in engineering classification: Bachelor's and 5 or more years' experience, Master's degree with 3 or more years' experience or PhD degree with experience. Bachelor, Master or Doctorate of Science degree from an accredited course of study, in engineering, computer science, mathematics, physics or chemistry. ABET is the preferred, although not required, accreditation standard.Yes, 10 % of the Time  BCA Engineering  Individual Contributor  No  No  Standard  United States; The Boeing Company"}