{"jobID": "2731623094", "jobLocation": "San_Francisco_CA", "jobTitle": "Remote Video Editor", "companyRating": "3.4", "companyInfo": {"Website": "www.wearewrkshp.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": "About Us : At WRKSHP, we are music missionaries committed to crafting the future of music.  We believe music is the universal language. We believe music can inspire you, motivate you and move you. We believe a good song can make you live happier, dance harder, and love better and that music is the common thread that unites all races, languages and religions.  We are a small team of artists, designers, developers, technologists dedicated to creating products that truly change the world. Our team is one of the best - with members who are responsible for inventing products such as Guitar Hero, Beats by Dre headphones, SOL Republic headphones, the worlds first free to play mobile game, and the In App Purchase. We are building products and experiences that make music more interactive, more social, and more accessible.  We are bootstrapped and profitable. Our products in total have amassed over 100mm downloads with over 55 top 25 Apps. Our last product, Battle Camp, was a game that has over 50mm downloads, made over $100mm in revenue and is still a top 100 grossing app in 20+ countries after 5 years. Our newest product is a platform for interactive music called Beat Fever that is the worlds #1 music game, was Googles Best of 2017, and is growing virally with no marketing.  We are currently working on: Growing Beat FeverBuilding a new product that will make music more socialBuilding a new product around music We are looking for passionate and creative music lovers to join our team. Help us build products that touch millions of peoples lives and change the world. The Role: Were looking for the best freelance video editors to help us make promos and trailers.  This position will report directly to our CEO and CMO and be responsible for video creation and content across all our products. Qualifications and SkillsSmart, funny, talented, egoless, flexiblePassionate about making short-form content - promos, and trailersAbility to work with audio in creative and surprising waysStrong ability to edit music to maximize impact.Good sense of timing, pacing and controlling story flow through editing.Knowledge of advanced video compression techniques and associated software packagesAdobe Premiere and Adobe After Effects experienceMotion graphics experience a plus"}