{"jobID": "2834630446", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Supervision Analyst/ Supervision Analyst Data Librarian focus", "companyRating": "3.9", "companyInfo": {"Website": "www.federalreserve.gov", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1913", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " FDIC, Office of the Comptroller of the Currency, SEC"}, "estimatedSalary": "64000", "jobDescription": " Sr. Supervision Analyst/ Supervision Analyst - Data Librarian focus Wholesale Credit Risk Center - Supervision and Regulation Department The Senior Supervision Analyst/Supervision Analyst will support core supervisory activities of the Risk Specialist Division related to Wholesale Credit Risk and Stress Testing. The analyst will accelerate the development of research data services through collecting and organizing financial, technical, statistical, operational, or examination data for report preparation and analysis. The analyst also will be responsible for management of data throughout its lifecycle. Further, the analyst will assist in methods for data stewardship include managing, describing, preserving, and making data accessible to appropriate audiences.  Principal Duties and Responsibilities: Conduct day to day management and delivery of multiple data processes liaising with business unit teams and other operations teams. Ensure data governance principles are adhered to ensuring all procedures are efficient, clearly documented and maintained. Partner with internal teams to negotiate, procure, and communicate appropriate use of vended data products. Responsible for the creation and socialization of metadata Develops and maintains communication vehicles to disseminate information to key constituents throughout the Division, the Department and the System Participates in System-level and ad-hoc projects which may include working with staff from other Reserve Banks and the Board of Governors Develop and maintain strong relationships with internal stakeholders and peers - provide ad hoc support to investigate, quantify and resolve data queries Collects and organizes financial, technical, statistical, operational, or examination data for report preparation and analysis, for inclusion model or data analysis projects, or for inclusion in formal presentations May manipulate data from a variety of sources Presents analysis to a variety of audiences Organizes presentations and roundtables on data issues Performs other duties as assigned"}