{"jobID": "2831706430", "jobLocation": "Borger_TX", "jobTitle": "Environmental Geologist/Scientist", "companyRating": null, "companyInfo": {"Website": "www.ghd.com", "Headquarters": "Sydney, Australia", "Size": "5001 to 10000 employees", "Founded": " 1928", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description GHD is one of the world's leading professional services companies operating in the global markets of water, energy and resources, environment, property and buildings, and transportation.  Privately owned by our people, GHD provides engineering, environmental and construction services to private and public sector clients across five continents and the Pacific region. Focused on creating lasting community benefit, our connected global network of 8500 people delivers projects with high standards of safety, quality and ethics.  Committed to sustainable development, GHD improves the physical, natural and social environments of the many communities in which we operate.  We have an opportunity in our Borger, TX office for an Environmental Geologist/Scientist, who aspires to become an active employee in a vibrant, well-established company.  If you're driven, fast track your career here!  Responsibilities include Implementing investigation, remediation and reporting of environmental projects with a strong focus in subsurface investigations and remedial activities Plan and implement environmental field work such as monitoring well installation, groundwater monitoring, due diligence assessments, spill management, and corrective action implementation Prepare routine correspondence, data reports, standardized documents and work plans for internal and client review Oversight of contractors and field staffQualificationsB.S. in Geology, Environmental Engineering, Environmental Science or related field of study 2 years of previous environmental field and/or oil & gas experience is preferred Ability to perform field work and travel overnight Strong verbal and written communication skills. Proficiency in Microsoft Word, Excel, PowerPoint & Outlook OSHA 40 Hour HAZWOPER training is a plus Self-starter that can take direction and work well independently Well-developed assessment and critical thinking skills Must reside in Borger, TX or surrounding area As a multicultural organization, we encourage individual achievement and recognize the strength of a diverse workforce. GHD is an equal opportunity employer. We provide equal employment opportunities to all qualified employees and applicants without regard to race, creed, religion, national origin, citizenship, color, sex, sexual orientation, gender identity, age, disability, marital status or veteran status.  To apply, please submit your resume and cover letter to the link below.  No phone calls please and no third party firms. This position does not offer visa sponsorship. #LI-DW1"}