{"jobID": "2831345607", "jobLocation": "Brea_CA", "jobTitle": "Staff Research Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.danaher.com", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (DHR) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " Job Description Job ID: SCI002449  About Us  SCIEX An operating company within Danaher's Life Sciences platform  SCIEX helps to improve the world we live in by enabling scientists and laboratory analysts to find answers to the complex analytical challenges they face. Our leadership in LC-MS and CE-MS have made us a trusted partner globally to those who are focused on basic research, drug discovery, food and environmental testing, forensic toxicology, clinical research and diagnostics. With over 40 years of innovation, we continue to redefine what is achievable in routine and complex analysis.  We are seeking smart, team-oriented people who have purpose and are committed to helping us deliver Answers for Science. Knowledge for Life. Our global team, located on every continent, is our greatest strength, bringing diverse perspectives and breakthrough thinking. With the power of the Danaher Business System behind us, it's our people who have made us the industry leader. Come join our winning team. Visit us at www.sciex.com.  Sciex offers a broad array of comprehensive, competitive benefit programs that add value to associates' and their families' lives.  Sciex is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, national origin, religion, gender, age, marital status, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by law.  Join our winning team and Follow us on LinkedIn!  Description Plan, organize and lead R&D; efforts including moderate risk design, implementation, and experimental evaluation. Primary focus will be on new and improved instrumentation for electrophoretic separations and detection.Present and document work in the form of invention disclosures, internal reviews and reports, peer-reviewed publications, and presentations at international scientific conferences.Collaborate with external experts and entities in vetting next-generation concepts and technologies for use in future product innovations. Utilize leadership skills to negotiate, persuade, and build consensus among team members.Identify and develop best practices for use of computer-based tools for design and analysis of systems, subsystems and components.Evaluate and oversee implementation of new designs from concept to manufacturing.Provide leadership, mentoring and coaching support to engineering team members from all disciplines.Lead small cross-functional teams through sustaining engineering activities, problem solving and root cause analyses to support product designs in the field Job Requirements QualificationsPhD (preferred) or Master's degree plus significant experience in Chemistry, Optical Engineering, or Applied Analytical Science, or its equivalent.Experience with capillary electrophoresis, microfluidics, and optical detection (including UV absorbance, laser induced fluorescence, imaging, and fluorescent labeling chemistries) is required.Demonstrated experience (3+ years) in design and development of analytical instrumentation, preferably in a commercial setting using an established design and development process.Strong instrumentation design (prototyping) and troubleshooting skills are required.Proactive, results-oriented, self-motivated team player with growing leadership skills and excellent written and verbal communication skills.Demonstrated track record of achievements in original research or innovation in new technology development.Experience with application specific modeling and prototyping using MATLAB, LabView, Zemax, or Solidworks is required.Experience with mass spectrometry and coupling microfluidic separations with MS is advantageous.an outstanding technical leader willing to cross functional disciplines to lead, build consensus and momentumability to write effective system and subsystem requirements, manage traceability, and author verification procedures is highly desirabledemonstrate an innovative approach to design and drive development projects from concept to completionmust have a passion for engineering and be dedicated to achieving results Danaher Corporation Overview  Danaher is a global science&technology; innovator committed to helping our customers solve complex challenges and improve quality of life worldwide. Our world class brands are leaders in some of the most demanding and attractive industries, including life sciences, medical diagnostics, dental, environmental and applied solutions. Our globally diverse team of 67,000 associates is united by a common culture and operating system, the Danaher Business System, which serves as our competitive advantage. We generated $18.3B in revenue last year. We are ranked #162 on the Fortune 500 and our stock has outperformed the S&P; 500 by more than 1,200% over 20 years.  At Danaher, you can build a career in a way no other company can duplicate. Our brands allow us to offer dynamic careers across multiple industries. We're innovative, fast-paced, results-oriented, and we win. We need talented people to keep winning. Here you'll learn how DBS is used to shape strategy, focus execution, align our people, and create value for customers and shareholders. Come join our winning team."}