{"jobID": "2816971084", "jobLocation": "Southfield_MI", "jobTitle": "Developer (Mid-Level or Senior), Portal Services", "companyRating": null, "companyInfo": {"Website": "www.creditacceptance.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1972", "Type": " Company - Public (CACC) ", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Developer (Mid-Level or Senior), Portal ServicesWhy Work For Credit Acceptance? Credit Acceptance is rapidly-expanding our IT department with a variety of dynamic opportunities. Our culture has landed us on Computerworld's list of the Best Places to Work in IT. In each of the last 4 years, we have held a spot in the top 2 for midsized companies nationwide. In addition, we are also proud to say over the last 5 years we have been named one of Fortune Magazine's 100 Best Companies to Work For. Our team members and culture create a positive workplace that drives us to succeed, making Credit Acceptance one of the largest used car finance companies nationally.  We offer a great work environment, awesome team members, competitive benefits, progressive career opportunities, a casual dress code and we work hard to ensure every team member is empowered to work to their fullest potential. Credit Acceptance offers team members:The opportunity to work with progressive tools, and technology including the latest database, development, storage, and computer technologies availableExtensive growth opportunities as demonstrated by our track record of promoting internallyAn atmosphere that is collaborative, challenging, and filled with forward thinking team membersOngoing business training and career development opportunitiesStrong work-life balance with generous PTO beginning on day 1Competitive market-based salary with quarterly profit sharing and annual merit bonusesExcellent benefits package that includes 401(K) match, adoption assistance, tuition reimbursement, comprehensive medical/dental/vision along with additional benefits that make us a great place to workWe are hiring aDeveloper (Mid-Level or Senior)within our Portal Services Department.Design, develop, test and implement features and code using Java / J2EE, AjaxHelp End Users Understand application features to accomplish their business purposesPartner with Database and Middleware Administrators to achieve great application performanceDemonstrate advanced skills while coaching and mentoring less senior team membersResponsibilities in your area will include:Design, code, test and deliver insightful and architecturally sound business solutions on high complexity workDocument code and projects so others can easily understandFulfill customer requirements as measured in customer survey scoresShow insight; know your application design & data; offer simple, working solutionsApply team coding, documenting and testing standards and recommend process improvementsRecognize upstream and downstream impacts; communicate effectively (verbally & in writing)Learn the Business Process Your Application Supports so your code will better support the businessImprove your application and team processesDecrease incidents and increase uptime of your applicationAll other duties as assignedAttendance as required by departmentPosition Requirements:Required:Mid-levelBachelor's Degree in Computer Science, MIS, CIS or related field OR equivalent experienceMinimum of 3 years' experience with multi-tiered Web Application Development, using LiferayMinimum of 3 years' experience with HTML, CSS, Liferay site structure (XML), Liferay themes & templates, and JavaScriptMinimum of 3 years' experience using web servers, application servers, and RDBMSPractical expertise in software Development Life Cycle (SDLC)Proficiency in writing SQL queriesUnderstanding of data modeling conceptsWillingness to participate in an on-call development rotation 24x7x365Remain compliant with our policies, processes and legal guidelinesWork onsite at the required CA work locationSeniorBachelor's Degree in Computer Science, MIS, CIS or related field OR equivalent experienceMinimum of 5 years' experience with multi-tiered Web Application Development, using LiferayMinimum of 5 years' experience with HTML, CSS, Liferay site structure (XML), Liferay themes & templates, and JavaScriptMinimum of 5 years' experience using web servers, application servers, and RDBMSPractical expertise in software Development Life Cycle (SDLC)Proficiency in writing SQL queriesUnderstanding of data modeling conceptsWillingness to participate in an on-call development rotation 24x7x365Remain compliant with our policies, processes and legal guidelinesPreferred:Mid-levelLiferay DXP development experienceExperience with Web Services and SOAExperience with OSGI or similar frameworkSenior Financial Services Industry experienceKnowledge of Unix Scripting and job schedulingKnowledge of PL/SQLKnowledge and Skills:Soft skills required for the role. Typically on existing profiles as KSAs, Knowledge and Skills, or under Basic Requirements.Please remove duplicates.Company Values: To be successful in this role, Team Members need to demonstrate the characteristics of PRIDE in their work: Positive: Maintain a positive attitude by focusing on solutions and promoting a collaborative and enjoyable environment.Respectful: Value teamwork, share successes, appreciates others and communicates in a way that promotes trust.Insightful: Make timely well-considered decisions, create innovative solutions and continuously learn.Direct: Communicate clearly and objectively; don't be afraid of difficult conversations. Raise concerns through the proper channels.Earnest: Be honest, sincere and consistent. Work hard and pursue our goals together relentlessly. Required degrees must have been earned at institutions of Higher Education which are accredited by the Council for Higher Education Accreditation or equivalent.  Credit Acceptance is an equal opportunity employer."}