{"jobID": "2815695599", "jobLocation": "Rocklin_CA", "jobTitle": "Sr Product Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.esurance.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " GEICO, Progressive Insurance, Nationwide"}, "estimatedSalary": "79000", "jobDescription": " Esurance is looking for a Sr. Product Data Analyst to join a dynamic and award-winning team of individuals who are committed to making insurance smarter, easier, and dare we say- cooler. As part of a growing company that is focused on providing an outstanding customer experience, you’ll have the opportunity to expand your skills and discover your potential.  If you’re looking for a career at a socially conscious company that offers great benefits — including matching 401k and tuition reimbursement — then you may have just found your new home.  Esurance combines the spunk of a startup company with the backing of Allstate (the largest publicly held personal lines insurer in the U.S.) to create a unique, energized, and exciting place to work.  The Sr. Product Data Analyst communicates results and makes recommendations to management using business knowledge and extensive data analysis. This role is also responsible for analyzing data from other departments to forecast and consult on business process impacts. The Sr. Product Data Analyst is responsible for preparing and presenting data stories and assisting with the business dashboard buildout and maintenance.  Job Responsibilities Makes recommendations to Sr. Management using complex data driven decisions which creates value within the department.Creates matrixed dashboards and KPIs and charged to assist business making decisionsDocuments and reports on business-related data and how it impacts current business applications and workflow processes. Reporting responsibilities include measuring items worked or premium related metrics, policy behavior and impact, expense costs, and policy outcomes tracked.Works directly with business leaders to define and design reports that measure the effectiveness of the department such as staffing models and budget forecast against actual expenditures or other metrics as needed.Understands the workflow and process of the business group and designs reporting which allows for quick assessment of progress and improvement against objectives.Able to find and understand data elements within data repository using multiple sources to express trends and outcomes. Using databases that contain policy, claims and underwriting information.Become subject matter expert on data related to the business department and act as data liaison for other departmentsPrepare presentations and ad hoc reports.Work with business staff to understand day to day activities and leveraging that knowledge using analysis.  QualificationsDetail-oriented with strong organizational skills, able to work well under deadlines in a changing environment and perform multiple tasks effectively and concurrently.Demonstrated ability to manage relationships with both internal and external customers.Demonstrated ability to work effectively independently and within a collaborative team oriented environment using sound judgment in decision-making.Excellent communication skills both oral and written with strong analytical and problem solving skills.Demonstrated proficiency with Microsoft Office products (Outlook, Excel, PowerPoint, and Word).Ability to work with data repositories.  Experience / EducationBachelor's degree in business, statistics, mathematics, finance, a related field required.4+ years of hands on analysis experience required.Report maintenance and design and business presentation preparation experience required.Prior underwriting, claims, or other insurance analysis experience a plus.Technical skills for aggregating, manipulating and analyzing data to inform business decisions.PL/SQL needed. Python/R and VBA a bonus  Physical Demands and Work Environment Representative of those that must be met by an employee to successfully perform the essential functions of this job. Must be able to operate a PC and sit for extended periods of time. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Benefits At Esurance, being committed to our employees is not just something we say, it’s something we do. Our benefits package is designed to help our associates stay healthy, meet their long-term financial goals, and balance the demands of work and personal life. Esurance rewards hard work, dedication, and creativity with competitive salaries and a generous bonus system. We are committed to our employees and we are dedicated to creating a diverse, positive, innovative and team-oriented work environment.  Health & wellness Medical, vision, and dental insuranceLife insurance (company-paid and supplemental)Accidental death and dismemberment coverageWellness coaching and incentivesGroup critical illness coverageAccident indemnity and hospital indemnity plansGroup legal Savings 401(k) plan with annual matching contributionReferral bonusesPerformance-rewarding bonus systemTuition assistance program (up to $5,250 per year)Health savings and flexible spending accountsCommuter benefits Family & Community Adoption assistanceMaternity leaveBuckle Up Baby programPet insurance discountCharitable gift matchingGive Time, Get Time volunteer programEmployee Assistance Program Time off Short-term disabilityLong-term disability (employee-paid option)Paid time off (holidays, vacation, personal choice days)"}