{"jobID": "2794830409", "jobLocation": "Muskegon_MI", "jobTitle": "Assistant Property Manager (part time)", "companyRating": "4.5", "companyInfo": {"Website": "www.genebglick.com", "Headquarters": "Indianapolis, IN", "Size": "501 to 1000 employees", "Founded": " 1947", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "38000", "jobDescription": "We are looking for an exceptional Assistant Property Manager to join our team at our 304-unit Carriage House and Hickory Village apartment communities located in Muskegon! This position is part time at 20 hours per week.Position Overview:Responsible for assisting the Property Manager with ensuring the community generates a satisfactory cash flow, the property is maintained in accordance with Company standards and assures customer satisfaction. Manage the property in the absence of the Property Manager.Essential Job Functions:Promptly answer telephone and e-mail inquiries with the goal of obtaining an appointment to show the community to the prospective resident.Greet prospective residents, demonstrate the features and benefits of the interior of the apartment homes and amenities, explain terms of occupancy, and provide information about local areas.Close the sale with prospective resident and obtain a holding deposit and application for an apartment or waiting list.Promptly follow up with prospective residents whom have not yet leased to continue the sales process and secure the sale.Determine and certify the eligibility of prospective residents, following government regulations and Company procedures.Assist Property Manager with all marketing and sales activities including advertising promotions marketing surveys of competitors’ activities. Pursue and collect rent payments and accurately record remittance. Investigate complaints, disturbances and violations and resolve problems following management rules and regulations.Prepare, submit and maintain accurate records, reports and documents.Ensure confidentiality of all data in the resident files (i.e. income, credit reports, assets, etc.).Provide information and reports in coordination with other departments as needed.Conduct all activities in accordance with HUD regulations and Fair Housing requirements.Process move in and move out documents.Requirements:High school diploma or equivalent combination of education, training or experience.Property Management experience preferred.Must be detail oriented and organized. Must have and maintain a valid Driver’s License in the state of residence.Able to work a varied schedule including weekends.Must be able to communicate effectively verbally and in writing.Must be able to read and comprehend the English language."}