{"jobID": "2834362819", "jobLocation": "Springfield_VA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.baesystems.com/us", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Northrop Grumman, Lockheed Martin, Raytheon"}, "estimatedSalary": "108000", "jobDescription": "Job Description The Data Scientist will support the National Geospatial-Intelligence Agency's Maritime Safety Office. The analyst must be knowledgeable on how to acquire, analyze, compile, and disseminate maritime safety information and intelligence to populate and update nautical databases to support the List of Lights (LoL) publications. Work includes referencing source material to update publications, updating and/or writing new entries, submitting work through the QA/QC process, and meeting deadlines. Attention to detail is critical. Candidate must have knowledge and familiarity with Notice to Mariners. Must be able to balance various projects in a self-driven environment.  Typical Education & Experience Typically a Bachelor's Degree and 2 years work experience or equivalent experienceRequired Skills and Education 3 to 10 years of programming skills Ability to write scripts including Python and JAVA scripts.Superior knowledge of feature data services and data modelling.Superior knowledge of ESRI ArcGIS and ArcServer.Superior knowledge of geospatial database content management.Superior knowledge of data format conversion.Knowledge of coordinate systems (latitude and longitude, UTM) and their conversions.Knowledge of projections and their properties and conversions.Knowledge of symbolization rules (how symbols are used to portray features)Knowledge of generalization rules.Minimum 2 years of experience working with data quality control tools including ArcGIS Data ReViewer.Proficient with ESRI Workflow Manager WMX and TAM.Experience working with geospatial data in a multi-user enterprise environment.Demonstrated ability in writing SQL Preferred Skills and EducationExperience with combining digital cartography, computer technology, GIS, cartographic and geospatial production techniques, remote sensing, photogrammetry, and digital data formats.Demonstrated knowledge of Microsoft Access databasesUnderstanding of cloud architecture About BAE Systems Intelligence & Security BAE Systems Intelligence & Security, based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we dofrom intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels. That's BAE Systems. That's Inspired Work. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression. To see Inspired Work in action, visit ****************** and follow us on Facebook: ********************************* on Company Website  Job ID: 37570BR  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  BAE Systems  BAE Systems is a global defence, aerospace and security company employing around 83,400 people worldwide. Our wide-ranging products and services cover air, land and naval forces, as well as advanced electronics, security, information technology, and support services. We provide some of the world's most advanced, technology-led defence, aerospace and security solutions and employ a skilled workforce of some 83,400 people in over 40 countries. Working with customers and local partners, we develop, engineer, manufacture and support products and systems to deliver military capability, protect national security and people and keep critical information and infrastructure secure. Contact Info Springfield, VA 22150"}