{"jobID": "2803185899", "jobLocation": "San_Francisco_CA", "jobTitle": "Head of Enterprise Marketing and ABM", "companyRating": null, "companyInfo": {"Website": "www.doctorondemand.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Doctor On Demand is growing quickly as more businesses and health plans discover the value of providing their members with access to high-quality healthcare through an exceptional product experience. To accelerate our growth, we are seeking an experienced and strategic-minded senior B2B marketer and leader. In this role, you will have the chance to develop unique ABM programs that focus on Doctor On Demand's largest prospects. This role will work closely with our Marketing and Enterprise Sales teams to develop highly targeted programs and content that generate awareness, and build and accelerate the pipeline.  You will help us win employer and health plan partnerships by discovering the right targeting and messaging to influence decision makers. You have a history of generating leads and awareness for B2B products. We are looking for a resourceful, driven, team player with a competitive spirit, and strong business acumen to help our company reach new levels of company growth and be a change agent. This is a senior position, reporting to the Chief Marketing Officer and based in San Francisco. Job Responsibilities:Lead key Enterprise Marketing initiatives in close collaboration with SalesIdentify target accounts and develop overall strategy to raise awareness and consideration for Doctor On Demand solutionsDevelop compelling, highly-targeted 1:1 and 1:few marketing campaigns and programs that successfully engage target accounts, generate and accelerate pipeline/opportunities for SalesPlanning, organizing, and executing integrated, multi-channel campaigns including: emails, webinars, events (trade shows, speaking opportunities, industry events, benefit fairs), digital/social programs/advertising, direct mail, content syndication, web presence, and moreDevelop customized thought leadership and content-led programs specific to the needs of individual target accounts and influencing decision makers at different stages in the sales cycleCoordinate with other Marketing team members/disciplines (including Product Marketing, Content Marketing, Digital Marketing, Creative, etc.), providing clear direction to maximize integrated effortsDrive market awareness, and promote thought leadershipCapture and measure leads across the full funnel, from raw to qualifiedDrive the development content including case studies, industry research, one-pagers, and videosBe a strategic partner to the Sales and Account Management teams, helping define and communicate our value proposition and competitive positioning to prospective customersManage Enterprise Marketing budget to drive high value leads, strengthen market position and build awarenessSome travel requiredExperience:Ten to fifteen years of experience in Enterprise B2B MarketingSuccessful history of developing and executing demand generation and pipeline-building marketing programs, including events, email, digital, social, webinars, publications, and moreExperience marketing products and solutions to large companies. Candidates with experience marketing to Fortune 500 companies with Consumer, SaaS, Finance and/or Benefits products are encouraged to apply for this leadership positionDeep understanding of pipeline analytics and managementAbility to work in a cross-functional role and influence the direction and focus of projects outside of your immediate reporting structureExperience managing a marketing budgetExperienced in meeting individual business objectivesExperience acting as a liaison between Sales and Marketing teamsStrong written, visual, and verbal communicatorAbility to be both an individual contributor with a hands-on attitude, as well as build out a successful team commensurate with the growth of the companyAbility to run marketing tests and measure ROIMarketo (or equivalent Marketing automation platform) and Salesforce experienceAdvanced computer and analytic skills, including experience creating client presentations using Microsoft Office programs and use of client databasesBachelor's degree in marketing, finance, or business administration. MBA a plusAbout Doctor On Demand Doctor On Demand's mission is to improve the world's health through compassionate care and innovation. We believe that health is personal, and means so much more than treating illness. We're proud of the care we've provided over the years and the relationships we've developed with our patients, as evidenced by the 5-star reviews we continually receive. People use our service to gain access to some of the best physicians and licensed therapists in the country, all whenever and wherever is most convenient. It's as simple as opening the Doctor On Demand app on a smartphone or computer.  Through live video visits, our hand-picked, US-trained doctors take patient history, perform an exam, and recommend a treatment plan. Prescriptions, if needed, go directly to the pharmacy of choice. While insurance isn't required, tens of millions of Americans enjoy covered medical and mental health visits through employer and health plan partnerships. To learn more about the hundreds of medical issues we treat, visit us at DoctorOnDemand.com"}