{"jobID": "2836808999", "jobLocation": "Chantilly_VA", "jobTitle": "Sr Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.aciworldwide.com", "Headquarters": "Naples, FL", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Public (ACIW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " Join us as we “DRIVE PAYMENTS AT THE SPEED OF CHANGE”.  At ACI Worldwide, we are ACHIEVERS, COLLABORATORS, INNOVATORS. We come together from across the GLOBE with a singular goal – to POWER global commerce with our INNOVATIVE technology solutions.  ACI Worldwide, the Universal Payments company, powers electronic payments and banking for more than 5,100 financial institutions, retailers, billers and processors around the world. ACI software processes $14 trillion in payments and securities transactions for more than 300 of the leading global retailers, and 18 of the world’s 20 largest banks. We have a definitive vision of how electronic payment systems will look in the future and we have the knowledge, scale and resources to deliver it. As a Sr. Data Analyst you too can help us drive payments at the speed of change.  Job Summary:  The role is both business and technology focused and requires a strong understanding of Master Data Management, Data Management, Data Analysis, Data Quality and Business process re-design. You will be responsible for understanding and coordinating across the enterprise business and IT teams regarding initiatives related to Master data, business intelligence, process improvements and data governance. Employ data quality, data cleansing, data analysis skills to gather, analyze, and identify the required data from disparate sources.  This position can be based in Omaha NE, Chantilly VA, East Brunswick NJ, Naples FL!  Essential Duties and Responsibilities: You will work with complex data problems and come up with solutions and communicate/present to the business and technology stakeholders. Develop the necessary documentation for projects (e.g. presentations, business requirements, use cases, functional specifications, end-user documentation, workflow, data flow artifacts etc.).You will ensure quality of enterprise master data for accuracy, completeness and reliability by defining and implementing data standards, policies, controls and programs.Assist in data management, governance, and data quality of master data across various systems.Conduct data cleansing and deduplication as part of data quality initiatives.Develop and document data processes working with business data owners and SMEs to support ongoing maintenance and data integrity.Employ skills in Project management, business analysis, operational excellence and business partnering.Participate in data integration, data profiling, data validation and data quality processes and resolve data mapping and data quality issues in partnership with QA and development teams.Perform data analysis to ensure data integrity, metadata, data standards and data lineage for MDM data intake processes such as integrating and loading new data sources (internal/external) performing data analysis, data profiling and data quality checks/metrics.Ability to work independently and as part of a cross functional team.Understand and adhere to all Corporate Policies to include but not limited to ACI Code of Ethics and Global Information Security.Perform other duties as assigned. Minimum Requirements: Bachelor's degree in computer science, management information systems, Information Management, or related field or equivalent work experience.5-10 years of related experience in relational database structures, Master Data Management, Data Analysis/Data Quality techniques.2 years of experience in full lifecycle MDM projectsMaster Data Domain experience in customer, account or other data domains as an Analyst/Developer/Architect.Highly Desired Skills:Knowledge of payments/financial industryKnowledge Oracle Fusion solutions In return for your expertise, we offer challenge, opportunity, and an excellent compensation and benefits package in a casual environment. Are you ready to help us transform the world of electronic payments?  Position will be posted for 5 business days or until the position is filled.  ACI Worldwide is an AA/EEO employer, which includes providing equal opportunity for protected veterans and individuals with disabilities. "}