{"jobID": "2795736651", "jobLocation": "San_Diego_CA", "jobTitle": "Director, Data Science", "companyRating": null, "companyInfo": {"Website": "www.elevate.com", "Headquarters": "Fort Worth, TX", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Public (ELVT) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our innovative online credit solutions provide immediate relief to customers today and help them build a brighter financial future. We are committed to rewarding borrowers’ good financial behavior with features like lower interest rates, free financial training, and free credit monitoring. Our suite of groundbreaking credit products includes RISE, Sunny, and Elastic. General Summary: This position will lead Elevate’s Data Science efforts to develop and maintain data assets, decision processes, and credit scoring algorithms for use in Elevate’s acquisitions platforms. The Director works with IT, Risk, and Product teams, as well as with other data scientists to develop, evaluate, and implement data and scoring products to drive underwriting, strategy, and decisions. The Director consults with other scientists and engineers to develop and implement data structures required to support advanced algorithms and decisioning logic. Principal Duties and Responsibilities:Manage and lead a team of data scientists who develop data and algorithms for customer acquisitions.Conduct research and development projects to improve loss and approval rate performance using new methods and new data.Develop data and algorithms to support improvements in through-the-door approvals, fundings, fraud reduction, loss rates, and other key metrics for each of Elevate’s products.Identify and utilize new data sources and new scores for inclusion in Elevate’s progression of internally-developed predictive models.Collaborate with Risk Management and Product leaders to develop data requirements for all products and channels.Partner with IT and Risk counterparts to ensure effective curation and governance of data resources.Maintain strong relationships with IT, Risk Management, Legal, Compliance, and other support functions to ensure alignment of Data Science initiatives with Company objectives.Experience and Education:Advanced degree (MA/MS/MBA/PhD/DSc) in an analytical field preferred.6+ years of experience developing, deploying, and using statistical models and machine learning algorithms.Demonstrated experience in data development and management in large-scale databases.Management experience, preferably of large groups of quantitative analysts and modelers.Required Skills and Abilities:Ability to thrive in a dynamic and fast-paced environment and drive change, and collaborate effectively with a variety of individuals and teams.Broad knowledge of credit and credit bureau data.Demonstrable expertise with machine learning techniques and algorithms: decision trees, penalized regressions, bootstrap aggregation, boosting, model ensembling, model stacking, and other methods of contemporary predictive analytics.Demonstrable expertise with multivariate statistical methods, including cluster analysis, linear PCA, and factor analysis.R, Python, and other high-level languages; C++ a plus.Strong understanding of databases, database architecture, and high performance computing frameworks (Spark, Hadoop)Strong analytical, statistical, and problem solving skills.Strong planning, organizational, people, and project management skills.Excellent interpersonal, verbal and written communication skills."}