{"jobID": "2831034863", "jobLocation": "Dallas_TX", "jobTitle": "Data Analyst I", "companyRating": "3.4", "companyInfo": {"Website": "www.parklandhospital.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1894", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": "Looking for your next opportunity? If so, choose Parkland and discover what a meaningful job feels like. Whether you work directly with patients or use your talent to support our care, you’ll be part of a team that’s providing valuable health services to Dallas County residents. And here, you’ll have the opportunity to put all your skills to work, and the support to grow and advance in your job and your field. Step into a career that will make a substantial difference for our patients—and for you. We blend cultures, talents, and experience into an exemplary health and hospital system. Parkland has earned distinction as one of America’s Best Hospitals by U.S News and World Report every year since 1994.Responsible for assisting with the operational responsibilities of data analysis and reporting functions for assigned area in order to assist management in the successful analysis and achievement of goals. Education:-Must have a Bachelor's degree in a related field such as healthcare, business administration, or management information systems.-Prefer a Master's degree in a related field.Experience:-Must have two years of experience in analysis of healthcare or business related data and information systems.Equivalent Education and/or Experience-May have an equivalent combination of education and experience to substitute for both the education and the experience requirements. Certification/Registration/Licensure:-Current license or certification in area of clinical expertise may be required.Skills or Special Abilities:-Must be able to successfully pass the Standard-level Microsoft Access test, as established by Employment Services, with a minimum score of 80%.-Must be able to successfully pass the Standard-level Microsoft Excel test, as established by Employment Services, with a minimum score of 80%. -Must have good verbal and written communication skills. -Must be able to demonstrate a basic knowledge of program evaluation methods, statistical analysis, research skills, management information systems, and strategic planning. -Must be able to demonstrate proficiency in personal computer usage. -Must be able to demonstrate a working knowledge of statistical analysis, database design and analysis and management information systems. -Must be able to demonstrate knowledge with regard to the software application used in the assigned area. (Some areas use statistical software such as SPSS or SAS.)-Prefer a working knowledge of Seagate Crystal Reports and Microsoft SQL.Parkland Health and Hospital System prohibits discrimination based on age (40 or over), race, color, religion, sex (including pregnancy), sexual orientation, gender identity, gender expression, genetic information, disability, national origin, marital status, political belief, or veteran status."}