{"jobID": "2829034926", "jobLocation": "Dallas_TX", "jobTitle": "Reporting Data Analyst", "companyRating": "2.5", "companyInfo": {"Website": "www.balglobal.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " The Reporting Data Analyst is responsible for activities related to report development and data analysis in support of business processes and data-driven decision making in internal and client fora.  • Plan, develop, and deliver reports in response to both internal and external requests. Prepare viewable summaries of data (excel reports or other outputs/visualizations) for consumption by non-technical stakeholders throughout the firm and select clients.Deploy statistical models in analyzing data.Develop descriptive, predictive and prescriptive models using programing languages such as Python.Create standard development procedures to ensure consistency.Partner with IT, Practice Management, Operations, and other stakeholders to deploy skills and capabilities towards supporting data driven decision making.Collaborate with other Reporting Analysts to develop and improve the firm’s reporting system and overall capability.Analyze and validate data to provide assurance of accuracy and validity of critical business information.Document reports and implement business intelligent framework to accelerate future report building.Maintain accurate knowledge of intracompany systems to assist legal and operations teams in accessing information. Minimum Education Level:Bachelor’s degree in Statistics, Data Science, Information Systems, or related field or equivalent experience. Experience:3 to 5 years’ required experience in report development and data analysis using SQL and Python.Additional experience using Tableau, Microsoft Power BI, or other business intelligence tool preferred.Prefer experience in building and developing reports to support data-driven decision making in a professional services industry, preferably Human Resources or Immigration. Skills and Abilities:Commitment to excellence and high standards.Ability to manage priorities and workflow.Proficiency with Microsoft Office Suite, SQL, and Python.Acute attention to detail.Ability to deal effectively with a variety of individuals at all organizational levels.Good judgment with the ability to make timely and sound decisions.Creative, flexible, and innovative team player.Ability to communicate professionally and effectively in person, on the phone, electronically, or through other means to individuals and groups.Ability to work well with minimal supervision.Sensitivity to confidential information.Excellent customer service and interpersonal skills.Ability to work on multiple tasks simultaneously.Ability to meet deadlines and goals."}