{"jobID": "2812872022", "jobLocation": "Plano_TX", "jobTitle": "Sr Master Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.drpeppersnapplegroup.com", "Headquarters": "Plano, TX", "Size": "10000+ employees", "Founded": " 2008", "Type": " Company - Public (DPS) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Master Data (MD) operations team member ensures customer data is maintained as per Company data standards, control requirements and defined service level agreements (SLAs). Support related business projects/initiatives.  Driving for results leads to recognition and personal growth within the company, helping us to achieve our goal to \"Be the Best Beverage Business in the Americas\". The success that comes from within each of us is recognized, and creates opportunities for your growth in the organization.  Position Responsibilities Ensure master data is maintained as per data standard, control requirements and defined service level agreements (SLAs). The Product/Material analyst will process requests in Cornerstone and Probe.Support business projects, RCI initiatives, and be able to meet business needs and requirements in addition to regular data maintenance.Support relationships with key stakeholder groups, and collaborate with manager and team to support business needs.Identify and implement process improvement ideas. Work with management to support upstream and downstream business groups and optimize the end to end process.Ensure compliance with SOX and internal controls in order to mitigate operational/business and financial reporting risk.Build and maintain a solid base of skills and business knowledge and foster an open and supportive team environment.Demonstrate Action Behaviors.Fulfill Role Requirements as defined for position in the following categoriesBusiness OrientedCommunicating and Dealing with Direct ManagerDrive for ResultsProblem SolvingTechnical ExpertiseLeadership SkillsTeam buildingWorking with OthersHigh School degree required5 years of business experience with Material master data3 years of SAP experience or similar system experienceIntermediate to Advanced Excel skillsMaster Data/Data Standards Application experience Dr Pepper Snapple Group, Inc. (NYSE: DPS) is the leading producer of flavored beverages in North America and the Caribbean. Our success is fueled by more than 50 brands that are synonymous with refreshment, fun and flavor. We have 6 of the top 10 non-cola soft drinks, and 11 of our 14 leading brands are No. 1 in their flavor categories. In addition to our flagship Dr Pepper and Snapple brands, our portfolio includes Sunkist soda, 7UP, A&W;, Canada Dry, Crush, Mott's, Squirt, Hawaiian Punch, Peñafiel, Clamato, Schweppes, Rose's and Mr & Mrs T mixers.  Dr Pepper Snapple Group is an equal opportunity employer and affirmatively seeks diversity in its workforce. Dr Pepper Snapple Group recruits qualified applicants and advances in employment its employees without regard to race, color, religion, gender, sexual orientation, gender identity, gender expression, age, disability, genetic information, ethnic or national origin, marital status, veteran status, or any other status protected by law. EOE Minorities/Females/Protected Veterans/Disabled.SDL2017"}