{"jobID": "1780903553", "jobLocation": "Burbank_CA", "jobTitle": "Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.prolim.com", "Headquarters": "Farmington Hills, MI", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Description:PROLIM Global Corporation (www.prolim.com) is currently seeking Big Data Engineer in Burbank, CA with one of our top Clients. Job DescriptionBig Data EngineerThe purpose of the opportunity is to identify, propose, develop, validate, and deploy innovative data insight systems to business partners within the company. ResponsibilitiesLeads and supports efforts to provide timely, relevant, and clean data to various groups within the Company.Identify, propose, develop, validate, and deploy innovative data insight systems to business partners.Provide business insights by integrating data from disparate systems and services in maintainable ways and developing validated solutions to provide those insights.Provide support to other engineers in the form of solution identification, mentoring, automation and data or effort validation.Identify opportunities for data sharing and develop federated systems to supply that data. Basic Qualifications.8+ years of software engineering 5+ years of large scale systemsA strong knowledge of the Java programming languageWorking experience with Hadoop batch processing system and the map-reduce horizontally scalable paradigmExperience with the Linux operating systemStrong grounding in object oriented programming, aspect oriented programming, design patterns, concurrency, algorithms & data structuresDevelopment experience using service oriented architecture, JAX-RS and JAXB . Strong ability to research solutions, processes, industry trends and best practices.Experience with alternative data processing platforms including Storm, Spark, Shark, Apache Mesos, Hive, PIG, and Apache CrunchExperience with an analytical approach to tuning modelsExperience with machine learning and machine learning libraries like Apache MahoutExperience with deployment environments and systems including Amazon Web Services & ChefExperience with diverse storage systems, platforms and methods including hBase, MongoDB, Apache Avro, PostgreSQL, Greenplum, TeradataExperience with data integration including Apache Camel, Spring Batch and TalendExperience with pilot application frameworks including Spring Roo, GWT 2.0, Portlets and Spring MVCExperience with disciplined development practices including using tools like Maven, TestNG, Findbugs, CheckStyle, Checker, Sonar, wikis, coding standards and GitExperience working in an evolved technical organization including contributing to and following coding guidelines, best practices, documenting, and presenting at brown bags, professional groups and conferences.Experienced in participating in scrum or other agile development environments. Apply online for immediate consideration, please send your updated resume and contact info via email rohit.sheelvant@prolim.com or Contact (248) 8760896 Ext 225. About PROLIM Corporation PROLIM is a global company focused on product innovation by leveraging IT and PLM Technologies. PROLIM has more than a decade of PLM Service history serving Automotive, Aerospace, High Tech and Industrial Machinery companies throughout the world.Our Product Lifecycle Management (PLM) practice is powered by a team of consultants who provide comprehensive end-to-end service offerings. We have a PLM Center-of-Excellence (CoE) that enables our customers to build innovative solutions to the most-pressing PLM challenges. The CoE is supported by the right skills, resources, technologies and methodologies and helps develop customized solutions to better manage the entire product lifecycle. "}