{"jobID": "2823704255", "jobLocation": "San_Diego_CA", "jobTitle": "#94196 Business Intelligence Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.ucsd.edu", "Headquarters": "La Jolla, CA", "Size": "10000+ employees", "Founded": " 1960", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "49000", "jobDescription": "UCSD Layoff from Career Appointment: Apply by 06/25/2018 for consideration with preference for rehire. All layoff applicants should contact their Employment Advisor. Eligible Disability Counseling and Consulting services (DCC) or Special Selection clients should contact their Vocational Rehabilitation Counselor for assistance.DEPARTMENT OVERVIEWThe Department of Medicine (DoM) is the largest department within the UCSD School of Medicine (SoM) and is responsible for fulfilling its teaching, research, and clinical missions. DoM employees approximately 500 salaried faculty, nearly 200 academic appointees, and more than 300 residents, fellows, and postdocs, supported by almost 1,000 staff members. The Business Services Office (BSO) functions within DoM Administration and interfaces with data and individuals throughout the department, SoM, campus, and Health System, regarding financial and operational matters. The business intelligence team represents an effort to improve data-driven decision-making by creating actionable information through data mining, analysis, reporting, and statistical forecasting.DESCRIPTIONUnder the Director of Fiscal Affairs in DoM BSO, this position is responsible for development and maintenance of data warehouse and associated data marts integrating disparate sources to produce actionable financial and operational information in support of DOM's academic, clinical, and research missions. Skills and experience as a seasoned data-analytics professional will be applied to diverse projects of medium size at all levels of complexity, or to portions of large, multidimensional projects, where analysis of data requires the evaluation of identifiable factors. The position will demonstrate good judgment in selecting methods and techniques for creatively and practically be resolving a wide range of issues in accordance with best practices and policies; show initiative in independently identifying process- and system-enhancement opportunities with implementation proposals; and present actionable information to internal and external stakeholders from varied professional backgrounds and disciplines.  This is a highly specialized position that has the responsibility for serving DoM as a lead professional regarding complex analytical issues and topics: Complete projects accepted from a diverse range of personnel, acting as a positive and contributing team player with strong professional commitmentAct in a lead professional capacity possessing a high level of knowledge and recognized as an expert/authority in their area.Applies expertise to address and evaluate significant business needs/problems and complex issues to ultimately provide recommended solutions.Research, analyze, and evaluate financial and operational proposals and relevant policies, procedures, and regulations.Respond to requests by converting data to actionable information through the application of data mining and statistical analyses sufficient to provide forecasts and recommendations to leadership.Develop and maintain data systems through ETL leveraging common programming languages, such as SQL/T-SQL, C#, VBA, Python, and/or SAS/R Script.  Uses skills as a seasoned, experienced professional with a full understanding of industry practices and organizational policies and procedures; resolves a wide range of issues in imaginative as well as practical ways. Works on problems of diverse scope where analysis of data requires an evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions. Contacts are both internal and external to the department.MINIMUM QUALIFICATIONSMaster's degree in business, data, health and life-science analytics, health informatics or applied statistics and/or an equivalent combinations of education and experience.Thorough knowledge of finance policies, practices, and systems.Lean Six-Sigma Green Belt or above and/or equivalent experience/training.Ability to independently gather the required information to organize, and perform financial analysis assignments. Must have the ability to identify issues; analyze data; develop, recommend, and implement, solutions.Proven ability to effectively present information verbally and in writing in a clear and concise manner. Must have demonstrated the ability to clearly and concisely convey technical information, both written and verbal, to a broad audience. Experienced with Microsoft Word, PowerPoint, and Outlook. Experienced in documenting results of reporting procedures, requirements, and reports, in a highly organized fashion both with internal collaborators and external stakeholders.Proven ability using spreadsheet and database software for complex financial analysis, fiscal management, and financial reports. The expert user with proven experience in using Microsoft Access, Microsoft Excel, and SQL or other data-server architecture.Proven interpersonal skills with peers throughout the organization; strong service orientation and critical thinking skills; and attention to detail. Proven ability using organizational skills to multi-task in a high volume environment. Adept at presenting opportunities and information in a tactful and diplomatic manner, with consistency in exercising independent judgment and discretion in matters of significance.Ability to adapt to changing priorities. Strong initiative and ability to work and appropriately prioritize independently in a dynamic environment.Ability to function as a member of a team. Acts as a positive and contributing team player with strong professional commitment.Thorough knowledge and understanding of internal control practices and their impact on protecting University resources.Analytic ability and judgment from a business perspective in financial, operational, technical, and other fields, to develop cost-effective recommendations on financial, operational, process, and internal control issues.Proven ability to code T-SQL through database management system or other IDE.Proven ability with in-depth knowledge to utilize SQL and SQL Server databases, Tableau, Microsoft Excel, and other reporting software to analyze data and design and generate reports at an advanced level. Ability to implement report automation when applicable, as well as develop a distribution protocol.Working knowledge of Statistical Analysis Software, such as SAS and/or R/RStudio.Working ability to read and write several software programming languages, such as SQL/T-SQL, SAS, R Script, C#, Python, and/or VBA.Experienced developing ETL layer and building, programming, and maintaining, databases and data warehouses.SPECIAL CONDITIONSEmployment is subject to a criminal background check and pre-employment physical.Occasional evenings and weekends may be required."}