{"jobID": "2802743946", "jobLocation": "Plano_TX", "jobTitle": "Data Analyst I", "companyRating": "3.5", "companyInfo": {"Website": "www.insight.com", "Headquarters": "Tempe, AZ", "Size": "5001 to 10000 employees", "Founded": " 1988", "Type": " Company - Public (NSIT) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CDW, PCM, SHI International"}, "estimatedSalary": "55000", "jobDescription": " Data Analyst I     As a Data Analyst I at Insight, you’ll process manufacturer rebate information and keep track of data using SAP. To do this, you’ll have to work across various departments within the company and with our external partners. Another of your objectives will be to identify areas in the process to improve and make more efficient.      What you’ll do:     Connect. Work across the company and interact with our teams in Bid Accounting, Price Protection, Purchasing, Product Management, Bid Desk and Sales. Make sure everyone is on the same page and executing under the same agreement.      Review and analyze. Understand contract language in order to effectively manage to the terms and conditions of each program. Analyze new promotions and programs to assess their profitability.      Manage and administer accurate special pricing programs. You’ll also be responsible for some quality control process and for pull various ad hoc reports.      What we need:    High school diploma and 2-4 years of related professional experience.Solid communication skills (verbal and written) and the ability to effectively present information to managers, clients and other teammates.Problem solving, organization and time management skills.Ability to work under strict service level agreements (SLAs) and to multi-task effectively. The position described above provides a summary of some the job duties required and what it would be like to work at Insight. For a comprehensive list of physical demands and work environment for this position, click here.    About Insight Insight’s success begins with our people making meaningful connections every day. Our culture lives in our teammates. Insight is looking for great people who will embrace our values of Hunger, Heart and Harmony. Hunger to create new opportunities for our clients. Heart to make a positive impact in people’s lives. Harmony to celebrate each other’s unique contributions to bring solutions to clients.     Join our team as we work to deliver the best solutions through Intelligent Technology Solutions™, the new IT. Global technology provider of IT hardware, software and service solutionsFortune 500 company founded in 1988 with clients around the globe$5.5 billion in revenue for 20166,400+ teammates worldwide2017 Arizona’s Most Admired Companies (AZ Business Magazine), 2016 Best Places to Work (Phoenix Business Journal)2017 Dell EMC Titanium Black Partner, 2016 HP US Personal Systems Reseller of the Year, 2016 Cisco Gold Certification in North America, Microsoft’s largest global partner    Today's talent leads tomorrow's success. Learn about careers at Insight: jobs.insight.com.     Insight is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation or any other characteristic protected by law.     Posting Notes: Plano || Texas (US-TX) || United States (US) || OPS || None || US - Plano, TX ||"}