{"jobID": "2725282427", "jobLocation": "Washington_DC", "jobTitle": "Functional Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": null, "jobDescription": " Functional Data Analyst Req #: 206121Location: Washington, DC USJob Category: ConsultingSecurity Clearance: SecretClearance Status: Must be ObtainableJob Description CACI seeking a Jr. Functional Data Analyst to provide on-site support to a U.S Navy customer in Washington, D.C. The analyst will work with the CACI team to support the Navy by performing data research, analysis, interpretation, and presentation of the defense-oriented budget material. Responsibilities:Create detailed graphs, charts, and presentations slides in support of the development of the Program Objective Memorandum (POM) and Budget Estimate Submission (BES) leading to the formulation of the annual Navy Budget input to the DoD Planning, Programming, and Budget Execution (PPBE) processCollaborate with Navy financial analysts to gather data and respond to emerging tasks from senior leadershipAssists analysts in properly loading, updating, and auditing records in the Navy Program Budget Information System (PBIS)Support CACI operations and maintenance of the Navy Program Budget Information System (PBISAssist the Navy in archiving data and documentation related to the PPBE and POM processesRequired Skills:Typically requires a bachelor’s degree or equivalent and 0-2 years of experienceOutstanding organizational skills to manage requests for various collections of dataAbility to become proficient in the use of an enterprise-wide financial databaseProficiency using MS Office, especially Excel and PowerPointExperience using complex software applications or systemsAbility to provide professional customer supportStrong work ethic with the ability to learn quicklyExcellent communication and presentation skillsAbility to obtain a DoD Secret clearanceDesired Skills:Experience with Federal Planning, Programming, and Budget Execution (PPBE) processExperience supporting DoD or a Federal government agencyExperience with a Federal enterprise-wide financial systemExperience with the Navy and NMCI environmentActive DoD Secret ClearanceJob Location US-Washington-DC-WASHINGTON DC  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}