{"jobID": "2832816807", "jobLocation": "Skokie_IL", "jobTitle": "Research Scientist", "companyRating": "2.9", "companyInfo": {"Website": "www.criver.com", "Headquarters": "Wilmington, MA", "Size": "5001 to 10000 employees", "Founded": " 1947", "Type": " Company - Public (CRL) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " Research Scientist  Req ID #: 36511 Location: Skokie, IL, US  For 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work we perform. In return, we'll help you build a career that you can feel passionate about.  Job Summary  Serve as a scientist in the conduct of assigned nonclinical research studies of basic complexity, to include study management, interpretation and reporting of study data, and assuring the regulatory compliance of these projects. ESSENTIAL DUTIES AND RESPONSIBILITIES:With guidance from senior scientific staff, serve as a study director in the direction and execution of assigned studies in compliance with GLP regulations as they apply to the conduct of nonclinical research.Generate high-quality protocols, amendments, and reports appropriate for assigned studies.Review, interpret, integrate, and present data on assigned studies, using the assistance of senior scientific staff as appropriate.Function as contact, with guidance from senior scientific staff, for the planning and execution of sponsor interaction related to assigned studies, including proposal management and study scheduling, conduct and reporting.Provide technical guidance to the research staff.Attend scientific meetings, conferences and training courses to enhance job and professional skills.Function as lead technician on complex studies when needed.Perform training of technical staff on complex generation designs and equipment.Perform all other related duties as assigned.QUALIFICATIONS:Bachelor's degree (B.S./B.A.) or equivalent in a scientific related discipline. Related Master's degree (M.S./M.A.) or Ph.D./D.V.M. preferred.Minimum of 5 years related experience in the contract research or pharmaceutical industry, to include at least 2 years as a Research Associate or equivalent role.An equivalent combination of education and experience may be accepted as a satisfactory substitute for the specific education and experience listed above.Effective written and verbal communication skills. Ability to handle multiple projects, prioritize work and meet deadlines. Proficiency in the use of standard software including Microsoft Excel, Word, PowerPoint, etc. and with standard laboratory calculations. About Safety Assessment  Charles River is committed to helping our partners expedite their preclinical drug development with exceptional safety assessment services, state-of-the-art facilities and expert regulatory guidance. From individual specialty toxicology and IND enabling studies to tailored packages and total laboratory support, our deeply experienced team can design and execute programs that anticipate challenges and avoid roadblocks for a smooth, efficient journey to market. Each year approximately 120 investigational new drug (IND) programs are conducted in our Safety Assessment facilities.  About Charles River  Charles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients' clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.  With over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client's unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.  At Charles River, we are passionate about our role in improving the quality of people's lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.  For more information, please visit **************.  Charles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet  Nearest Major Market: Chicago  Job Segment: Research Scientist, Toxicology, Biotech, Scientific, Science, Research, Engineering"}