{"jobID": "1634245980", "jobLocation": "Jersey_City_NJ", "jobTitle": "Senior Quantitative Analyst SQL", "companyRating": "3.9", "companyInfo": {"Website": "www.sg.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "154000", "jobDescription": " Major Financial Corporation - excellent team, great working environment & quality of life  The Senior Quantitative Specialist is responsible for designing, developing and testing quantitative pricing and risk models in the fixed income domain. Principal Responsibilities: : Assist in identifying fixed income risk issues and providing solutions  : Construct, verify/validate and maintain a library of models to support the fixed income business lines  : Participate in the development of risk management tools by enhancing existing analytical models and focusing on designing and implementing new models (e.g. VaR, back test, stress test, etc.)  : Implementation of pricing models and risk models across different fixed income asset classes, including interest rate models and volatility models etc. Experience: : 7+ years relevant fixed income quantitative modeling experience. Knowledge and Skills Required: : Strong knowledge with quantitative models such as multi-curve framework, interest rate models and volatility models etc.  : Hands-on experience with model implementations using Monte Carlo simulation, tree method and finite difference method etc..  : Strong knowledge with risk models such VaR, expected shortfall and Greeks and their implementations for fixed income products in a cross asset classes setting etc.  : Familiarity with fixed income asset classes - both plain vanilla types and derivatives - and market conventions, particularly in government securities and Agency mortgage backed securities.  : Solid mathematical background with top level quantitative knowledge and skills in probability theory, statistics, econometrics and PDE etc.  : Experiences with C++ and with at least one of the following tools: R, MatLab or SAS.  Experience with SQL programming is a plus.  : Excellent communication and presentation skills. Education, Training &/or Certification: : Ph.D in a quantitative discipline  Why work with me? Your resume won't get lost in the \"black hole\" ; you will get feedback and follow through. I will provide a resume review, create relevancy for the position ; you will receive better information on the company culture and inside information on the hiring manager, team, the ideal profile, etc. ; and. the best Interview preparation you will ever experience!  http://www.linkedin.com/in/michaelmande"}