{"jobID": "2686039440", "jobLocation": "Mountain_View_CA", "jobTitle": "Sr. Data Science Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.veritas.com/company/careers", "Headquarters": "Mountain View, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " EMC, CenturyLink, IBM"}, "estimatedSalary": "150000", "jobDescription": "Veritas' vision is to enable organizations to thrive in this new world of digital business.Did you know that the International Data Corporation (IDC) predicts that data will double every 2 years, reaching 44 zetabytes by 2020? That's more bytes than gallons of water in the ocean and an exponentially growing problem for businesses. Veritas helps organizations harness the power of their data & turn it into actionable insights.We believe information is everything! Data is an organization's digital currency; a critical business asset that is growing in value. We are the only company that provides a data management platform to address the core challenge of accessing, managing, and analyzing all of their data, no matter where it is, in real time - allowing organizations to truly maximize the value of their data.Company & Team OverviewVeritas serves the world’s largest and most complex organizations by providing industry-leading solutions that enable them to harness the power of their information. Veritas provides end to end solutions for backup with products such as Access, NetBackup, Cloudpoint appliances and has over 25K deployed appliances around the globeWe are seeking a highly motivated individual to join the Veritas AI & Machine Learning team and lead development of Machine Learning Models for autonomous storage machines.What you will be doing:Design and Develop reusable Machine Learning Models that can predict reliability of the various Veritas appliances using Machine Learning techniques Develop reusable data pipelines and deployment of Machine Learning Models at Scale in CloudResearch and develop statistical learning models for data analysisCollaborate with product management and engineering departments to understand company needs and devise possible solutionsCommunicate results and ideas to key decision makersImplement new statistical or other mathematical methodologies as needed for specific models or analysisOptimize joint development efforts through appropriate database use and project designQualifications:Master’s Degree in Computer Science, Statistics, Applied Math or related fieldKnowledge of various machine learning algorithms, statistics, and mathematics principles2+ years of experience with statistical analysis languages such Python and/or R2+ years’ practical experience with Spark ML, ETL, data processing, database programming and data analyticsExtensive background in data mining and statistical analysisAble to understand various data structures and common methods in data transformationExcellent pattern recognition and predictive modeling skills"}