{"jobID": "2813128387", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Clearance Level Must Currently Possess:No Active Clearance RequiredClearance Level Must Be Able to Obtain:No Active Clearance RequiredSuitability:Public TrustJob Family:Information TechnologyJob Description: General Dynamics Information Technology and CSRA have united to create the premier provider of high-tech IT solutions to the government IT market. Together as General Dynamics Information Technology, we deliver cost-effective, next-generation IT solutions and services to the Department of Defense, the intelligence community and federal civilian agencies as they modernize their information systems.  The Federal Deposit Insurance Corporation [FDIC] mission is to preserve and promote public confidence in the U.S. financial systems by insuring deposits in banks and thrift institutions for up to $250,000; by identifying, monitoring, and addressing risks to the deposit insurance funds; and by limiting the effect on the account and the financial system when a bank or thrift institution fails. CSRA provides the day-to-day operational services to FDIC in support of infrastructure, facilities, hardware, software, and systems. CSRA supports operational security, client support/help desk, data center operations, asset management, and systems engineering service areas. The FDIC Engineering team provides support to a plethora of cutting-edge technologies across the IT spectra. It has a state of the art development lab to test new functionality, architectures, and equipment. Engineers are tasked with developing and deploying innovative solutions to meet business requirements - not managing day to day, same technology operations.  GDIT/CSRA is seeking a Data Analyst for the FDIC infrastructure program. This resource will be responsible for overseeing and managing all engineering resources and projects. U.S. Citizenship and background investigation is required; you must have a current clean financial background. (Though the position is 8-5 M-F, the role requires flexibility to support issues or planned activities after hours, weekends and holidays as needed.) Successful candidate must possess and be able to demonstrate technical skills and engineering attitude for success, dedication and commitment.  Task and responsibilities in this role include, but are not limited to the following:  · Develops, inspects, mines, transforms, and models data to raise productivity, improve decision making, and gain competitive advantage.  · Conducts statistical analysis on data and information to ensure correct predictive forecasting or classification.  · Manages all aspects of end-to-end data processing utilizing customized report building functions of systems.  · Maintains analytical systems, verifies the accuracy of the data, and acts as liaison with business.  · Analyze, correlate and respond to Security Reports and Feeds  · Analyze, correlate and respond to Security Alerts and Alarms  · Interpret and apply security policies and procedures  · Participate in vulnerability reporting activities  · Support activities to identify security issues and risks and then develop mitigation plans  · Provide information security reporting, including security metrics as required  · Provide analysis and trending of security log data from various security devices  To qualify, you must meet these basic qualifications:  · Experience with data analysis and interpreting vulnerability management reports  · Solid Microsoft Excel and analytical skills  · Experience with system management and security reporting tools such as BigFix, SCCM, and Tenable  ·  · Tenacity, integrity, persistence, and willingness to learn  · Ability to solve complex problems  · Use critical thinking and reasoning to make analytic determinations  · Works effectively in a collaborative environment  · Strong communications skills to both technical and non-technical audiences  · Excellent problem management skills  · Excellent time management skills  It would be great if you also had:  Completed a degree program in the fields of mathematics, statistics, computer science, computational sciences, or a passion for rigorous analysis of data  A BA or equivalent + 3 yrs related experience, or MA + 1 yr related experience  Picture yourself in a place where your work can make a real difference in your life and the lives of those you love; where teams successfully collaborate and you have access to an array of resources to ensure your ideas can thrive. That place is CSRA - the largest provider of next-generation IT solutions and services to the U.S. government. As a CSRA employee, you get to be part of exceptional team supporting our nation’s most critical missions. We give you the tools to be successful; all you need to do is bring your best ideas, your energy and a desire to develop your skills, experience and career. # of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Telecommuting Not AllowedWork Location:USA VA Arlington - 3701 N Fairfax Dr (VAC016)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}