{"jobID": "2830797321", "jobLocation": "Fort_Sam_Houston_TX", "jobTitle": "Computer Engineer/Electronics Engineer/Computer Scientist (Recent Graduate)", "companyRating": "3.0", "companyInfo": {"Website": "www.dia.mil", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Duties Help Duties Summary  About the Position: Are you interested in helping to defend our Nation? Exciting career opportunities are available with the U.S. Army Network Enterprise Technology Command (NETCOM)!  Who May Apply: Recent Graduates  Positions may be filled as permanent, temporary or term. Temporary positions may be extended up to a maximum of three years. Term positions may be extended up to a maximum of six years.  Learn more about this agency ResponsibilitiesDuties described reflect the full performance GS-12 level. At the GS-05, GS-07, GS-09 and GS-11 levels, the duties will be performed in a developmental capacity under close supervision.Observe operations, resolve problems, provide briefings and reports.Conduct operational testing of systems and equipment.Design test methodology and prepare test plans.Prepare procurement specifications for contractual support.Complete projects to include planning, development and technical analysis. Travel Required  50% or less - Travel requirements vary by grade and position. While a few positions may require 50% business travel, most positions will have 10-30% business travel required.  Supervisory status  No  Promotion Potential 12Job family (Series) 0854 Computer Engineering  0855 Electronics Engineering  1550 Computer Science  Similar jobs Computer Applications EngineersEngineers, Computer ApplicationsRequirements Help Requirements Conditions of Employment Appointment may be subject to a suitability or fitness determination, as determined by a completed background investigation.This position requires the incumbent to obtain and maintain the appropriate Information Assurance certification in accordance with DoD 8570.01-M, Information Assurance Workforce Improvement Program, within 6 months of entry onto duty.This position may require the incumbent be able to obtain and maintain a determination of eligibility for a Secret or Top Secret security clearance or access for the duration of employment.This position may require the incumbent to take and successfully pass a Counterintelligence Scope Polygraph (CI/Poly).This position may have a Temporary Duty (TDY) or business travel requirement of up to 50% of the time.See \"Additional Information Section\" for additional requirements.QualificationsWho May Apply:Recent graduates who were awarded a degree by an institution of higher education not more than 2 years before the date of appointment of the applicant.Current students who will graduate no later than 90 days from their date of application.For a person who has completed a period of obligated service in a uniformed service of more than 4 years, the degree may be awarded by an institution of higher education not more than 4 years before the date of appointment of the applicant. In order to qualify, you must meet the education and/or requirements described below. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community; student; social). You will receive credit for all qualifying experience, including volunteer experience. Your resume must clearly describe your relevant experience; if qualifying based on education, your transcripts will be required as part of your application. Additional information about transcripts is in this document.  Meeting the Basic Requirements for either the Computer/Electronics Engineer or Computer Scientist listed in the education section is qualifying for the GS-05 level. In addition to meeting the basic requirements to qualify for this position at the GS-07 or above, you must also meet the qualification requirements listed below: GS-07: Specialized Experience:One year of specialized experience which includes applying basic formulas to routine calculations; preparing graphs, or tables for others; and assisting with field inspections or data gathering. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-05). OR Education: One full year of graduate level education in a field which demonstrates the knowledge, skills, and abilities necessary to do the work of the position, such as: Engineering or Computer Science. OR Superior Academic Achievement. In order to be creditable under this provision, Superior Academic Achievement must have been gained in a curriculum that is qualifying for the position to be filled, such as that identified in Education above. Superior Academic Achievement is based on:  (1) Class Standing - Applicants must be in the upper third of the graduating class in the college, university, or major subdivision, such as the College of Liberal Arts or the School of Business Administration, based on completed courses; OR  (2) Grade-Point Average - Applicants must have a grade-point average of either (a) 3.0 or higher out of a possible 4.0 (\"B\" or better) as recorded on your official transcript, or as computed based on 4 years of education, or as computed based on courses completed during the final 2 years of the curriculum; or (b) 3.5 or higher out of a possible 4.0 (\"B+\" or better) based on the average of the required courses completed in the major field or the required courses in the major field completed during the final 2 years of the curriculum.; OR  (3) Honor Society Membership - Applicants may be considered eligible based on membership in one of the approved national scholastic honor societies listed by the Association of College Honor Societies (https://www.achsnatl.org/). OR Combination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) by 18. Add the two percentages. GS-09: Specialized Experience: One year of specialized experience which includes reviewing technical aspects of applications, statistical data, designs or proposed plans for compliance. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-07). OR Education: Master's or equivalent graduate degree or 2 full years of progressively higher level graduate education leading to such a degree in a field which demonstrates the knowledge, skills, and abilities necessary to do the work of the position, such as: Engineering or Computer Science. OR Combination of Education and Experience:: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the first year (total graduate semester hours minus 18) by 18. Add the two percentages. GS-11: Specialized Experience: One year of specialized experience which includes reviewing technical aspects of applications, designs or proposed plans; and performing administrative duties such as reviewing, coordinating and monitoring implementation of policies, and conducting analysis of data to support conclusion or recommendations. This definition of specialized experience is typical of work performed at the next lower grade/level position in the federal service (GS-09). OR Education: Ph.D. or equivalent doctoral degree or 3 full years of progressively higher level graduate education leading to such a degree in a field which demonstrates the knowledge, skills, and abilities necessary to do the work of the position, such as: Engineering or Computer Science. OR Combination of Education and Experience: A combination of education and experience may be used to qualify for this position as long as the computed percentage of the requirements is at least 100%. To compute the percentage of the requirements, divide your total months of experience by 12. Then divide the total number of completed graduate semester hours (or equivalent) beyond the second year (total graduate semester hours minus 36) by 18. Add the two percentages. Education When qualifying on the basis of education: Applications can be accepted from students who expect to complete qualifying education within 90 days from the date of application. You must still include transcripts with your application package, showing the courses and semester hours you have completed and courses in-progress, even though you have not earned a degree yet. You will not be able to start employment until you have completed the full education requirement and final transcripts have been verified. Basic Requirement for Computer Engineer/Electronics Engineer: A. Degree: Bachelor's degree (or higher degree) in engineering. To be acceptable, the program must: (1) lead to a bachelor's degree (or higher degree) in a school of engineering with at least one program accredited by the Accreditation Board for Engineering and Technology; OR (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in five of the following seven areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials (stress-strain relationships); (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. OR B. Combination of Education and Experience: College-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following: Professional registration or licensure - Current registration as an Engineer Intern, Engineer in Training, or licensure as a Professional Engineer by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.Written Test - Evidence of having successfully passed the Fundamentals of Engineering examination, or any other written test required for professional registration, by an engineering licensure board in the various States, the District of Columbia, Guam, or Puerto Rico.Specified academic courses - Successful completion of at least 60 semester hours of courses in the physical, mathematical, and engineering sciences and that included the courses specified in A above. The courses must be fully acceptable toward meeting the requirements of an engineering program.Related curriculum - Successful completion of a curriculum leading to a bachelor's degree in an appropriate scientific field, e.g., engineering technology, physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a degree in engineering, provided the applicant has had at least 1 year of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions.Basic Requirement for Computer Scientist: Degree: Bachelor's degree (or higher degree) in computer science or bachelor's degree (or higher degree) with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus.  FOREIGN EDUCATION: If you are using education completed in foreign colleges or universities to meet the qualification requirements, you must show the education credentials have been evaluated by a private organization that specializes in interpretation of foreign education programs and such education has been deemed equivalent to that gained in an accredited U.S. education program; or full credit has been given for the courses at a U.S. accredited college or university. For further information, visit: http://www.ed.gov/about/offices/list/ous/international/usnei/us/edlite-visitus-forrecog.html"}