{"jobID": "2824430813", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Quality Analyst - Corp", "companyRating": null, "companyInfo": {"Website": "www.ecisolutions.com", "Headquarters": "Fort Worth, TX", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Epicor Software, SAP"}, "estimatedSalary": null, "jobDescription": "Job DetailsLevel ExperiencedJob Location Fort Worth, TX - Fort Worth, TXPosition Type Full TimeEducation Level BA/BSSalary Range UndisclosedTravel Percentage No travelJob Shift DayJob Category Information TechnologyDescriptionThe Data Quality Analyst will work with a talented team of CRM administrators, marketers, sales teams and business leaders in a highly collaborative environment. The Analyst is responsible for successfully maintaining and developing the prospect and customer database including import of new records, updating, and de-duplicating existing records and identifying outdated records to be purged. Data sources vary from lead generation programs to internal and external sources.  Support the delivery of important data to key stakeholders by maintaining the accuracy of reports and dashboards Assists in research and development of additional metrics.  Scope of Responsibility:  This person will be responsible for improving data quality and recommending solutions and best practices to ensure accurate data to guide business decisions.  Responsibilities include but not limited to:  · Record de-duplication, both on an individual and mass scale  · Write custom scenario mappings  · Mass edit records  · Test new processes and recommend streamlined procedures  · Identify and correct database errors  · Understand order of operations  · Understand end-user information needs and delivery key data to guide decision-making  · Ability to be self-directedQualifications· 2 years plus of experience as a Salesforce Administrator, Configuration Analyst or Business Analyst  · Business requirements definition and planning experience  · Experience with gathering requirements and managing expectations between internal teams and Senior Leadership Team  · Proven ability to build and maintain strong relationship with business partners  · Excellent communication skills (written, verbal) and facilitation skills  · Strong analytical skills  · Ability to review, analyze, and evaluate business systems and user needs.  Desired Additional Knowledge & Skills:  · Advanced skills with Excel  · Strong analytical, technical and problem-solving skills  · Excellent verbal and written communications skills  · Ability to work independently, yet function as a team member  · Strong familiarity with Salesforce.com or a similar CRM system  · Ability to be flexible in prioritizing work, managing multiple tasks, and meeting deadlines  · Ability to work collaboratively with both internal and external groups  · Works well under pressure while maintaining tact and professionalism  Education/Certifications:  · 1-2 years in data management, data mining, analysis and use of relational databases  · Bachelor’s degree in IT, Business or related field preferred  In addition to our competitive salary and award winning culture, we offer an excellent benefit package that includes medical, dental, vision, 401(k) plan with matching, short and long-term disability, and life insurance. We even offer our employees a day off to serve their community. Our company core values are our “CODE”: Crave Greatness, Own the Outcome, Deliver Awesome and Embrace Community. Does this sound like you or someone you know that may be looking for a new opportunity? Please apply on our website at www.ecisolutions.com/careers. Candidates responding to this posting must currently and in the future possess the eligibility to work in the United States.ECi is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, disability, military status, or national origin."}