{"jobID": "2730888673", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Associate Scientist I, In Vivo Biology", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": " Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products Imbruvica, Venclexta, and Empliciti and a pipeline containing multiple promising new molecules that are being studied in nearly 200 clinical trials in 19 different types of cancer.  AbbVie is expanding its oncology hub on the West Coast, with three sites in the San Francisco Bay Area (Redwood City, South San Francisco, and Sunnyvale) focused on the discovery and development of novel oncology therapies. More than 1,000 AbbVie scientists, clinicians, and product developers with strong entrepreneurial roots work across these three sites. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. This position is based at Stemcentrx, AbbVies South San Francisco, CA location.  As part of a talented and multi-disciplinary team advancing an exciting new approach to drug discovery and development, the successful candidate will perform in vivo experiments on Abbvie Stemcentrx second shift in the In Vivo group. Duties include, but are not limited to, constructing tumor xenograft models, weekly tumor measurements, administering therapeutic agents through various routes, PK, organizing/analyzing data and results, flexible in working longer hours and strong team player. The successful candidate will be expected to efficiently monitor effects of therapeutic agents on tumor growth, metastasis, survival, and overall animal health. Key Requirements Include:Minimum 1-3 years of directly related experience; new Bachelor graduates will be considered with degree in Animal Science or experience with Animal HusbandryAALAS certification is preferred but not requiredAbility to multitask and meet deadlines in a fast-paced environmentOrganized and disciplined about record keeping, with proficiency in Microsoft OfficeAble to perform occasional physical labor involving lifting weight up to 50 poundsWilling to split weekend and holiday hours with peers on a rotational basisExcellent verbal and written communication skillsStrong organizational skills, motivated to excel, attentive to detail, and can be efficient working alone or in a group environmentQualifications Key Requirements Include:Minimum 1-3 years of directly related experience; new Bachelor graduates will be considered with degree in Animal Science or experience with Animal HusbandryAALAS certification is preferred but not requiredAbility to multitask and meet deadlines in a fast-paced environmentOrganized and disciplined about record keeping, with proficiency in Microsoft OfficeAble to perform occasional physical labor involving lifting weight up to 50 poundsWilling to split weekend and holiday hours with peers on a rotational basisExcellent verbal and written communication skillsStrong organizational skills, motivated to excel, attentive to detail, and can be efficient working alone or in a group environmentEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}