{"jobID": "2822530646", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.crowdstrike.com", "Headquarters": "Sunnyvale, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": " CrowdStrike started with a mission to revolutionize the entire approach companies take to security. CrowdStrike has disrupted the multi-billion dollar endpoint security market with innovative technology, services delivery, and intelligence gathering. Our groundbreaking technology ensures that organizations can not only defend themselves but also do so in an efficient and future-proof manner. Today, the company continues to drive major innovations around AI/machine learning, behavioral-based prevention and detection, etc.to stay ahead of adversaries. We are one of the World's Most 50 Innovative Companies according to MIT, and one of Forbes Most Promising Companies. We are valued at over $3 billion dollars and continue to meet explosive global customer demand. We have received a number of exciting awards including:June 2018: Closed over $200 million, led by General Atlantic, Accel and IVP, with participation from March Capital and CapitalG (Google), achieving a valuation of more than $3 billion.April 2018: CrowdStrike Wins SC Award for Best Security Company Second Year in a Row.October 2017: 100 Best Medium Workplaces for 2017 by Fortune magazine.May 2017: Closed $100 million equity financing round, at a valuation of over $1 billion dollar (backed by Accel, CapitalG, and Warburg Pincus). Reporting into the VP/Finance, the Data Analyst will join a small and growing team and will support major projects and initiatives for all things data and reporting related. This proactive team member will be responsible for developing data sets, KPI’s and dashboards highlighting operational and financial KPI’s that drive meaningful, data drive decision making. ResponsibilitiesBuild presentations shared with the Board of DirectorsProduce weekly/monthly/quarterly preparation of KPI’s delivered to the C-SuiteMaintain and report on a portfolio of SaaS metricsProperly categorize deals into the correct revenue and product categoriesLiaison with Sales to forecast bookings from various sourcesLeverage and optimize business applications such as Domo and Salesforce, driving towards reporting automation and data integrityInstitute best practices and scalable processes including data flowHandle a variety of ad hoc analysis requests spanning multiple departmentsRequirementsBachelor's degree in business, statistics, mathematics, accounting, finance, economics or similar, MBA preferredExperience working at a SaaS business, preferably during a sustained high-growth periodAble to effectively communicate across various levels in the organizationExpertise in business applications including advanced Excel, PowerPoint, Salesforce and BI (Domo a plus)Proficient in SQLStrong analytical background and ability to flush out anomaliesCapable of delivering against aggressive timelinesAbility to work in a fast-paced environment and manage through ambiguityA demonstrated history of being a positive team player and desire to get involvedAbility to commute to downtown Sunnyvale CrowdStrike believes that diversity and inclusion among our organization is essential to our success as a global company, and we seek to attract, retain and empower the industries best and brightest from a diverse talent pool. CrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law."}