{"jobID": "2822861856", "jobLocation": "Moorestown_NJ", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Title: Senior Data Scientist Location: Moorestown, NJ 08057 - Must be willing to work on-site Duration: 12 Month Contract with possible extension Summary: DoD Contract - Must be US Citizen to apply.  CSS Staffing is seeking a Data Scientist to support Rotary and Mission Systems teams and their customer.  The successful candidate will be fully integrated into the team's efforts, from analysis of initial customer requests for information, through data collection support utilizing Big Data and other tools, through delivery of collected data in a format that supports analyst and customer needs.  Candidate will design and develop methods, processes, and systems to consolidate and analyze structured and unstructured, diverse sources including big data sources.  Develop and use advanced software programs, algorithms, querying and automated processes to cleanse, integrate and evaluate datasets and models and complex business problems.  Works with cross-discipline teams to ensure connectivity between various databases and systems.  May develop information tools, algorithms, dashboards, and queries to monitor and improve business performance. Has various tool knowledge with both software development and engineering research to create models of relevancy.  Experience designing efficient algorithms with programming languages and tools for data manipulation and statistical analysis.  Experience designing efficient data mining and text mining frameworks with related tools. Required Skills & Experience: Bachelor's in Mathematics, Statistics, Computer Science or equivalent  Must have strong problem-solving skills, business acumen, and demonstrated excellent oral and written communication skills.  Must have experience with R, SAS, Python, Matlab, SQL, Hive, Pig, and Spark  Cloud - AWS and/or OpenStack  Web Services/API knowledge (REST, GraphQL)  Common data transport formats (e.g., JSON, XML, Parquet, Avro, Proto Buf)  Experience with Java and/or Python programming  Experience with both SQL and NoSQL databases Desired Skills: Applying data science against open source media to support Intelligence collection and data fusion.  Predictive Modeling  Story-Telling and Visualization  Distributed Computing  Basic understanding of Data Science concepts  Experience with Agile development processes  Experience with Hadoop Ecosystem (e.g., MapReduce, Hive, Pig, Spark, HBase, Kudu, Impala, HDFS)"}