{"jobID": "2424470455", "jobLocation": "Placentia_CA", "jobTitle": "Converting Packer", "companyRating": null, "companyInfo": {"Website": "www.arlon.com", "Headquarters": "Placentia, CA", "Size": "201 to 500 employees", "Founded": " 1958", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " 3M, Avery Dennison"}, "estimatedSalary": null, "jobDescription": "SUMMARY: To pack and label material; and to assist Slitter Operators as material is converted. ESSENTIAL DUTIES AND RESPONSIBILITIES include the following. Other duties may be assigned. Make boxes as required for shop orders.Packing material and label for finished goods.Locate and provide raw materials as needed for packaging.Assist Slitter operators as needed in the department.Available and flexible for work schedule including overtime.PERSONAL CHARACTERISTICS: Must be self motivated, independent worker, team player and detail oriented. QUALIFICATION REQUIREMENTS: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. EDUCATION and/or EXPERIENCE: High school education preferred and 6 months of previous manufacturing experience. LANGUAGE SKILLS: Communication skills, both written and verbal must be at least at an 8th grade level. Must be able to communicate in English and follow work instructions in English. MATHEMATICAL SKILLS: Must be able to do basic arithmetic, including addition, subtraction, multiplication and division. OTHER SKILLS and ABILITIES:Ability to interface with other departments and employees.Ability to follow written Q.S.P.’s and S.O.P.’s that apply to the job requirement.Ability to use rulers and common measuring devises.Must be able to operate a hand truck and a fork lift."}