{"jobID": "2787664000", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.rgp.com", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Public (RECN) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Deloitte, Huron Consulting Group, Point B"}, "estimatedSalary": null, "jobDescription": "Turn experience into opportunity.Leverage your accomplishments to get the kind of employment youve always wanted: a self-directed career with work/life balance, world class clients and high-level initiatives all with the collaboration and support of a global community of seasoned professionals. If you are ready to work directly with business leaders and their teams to solve problems and drive change, then a career at RGP is for you. We are interested in hiring a Data Analyst Consultant to provide overall coordination for the reporting for the divestiture of specific business unit for large commercial public clients. Coordinate the interface with the acquiring company, working with both sides of management to facilitate reporting and answer questions. Work with intercompany account reconciliations, cost allocations and project manage all reporting information and help create management package, understand allocations, direct and indirect costs. Coordinate monthly reporting and reconciliations of accounting for the divested business unit and work with Management and the acquiring company to manage the flow of information, answer questions, coordinate reporting, etc.Professional Qualifications:BS Finance, Accounting or business discipline5-10 years of Data Analysis or Business Analysis ExperienceStrong understanding of financial statements and interrelationship of income statement, balance sheet and statement of cash flows.Excellent interpersonal skills, detail oriented, analytical, work independently and a self-starterAbility to interface with Senior Management and project manage the accumulation of reporting informationAccount reconciliation skills along with financial analysis skills.Software: SAP experience required. Need to be able to access reports and data as needed.Intermediate to Advanced Excel - not an expert, but very strong (data retrieval and downloads)Attributes of our global professionals include: a dedication to client service, the ability to think in complex and ever changing situations, strong communication skills and the ability to solve problems, execute and transfer knowledge.Our Consultants enjoy the flexibility and autonomy to choose the client projects that interest them, while continuing to build professional relationships within our global community of Consultant and business professionals. We offer a comprehensive compensation and benefits package including health and life insurance, a 401(k) savings plan which includes a discretionary company match, employee stock purchase plan, paid personal time off program, professional development and certification courses. For more information please visit us on RGP.com or check us out on LinkedIn.com or Facebook.comRGP is an Equal Employment Opportunity Employer and encourages applicants to apply regardless of race, color, religion, national origin, gender, pregnancy, sexual orientation, gender identity, age, physical or mental disability, genetic information or veteran status. RGP participates in the E-Verify Program. Applicants have rights under Federal Employment Laws. If you are a qualified individual with a disability and need special assistance or an accommodation to use our website, please contact us by email at AskHR@rgp.com, or by phone at 877-261-4901 ext. 3.For more information, please refer to the following links:EEO is the Law Poster l E-Verify Poster l Spanish E-Verify Poster l Right to Work Poster l Spanish Right to Work Poster l Family and Medical Leave Act (FMLA) Poster l Employee Polygraph Protection Act (EPPA) Poster"}