{"jobID": "2835288435", "jobLocation": "Irving_TX", "jobTitle": "SAP Inventory Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.alleareconsulting.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "SAP Inventory Data Analyst Fulltime  Location: Irving, Texas  We have a new job opening for a SAP Inventory Data Analyst to work on-site at our client’s global HQs in Irving, TX. This is a great opportunity to join an enterprise organization that is a global leader in their industry. The SAP Inventory Data Analyst position is critical to building data for the initial go live based on data trends as well as managing this data into the future as we mature in our system. The position is responsible for analyzing data in support of new processes for SAP and for reviewing material usage, purchasing, and inventory data in order to manage data required to automate procurement through MRP for spare parts. REQUIREMENTS5+ years of SAP experience5+ years of inventory analysis experience5+ years of experience with MRPProficient in the use of Tableau or Qlikview/Qliksense data analysisExpert Skills in Microsoft ExcelProficient in Microsoft Access, Word, and PowerPointAbility to turn raw data into logical information for reportingSelf-starter who has extensive knowledge in reporting and analysis to create and analyze standardized and ad-hoc reports and provide to management or end-userAbility to identify problems and issues and assist with reporting questionsExcellent communication and presentation skillsAbove average attention to details, concern for the exact correctness of work, and strong commitment to completing tasks on timeBachelors in Business, Engineering, Computer Science or equivalent**To view all of our open positions, please visit:http://www.alleareconsulting.com/job-openings- provided by Dice  SAP, inventory analysis, MRP, Tableau or Qlikview/Qliksense data analysis"}