{"jobID": "2741105804", "jobLocation": "San_Francisco_CA", "jobTitle": "Director, Business Intelligence/Healthcare Analytics", "companyRating": "3.6", "companyInfo": {"Website": "www.sfhp.org", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": " OverviewAre you a dynamic, self-aware healthcare leader with a passion for analyzing data and who thrives on telling a \"data\" story? Do you enjoy taking teams beyond their comfort zones, mentoring and coaching them to the next level? Do want to help give back to the community and help those who need it most?  The Director of Business Intelligence reports directly to the CFO and works closely with senior management and all levels of staff throughout the organization to lead the transformation of clinical, operational and financial data into information and insight to support SFHP’s strategic decision-making. You will actively participate in the development of long-term analytics strategy planning and ensure data-related policies, procedures and processes are in place to address complex business needs. This role ensures that long-term solution delivery methodologies are followed and that these methodologies deliver quality, reliability, stability and completeness of all data-related programs while also meeting SFHP's financial objectives and the needs. You will also responsible for leading and mentoring the Business Intelligence team, helping them elevate the departments analytic capabilities. WHAT YOU WILL DOUnderstand orgranizational business requirements for data and information to support business strategy and objectives.Lead design sessions in prototyping new data solutions and BI dashboards in collaboration with business users.Review and analyze the effectiveness and efficiency of existing data source systems and develop strategies for improving or further leveraging these systems.Collaborate with ITS (Information Technology Services) Data Management in the planning, development, and deployment of new data solutions, enhancements to existing data solutions and dashboards.Collaborate with IT Data Management to conduct strategic planning activities for the information data system landscape and communicates the outcomes in terms of future-state architectures, strategies and roadmaps for big data and related applications. This will provide direction for the IT function, for business stakeholders and will lead to simplification of the data architecture.Function as a senior-level advisor and business analyst for enterprise scale initiatives on topics related to data and analytics.Serve as the data and analytics Subject Matter Expert in one or more business subjects such as: Finance, Health Services, Operations, Encounter/Claims, Pharmacy, Member and Eligibility, etc.Collaborate with both ITS Data Management Team and business owners to turn data into actionable business insights using self-service analytics and reporting tools.Demonstrate forward thinking and plans ahead for potential roadblocks; comprehends bigger picture of the business strategy.Possess a demonstrated ability to understand and interpret complex data and apply that knowledge to develop and recommend strategic initiatives decisions.Participate or co-lead SFHP’s Data Governance to ensure the adoption and promotion of “Road to An Analytical Organization” strategy within SFHP.WHAT YOU WILL BRINGA Bachelor’s degree or equivalent experience in the Data Sciences field. Master’s degree is preferred.A minimum of 5-7 years of supervisory/management experience.Minimum five (5) years’ experience with health care organizations, particularly in the HMO setting.Knowledge of managed care data including, but are not limited to, claims/encounter, member/eligibility, providers, pharmacy, lab results, ADT, etc.Experience in analysis, interpretation and reporting using medical or administrative data sets.Experience using varied statistical methods.Expert critical thinking and problem solving skills.Superior communication, presentation and influencing skills.Advanced technical skills and expertise with SQL and other Microsoft products.Extensive knowledge of the managed care industry and strong understanding of basic data modeling or data relationship concepts in data warehousing.Extensive healthcare data knowledge and their inter-relationships.Experience partnering with Clinical Services, Care Management or other related area of health care focus.Strong organization, time management and project management skills and multi-tasking abilities.Experience preparing executive level reports and presentations.Prior experience in Government Health Programs e.g. Medicare/Medicaid.Prior experience preparing rate development templates and pricing models.Experience with HEDIS, OSHPD, and standard health care technical guidelines.ABOUT US Established in 1997, San Francisco Health Plan (SFHP) is a an award winning, managed care health plan whose mission is to provide affordable health care coverage to the underserved low and moderate-income residents in San Francisco county. SFHP is chosen by eight out of every ten San Francisco Medi-Cal managed care enrollees and its 145,000+ members have access to a full spectrum of medical services including preventive care, specialty care, hospitalization, prescription drugs, and family planning services. SFHP was designed by and for the residents it serves, and takes great pride in its ability to accommodate a diverse population that includes young adults, seniors, and people with disabilities. San Francisco Health Plan is an Equal Opportunity Employer (EOE) M/F/D/VPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}