{"jobID": "2757671234", "jobLocation": "Newark_NJ", "jobTitle": "CMI Market Intel & Analytics Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.mars.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " Apply now » Apply now  StartPlease wait... CMI Market Intel & Analytics Manager LOCATION:Newark, NJ, US, 07102#job-location.job-location-inline {  display: inline;  }JOB CATEGORY: MarketingREQUISITION NUMBER: 167296A mutually rewarding experience.  Work. Realize your ambitions. And realize there’s more to being in business than just making a profit. That’s the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.  Because it’s never just about a single person, a single project or a single brand. It’s about how you can grab everything that’s within your reach here and use it to pursue mutual, long-term gain. It’s about having ideas. And ideals. Being prepared to risk failure because the promise of success means we’ll all be a little better off. It’s that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job. About Mars, Incorporated Mars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the world’s best-loved brands: M&M;’s®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5™, SKITTLES®, UNCLE BEN’S®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners™. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles – Quality, Responsibility, Mutuality, Efficiency and Freedom – inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.  This role is the co-pilot the Local US Operating Plan by providing a forecast and analysis of US category and our growth in the short and medium term.  Key Accountabilities or Responsibilities: This role is responsible for the leading US Category forecasting and Seasonal forecasting processes and analysis, including driving a rolling forecast view into S&OP;, annual and 5 Year Planning processes. Liaise with Mars CMI on Global Forecasting on process and outputs.Shape, deliver, and communicate marketing insights via use of syndicated data to analyze and understand business performance drivers for Mars and key confectionery competitors (by CBU, by size, channel, key customer, etc.). This includes ad hoc and ongoing analysis of market conditions and performance.Partner with Nielsen to translate business questions into appropriate ongoing reporting and analytic projects that drive better decisions and growth.Be the technical expert on Growth Philosophy and Flywheel, and collaborate with Mars CMI and x-segment on Flywheel metric development, pressure testing and data availability; train and coach local US CMI colleagues in Flywheel analyses; provide guidance on best data sources available.  Context and Scope:Receives leadership and direction from Sr Manager CMI Market Intell & Analytics as a part of the US Business and CMI Global MWC organizationExecutes functional US business plans and contributes to the development of CMI Global functional strategyDecisions are guided by CMI functional and Global strategy and priorities  Qualifications:Bachelor’s degree in related field.Master’s degree a plusMinimum Experience: 3-5 years of relevant experiencePreferred Experience: CMI, marketing and/or finance, with specific experience of Nielsen or IRI databases, CPG experience preferred, but not necessary.  Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request."}