{"jobID": "2771327802", "jobLocation": "Oakland_CA", "jobTitle": "Global Insights Data Analyst Data Science Internship", "companyRating": "4.2", "companyInfo": {"Website": "www.thecloroxcompany.com", "Headquarters": "Oakland, CA", "Size": "5001 to 10000 employees", "Founded": " 1913", "Type": " Company - Public (CLX) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "COMPANY PROFILE: The Clorox Company (NYSE: CLX) is a leading multinational manufacturer and marketer of consumer and professional products with approximately 8,700 employees worldwide and fiscal year 2017 sales of $6 billion. Clorox markets some of the most trusted and recognized consumer brand names, including its namesake bleach and cleaning products; Pine-Sol® cleaners; Liquid Plumr® clog removers; Poett® home care products; Fresh Step® cat litter; Glad® bags, wraps and containers; Kingsford® charcoal; Hidden Valley® dressings and sauces; Brita® water-filtration products; Burt's Bees® natural personal care products; RenewLife® digestive health products; and Rainbow Light®, Natural Vitality®, Neocell® and Stop Aging Now® dietary supplements. The company also markets brands for professional services, including Clorox Healthcare® and Clorox Commercial Solutions®. More than 80 percent of the company's sales are generated from brands that hold the No. 1 or No. 2 market share positions in their categories. Corporate headquarters are in Oakland, California with some functions located in Pleasanton, California -- we leverage our Bay Area location to drive innovation and progress in Marketing. POSITION DESCRIPTION/OPPORTUNITIES WITHIN CLOROX: Overall Job Description  The AGIM is responsible for leveraging Consumer Insights knowledge to drive results for one or more brands, with assistance from their manager. The AGIM handles all aspects of projects with coaching from the manager, while starting to develop business knowledge and strong cross-functional relationships. The AGIM also participates in driving functional excellence and building a world-class organization. AGIM reports to the Global Insights Lead or Global Insights Manager.  Key Job Responsibilities  Drive Functional Excellence Demonstrate working knowledge of research methods by designing, executing, and analyzing the following types of research with assistance from manager:QualitativeConcept/positioningProductAdvertisingPricingPanelSyndicateTrackingImplement best practices to maximize efficiency and efficacy of effortsParticipate in department initiatives to identify and evaluate innovations and leading edge methods Leverage Consumer Insights to Achieve Develop research plans to address business objectivesManage research priorities and track spending to achieve budgetEnsure full utilization of existing research information through data mining & integration of knowledge across diverse areas of consumer & marketplace researchDesign, execute and analyze research to deliver Consumer Insights that will drive business strategies and tactics Develop Business Knowledge to Provide Added Value to Key Business Partners Begin to develop broad-based business knowledgeBegin to develop a strong cross-functional relationships and foster integration of knowledgePOSITION REQUIREMENTS: Education and Experience Enrollment in Bachelor or Masters Degree2-4 years of previous business experienceMarketing Research background or project work a plus Core Skill Sets  Demonstration of strong skills in the following areas: Analytical/Problem SolvingResults OrientedCommunicationTeamworkLeadershipPlanning & OrganizingPOSITION QUALIFICATIONS: Candidates must be must present, upon employment, proof of U.S. citizenship or legal right to regular employment in the U.S. Note: It is the policy of the Marketing organization with The Clorox Company and its affiliates not to employ students in practical training immigration status or persons with other employment-based non-immigrant visa status in regular positions.  The Clorox Company and its subsidiaries is an EEO/AA/Protected Veteran/Disabled/LGBT employer.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}