{"jobID": "2837756880", "jobLocation": "Culver_City_CA", "jobTitle": "Sr. Software Engineer, Data scientist, Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.openpathsystems.com", "Headquarters": "Irvine, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Were looking for a Senior Software Engineer/Data Scientist to join the Openpath team in Culver City, CA. Openpath is a startup company focusing on smart and efficient offices and workplaces. Hence, we are looking for an addition to our team to help us on multiple interesting machine learning projects, including computer vision, image processing, face recognition and performance data analysis, etc to support our current products and build new ones.Responsibilities: Support and maintain our current products and services Developing and building new algorithms for our new products Conducting full research cycle of collecting data, training, and testing and finally deliver ML solutions for our new products and services Developing and building core features using Python/C++ and related frameworks for Computer Vision and image processing Actively participating discussion around design and architecture Building automated tests for APIs used in production and constantly monitor them for bug fixes and performance improvements Staying up-to-date with latest advancements in machine learning techniques by reviewing academic literature, etcRequirements: Minimum of 3 years of experience with Software Engineering, machine learning and data analysis PhD or MSc in computer science or similar fields Deep understanding of machine learning concepts, such as classification, clustering, reinforcement learning, etc. Strong experience in Computer Vision and image processing libraries, especially OpenCV Strong programming and coding skills in prod environments Familiarity with AWS cloud services Familiarity with IOT devices and embedded programmingsPreferred to Have: Experience in deep learning, and neural nets and their libraries such as TensorFlow, Keras, PyTorchContact: careers@openpath.com Openpath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Openpath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process."}