{"jobID": "2836166994", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Data Scientist", "companyRating": "4.9", "companyInfo": {"Website": "www.jbcconnect.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": "Role: MarketingData Scientist Company: MarTech Location: San Francisco, CA Duration: Perm Pay: Dependent on experience  As a Data Scientist you enjoy working with large sets of data, transforming them, and solving complex problems. In this role you will help drive growth of the business through fact-based insights, data-driven analysis and optimization of the ecommerce experience. Responsibilities:Develop, maintain, and optimize customer-data-based modeling (customer segmentation, inventory patterns, customer lifetime value, recommender, multi-touch attribution models).Build custom models to understand customer behavior, marketing analytics, inventory patterns, etc.Capture e-commerce KPIs and analyze trends over time. Perform deep dive analysis into specific KPIs to understand the underlying influences.Gather marketing data, provided insights and build predictive models that increase the effectiveness of marketing campaigns and make strategic recommendations to optimize marketing spend, business processes and maximize profitabilityDevelop an understanding and/or have knowledge of SEO best practices and its impact on traffic and other metricsPartner with marketing team to identify targeted audiences digital media, on-site personalization, and one-to-one marketing (e.g., email, SMS, and direct mail) leveraging transactional data, online-browse behaviors, and 3rd parties.Lead business analysis of customer and business metrics. Provide guidance and frameworks for designing and developing models and analyses across multiple domains including marketing (online/offline marketing mix, multi-touch attribution, multivariate testing) and customer behavior (site traffic, purchase activity, acquisition/retention, predicting lifetime value).The Qualifications:Bachelor' s degree required in Business, Economics/Finance, Engineering, Statistics, Computer Science or related field. Masters a plus.At least 5 years previous work experience in the Marketing Technology space with strong understanding and proficiency of predictive modeling and machine learning techniques.Proficiency in SQL, Excel and at least one of the following: R, and/or Python.Solid understanding of open source data mining/data visualization software packages (e.g. pandas, scikit-learn, matplotlib) a plusExperience with Adobe Analytics (SiteCatalyst / Omniture), Google Analytics, Coremetrics is a plus"}