{"jobID": "2739719347", "jobLocation": "Northbrook_IL", "jobTitle": "Principal Scientist, Bioanalytical", "companyRating": null, "companyInfo": {"Website": "www.astellas.us", "Headquarters": "Northbrook, IL", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Takeda Pharmaceuticals"}, "estimatedSalary": null, "jobDescription": " Developing innovative therapies is one of the most challenging, most essential and personally rewarding fields in science. This is the most exciting time to be a part of Astellas, a company with a uniquely collaborative and patient-focused culture. There's something special about working at Astellas. It's reflected in our focus on the people we serve, the way we treat each other and the results we achieve together as a company. Astellas is announcing a Principal Scientist, Bioanalytical opportunity in Northbrook, IL. Purpose of Position: Participate in clinical development and research activities of Astellas Pharma Global Development, Inc. (APGD) under the supervisor's direction. The scientist will have responsibility in project management with CROs, including transfer or development of Pharmacodynamics and biomarker methods from Astellas or other CROs, clinical sample testing, and data review. The scientist will have increased responsibility in project management with CROs. Coordinate and lead bioanalytical methods development and validations. Assist in clinical trial setup and development by providing scientific expertise and insights. Conduct the measurements of biomarker, PK and immunogenicity in biological specimens according to the principles of Good Laboratory Practices (GLP) regulations. Routinely assist to maintain records in compliance with the regulations. Other relevant duties are as assigned. Essential Job Responsibilities:Develop and validate new assay methods with contracted CROs under limited supervisionPharmacodynamic/ BiomarkersPharmacokineticPharmacogenomicProject management with CROsReview method validation and sample assay reportsPeer-review the data generated by other scientistsCoordinate sample testing and managementMaintain good records and organize retention of all recordsOther relevant responsibilities as assignedScope: Under supervision of laboratory director, develop and implement analytical methods for biomarker and other pharmacodynamic measurements (ie: PGx, CDx) in blood, plasma, urine, and other biological matrices. These assays are essential for clinical pharmacology and clinical studies required to get approval of new drugs. Supervisory Responsibility: No direct supervisory activities involved in this position; however, opportunities to train and direct temporary employees are available (interns, ex-patriots, etc) Required Qualifications:Ph.D. in biological sciences, chemistry, or equivalent with 1+ years of related experience; M.S. with 5+ years of related experience; or B.S. with 10+ years of related experienceKnowledge and experience of immunochemistry, oncology and genomics a plusKnowledge and experience in biological sample preparationsKnowledge of FDA guideline for bioanalytical method validationWorking knowledge of SOPs and GLP regulatory guidanceAbility to transfer and validate ligand binding methodsKnowledge of computer software for laboratory data managementSkills in conducting bioanalytical research with clinical samples, documenting data, and assisting report writing following the regulatory requirementsSelf-motivated, excellent team player with good communication skillsLI-VB Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}