{"jobID": "2803575133", "jobLocation": "San_Clemente_CA", "jobTitle": "Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.crossoverhealth.com", "Headquarters": "Aliso Viejo, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "About Us: Crossover Health is a healthcare organization attempting to redefine how healthcare is practiced, delivered, and financed. We design and deliver the inspiring environments, experiences, and relationships that mobilize people to engage and excel in their health. A passionate commitment to the patient experience creates the magic behind what we do. Crossover Health is currently seeking an experienced Reporting Analyst II for our corporate office in San Clemente. Job Description: Designs, develops and programs methods, processes, and automates systems to consolidate and analyze structured & unstructured diverse data sources to generate actionable insights and solutions for Business Intelligence, Data Scientist, client services and Clinical Operations. Interacts with Business Intelligence, Data Scientist, product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources. Develops models/simulations in support of pricing strategy. Job Duties:Operational Excellence (90%)Ensures effective operations across Clinic Operations and Corporate entities through the development, testing and deployment of online reporting tools and queries, including:New scripts and extension of capabilities of the current scripts to enable data extraction, analysis for all clients and and internal teamPerformance of testing to facilitate improvement in processing time, reliability and overall scripting standardizationAssist other business intelligence team members with the design and implementation of online versions of reporting tools, including dashboards and scorecards, utilized by clinic and client based field teamsCollaborates with the Business Intelligence team on software and improved system processesEnables coordination of population health analysis programs through collaboration with clinical teams in clai-ms-based analysis and analysis of other data sets to inform population health workflowsLeverages administrative and clinical data analysis to inform, influence and support Crossovers stakeholders in operationalizing operational and clinical improvementsProducts/Services (10%)Performs critical analysis in support of products necessary for expansion of services, including referral management, secondary care products, and related services.Required Education, Experience and Skills:Education and ExperienceBachelors Degree in Mathematics, Physics, Economics or Computer Science, or equivalent experience.Minimum of 2 years of experience in data science and/or data analytics.SkillsExperience with Python 3.x (libraries such as Pandas, Dataframes, Numpy, and Scikit-learn).Data visualization experience (Tableau and Keynote).Experience with structured and unstructured data setsExperience in modeling and simulation, particularly cost modelingMySQL data extraction, transformation and loading.Quantifying and presenting results in laymens terms.Reporting The Reporting Analyst reports to the Business Intelligence Manager."}