{"jobID": "2735173368", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Analytics", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " Airbnb has become a global platform that connects travelers and hosts from over 34,000 cities. As such, it has collected a diverse set of data, which our Data Science team mines for insights that will propel our community and product forward. However, information is only as valuable as it is understood by decision-makers. We are looking for talented analysts, at all levels of experience and seniority, that can work cross-functionally with Data Scientists and business partners to translate insights to action.  The ideal candidate has an eye for detail, great communication, and a keenness for problem solving. Examples of projects you would work on include, but are not limited to, creating business critical dashboards, defining key metrics, and investigating challenging questions around user behavior. Working alongside Data Scientists who dig deep into Airbnb's data, you will help them translate complex findings and results into a compelling narrative. In this role, you will have tremendous upwards exposure as the Data Science team’s mouthpiece to senior business partners. If you’re passionate about leveraging data to drive business and product decisions, we want to hear from you.  Responsibilities Ownership: conceptualize, create, and maintain monitoring dashboards for tracking key metricsCommunication: design and draft regular reports of progress towards company goals to product groups and senior stakeholdersCreativity: refine and improve definition of metrics as the company’s challenges and data evolveEngineering: collaborate with data engineers to better log data and manage the timeliness and accessibility of data tablesInvestigation: carry out ad hoc descriptive analysis according to product needs, whether it be potential product opportunities or for debuggingEmpowerment: strategize on making analyses easily repeatable and generalizable by other team members in the future Experience Must have:Professional experience in data analysis and visualizationConfidence with analytical tools such as Excel, R, Python, Stata,or MatlabProven ability to succeed in both collaborative and independent work environmentsExpertise designing and delivering presentations4+ years of applicable industry experience."}