{"jobID": "2657146010", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Scientist, ML Computer Vision", "companyRating": null, "companyInfo": {"Website": "www.autodesk.com", "Headquarters": "San Rafael, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Location: San Francisco, CA- United States  Job ID: 18WD27036 Position Overview The Design Research Group in the Office of the CTO at Autodesk is focused on discovering new, innovative experiences for designers. We have been working on a large-scale research project, trying to use machine learning and deep learning to redefine Computer-Aided Design (CAD) for people who work in the architecture, engineering and construction (AEC) industry. We believe that human-AI collaboration and interaction can create a paradigm shift for the users to design and create better results more efficiently.  During the past year, while we were trying to achieve our goal, we also discovered that there is rich territory for research within and around the intersection between computer vision (CV) and computer graphics (CG), for example, interactive design tools and visual communication tools between the user and computer. Therefore, we are seeking for an expert researcher who is working on the intersection between these two domains to join the journey with us. You might be a CG researcher who is trying to use deep learning methods to solve problems in your domain, or you might be a CV or Deep Learning researcher who is interested in the 2D and 3D representations, especially the ones that are not image-based. We expect you to be able to think out of the box, ask interesting research problems, and provide novel solutions for them. ResponsibilitiesResearch, invent, and implement novel ideas and solutions for interactive design systems using state-of-the-art machine learning and deep learning methodsWrite technical papers to top-tier conferences such as SIGGRAPH, SIGGRAPH ASIA, NIPS, CVPR, ICML, ICCV and ECCVBuild prototypes for deep-learning-assisted interactive design systems with a cross-disciplinary team, including designers, developers, researchers and interns.Keep current with latest trends and technologies to help future research subjects and anticipate development needsMinimum QualificationsPh.D. in Computer Science or any other relevant disciplines with a background in Computer Vision, Computer Graphics, Applied Math, Machine Learning, Deep Learning, and Artificial Intelligence; M.S. in the same field with 3 years research experience in the industry or academiaTop-tier publication records, including but not limited to SIGGRAPH, SIGGRAPH ASIA, CVPR, ICCV, ECCV, NIPS and ICMLBroad and deep understanding and experience of applying machine learning and deep learning to real problems in the fields of vision and graphicsHands-on experience in Machine Learning, Deep Learning, Artificial Intelligence, and Data Science and their frameworks, such as Tensorflow, Pytorch, and CaffeAbility to quickly adapt to new situations and to learn new technologiesAbility to collaborate and communicate effectively with a multicultural local and remote teamPreferred QualificationsKnowledge of 2D and 3D computer graphics and visualization techniquesKnowledge of Computer Vision and/or Machine VisionKnowledge of architectural design and/or construction is a plusExperience with HPC, GPU computing, cloud computing and parallel programming is a plusKnowledge of geometry and topology concepts, representations and data structures (such as NURBS, splines, level sets, surface and volumetric meshes, point clouds, analytical surfaces/solids, functional representations, subdivision surfaces, T-splines, etc.)"}