{"jobID": "2580992017", "jobLocation": "Troy_MI", "jobTitle": "Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.eta.com", "Headquarters": "Troy, MI", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Code: 1-1107-2 Posted On: Tuesday, 7th November 2017 Education: 4 Year Degree Job Description:  The GDI&A; Data Operations is responsible for the discovery and curation of new and existing data sources (First party data, external data providers, public data, social media, digital exhaust, transactional data etc.) for use in building incremental value and insight for the business. The Data Acquisition Specialist is responsible for the global research, documentation, testing and acquisition of external data assets, aligned to internal customer needs. This position is responsible for collaborating with analytic teams to determine external data needs, external vendor evaluation, contributing to database development, and the evaluation and profiling of external data sources….. all including: Analyze new and existing external data sources to suggest fit for use cases. Collaborate with Analytics and IT teams to profile the data for eventual use in modeling and visualizations Able to identify relationships in data to assist in providing insights Enhancements to the external data & vendor knowledge system Establish relationships with vendor technical points of contact and internal customers Work cross-functionally to manage data and analytic projects Improve department results through innovation Evaluation of data accuracy, completeness, timeliness and stability and establishing repeatable, sustainable processes to maintain data Discover possible new external data needs Develop business controls to comply with legal and regulatory requirements and corporate policies. Basic Qualifications: Bachelor’s Degree 2 or more years of experience with using a variety of the following data analysis tools: SAS, Hive, Alteryx, Hadoop, SQL or QlikView 3 or more years of PowerPoint and Excel experience 3 or more years of analysis, computational complexity and critical problem solving Strong collaboration and presentation skills Ability to adjust to change and navigate roadblocks Skills Preferred: Demonstrated SQL and Alteryx skills. (SAS or Tableau accepted as alternatives) Strong experience in profiling data. An understanding of creatively visually depicting data. A passion for embracing innovation, discovery & constant learning. Demonstrated problem formulation and problem solving skills Ability to take complex problems and break them down to create and implement an action plan Communicate findings to make data analysis actionable and understandable by business partners, including IT and analytics A love for the automotive industry. Experience Required:Bachelor's degreeBasic knowledge of Ford purchasing processExperience with using Qlikview, Alteryx, SharepointDemonstrated public speaking and presentation skillsFlexible/adaptable in fast-changing situationsTeam orientation Please send resumes to resume@eta.com . ETA is an EEO/AAP employer.  Note: ETA follows all appropriate Affirmative Action policies. This includes but is not limited to all equal employment opportunity and affirmative action requirements set for in 41 C.F.R. Sec. 60-1.4(a) and (c), which is incorporated herein by reference. In addition, all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, or national origin."}