{"jobID": "2764009085", "jobLocation": "Washington_DC", "jobTitle": "Metrics and Data Analyst/Project Analyst - US Citizenship required (CBP Public Trust)", "companyRating": "3.1", "companyInfo": {"Website": "www.csra.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (CSRA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "Clearance Level Must Currently Possess:No Active Clearance RequiredClearance Level Must Be Able to Obtain:No Active Clearance RequiredSuitability:Agency SpecificJob Family:Information TechnologyJob Description: GDIT is seeking a Metrics and Data Analyst/Project Specialist to join our small dynamic team in Washington, DC. We support the Custom and Border Protection/Office of Border Patrol -Statistics and Data Integrity unit to help them produce accurate statistical reports. These reports are produced in response to FOIAs, RFIs, and internal requests. Data integrity and accuracy is paramount as these statistics are utilized by the highest levels of government and the media. Candidate must be a US Citizen. CBP Public Trust suitability required Provide support for the production of trends analysis using CBP apprehensions and intelligence data. Required to create and maintain various data bases and spread sheet for tracking operational data. Perform statistical percent change analysis and projections. Write and maintain SQL queries for data mining from various internal and external databases. Give briefs on statistics, analyses, and projections. Ensure data integrity in enforcement system and provide recommendations on improving the integrity of the system. Query information in the enforcement system in order to verify and support various requests and reporting requirements.  - Write SQL queries to extract statistical data from multiple tables on the USBP Enforcement System databases.  - Create reports in Excel from that statistical data. - Generate standard daily, weekly, monthly, yearly, and ad hoc reports with a focus on accuracy.  - Perform basic analysis on dynamic, ever-changing statistics to ensure data integrity. Technical Requirements:  - Proficient in Aqua Data Studios, MS-Access, MS-Excel, SQL Server Query Analyzer, VBA, and Visual Basic.  - Knowledge of database and table structures.  - Ability to join multiple tables and trouble shoot code.  - Ability to work independently and as part of a team.  . Aqua Data Studio experience a bonus.  - A bonus but not essential, experience in pivoting and case statements in SQL. Required Experience: Four years' and above experience in the functions described above. Required Education: Bachelor's degree in computer science, information management, mathematics, engineering, or related field and 4 years exp.  An additional four years of relevant experience may be substituted for the Bachelor's degree # of Openings:1Scheduled Weekly Hours:40Telecommuting Options:Telecommuting Not AllowedWork Location:USA DC Washington - 1300 Pennsylvania Ave NW (DCC006)Additional Work Locations:CSRA is committed to creating a diverse environment and is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}