{"jobID": "2834551243", "jobLocation": "Rancho_Cordova_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.nescoresource.com", "Headquarters": "Cleveland, OH", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionGeneral Summary  Performs research and analysis for future and current strategy developments business opportunities, performance monitoring and operational enhancements. Improve data quality, data collection and analysis processes; develops data analysis methodologies and reporting.  Essential Functions  Identify, gather and analyze data to examine patterns & trends, and provide insights to enhance business decision making capability in business planning, process improvement, solution assessment, forecasting, etc.  Recommend actions for future strategic developments & business opportunities, performance for existing initiatives and partnerships, as well as enhancements to operational programs/tactics  Perform data analysis through methodologies that include statistical analysis, forecasting and predictive analytics  Job Specifications  Typically has the following skills or abilities:  Bachelor's degree in Business, Statistics, Data Analytics or other related fields, or equivalent experience  Three years of experience using business intelligence analytic software such as SAS, Cognos or SPSS to perform statistical, strategic, data and operational analysis  Three years of experience performing data analysis  Demonstrated ability to proactively develop, communicate and recommend solutions based upon business acumen and analysis performed  Excellent written and verbal communication skills with the ability to network, influence and build relationships with internal and external business partners and to express complex analytical and technical information to a variety of audiences at all levels  Proficiency in management, interpretation and analysis of large datasets and report production and automation  Proficiency with Microsoft Suite applications such as; Excel, Access, Visual  Basic, etc.  Regularly exercises discretion and independent judgment in the performance of his/her job duties  Working Conditions  The working environment is generally favorable, lighting and temperature is adequate, and there are no hazardous or unpleasant conditions caused by noise, dust etc.  The above information on this description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job grade."}