{"jobID": "2829311055", "jobLocation": "Sylmar_CA", "jobTitle": "Scientist II, Applied Research", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. *Job Summary:** Provides scientific and technical expertise in the design, construction, and testing of technology for implantable medical devices in the field of cardiac arrhythmia and heart failure . Accountable for project ownership and management of new products from conception through qualification builds and into product launch . Identifies scientific problems and applies scientific principles to the solution of a broad range of complex problems. Conducts Research & Development (R&D;) efforts involving theoretical and experimental study, conception and planning of clinical objectives and coordination and direction of clinical and preclinical efforts. *Job Duties:** + Designs technology and engineering developments in a team environment, specifically, designs therapeutic and diagnostic algorithms related to cardiac arrhythmia and heart failure.  + Designs and conducts/supervises experiments towards technology and engineering developments.  + Conducts research and prepares research and algorithm development tasks .  + Collects, organizes and analyzes data from experiments or design builds, and writes reports on results.  + Documents work suitable for technical papers and patents.  + Specifies and orders material and equipment for prototype design or for experiments.  + Collaborates with engineers and technicians to produce prototypes and qualification parts.  + Analyzes failures and failure modes.  + Participates in project design reviews and project planning. Tracks performance against plan. Develops plan in conjunction with technical supervisor.  + Support all Company initiatives as identified by management and in support of Quality Management Systems (QMS), Environmental Management Systems (EMS), and other regulatory requirements.  + Complies with U.S. Food and Drug Administration (FDA) regulations, other regulatory requirements, Company policies, operating procedures, processes, and task assignments. Maintains positive and cooperative communications and collaboration with all levels of employees, customers, contractors, and vendors.  + Performs other related duties and responsibilities, on occasion, as assigned. *Qualifications:** _General Qualifications_  + Bachelor?s degree in relevant engineering or scientific discipline and a minimum of 5 years of related experience.  + Master?s or PhD degree in relevant engineering or scientific discipline preferred.  + Experience working with physiologic signals in cardiac arrhythmia and/or heart failure preferred.  + Experience working in a broader enterprise/cross-division business unit model preferred.  + Ability to work in a highly matrixed and geographically diverse business environment.  + Ability to work within a team and as an individual contributor in a fast-paced, changing environment.  + Ability to leverage and/or engage others to accomplish projects.  + Strong verbal and written communications with ability to effectively communicate at multiple levels in the organization.  + Multitasks, prioritizes and meets deadlines in timely manner.  + Strong organizational and follow-up skills, as well as attention to detail.  + Ability to travel approximately 10%, including internationally.  + Ability to maintain regular and predictable attendance.  An Equal Opportunity Employer  Abbot welcomes and encourages diversity in our workforce.  We provide reasonable accommodation to qualified individuals with disabilities.  To request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}