{"jobID": "2768180206", "jobLocation": "Fort_Sam_Houston_TX", "jobTitle": "Staff Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.keakitech.com", "Headquarters": "Honolulu, HI", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Staff Scientist  Location  TX - Fort Sam Houston  Job Code  4543  # of openings  2  Apply Now Ke`aki Technologiesis looking for qualified Staff Scientists to perform services that impact a Combat Casualty Care Research Directorate program.DUTIES INCLUDE:Performing complex surgical procedures in small animal polytrauma models to study the Coagulopathy of Trauma and evaluate candidate blood products and cellular therapies in these modesDesigning and conducting studies optimizing platelet storage conditions (cold storage, additive solutions, and collection methodologies) to extend shelf life while preserving efficacy as assessed by endothelial interactions, aggregation profiles and biochemical, molecular, and metabolic characteristicsConducting animal research to satisfy mission support requirementsMaintaining and complying with animal use directives applicable to USAISRPerforming animal surgery to include both routine catheterizations and complex cardiovascular and neurological surgeryPerforming all aspects of critical care management of critically ill, mechanically ventilated animalsOperating a variety of clinical and experimental monitors and life support systems, to include mechanical ventilators, data acquisition systems, pulmonary mechanics monitors, and intra-as well as extracorporeal oxygenation circuitsPerforming and overseeing surgical trauma and bleeding protocols, and collection of blood and tissue samplesPerforming 3- dimensional image reconstruction and quantitative analysis of X-rays or CT scansAnalyzing physiologic waveforms data by time, spectral, and fractal techniques using commercial softwareLeading animal research team and serve as an investigator on animal protocolsProviding laboratory research to satisfy mission support requirementsDeveloping, validating, and using a variety of molecular, biochemical, coagulation, and physiological assaysValidating all procedures in terms of accuracy, precision, and specificity, and generate a written protocol for each procedureCulturing a variety of cell types/lines under various environmental conditionsAssisting others (lab assistants and postdoctoral associates) on the use of these proceduresMaintaining experimental data in organized notebooks and electronic filesUsing a variety of imaging equipment and quantitative software to analyze the results of molecular/biological procedures. Writing and serve as an investigator on laboratory protocolsProviding data analysis, publications, and presentationsCollecting and recording experimental data, to include extensive use of computers and hemodynamic monitoring instruments, as well as creating and implementing new databases for new protocolsPerforming data entry and database maintenance and manipulationMaintaining properly secured subject and sample documentationCalculating results of assays and evaluates validity of data collectedPerforming appropriate statistical computations on raw data, and to be able to use software: Excel, Word, PowerPoint, JMP, Sigma Plot/Stat, and GraphPad Prism to organize and analyze dataPreparing photography, graphics, and image production, for study presentations and publicationsParticipateing in interpretation of results and prepares manuscripts, reports, and presentations for publicationParticipating in lectures, seminars, and conferencesMaintaining current knowledge of developments in the field of trauma, critical care and hemorrhagic shock research, and transfusion medicineSupporting funding activities, reviewing scientific documentation and literature, and establishing and maintaining collaborations as force multipliers to expand capabilitiesDrafting, revising, and submitting proposals for intramural, DHP, and extramural fundingPerforming scientific peer review for local protocolsWorking in collaboration with industry and academic partners under CRADAsProviding consultation on relevant complex projects to DoD members as well as external CollaboratorsREQUIRED SKILLS AND EXPERIENCE:Able to read, write, speak and understand English. At least 6 years of relevant experience or Ph.D. with at least 2 years of relevant experienceDESIRED SKILLS AND EXPERIENCE:Demonstrated subject matter expertise in at least one area, and ability to conduct independent research through publication of several technical reports and/or peer-reviewed publications.Strong interpersonal skills to deal with the various personalities and personnel in a variety of positionsAbility to persuade and negotiate as well as communicate information efficientlyExperience maintaining an organization's and customer's image and identityDEGREE/EDUCATION/CERTIFICATION REQUIREMENTS:Master's of ScienceCITIZENSHIP/SECURITY CLEARANCE REQUIREMENTS:Must be a U.S. Citizen Must pass an National Agency Check with Inquiries (NAC-I)Secret Clearance PreferredThe Alaka`ina Foundation Family of Companies (FOCs) is comprised of industry-recognized government service firms who are designated as Native Hawaiian Organization (NHO)-Owned and fall into the respective categories of standard Small Business, 8(a) certified Small Disadvantaged Business (SDB), and HUBZone. The FOCs includes Ke`aki Technologies, Laulima Government Solutions, Kūpono Government Services, Kāpili Services, and Po`okela Solutions. Alaka`ina Foundation activities under the 501(c)3 principally benefit the youth of Hawaii through charitable efforts which includes providing innovative educational programs that combine leadership, science & technology, and environmental stewardship.For additional information on Ke`aki Technologies, LLC, please visit www.alakainafoundation.com.We are an Equal Opportunity/Affirmative Action Employer of individuals with disabilities and veterans. We are proud to state that we do not discriminate in employment decisions on the basis of race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. If you are a person with a disability and you need an accommodation during the application process, please click here to request accommodation. We E-Verify all employees."}