{"jobID": "2830534357", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Assistant Professor in Data Science, Geovisualization and Design", "companyRating": null, "companyInfo": {"Website": "www.umich.edu", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1817", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job SummaryThe School for Environment and Sustainability (SEAS) at the University of Michigan is seeking applications for a full-time, nine-month, tenure-track Assistant Professor in Data Science, Geovisualization and Design.  We seek candidates whose work focuses on the theory and application of data analytics, design and geovisualization within the interdisciplinary field of environment and sustainability. Candidates should be pursuing hypothesis driven research on analyzing, designing and visualizing spatial complexity in environmental systems for sustainability efforts. Topic areas include, but are not limited to, data science techniques, digital and critical cartography, and how humans understand and communicate spatial relationships.  The position will be filled at the assistant professor (tenure-track) level.Responsibilities*The successful candidate will be expected to:1) Develop a widely recognized research program that attracts external funding and contributes to the interdisciplinary mission of the School;2) Support SEAS's teaching mission at both graduate and undergraduate levels, including mentoring and supervising doctoral and master’s students;3) Contribute to the stewardship of SEAS, the University, relevant professions and society through service, collaboration and engagement.Required Qualifications*Applicants must demonstrate a strong record of scholarly publication, evidence of teaching potential in a multidisciplinary setting, and evidence of potential for and/or trajectory towards national and international recognition. Importantly, we are seeking candidates with a history of using their research to help solve real-world sustainability problems. Therefore, candidates should have the potential and willingness to engage stakeholders in their work, and evidence of collaboration across disciplinary boundaries to develop implementable solutions to sustainability challenges.Desired Qualifications*Post-doctoral experience is preferred, but we welcome candidates with exceptional PhDs in geography, computer science, information sciences, ecology, landscape architecture, urban planning, art and design or closely related disciplines.Additional InformationThe School offers a Ph.D. as well as both research and professional M.S. degrees in six fields of study: conservation ecology; geospatial data science; sustainable systems; environmental policy and planning; behavior, education and communication; and environmental justice. The School also offers a Master’s degree in Landscape Architecture (M.L.A.) and a cross-campus undergraduate program in the environment. The student body includes over 350 M.S./M.L.A. and 60 doctoral students. SEAS also participates in dual degree programs with the Schools of Architecture and Urban Planning, Business, Engineering, Law, Public Health, and Public Policy. Additional information about the School can be found at www.seas.umich.edu.Mission StatementSEAS’s mission is to contribute to the protection of the Earth’s resources and the achievement of a sustainable and just society. The School contributes new scientific knowledge, visionary leadership, and trained professionals toward that end. The faculty of the School is diverse, with natural scientists, social scientists, engineers, and designers working collaboratively in an integrative setting. A professional school set within a major research university, SEAS provides a model of interdisciplinary and applied research and a focal point of research, teaching and societal engagement on sustainability. Recently renamed with an expanded mission, the School is hiring six new faculty during 2018. The School focuses on key cross-cutting sustainability themes, including climate and energy; water; food, land use, and agriculture; conservation and restoration; and cities, the built environment, and mobility.  At SEAS we are committed to creating and maintaining an inclusive and equitable environment that respects diverse experiences, promotes generous listening and communications, and discourages and restoratively respond to acts of discrimination, harassment, or injustice. Our commitment to diversity, equity and inclusion is deeply rooted in our values for a sustainable and just society.Application DeadlineReview of applications will begin on September 14, 2018 and continue until the position is filled. SEAS hopes to appoint a faculty member to this position to begin Fall 2019.U-M EEO/AA StatementThe University of Michigan is an equal opportunity/affirmative action employer."}