{"jobID": "2835948511", "jobLocation": "N_o_n_e", "jobTitle": "Data Modeler (Enterprise Data Warehouse)", "companyRating": null, "companyInfo": {"Website": "www.american-technology.net", "Headquarters": "Clive, IA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Must be willing to relocate Client: Wynn Resorts  Type: Contract - 6+ Months (Candidates need to be on ATC Payroll - No 3rd Parties) - USC or GC please  Number of Positions: 3  Max Billintg rate: $75 / Hr on 1099  Deadline: By Tuesday July 3rd we need atleast 2 resumes. in total we need 4-5 resumes for this role Position Description: Data Modeler (Enterprise Data Warehouse):  Data Modeler works directly with the data architects and data governance teams to translate business requirements into conceptual, logical, and physical data models to meet the needs of the organization.  The candidate should be proficient with data warehousing principles, relational database management systems, and logical and physical data models.  The candidate maintains metadata profiles in adherence to sound data modeling principles and standards for all data brought into the operational data store and enterprise data warehouse. Demonstrate strong fundamental knowledge and experience using data integration tools and Structured Query language (SQL).  Major Areas of Responsibility: Develop and maintain enterprise and system/application-level conceptual, logical, and physical data models and dictionaries.Review and employ database schemas to document Physical Data Models and develop logical data model, and dictionaries.Document, develop, and maintain data models in ERWIN or ER Studio or equivalent modeling tools.Demonstrate clear, concise, accurate, and timely communication to management, peers, and customers; in written and oral formManage and establish standards for naming and abbreviation conventions, data definitions, ownership, documentation, procedures, and techniquesSupport the development of integrated data models and artifacts identifying as-is, planned, and to-be mission data and supporting metadata.Work with business, process teams, and leaders, to understand their business information requirements and to classify, organize, make available and govern the data needed to meet those requirementsDevelop and employ guidelines, standards, Standard Operating Procedures (SOPs), and recommended practices for maintaining and developing data models and data dictionaries.Employ data modeling tools and associated graphical methods to depict and analyze current and proposed conceptual, logical, and physical data schema.KNOWLEDGE AND EXPERIENCERequired4+ years work experience in physical and logical relational database modeling is required.4+ years work experience in dimensional modeling is required.4+ years work experience with data warehousing is required.4+ years work experience with a data modeling tool such as ERWIN or equivalent modeling tools is required.Expert level ability to understand and write Structured Query Language (SQL) is required.Understanding of OLAP, ROLAP, and MOLAP concepts is required.Experience with data mapping, data profiling, and data qualitySelf-starter, well organized, extremely detail-oriented and an assertive team player, willing to take ownership of responsibilities, and possess a high level of positive energy and driveAbility to manage multiple priorities, work well under pressure and effectively handle concurrent demands to prioritize responsibilities.Excellent time management and organizational skillsPreferred · Familiarity with Azure Data Lake and Azure Data warehouse is highly preferred.  · Experience with Business Intelligence tools such as Power BI, MicroStrategy, Cognos, and Tableau is preferred.  · Experience with Teradata and Teradata Utilities is preferred. Soft Skills · An inquisitive mindset  · Ability to abstract general principles from specific requirements  · Strong communication skills  · Rarely requires guidance, even on most complex systems analysis EDUCATION Bachelor?s degree in Information Systems, Computer Science or technical training equivalent"}