{"jobID": "2777741750", "jobLocation": "Clinton_Township_MI", "jobTitle": "Maintenance Administrative Coordinator", "companyRating": "3.5", "companyInfo": {"Website": "www.paragonapartments.com", "Headquarters": "Bingham Farms, MI", "Size": "51 to 200 employees", "Founded": " 1978", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": " We are seeking a Maintenance Administrative Coordinator to join our team! This role will help our maintenance team keep on task and stay organized. Responsibilities: Market Readies – Schedule vendors for turnover painting, cleaning, carpet cleaning and other special needs determined by unit conditionInspect vendor work and call back vendors to complete as necessaryManage maintenance team to ensure completion of in-house tasks within policyPerform inspections of market ready product to confirm standards metMaintain the Turnover Tracking Board throughout turnover processWork with leasing team and management for priority units to turn Inspections – Schedule and coordinate pre-renewal preventative maintenance inspectionsSchedule and coordinate bi-annual furnace/AC inspectionsSchedule and coordinate monthly common area inspections Move Outs – Assist maintenance supervisor with performing move out inspection to determine damage charges, take photos, and determine work to be performed during the turnover processDownload damage photos to the shared drive Service Requests – Review and prioritize pending service requestsWork with maintenance supervisor to delegate tasks and monitor completionClose out completed service requests in YardiPerform service request follow upSchedule contractors as necessary to complete work unable to be performed in-house Purchasing – Place Wilmar and other supply orders to maintain stock at adequate levelsWrite POs for manager approval for purchase of other items necessary for turns, service requests, and/or renewal rewards We offer a competitive hourly wage and benefits package. Requirements Qualifications: • Highly motivated and team-oriented personal style.  • Open to change and able to multi-task in a fast-paced environment.  • Exemplary communication skills.  By becoming part of our team you will be able to take advantage of our employee health/dental/vision benefits with a minimal waiting period for enrollment, 401(k), Maintenance Technician training program and uniform program. All candidates must pass pre-employment background, drug screen, physical and have a valid driver's license and own transportation."}