{"jobID": "2655299926", "jobLocation": "Bridgewater_NJ", "jobTitle": "Pharmacovigilance Scientist", "companyRating": null, "companyInfo": {"Website": "www.starkassociatesllc.com", "Headquarters": "Piscataway, NJ", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unicon Pharma, Global PharmaTek, Green Key Resources"}, "estimatedSalary": null, "jobDescription": "Job Description: Serve as a core member of the safety team and is responsible for performing proactive pharmacovigilance activities on a product, or group of products in a therapeutic area or franchise, in partnership with the Global Safety Officer (GSO) to evaluate safety data and signals for both marketed products and products in clinical development.  This includes performing signal detection and safety management committee activities, authoring safety evaluations, contributing and reviewing of aggregate safety reports, assisting with ad hoc regulatory responses, facilitating signal management process for assigned products (i.e., signal tracking, data analysis, leading review meetings, presenting, etc.) in collaboration with the GSO and Pharmacoepidemiology. Additionally, the PVS will support the GSO with other safety related activities associated with new drug applications / regulatory filings, benefit risk assessment and safety risk management and support activities related to risk minimization including dRMP/RMP and REMS. The PVS will provide coordination and oversight to outsourced activities (i.e., signal detection reports, clinical overviews).  Required Good knowledge of pharmacovigilance practicesGood knowledge of US and EU pharmacovigilance regulatory requirementsAbility to present and critically discuss safety data in both internal and external discussionsAbility to navigate in databases and pull information correctlyBasic knowledge of common data processing software (i.e., Excel, PowerPoint, Word) and database systemsPreferred hands-on years with relevant experience (including industry experience) with a working knowledge of drug safety and risk management, and understanding of drug development, basic knowledge of regulatory guidelines and medical coding (i.e. MedDRA)."}