{"jobID": "2836366241", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist 1/2", "companyRating": null, "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": null, "jobDescription": "All About UsAt Illumina, we apply innovative technologies for studying genetic variation and function, making studies possible that were not even imaginable just a few years ago. These revolutionary tools for DNA, RNA, and protein analysis are enabling rapid advances in disease research, drug development, and the development of molecular tests in the clinic.As a Scientist in Technology Development at Illumina you will work in a dynamic, team-oriented environment and you will play a key role in creating the next generation of genomic tools. You will be a key contributor to multidisciplinary teams developing and improving leading-edge technology platforms. You will plan, initiate, and execute scientific research and define development strategies in collaboration with the research staff and through individual studies.Tasks and Responsibilities:Develop and implement tools, metrologies and test methods for the characterization of microparticles, polymers, hydrogels and other materialsDesign, develop and troubleshoot assays, chemistry and methods for monitoring interactions between molecules/biomolecules and polymeric materialsGather, organize and analyze large data setsTroubleshoot and improve existing processes, tools and chemistries to create robust products and improve process performanceWork independently and within multi-disciplinarily project teams of scientists, engineers, programmers, and project coordinatorsEngage in clear and concise communication with colleagues and supervisors through oral updates, written reports and technical meetings. Present status updates to Senior Management, including recommendations based on experimental resultsAll listed tasks and responsibilities are deemed as essential functions to this position. However, business conditions may require reasonable accommodations for additional tasks and responsibilitiesRequired Skills & ExperiencePh.D. in Chemistry, Chemical Engineering, Materials or Polymer Science, Analytical Chemistry or other related disciplineExtensive hands-on experience in one or more of the following disciplines: polymer chemistry, synthetic chemistry, bio-conjugation, advanced materials, surface chemistryProven track record of creativity and innovation combined with the ability to complete complex tasks with minimum supervisionExperience in the development of analytical assays in complex environments, using sound statistical approachesExperience in bio-conjugation and functionalization of advanced materials with molecules and biomolecules to modulate biomolecular reactionsHands-on experience in multiple techniques and methods for characterization of materials, surfaces, molecules and biomoleculesAbility to think clearly under pressure, setting goals independently and to enthusiastically overcome challenges in a fast-paced environmentMotivated, enthusiastic, hard-working, cheerful individual who wants to be part of a fast-paced and dynamic technology development TeamPreferred Skills & ExperienceBroad scientific knowledge on the fundamentals of materials science such as chemistry, physics, instrumentation set-ups, optics, thermodynamics, kinetics, spectroscopy.Statistics background, ability to use programming languages, and data analysis skills (such as DOE or other advanced statistical tool)Experience with DNA sequencing, biochemical assays and molecular biology techniques Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}