{"jobID": "2830002971", "jobLocation": "Washington_DC", "jobTitle": "Forensic Scientist Supervisor (Microbiologist)", "companyRating": "3.3", "companyInfo": {"Website": "www.dc.gov", "Headquarters": "Washington, DC", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "Apply for JobJob ID4067Location401 E Street, SWFull/Part TimeFull-TimeRegular/TemporaryRegularDate Opened06/27/2018Area of ConsiderationOpen to PublicFrom Grade14Type of AppointmentMSS - Reg ApptMinimum Rate$102,649.00Target Openings1Date Closed07/25/2018AgencyDept of Forensic SciencesDepartmentPublic Health LaboratoryBargaining UnitCH11Maximum Rate$143,708.00Available Openings1Add to Favorite JobsEmail this JobGeneral Job Information This position serves At-Will.Summary This position is located in the Department of Forensic Sciences (DFS), Public Health Laboratory Division (PHL). The mission of the DFS is to provide high-quality, timely, accurate, and reliable forensic science services using best practices and best available technology, focusing on unbiased science and transparency, to enhance public safety and health.  This position is responsible for supervising a team that performs the functions of microbiology which includes but not limited to detection, identification and characterization of bacteria, viruses, archaea, fungi, algae and protozoa. The main focus is on the biology of microorganisms at the molecular and cellular levels and their pathogenicity, ecology and relevance to public health.  Supervises the day-to-day performance and coordination of testing that involves determining serological and immunological reactions; isolating and identification of microorganisms from tissues, body fluids, transudates and exudates, lesions and the environment; assessing antibiotic sensitivity and diagnosing and controlling diseases caused by pathogenic microorganisms, etc.; and ensures that all required laboratory services are carried out according to quality standards.  Plans, develops and implements programs, methods and techniques to keep pace with constant changes and increased demands for microbiology laboratory services brought about by growing public health needs, increased standards and requirements for adequate public health protections and rapid advances in the laboratory field; train subordinate staff in the use of new specialized equipment, and assures that current reference work and applicable professional publications are available and that equipment and facilities are adequate, along with data management and statistical reports.  Evaluates relevant information to determine whether events or processes comply with laws, regulations and standards; oversees and observes the examination of physiological, morphological, and cultural characteristics to identify and classify microorganisms and specimens by the use of rapid identification systems and molecular typing; and monitors and reviews information from materials, events, or the environment, to detect or assess problems.  Investigates the relationship between organisms and disease, including the control of epidemics and the effects of antibiotics on microorganisms when required; and ensures that information is identified by categorizing, estimating, recognizing differences or similarities, and detecting changes in circumstances or events.  Provides technical support for the evaluation of hospital and private laboratory technologies to ensure strict conformance to technical standards and procedures and to assure accuracy and uniformity in test results; and assures that these high standards are maintained in the laboratory.  Ensures that the heavy volumes of daily work as well as difficult special demands are scheduled and processed effectively; and that equipment and materials are used to and for the best interest of the citizens of the District of Columbia.  Performs complex tests and/or procedures that require using highly specialized methods or techniques; and recognizes and identifies unusual and diverse entities, occurrences, or investigative outcomes relevant to the tasks.  Modifies and/or adapt established protocols and procedures in response to test or study findings.  Advises and consults with the PHL Director and other key officials of the District of Columbia on matters pertaining to microbiology, biology, and quality assurance; and occasionally represents the supervisor in high level conferences along with District and other officials.  Solves complex problems and reviews related information to develop and evaluate options and implement solutions; and troubleshoots the cause of operating errors and determine and/or develop alternative resolutions.  Provides the full range of supervisory services, as required to manage and direct the work efforts of subordinate staff and activities of assigned operations. Develop quantitative and qualitative measures for evaluating the work performance of staff; Supervise and assign duties and responsibilities; formulate overall plans for resources; approve and disapproves leave requests; recommend job selections, promotions, incentive recognition and corrective or adverse actions; establish work standards; and identify developmental and training needs.  Performs other related duties as assigned. Qualification Ph.D. in microbiology or one of the Biomedical Laboratory Sciences with at least two years postdoctoral experience in microbiology is required. A minimum of one-year laboratory supervisory experience is required. Certification as Technical Supervisor American Board of Bioanalysts TS Microbiology (ABB), Diplomate American Board of Medical microbiology D (ABMM), or Clinical Scientist (ASCP). Specialized Experience: Experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. To be creditable, at least one (1) year of specialized experience must have been equivalent to at least the next lower grade level in the normal line of progression for the occupation in the organizatio  Mastery of, and skill in applying professional theories, principles, concepts, practices, standards, and methods of microbiological science, public health, and disease prevention; and applicable Federal statutes and legislation governing individual programs; and expert knowledge of plant and animal organisms, their tissues, cells, functions, interdependencies, and interactions with each other and the environment.  Mastery of complex diagnostic microbiology procedures, safety, and quality controls; and the ability to keep abreast of best practices through on-going professional development activities; expertise in using various types of highly complex equipment (e.g., thermo cyclers, DNA sequences, rapid microbial identification systems, centrifuges, microscopes, bio-safety cabinets) in a public health laboratory setting and in reading and interpreting complex documents, test results and publications; and expert knowledge of public safety and security.  Mastery of and skill sufficient to establish and monitor quality control in the microbiology section as well as an in-depth knowledge of the principles, techniques, and instruments to determine quality control measures needed to control samples, to respond to proficiency testing programs and to establish and maintain copious record keeping systems.  Ability to work well both independently and as part of a synergistic professional management team in a multi-cultural workplace and interpersonal skills is required to work effectively with a diverse staff, external agencies, and the public.  Expertise in modifying or adapting standard processes and procedures, assesses, selects, and applies remedies suited to the assigned problem or situation; and assesses the environmental impact of various practices.  Excellent oral and written communications skills sufficient to prepare and present pertinent information and research involving complex workforce development policies and initiatives, and represent the agency; and knowledge of and skill in communication and public relations techniques sufficient to effectively represent the agency at conferences, meetings and consultations with agency managers, employee groups, and special interest groups concerning program objectives and issues.  Ability to supervise and skill to lead a subordinate staff.  Demonstrated skill and ability to use a PC and software packages (e.g., Microcroft Word, Excel, Access and Power Power Point, etc.) .) and software applicable to various reporting systems, particularly laboratory information systems (LIS), inventory control, and sequence analysis software. License, Certification and other requirements This position’s duty station will be housed within the Consolidated Forensic Laboratory (CFL) which is a protection-sensitive facility. As such, incumbents of this position shall be subject to criminal background checks, background investigations, and mandatory drug and alcohol testing, as applicable. Due to the handling of primary evidence, the applicant will be required to submit a buccal swab for the purposes of the DNA Quality Control database for the DFS.  The nature of the DFS mission necessarily involves the potential risks associated with biological or chemical hazards, including morgue functions. Although contact with these functions is intended to be minimal, the risks are nevertheless possible; training to recognize, address, and mitigate these risks is required as is dealing with potentially personally difficult topics, such as crime, death, and disease. Education and Experience Ph.D. in microbiology or one of the Biomedical Laboratory Sciences with at least two years postdoctoral experience in microbiology is required. A minimum of one-year laboratory supervisory experience is required. Certification as Technical Supervisor American Board of Bioanalysts TS Microbiology (ABB), Diplomate American Board of Medical microbiology D (ABMM), or Clinical Scientist (ASCP). Specialized Experience: Experience that equipped the applicant with the particular knowledge, skills, and abilities to perform successfully the duties of the position, and that is typically in or related to the work of the position to be filled. To be creditable, at least one (1) year of specialized experience must have been equivalent to at least the next lower grade level in the normal line of progression for the occupation in the organization.  As a LRN participating Laboratory, the DC PHL requires US citizenship and a security risk assessment. The nature of the DFS mission necessarily involves the potential risks associated with biological or chemical hazards, including morgue functions. Although contact with these functions is intended to be minimal, the risks are nevertheless possible; training to recognize, address, and mitigate these risks is required as is dealing with potentially personally difficult topics, such as crime, death, and disease. Immunization against certain infectious agents may be required. Work Environment The work is performed in the laboratory."}