{"jobID": "2796709818", "jobLocation": "Fairfax_VA", "jobTitle": "GIS Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.remine.com", "Headquarters": "Fairfax, VA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Remine, our core platform and data products deliver powerful insights and predictive analytics on top of our geospatial applications. We build products for both web and mobile to deliver visualizations and search capabilities for real estate agents, brokers, and experts. Our platform and products support large-scale data sources, processing near-real time updates from a large number of sources. With structured and unstructured data, our data ingestion pipelines, data processing capabilities, and extensive front-end displays provide our users globally the capability to search, label, and track changing datasets as they come in for the real estate arena. Job Description: As a GIS Data Analyst, we are looking for someone to help us scaling out our efforts to drive the acquisition, creation, and ingestion of GIS parcel, address, and boundary data. Supporting our core platforms that show nationwide boundaries for properties both residential and commercial there are areas on the map where data from third-party vendors do not have parcel address points, boundaries, and centers. The GIS data analyst will help us create these boundaries though querying of internal data via a spatial database, contacting municipal GIS department, and manual digitizing. As the GIS Data Analyst, you are someone who is detail oriented, can work in a fast-paced environment, and can work at an autonomous pace prioritizing multi-projects at once. Responsibilities:Partner with the Support and Quality engineering teams to identify areas of boundaries that need to be createdWork with the Data Acquisition team members to source and get the image files for each plat, boundary areaGenerate and georeferenced parcel boundary shape files and layers for consumption in our data platformDrive a process to help build a quality pipeline to ensure teammates projects are done with the highest quality and accuracySuccessfully work collaboratively as a member of a teamRequirements:BS/BA in GIS, Geography, Archaeology, or related field1-3 years of experience and knowledge of using GIS technologies such as ArcGIS, QGIS or related softwareExperience with SQL and Python preferredExperience working with a spatial database such as PostGISExperience geo-referencing and create boundary/shape layer filesExtreme attention to detail and organizationAbility and eagerness to learn new technologies quicklyExperience juggling multiple shifting priorities for a variety of tasks Remine is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."}