{"jobID": "2756860717", "jobLocation": "Kalamazoo_MI", "jobTitle": "Supply Chain Data Analyst (Buyer Sr)", "companyRating": null, "companyInfo": {"Website": "www.parker.com", "Headquarters": "Cleveland, OH", "Size": "10000+ employees", "Founded": " 1917", "Type": " Company - Public (PH) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Eaton, SMC Corporation, Bosch Rexroth"}, "estimatedSalary": null, "jobDescription": "Org Marketing StatementWith annual sales of $12 billion in fiscal year 2017, Parker Hannifin is the world's leading diversified manufacturer of motion and control technologies and systems, providing precision-engineered solutions for a wide variety of mobile, industrial and aerospace markets. The company has operations in 50 countries around the world. Parker has increased its annual dividends paid to shareholders for 61 consecutive fiscal years, among the top five longest-running dividend-increase records in the S&P; 500 index.  Parker Hydraulic Systems Division in Kalamazoo, MI is seeking a Supply Chain Data Analyst. This position is a unique opportunity to utilize your analytical and purchasing talents.ResponsibilitiesThe candidate of choice will interface within the Supply Chain/Purchasing department and directly with Suppliers.  Essential Functions:  Create, maintain and report out on a monthly, quarterly and annual basis, key metrics for Supply Chain.  Collecting and analyzing the results of month end cost and price performance for supply chain.  Supports annual supply chain budget process and focal for our finance team.  Builds and maintains predictive models for various key performance measures and or forecasts at the division levels, and communicates results to decision makers for follow up action  Project Manager of supply chain continuous improvement projects.  Responsible for reporting macro-economic trends applicable to support supply chain efficiencies, cost downs, and/or rationalizations.  Responsible for deploying, and managing Request for Quote packages for major initiatives (i.e. Best Value Region quoting or kitting).  Identify and investigate trends that warrant deeper analysis, and advise decision makers of implications and potential corrective actions  Monitor and adapt models to changing business needs  Support Ad hoc requests as contributing team member for key projects as needed  Manage the integration of key external data sources into our enterprise data repositories for use by all analytics teams and report writers across the enterprise  Design and manage predictive modeling and other data mining analysisQualificationsBachelor’s Degree of Business Administration with concentration in Supply Chain Management or related field.  Business analytic related field of study preferred  3+ years experience preferred  Skilled in data mining and advanced statistical analysis in a business setting  Proficient with data wrangling, working with large data sets of varying quality, structured & un-structured to solve business problems  Proficient in SQL, Microsoft Office, Power BI and multiple online and other data  Excellent written, verbal, and interpersonal communication skills for effective interface with all internal and external contacts.Equal Employment OpportunityParker is an Equal Opportunity and Affirmative Action Employer. Parker is committed to ensuring equal employment opportunities for all job applicants and employees. Employment decisions are based upon job related reasons regardless of race, ethnicity, color, religion, sex, sexual orientation, age, national origin, disability, gender identity, genetic information, veteran status, or any other status protected by law. U.S. Citizenship/Permanent Resident is required for this position.  (“Minority/Female/Disability/Veteran/VEVRAA Federal Contractor”)  If you would like more information about Equal Employment Opportunity as an applicant under the law, please go to http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf  and  http://www1.eeoc.gov/employers/upload/eeoc_gina_supplement.pdf"}