{"jobID": "2556928384", "jobLocation": "Irving_TX", "jobTitle": "Sr. Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.signetjewelers.com", "Headquarters": "Hamilton, Bermuda", "Size": "10000+ employees", "Founded": " 1950", "Type": " Company - Public (SIG) ", "Industry": " Retail", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": " Collaborate with both external and internal partners to prepare statistical analysis, run reports, update statistical models, and perform analytical tasks needed to execute approaches identified by Data Scientists. Work as part of the Strategic Retail Analytics team to provide analytical support and analysis of consumer behavior and response.  Design and execute analytics for evaluating business needs (e.g. strategic initiatives, business performance, scenario planning, workforce management, etc.) Apply analytics and technology to solve business problems  Analyze and evaluate market segments, channels, products and draw conclusions from quantitative and qualitative analysis to develop recommended business solutions. Maintain and update existing propensity models.  Transfer knowledge of data sources, integration processes, techniques and issues to application and support teams. Answer technical and procedural questions for and communicate data findings with technical and non-technical resources.  Evaluate business results to identify new strategies and process improvement opportunities. Develop incremental testing plans to continuously improve models and business practices that drive business results.  Present findings/recommendations to all levels of management based on data and test results. QUALIFICATIONS:Bachelor's degree required3-4 years’ job-related experience in statistical and data analysisDeep understanding of statistical modeling and analysis, including data mining, regression, decision trees, time serious forecasting and survival analysis.Ability to communicate effectively with stakeholders at all levels.Experience extracting data and creating report in Excel.SQL programming required.Retail experience highly preferred.Experience with unstructured data, including text analytics preferable."}