{"jobID": "2825113243", "jobLocation": "Skokie_IL", "jobTitle": "Research Scientist II", "companyRating": "2.9", "companyInfo": {"Website": "www.criver.com", "Headquarters": "Wilmington, MA", "Size": "5001 to 10000 employees", "Founded": " 1947", "Type": " Company - Public (CRL) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Research Scientist II  Req ID #: 36399 Location: Skokie, IL, US, 60077  For nearly 70 years, Charles River employees have worked together to assist in the discovery, development and safe manufacture of new drug therapies. When you join our family, you will have a significant impact on the health and well-being of people across the globe. Whether your background is in life sciences, finance, IT, sales or another area, your skills will play an important role in the work e perform. In return, we'll help you build a career that you can feel passionate about. ResponsibilitiesBASIC SUMMARY: Acts as a Study Analyst by performing method development, validation, implementation and documentation of bioanalytical assays in support of protein therapeutics for pharmacokinetics along with immunogenicity assays for possible host antibodies using immunochemical techniques within GLP and non-GLP environments under the supervision of a Principal Investigator/Study Director. Responsible for the technical conduct of assigned laboratory studies, as well as for the analysis, documentation and reporting of results. Adheres to company SOPs and applicable federal regulations in performance and documentation of laboratory work and use of equipment. ESSENTIAL DUTIES AND RESPONSIBILITIES: o Follows approved bioanalytical procedures and study protocol/bioanalytical plan to perform bioanalytical assays.  o Records documentation for bioanalytical assays in compliance with applicable WIL Research SOPs and bioanalytical procedures, and ensures that documentation is a complete, correct record of the experiments performed.  o Meets daily with Supervisor to discuss daily laboratory activities to ensure scheduled work is executed as planned/directed by the appropriate SD/PI/BI.  o Ensures reagents/equipment are being used in an appropriate manner according to requirements for calibration/expiration/storage etc. Ensures appropriate reagents/equipment are being utilized per the procedures being followed.  o Notifies Study Director/Principal Investigator if bioanalytical procedure or study protocol/bioanalytical plan is not followed, or if mistakes occur, or if a run fails to meet acceptance criteria.  o Follows Project Checklist and works with Study Director/Principal Investigator to ensure that the raw data file is complete for the study.  o Helps to compile validation or bioanalytical results to be included in the final report.  o Helps to write the bioanalytical procedures and run checklists.  o Performs instrument monitor duties, as required.  o Records appropriate data/information from all experiments in Bioanalytical Metrics file on at least a weekly basis. Works with Site Operations group to meet client timelines by performing other duties as required by a team member.Performs cell culture procedures, as required.QualificationsB.S. or B.A. in biology/biochemistry/chemistry or a closely-related discipline.0-2 years of experience in a laboratory settingAwareness of Good Laboratory Practice Regulations. Good oral and written communication skills. Able to perform work in a timely manner. Equal Employment Opportunity  Charles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet  About Safety Assessment  Charles River is committed to helping our partners expedite their preclinical drug development with exceptional safety assessment services, state-of-the-art facilities and expert regulatory guidance. From individual specialty toxicology and IND enabling studies to tailored packages and total laboratory support, our deeply experienced team can design and execute programs that anticipate challenges and avoid roadblocks for a smooth, efficient journey to market. Each year approximately 120 investigational new drug (IND) programs are conducted in our Safety Assessment facilities.  About Charles River  Charles River is an early-stage contract research organization (CRO). We have built upon our foundation of laboratory animal medicine and science to develop a diverse portfolio of discovery and safety assessment services, both Good Laboratory Practice (GLP) and non-GLP, to support clients from target identification through preclinical development. Charles River also provides a suite of products and services to support our clients' clinical laboratory testing needs and manufacturing activities. Utilizing this broad portfolio of products and services enables our clients to create a more flexible drug development model, which reduces their costs, enhances their productivity and effectiveness to increase speed to market.  With over 11,000 employees within 70 facilities in 18 countries around the globe, we are strategically positioned to coordinate worldwide resources and apply multidisciplinary perspectives in resolving our client's unique challenges. Our client base includes global pharmaceutical companies, biotechnology companies, government agencies and hospitals and academic institutions around the world. And in 2016, revenue increased by 23.3% to $1.68 billion from $1.36 billion in 2015.  At Charles River, we are passionate about our role in improving the quality of people's lives. Our mission, our excellent science and our strong sense of purpose guide us in all that we do, and we approach each day with the knowledge that our work helps to improve the health and well-being of many across the globe. We have proudly supported the development of ~70% of the drugs approved by the FDA in 2016.  For more information, please visit **************.  Equal Employment Opportunity  Charles River Laboratories, Inc. is an Equal Opportunity Employer M/F/Disabled/Vet  Nearest Major Market: Chicago  Job Segment: Chemistry, Biochemistry, Toxicology, Research Scientist, Scientific, Science, Engineering"}