{"jobID": "2794757573", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.nov.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1841", "Type": " Company - Public (NOV) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Schlumberger, Halliburton, Cameron"}, "estimatedSalary": "56000", "jobDescription": " Data Analyst  About National Oilwell VarcoWant to work with some of the oil and gas industry's best minds?  Every single day, we put more than 150 years of experience to work to help our customers achieve lasting success. We have the people, capabilities, and vision to serve the needs of a significant and evolving industry. One the world can’t live without.  Working throughout every region in the world, and across every area of drilling and production, our company provides the technical expertise, advanced equipment and operational support necessary for success – now and in the future.  At NOV, we power the people who power the world.Job DescriptionDo you love paying attention to detail? We are seeking a Data Analyst to enter and maintain customer & vendor records as settled by the businesses and NOV standards. The data analyst will ensure data integrity and data correctness in the structure and content of Oracle Enterprise Data Quality (EDQ). The analyst team serves to implement data quality standards in completeness, accuracy, consistency and timeliness of data. This team member will work closely with the business units to obtain all necessary information for implementations regarding customers and vendors.Responsibilities• Leads key master data entities for ERP systems  • You will lead team processes, monitor metrics, and make continuous improvements to elevate the team’s efficiency.  • Handle workload, monitor the ticket system and update logs as required.  • Comply with all security policies and procedures, to ensure that the highest level of system and data confidentiality, integrity and availability is maintained.  • Analyzes the results of data queries necessary to identify data quality issues and presents results in an easy-to-understand format to end users.  • Works with business partners to capture requirements, conduct data profiling and track metrics necessary to monitor data quality.  • Closely monitor ETL processes for support activities and blocking issues.  • Work with several multi-functional areas, IT, DBAs, Data Architecture, Data Integration, Business Intelligence, Reporting, and data users to research and resolve issues.  • Provide and present team achievements as well as track the status of current projects and maintenance activities."}