{"jobID": "2799500990", "jobLocation": "Holland_MI", "jobTitle": "Weld Production Operator - 2nd Shift", "companyRating": "2.6", "companyInfo": {"Website": "www.challenge-mfg.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": " Working as a member of a team or as an individual, performs and has primary responsibility for various types of welding center operations in multiple work centers as required, including, but not limited to MIG, spot (resistance), robotic, silicon bronze (MIG), and manual welders, to produce quality parts per the Challenge Manufacturing Quality Standards, production schedule and engineering specifications at the prescribed cycle time (rate). Performs necessary quality checks, records information in PLEX (Enterprise Resource Planning system -ERP), and performs general utility work to meet work schedule. RESPONSIBILITIES AND RESULTS: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Performs all duties necessary to ensure department and plant meet daily and weekly production requirements.References production orders in Plex to weld product per Job Element Sheet (JES).Frequently loads, unloads, lifts/moves, pulls/pushes, and/or positions products and materials weighing up to 40 pounds, occasionally weighing more (assistance given with heavier objects by work partner[s]), throughout assigned work center. Weld operations involve frequent standing, walking, bending, twisting, turning, and lifting.May select proper rack or bin to pack parts and/or store parts for next process.Properly packs parts in correct bin/storage container per packaging instructions to meet customer requirements. Ensures proper labeling requirements are followed. Uses computer, Plex system, keyboard, printer and mouse.Completes work center and operator inspection sheets to verify processes are stable and all product quality and inspection, including gage checks are being met.Visually inspects parts from previous operation per Challenge Manufacturing quality standards to ensure proper form, fit, and function. Ensures customer and Challenge Manufacturing quality standards are met per gage instructions, first piece inspection approval, problem containment processes, quality alerts and other quality standards called out in the Challenge Manufacturing Quality Policy and/or Plex System specific for each work center.Monitors material usage and floor stock to ensure accurate inventory. Notified material handler when floor stock or inventory is low to prevent production interruptions.Ensures and maintains safety and cleanliness of work area by performing housekeeping duties.Cross trains on various work centers as required.Completes appropriate paperwork and other documentation (hourly count boards).Follow Escalation Process for problem / abnormality notifying.Meets daily production requirements.SKILLS AND KNOWLEDGE:Ability to read and interpret job element sheets.Ability to use a variety of gages (functional, go/no go) required.Ability to use hand tools including, but not limited to; file, hand drill, and disc sander.Familiarity with welding processes preferred.PC and keyboard/mouse skills required.Ability to frequently lift/move material weighing up to 40 pounds.Ability to work as a contributing member within team environmentBEHAVIORAL REQUIREMENTS:Has high standards of performance for self. Takes responsibility for actions, results, and mistakes. Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress. Maintains positive relationships by constructively resolving conflicts.Uses feedback from others to continuously improve performance and work relationships.Moves within own and/or other work areas (flexes) to support plant flow. Works with sense of urgency to meet needs of internal and external customers.Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities. Maintains knowledge and skills to perform job effectively.Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.Looks for good in others; works collaboratively with others; shares information and knowledge.Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.WORK ENVIRONMENT/PHYSICAL DEMANDS:Frequent exposure to noise, fumes, dirt, heat, sparks, and smoke.May also be exposed to water, vibration, dust, grease, and oil.Frequently loads, unloads, lifts/moves, pulls/pushes, and/or positions products and materials, weighing up to 40 pounds, occasionally weighing more (assistance given with heaving objects by work partner [s], through work center.Frequently walks, bends, twists, turns, and lifts while performing functions of position.Moderate-sized equipment used around work area.Possible cuts, scrapes, burns or bruises.Eye protection required; hearing protection required; cut resistant arm guards required; cut resistant gloves required.REQUIRED EDUCATION AND EXPERIENCE:High School Graduate or equivalent required.One year experience working in a manufacturing environment preferred.Other Duties: Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}