{"jobID": "2695920716", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientists Analysts 44081 (SV1)", "companyRating": null, "companyInfo": {"Website": "www.fastswitch.com", "Headquarters": "Dublin, OH", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob ID: 44081Position Description: The Data Operations analyst discovers and curates new and existing data sources (external data providers, public data, social media, digital exhaust, proprietary and transactional data, etc.) for use in building incremental value and insight for the business. Analyst will make recommendations for alternative ways to bring data to life to solve business problems. At times, the problem is identified by a business unit, frequently wishing to optimize cost, revenue, or improve quality, and at times problems are formulated by the Data Scientists. The Analyst identifies internal and external data sources and enables skill teams and analytics teams to leverage the data with their analytic tools to answer their key questions. The role will be responsible for discovering and curating data sources, including: Creating data standards, developing data security recommendations, assessing data quality and creating required transformations. Collaborating with IT teams to support data collection, integration, and retention requirements based on the input collected with the business. Acting as the data steward to ensure that all information utilized adheres to compliance, access management, and control policies as set forth by GDIA. Providing on-going tracking and monitoring of performance of decision systems and statistical models Solving client analytics problems and communicates results and methodologies. Working in iterative processes with the client and validates findings. Modeling and framing business scenarios that are meaningful and which impact on critical business processes and/or decisions. Working closely with different teams to solve problems related to client analytics. Performing experimental design approaches to validating findings or testing hypothesis which provide business value. Working cross-functionally to manage data and analytic projects. Improving department results through innovation.Skills Required: Strong data analysis skills. Strong collaboration and communications skills. Ability to come up with solutions to loosely defined business problems by leveraging pattern detection over potentially large datasets. Proven ability to communicate (both orally and visually) findings to make data analysis actionable and understandable by business partners, including IT and analytics. Experience with data analysis tools such as: SQL, Hadoop, Teradata, SAS, Excel, Access, etc. Business development and relationship building to establish partnerships with third parties and internal stakeholders.Skills Preferred: Proficiency in statistical analysis and techniques, quantitative analytics, forecasting/predictive analytics, multivariate testing, and optimization algorithms.Experience Required:3-5 years of relevant quantitative and qualitative experience in research and analyticsEducation Required:  Bachelor’s degree in Business, Information Technology, Analytics or other relevant discipline.Education Preferred: Master’s degree in Business, Information Technology, Analytics or other relevant discipline.Additional Information: Global Data, Insight, and Analytics (GDIA) organization is looking for a highly skilled Data Operations Analyst.   You will have the opportunity to work with some of the brightest global subject matter experts that are transforming the automobile industry.  Fast Switch, Ltd., delivering the Right Talent at the Right Time for over 21 years. We are an IT Consulting company with offices in Detroit, MI, Columbus, OH, Cleveland, OH, Cincinnati, OH, New York, Hartford, CT, Massachusetts, Minneapolis, MN, Los Angeles, CA, San Francisco, CA, and Tucson, AZ. We’re doing business in almost half the states in the union.  We're a financially strong, privately-held company that is 100% consultant and client focused. You are our most important asset!  We've differentiated ourselves by being creative, flexible, and fast. Throw out everything you've heard, seen, or felt about every other IT Consulting company.  We're different. Our consultants and clients tell us so, and it's our great people who make the difference! We do unique things, and we do them for Fortune 10 companies, Inc. 500 companies, and technology start-ups. We also have a strong belief in giving back to the communities we serve.  Our benefits are second to none and thanks to our flexible benefits options you can choose just the benefits that you need or want, options include:  • Medical and Dental (Fast Switch pays majority of the medical program)  • Vision  • Personal Time Off (PTO) Program  • Long Term Disability (100% paid)  • Life Insurance (100% paid)  • 401(k) with immediate vesting and 3% (of salary) dollar-for-dollar match  Plus, we have a lucrative employee referral program and an employee recognition culture.  In 2013, 2014, 2015, 2016 and 2017, Fast Switch was named one of the Top Work Places in Michigan by the Detroit Free Press and one of the Best Staffing Firms in 2016 and 2017. We have won the Columbus Business First “Fast 50” award 9 times in 12 years because of our strong growth which translates into more and better opportunities for our consulting staff members.  To view all of our open positions, please go to: www.fastswitch.com and at the bottom of the page click Job Opportunities, or get there directly at: http://tinyurl.com/z6r74up  You can also follow us on Twitter at: www.twitter.com/fastswitch  And you can become a fan of Fast Switch on Facebook at: http://tinyurl.com/y9y3gdp"}