{"jobID": "2832165705", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analytics Analyst(RECENT COLLEGE GRADS)", "companyRating": null, "companyInfo": {"Website": "www.group.bnpparibas", "Headquarters": "Paris, France", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (BNP) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " What sets Bank of the West apart from other banks is our team membersthey embody the optimistic spirit of the West. There is a spirit here that drives us to do more. Our team of more than 10,000 employees is vital to the success of our Bank. They reflect our modern western valuesstraightforward, entrepreneurial and optimistic. We seek to create a corporate culture that fosters and rewards excellence, encourages creative thinking and respects diversity an environment where team members are engaged, supportive of one another and enthusiastic about serving our customers. Bank of the West offers the stability of a company that has a 135 year history and is part of BNP Paribas, a European leader in global banking and financial services and one of the 6 strongest banks in the world. We offer opportunities across our diverse business lines Retail Banking, Commercial Banking, National Finance, and Wealth Management.  Responsible for planning, developing and articulating retail strategy toshare with senior management and Board level Committees; controlling workflowactivities and deadlines. The Data Analytics Analyst collaborates withmanagement and business partners to develop key messages and of the report,coordinates with subject manager experts to develop report contents, managesthe review cycles, and supports Senior Reporting Analysts to ensure timelysubmission of the Committee Reports to Committee Coordinators.  Essential Job Functions Develop creative approaches toproblem solvingCommunicate information and dataeffectively with the use of effective and dynamic presentations, including thecreation of easy to understand charts, graphs and diagramsPrepare and participate inpresentations on strategic initiatives, developing supporting action plans andkey performance indicators (KPIs) to track progress and review/refinestrategiesDevelop, distribute and managevarious Senior Management and Board level reports with multiple or variousfunction focus. Manage processes and procedures to ensure all reports andsupporting documents are completed accurately and within required timeframes.Plan and manage the schedule andworkflow for multiple reports, working directly with subject matter experts toproduce, contribute, review, and approve the results. Manage databases and spreadsheets through dataentry and file uploads, and perform verifications for completeness andaccuracy.Collaborate with subject matterexperts to extract, filter, and aggregate data using logical queries and basicprogramming. Provide guidance in constructing data metrics, statistics, andanalysesProvide trend analysis throughthe data analysis. Design the layout of information/data, including use ofinfographics. Format reports and presentation materials into establishedtemplates and style guidesManage projects to support newinitiatives Other Job Duties Performs other duties as assigned Education&Experience; Bachelor's Degree with experiencein presentation design and storytelling, analysis, and data modelingDeep knowledge of job area typicallyobtained through advanced education combined with experienceMay have knowledge of projectmanagement5 years of prior experience,including relevant education and internships Required Experience andSkills Creativity,curiosity, and the desire to learn, collaborate and innovateExcellent abilityto synthesize information, transform technical data into easily understandableconcepts and develop a compelling storyKeen eye for design andunderstanding of layout flows and infographicsStrong verbal andwritten communication skillsStrong analyticaland quantitative modeling skillsAbility to adjust to changingenvironment and prioritize deliverablesGood managementand control of work flows to produce deliverables within required timeframes andquality standardsBasicunderstanding of financial industry, risk management, and/or corporate securityGood inter-personal andpartnering skills to facilitate effective working relationshipsProactive approach combined withpassion and a \"can-do\" attitudeStrongleadership, and keen focus on details skills Equal Employment Opportunity Policy  Bank of the West is an Equal Opportunity employer and proud to provide equal employment opportunity to all job seekers without regard to any status protected by applicable law. Bank of the West is also an Affirmative Action employer - Minority / Female / Disabled / Veteran.  Bank of the West will consider for employment qualified applicants with criminal histories pursuant to the San Francisco Fair Chance Ordinance subject to the requirements of all state and federal laws and regulations.  Postuler  Partager cette offre ! Facebook A partager avec vos amis Twitter Tweeter cette page LinkedIn Partagez cette page avec votre réseau Messenger Share this page on Messenger WhatsApp Share this page on WhatsApp Scoop It Partagez votre veille d'informations avec Scoopit Weibo Partagez cette page sur le 1er réseau social chinois Buffer Pas le temps? Lisez et partagez cette page plus tard avec Buffer Pocket L'appli pratique pour lire cette page tout moment, même en offline !  Voir plus de réseaux sociaux  Outils Envoyez cette page par mail Envoyez cette page par mail Imprimer cette page Etes vous sûr de vouloir imprimer ?  Offre précédente  Mortgage Area Sales Manager  Offre suivante  Universal Banker I (Teller&New; Accounts) - 20 hours  Ces autres offres vous intéressent-elles ? Full-time Sr Lead Data Analytics Analyst (Enterprise Data Mgmt) United States-Arizona-Tempe Full-time Senior Social Media Analyst United States-California-San Francisco Full-time Senior Reporting Analyst United States-California-San Ramon"}