{"jobID": "2802867563", "jobLocation": "Washington_DC", "jobTitle": "Database Specialist / Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.cdicorp.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1950", "Type": " Company - Public (CDI) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Database Specialist / Data Scientist Washington, District Of Columbia, United States COMPANY PROFILE: Join a team with EXCELLENCE, LOYALTY and INTEGRITY! CDI Corporation consistently appears on ENR's annual \"Top 500 Design Firms\" list, ranking the largest engineering, architectural and environmental design firms by revenue. Ranked #28 in Top 500 Design Firms in 2012! Forbes.com named CDI as one of the Most Trustworthy Companies in the United States. (2008) CDI Marine Company is a division of CDI Government Services and a leader in providing our clients with high quality, cost effective engineering, design and logistics services in the marine industry.CDI Corporation is an EEO/An Affirmative Action M/F/D/V EmployerGENERAL DESCRIPTION: CDI is seeking Database Specialist / Data Scientist. This is a Full Time position in the Washington, DC area. This position is contingent upon contract award.GENERAL DUTIES: Creates software engineering to collect data to form decisions Provides all activities related to the administration of computerized databases. Able to communicate with management, technicians, and end-users to evaluate need prior to development of an automated solution. Prepares detailed reports which might include system requirements such as concurrent usage factors, data storage requirements, response rates, and discuss procedures for processing data using data base management systems (DBMS) including relational data bases. Projects long-range requirements for database administration and design in conjunction with other managers in the information systems function. Designs, creates, and maintains databases in a client/server environment. Conducts quality control and auditing of databases in a client server environment to ensure accurate and appropriate use of data. Advises users on access to various client/server databases. Designs, implements, and maintains complex databases with respect to access methods, access time, device allocation, validation checks, organization, protection and security, documentation, and statistical methods. Applies knowledge and experience with database technologies, development methodologies, and front-end (e.g., COGNOS)/back-end programming languages (e.g., SQL). Performs database programming and supports systems design. Includes maintenance of database dictionaries, overall monitoring of standards and procedures, file design and storage, and integration of systems through database design. Evaluates data base design tradeoffs, impacts on user expectations, performance levels, and space allocation requirements.MINIMUM SKILL REQUIREMENTS :  BS degree in computer science or other technical field and degree of applicability Five (5) years of creating working with data bases, balancing both engineering and data analysis concerns Must possess an outstanding knowledge of standard written English grammar, spelling, punctuation Strong communication and interpersonal skills required to interface with clients, employees, and management; Must have enthusiasm and a positive, team-oriented attitude Ability to organize and multi task is a must Proficiency in Microsoft Excel, Word, and PowerPoint and other MS products Excellent and effective written & verbal communication skills.SECURITY REQUIREMENTS: Applicant may be subject to a security investigation and then meet the eligibility requirements to obtain and maintain a security clearance issued by the US Government. In addition to the security clearance, this position may require an additional background screening for base access.PHYSICAL REQUIREMENTS/PHYSICAL DEMANDS: CARRYING and LIFTING. Ability to transport and lift up to 30 lbs. Employee is required to access remote areas of multi-level vessels Must comply with Company's Driver Safety Policy if assigned to operate company and/or rental vehicles Type: Contract  Reference ID: 369225"}