{"jobID": "2829366937", "jobLocation": "Clinton_MI", "jobTitle": "Trait Delivery Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " About Syngenta  Syngenta is a leading agriculture company helping to improve global food security by enabling millions of farmers to make better use of available resources. Through world class science and innovative crop solutions, our 28,000 people in over 90 countries are working to transform how crops are grown. We are committed to rescuing land from degradation, enhancing biodiversity and revitalizing rural communities. About this Role: Syngenta is hiring a Trait Delivery Scientist (TDS) to support the mid and full season Corn Belt; the position is based in Clinton, IL. The purpose of the TDS role is to implement successful selection and delivery of new corn trait conversions and supporting technical product information to the Syngenta Product Development (PD) and Commercial Teams. The TDS works within a multi-function Breeding Product Delivery team to deliver products defined by market specific Target Product Profiles. Essential Duties&Responsibilities;: Deliver new trait conversions for assigned projects as a member of the Corn Product Selection Team, including: Coordinate TD trialing protocols with Operations team (e.g. trial entry selection, seed makeup, testing locations, required phenotypic note collection).Observe and characterize new trait conversions against recurrent parents in multiple environments, including associated inbreds and hybrid crosses.Evaluate, analyse, and summarize high quality data for Trait Declarations decisions.Declare new conversions for use in all stages of PD, Hybrid Promotion, and Commercial Sales.Provide clear direction for any product specific use requirements. Ensure connection to the PD Pipeline and Commercial business: Develop expert knowledge of PD and Commercial needs in assigned markets through direct interactions with PD and Commercial teams.Provide product expertise, data, and insights to PD and Commercial teams in support of trait conversion launch and use.Represent and build confidence in Syngenta products, people and processes to our internal and external customers.Help to establish and update trait conversion protocols and capacity to optimize overall trait conversion and delivery pipeline as appropriate with key Commercial and Technical experts. Support delivery of competitive fully traited germplasm across the stage plan by working closely with Trait Introgression (TI), PD, and Commercial teams to: Declared new inbred/trait combinations aligned with PD and Commercial needs.Review trait strategy and technology needs to provide direction on trait conversion and product pipeline support.Provide data from TD testing to improve TI and PD processes.Provide feedback received from customers on performance of traits, stacking strategies, and/or specific conversions to improve product performance.Support adjacent teams with inbred increase procedures and Equivalency and Efficacy protocols.Recommend improvement to TI, TD, and inbred increase processes based on knowledge of traits, conversions, and general breeding. Determine fit-for-purpose trialing locations that are aligned to trait delivery needs: Determine placement of TD trials.Provide feedback to Trialing Managers that allows for continuous improvement in plot quality and testing efficiency.Essential Knowledge&Experience;:Excellent organization, communication and computer skills.Excellent interpersonal skills, especially those required to successfully function as part of a cross-functional team.Ability to understand and communicate complex instructions.Excellent presentation skills to a diverse set of audiences and key stakeholders.Ability to work autonomously.Technical traits knowledge and skills.Ability to interact effectively with internal/external customer.Ph.D. (or M.S. with equivalent years of experience) in one of the agricultural sciences such as plant breeding/genetics, agronomy, entomology, or plant pathology with training and experience in applied sciences preferred.Expert knowledge of traits and trait conversion with thorough knowledge of germplasm, trait value, and data analysis.Knowledge of agronomic and crop management practices.Good understanding of experimental design and experience in practical field trialing.Demonstrated experience in a similar role utilizing similar skill sets.Additional Knowledge, Skills, Traits&Abilities;:All applicants must be eligible to work in the US.Extensive travel by plane&automobile; up to 20%.Periods of intense work beyond normal work day hours at critical times of the year (e.g., planting, pollinating, harvesting, etc.).Working conditions while performing essential functions:Working conditions are typical of field and laboratory agricultural environments, including heat, dust, corn pollen, sun exposure and mechanical equipment.________________________________________ Syngenta is an Equal Opportunity Employer and does not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. Syngenta Contact Information: If you need assistance during the application process, please contact the Service Desk at na.sta_pc_team@syngenta.com  Family and Medical Leave Act (FMLA)  (http://www.dol.gov/whd/regs/compliance/posters/fmla.htm)  Equal Employment Opportunity Commission's (EEOC)  (http://webapps.dol.gov/elaws/firststep/poster_direct.htm)  Employee Polygraph Protection Act (EPPA)  (http://www.dol.gov/whd/regs/compliance/posters/eppa.htm)"}