{"jobID": "2826748928", "jobLocation": "Irving_TX", "jobTitle": "Data Analyst V", "companyRating": null, "companyInfo": {"Website": "www.vistraenergy.com", "Headquarters": "Dallas, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " If you have what it takes to become part of the Vistra Energy family and would like to start a promising career with a global leader, take a look at the exciting employment opportunities that are currently available and apply online. Job DescriptionOverview: Within TXU Energy, an Analyst job function has been created to undertake policy definition and approval, customer experience definition, strategic positioning, customer characteristics and behavior definition, and other similar functions associated with the Energy Retail work streams. As part of this team, the Analyst V has lead and subject matter expert responsibility for analyzing and developing improvements to business processes, identifying and facilitating the creation of appropriate reporting and definition around each function, managing and integrating processes relating to operations, and delivering an improved customer experience. Responsibilities:Deliver key insights by uncovering root causes for trends in sales, gains, losses and swaps by transaction type, channel, campaign, product and over time. Ability to derive insights from complex data for presentation and decision making.Partner with our Marketing, Credit and Information Technology team to develop / deliver structured and Ad-Hoc reporting that supports analytical groups across the company utilizing tools such as SAS and SQL for data extraction and Tableau, Excel and others for visualization.Partner with our modeling team to create models which help improve customer retention, acquisition and improve customer value.Provide deep-dive analytical support for various sales channels, including campaign performance measurement. Focus on acquisition and retention performance optimization by analyzing current processes.Analyze financial impact of trends and opportunities leveraging business metrics of success such as NPV, PV/I etc. to develop financially justifiable recommendations.Partner with Pricing and Performance Management teams to build and further improve relevant business cases. Perform sensitivity analyses for key assumptions and market scenarios, as necessary.Partner with business functions across the company and with acquisition, retention and service channels, including reactive and targeted call centers, Door to door, DM, Online and others to provide relevant, insightful, timely and accurate views of performance and incentive reportingQualifications:Bachelors with 3 plus years of relevant industry experience or Masters plus 1 plus years of relevant industry experienceExcellent business, financial and analytical acumenPrior experience in extracting and analyzing large volume of data using SAS / SQL or other large data analysis toolsVery strong Microsoft Excel & Power-point skillsProject Management SkillsJob FamilyMarketingCompanyTXU Retail Services CompanyLocationsIrving, TexasTexasWe are a company of people committed to: Exceeding Customer Expectations, Great People, Teamwork, Competitive Spirit and Effective Communication. If this describes you, then you will have a good career here!"}