{"jobID": "2768293990", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Quality Analyst", "companyRating": "2.9", "companyInfo": {"Website": "www.intelliprogroup.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Overview  As a technical writer on the team, you will teach internal developers how to build experiences for the next wave of computing (AI & Machine Intelligence) on to various our client products. This will include writing overview, conceptual and integration guides.  You will work with other tech writers, engineers and product managers to determine which features need documentation. You will then work independently to investigate code, tools and APIs, create document plans, write developer guides and maintain engineering and partner documentation.  You might have a background as a developer and have a passion for teaching others through written communication; or you're a seasoned communicator with experience in languages such as Java or JavaScript. One thing is for sure: you love to investigate new technology and make complex things easy to understand.  Top responsibilities Write technical documentation, such as integration guides, API reference docs, developer guides, overview docs, architecture diagram, codelabs and tutorials for internal teams to help them integrate with the platform.Identify documentation gapsWork with engineers and cross-functional teams to fill those gaps through documentation. Required Qualifications BA/BS degree or equivalent practical experience.5+ years experience in writing, technical documentation, and/or developer outreach for a developer audience.Proven record of writing accurate, clear, and concise documentationExperience with authoring tools such as XML, HTML, Markdown, and our client Docs.Familiarity with version control tools such as Piper/Perforce or Git.Comfortable working with prototype hardware in test environments and using that experience to create developer guides.Proficiency with Markdown and CSS; proficiency in a Unix environment. Preferred qualifications 5+ years of relevant work experience, including experience researching and writing excellent documentation for developers (APIs, SDKs, web technologies).Ability to manage multiple competing priorities in a fast-paced, constantly changing environment.Experience to read code and write code samples in Java, C++, Java, and/or JavaScript."}