{"jobID": "2812676145", "jobLocation": "South_Hackensack_NJ", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.dimexcorp.com", "Headquarters": "Marietta, OH", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Company DescriptionRapidly growing consumer electronics distributor and repair company is seeking an experienced Analyst to join our high-energy organization. As an Analyst, you will be responsible for analyzing opportunities and identifying market trends. The ideal candidate loves data and has advanced computer skills.Job DescriptionThis is an exciting opportunity for an individual who has an outgoing personality and is looking to work within a highly collaborative yet self-directed environment. If you are a self-starter, organized and proactive, then this might be the right opportunity for you to utilize your skills. The right candidate must possess excellent prioritization and time management skills, as you will have need to handle competing demands on a daily basis.  We are seeking an individual who thrives on a challenge, and a desire to grow and succeed. The ideal candidate must possess a solid understanding of data analysis.QualificationsDuties and Responsibilities: Analyzes purchasing opportunities by reviewing offers regularlyKeeps up with market changes and identifies trends to avoid stock outsKeeps up with market pricing to avoid potential losses from overpayingCollaborates with QC manager to identify quality concerns among vendorsCollaborates with sales team to understand demandCreates purchase orders for needed productProvides reporting on a regular basisPerforms other duties as assignedQualifications2+ years experience in a related data analyst roleAdvanced knowledge of Microsoft ExcelRemarkable analytical abilitiesExcellent time management and organizational skillsExceptional interpersonal and communication skills, both oral and writtenAdditional InformationAll your information will be kept confidential according to EEO guidelines."}