{"jobID": "2585100985", "jobLocation": "Marina_del_Rey_CA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.zefr.com", "Headquarters": "Venice, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Media", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": "ZEFR is hiring! We are hiring a Data Scientist to be involved in building and optimizing large-scale systems to acquire, process, store, and understand multiple terabytes of YouTube and other social media data. This role is an important part of the rapidly growing demands of being the leader in VideoID technology for content owners and brands. In this role you will use advanced natural language and computer vision techniques to extract and understand tens of millions of rows of data. We are really looking for someone who is passionate about cutting edge research in the machine learning field. We want an individual who is able to digest research papers and implement interesting ones. This is a role where we both expect to learn from you and have you learn from us! Here's what you get to do:Participate as a member of the Data Science team, work closely with other data scientists, engineers, and product managersDesign, implement, test, and productionalize both supervised and unsupervised machine learning modelsMake use of NLP and image processing algorithms to help better understand our dataPrototype creative solutions quickly, test theories, evaluate feature concepts, and iterate rapidlyGet your models into a large scale engineering system including automatic retraining and model deployment.Here's what we're looking for:A degree in a science discipline. While Computer Science and related fields are common we are actively looking for individuals who have demonstrated their saavy in data in other fields as well. A strength in Machine Learning, Information Retrieval, Natural Language Processing, and Image Processing is a plus.Ability to think critically about an ill posed problem and come up with creative solutionsDesired experience in developing end-to-end machine learning pipeline from data exploration, feature engineering, model building, performance evaluation, and online testing with large data setsDesired experience with large-scale data analysis frameworks: Hadoop, Spark, SQL3+ years of experience with at least one dynamically typed language, and one statically typed language. Here at ZEFR we make use of primarily Scala and Python.Cloud computing infrastructure on Amazon is a plusFoundation in data structures, algorithms and software designOpenness to new technologies and creative solutions"}