{"jobID": "2760239662", "jobLocation": "Detroit_MI", "jobTitle": "Apheresis Registered Nurse - RN", "companyRating": "3.3", "companyInfo": {"Website": "jobs.fmcna.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Baxter, DaVita, Dialysis Clinic Inc"}, "estimatedSalary": "33", "jobDescription": "PURPOSE AND SCOPE: Supports FMCNAs mission, vision, core values and customer service philosophy. Adheres to the FMCNA Compliance Program, including following all regulatory and FMS policy requirements.  Provides safe, effective Apheresis treatments, ensuring all treatments are performed according to established procedures, guidelines, and contracts in compliance with all pertinent regulatory requirements. DUTIES / ACTIVITIES: CUSTOMER SERVICE:Responsible for driving the FMS culture through values and customer service standards.Accountable for outstanding customer service to all external and internal customers.Develops and maintains effective relationships through effective and timely communication.Takes initiative and action to respond, resolve and follow up regarding customer service issues with all customers in a timely manner.PRINCIPAL RESPONSIBILITIES AND DUTIESGeneral:Performs scheduled, un-scheduled and emergency Apheresis treatments and other extra-corporeal therapies (Therapeutic and Donor) in the assigned hospital(s), establishing priority of care. Initiates, monitors, and discontinues prescribed treatments and medicine according to established FMS and FMCNA policies and procedures.Ensures adequate coverage of patient treatments and customer needs through appropriate scheduling.Travels outside regional area as necessary to help with coverage of patient treatments to perform Apheresis or other extra-corporeal therapies.Maintains a safe environment for self, patients and staff by following universal infection control precautions in performing patient care and handling of equipment.Maintains current knowledge of the advancements in the Apheresis field.Patient Care:Assesses patients pre, during and post treatment to detect mild, moderate and severe Apheresis and non-Apheresis related complications, notifying the appropriate hospital personnel as appropriate.Reports all new or unusual incidents, information, complaints or problems to the applicable Apheresis Managers and/or hospital personnel, tracking and documenting all adverse events in accordance with the Variance Reporting guidelines.Appropriately documents all pertinent information on patients record.Completes appropriate training programs to successfully deliver specific patient care to a variety of patients.Utilizes the principles of growth and development to assess patients status, identifying each patients relative requirements, providing recommendations for the patients plan of care.Implements physicians orders and follows through appropriately.Ensures patient confidentiality.Assists in the evacuation of patients in the event of emergency, fire or disaster according to company and hospital policy and procedures.Technical:Assists with, and performs all equipment maintenance, disinfection and inventory control according to corporate and department policy, manufacturer recommendations and regulatory agency guidelines.Sets-up, monitors and discontinues use of Apheresis equipment, blood warmer and other equipment used for related procedures according to established standard operating procedure.Manages and maintains supply inventory in an efficient and cost effective manner, documenting all inventory control information and equipment maintenance according to policy.Maintains competency in the operation, sanitization, maintenance and troubleshooting of all equipment used for Apheresis.Maintains a safe, neat, and adequately stocked supply and equipment area.Reports all equipment and supply problems to repair personnel.Staff Related:Acts as a resource for other staff members.Participates in staff meetings and mandatory continuing education as scheduledCommunicates effectively with physicians, supervisors, hospital staff, coworkers, patients and families.Recognizes and utilizes opportunities for patient and family education specific to individual and family needs.Maintains a positive working relationship with all company and hospital staff members to ensure effective and efficient treatments.Other:Other duties as assigned.PHYSICAL DEMANDS AND WORKING CONDITIONS:The physical demands and work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Day to day work includes desk and personal computer work and interaction with patients, facility staff, and physicians. The position requires travel between assigned facilities and various locations within the community. Travel to regional, Business Unit and Corporate meetings may be required. Position requires on-call rotation. The work environment is characteristic of a health care facility with air temperature control and moderate noise levels. May be exposed to infectious and contagious diseases/materials. May be required to move approximately 200-lbs with mechanical assistance.EDUCATIONGraduate of an accredited School of Nursing (R.N.) or Baccalaureate Degree in nursing scienceCurrent appropriate state licensure.EXPERIENCE AND REQUIRED SKILLSApheresis experience preferred.Current licensure in state(s) of practice.Successful completion of competency training course in theory and practice of Therapeutic Apheresis and related procedures.Valid drivers license and automobile insurance..Successful completion of current CPR Healthcare Recognition according to the American Heart Association.Employees must meet the necessary requirements of Ishihara's Color Blindness test as a condition of employmentICD-9 coding TrainingEO/AA Employer: Minorities/Females/Veterans/Disability/Sexual Orientation/Gender Identity"}