{"jobID": "2791339432", "jobLocation": "Reston_VA", "jobTitle": "Data Warehouse/Database Analyst Modeler", "companyRating": "3.6", "companyInfo": {"Website": "www.mantech.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (MANT) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "Req ID 98608BR Business Title Data Warehouse/Database Analyst Modeler Group MSS Location USA VIRGINIA Reston Clearance Level Needed None Category Information Technology Job Duties and ResponsibilitiesManTech International Corporation will be hiring experienced and skilled Data Warehouse/Database Analyst Modeler to provide Business Intelligence Support Services to assist the U.S. Government Customs Border Patrol (CBP) officers and border enforcement personnel. The chosen candidate will look to effectively and efficiently help to provide analysis in identifying cargo, individuals, conveyances that may present additional risk to the United States. They will conduct terrorism analysis and global assessments that convey changes in terrorism threats and identify emerging threats, develop and evaluate CBP-wide intelligence-based targeting rules and intelligence driven special operations, and coordinate and enhance analysis and target efforts.  The analyst will be responsible for engaging with stakeholders and customers to gather requirements for the design and development of data models and design specifications using star schema techniques; analyze and create Extract-Transform-Load (ETL) specifications. Day to day responsibilities includes:  · Responsible for data warehouse design and development including conceptual, logical and physical data models, data analysis, data profiling, and ETL design.  · Working closely with client to assist in managing data needs, and supporting collection of data needed for various operational needs.  · Data analysis, problem solving, investigation and creative thinking with massive amount of data supporting variety of operational scenarios  · Respond to data queries/analysis requests from various groups within an organization. Create and publish regularly scheduled and/or ad hoc reports as needed.  · Responsible for the analysis and design of data marts for the Enterprise Data Warehouse.  · Analyzing source system data to understand the data structures, definitions and anomalies.  · Researching and documenting data definitions for all subject areas and primary data sets supporting the core business applications.  · Support development staff in their implementation of the reports and universes  · Provide data analysis for understanding and interpreting various operational data for the organization.  · Analyze and capture meaningful and operationally actionable information from very large scale relational database. Qualifications· 4-5 years’ experience in application development/full life cycle on Data Warehouse engagements  · At least 3 years’ experience in large (80TB+) and complex data warehousing architecture, design and implementation/migration.  · 3-5+ years of experience in PL-SQL development using Oracle preferably in Exadata environment.  · Proficiency in SQL programming and query development using SQL Developer or TOAD.  · Expert knowledge of complex databases in Oracle environment – preferably running on Exadata  · Experience with relational databases and knowledge of query tools and/or BI tools like Business Objects or OBIEE and data analysis tools.  · Strong understanding of relational data models supporting transactional systems (OLTP) and dimensional data models  · Knowledge of query optimization and usage of Explain Plan  · Expert knowledge of aggregating data using complex SQL code. i.e., using functions such as SUM, COUNT, CASE statements, etc.  · Strong background in data management and analytics.  · Experience with Big data technology a plus  · Solid hands on experience with BI tools specifically SAP BO, Informatica and Oracle, Data Analysis, Architecting complex ETL process, Data Mapping, Unit Testing, Migration, and Conversions.  · Solid Data Modeling skills using Erwin or other comparable tool  · Experience in full life cycle implementation of data warehouses from gathering detail business requirements and translate them into technical requirements through implementation, data warehouse standards and procedures.  · Proficiency with Oracle 11G running on Exadata, Experience with Informatica and SAP BO or OBIEE is preferred.  · Must be able to multitask efficiently and progressively and work comfortably in an ever-changing data environment.  · Must work well in a team environment as well as independently.  · Excellent verbal/written communication and problem solving skills; ability to communicate information to a variety of groups at different technical skill levels. Requirements/Qualifications: · Advanced knowledge of following technologies  · Oracle PL-SQL  · Query Optimization  · Bachelor's Degree in Information Technology, Computer Science or a related field is required, Masters preferred.  MUST BE A US CITIZEN AND ABLE TO OBTAIN A CBP BACKGROUND INVESTIGATION Degrees Associate Degree  Bachelor's Degree  Master's Degree  Master's Preferred  See Qualifications Years of Experience See Qualifications Position Type Full-Time Shift Day Overview ManTech International Corporation is comprised of approximately 7,300 talented employees who use advanced technology to help government and industry meet some of their greatest challenges around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Nearly half our employees have a military background, and approximately 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, health, space, and intelligence communities; we hold nearly 1,100 active contracts with more than 50 different government agencies."}