{"jobID": "2824925207", "jobLocation": "San_Francisco_CA", "jobTitle": "Digital Analytics: Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " Apply Now  Digital Analytics: Senior Data Analyst  Req #: 180012132_2  Location: San Francisco, CA,US  Job Category: Marketing/Communications Job Description: Description  Chase is undertaking an aggressive digital transformation agenda, which builds on the success of the current mobile and online service offerings. Chase is investing in innovative ways to deepen customer engagement and profitability through the use of digital channels. The ambition is to position Chase as the undisputed leader in digital financial services and payments and to enable Chase to deliver the highly personalized, real time experiences that customers increasingly expect.  Chase Digital is searching for a Data Analyst who will be a key member of the Digital Analytics organization. As a Data Analyst, you will work as a member of a cross-functional team to improve the online and mobile experience for our customers. You will be responsible for digging into various types of data to identify areas of friction and delivering actionable recommendation. It is imperative you bring the data to life through storytelling and data visualization. You will work with Product, Customer Experience and Development teams to identify areas of opportunity for key initiatives and drive strategic analysis. This position will be responsible for all analysis and research for one or more key initiatives. Essential Functions&Responsibilities;:Design analytical approach to open-ended strategic business problems.Write code to efficiently gather data from a variety of sources and to apply analytical approach in a SAS and/or Hadoop/Hive environment.Apply statistics, clustering, modeling, and machine learning algorithms to complex business problems.Build scalable and extensible solutions for analysis projects.Bring data to life through visualization and storytelling.Interpret the analysis with a focus on actionable recommendations.Communicate methodology to non-technical business partners.Contribute to sharing and documenting knowledge as well as building out an analytics repository.Discover, explore, analyze and document data from all source and target systems to better understand the total scope of Data Availability at JPMC.Participate in an Agile development process for on-going projects or ad-hoc requests.Escalate issues and concerns appropriately.QualificationsSkills Summary:Bachelor's (Masters preferred) in Statistics, Data Science or related quantitative degree plus 5+ years of working experience in data analytics.Experience writing SAS, R, or Python for data analytics.Experience writing SQL on Teradata, Greenplum, and Hadoop/Hive.Experience with Tableau or equivalent visualization tool.Experience applying statistics, clustering, and modeling to complex business problems.In-depth knowledge of data warehousing, dimensional modeling, and data architecture.Experience working in Unix environment.Experience with Agile methodologies is preferred.Experience in financial industry is preferred.Excellent critical thinking, verbal and written communications skills.Strong estimating, planning and time management skills.Strong understanding of Big Data and open source technologies.Ability and desire to thrive in a proactive, highly engaging, high-pressure, customer focused environment."}