{"jobID": "2733005977", "jobLocation": "Chicago_IL", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {"Website": "www.bcg.com", "Headquarters": "Boston, MA", "Size": "Unknown", "Founded": " 1963", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " McKinsey & Company, Bain & Company, Accenture"}, "estimatedSalary": null, "jobDescription": " BCG's Advanced Analytics group delivers powerful analytics-based insights designed to help our clients tackle their most pressing business problems. We partner with BCG case teams and practices across the full analytics value-chain: framing new business challenges, building fact-bases, designing innovative analytics workflows, training colleagues in new methodologies, and interpreting findings for our clients. The Analytics Solutions team is a global resource, working with clients in every BCG region and in every industry area. It is a core member of a rapidly growing Analytics enterprise at BCG – a constellation of teams focused on driving practical results for BCG clients by applying leading edge analytics approaches.  As a Data Science intern, you'll work on learning and building scalable systems and applications that will power the future of Analytics in the industry. You’ll work on complex technical and business problems and build out innovative business solutions powered by technology stacks that solve these problems. You’ll be required to crunch, analyze and interpret data to drive core business problems like better customer understanding, relevance marketing, digital advertising, recommendation etc. This involves working on massive (terabyte sized) datasets present in databases, website logs, social network activities, documents (pdfs, pictures, videos) etc. You’ll work on large cloud-based distributed computing systems and MapReduce algorithms. Understanding business problemUnderstanding the complex business problem at hand by performing a deep researchApplying the problem solving skills to break the business problems into different modules and figuring out the underlying hypotheses to testDesigning solution frameworkDesign robust and scalable solution frameworks by focusing on each and every moduleUnderstanding the dependability of these modules w.r.t. other modules or external factorsGenerating dummy outputs and getting a signoff to ensure the business relevancy of the solution frameworkAnalysis and hypothesis testingCreate innovative mashups between various relational and non-relational datasets to ensure maximum information gain at initial stepPerforming detailed analysis and testing all the hypothesesUsing advanced data mining and machine learning techniques to enhance the accuracy of the resultsSystems and Application DevelopmentConverting the promising analysis outcomes into algorithms and testing the robustness, efficiency and scalability of every moduleStitching all the algorithms together and ensuring a smooth transfer of information (data and insights) without any lossMaking the system highly automated considering all the scenarios possibleTesting the overall system and tool for worst case scenariosImplementation plan and documentationDeveloping a solution implementation plan by chalking out all the technological and infrastructure related pre-requisitesImplementation plan should have a step-by-step guide to setup the application and potential troubleshooting optionsDeveloping a detailed documentation of the application and tool. Documentation should have the details around every step of the solution framework including detailed explanation of the algorithms built"}