{"jobID": "2747227826", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.avant.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Springleaf Finance, OneMain Financial, World Acceptance"}, "estimatedSalary": "88000", "jobDescription": "Avant is revolutionizing the world of lending by lowering the costs and barriers of borrowing for everyday people. At our core, we are a technology company that builds advanced platforms and uses custom analytics. Today, we help underserved consumers, the majority of whom get fast funding on our online platform without having to talk anyone. Tomorrow we plan to use our world class technology and underwriting capabilities to launch new products and bank partnerships that improve peoples financial lives.Job DescriptionAt the heart of Avants online platform is a suite of software tools developed by the Machine Learning Engineering team. These tools empower Avants Data Scientists to build machine learning models consistently and efficiently. We are looking for Machine Learning Engineers to develop and maintain these powerful data science tools and infrastructure.Are you passionate about process improvement and automation? Are you excited about applications of machine learning techniques? Join us as a Machine Learning Engineer and contribute to the tools used by our Data Scientists to develop the models that lie at the heart of our decision-making processes!What you do at Avant: Develop, test, and document features in the software that powers data science work at AvantReview code and provide feedback to data scientists and data engineersProvide technical support for data scientists and other users of the platform, resolving and documenting issuesAct as a liaison between the Data Science team and technical teams that own our data warehouses and production systemsBe a part of a strong culture of ownership, pragmatism, and testingContribute to tooling as well as our technology architecture and directionWhat you might own at Avant:A software platform used by the Data Science team to develop machine learning modelsInterfaces between the software platform and our data warehouses and production systemsWorkflows that compute and deliver model predictions to internal stakeholders for decision-making and later analysis Why you are a fit for Avant: You have a bachelors degree in computer science, mathematics, physics, or other quantitative fieldYou are comfortable collaborating with both technical and non-technical colleaguesYou have experience using at least one of R and Python, and have the ability and desire to become an excellent software developer in both languagesYou have experience using relational databases such as Oracle, PostgresSQL, SQL Server, Hive QLYou understand the paradigms of object-oriented programming and functional programming, and how to use them to write production-quality codeYou are familiar with machine learning theories and practicesWhy Avant is a fit for you:At Avant, we believe our values make a difference:We value, support, and help each other growWe are committed to active inclusion and diversityWe are transparent and believe the best idea winsWe succeed when our customers succeedWe get sh!t done responsiblyAnd we keep it fun!We believe that ideas are more important than titles, everything is more fun together, everyone drives change, and everyone is an owner. While we believe the perks and benefits that we offer are terrific, nothing excites us more than having the ability to collaborate with intelligent, highly-motivated and talented people on challenging problems as we work to change the face of online lending."}