{"jobID": "2496418763", "jobLocation": "Emeryville_CA", "jobTitle": "Research Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.pixar.com", "Headquarters": "Emeryville, CA", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " DreamWorks Animation, Blue Sky Studios, Sony Pictures Entertainment"}, "estimatedSalary": "115000", "jobDescription": " The position of Research Scientist performs world-class research for the development of advanced computer graphics techniques for use in the production of Pixar’s films and across the The Walt Disney Company. Research Scientists work directly with artists and technical users to create innovative solutions that expand creative reach and technical capability, while maintaining connections to the external research community through publication and leadership of academic and industrial research communities. RESPONSIBILITIES:Identify important research problems relevant to Pixar and the broader Walt Disney CompanyLead research projects to determine solutions to the above problemsWork directly with artists and technical directors to solve practical, real world problemsPublish results in peer-reviewed conferences and journalsMaintain connections to the external research communityKeep apprised of recent research and developments, as well as current technology that may be beneficial, and provide recommendations on the adoption of such technologyQUALIFICATIONS:PhD in Computer Science, Mathematics, Data Science or equivalentExcellent communication skills and the ability to work well with a wide range of personality typesAbility to demonstrate creativity and collaborationA strong and sustained track record of innovation and significant original research including publications in top conferences and journalsAbility to work well both independently and in a group, and be able to handle a variety of tasks in an efficient mannerA strong track record of promoting diversity is a plus For more information about Research at Pixar, visit https://graphics.pixar.com/research/  Pixar is an Equal Opportunity Employer. | Follow us on Twitter @PixarRecruiting."}