{"jobID": "2019406788", "jobLocation": "Lemont_IL", "jobTitle": "Computer Scientist", "companyRating": null, "companyInfo": {"Website": "www.uchicagoargonnellc.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Position DescriptionDo you want to help develop new computer science tools and technologies for transformative science? We are seeking outstanding people to join us in the Mathematics and Computer Science Division at Argonne National Laboratory in exploring innovative areas of computer science – including novel algorithms, analysis techniques embodied in open-source software, data-intensive science, and emerging hardware architectures. As a multidisciplinary national laboratory, Argonne offers an exciting campus atmosphere in which to collaborate on interdisciplinary projects, enabling you to test your computer science ideas on complex scientific and engineering problems on the world’s largest parallel supercomputers.  We have multiple positions at career levels from postdoctoral associates to senior staff researchers. The following areas are of special interest.Operating systems, runtime systems, and virtualizationDistributed systems and servicesData management, storage, and I/O systemsProgramming models, compilers, program verificationData scienceWorkflow automationMachine learningScientific data analysis/visualizationPerformance analysis, modeling, and optimizationPosition Requirements You should have a master’s or doctorate degree in computer science, computer engineering, data science, or a related discipline.Programming expertise in C, Python, Fortran, or another scientific programming language is highly desirable; experience with parallel computing, including MPI, OpenMP, or CUDA is desired.Experience with program development (e.g., writing proposals) is desirable, especially at higher career levels.Considerable knowledge is desired in one or more of the areas named above. Openings are available immediately, but there is flexibility in start dates for highly qualified candidates. More information on computer science work at Argonne may be found at http://www.mcs.anl.gov/group/extreme-computing and http://www.mcs.anl.gov/group/data-intensive-science. Feel free to contact members of these groups directly by email with specific questions.  As an equal employment opportunity and affirmative action employer, Argonne National Laboratory is committed to a diverse and inclusive workplace that fosters collaborative scientific discovery and innovation. In support of this commitment, Argonne encourages minorities, women, veterans and individuals with disabilities to apply for employment. Argonne considers all qualified applicants for employment without regard to age, ancestry, citizenship status, color, disability, gender, gender identity, genetic information, marital status, national origin, pregnancy, race, religion, sexual orientation, veteran status or any other characteristic protected by law. Back to top"}