{"jobID": "2837981629", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.uptake.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": " What We Do  At Uptake, our purpose-built products ingest and analyze sensor and enterprise data, transforming it into actionable insights and immediate outcomes. Together with our customers across a variety of industries, we drive real business value and set new standards for productive, secure, safe and reliable operations. We are based in Chicago, and deeply involved with our community.  Why Work Here  Uptake is a values-driven organization, and we are excited about what we do. We're flexible, honest, hardworking, and collaborative. As a team, we bring our diverse backgrounds, beliefs, and experiences together to solve tough, important problems. We support and challenge one another to bring out the best in each of us, and we might have a little fun along the way. We're also proud to be one of Chicago's best places to work in 2018 according to Forbes and Great Place to Work Institute!  We offer generous benefits including health, dental, vision, parental leave, 401K match, and unlimited vacation. We are lifelong learners, and our Uptake University program offers training and professional development on a wide variety of topics. We also have employee-led community groups including Women@Uptake, Pride@Uptake, Science@Uptake, Parents@Uptake, and many more. Learn more at https://www.uptake.com/careers.  What Machine Learning Engineers Do Here  Data science is at the core of what we do at Uptake. Machine Learning Engineers are part of the Data Science team working to build the core Machine Learning and AI tools that will power Uptake's future.  Typical day to day tasks for a Machine Learning Engineer might include: Develop Machine Learning Tools to power the Industrial World by partnering with data scientists to identify common usage patterns and build tools to accelerate ML model deployment lifecycleCollaborate with Data Science, Product, and Engineering stakeholders to define and implement new data powered products, and deploy and maintain them in productionEvangelize software engineering best practices and proactively identify technical debt and other issues to harden our productsSeeking out ways to automate and accelerate development of data driven products, and then implementing themLearning new skills and technologies through Uptake University courses, reading industry papers, or pair-programming with coworkers on other teams, to ensure the team is always cutting edge For more on what we look for on the data science team, visit https://upt.ac/16ee15fc.  What We Are Looking For 4+ years of applied software engineering experienceApplied experience using Scala, Java, or similar JVM based languagesApplied experience using big data technologies for production, such as Spark, and HDFSApplied experience with RDBMS systems for OLTP workloads, such as Postgres or MySQLApplied experience working with web based APIsFamiliarity with dynamic languages, such as Python or RFamiliarity with data science workflows, and concepts like EDA, training, and scoringCandidates must be authorized to work in the US. Nice to Have Have made substantive contributions to open source projects in the areas of data science or machine learningExperience deploying and maintaining Machine Learning models into productionExperience in predictive modelling; for example, in Kaggle or other Data Science CompetitionsExperience with stream processing with tools like Kafka or FlinkExperience with container technology, like DockerExperience working on concepts like AutoML or end-to-end learningExperience working in one of the following industry areas:Industrial technologyAgricultureMiningEnergyTransportationExperience using javascript frameworks like Vue, Node.js Uptake welcomes and encourages applications from all individuals, without regard to any prohibited ground of discrimination, including from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process."}