{"jobID": "2756016294", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.moj.io", "Headquarters": "Vancouver, Canada", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Samsung Electronics, Automatic, Vinli"}, "estimatedSalary": null, "jobDescription": " At Mojio, were connecting the cars of today for the journeys of tomorrow. Backed by leading investors including Amazon and Deutsche Telekom, Mojio is driving the global adoption of its connected car technology via its growing portfolio of mobile network operator customers, including T-Mobile in the US, Austria and Czech Republic, Bell, Rogers and Telus in Canada, and Telekom Deutschland in Germany. With more than 7 billion miles worth of real-world driving data, we have created one of the largest and fastest-growing big data pools in the automotive industry. If youre interested in joining us on our mission to give every vehicle a voice, apply now! Who you are You are a software engineer or a Devops with a passion for big data and working on data-related tasks. You will work with Data Scientists and Analysts to implement and maintain the big data pipelines that carry and store our customer base data to our live (hot) and cold storages and databases. You should be capable of building data infrastructure that stores our flowing data in proper format, in a timely and stable manner, and with the lowest storage cost. Such tasks include spinning up Spark clusters, implementing data streaming pipelines using Scala/Python, and managing the back-up metastores and Sql and NoSql databases, to name a few. The role requires ability to collaborate with multiple teams and identifying new opportunities to take on emerging engineering challenges. Education Details Bachelors or Masters degree in Data Science, Computer Science, Operation Research, Software Engineering or equivalent from top accredited universities. Key Qualifications2-5 years of data engineering, software engineering, or Devops experienceExperience implementing and maintaining data streaming pipeline using Apache SparkExperience in software development methodologies and working knowledge in Scala/PythonExperience working with one of the Cloud Service providers such as Microsoft Azure, AWS, or Google Cloud PlatformExperience designing distributed data storage structure on massive amount of dataFlexibility and comfort working on a dynamic, fast-growing effort with minimal documentation and process.Aptitude to deal with ambiguity, and enthusiasm to help solve difficult issues All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, gender identity, social orientation, nor on the basis of disability. Posted positions are not open to third party recruiters/agencies and unsolicited resume submissions will be considered free referrals."}