{"jobID": "2809297528", "jobLocation": "Oakland_CA", "jobTitle": "Research Scientist III Investigator", "companyRating": "3.9", "companyInfo": {"Website": "www.kaiserpermanente.org", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1945", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " HCA Healthcare, Dignity Health, Sutter Health"}, "estimatedSalary": "132000", "jobDescription": " Serves as principal investigator on major health services or epidemiological research projects for the Division of Research (DOR). May assume responsibilities of Assistant Director. Essential Functions: Designs, develops, obtains funding and directs an ongoing research program including several major projects. Prepares grant proposals, internal reports and publications, independently. May collaborate on other proposals, reports and publications. Serves on and may chair Division of Research committees.  Mentors/supervises junior level research scientists and technical staff. May assume administrative responsibilities of Assistant Director. Provides consultation to top-level regional and inter-regional TPMG, KFH/P managers/committees. Presents papers at national scientific meetings; teaches and/or reviews papers for national journals.  Evaluates and consults on research proposals of others. Provides service to the scientific community through membership on peer review groups and national boards. Consults with local, state and national voluntary and governmental agencies. Serves as member of state/national study review panels.  Kaiser Permanente conducts compensation reviews of positions on a routine basis. At any time, Kaiser Permanente reserves the right to reevaluate and change job descriptions, or to change such positions from salaried to hourly pay status. Such changes are generally implemented only after notice is given to affected employees. Basic Qualifications: Experience  Thirteen (13) years of professional experience in conducting original research and publishing full-length, first-authored, peerreviewed papers (analogous to academic series - Full Professor).  Experience as principal investigator on at least 4 major projects, or equivalent accomplishments. Education Doctoral degree in epidemiology or related field OR eight (8) years of experience in a directly related field.  High School Diploma or GED required.  License, Certification, Registration  N/A Additional Requirements: National recognition; outside letters of support will probably be required to demonstrate this.  Proficient in all advanced research techniques and study designs commonly used in epidemiological and health services research.  Demonstrated exceptional level of knowledge of the field of study.  Must be able to work in a Labor/Management Partnership environment. Preferred Qualifications: MD or DO degree or equivalent  Board certified in one of the following specialties: Internal Medicine, Family Medicine, Pediatrics, combined Medicine/Pediatrics, Obstetrics/Gynecology, or equivalent  Current, active Medical License  Competent in the statistical techniques, study designs and general research methods commonly used in epidemiological and health services research  Experience conducting vaccine clinical and/or observational trials  Subspecialty training in infectious diseases, or another subspecialty with strong interest in infectious diseases  MPH or MSc in clinical trials, or equivalent experience  Track record of success in obtaining research funding  Experience and training in vaccinology  Experience navigating regulatory requirements for clinical trials  Experience in publishing peer-reviewed results  Experience as a principal investigator on at least one major project "}