{"jobID": "2836439166", "jobLocation": "Allen_TX", "jobTitle": "Sr Data Architect /Data Modeler", "companyRating": null, "companyInfo": {"Website": "www.commerx.com", "Headquarters": "Calgary, Canada", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Note: This position is not eligible for Overtime billing. Title: Sr Data Architect /Data Modeler Roles and Responsibilities:The ideal candidate will have advanced Data Modeling and Data Warehouse with strong Data/ETL Architecture.Creates logical and physical data models for as is and proposed or to be systems.This role is expected to form a deep relationship and partnership with the BI and ETL Development teams.This resource will be responsible for strategic projects that focus on source system knowledge/analysis, complex business requirements, design and delivery.Creates entity-relationship diagrams for relational systems and dimensional diagrams for the Data Warehouse, DataMarts, ODS, and data lake.Reviews report design documents to understand where data model structures can address requirements. Skill Set:Extensive hands-on technical knowledge of Data Warehouse Architecture, ETL, Oracle & Teradata Server databases.10+ years of related experience in large corporate system environments working with large and complex data warehouse systems.Strong SQL and data analysis skills.Strong experience using at least one of the top data modeling tools, such as ERwin, ER/Studio or PowerDesigner.Hands-on experience with modern enterprise data architectures and data toolsets (ex: Kimbell, Inman, relational, and hybrid data models, modeling tools, profiling tools).Must be able to create and maintain enterprise data models with multiple subjected areas.Familiar with designing data warehouses for metrics driven BI and reporting environments for Spotfire or similar reporting tool."}