{"jobID": "2770260983", "jobLocation": "San_Francisco_CA", "jobTitle": "DIRECTOR, DATA STRATEGY AND PRODUCT", "companyRating": "4.6", "companyInfo": {"Website": "www.ultimatesoftware.com", "Headquarters": "Weston, FL", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Company - Public (ULTI) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " ADP, Workday"}, "estimatedSalary": "190000", "jobDescription": " Ultimate Software is looking for a strategic leader with a strong background in data science and analytics to drive strategy and execution across our HCM focused data foundation and underlying platforms.  Building on UltiPro’s machine learning and analytics engine, Xander, the Product& Strategy Owner for Data& Analytics will be responsible for partnering across the organization to identify opportunity areas to extend our products through advanced data pipelines, analytics and machine learning. This person will be responsible for developing a vision, defining the strategic direction and owning delivery of products in our Data Foundation focus area, this includes the areas of Data Science, BI& Analytics and Data Platforms.  Qualified candidates are highly-motivated, innovative and solution-driven with experience in big data platforms and the application of analytics, natural language processing and machine learning to solving complex business problems. This role will be pivotal to the success and effectiveness of our data practice as it scales to its next level while maintaining its position as an industry leader in its space. The ideal candidate is an accomplished, high energy, collaborative leader who has a proven track record in big data and analytics.  Here at Ultimate Software, we truly put our people first. We strongly believe in teamwork, and we encourage and trust our people to reach higher, learn more, and live up to their potential. Ultimate is ranked #1 on Fortune's“Best Places to Work in Technology” for 2018 and #3 on the“100 Best Companies to Work For” list in 2018. Ultimate is also ranked #1 on the Fortune’s“100 Best Workplaces for Millennials” for 2017 and #3 on its \"Best Workplaces for Diversity” list for 2017. Primary Responsibilities:Translate market trends into coherent product strategies.Define a vision and strategy for applying analytics and machine learning to solve complex problems and provide insights for our customers.Exhibit abundant imagination, but also ruthlessly prioritize. (Saying“No” isn’t difficult for you.)Partner with development leadership to define a direction and drive delivery of our data platforms.Create an environment and culture where product teams can ship great products quickly.(Galvanize product managers, designers, engineers, and data scientists to do their best work.Lead, coach and motivate a team of product management professionals to define product strategies and associated OKRs.Lead, coach and motivate a team of delivery management professionals to drive delivery of features and projects across the portfolio.Function effectively in a high paced environmentDrive a culture of continuous innovation and improvementRequirements:Experience applying analytics and machine learning to solve complex business problems.Experience with natural language processing (NLP), sentiment analysis and qualitative analytics.Experience with modern data pipelines and platforms.Experience with BI& Analytics platforms.Proven ability to mold a product development team with common goals and vision while fostering a positive culture.You have shipped products that have seen scale and volume, preference for enterprise software.You have managed teams of product managers working across a diverse suite of products.Education/Certification/License:Bachelor’s degree in Business, or Information Technology, or equivalent trade-off in related professional work experience.Travel Requirement: 25-30% for the first 6 Months, 10-25% thereafter  This job description has been written to provide an accurate reflection of the current job and to include the general nature of work performed. It is not designed to contain a comprehensive detailed inventory of all duties, responsibilities, and qualifications required of the employees assigned to the job. Management reserves the right to revise the job or require that other or different tasks be performed when circumstances change.  Ultimate Software will reasonably accommodate employees with disabilities as defined by the Rehabilitation Act of 1973, the Americans with Disabilities Act (ADA) and other appropriate statues."}