{"jobID": "2803317819", "jobLocation": "Santa_Monica_CA", "jobTitle": "Business Intelligence Analyst, User Acquisition", "companyRating": null, "companyInfo": {"Website": "www.playq.net", "Headquarters": "Santa Monica, CA", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Us: PlayQ is a rapidly growing mobile gaming studio based in the heart of sunny Santa Monica. Our titles have been downloaded over 60 million times worldwide, with millions of users playing our games every day!  Our goal is to deliver tomorrow's nostalgic game experiences to a global audience and we rely on our dedicated team to craft these unforgettable games that our users love. We believe that the best games come from diverse teams with a shared desire to create something amazing. From our beachfront headquarters to our innovative tech stack, its no surprise that PlayQ was named as one of the Best Places to Work in Los Angeles by the Los Angeles Business Journal.  We're looking for people who have a genuine love for their craft and we invite you to join us in this exciting endeavor. Role Overview: The Business Intelligence Analyst, User Acquisition will have the exciting opportunity to work with billions of data points from both our games and partner ad networks, and to serve as a cross-functional point between the User Acquisition, Creative Services, Product, and Data teams. Key facets of the role include developing a deep understanding of our products and insights into the underlying technology and algorithms behind each of our partner ad networks. You would be a perfect match for this position if you enjoy and excel at analyzing data, learning, ideating, and executing as these are core elements that lead to the effective design of marketing experiments and optimization of campaigns and ad creatives. The ideal candidate is intelligent, sharp, detail-oriented, and highly quantitative individual who loves working with and analyzing data to derive actionable business insights. Role Highlights:Responsibility over the investment, analysis, and optimization of millions of dollars in marketing spend each yearWork with best-in-industry data and user acquisition tools; providing more time to focus on the things that matterWork directly with cross-functional teams and have a voice in user acquisition, creative, data, and product directionHave a voice in helping to shape the strategy, tools development, and processes within the UA teamResponsibilities:Monitor and analyze performance data across individual ad networks and across our entire user acquisition portfolioDesign and run marketing experiments related to targeting, creative, and other variablesReport and present findings and actionable recommendations to the user acquisition team and cross-functional stakeholders, and then take actionAssist with the creation, management, and optimization of all mobile campaigns across multiple ad networks and mobile storefronts (e.g. iOS, Google Play, Amazon)Report on the performance of campaigns across active ad networks on an ongoing basis, including weekly, and quarterly reporting of campaign resultsManage user acquisition data tracking integrations both internally and with third partiesPerform in-depth analyses to provide answers to specific user acquisition or product questions and acquire a deep understanding of user behaviorAssist with the development of new tools and processes for user acquisition data analysisRequirements:BA/BS degree in Math, Statistics, or other related quantitative field1-2 years of experience as a data analyst or similar analytical role, preferably for a technology or gaming companyStrong analytical skills with the ability to apply business strategy to data analysis and recommendationsExpert at using Tableau, Spotfire, or similar analytics/visualization softwareProficient in SQL; experience with querying large, complex data sets is a plusExcellent communication, presentation, and visual reporting skillsLoves problem-solving, has an innate ability to investigate issues and find the optimal solutionsDesire to work independently on analyses and projects from inception to completionKnowledge of statistics and statistical models is a plusPerks:Competitive compensation and equity optionsComprehensive medical, dental, vision insuranceFlexible time off401K plan with company matchStocked kitchen with free snacks and beverages of your choiceCatered weekly team lunchesBrand new penthouse office space equipped with outdoor patios offering beachfront viewsMonthly team outings and volunteer opportunitiesHelp build and support awesome GAMES. For a living! Who doesn't love games? Interested? Please get in touch!"}