{"jobID": "2745569019", "jobLocation": "Birmingham_MI", "jobTitle": "Help Desk / Jr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.detroittrading.com", "Headquarters": "Birmingham, MI", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " We are looking for a technically savvy individual with excellent communication skills and a passion for customer support. You will be responsible for on-boarding auto dealerships to our online vehicle marketing program, and providing technical support for these dealerships once they are live. In addition, this role will work closely with our Data Team, specifically data query, data manipulation, data definition and data access control within SQL. We are looking for a strong communicator who is highly proactive in resolving customer issues. The successful candidate will be comfortable initiating and coordinating involvement of senior team members within the organization (i.e. software developers, accounting staff, sales staff, etc.) in order to provide world class support to our customers. Required Skills Very strong communication skills, both verbal and written. Excels at and enjoys interacting with others. Possesses a good understanding of, and interest in, web browser functionality (i.e. URLs, HTML, etc.) and image editing software.Required Education and Experience Bachelors degree preferred, equivalent work experience considered. Prior SQL experience is preferred but not required. We will teach the right candidate! Real-world work experience interacting with team members to resolve issues. Demonstrable skills with web browser functionality and image editing software. About Detroit Trading Detroit Trading is a rapidly growing technology company based in metro Detroit. We are a leader in innovative, data-driven solutions for automotive dealerships around the country. We offer a fun, exciting, fast-paced work-place that provides incredible growth opportunities for smart, hard-working individuals. Learn more about our company at www.detroittrading.com"}