{"jobID": "2752077462", "jobLocation": "Davis_CA", "jobTitle": "ASSISTANT RESEARCH SCIENTIST I - NEMATOLOGY", "companyRating": "2.7", "companyInfo": {"Website": "www.marronebioinnovations.com", "Headquarters": "Davis, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public (MBII) ", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "28000", "jobDescription": "Job DetailsLevel ExperiencedJob Location MAIN OFFICE - DAVIS, CAPosition Type Full TimeEducation Level 4 Year DegreeSalary Range UndisclosedTravel Percentage NegligibleJob Shift DayJob Category BiotechDescriptionWe are currently looking for an Assistant Research Scientist I to join our R&D; Team. The Nematology Assistant Research Scientist is a critical position that offers the opportunity to significantly impact the Company with development and improvement of key bioassays and support of the development work on our near term bionematicide product. Responsibilities include: Assist and develop the needed bioassays for testing MBI’s microbial nematicide products including various types of soil applications and seed treatments that will measure efficacy against nematodes. This includes rapid, efficient miniature, semi in-vitro in-house lab-scale bioassays, container assays, greenhouse trials, and microplot trials to support fermentation optimization, formulation development, and regulatory data requirements.Assist senior scientist on the mode of action studies of our nematicides – effects on eggs or juveniles, adults and their fecundity, etc. Direct or indirect effects, prevention of gall formation or penetration, and others.Monitor the literature, maintain academic contacts, and keep MBI abreast of relevant new technology in nematology.Contribute to writing of patents, grants and collaborative research agreements.Maintain an accurate and up-to-date, witnessed written account of experimental protocols and results.Maintain a high level of scientific skills and knowledge within assigned area(s).Supervise junior scientists and interns.Ensure that he/she and subordinates are operating in accordance with MBI Safety guidelines.Model MBI’s values and help generate a positive, supportive and productive working environment.Carry out other tasks as directed by supervisor.QualificationsBS degree with 3 + years of experience. Previous experiences of bioassays and nematicide testing in the area of plant nematology are desired.  Innovative, self-starter, good communicator & listener, collaborator, goal oriented, empathetic is desired, as well as, having excellent analytical, organizational, coordination and multi-tasking skills.  The salary range is competitive. MBI offers a comprehensive benefits package including stock options, a 401(k) plan with employer match, and a health plan including medical and dental coverage, life insurance coverage, long term disability, and a flexible spending account for dependent care and/or medical expenses. In addition, this position is eligible for an annual bonus plan.  The above is a list of essential duties and responsibilities for this position. This list is not all-inclusive. This job description may be modified as needed.  MBI is an equal-opportunity employer. A pre-employment drug screen and background check will be required."}