{"jobID": "2825144122", "jobLocation": "Chicago_IL", "jobTitle": "Financial Analyst (Data Analytics) Chicago and Naperville", "companyRating": null, "companyInfo": {"Website": "www.markryan.net", "Headquarters": "Schaumburg, IL", "Size": "1 to 50 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "? Perform financial forecasting, reporting, and operational metrics tracking  ? Analyze financial data and create financial models for decision support  ? Reporting on financial performance and preparation for regular leadership reviews  ? Analyze past results, perform variance analysis; identify trends, and make recommendations for improvements  ? Work closely with the accounting team to ensure accurate financial reporting and decision support  ? Evaluate financial performance by comparing and analyzing actual results with plans and forecasts  ? Guide cost analysis process by establishing and enforcing policies and procedures  ? Provide analysis of trends and forecasts and recommending actions for optimization  ? Recommend actions by analyzing and interpreting data and making comparative analyses; study proposed changes in methods and materials  ? Identifying and driving process improvements, including creation of standard and ad-hoc reports, tools and Excel dashboards  ? Increases productivity by developing automated reporting/forecasting tools  ? Market research, data mining, business intelligence, and valuation comps  ? Strong financial analysis foundation creating forecasts and models  ? Proficiency with Microsoft Excel is required; familiarity with data query/data management tools extremely helpful (Access, SQL, Business Objects)* Bachelor's degree in finance or accounting is required.  * 3 or more years of experience with statutory/GAAP experience.  * Proficient in Excel, Power Point, Word, Access and other data base management tools.  keywords: analysis, senior accountant, finance, schaumburg, elk grove village, itasca, prospect heights, mount prospect, algonquin, arlington heights"}