{"jobID": "2805296804", "jobLocation": "Jackson_MI", "jobTitle": "Software Engineer / Computer Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Software Engineer SeaLandAire is a fast-paced research and development company with the objective of helping customers collect data from difficult environments. SeaLandAire is a full-stack hardware development company, focusing on building small unmanned vehicles and sensor systems. In general, we build things then see how they work.  Your job as a software engineer is to help other engineers look at the data. You will create specialized bench test software to analyze data. The fastest way to do this is with Python. We are looking for someone who absolutely loves Python. SeaLandAire primarily uses Python, PySide, Numpy, and Scipy.  We need someone who is fast paced, flexible, and accommodating. You will be working on multiple projects at once, making changes at a moments notice. You need to like helping others. You will be working side by side with engineers from other disciplines on a routine basis. Co-workers frequently ask for help and modifications to the software. This position is full of challenges and rewards. You get to learn new things, work with hardware, and watch your software interact with the real world. Essential FunctionsWork with teams to diagnose and solve problemsTurn rough ideas into well-structured applicationsWrite clean object-oriented code, with a focus on structure, reusability, and flexibilityWork within existing design constructs/patterns when updating/optimizing existing codebasesLearn various engineering skills through books and online research. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions CompetenciesExpertise in Python 3Experience with CFamiliarity with a version control system (Mercurial, Git)Dedication to work through problems outside of your engineering disciplineExceptional organization skills with a willingness to follow a style guideExcellent verbal and written communicationCoordinationTime ManagementCustomer/Client FocusDiscretionOther InterestsPyside/PyQt for developing desktop applicationsPython Threading/multiprocessing for real-time data analysisPython 3 bytes knowledge for working data received from a serial port or tcp/ip connectionDjango, JavaScript, HTML, CSS for various web toolsSince a majority of SeaLandAire's business is funded by the US Department of Defense, applicants must be a \"US Person\" (US Citizen or Legal Permanent Resident).Education and Experience Bachelors degree in Engineering. Supervisory Responsibility This position has no supervisory responsibilities. Position Type/Expected Hours of Work This is a full-time position, with a minimum expectation of 40 hours per week. Hours are somewhat flexible and some late evenings may be required. Travel Some travel is expected for field testing, vendor selections, and customer interface. Physical Requirements While performing the duties of this job, the employee is regularly required to talk or hear (sometimes in a noisy environment), sit, stand, walk, climb (occasionally), and do repetitive movements with hands.  The above statements are intended to describe the general nature of work performed by employees assigned to this position. They are not intended to be construed as a complete list of all job duties performed by persons in the position.  Management reserves the right to revise or amend duties at any time as the needs of the company and requirements of the job change."}