{"jobID": "2766224746", "jobLocation": "Herndon_VA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.k12.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (LRN) ", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Pearson, McGraw-Hill Education"}, "estimatedSalary": "95000", "jobDescription": " Requisition Number 18-1530  Title Data Scientist  City Herndon  State VA  Description The Data Scientist applies a strong command of mathematical statistics, algorithm design, modeling, optimization and business acuity to support and drive the development of data-intensive products and services related to personalized adaptive learning. The position works collaboratively with the Academic, Technical, Product Management and School Management teams to dramatically escalate the organization’s ability to identify, ask and answer relevant questions in order to operationalize a large volume, velocity and variety of data within its domain of expertise resulting in the creation of innovative learning solutions that are both effective and profitable. ESSENTIAL FUNCTIONS, OTHER DUTIES & RESPONSIBILITIES: The below statements are intended to describe the general nature and scope of work being performed by this position. This is not a complete listing of all responsibilities and/or duties required; other duties may be assigned. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential duties. • Drives the process of designing and building big data solutions that achieve dynamic adaptive learning; Leads the product engineering team in the process of analyzing big data, identifying patterns, finding and answering important product questions; • Answers product questions with available data by using appropriate statistical techniques, algorithm design, modeling and optimization in conjunction with business acuity and storytelling capabilities; • Communicates findings in lay terms to product managers, engineers and other stakeholders; Plays a key role in evangelizing the data analysis results across the organization; • Drives the collection of new data and the refinement of existing data sources; Defines user action data to instrument; • Analyzes and interprets the results of product experiments; • Develops best practices for instrumentation and experimentation and communicates those to product engineering teams. Requirements • Master’s degree in Computer Science/Math/Statistics or relevant field AND Six (6) years of experience in data mining/analysis  OR • Equivalent combination of education and experience  Certificates and Licenses: None required. OTHER REQUIRED QUALIFICATIONS:  • Ability and passion for formulating research problems and defining performance benchmarks with given data and use case  • Expert proficiency in manipulating and analyzing complex, high-volume, high-dimensionality data from varied sources using big data integration and analysis tools (R, Matlab, or Python)  • Knowledge and experience in application of advanced statistical techniques (e.g. linear models, basis expansion and regularization, kernel methods, probabilistic graphical models / Bayesian Network, etc.)  • Experience with distributed computing tools (e.g. Hadoop ecosystem) and deep data munging ability to prepare data for machine learning algorithms  • Business acuity including understanding and comfort with expectations of accountability and profitability  • Familiarity with relational databases  • Experience with data cleansing, validation and general quality control principles  • Familiarity with data life cycle management practices including sourcing, discovery, profiling, applying definitions, establishing relationships, data mining and documentation  • Excellent verbal and written communication skills with ability to communicate complex quantitative analysis in a clear, precise, and actionable manner  • Ability to pass required background check DESIRED QUALIFICATIONS:  • Ph.D. in relevant technical field  • Have experience and deep understanding of undirected probabilistic graphical models (Bayesian Network, Hidden Markov Model etc.) • Proficiency in R and one or more programming languages (C/C++, Java, Python, Ruby, PHP, etc.)  • Experience with Hadoop, Hive, Impala, and/or Spark and unstructured data sources K12 is a Federal Contractor, an Equal Opportunity/Affirmative Action Employer and a Drug-Free Workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status. Please view Equal Employment Opportunity Posters provided by OFCCP here."}