{"jobID": "2834885369", "jobLocation": "Chicago_IL", "jobTitle": "Solutions Architect-SAP Data Services, Data Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.stericycle.com", "Headquarters": "Lake Forest, IL", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (SRCL) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Position Description:  The SAP Data Services Engineer provides leadership and functional and technical support for various business units utilizing the SAP Enterprise Data Services platform. In addition, this role will establish standards and requirements to evaluate and direct enhancements and implement solutions using SAP Data Services related to SAP Master Data area across enterprise-wide Stericycle.   Designs and develops SAP Data Services Architecture and specifications to ensure systems and solutions are meeting corporate needs linking with SAP Best Practice solutions, Extract Transformation and load and Data Warehouse principles.1) Leads, participates or coordinates end-to-end execution of SAP Master Data solutions, related projects and technology implementations. Introduces best practice and process improvement ideas.2) Provides subject matter expert solutions and hands on management of configuration.3) For SAP Hana Enterprise Side Car implementation, defines SAP Data Services/ETL strategy, develops systems requirements, designs and prototypes, testing and training. Defines support procedures.4) Provides process expertise and solutions in SAP Data Services for Master Data.5) Understands business processes, accounting principles, systems configuration, enhancements and data or enables related processes.6) Works with business counterparts on delivering solutions based on Best Practices, business processes and SAP Master Data expertise. Analyzes business requirements and translates them into design.7) Leads multiple design activities, from requirement analysis to systems, application and process design specifications, implementation and support.8) Provides expertise for the estimation and financial analysis of projects.9) Creates documentation for various stages of planning, design, implementation and support of SAP Data Services. 10) Participates in weekly team meetings and internal initiatives to review outstanding issues and/or to discuss new trends or projects11) Manages and completes complex assignment and related projects12) Provide training, mentorship and ongoing support of SAP Data Services to IT and business stakeholders.13) Performs other related duties as required or requested "}