{"jobID": "2680604918", "jobLocation": "Milpitas_CA", "jobTitle": "Software Engineer (Machine Learning/ Data Scientist)", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "119000", "jobDescription": "Company Overview Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are bigger—and tinier—than the world has ever seen.  Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chips—the kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you own—faster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer? Group/Division The Wafer Inspection Division (WIN) is the world leader in the design and manufacture of advanced optical inspection tools for inline monitoring of process defects in advanced semiconductor factories. Responsibilities You will be part of a machine learning / analysis group that develops algorithms and software solutions that enhance the performance of our inspection tools.  Your responsibilities will include:  Data/problem analysis Research the solution space Develop concepts Prototype and validate concepts Specify software requirements Software/algorithm development (productization/programming)Preferred Qualifications PhD or Master’s level degree in CS, EE, or quantitative fields such as Mathematics, Statistics, or Physics Research/scientific background is desirable Knowledge and understanding of modern machine learning approaches is highly desirable Solid background in statistics and mathematics is desirable Experience with image processing / signal processing is a plus Good demonstrated programming skills are desirable Analytical skills, problem-solving skills (quantitative & algorithmic) Interest in algorithm development & programming Ability to work in a team, and contribute to the team effort Proficiency in C++, or MATLAB, or PythonMinimum Qualifications Doctorate (Academic) OR Master's level degree with at least 2 years of experience OR Bachelor's level degree with at least 3 years of experienceEqual Employment Opportunity KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}