{"jobID": "2835007270", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Market Data Engineer", "companyRating": "2.8", "companyInfo": {"Website": "www.peak6.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Wolverine Trading, Interactive Brokers, Citadel"}, "estimatedSalary": "103000", "jobDescription": " PEAK6 Investments is looking for a highly ambitious and passionate Sr. Market Data Engineer to join our Core Engineering Team. In this dynamic role, you will work on systems and libraries that enable developers to build trading tools and order execution systems.  As a Sr. Market Data Engineer, you love participating in technical discussions, solving problems, helping others grow as developers, making systems blazing fast, digging into data, advocating for a technical vision, and learning new technologies. You will not only meet, but also elevate the technical bar for our software team. Youll be responsible for:Building market data and distribution systems, specifically for stock and option market data feeds and high-throughput, low latency systems.Participating in technical discussions and set technical vision on projects.Working effectively in a fast-paced, constantly changing environment.Building high quality, maintainable, readable code.Thinking on your feet to support mission-critical production systems.Getting the answers you need to solve a problem from Google, finding the right person to ask, or digging deep technicallyMentoring junior developers.Learning new languages and technologies while continuously evolving your skill set.Youll gain loads of experience in this role but before you do, you should have:A Bachelors degree in Computer Science or related fieldExperience with C++Good knowledge of data structuresStrong experience and knowledge of network programming required - TCP, UDP, and multicast, and other protocolsExperience with LinuxStrong experience and knowledge of systems programmingExperience building robust, fault-tolerant systemsExperience with multi-threaded programmingExperience with Go, Java, or Python preferredExperience working with distributed systems strongly preferredExperience with low-latency and high-throughput market data systems strongly preferredExperience with financial markets and stock and option exchange feeds strongly preferredExperience with binary and FIX connectivity protocols strongly preferredLife at PEAK6 We want you to like coming to work so we work really hard to make your job fun and different from any other.  As a PEAK6 Sr. Market Data Engineer you can enjoy: Generous medical, vision and dental plansMatching 401(k) programsAdoption assistance & family leaveSabbatical programSpeakers SeriesMassage daysPoker tournament with a grand prize of a World Series of Poker buy inSports leaguesCornhole tournamentsAnnual PEAK6 PartyYoga classesTuition reimbursementLasik eye discountPhilanthropy eventsAnnual wellness screens and flu shotsBagel FridaysBirthday giftsCharitable matching gift program"}