{"jobID": "2824673817", "jobLocation": "Chicago_IL", "jobTitle": "Business Data Analyst - Convention Centers", "companyRating": null, "companyInfo": {"Website": "www.levycompany.com", "Headquarters": "Selma, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JOB DESCRIPTION  The Business Data Analyst is an analyst position on the E15 analytics team within Levy. As a Business Data Analyst, you would become E15's primary point of contact with Levy's operators and clients for all convention centers. You would conduct several data-driven projects, including performance reporting and economic valuations, and serve as project manager for others, including the strategic deployment of E15's proprietary analytics products.  Some of the core responsibilities of the Business Data Analyst are: Managing relationships with key client and Levy stakeholders and understanding their overall strategies and business objectivesDeveloping specific knowledge about convention centers, including physical configuration, technology and operational processesIdentifying opportunities to optimize existing product offerings, distribution, and pricingReporting periodically on operational and financial metrics, and creating an economic valuation of E15's bottom-line impactCommunicating key guest insights and industry trendsPerforming quarterly & annual partner reviewsSupporting new business bidsManaging or directly completing ad hoc analytics projects as appropriate REQUIRED SKILLS Bachelor's (or higher) degree in business analytics, computer science, statistics, economics, finance, or a related fieldExperience (work or school assignments) in at least one of the following tools:SQLStatistical software package (R strongly preferred)data visualization (Tableau strongly preferred)Expertise in Excel modeling, with work or school experience in financial modeling a plusExperience using data visualization tools, visual features of statistical software tools or PowerPoint to communicate complex ideas to non-technical audiencesSpecific interest (or prior experience) in client serviceCan share examples of working effectively in a team environmentCan share examples of how they have used data to solve complex problemsCan share examples of how they have used creativity to achieve excellent outcomes ABOUT E15  At E15, we are the spark that ignites. Our team delivers next-generation insights based on data, not hunches, to drive business in MLB, NHL, NBA, NFL, College Sports, and beyond. E15 brings unmatched industry intelligence and cutting edge analytics to sports, entertainment, hospitality, and retail industries to help companies make forward-looking decisions to benefit their business, fans and customers.  ABOUT LEVYLevy is the leader in Sports and Entertainment dining, catering such renowned sports venues at Wrigley Field in Chicago, STAPLES Center and Dodger Stadium in Los Angeles, Ford Field in Detroit and Churchill Downs in Louisville. Levy also caters events including Super Bowls, World Series, NASCAR Racing, the Kentucky Derby, the U.S. Open Tennis Tournament and the Grammy Awards.  E15 is an equal opportunity employer. At E15 we are committed to treating all Applicants and Team Members fairly based on their abilities, achievements, and experience without regard to race, national origin, sex, age, disability, veteran status, sexual orientation, gender identity, or any other classification protected by law. "}