{"jobID": "2832179109", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Bioinfo-Comput Biologist Assoc", "companyRating": "4.3", "companyInfo": {"Website": "www.umich.edu", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1817", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " Clicking \"Apply Now\" opens the link in a new window.Job Summary  The Michigan Center for Translational Pathology (MCTP) is seeking a bioinformatician / computational biologist to support our cancer research program. This  position will be centered on contributing advanced data analyses to interdisciplinary research projects, including: carrying out statistical and bioinformatics  analyses, implementing algorithms for genomic analyses, developing computational workflows, and building visualization tools. As part of a dynamic team, the  position will develop and apply advanced computational techniques to learn about the underlying biology and to guide experimental work.  The successful candidate should be comfortable analyzing large data sets (demonstrated experience in the analysis of real-world datasets required), have  experience in software development, and possess strong interpersonal and communication skills. The ideal candidate will use their computational skills,  biological knowledge, understanding of statistics, and creativity to help us understand complex genomic data sets. Proficiency in utilizing and integrating data  from an array of public resources such as ENCODE, TCGA or COSMIC and ability to synthesize and present conclusions from complex analyses in a clear and  visually compelling way will be paramount for this role.  This position offers sick and Vacation Days  Responsibilities* Conduct pathology research using bioinformatics theory and methods.Implement algorithms for genomic analyses, develop computational workflows, and build visualization tools.Apply advanced computational techniques to learn about the underlying biology and to guide experimental work.Utilize and integrate data from an array of public resources, such as ENCODE, TCGA or COSMIC. Required Qualifications* Bachelor's degree in a recognized field of science or learning which is directly related to the duties of this position. Candidates with experience inbioinformatics strongly preferred.Demonstrated 2-year experience in the statistical / computational analysis of large and / or complex datasets (candidates not meeting thisrequirement will not be considered).Substantial expertise in one or more of Python, R, C/C++, or Java as demonstrated by the ability to develop high-quality scientific programs.Practical knowledge of statistical techniques.Experience in working on Unix/Linux systems (shell scripting, basic system administration)Ability to multi-task, prioritize efforts, and execute independently- and collaboratively-developed ideas in a fast-paced environment. Desired Qualifications* Advanced degree in a quantitative discipline. PhD degree strongly preferred.Experience and/or familiarity with molecular cancer research. ?Experience with the analysis of data from high-throughput molecular profiling techniques such next-generation sequencing, microarray, or mass-spec.Experience with next-gen sequencing data, including functional genomic assays (e.g. RNA-Seq, ChIP-seq, DNA methylation).Experience with standard bioinformatics software tools and packages e.g. BioconductorFluency in understanding code written in multiple languages including C/C++, Java, Python and R.Working knowledge of laboratory techniques in molecular biology, cell biology, biochemistry, and genetics.A solid understanding of statistics and experience in the implementation of machine learning and statistical inference algorithms.Experience building web applications, web services, and user interfaces using standard software development tools: relational databases, version control systems, front-end Javascript.Experience in cloud computing (GCE or AWS)A strong publication record. Work Schedule M-F, 8:00 - 5:00 Work Locations  Michigan Medicine Cancer Center; Ann Arbor Additional Information MCTP employs genomic, proteomic, and bioinformatic approaches on clinical biospecimens to identify novel cancer biomarkers and therapeutic  targets. The mission of the Center is to facilitate the discovery, validation, and implementation of candidate target genes/proteins in cancer diagnosis, prognosis, and therapy. The Center employs a multi-disciplinary approach, engaging talent from diverse disciplines ranging from medicine, pathology, bioinformatics, biostatistics, engineering, cytogenetics, and molecular therapeutics.  Background Screening  Michigan Medicine conducts background screening and pre-employment drug testing on job candidates upon acceptance of a contingent job offer and may use a third party administrator to conduct background screenings. Background screenings are performed in compliance with the Fair Credit Report Act.  Mission Statement  Michigan Medicine improves the health of patients, populations and communities through excellence in education, patient care, community service, research and technology development, and through leadership activities in Michigan, nationally and internationally. Our mission is guided by our Strategic Principles and has three critical components; patient care, education and research that together enhance our contribution to society.  Application Deadline  Job openings are posted for a minimum of seven calendar days. This job may be removed from posting boards and filled anytime after the minimum posting period has ended.  U-M EEO/AA Statement  The University of Michigan is an equal opportunity/affirmative action employer.  Job Detail Job Opening ID 154935Working Title Bioinfo-Comput Biologist AssocJob Title Bioinfo-Comput Biologist AssocWork Location Ann Arbor Campus Ann Arbor, MI Full/Part Time Full-TimeRegular/Temporary RegularFLSA Status ExemptOrganizational Group Medical SchoolDepartment Ctr fr Translational PathologyPosting Begin/End Date 6/27/2018 7/11/2018Career Interest Research Apply Now"}