{"jobID": "2766335299", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.msrb.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": " Data Analyst Location  Washington, DC # of openings 1Apply Now Job SummaryData AnalystThe Municipal Securities Rulemaking Board (MSRB) seeks a Data Analyst to support the organization’s Meta Data repository and data quality program and prepare ad-hoc and standing requests from internal and external stakeholders. The Data Analyst will research, document, monitor and report data and escalate data anomalies as they arise. Responsibilities: • Working with stakeholders to understand and develop requests and tracking status of requests  • Writing complex SQL and PL/SQL queries to extract results for a wide variety of data requests  • Documenting approaches used to retrieve and manipulate data  • Creating polished reports for stakeholders  • Conducting presentations on analysis results Qualifications: • All applicants should be legally eligible to work in the U.S. without current or future employer sponsorship  • Bachelor’s degree in business systems, computing or related field  • Three to six years of workplace experience in SQL and PL/SQL languages.  • A strong technical knowledge and skills in Databases – particularly Oracle 11g and 12c, with Stored Procedure development capabilities  • Experience developing appropriate methodology for collecting, analyzing and presenting results  • Experience writing sophisticated queries to extract complex datasets from Oracle and MS Access databases  • Experience designing, creating and populating ad-hoc Oracle databases from a variety of sources Skills: • Ability to interpret front-end issues into SQL scripts for further investigation and problem-solving  • Ability to conduct data quality testing  • Proficiency in performance tuning  • Strong written and oral communication skills  • Ability to collect, analyze and present data to various audiences  • Attention to detail, active listening skills, follow-up, and ownership of responsibilities are essential"}