{"jobID": "2837989494", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.malwarebytes.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Lookout, Symantec, AVG Technologies"}, "estimatedSalary": "162000", "jobDescription": "Who We Are Malwarebytes is the next-gen cybersecurity company that millions worldwide trust. Malwarebytes proactively protects people and businesses against dangerous threats such as malware, ransomware, and exploits that escape detection by traditional antivirus solutions. The companys flagship product combines advanced heuristic threat detection with signatureless technologies to detect and stop a cyber attack before damage occurs. More than 10,000 businesses worldwide use, trust, and recommend Malwarebytes. Founded in 2008, the company is headquartered in California, with offices in Europe and Asia, and a global team of threat researchers and security experts  Weve created a fantastic culture that our employees love and were recently named in the top 10 of Fortune Magazines Great Place to Work list. Were growing fast and are looking for some great people to join us. Who We Need Do you have an obsession with statistics, data visualizations and machine learning?  If the answer is yes, we need you to join our team. We are looking for someone with a deep data science background. The team needs a high-powered individual who eats and sleeps data and statistics on a daily basis.  We value responsibility and accountability and above all else people who are fun, light-hearted, smart and dont take themselves too seriously. Youve got to see change as exciting in this role because things change every day. This environment is controlled (mostly) chaos and a blast to work in if you delivering lots of cool stuff. What You'll Do Analyze Big Data to build understanding and insights. Build predictive models to support growth, marketing, product and customers insights.  You will be asked to bring your data science expertise to the table and contribute code and thought leadership. Your primary goal will be to move the implementation forward to more sophisticated analytics and predictive insights. As a senior contributor, you will be expected to be a teacher and mentor others. Skills You'll Need to Have5+ years experience as a data scientistRock star in R, SQL and pythonDeep understanding of predictive models, descriptive models, and algorithmsStrong in statistical analysis3-5 years of experience on leading analytic technologies Tableau, Looker etc.Experience presenting insights at all levels in the organization from C-level to frontline managerStrong in business analyticsExperience working directly with data engineering teamsKnowledge on Hadoop, SparkR, PySparkBachelors degree in a technical/scientific field or equivalent work experienceWhat We OfferAn opportu nity to do something great for yourself and the worldA great work environment that supports growth and developmentCompetitive compensation and benefit packages401(k) matching programOpen time off policyStocked kitchen with healthy (and some unhealthy) drinks, snacks, fruit and lunch optionsA company who enjoys having fun; holiday and summer parties, annual global company off-site, sporting events and lots of other great stuff"}