{"jobID": "2826187366", "jobLocation": "Meridian_ID", "jobTitle": "ISP Forensic Scientist 3 - DNA", "companyRating": "3.8", "companyInfo": {"Website": "www.idaho.gov", "Headquarters": "Boise, ID", "Size": "5001 to 10000 employees", "Founded": " 1973", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": "EMAIL: jobs@isp.idaho.gov  Click Here!  Forensic Scientist DNA/DNA Database SupervisorISP Forensic Scientist 3 - DNAIdaho State Police  Open for Recruitment: June 20, 2018 - July 23, 2018  Announcement # 07435028983  Salary Range: $29.22-$34.81 -Plus Competitive Benefits!  Location(s): Meridian  The Forensic Scientist 3 is an experienced scientist/supervisor-level position with ISP Forensic Services. An experienced scientist/supervisor who meets the minimum qualifications and *qualifying work experience of the DNA Forensic Scientist 3, must successfully complete a qualifying examination and a six-month probationary period of 1,040 hours.  The successful candidate must meet ISP's Drug Policy (see below) and will be required to complete a criminal history background investigation and polygraph, which includes drug screening. Employment is dependent upon satisfactory results of the investigation and polygraph.  All Idaho State Police Forensic Laboratories are accredited by A2LA and to the ISO 17025:2005 Standard. State Police Forensic Laboratories serve state, local, and federal law enforcement agencies; state and county prosecutors; and public defenders.  Learn more about a career of a lifetime with the Idaho State Police at https://www.isp.idaho.gov/ and how the State of Idaho can be your forever home at https://visitidaho.org/.  Please note: Final candidate selected for the position will be required to select a book from their district Leadership Library and write a book report on it within 2-3 months of their start date. Responsibilities:Report to the Meridian Laboratory Manager for operational issues and the DNA Technical Leader for technical and quality related issues.Act as supervisor for DNA database analyst(s), biology analyst(s), and DNA casework analyst(s).Develop strategies for improved performance, delegate duties, set priorities and evaluate staff performance.Oversee internal training of those they supervise.Compile data and generate statistics regarding employee or unit performance.Serve as a liaison between ISP and other federal, state and local laboratories and agencies.Address policy and operational questions.Assist the Laboratory Manager and Laboratory System Director in implementing management team policies/decisions and the ISP strategic plan.Coordinate with the grant manager to develop DNA grant proposals; track and report performance measures.Provide scientific and technical expertise in genetics, forensic biology, and DNA analysis.Follow analytical methods and quality and safety procedures.Document quality controls and work with the Laboratory Quality Manager to ensure quality system compliance.Check that the report issued for analysis they perform is accurate.Report results of all analysis performed through written/electronic reports.Provide expert testimony in complex DNA analysis, genetics, and relevant population statistics, as applicable.Perform analysis in only examinations they are approved to perform.Perform administrative and technical review of casework in qualified discipline(s).Perform technical audits.Direct or perform research and/or validation studies to investigate and implement new methodologies.Train police officers and medical personnel in collection of evidence or DNA database samples.Participate in routine quality control measures, instrument maintenance and troubleshooting.Coordinate with the State CODIS Administrator to ensure compliance with the Idaho DNA Database Act of 1996 and all current QAS requirements.This position is eligible for service as the State CODIS Administrator (or backup) if minimum qualifications are met, and the individual is selected for that appointment.Minimum Qualifications:A baccalaureate degree in biology, chemistry, or closely related science field and all required science courses for the assigned work discipline:Analysts working in the Forensic Biology discipline must have successfully completed a minimum of seventeen (17) semester (or 26 quarter) units of chemistry or biology related college level coursework. Coursework must include at least one course each in biochemistry, genetics, and molecular biology totaling 9 semester (or 14 quarter) units.Additionally, coursework or training in statistics or population genetics is required. When performing DNA analysis and where applicable, analysts shall meet the educational requirements of the Quality Assurance Standards for Forensic DNA Testing Laboratories and/or Quality Assurance Standards for Convicted Offender DNA Databasing Laboratories.Two years of *qualifying work experience as an independent forensic DNA casework or database analyst in an accredited laboratory supported by appropriate training. *Qualifying work experience for the DNA Forensic Scientist 3 includes two years:Working independently, planning, managing, and prioritizing forensic biology/DNA caseloads or DNA database samples.Successfully engaging in independent research, evaluation, and validation activities associated with forensic biology/DNA or DNA database.Performing and documenting a range of examinations regarding human DNA (preferably STR) analysis of casework and/or DNA database samples.Providing training and consultation services to professional criminal justice and scientific audiences.Qualified for a minimum of two years to provide courtroom testimony relating DNA evidence and its associated statistical significance, as applicable. Note: ISPFS analyst and management applicant's baccalaureate, masters or doctoral degree must be in a physical or biological science from an accredited U.S. or Canadian institution. Degrees for Biology/DNA applicants must be in biology, chemistry or a closely related science. Acceptable institutions are those accredited by or those which have pertinent educational programs accredited by commissions or agencies recognized by the U.S. Office of Education. Applicants with education obtained at a foreign institution must, at their expense, have credentials evaluated by Educational Credential Evaluators, Inc., Milwaukee, WI; International Education Research Foundation, Inc., Los Angeles, CA; or world Education Services, Inc., New York, NY. Reports must be sent directly to ISP Human Resources by the evaluating organization.  Note: the successful candidate is required to obtain certification by the American Board of Criminalistics within three (3) years of being signed off for independent casework or database processing (if not currently certified).  Preference will be given to applicants who have at least one scientific degree B.S or above in Biological Science.  The following are not requirements for the DNA/DNA database supervisor position. However, if you do have qualifications/experience in any of these areas include the information in your resume as it may increase your score: Supervision or management training or experienceDiplomat with the American Board of CriminalisticsFellow with the American Board of Criminalistics in the area of Molecular BiologyMember of related professional organization(s)Graduate degree in Biological ScienceExperience performing audits under the FBI's DNA quality assurance standards and/or ISO 17025 standardsExperience using automation as it applies to the analysis of DNA samples in a forensic laboratoryExperience in a DNA database section as an analyst or supervisorExperience in a DNA casework section as an analyst or supervisorExperience using CODIS as an analyst or administrator and knowledge of the NDIS operation procedures as it applies to DNA eligibility requirements ISP has a salary plan called Project CHOICE (Creating Hope, Opportunity, and Incentive for Career Employment) designed to provide incentives for recruitment and retention. The Project CHOICE plan distributes pay increases to employees for the attainment of certificates and other achievements relevant to their job class and the ISP mission. The purpose of Project CHOICE is to attract potential applicants to the ISP workforce, retain the workforce already in place, and reward employees who take on additional duties or tasks, and who work to better themselves in academic and professional settings.  Forensic scientists and lab management personnel earn CHOICE pay increases for a variety of discipline specific achievements related to skill acquisition. Some of these points include: Bachelor Degree - $1.25/hourMaster Degree - $1.75/hourDoctorate - $2.25/hour (only the highest college degree attained is awarded)Completion of Probation/Independent Casework - $1.00/hourProficiency Test in two Disciplines - $.30/hourClan Lab/Crime Scene - $.45/hourServe as an ISO 17025 or ISO Assessor - $.30/hourForensics Specialty Areas Certification: $.50/hour for up to 2 areas of expertise:American Board of Criminalistics (ABC) DiplomateABC Fellow in a SpecialtyInternational Association for Identification (IAI) Latent Fingerprint AnalysisAssociation of Firearm & Tool Mark Examiners (AFTE) Firearms Examiner or equivalentAmerican Board of Forensic Toxicology (ABFT) or equivalentIAI FootwearFS II, III, or IV service as CODIS Administrator - $.30/hourLab Safety Officer - $.30/hourDeputy Quality Manager - $.30/hourExamination: Resume and transcript review of your education and experience. It is essential that the information you provide emphasize education, experience and positions held that are directly related to the requirements noted in this announcement. We encourage you to provide a narrative summary of how you meet each of the Minimum Qualification areas followed by your resume. Providing more thorough, detailed information may help increase your score.  To preview the exam, click on the \"Preview Exam\" link below (you will not be able to take the exam from this screen). If you wish to take the exam, click on any Apply Online button and follow the instructions provided.  Notification of your test results will be available online when the review process is completed. You can access this by logging into your applicant account at: https://labor.idaho.gov/DHR/ATS/StateJobs/Apply/Login.asp. You then select the \"Exams Summary\" tab, click on either \"Current Exams\" or \"All Exams\" and the score will be displayed.  You must also submit your college transcripts to the Idaho State Police for verification. Applications without the supporting transcripts will not be accepted. Unofficial transcripts are acceptable at this time. If you are selected for a conditional offer of employment, official transcripts will be required. In addition, please also submit a copy of your detailed training plan/record that verifies your qualifications to provide courtroom testimony relating DNA evidence and its associated statistical significance, as applicable.  Transcripts and your detailed training plan/record must be received by ISP on or before the closing date listed on this announcement for the application to be considered.  You may fax transcripts and your detailed training plan/record to (208) 884-7087, attention Human Resources OR you may email them to jobs@isp.idaho.gov. How to Apply: Click on any Apply Online button and follow the instructions provided to complete the Application Checklist and Exam for this position. When updating your online application information, you must select Idaho State Police under \"Agencies,\" full-time employment under \"Job Type/Shift,\" and Meridian under \"Cities.\"  Idaho State Police Drug Policy  Idaho State Police does not consider for employment, nor accept as a volunteer, any person who has: Used or possessed within the 5 year period immediately preceding application for ISP employment: LSD, PCP, heroin, methamphetamine, cocaine, or designer drugs (e.g. ecstasy, synthetic cathinones, their chemical derivatives and synthetic equivalents, etc.); if use was prior to 5 years preceding application for employment, the following factors will be considered: (1) the frequency of the behavior;  (2) the quantity of drugs involved; and  (3) the type of drug; Used or possessed within the 3 year period immediately preceding application of ISP employment: marijuana, inhalants (huffing), anabolic steroids, hallucinogens (psilocybin mushrooms), or synthetic cannabinoids (e.g. spice, K2, etc.);On any occasion illegally manufactured or delivered a controlled substance;Used any illegal drug while employed in any law enforcement or prosecutorial agency;Been found guilty by a court or jury of driving under the influence of intoxicants within the 5 year period preceding application for ISP employment;Abused prescription drugs (case by case analysis). Other involvement with illegal drugs may be a disqualifier. The Colonel of the Idaho State Police has the authority to make all final hiring decisions.  Visible tattoos on the head, neck, or hands are prohibited and must either be removed or covered by an acceptable means that does not deter from the professional image. However, tattoos simulating a wedding ring or tattoos simulating cosmetics or makeup are permissible.  Preview Exam OVERTIME NOTICE: At the discretion of the appointing authority, compensatory time off may be provided in lieu of overtime cash compensation.  Hiring is done without regard to race, color, religion, national origin, sex, age or disability. In addition, preference may be given to veterans who qualify under state and federal laws and regulations. If you need special accommodations to satisfy testing requirements, please contact the Division of Human Resources.SDL2017"}