{"jobID": "2696082714", "jobLocation": "San_Jose_CA", "jobTitle": "MTS - Database and Data Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.nutanix.com", "Headquarters": "San Jose, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Public (NTNX) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " EMC, Amazon, VMware"}, "estimatedSalary": null, "jobDescription": " The Insights Data Pipeline Team  Nutanix is disrupting the multi-billion dollar virtualization market by groundbreaking the first hybrid cloud platform that can incrementally scale out to handle petabytes of data, while running tens of thousands of virtual machines. You will join a small, impactful and dynamic team.  Responsibilities You will join a small, impactful, yet dynamic team. The extended software development team on Software Features/Bugs for the Nutanix manageability platform that interacts with Nutanix Core ServicesAddress Customer critical issues to EngineeringDiagnose and debug deep and insidious issues. Provide workaround and fixes for those issuesDevelop automation tools to find bottlenecks and do root cause analysis and corrective actionEngage with customers and support when needed to tackle production issuesDevelop a deep understanding of complex distributed systems, and design innovative solutions for customer requirementsWork on core data path, performance, scaling out and resiliency of distributed storage systemsWork closely with development, test, documentation and product management teams to deliver high-quality products in a fast-paced environmentProgram in a Linux environment and employ robust software engineering practices to develop and maintain reliable, field-serviceable, and maintainable software components Requirements Love for fixing and solving complex problemsExperience with programming in Java and PythonExperience/understanding of scalable and distributed systemsExperience with web servers and REST APIs a plusExperience in working in a Linux environmentKnowledge of virtualization (VMWare, KVM, or Hyper-V) and storage a plus.Strong written, verbal, and collaboration skills.Phenomenal teammate that works well in fast-paced situations and startup environmentsBachelor's degree in Computer Science or related field required with 4-6yrs of industry experience. #li-mm1"}