{"jobID": "2836317307", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst, Growth Team", "companyRating": "4.1", "companyInfo": {"Website": "www.newrelic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (NEWR) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AppDynamics, Datadog, Dynatrace"}, "estimatedSalary": "131000", "jobDescription": "New RelicSenior Data Analyst, Growth TeamSan Francisco, California New Relics Growth Data team builds core data applications that drive customer engagement and an analytics platform that employees use to understand our products, business, customers, and technical trends. Our goal is to create revenue multipliers for our business by using a combination of data insights, data-driven customer engagement, and an optimized customer journey. We tackle an incredibly diverse set of data sources and use cases covering data modeling, data optimization, A/B testing, revenue, and business outcome prediction, funnel analysis, cohorting, and churn.  The ideal candidate for the Senior Data Analyst position is a critical thinker who is passionate about solving complex business questions with data and is excited about working in a fast-paced, innovative and collaborative work environment. ResponsibilitiesWork with Product Managers and Growth Leads to define, test, and validate hypotheses around our products, conversions, and revenue using data analysis and business contextPerform exploratory data analysis to gain a deeper understanding of the problem and to uncover nuances on your ownWork closely with data engineers/scientists in order to automate the collection and analysis of the raw data required for the models you buildAnalyze experimental and observational data; communicate findings and insights cross-functionally; facilitate product or customer experience decisionsRoutinely write efficient, legible, and commented SQL. Create meaningful self-service dashboards for business stakeholdersClearly scope, track, execute and communicate on projects across the data team Qualifications2-4 years of SQL experience: writing advanced, complex queries is a daily habit for you1-2 years of product analytics experience: funnels, cohorts, retention, MAUs1-2 years of marketing / web analytics experience: A/B testing, conversion rate optimization1+ years of experience presenting analytical findings to senior or executive managementExperience with some or all of the following types of data: CRM (Salesforce), Clickstream (Segment), Subscriptions (Revenue & Licenses), Products (CRUD Actions, Objects, etc.), Logs (Search)Strong communication skills required - explain what it is, why it matters and what should we do in terms of your data and analysis to a non-technical audienceBonus: Knowledge and use of SaaS Pirate metrics, calculations, and definitions (AARRR)Bonus: 1-2 years of Python / R / SAS experience - understand how to use statistical packagesBonus: Experience with any of the following tools - Salesforce, Periscope Data, Looker, Mode Analytics, JIRA (tickets), Airflow (Data ETL), Google Analytics / Adwords, MixPanel, Kissmetrics, Amplitude, Heap, Optimizely, Intercom, Drift At New Relic, we hire people who are eager to contribute to our culture, and we empower them to do just that. We take pride in thinking beyond our day-to-day job descriptions and encourage you to actively seek out opportunities to create the type of work environment that you want to be a part of. What does this look like in action? You should be ready to be a culture add to New Relic and spend ~5% of your time finding meaningful ways to make this an even better place to work. A little about us: New Relic provides the real-time insights that software-driven businesses need to innovate faster. New Relics cloud platform makes every aspect of modern software and infrastructure observable, so companies can find and fix problems faster, build high-performing DevOps teams, and speed up transformation projects. Learn why more than 50% of the Fortune 100 trust New Relic at newrelic.com.  New Relic is a San Francisco Best Places to Work award winner, an Oregon Top Workplace award winner, named a leader in the Gartners 2012, 2013, 2014, 2015 & 2016 Magic Quadrant for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high-quality teammates, a standard-setting product, and a company on the move.  Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers.  New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender identity, religion, national origin, ancestry, citizenship, physical abilities, age, sexual orientation, veteran status, or any other characteristic protected by law.  Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic. We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.  Interested in the details of our privacy policy? Read more here: https://newrelic.com/termsandconditions/applicant-privacy-policy  #LI-BF1"}