{"jobID": "2652404411", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.citadelsecurities.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Virtu Financial"}, "estimatedSalary": null, "jobDescription": " Job Description  Data Engineers are tasked with building next generation data analysis platforms. Our data analysis methods evolve on a daily basis and we empower our engineers to make bold decisions that support critical functions across the business.Key Responsibilities:Design, develop, test, and deploy elegant software solutions across the firmPartner with business leaders to define priorities and deliver custom solutionsSkillset Requirements:A deep passion for working with data and developing software to address data processing challengesBachelor’s, Master’s or PhD degree in Computer Science or equivalent experienceProficiency within one or more programming languages including C, C++, Python, R or JavaScript.Proficiency with multiple data platforms including RDBMS, NoSQL, MongoDB, Spark, HadoopExperience with some of the following areas: Distributed Computing, Natural Language Processing, Machine Learning, Cloud Platform Development, Networking, and/or REST Service DevelopmentStrong written and verbal communications skillsAbility to manage multiple tasks and thrive in a fast-paced team environmentOpportunities available in Chicago, London, New York About Citadel SecuritiesCitadel Securities is a leading global market maker across a broad array of fixed income and equity securities. Our world-class capabilities position us to meet the liquidity demands of our diverse group of institutional clients in all market conditions. In partnering with us, our clients, including asset managers, banks, broker-dealers, hedge funds, government agencies and public pension programs are able to gain a powerful trading advantage and are better positioned to meet their investment goals.  The team makes its mark every day from our offices around the world: Chicago, New York, London, Hong Kong, Toronto, Shanghai, Sydney, Dublin. Apply NowApply"}