{"jobID": "2831993968", "jobLocation": "Riverside_CA", "jobTitle": "Inventory Control Specialist", "companyRating": "4.2", "companyInfo": {"Website": "www.safestreetsusa.com", "Headquarters": "Garner, NC", "Size": "501 to 1000 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Vivint Smart Home"}, "estimatedSalary": "14", "jobDescription": " The Inventory Control Specialist for SafeStreets USA assists the Inventory Control Manager in the oversight and protection of the inventory used by the company. This person must carry out the administration and replenishment of inventory to support our field personnel and customers. This person must also establish and maintain positive relationships with equipment-related vendors as well as our administration and operations teams as directed by the Director of Inventory.  ? Job Duties:To serve as first and primary point of contact for all matters related to the administration of the Inventory program to their assigned Inventory Control Region.To carry out tasks in the interest of optimizing the company?s Inventory investment by adjusting base levels set by the Installation Managers for each Installation Consultant as recommended by the Director of Inventory.Responsible for preparing their respective inventory region for End of Month Inventory by ensuring delivered purchase orders and open transfers are closed and discrepancies after EOM are fixed.Tasked to maintain an efficient and accurate auto-replenishment process with the ultimate goal of minimizing the need for manual and pickup orders.Responsible for continually keeping the Installation Managers aware of the pending open transactions for their respective regions in the interest of maintaining both an efficient auto-replenishment process and spillage return process.Daily monitoring of national vendor hub inventory stock levels to ensure the Director of Inventory is aware of any shortages before large scale backorder situations arise.Responsible for the timely daily oversight of your assigned region?s warehouse assistant who?s primary responsibility is to request, process, and return faulty equipment that has been entered into the spillage reporting system.Reports on spillage return conditions to assist in identifying equipment trends with both the manufacturer and the installation department that may be an indication of a widespread national problem. Communicates spillage findings regularly to the Director of Inventory."}