{"jobID": "2802135565", "jobLocation": "San_Antonio_TX", "jobTitle": "Predictive Modeling/Data Scientist-Healthcare *DoD Secret Cl", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with San Antonio Interviews but with Knowesis Inc.  San Antonio Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Knowesis is currently looking for a Predictive Modeling/Data Scientist-Healthcare to join our growing team!  Knowesis, Inc. provides innovative health analytics, strategy, and operation solutions for the Defense Health Agency (DHA), the Office of the Air Force Surgeon General (AF/SG), the Air Force Medical Operations Agency (AFMOA), the Air Force Medial Support Agency (AFMSA), and the Veterans Administration. Knowesis has driven enterprise Military Health System (MHS) business planning, market analyses, and information innovation for almost 10 years. Our understanding of the critical nature information plays in decision making, has led us to offer a best value solution that involves proven data analytics, methodologies development, data extraction, and effective reporting capabilities. Our team is deeply experienced in the management of business information and creating value from it at all levels. Knowesis makes informed program recommendations to AFMS leadership, compiling and analyzing data from across all clinical and operational aspect of health plan management.  This work will be performed at the client site in San Antonio, TX. *Candidates must possess a current/active DoD Secret clearance or higher to be considered Positions Requirements:Specific Tasks: Conduct analysis, evaluation, and metrics on various communication activities and its impact.  The individual will support senior government executives in the development of the organization's strategy and business process  They will assist with the development, collection, analysis, and reporting of data  The individual will translate data analysis findings and research principles into written documents and presentations.  They will manipulate and transform data through the use of databases, spreadsheets, and queries.  The individual will serve as domain knowledgeable resource in advising the Knowesis project team and client on tools and techniques to improve the development, collection, analysis, and reporting of information.  Client interaction will be regular and sustained, encompassing both formal presentations and informal, routine communication Preferred Qualifications: A qualified data scientist will have hands-on experience with one or more analytic platforms - MS Analysis Services, SAS, Tableau, R, or SAS  Programmatic languages such as Python, R, SAS, SQL- as well as some number of the following statistical and predictive modeling approaches:  Gaussian Process  Markov Models  Hierarchical Clustering  K-Means  Linear Regression  Logistic Regression  Monte Carlo Simulation  Neural Networks  5+ years of experience with the following:  Strong analytical skills (use of Microsoft Excel, Macros and/or Access to analyze data)  Strong presentation development and writing skills (e.g., proficient in Microsoft PowerPoint and Word)  Ability to facilitate client meetings and sessions to define client processes and needs  Ability to lead small teams to complete a project  Strong written and oral skills required  Experience in one of the following areas: Statistical Analysis, Strategic Management, or Data Analysis/Reporting  Minimum Bachelor's Degree in Business, Economics, Mathematics, Statistics, Data Science or Hard Sciences with a focus on research and analysis, Master’s Degree is preferred  Clearance: Candidates must possess a current/active DoD Secret clearance or higher to be considered  Location: This work will be performed at the client site in San Antonio, TX.  Apply"}