{"jobID": "2789301820", "jobLocation": "Dallas_TX", "jobTitle": "Sr Data Analyst - Irving", "companyRating": "3.4", "companyInfo": {"Website": "www.childrens.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1913", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Cook Children's Health Care System, Medical City Dallas Hospital, Texas Scottish Rite Hospital for Children"}, "estimatedSalary": "77000", "jobDescription": "Description:Position Summary: This position is a vital link between departmental programs, information technology and systems, and Children's Health quality objectives. Collects, processes, integrates, and analyzes present program data; provides tools, descriptions, and guidance for future projects to improve clinical quality and financial success. Ensures and supports the comprehensive data analysis of the clinical programs and business procedures; and recommends specific types of data that can be used to improve quality of care. Serves as a liaison for on-going production maintenance/support, troubleshooting, and change management. Educates teams on data-related information. Job Profile:Requires in-depth professional knowledge and practical/applied expertise in own discipline and basic knowledge of related disciplines within the broader professional fieldHas knowledge of best practices and how own area integrates with others; demonstrates awareness of the industry, including regulatory, evolving customer demands, and the factors that differentiate the organization in the marketActs as a resource for colleagues with less experience; may lead projects with manageable risks and resource requirementsSolves complex problems and takes a new perspective on existing solutions; exercises judgment based on the analysis of multiple sources of informationImpacts a range of customer, operational, project or service activities within own team and other related teams; works within broad guidelines and policiesWorks independently, receives minimal guidanceExplains difficult or sensitive information; works to build consensusJob Specific Responsibilities:Use statistical methods to analyze data and generate useful business reportsAnalyze data to draw business-relevant conclusions and in data visualization tools and techniquesInvolved in maintaining and improving the quality of work in the department and developing predictive analysisGenerate process documentationExtract data from downstream sources and pushing the data into a presentable format to be used within the team, or other teamsWork with management team to create a prioritized list of needsAble to identify and recommend new ways to streamline business processesUses data to create models that depict trends in the populations served and the consumer population as a wholeWorks with the management team to outline the specific data needs for each projectAdministrative: Complete Childrens Annual Required Training (CART); Update time in Heat and/or PPM weekly (Excluding Lab); Attend internal departmental meetings; Participate in departmental activities (i.e. survey-related activities); Organizing, filing, and other duties as assignedExperience:3+ years work related experience requiredDirect experience related to same or similar systems installed at Children's (Epic/Healthy Planet, Crystal reports, reporting Workbench, Oracle SQL, programming/coding, Tableau workbook) required3+ years' experience with PC-based applications, e.g. Windows, MS Office, Relational Databases, MS Access requiredEducation:Four-year Bachelor's degree or equivalent experience requiredGraduate or professional work or advanced degree; or equivalent experience preferredSpecific Knowledge, Skills and Abilities:Healthcare industry experiencePrevious experience in Business/Systems Analysis or Quality AssuranceKnowledge/experience in national pediatric healthcare quality metrics (NCQA, JACHO)Maintain effectiveness when experiencing major changes in work responsibilities or environment; adjust effectively to work within new work structures, processes, requirements, or cultures.Use appropriate interpersonal styles to establish effective relationships with customers and internal partners; interact with others in a way that promotes openness and trust and gives them confidence in one's intentions. Ensure that the customer perspective is a driving force behind business decisions and activities; craft and implement service practices that meet customers' and own organization's needs.Develop and use collaborative relationships to facilitate the accomplishment of work goals.Identify and understand issues, problems, and opportunities; compare data from different sources to draw conclusions; use effective approaches for choosing a course of action or developing appropriate solutions; take action that is consistent with available facts, constraints, and probable consequences.Take prompt action to accomplish objectives; take action to achieve goals beyond what is required; be proactive.Deal effectively with others in an antagonistic situation; use appropriate interpersonal styles and methods to reduce tension or conflict between two or more people.Effectively manage one's time and resources to ensure that work is completed efficiently.Accomplish tasks by considering all areas involved, no matter how small; showing concern for all aspects of the job; accurately checking processes and tasks; being watchful over a period of time.Set high standards of performance for self and others; assume responsibility and accountability for successfully completing assignments or tasks; self-impose standards of excellence rather than having standards imposed.Assimilate and apply new job-related information in a timely manner.Clearly convey information and ideas through a variety of media to individuals or groups in a manner that engages the audience and helps them understand and retain the message.Licenses and Certifications:A degree in Informatics/ IT/Computer Science preferredEpic certification preferredRN preferredPhysical Demands:Sedentary - Exerting up to 10lbs. occasionally or negligible weights frequently; sitting most of the time."}