{"jobID": "2768388126", "jobLocation": "Southfield_MI", "jobTitle": "Senior Mortgage Processor", "companyRating": "4.1", "companyInfo": {"Website": "www.mortgagecenter.com", "Headquarters": "Southfield, MI", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "42000", "jobDescription": "SENIOR MORTGAGE PROCESSORPOSITION SUMMARYThe Senior Mortgage Processor is responsible for working directly with the member, loan officer, operations team, and third parties to obtain and evaluate documents and verifications. The Senior Mortgage Processor ensures accurate and timely production of conventional and government mortgage files, and identifies with the importance of delivering an exceptional customer experience, and can deliver consistent and high productivity.ESSENTIAL FUNCTIONS / RESPONSIBILITIESVerifies and reviews information contained on the mortgage loan application for detail and accuracy.Clears title, appraisal, flood and survey issues.Follows up on 3rd party order outs.Ensures that underwriting conditions are received and cleared satisfactorily prior to closing.Ensures that the proper product and loan terms are correct in the computer system, per lock agreements.Verifies and enters data for actual closing cost and prepaid charge information.Provides training and mentoring resources for processor trainees and processors.Performs other duties as assigned.SPECIAL SKILLS, EXPERIENCE OR QUALIFICATIONSEducation: High school diploma or equivalent. Associate degree in Business/Finance preferred.Experience: At least three (3) years of experience successfully processing mortgage loan applications.Understanding of all mortgage regulations and compliance.Ability to adapt quickly to the ever-changing mortgage market and regulatory landscape.Ability to handle multiple tasks and adapt to a changing environment.Strong problem-solving and decisive skills.Strong organizational and time management skills.Strong mathematical ability.Ability to work well independently.Ability to work effectively in a fast-paced, highly regulated, and deadline-driven environment.Excellent, professional verbal and written communication skills.Proficient with computers, to include Microsoft Outlook, Word, and Excel."}