{"jobID": "2757488908", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.underarmour.com", "Headquarters": "Baltimore, MD", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (UA) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Do you geek out at the intersection of statistics and storytelling? Are you passionate about finding the story the data is telling, and using it to help drive key decisions? Are you interested in helping shape the direction of the worlds best fitness brand?  Lets talk.  The Under Armour team not only makes the best performance apparel and shoes on the planet, we also offer the worlds most integrated digital health suite of apps, devices, and apparel. And we need a cutting-edge digital marketing analyst to help bring that story together. You / Senior Data Analyst will partner with our marketing team derive insights from our digital health platforms that inform the clients understanding of the digital health consumer and their own relationship with that consumer. The candidate will be part of the analytics team who supports tasks that include: In depth analysis of marketing and consumer data, includingUser behavior analysisSegmentation studiesDriver analysesAdvanced exploratory analytics to drive insightful and reportingPerformance metrics definition, algorithm development and automationReporting and visualizationIntegration with Engineering teamsRequirements building for feature development for use in analyticsInstrumentation optimization with development engineersComplex data analysis tasksData anomaly detection and correction modelingTransformation and manipulation scriptingConversion of data into stories for internal and external consumptionCross-team support for multiple application platforms and verticals The candidate must have experience with: Advanced degree in an analytical field (math, business, statistics, hard or social sciences) and 3+ years in data analytics, or BA in like field with 5+ years experienceUsing data to solve complex business questionsCommunicating data stories in written and verbal form to wide audiences of varying levels of sophisticationAdvanced SQL skillsJavaScript D3 libraries or Tableau visualizationProgramming in a scripting environment (e.g. Python) or ETL development experienceDexterity with an advanced statistical package (e.g. R, SciPy)"}