{"jobID": "2804003372", "jobLocation": "West_Bloomfield_MI", "jobTitle": "Restaurant Team Member - Crew", "companyRating": "3.5", "companyInfo": {"Website": "www.chipotle.com", "Headquarters": "Denver, CO", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (CMG) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Panera Bread, Noodles & Company, Qdoba"}, "estimatedSalary": "10", "jobDescription": " Restaurant Team Member - Crew (720 - Orchard Lake 2) (18014203) DescriptionAt Chipotle, weve created something special: a better place to eat and work. Many employees start just expecting a paycheck, but end up with a rewarding career. We provide exceptional training and a clear career path over 80% of our managers got promoted from Crew. Whats in it for you:Tuition assistance (up to $5,250 a year)Free food (yes, really FREE)Medical, dental, and vision insurance (for everyone)Paid breaksPaid time offHoliday closuresFull time and part time opportunitiesOpportunities for advancement (80% of managers started as crew)Customized college degree programs that can be completed in as little as 18 months, for as low as $250 a year*Competitive compensation, including stock and company car allowance for our highest-performing managers (Restaurateurs)What were looking for:Someone with a friendly, enthusiastic attitudeSomeone that loves to help and serve others (both customers and team members)Someone ready to learn how to cook (a lot) We prepare real food by hand every day in our restaurants. No freezers, microwaves or can openers to be found.  We welcome experienced restaurant professionals and novices alike. Well provide the training you need to feel confident working at any station grill, cashier, prep, salsa and expo. We take pride in our exceptional customer service and its up to each of our team members to create the friendly atmosphere that our customers expect and enjoy. So, whether you have experience as a dishwasher, cashier, server, host, bartender, cook, prep cook, FOH/BOH or no experience at all, were always looking for passionate and enthusiastic people to join our team.  At Chipotle, youll be part of a team that is working to cultivate a better world. If that sounds like something you would like to be a part of, apply today. Requirements (the fine print):You have to be at least 16 years old to work at ChipotleYou need to be able to communicate in the primary language(s) of the work location *Receive up to $5,250 from Chipotle in tuition assistance and up to $5,185 in federal grants each year. Combined with up to 44 earned credit hours from on-the-job training at Chipotle, you could earn your degree for as little as $250 a year.Primary Location: Michigan - West Bloomfield - 0720 - Orchard Lake 2-(00720) Work Location: 0720 - Orchard Lake 2-(00720) 6753 Orchard Lake Rd. West Bloomfield 48322"}