{"jobID": "2812088016", "jobLocation": "Bridgewater_NJ", "jobTitle": "Director, End to End Visibility Architect (Data Engineering)", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "184000", "jobDescription": "Johnson & Johnson's Family of Companies, is recruiting for Director, End to End Visibility Architect in Bridgewater, NJ.Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in healthcare to touch the lives of over a billion people every day, throughout the world.With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly-based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen.Position Summary:The Director, End to End Visibility Architect, JJSC, E2E Visibility Platform, will be accountable for the development of the data model and use of the said model to build products that will be purchased by internal stakeholders to enable End-to-End Product Flow Visualization. This individual should be familiar with both off the shelf visualization products readily available in market as well as expertise in supporting custom built products. This role will ensure the data model developed will work within the architectures, strategies, policies, and standards for our planned products and that the model will lend themselves to scaling. This is a unique role as it requires in-depth technical expertise, strategic vision, and strong executive communication skills. This role is an individual contributor that does not have direct responsibility for supervision or performance management of staff.Key Responsibilities:Develop, build and maintain the data model required to support our desired E2E Visibility PlatformExecutes rapid prototyping and iterative design of new products within the E2E Visibility Platform while also supporting configuration of off the shelf cloud solutionsIdentifies and assists in solving for potential product overlap within the E2E Visibility PlatformInteracts with internal and external advanced analytics experts to stay aware of emerging trends in algorithms and development of algorithms as may be required to realize desired Product features by our customersEmbraces and encourages a team culture focused on continuous improvement and innovation that is supported by agile design and developmentFosters strong partnerships with business leaders (e.g. Functional and Segment) that will drive a desire to purchase our products before seeking external supportAccountable for security and performance of products developedQualificationsA minimum of a Bachelors degree is required. An advanced degree is preferred.A minimum of 10+ years of relevant business experience is required.Demonstrated thought leadership with a proven track record of designing Big Data Analytics and Machine Learning solutions is required.Experience in constructing a global platform and stack of technologies that supports an extensive user base across time zones is required.Proven leadership across cloud, data, infrastructure, APIs, and front-end technologies is required.Experience working in a fast-paced environment, effectively managing projects and programs to deliver results on time and within budget, including product development experience is required.Passion to develop and deploy digital capabilities that delight the user is required.Big picture mindset with the ability to zoom in and out of details; can balance both technical and strategic demands is required.Must possess strong interpersonal & analytical skills with the ability to successfully lead & deliver on multiple priorities in a dynamic environment is required.Up to 25% travel domestically and internationally to and from J&J; work-sites to participate in meetings, workshops, company events, etc. requiring overnight stays is required.Primary Location United States-New Jersey-Bridgewater Organization Johnson & Johnson Services Inc. (6090) Job Function Operations (Generalist) Requisition ID3350180606"}