{"jobID": "1731973646", "jobLocation": "Clinton_NJ", "jobTitle": "Senior Data Modeler", "companyRating": "3.9", "companyInfo": {"Website": "www.sg.com", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "167000", "jobDescription": " Financial / Insurance  Summary: Data Modeler, Central New Jersey Consulting, logical, physical ERD, ETL, Complex Data Mapping, Sophisticated & Multi-dimensional models, Annuities+, GC or US Citizens only  Immediate consulting contract opportunity - MUST be available for in person interview in Clinton NJ (no third parties, please)  The Data Modeler must have at least 10+ years in Data Modeling role proficient with entity relation diagrams, logical/physical data models creation, review, analysis and issue resolution Ability to apply modeling standards to logical and physical ERDsAbility to work with the Development team.Experience with data mapping (ETL data mapping with defined technical and business rules. Complex logic, not only 1:1 data mapping)Experience with data modeling concepts (conceptual/logical/physical/semantic, multi-dimensional models(star, snowflake), normalized/denormalized models)Experience with understanding data - profile and analysis (metadata(formats, definitions, valid values, boundaries), relationship/usage)Experience with data warehousing.Experience driving data design and end to end processingExperience with moderate SQL scripts (creating, reading, running, customizing)Work independently with minor oversightExcellent interpersonal skills necessary** Life insurance experience is desirable.10 + years experience working with data models using Erwin desirable Why work with me? Your resume won't get lost in the \"black hole\" ; you will get feedback and follow through. I will provide a resume review, create relevancy for the position ; you will receive better information on the company culture and inside information on the hiring manager, team, the ideal profile, etc. ; and...the best Interview preparation you will ever experience!  Please check out my profile at http://www.linkedin.com/in/michaelmande/"}