{"jobID": "2545984586", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer, Document Cloud", "companyRating": null, "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": null, "jobDescription": " SummaryAdobe has developed Document Cloud to revolutionize the way the world interacts with documents by providing document conversion services, protection, intelligent form recognition and signing. Now we are working on the next phase of delivering a truly engaging and collaborative experience working with documents. Adobe Document Cloud business is investing heavily in this area. We are looking for a full stack engineer with a real passion for innovation and a strong sense of product ownership who has deep expertise with modern web development using JavaScript. We would also like to see strong server side development experience using Java or Python.  You’ll be joining an existing team of very talented engineers. As part of the role, you will be expected to work on and lead many aspects of web application development. We need a confident, yet humble, creative problem solver who feels right at home diagnosing and solving any technical challenge. You should be able to architect a feature from start to finish, accounting for how it will work, scale, deploy, be measured and get monitored.What You’ll Do Architect, build and deliver products that delight customers with scalable and maintainable code under the hoodWork with the latest client side technologies such as ES 2015+, Webpack, Gulp, React, Angular, Babel and moreWork on a strong scrum team delivering production quality code every two weeksOwn the backlog by defining technical stories and leading the team in grooming themBe responsible for the design, implementation, testing, performance and monitoring of the team’s solutionsLead sprint reviews along with your teammatesParticipate in hackweeks three times a year producing creative solutionsHost brownbags to publicize technical information within Document Cloud engineeringCollaborate with architects and other senior scientistsSupport an open source development model with your teamContribute to other teams to accomplish your own project goals What You Need To Succeed Have strong experience with modern client side toolsHave expert level knowledge of key web technologies (JavaScript, HTML5, and CSS)Have advanced knowledge and experience working with web frameworks like React, Angular and BackboneAn in-depth understanding of common functional design patterns, data structures and algorithms, especially in the context of JavaScriptHave experience working with ES 2015+, ES Modules, Webpack, Gulp, Babel, Karma/Jasmine, NodeJS, npm and CSS preprocessingHave knowledge about SystemJS, Rollup, Grunt, Web Components and YarnHave experience with Single Page Web Application developmentBe knowledgeable with server side SaaS development using Java or Python (OSGi is a plus)Understand Accessibility requirements and have experience with AriaHave experience in designing and developing scalable and distributed RESTful APIsExperience with JS testing, browser testing and debuggingHave experience with CI/CDBe able to use Splunk for monitoring and investigationBe proactive and intrinsically motivated to get things done on your ownBe a multiplier by helping others to be productiveBe flexible in doing whatever it takes to help the scrum team honor its commitmentsSupport your product owner in finding innovative solutionsFocus on customer experience and build product features that delight usersCollaborate with other teams and be willing to contribute codeContinue your own professional growthBe a full stack developer but also a domain expertPassionate about exploring new technologiesB.S. or above degree in Computer Science or related technical field10+ years as a software engineer What You’ll Experience A high performing and very supportive scrum teamExtensive collaboration and knowledge sharingRespect for separation of work and family livesSatisfaction from stimulating work ethicsExcitement from shipping awesome productsSecurity in working for a profitable and innovative company At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}