{"jobID": "2775992209", "jobLocation": "Hopewell_NJ", "jobTitle": "Senior Scientist/Engineer -Downstream Process Development/ Protein Purification", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "About BMS: Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.  Bristol-Myers Squibb has consolidated early biologics process development organization comprising Molecular biology, Cell Line Development, Upstream and Downstream development, and Process Analytics collocated with a large Analytical Development organization in New Jersey. BMS Hopewell site is part of New Jersey's \"Biopharmaceutical Life Sciences Cluster,\" a concentrated area of biotechnology, medical device, and pharmaceutical companies. Position Description: The Senior Scientist/Engineer will be working in a dynamic team setting with the opportunity to lead development of downstream process with cutting-edge technologies and with a growing biologics portfolio. The Scientist/Engineer candidate in purification process development will be responsible for conducting research and development that leads to efficient and scalable recovery and purification processes for therapeutic proteins. Key Responsibilities:Lead a process development team to develop protein purification strategies to meet established timelinesDesign and execute experiments utilizing HTS, FMEA and DOE to produce a robust processImplement purification process development, optimization, scale up of biologic manufacturing processes and support as needed process characterization and PPQ activities of therapeutic proteinscollaborate with internal and external partnersIdentify technical issues, troubleshoot, solve problems and achieve clear resolutionWrite technical reports and lead project reviews on a regular basis in matrix organizationTransfer processes from Development labs to BMS production facilities and CMOAuthor process description and development reports, review manufacturing batch records and facility fit documents, and provide support with identification and troubleshooting of manufacturing process issuesResearch new equipment/technology and contribute to platform improvementTrains others on procedures, operations, new technology, methods and mentors new scientistProvide effective management for planning, coordinating and executing tasks and projects in a given time frameFollow safety proceduresMaintains laboratory notebook meeting corporate standardsQualifications:PhD in Chemical/Biochemical Engineering, Biotechnology, Protein Chemistry or Biochemistry with minimal 4 years of industrial experience in Process Development/Purification Process Development, or MS with minimal 10 years; or BS with minimal 13 years of relevant industrial experience.Track record experience with all aspects of purification strategies including protein A, Ion Exchange, HIC, mixed mode, UF/DF, viral clearance, centrifugation etc.Extensive experience with process optimization for product purity, recovery, impurity removal, cost reductionExtensive experience in technology transfer and interaction with CROs and CMOsExperience with scale-up/down process modelsExperience with high throughput experimentation and mechanistic modelling is desirableExperience in leading teams and managing projectsWorking knowledge of design of experiments and use of statistics for data analysisWorking knowledge of upstream and analytical sciencesExperience with CMC writing and IND filing preferredUnderstanding of current trends of ICH and regulatory agencies Bristol-Myers Squibb is an equal opportunity employer - M/F/Vet/DisabilitySDL2017"}