{"jobID": "2738312318", "jobLocation": "Marina_del_Rey_CA", "jobTitle": "Senior Machine Learning Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.zefr.com", "Headquarters": "Venice, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Media", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "172000", "jobDescription": "Zefr is growing! We are hiring a new Senior Machine Learning Engineer to be involved in building and optimizing large-scale systems to acquire, process, store, and understand multiple terabytes of YouTube and other social media data. This role is an important part of the rapidly growing demands of being the leader in understanding social video for enterprise media companies and content owners. In this role you will use engineering principles to bring machine learning models based on our data to production quickly. Here's what you'll get to do:Participate as a member of the Data Science team, work closely with fellow data scientists, product managers and engineersDesign, implement, test, and monitor supervised and semi-supervised machine learning modelsMake use of natural language processing (NLP) and image processing algorithms to help better understand our dataPrototype creative solutions quickly, test theories, evaluate feature concepts and iterate rapidlyHere's what we're looking for:Must have experience developing end-to-end machine learning pipeline from data exploration, feature engineering, model building, performance evaluation, and online testing with large data setsA degree in a scientific discipline. While we recognize that computer science and computer engineering are most common we are excited to hear about how your particular education can be valuable at Zefr.Strength in Machine Learning, Information Retrieval, NLP, and Image Processing with an emphasis on NLPAbility to think critically about how to evaluate the quality of models and improve themExperience with large-scale data analysis frameworks: Hadoop, Spark, SQL3+ years of experience with at least one dynamically typed language, one statically typed language, and experience at the Unix shell. Here at Zefr we use Python and Scala.Cloud computing infrastructure on Amazon is a plusStrong foundation in data structures, algorithms and software designOpenness to new technologies and creative solutions"}