{"jobID": "2723356816", "jobLocation": "San_Francisco_CA", "jobTitle": "External Home Loan Consultant", "companyRating": "3.7", "companyInfo": {"Website": "www.patelco.org", "Headquarters": "Pleasanton, CA", "Size": "501 to 1000 employees", "Founded": " 1936", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " OverviewWe’re here to help people in communities throughout Northern California build financially healthy lives. We do this by being attentive and partnering with our members to understand what is financially best for them. We thrive on change, and we put people first. If you’re looking to use your skills and knowledge to make a difference in the lives of others, we look forward to hearing from you. About Patelco Credit Union Patelco is a not-for-profit credit union, serving the financial needs and aspirations of more than 300,000 members. What we earn, we return to our members in savings from lower loan rates, fewer fees, and personalized service that focuses on transparency, simplicity, and trust. Our mission remains the same as when we started in 1936, to provide products, services, education and expertise that will empower our members to rise up and achieve financial freedom. The Opportunity We seek to hire an External Home Loan Consultant. In this role, responsibilities will include originating home loans and lines of credit though direct contacts with members or by other referral sources.Responsibilities Meets with members to discuss loan programs and recommends appropriate product(s) to meet the member’s needs.Responsible for obtaining and submitting a complete loan application with the required supporting documentation.Responsible to notify the borrower of decline and refer to PCS for an alternative solution.Responsible to meet minimum production goals assigned.Responsible to meet disclosure requirements for all real estate loans.Maintain accurate status in origination systems for all loans assigned.Make presentations and represent Patelco Credit Union at functions as directed.Develop referral sources through assigned branches, local realtors, and in the community.Recognize Cross sell opportunities and refer to appropriate team.Keep members personal information safe and secure per Patelco’s Security Policy.Must meet with assigned branches weekly.Understand and comply with all applicable federal and state laws and banking regulations (including those related to OFAC and Bank Secrecy Act / Anti-Money Laundering compliance) and Patelco Credit Union’s policies and procedures.Other duties as assigned.Qualifications2 years of experience of external real estate or mortgage loan salesKnowledge of FNMA and FHLMC guidelines preferredExcellent oral and written communication skills.Good public relations abilityDemonstrate skill in planning, organizing and controlling work:Ability to work in a team environment.Must have ability to use personal computer with emphasis on Word and Excel.Patelco Credit Union is an EO Employer - M/ F/ Veteran/ Disability"}