{"jobID": "2729340632", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist, Growth", "companyRating": "3.4", "companyInfo": {"Website": "www.coursera.org", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "195000", "jobDescription": "Coursera is scaling a global platform to provide universal access to the world’s best education, and we’re motivated by the passion and mission to transform lives through learning. Our platform has reached over 30 million learners worldwide and we have partnered with 150+ elite universities around the globe with over 2,000 courses in our catalog. We offer Courses, Specializations, Certificates, and Degrees to meet the needs and goals of the diverse learners who come to Coursera.In 2016, we began offering fully accredited online Masters degrees which ​provide ​a​ more convenient, lower-cost,​​ “stackable”​ means of earning credentials identical ​to their ​​traditional​ on-campus​​ counterparts. We also launched Coursera for Business, partnering with enterprise companies around the world to provide access to curated skill development for their employees.The Data Science team owns the quantitative measurement, experimentation, and inference that informs Coursera's product and business direction; builds the statistical models and machine learning algorithms that power content discovery and an engaging, scalable learning experience; and empowers partners and enterprise customers with on-platform analytics and direct data access.We’re looking for a talented, creative, and driven data scientist with a sharp eye for UX design, strong algorithmic and analytic skills, and an interest in expanding the reach and quality of online education. Our ideal candidate is an independent, analytically-minded individual with strong analysis and statistical modeling skills, who shares our passion for education.You personally exhibit a conviction that the world needs Coursera to be wildly successful and alignment to our core values: Betterment: a tireless pursuit to drive resultsBoldness: take risks and act decisivelyDeep Honesty: invite and offer candid feedback in order to learn, change, and growSolidarity: recognize that we are part of something bigger than ourselves and are committed to our missionYour responsibilities:"}