{"jobID": "2778403414", "jobLocation": "Rochester_Hills_MI", "jobTitle": "Senior Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.epsilon.com", "Headquarters": "Irving, TX", "Size": "5001 to 10000 employees", "Founded": " 1969", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Merkle"}, "estimatedSalary": "71000", "jobDescription": "DescriptionSummary: The Analytic Consulting Group partners with internal and external clients and data providers, leveraging predictive analytics and advanced statistical techniques to drive strategic thought and effective decision making. The Senior Data Analyst helps support all aspects of analytic initiatives from conception to completion. Responsibilities:Provide SAS/SQL programming, under general direction, in the execution of data analysis that will contribute to the final project deliverablesAppropriately account for the timeliness and quality of all assignmentsCollaborate with internal and external stakeholders to manage data logistics - including data transfers, understanding data structures, business rules, etc. - to enable project executionQA/QC data and report output to ensure accuracyAssist in development of reports, providing content and writing of key observationsParticipate in presentation of reports to key internal and external stakeholders, effectively communicating the key findings and recommendationsManage multiple projects concurrentlyMentor junior staff membersAssist in the creation of compelling presentations that provide actionable insights and recommendationsBe exposed to the sales process, providing limited content to be included in proposals for new and existing business opportunitiesPrioritize and monitor project progress relative to timeline and scopeMinimum Qualifications:Bachelor or Masters degree in a quantitative discipline (statistics, economics, mathematics, marketing analytics)Minimum 2 years of experience in marketing analytics fieldProficient in SAS/SQL; minimum 3 years experienceProficient in MS Office, including PowerPoint, Word, Excel and OutlookSolid planning, priority setting, and project management skills with experience managing multiple projects concurrentlyExcellent verbal and written communication skillsSuccessful developing relationships within and across functional teams (including statistical, technical, and marketing resources)Highly motivated and collaborativeStrong technical skillsAcute attention to detail (QA/QC)Effective organization and time management skillsDesirable Qualifications:Advanced degree (Masters/PhD) in Statistics, Economics or other quantitative disciplineAbility to display data visually, creating powerful presentations which effectively demonstrate the value of analytic deliverables; proficiency with business visualization tools (e.g., interactive dashboard software)Ability to program in newer and emerging languages such as R and Python; working knowledge of Hadoop and other big data technologiesQualificationsConditions of EmploymentAll job offers are contingent upon successful completion of certain background checks which unless prohibited by applicable law may include criminal history checks, employment verification, education verification, drug screens, credit checks, DMV checks (for driving positions only) and fingerprinting.Great People, Deserve Great BenefitsWe know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career. From tuition reimbursement to scholarship programs to employee stock purchase plans and 401(k)s, we offer associates a variety of benefits that work as hard for them as they work for us.About EpsilonEpsilon® is an all-encompassing global marketing innovator. We provide unrivaled data intelligence and customer insights, world-class technology including loyalty, email and CRM platforms and data-driven creative, activation and execution. Epsilons digital media arm, Conversant, is a leader in personalized digital advertising and insights through its proprietary technology and trove of consumer marketing data, delivering digital marketing with unprecedented scale, accuracy and reach through personalized media programs and through CJ Affiliate, one of the worlds largest affiliate marketing networks. Together, we bring personalized marketing to consumers across offline and online channels, at moments of interest, that help drive business growth for brands. Recognized by Ad Age as the #1 Worlds Largest CRM/Direct Marketing Network, #1 Largest U.S. Agency from All Disciplines and #1 Largest U.S. Mobile Marketing Agency, Epsilon employs over 8,000 associates in 70 offices worldwide. Epsilon is an Alliance Data company. For more information, visit www.epsilon.com and follow us on Twitter @EpsilonMktg.  Alliance Data provides equal employment opportunities without regard to race, color, religion, gender, age, national origin, disability, sexual orientation, gender identity, veteran status or any other characteristic protected by law. For San Francisco Bay Area:  Alliance Data will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of San Francisco Police Code Sections 4901 - 4919, commonly referred to as the San Francisco Fair Chance Ordinance  Alliance Data is an Equal Opportunity Employer.  Alliance Data will provide accommodations to applicants needing accommodations to complete the application process.  Any applicant offered employment will be required to establish that they are legally authorized to work in the United States for Alliance Data.  Alliance Data participates in E-Verify.  Alliance Data will consider for employment qualified applicants with criminal and credit histories in a manner consistent with the requirements of all applicable laws, including the City of Los Angeles Fair Chance Initiative for Hiring Ordinance.  #LI-BW1"}