{"jobID": "2827703469", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Business Data Analyst - II", "companyRating": null, "companyInfo": {"Website": "www.idexcel.com", "Headquarters": "Herndon, VA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Business Applications and Data Support Analyst within Information Technology supports change and problem management, application and configuration management and production support of our suite of business applications and customer web sites ensuring that the systems and data are accurate and available in a 24x7-operating environment. This job requires gaining a strong working knowledge of business applications as well as a strong understanding of how business users could utilize or adapt the software to support their areas of responsibility. This is a hands on position requiring both leadership and technical problem solving skills. 5 to 7 years of experience.  Bachelors degree with 5 plus years of experience. Work closely with the business stakeholders and development team throughout the projectExceptional analytical and problem solving skills; ability to work creatively in problem solving environmentStrong technical and communication skills;Prior experience with Verizon is a plusMust be a good team player. JOB TITLE:  Please indicate true job title if the selected Fieldglass option is too general or too specific.  JOB DUTIES:  The candidate will managing agile projects in the team and ensure projects stay on track by working closely with technical team members to get status. The candidate will also be responsible for coordinating and overseeing the release as a whole for the application team. The candidate will also work with team members to gather and review weekly highlights and create weekly presentations for executives. Responsible for accepting business requirements, assessing scope/impacts, creation of user stories and approach documentation, reviewing designs and creation of test cases; ability to convert business requirements/user stories into functional/system requirements; work on mutli-system complex integration projects, meets the scheduled deadlines, and resolve problems without impacting schedules or projects; demonstrates strong analysis and design skills on development for products and services that include front end and back end integration; understand the full end-to-end impacts of an initiative and have the ability to identify any impacts to other cross-functional teams/applications; work on production issue resolutions; partnering with the development leads to ensure that system is scalable, tuned for performance, and operationalized; ability to provide guidance to 3rd party partners integrating via APIs; be able to work in a fast-paced environment in which the requirements can evolve over course of project, ability to handle multiple assignments and prioritize deliverables based on business criticality; work closely with the business stakeholders and development team throughout the project; develop, execute, and validate test cases, analyze logs, database tables; experience in SQL and DevOps tools (i.e. Jenkins, JIRA); open defects with thorough details; focus on quality to minimize production defects; perform end to end functional testing; provide status reports and updates to project lead on regular basis; excellent analytical skills; strong technical and communication skills; prior experience with Verizon is a plus; must be a good team player.  Must have experience with application development project management  Must have ability to understand business, system, functional and user flows and technical terms and familiarity with APIs.  Must have experience working with offsite team member and handling offshore resources.  Must be able to support weekly and enterprise release coordination which requires night support  Strong presentation creation skills for creating executive level presentations. Ability to customize information into a presentation that effectively and clearly communicates accomplishments or challenges to various audiences.  Must have strong verbal and written communication and interpersonal skills to collaborate with different IT and business teams  MUST HAVE SKILLS:  Experience using Clarity, Sharepoint, JIRA and QC a plus  Prior experience as an analyst/developer a plus  Proficiency with MS Office suite of apps  Expert level work with MS PowerPoint Exceptional analytical and problem solving skills; ability to work creatively in problem solving environment DESIRED SKILLS: Prior experience with Verizon is a plus EDUCATION/CERTIFICATIONS:  Bachelors degree with 3 plus years of experience.  REQUIRED SHIFT:  Please indicate whether this position is standard 9-5, if weekend work is required, if the person need to be \"on call\" at any time, etc."}