{"jobID": "2789259911", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.rush.edu", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1837", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " Do you wish to join one of the nation’s leading academic health centers for research and health profession education?  Rush University Medical Center is seeking a dynamic and collaborative Data Analyst! Position Highlights: The Data Analyst is responsible for collecting data, quality control of the databases, and statistical analysis of data for use in Cancer Center operations and quality improvement. The Data Analyst will collect and analyze data, interpret results, and submit reports and recommendations to the leadership team. The Data Analyst will support and help the Cancer Center leadership team interpret results from the analysis and corresponding reports. Position Responsibilities Include:Provides the medical staff, administrative staff, and hospital committees (as assigned) with real time data analysis that relates to establishing and meeting quality objectives and enhancing clinical efficiency and effectiveness.Writes SQL queries to extract data from the electronic medical record for quality and operations reporting purposesAssists in the development of data storage and access methods and policies to provide maximum efficiency within the Cancer Center.Analysis of the quality and performance initiatives throughout the Cancer Center as assigned. Organizes and analyzes clinical and administrative data from multiple sources and synthesizes results into meaningful reports and presentation.Prepares complex quality analyses utilizing benchmark data from a number of sources as appropriate.Identifies and compiles data from multiple sources to produce and distribute reports to support the QI process. External sources of data include publicly reported web sites such as UHC and Press Ganey data systems.May be requested to validate externally reported data with internal source data.Analyzes the use and effectiveness of processes necessary for aggregating information from clinical computer systems.Generates/ presents reports to Cancer Center clinicians and leadership as needed.Assists the Clinical Data Analyst in the development of department-wide qualitative metrics to support the quality improvement plan.Establishes relationships with various departments in the hospital to obtain and validate quality data.Acts as data analyst with other multidisciplinary teams in the evaluation of quality outcomes. This includes, but is not limited to, medical departments and sections, nursing systems, and ancillary clinical services. May participate in all phases: design, planning, preparation, electronic data abstraction, report development, and presentation.Maintains the confidentiality of all internal correspondence as well as with external entities.Position Qualifications Include:A minimum of Bachelor’s degree in Healthcare. Two to four years of related work experience, preferably in higher education or a healthcare environment.Understanding of concepts in methodology, data collection, and analyses.Proficient with medical terminology.Data management experience required. Knowledgeable in database rules, writing queries, and relational database creation and management (create, query, relate).Unique combinations of both hard and soft skills in order to prepare, analyze, and present data.Proficient in writing SQL queries and stored procedures on large data sets with complex data modelsProficient in the use of statistical software and techniques in the analysis and interpretation of complex data sets.Proficient computer skills including query tools, web-based applications, word processing, spreadsheets, graphs, PowerPoint, and database management.Ability to manage multiple projects essential.Ability to adapt to a rapidly changing environment.Ability to collaborate in cross functional and interdisciplinary quality improvement teams at every level of the medical center.Advanced ability to create summary reports using statistical tools, charts, and graphs.Company Highlights:Rush is a not-for-profit health care, education and research enterprise comprising Rush University Medical Center, Rush University, Rush Oak Park Hospital and Rush Health.Rush's 14-story hospital Tower is the cornerstone of the Rush Transformation, and is the symbol of a philosophy-an evolution in the delivery of patient-centered care.Leading academic medical center, acute care hospital w/ 664 licensed bedsRush University is home to one of the first medical colleges in the Midwest and one of the nation's top-ranked nursing colleges, as well as graduate programs in allied health, health systems management and biomedical research. Twelve programs are nationally ranked by U.S. News & World Report. Rush is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics."}