{"jobID": "2800600850", "jobLocation": "Los_Angeles_CA", "jobTitle": "Principal Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.centerfield.com", "Headquarters": "Playa Vista, CA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " Centerfield develops intelligent Big Data driven marketing and sales technology utilizing real time biddable media (RTB), automated call routing and customized scripting. Our proprietary platform, Dugout, combined with our 1500 person sales center delivers new customers at scale to many of the leading brands worldwide. Job Description The Analytics & Data Science Team at Centerfield is responsible for descriptive analytics, predictive analytics, automated reporting and AI-powered solutions that maximize marketing performance and profitability for our clients. Some of the problems we work on include media buying, lead scoring, workforce management, speech analytics and agent performance. Responsibilities The Principal Data Analyst will own and lead complex projects to identify, model and evaluate opportunities to drive growth, and use descriptive analytics, data visualization, customer segmentation, a/b testing and predictive modeling techniques to drive performance and profitability. This position requires excellent business acumen and communication skills and the ability to work with business leaders to deep-dive analytics problems and develop data-driven solutions. The top candidate naturally dives deep to drive business through data insights and is passionate about socializing actionable insights  Skills/Attributes Required Bachelor's degree in Business, Economics, Finance, Engineering, Statistics, Computer Science, Mathematics or related field, or equivalent experienceExperience with R, SAS, Python and/or advanced statistical packages.7+ years of relevant work experience in a business analyst/data analyst/statistical analysis roleAbility to display complex quantitative data in a simple, intuitive format and to present findings in a clear and concise mannerProficient in SQL, with a proven ability to create ad-hoc queries for various reporting purposes.Strong Excel skills, including deep understanding of advanced formulas, pivot tables and charting/graphing capabilities.Experience in developing requirements and formulating business metrics for reporting, familiarity with data visualization tools, e.g. TableauStrong communication skills and experience leading and coordinating broad business reviews. Skills/Attributes Desired 10+ years of relevant experience in a business analyst/data analyst/statistical analysis roleExpert in SQL. Why Centerfield? Competitive salary, and profit sharing bonus401K matchTake a break when you need it unlimited PTOAward winning culture & unprecedented team spiritFully stocked break rooms with drinks, snacksToro the Bull Dog Mascot and Everyone's FriendPaid volunteer daysMonthly team games/competitions/catered lunchesTeam outings (Ball games, BBQ's, Parties, etc.)SDL2017"}