{"jobID": "2813121778", "jobLocation": "San_Francisco_CA", "jobTitle": "Engineering Manager", "companyRating": null, "companyInfo": {"Website": "www.stanza.co", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Engineering Manager Hundreds of millions of pageviews, natural language processing, real-time user analytics, header bidding these are just a few of the challenges we face at Stanza. To the consumer, Stanza is a seamless calendar integration, allowing users to sync their favorite interests and events such as concerts, sporting events, movie releases, esports, etc. With partners such as Warner Brothers, NBC Sports, CBS, NFL, NBA, NHL, NCAA, and many more, Stanza is becoming the default way to embed and share calendars on the web.  We are redefining the purpose of a calendar with one core value in mind: Your Time Matters. This leads us to a larger vision to redefine the calendar as a dynamic service that helps you automatically find, remember and act on the things that you truly care about spending your time on. We provide intelligent recommendations for Stanza calendars based on the content of articles and pages across the web aligning with interests, utilizing advanced analytics.  If you would like to take this journey and make a difference, please read on.  Stanza is backed by top tier venture investors and is headquartered in San Francisco.  We are looking for an Engineering Manager to lead a team of developers and play a critical role in the technical design, development and testing of our product. A successful candidate has a strong technical background, be willing to be hands-on and work code and have excellent motivation and communication skills. What will you do:Lead a team of Engineers and drive engineering processesInspire, motivate and enable individual development and promote career growth of the teamAct as a designer, planner and project manager for adding features to Stanzas product and take a hands-on approach to work when necessaryWork cross-functionally across Stanza to develop solutions to define features, meet users and brand partners requirementsCreate and/or review design documentation and ensure that the design adheres to the design goals and overall architecture of the product and that the code is of the highest qualityPerform code reviews and provide feedbackWork closely with Product and BD teams providing technical integration guidance as needed and to ensure that the feature updates are delivered timely and with the highest quality code.Willing to jump in and do coding and bug fixing as neededAssist the QA and Customer Success teams with the investigation and resolution of customer issues.Who you are:Bachelor's degree in Engineering or Computer Science required. Master's preferredMust have 2 plus years of managing software development efforts with demonstrated track record of successfully delivering releases of a software productMust have 7 plus years of software development experienceMust have coding skills: JavaScript, React, Node.js, Python, GraphQL, MongoDB, Postgres, Redis and AWSExcellent problem-solving skills and attention to detailExcellent communication skillsExperience with agile development methodologiesWhat elseExciting startup environment with competitive salary with equityCommuter reimbursementsCatered lunches several times a weekMedical, vision and dental benefits"}