{"jobID": "2836242736", "jobLocation": "Santa_Clara_CA", "jobTitle": "Applications Engineer, Senior Staff", "companyRating": "3.9", "companyInfo": {"Website": "www.inphi.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (IPHI) ", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " We are looking for a talented Staff Engineer, Factory Applications who will be responsible for debugging and troubleshooting Inphi CDR/Retimer/PAM products for Optical Modules. The position requires customer facing communication of results. The candidate will report to the VP of Product Marketing.  ESSENTIAL DUTIES AND RESPONSIBILITIES: Proactively & efficiently support Inphi CDR/Retimer/PAM components for use in optical modules.Will function as a center of technical excellence for Inphi CDR/Retimer/PAM products. Write and maintain data sheets and application notes, technical articles and usage guides. Must have the ability to train and guide customer through product usage.Own and drive customer issues to resolution. Act as the interface between the customer and Inphi to resolve technical issues. Broad knowledge to be able handle analog, system hardware, firmware, and application software issues.Will collaborate with sales teams, FAEs, and PLMs to gather and communicate customer’s needs to marketing and engineering.Provide timely responses to customer questions and required to have exceptional technical skills to quickly troubleshoot and debug customer issues.Responsibilities will include taking bench/lab measurements and assisting customers with simulation models and design guidelineMust be able to travel to international and US locations. SKILLS: BSEE with 5+ years of experience or MSEE Preferred with 3+ years of deep knowledge in high-speed CDR/Retimer/PAM used optical modulesFamiliar with 25Gb/s and above electrical and optical lab instruments including sampling scopes, real time scopes, power network analyzers, spectrum analyzers, bit error rate testers, etc.Hands-on troubleshooting experience of electro-optical components that operate at speeds of 25Gb/s and higherMust have excellent debugging capabilityAbility to multi-task and must be flexible and adaptable to a rapidly changing and demanding environmentStrong interpersonal skill to communicate with customers and various internal groups such as marketing, engineering, sales, and operationsAbility to speak mandarin is desiredStrong communication, presentation, and documentation skills"}