{"jobID": "2802117086", "jobLocation": "Houston_TX", "jobTitle": "Drilling Data Analyst with Patterson-UTI Energy", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Houston Interviews but with Patterson-UTI Energy  Houston Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Job Title: Drilling Data Analyst  Location: Houston, TX Brief Description: The Drilling Data Analyst will provide objective performance analytics to the Patterson-UTI organization and its customers. The center will execute processes that access vast arrays of drilling data to analyze and synthesize information. Providing clear performance results will allow the organization to gain valuable insights into operational performance and to take actions to improve operational results in real-time, post-well and pre-well planning phases. The ideal candidate would be a team player, love working with large data sets, think analytically and perform complex calculations to identify trends and anomalies in drilling operations.  The Drilling Data Analyst will be focused on monitoring and analyzing drilling sensor/operations data and developing new reports and visualizations. This person will also be responsible for assisting in recruiting and selection of new team members, supporting drilling optimization and daily operations, and striving to deliver operational excellence and a safe work environment.  The successful candidate will set high standards of performance for themselves and their team; be professional in written, verbal and personal actions in any situation; seek new knowledge and experiences; have an analytical mindset that utilizes factual data to develop creative and business-oriented solutions; and be self-aware and adjust accordingly to a dynamic environment.  This role performs under general direction of the Drilling Optimization Manager. Detailed Description: Track, analyze and manage KPI’s to improve drilling operations and identify areas to enhance performance and improve operations.  Define rules and criteria to identify rigs, wells and equipment that match certain states or conditions, and automate the monitoring and notification process.  Design and develop visualizations, controls applications, customer web portal elements, and other internal initiatives.  Analyze large datasets and develop drilling visuals and reports in software tools like Tableau, Spotfire, Jasper Reports (and other reporting services implementing the High charts JavaScript library), Power BI etc.  Work with developers performing hands-on programming, designing, and developing drilling visuals, reports and platform.  Work closely with software engineers and rig controls/automation team to build performance applications.  Be pro-active in reaching out and communicating with drilling operations teams and customers. Take initiative in identifying data quality issues and define rules and algorithms to detect trends and setup automatic alerts on rig activity and equipment conditions.  Assist in developing communication plans to provide performance feedback to job sites and operational stakeholders; monitor effectiveness and adjust as necessary.  Meet and engage with customers, rig managers, drillers, and operations team on a regular basis to present drilling optimization applications and trends, and help to identify and capture opportunities for performance improvement.  Assist in hiring and training data analysts.  Job Requirements  Proven experience in working with large drilling datasets, multi-well, crew, equipment, and pad performance analysis  Proficient in utilizing advanced logical and mathematic calculations  Able to analyze correlations between motor torque, differential pressure, ROP and MSE  Knowledge of drilling equipment, operations, trends and optimization  Experience in drilling optimization and real-time monitoring of drilling operations  Able to think strategically and translate concepts into action plans and track results  Build engaging relationships at all levels of the organization as well as with customers  Able to manage and confront challenging situations, make difficult decisions, and deliver uncomfortable messages with professionalism  Able to work both independently and as part of a team, managing multiple tasks and projects simultaneously to meet challenging deadlines  Demonstrated ability to make rapid business critical decisions with available information  Excellent verbal and written English Language communication with employees, customers and third parties at all levels  Strong computer skills, including MS Office Suite and other business systems such as Oracle Outsourcing, Electronic Drilling Recorder, and internal Management System, as well as use of smart phones, laptops, and tablets Minimum Qualifications Bachelor’s Degree in an Engineering, Mathematics, Information Systems, Computer Science or related discipline  3+ years of experience in working with large data sets and business analytics using BI tools such as Tableau, Qlik, Tibco Jasper, SSRS, MATLAB/R etc.  Hands-on programming experience in Python or C#/Java and different databases  Eligible to drive Company or personal vehicle for Company purposes including ability to meet requirements of Company’s Vehicle Use Agreement and Driving Policy  Preferred Qualifications  Bachelor’s Degree in Petroleum Engineering or Mechanical Engineering  3+ years of experience working in a data performance and optimization team  Experience with Hadoop, Spark or any big data platform or data science  Experience working for an operator  3+ years of operational experience in the upstream Oil Gas sector  Work Environment  This position requires the person to be able to work in a time sensitive, high visibility role and regularly travel as needed to visit and/or support business units, clients, and work sites. It may also require extended travel to remote locations and/or overnight stay(s) during variable hours (e.g. weekend(s), holiday(s), and hours to travel within and outside of Houston). The person must work with an emphasis on planning, multi-tasking, and prioritizing to maximize efficiency of the team. The person must be able to work both independently and closely with others and manage customer interaction in a positive and professional manner. They must safely navigate work sites with occasional walking, climbing, standing, stepping, etc., during normal operating conditions (e.g. day/night, outdoor hot/cold weather, etc.) while utilizing designated personal protective equipment (PPE). They must be able to actively manage the dynamics of a 24/7 operation.  Company DescriptionFrom drilling to completions to production, Great Plains Oilfield  Rental delivers premium services such as air drilling, mud  service delivery, water transfer, rental services and equipment,  and professionally trained crews for every project. Formed  in December of 2006 to supply drilling companies with field  equipment, Great Plains has quickly earned a reputation in  the industry as having a strong work ethic that matches their  selection of rental materials. Great Plains has field offices in Ohio,  Oklahoma and Texas. We have the ability and capacity to operate  anywhere in North America.  Apply"}