{"jobID": "2705314660", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Infrastructure Engineer", "companyRating": "4.9", "companyInfo": {"Website": "www.entelo.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": " Entelo is transforming the way companies hire. We leverage big data and predictive analytics to make recruiting better for candidates and recruiters alike. In 2017, we were thrilled to be named one of Glassdoors Best Places to Work!  Entelo is looking to bring on a Infrastructure Engineer to join our team. You will define, build, deploy, and evolve automation and infrastructure for supporting our development and product environments in the cloud.  Youre passionate about DevOps and the associated technologies. As our third DevOps Engineer, you will be working with world class engineering and production operations teams to scale up our environment. Youll develop and maintain tools and practices to support the integration of our backend services. Youll work closely with various developers in supporting new services as well as being the operations expert and development engineer that launches and maintains our services in a production environment. This is an opportunity to enhance your career in a critical role supporting our platform.\" What youll be doing:Plan, configure and build new infrastructure to cope with increasing user traffic and data analysisDevelop and implement new deployment strategies to cope with increasing team size and deployment frequencyBuild, deliver and automate various services using industry standard CI/CD tools like Solano or Jenkins.Research, evaluate and develop relevant automating and deploying tools and methods.Work with developers and product teams to develop performance testing strategy and define performance/scalability metrics and scenarios.Experience developing and deploying best practices, driving change from within.Have an eye towards security in the work that you performDemonstrate knowledge of most of the following: monitoring, alerts, logging, build/deploy, service discovery, load detection, self-healing, auto-testing, cloud security.You background:2+ years experience working in DevOpsExtensive experience with AWSConfiguration management. (We use Chef and Terraform)Database technologies like Postgres, MySQL, ElasticSearch, DynamoDB, etcSolid understanding of network protocols, design and operationsExperience with containerization (Docker, Kubernetes, etc)Continuous Integration tools like Jenkins, Solano, etcBonus Points:KubernetesKafka & SparkSecurity / ComplianceExperience writing web apps, we use RubySOC2 At Entelo, perks mean so much more than free lunches and unlimited PTO (although we provide both!). Were committed to helping Entelopes grow; we offer opportunities for professional development and a generous learning and development stipend. Entelo is also committed to the community; we partner with impactful non-profits, volunteer regularly, and provide a charitable match. We perform at a high level while respecting our teammates lives outside of work.  We celebrate diversity and welcome all qualified applicants regardless of race, religion, sex, age, national origin, sexual orientation, disability, veteran status, genetic information or criminal history. Weve taken the White House Equal Pay Pledge and are committed to maintaining a welcoming and equitable environment."}