{"jobID": "2832040445", "jobLocation": "Chicago_IL", "jobTitle": "Associate Manager, Data Science", "companyRating": null, "companyInfo": {"Website": "www.nielsen.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NLSN) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Associate Manager, Data Science - 22981 Data Science - USA Chicago, Illinois The Associate Manager will manage our business as usual workflow and lead multiple implementation projects to engineer our data pipeline and design insightful analytics for Nielsen’s TV Products. Responsible for analyses to resolve issues and serve as liaison for internal teams with regards to client concerns and research.Job Responsibilities:Consulting with internal and external clients to provide expert technical consultation and analysis to solve complex custom requests, enhancement testing, client inquiries, impact analysis, standards and best practices.Assists in rolling out new or enhanced services.Provides local knowledge answering questions to GBS and PL functions.\\Ensures Data Science services are delivered to the highest quality standards.Gathers client requirements from commercial teams and Product Leadership.Compiles and delivers documentation material such as power point slides for methodology questions and/or frequently asked questions.Works across teams to provide a professional, clear response to all client inquiries.Leads team projects and staff meetings.Training others on our databases and systems, efficient methods for extraction and analysis, and Data Science best practices. Create and maintain Data requirement documents and training materials.Learn and become an expert in TV Nielsen knowledge, with a focus on the data model, weighting, computations, and enhanced methodologies.Manage a team of data scientists with varying level of experience and assist them with performance coaching and career growth.Learn and become an expert in how big data flows through Nielsen systems in order to create reliable data views that will feed into client inquiry processes.Work with cross-functional teams to implement and validate enhanced audience measurement methodologies.AppDev teams to validate production implementations of complex methodology and engineer our internal data model.Collaboratively create and manage projects from beginning to end; including developing analytical plan, running analyses, and summarizing results while effectively managing expectations with key stakeholders.Respond to client inquiries: Examine analysis specifications for completeness, determine how to execute the analysis with available data, modify specifications as needed, provide an estimated delivery date, and accurately deliver analyses on time with a summary of the key insights.Provide oversight and consultation to Data Scientists and Analysts.Convert existing SAS or C code to Python code and perform quality tests.Independently write custom Python code.Detect and address quality escapes.Pro-actively gather information, as needed, to work independently as well as in a team environment.Key tasks include – but are not limited to – data integration, automation, examining large volumes of data, identifying trends and being able to understand the methodology to be able to explain said trends, and identifying methodological and process improvements. Other project areas may include representation/sampling, bias reduction, and indirect estimation.Job Requirements:Master’s degree in Data Science, Analytics, Statistics, Economics, Social Science, Operation Research, Mathematics, or Computer Science with outstanding analytical expertise. (Bachelor’s degree might be considered for candidates with exceptional and relevant experience.)5 - 7 years of experience and demonstrated domain expertise with one or more of the following: data manipulation, data engineering, data integration, weighting, sampling, survey or market research, trend or pattern recognition, statistics, data aggregation, data fusion, process automation, operations management, project management, or quality assurance.Must be proficient with Python and SQL. Excellent technical documentation skills are also expected.Must have ability to autonomously manage simultaneous projects and team workflow in a fast paced business environment.Must have experience working with big data, algorithms, and large-scale databases.Accuracy and attention to detail.Must have passion for data. Ability to manipulate, analyze, interpret large data sources, and tell a story from data through analysesMust have strong and clear verbal and written communication skills.Must have an aptitude for leadershipMust have critical thinking skills necessary to evaluate results in order to make decisionsMust demonstrate intellectual curiosity and persistence to find answers. Learn quickly and explain complex data models and methodologies to a variety of audiences.Demonstrate interest in Nielsen methodologies, data collection, platforms, research processes and operations.Preferred experience with data visualization tools (e.g. Tableau, Spotfire, Quicksight, Zoomdata)Preferred proficiency in Unix or Linux environmentPreferred experience with Databricks, Spark, Scala.About Nielsen: Nielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.  By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P; 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location: Chicago,Illinois Secondary Locations: FL - Tampa - Oldsmar, , , Travel: Yes, 5% of the Time"}