{"jobID": "2823084123", "jobLocation": "Midland_MI", "jobTitle": "Medical Office Coord RN", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "27", "jobDescription": "Position InformationCASUAL TEMPORARYExempt: NoDay Shift: CasualWeekend & Holiday Rotation: Per schedulePay Grade: 13Position SummaryThis position will be the primary resource person to the team members in regard to clinical questions, training opportunities, staffing and equipment/instrumentation for the UMHS practices. This position will also serve as the first link of communication to the physicians. This position provides daily direction, oversight and problem solving for the Uro Gynecology and Gyn Oncology practices. She will be the liaison between the UMHS physicians, patients and patient family members.ResponsibilitiesESSENTIAL:(25%) Performs clerical and clinical duties as needed including front desk coverage, triaging patient calls, surgery scheduling and coordination with UMHS for other services. Assess patients as appropriate and serve as a liaison between the provider and patient.(25%) Handle day-to-day clerical and clinical operations in the practice and utilize critical thinking skills to resolve issues.(25%) Interacts positively with patients and families in an ongoing way. Provides information to patients so they may fully utilize and benefit from MPG services and the services of MidMichigan Health in collaboration with UMHS.(25%) Assures compliance with, and may provide input into the development of various policies and procedures of the individual practice, MidMichigan Physicians Group and MidMichigan Health.QualificationsEDUCATION:Essential:* Associates Degree* NursingCREDENTIALS:Essential:* Basic Life Support* Registered Nurse * State of Michigan LicensureCREDENTIAL EQUIVALENT EXPERIENCE: Essential:* BLS required within one month of hire or transfer date. OTHER DUTIES AND RESPONSIBILITIES:Demonstrates critical thinking and integration of theory to practice for Uro Gynecology and Gyn Oncology patients.Provides for the age specific needs of the population served according to department standards and policies/procedures as evidenced by observation, documentation and peer feedback.Maintains medical supplies to assure consistent supply levels to meet the needs of the patients.Understands necessary computer functions in the office setting: Misys, Wellness, LIS, Emageon, Dictation systems, and any other necessary programs to assist providers and staff.Room patients during office visits and perform and record all vital signs on patient. Assess physical as well as social needs of the patient. Verify patient demographic information and maintain clinical documentation as outlines in MPG policies and procedures.Provides teaching to patients and staff on subjects related to Uro Gynecology and Gyn Oncology patients.Management of the Uro Gynecology and Gyn Oncology patients with symptoms management. Calls in prescriptions and teaches the patient and family the reasons for the medications and side effects.Coordinates and ensure continuity of care with other providers including patient admits and transfers to the hospital.Must be a graduate of an approved RN nursing program.Serve as a resource to technical, clerical and medical staff.Assists Practice Manager with performance review of clinical staff and conducts follow up as appropriate.All other duties as assigned by the Practice Manager.MidMichigan Health is a technology driven organization and employees need to demonstrate competency in Microsoft® Windows. An employee may be required to participate in further learning opportunities offered by MidMichigan Health.Physical/Mental Requirements and Working ConditionsIs frequently required to physically aide patients, including lifting a minimum of 50 lbs.Overall dexterity is required including handling, reaching, grasping, fingering and feeling.Ability to handle multiple tasks, get along with others, work independently, regular and predictable attendance and ability to stay awake.Must follow MidMichigan Health bloodborne pathogen and TB testing as required.Overall vision is necessary, including peripheral vision, depth perception, reading, and close-up work.Regularly exposed to situations such as trauma, grief, and death, public contact, and decision-making; must have a high level of concentration.Hearing and speech on the phone as well as in person are necessary.Must be able to communicate verbally in person, on the phone and in writing.Must be able to freely move around the officeFrequently exposed to blood borne pathogens and other potentially infectious material.Must be able to work in a latex environmentApply!"}