{"jobID": "2826205004", "jobLocation": "Placerville_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.edcoe.org", "Headquarters": "Placerville, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analyst Employer: El Dorado County Office of Education Date Posted:6/22/2018Contact: Greg Kiner 530 295-2242 Number Openings: (At time of posting) 1Length of Work Year: 8 hrs/day, 261 days/year, 12 month/year Employment Type: Full Time Application Deadline: 7/16/2018 5:00 PM Pacific Salary: $4,892 - $6,244 Monthly Date Posted:6/22/2018 Application Deadline:7/16/2018 5:00 PM Pacific Employment Type:Full Time Length of Work Year: 8 hrs/day, 261 days/year, 12 month/year Salary:  $4,892 - $6,244 Monthly Number Openings: (At time of posting)  1 Contact: Greg Kiner Email: gkiner@edcoe.org Phone: 530 295-2242 Mandatory Testing Date: July 19, 2018 at 9:00 a.m. Mandatory Testing Date: July 19, 2018 at 9:00 a.m. Job Description / Essential Elements: Click Here to View  Requirements for Applying  This is an internal applicant only posting to create an eligibility list. The eligibility list will be active for a period of six months and will be utilized to fill current and future vacancies in this classification.Our current vacancy is in our SELPA departmentUnder general supervision, collect, manage and report data; coordinate, train, provide ongoing support related to school information systems; troubleshoot problems with the above systems; resolve reports and data issues; provide software quality assurance by testing new or modified systems and to perform other related accounting duties as assigned. Provide expert and advisory guidance to county and LEA staff in the use of integrated school systems and supports staff in maintaining the accuracy and reliability of the systems.  Job Requirements - Qualifications:Experience: Experience in data/systems management, accounting and/or budgeting. Work experience in an educational setting and with student information systems is preferred.Education: Two years of higher education including course work in information systems, data processing, data management, accounting, business administration or related field. Four years of experience may be substituted for one year of education.Please include the following documents along with a completed application: Copy of Transcript (Or proof of years of experience)Letter of IntroductionLetter(s) of Recommendation (2 Current Letters - Within the last two years)Resume Requirements for Applying  This is an internal applicant only posting to create an eligibility list. The eligibility list will be active for a period of six months and will be utilized to fill current and future vacancies in this classification.Our current vacancy is in our SELPA departmentUnder general supervision, collect, manage and report data; coordinate, train, provide ongoing support related to school information systems; troubleshoot problems with the above systems; resolve reports and data issues; provide software quality assurance by testing new or modified systems and to perform other related accounting duties as assigned. Provide expert and advisory guidance to county and LEA staff in the use of integrated school systems and supports staff in maintaining the accuracy and reliability of the systems.  Job Requirements - Qualifications:Experience: Experience in data/systems management, accounting and/or budgeting. Work experience in an educational setting and with student information systems is preferred.Education: Two years of higher education including course work in information systems, data processing, data management, accounting, business administration or related field. Four years of experience may be substituted for one year of education.Please include the following documents along with a completed application: Copy of Transcript (Or proof of years of experience)Letter of IntroductionLetter(s) of Recommendation (2 Current Letters - Within the last two years)Resume The County Board of Education and Superintendent are committed to provide El Dorado County Office of Education employees, interns, volunteers, and job applicants a safe, positive environment where they are assured of full and equal employment access and opportunities, protection from harassment or intimidation, and freedom from any fear of reprisal or retribution for asserting their employment rights in accordance with law. This policy shall apply to all EDCOE employees and, to the extent required by law, to interns, volunteers, and job applicants.No employee shall be discriminated against or harassed by any coworker, supervisor, manager, or other person with whom the employee comes in contact in the course of employment, on the basis of the employee's, actual or perceived, race, color, age, religious creed, ancestry, national origin, ethnic group identification, marital, pregnancy, physical or mental disability, medical condition, genetic information, military and veteran status, gender, gender identity, gender expression, sex, sexual orientation; or the perception of one or more of such characteristics; or association with a person or group with one or more of these actual or perceived characteristics.The following person is designated as the Title IX Coordinator: Executive Director of Personnel Services 6767 Green Valley Road Placerville, California 95667 (530) 295-2219 APPLY (CURRENT EMPLOYEES ONLY) APPLY Back To Search Results PageSDL2017"}