{"jobID": "2350612693", "jobLocation": "Los_Angeles_CA", "jobTitle": "Computer Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "137000", "jobDescription": "Information Sciences Institute (ISI), a unit of the USC Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. USC operates one of the world's largest academic high-performance computing clusters. ISI has two research campuses: one in Marina del Rey, CA, and one in Arlington, VA. This position is located in Arlington, VA. Information Sciences Institute seeks applicants for a computer scientist position.  JOB ACCOUNTABILITIES: Play a key role within a small distributed project team carrying out cyber-security research focused on the public attribution of malicious individuals engaged in nefarious cyber activities.Apply technical and domain specific knowledge to design, develop, implement, and participate in test and evaluation of a software system that creates publicly releasable narratives informed by data collected using sensitive sources and methods.Applies computer science principles and concepts in planning, coordinating and executing research objectivesProvide research support on problems of diverse scopeExecute research projects in collaboration with othersQualified candidates for this position must be willing and eligible to apply for TS/SCI clearance and access. According to U.S. Government regulations, ONLY U.S. Citizens are eligible for a security clearance. Current TS clearance is a plus. Minimum Education: Master's degree, Combined experience/education as substitute for minimum education  Minimum Experience: 3 years  Minimum Field of Expertise: Knowledge of research processes and computer science."}