{"jobID": "2823120085", "jobLocation": "Troy_MI", "jobTitle": "Android/Linux Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.logicsolutions.com", "Headquarters": "Ann Arbor, MI", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": " Logic Solutions is a full-service development firm headquartered in Ann Arbor, MI with 4 additional offices around the world. Founded in 1995, Logic offers website design and programming, eCommerce solutions, customized web and mobile applications, and application integration services that span the software development lifecycle.  Logic is seeking an experienced Southeast Michigan-based Android/Linus Engineer for Internet of Things (IoT) and automotive. We are looking for a hard-working individual who can work in a fast-paced environment. Requirements:Bachelor’s degree is required. Master’s degree is a plus.2-5 years of relevant work experience.Strong understanding of overall Android Architecture, Android Eco system, framework components, android development & debugging tools, Android Linux OS & google certification like CTS, VTS, GTS etc.Expertise in key Android framework components.Experience in real-time embedded operation systems. Strong debugging skills in real-time embedded environment and Linux/Android driver and supplicant is preferred.Familiarity with Qualcomm platform is preferred.Familiarity with QNX and Hypervisor is preferred. This is a full-time position. This is a salaried position with compensation based on experience and skill level. Benefits include medical, insurance, 401(k), paid time off (vacation, holidays, and sick days) and a professional work environment. Logic offers equal opportunities to all people. We would like to thank all applicants for expressing interest; however, only those selected for interviews will be contacted. Reference checks may be conducted with your permission."}