{"jobID": "2786922654", "jobLocation": "Austin_TX", "jobTitle": "Product Manager, Data Platform", "companyRating": "3.7", "companyInfo": {"Website": "www.trendkite.com", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Meltwater, Business Wire, Cision"}, "estimatedSalary": "106000", "jobDescription": "What we do:TrendKite is transforming the way the world views earned media - and were making life better for PR professionals in the process. Our platform harnesses big data and analytics to easily measure the impact news coverage has on a brands reputation, website traffic, and business goals. As a venture backed, high traction startup, were disrupting a huge existing market while helping companies like Nike, Google, Delta, SXSW and hundreds more turn PR coverage into real business impact.Our Culture:The TrendKite team is smart, passionate, and loves the hands-on hard work it takes to build a great company. As a company, we work hard, play hard, and do everything we can to make our customers wildly successful. We're a motivated group with a passion for start-ups and the wild but rewarding ride they entail. Enjoy doing stuff outside of the office? Us too! We celebrate our successes outside of work and take care of our people with solid benefits.Data in all its glorious forms is the fundamental ingredient in our product. You will help convert our sustainably sourced data into delectable insights that power the TrendKite AI Media Engine. Do you realize that graphs are not charts? Do you know that ontology has nothing to do with cancer? Then this may be the role for you.Here's what you'll do: Work in a collaborative, dynamic environment with a team of smart, passionate developers and product managersRapidly iterate on a search and analytics SaaS product with a quickly growing user baseWork with data scientists and knowledge engineering teams to perform data experiments that find new ways to support customer use casesExecute on the data platform roadmap, taking full ownership from discovery, definition, development, care and feeding through end of lifeEnsure the farm-to-table quality, comprehensiveness and accuracy of billions of rows of dataHere's what we're looking for:2+ years experience in product management of data-powered productsYou have a passion for data, coupled with an understanding of how/why data can be valuable to businessYou're a generalist who can either answer any product question off the top of your head or knows where to quickly go to find the answersYou have some experience with programming or SQLStrong interpersonal skills to teach co-workers, collaborate with developers, learn from customers and align with partnersYou thrive in a fast-paced, unstructured and dynamic environmentYou have the curiosity, humility, and intellectual energy to constantly extend your knowledgeYou love helping others achieve their goalsUS Citizen or Permanent Resident (We will not sponsor at this time)Bonus points if you have:Experience as a user or product manager of analytics software and large scale data setsThis job is located in our HQ office in downtown Austin, TX.TrendKite is proud to be an equal opportunity employer, seeking to create a welcoming and diverse environment. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}