{"jobID": "2807327836", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " Genuent is hiring a Data Scientist for our direct client in Houston, TX. Qualified candidates should send their resume (Word format) to Nate Ackerman at nackerman@genuent.net. **Per our client's specifications, candidates are required to be hourly W2 employees with our firm. US Citizens, Green Card holders and all other parties authorized to work in the US are encouraged to apply. We are unable to provide H1 visa sponsorship at this time.*** Data Scientist Houston, TX  6+ month contract JOB SUMMARY Our client applies advanced analytics and modeling to address challenging business problems. Within their Texas mass markets retail business, they aim to promote customized offerings: the right product offered through the right channel, with the right message at the right time for each current or prospective customer. To accomplish this, they leverage their data via predictive modeling, statistical analyses, and optimization. If you love data, programming, creative problem solving, and communicating results, you will fit right in.  Have you done any interesting analytics projects for fun? We would love to see them!  Essential Duties/Responsibilities: Apply statistical modeling or machine learning algorithms to optimize marketing efforts with respect to customer acquisition, retention, and attrition  Use cutting edge Hadoop technologies to glean customer insights from mountains of data  Work with the marketing team to plan and analyze A/B tests  Analyze the effects of various marketing levers  Help executives monitor the pulse of the business by automating reports of key performance indicators  Develop useful visualizations  Translate, communicate, and present results and recommendations to a non-technical audience Qualifications: Education: Bachelors degree in Statistics, Computer Science, Economics, Engineering, Mathematics, or Operations Research required  Advanced Degree (MS or PhD) in a quantitative field is strongly preferred, such as Statistics, Computer Science, Economics, Engineering, Mathematics, or Operations Research  Experience: 0-5 years of experience in statistical modeling and quantitative analysis in industry or full time academic research  Kaggle competition experience a plus  Technical Skills: Statistical modeling and analysis skills  Strong general programming skills  Proficiency with R, SAS, or Python  Strong SQL skills / understanding of relational databases  Experience with Excel  Additional Knowledge, Skills and Abilities: Ability to translate complex business issues into achievable analytical learning objectives and actionable analytic projects  Solid understanding of the use and interpretation of graduate level multivariate statistical techniques and sampling methods, such as multi-variants regression, ANOVA, factor analysis, cluster analysis, and principal components analysis  Ability to interpret complex analytic results and develop practical business implications  Understanding of the utility business, to include service process, market structure/pricing and competitive environment  Good communication skills  Keen attention to detail  Ability to work as a team member in a fast paced environment  Think critically about analyses to ensure the conclusions make sense before sharin"}