{"jobID": "2793512052", "jobLocation": "Chicago_IL", "jobTitle": "Systems Engineer, Data Services", "companyRating": "4.5", "companyInfo": {"Website": "www.powerreviews.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Bazaarvoice, Yotpo, TurnTo"}, "estimatedSalary": "60000", "jobDescription": " At PowerReviews, we believe a house must be built on solid foundations - if its to last. Systems Engineers embrace this credo by ensuring our database systems are solid from the ground up. As a Systems Engineer on Data Services, you will support technologies that power interactive and trusted shopping experiences for thousands of major brands and retailers. You will maintain our database systems for performance, reliability, and 24/7 availability. You will be responsible for handling various database requests as well as helping build out new tools to monitor, troubleshoot and automate our database systems. You will work with a talented team of product designers, software engineers, and data scientists to ensure database services are easy to use and reliable.  The Data Services team combines software development, devops, and database administration expertise to build and run and ever changing database workloads in Amazon Web Services(AWS). This position ensures our mission critical databases are available 24/7. You will be hands on with the most advanced technologies and be given opportunities to introduce new ideas that help our team members and customers. Responsibilities:Safely analyze and execute direct data operations in production environments.Interact with customer support and implementation engineers to resolve time critical database requestsPerform operational DBA duties in a fast, complex environment - this will include patching, environment refreshes/cloning, database/application upgrades, user/password management, and implementing backup and monitoring procedures.Engineer and automate database infrastructure to ensure performance and reliabilityAssist in the design and adoption of new database and infrastructure technologies.Improve processes related to the requests and software releases that drive our business.Shared on-call rotation responsibilities.Qualifications Minimum Qualifications: Working SQL knowledgeSome coding experience (e.g. Java, Python, Ruby or Shell scripting )Exposure to relational databases (e.g. PostgreSQL, MySQL, Oracle, etc)Intermediate experience in Linux systems and networkingExperience in a high volume, transactional internet-facing environmentExposure with troubleshooting techniques and the ability to analyze and resolve difficult technical issues quickly in production environments.Experience in configuration management tools using Puppet, Chef, or AnsibleExperience with cloud computing technologies like Amazon Web Services(AWS) or Azure, Google Cloud Platform(GCP)Familiarity with cloud provisioning tools like Cloudformation or TerraformFamiliarity with non-relational databases (e.g Elasticsearch, Neo4j, DynamoDB, Redis)Our Tech Stack At PowerReviews we use lots of open source software and use Amazon Web Services (almost) exclusively. Our current stack consists of Linux, Java, Jenkins, Spring-Boot, Nginx, PostgreSQL, Neo4J Graph DB, ElasticSearch, React.js, Docker, and some Ruby on Rails. In AWS we make use of EC2, DynamoDB, RDS, Redshift, S3, Elasticache (both Redis and Memcached), Elastic Map Reduce, Lambda and Cloudfront. Other stuff we use includes Sumologic, Datadog, Selenium, and Packer."}