{"jobID": "2696698210", "jobLocation": "San_Francisco_CA", "jobTitle": "XD Visual Design Lead", "companyRating": "3.2", "companyInfo": {"Website": "www.fuseproject.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "The Position: fuseproject is looking for a Visual Design Lead in our (Digital) Experience Design team, who is creative, passionate, and unwilling to compromise their drive to create stunning and engaging designed experiences that make a difference to our clients, their brand, and their customers.  We are looking for a true student and connoisseur of design, not bound by the constraints of traditional digital thinking nor the expected design patterns and trends that drive the industry. You must lead by example, roll up your sleeves, and love the chaotic and rewarding nature of a design challenge. You should both engage clients you work with and inspire the team working with you. You should be a hybrid in your thinking, your skillset, and your approach. And like all of us, have willingness and desire to learn every day and see the world through many lenses - always challenging your own assumptions, those around you and willingly step into the unknown.  You are comfortable interacting with and presenting to clients, and are able to identify strategic opportunities where design can make a difference. You establish design directions that inspire and infuse projects with deeper meaning and authentic stories. And as a skilled communicator, you are also highly organized and have experience in collaborating with a wider creative team. You should be able to transfer your knowledge and skills to your team and besides being opinionated; balance that with being an amazing team player.  You should be skilled in the usual set of design tools, and additional hybrid skillsets are preferred. From sketching, illustrating, motion graphics, 3D software, prototyping and understanding of code & emerging technology platforms. Your ability to translate early stage ideas into quick, hi-fidelity concepts is expected and encouraged. And as a seasoned and fine-tuned weapon of design, you should bring with you a fine eye and appreciation for some structure, intelligent planning and efficiency. You should have an opinion on methodology and practice and weigh into better ways of working without sacrificing the random and often unexpected nature of the design process.  We expect you have curated your work into an impressive portfolio that shows ideas, stories and compelling digital products and platforms. We are looking for a Designer that will bring new creative energy to the table with designs that are refined, considered, current and forward thinking. Job Details & Skills:Embrace and advocate for hands-on craft, aiming to ideate, concept and deliver work class designAssist in building a visual design team centered around craft, aesthetic, concept and executionAbility to articulate complex solutions clearlyQuick-thinking, personable, flexibleAbility to span the spectrum from vision, storytelling, and concepting to deep systematic detail design executionWork closely with the Director of XD to help guide and lead the teamA strong communicator, influencer and cross-functional partner that is able to present solutions; clearly articulate experience design principles and methodology that informs the workCollaborative, inclusive and flexible team member who can successfully work across disciplines with various stakeholder groups, both within fuseproject and across client organizationsAble to produce results both independently and collaboratively as a team member and mentor othersExperienced in designing large and complex organizations of content and features, as well as complicated user flows, and taxonomies for complete product development lifecycles of web and/or software applicationsA design advocate and a strong employer of human-centered design practices that knows how to interpret data to make informed design decisionsExperienced with shipping and launching multiple products while having the ability to work within a high demand, fast-paced teamOversee design tracks all the way through executionAct as mentor for the visual design teamContribute to the development of digital, interactive, UI and other strategiesAct as a strategic leader on projects and help drive the collaborative efforts of the projects creative, user experience, industrial design and technology teams, and drive teams to exceed expectations on all levelsRepresent fuseproject culture and standards both within the company and to our clients, who are as passionate and excited about their work as we want users to beSolid understanding of systems thinking and integrated holistic thinking including ecosystemsPlay a key role in the preparation, delivery and presentation to clientsUnderstanding a clients business and communication goals, and translating them into unique creative solutionsSet an example - find new stimulus to disrupt your thinking, develop new interests, travel. Do what you must to stay curiousDevelop yourself and constantly stretch the offering of the studio and push individual skills setsSupport of user research activities such as planning, observations, interviews and synthesisMaterial involvement in the development of use case scenarios and experience frameworksEnsure rationale behind design decisions and happily discuss the validation and thinking behind these decisionsTight integration with developers to optimize designs for implementationEnsure design decisions are informed by a necessary amount of in-depth technology researchAlways ensure that deadlines and requested deliverables are met to the highest level of quality, both for internal reviews and external presentationsExpert knowledge of graphic design, typography, interaction design, user-centered experience design, brand development, digital product design and the creative processExcellent presentation skills and communication abilities at all levels of both internal and client organizations. We want someone who can back up our stunning work clearly and confidentlyComprehensive awareness and love of new platforms, technologies, and trends for the digital channel and related mediumsStrong ability to prioritize work and resources across engagements based on short and long-term needsMeticulous and obsessively detail orientedSelf-motivation, excellent communication, an open mind, the ability to thrive in multidisciplinary teams, and the skills to balance great design with short deadlinesBackground & Experience:8+ years experience in a design role4+ years experience in a design leadership roleInternational experience is a benefitNext steps: Qualified candidates must present an online portfolio that: Exhibits stylistic breadth, attention to detail, and balances beauty, innovation and usabilityDemonstrates a passion for digital product developmentShows experience with diverse content and subject matterProves ability to translate high level ideas into unique visual styles and directions, and breaking those down to their individual componentsA portfolio is an essential piece of any application for a Design role. Applicants who do not supply a link or PDF with samples of their work will unfortunately not be considered"}