{"jobID": "2802918005", "jobLocation": "Los_Angeles_CA", "jobTitle": "Product Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.grindr.com", "Headquarters": "West Hollywood, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Why work at Grindr? Since 2009, Grindr has built the worlds largest social network for gay, bi, trans, and queer people. Now more than just an app, were a family of lifestyle brands with the shared mission to connect LGBTQ people with the world around them: Grindr The location-based social app that started it all. Over 3 million people use Grindr daily, from every country on the planet.INTO A digital magazine dedicated to queer perspectives: news, culture, commentary, video, and more.Grindr for Equality (G4E) Our social mission to promote justice, health, and safety for LGBTQ individuals around the globe.Gaymoji A one-of-a-kind collection of over 500+ stickers available on iOS, Android, and in the Grindr app.Slumbr An event series for the high-minded partygoer, combining fashion, music, and art. Behind the brands, Grindr is an inclusive and passionate family of thinkers, innovators, leaders, and most importantly, doers. Were fueled by endless curiosity, constant collaboration, and a knack for crossing every finish line all within an agile growth environment. We also enjoy tons of perks, great social events, and stunning views from our HQ in West Hollywood. Summary Grindr is seeking an experienced, outgoing and confident Data Analyst to join our Product Team. The leader in this data-intensive role will focus on in-app user behavior and partner with our Product Owners, Product Designers and Data Scientists/Engineers to analyze our users (behavioral, quantitative, qualitative, regional, free, subscriber, etc.) in order to measure results, identify problems, surface opportunities, cultivate insights, inform decisions and support recommendations. This leader is also responsible for reporting on the health and efficacy of both existing & new products during their lifecycle via creation, measurement, and analysis of product KPIs. ResponsibilitiesFind, pull, crunch, and interpret large amounts of historical and predictive data from a variety of sources to develop insights, make recommendations and answer key business questions.Track both general and specific business activity and provide clear, compelling reports and presentations on a regular basis.Provide expert knowledge and recommendations internally and externally on digital media measurement and analytic reporting using common industry platforms and tools.Integrate market research data with customer data to create stories and viewpoints that support sales opportunities and client business objectives.Partner with product teams to support analytical product development and innovative new features.Help identify new feature development opportunities (regional and/or global)Measure performance and efficacy of existing featuresRecommend methods of monetization and identify opportunities to drive user engagementImprove the overall user experience (efficiency, funnels, flows)Identify new ways to grow existing Daily Active Users (free & paid)Identify new ways to monetize products and grow advertising and subscription revenueIdentify ways to improve app response time and performanceHelp optimize user flows and conversion funnelsPerform competitive analysis and design effective qualitative surveysDesign, implement and analyze A/B tests and test user hypothesesRequirementsProven experience with native mobile apps on both Android and iOS required3-4 years experience in sales/marketing analytics capacity, within e-commerce, digital advertising or media buying organizations a plus3-4 years experience in data visualization platforms (Tableau, Looker, Periscope, etc.)Highly proficient with SQL or other data manipulation languagesAdvanced skill level using ExcelExperience with cloud data extraction/manipulation (S3, AWS platforms)Passion for facilitating internal and external customer satisfactionAbility to thrive in a demanding environment while prioritizing multiple tasks and meeting tight deadlinesOutstanding communication skills, both written and verbal with a focus on qualityEqually capable working as part of a team or independentlyCurious nature, filled with initiative, addicted to follow-throughFamiliar with Agile team methodologies and ceremoniesExperience with metrics and marketing platforms like Apptimize, Localytics, AppBoy, Google Analytics, Fabric/CrashlyticsBenefits & Perks100% covered medical, dental and vision insuranceGenerous Parental LeaveUnlimited sick policyCompetitive Salaries401(k)Catered lunch, every dayStocked kitchenFree on-site parkingCasual dress environmentGrindr is an equal opportunity employer *Recruiting firms that submit resumes to Grindr without first entering into a written contract will not be entitled to any compensation on candidates referred by that firm."}