{"jobID": "2767654836", "jobLocation": "Washington_DC", "jobTitle": "Senior Consultant, Environmental Business Analyst", "companyRating": "4.4", "companyInfo": {"Website": "www.morganfranklin.com", "Headquarters": "Mc Lean, VA", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "Why Work Here? One word: opportunity. Our professionals embrace our \"Own Your Career\" philosophy sustained growth means creating new opportunities for experienced consultants at all levels of our organization.  Learn what it means to truly own your career and be a part of a growing organization with a big, bold future. What Will You Do?As a Senior Consultant, you will provide a full range of services that will utilize your educational background, experience, and organizational skills while serving the firm's dynamic public sector client base.Support problem solving and fact finding, while working side by side with experienced team members.Lead workstreams involving technical accounting and reporting support, audit readiness, and environmental compliance services.Prepare presentations, briefings, and be actively involved in client meetings and day-to-day interactions.Train personnel on improved processes and conduct performance reviews of staff.You will assist in the areas of financial management and accounting operations, internal control management, audit readiness support, and environmental cost estimate support services. This role will also play a key role in program management support for external financial audits, researching new accounting pronouncements and environmental regulations, and identifying opportunities for overall operational efficiency improvement. Typical activities include the following:Prepare supportable estimate packages for environmental cleanup efforts.Prepare NFR and CAP responses on behalf of the client and monitor CAP implementation, testing, and close-out with relevant stakeholders.Perform analysis of business processes and internal controls to identify risks.Liaise between client and auditor.Document work completed by preparing workpapers.Provide suggestions to management leaders and external clients to improve client internal controls, accounting procedures, environmental and disposal estimates, and financial statements.Maintain relationships and communicate with key client personnel to understand business operations, processes, and functions.Prepare presentations and briefings, and actively participate in client meetings and day-to-day interactions.What Do You Need to Succeed?Minimum QualificationsActive DoD Secret security clearance.Bachelor's degree in Accounting, Finance, Information Technology, Business Management, or Environmental Engineering.4+ years of experience with Department of Defense (DoD) audit readiness and/or federal financial management experience.Experience with Financial Improvement Audit Readiness (FIAR), United States Standard General Ledger (USSGL), OMB A-123, CFO Act, FMFIA, FFMIA, GAGAS (Yellow Book), and OMB Circulars.Professional services experience and/or experience supporting public sector clients.Experience with Environmental and Disposal Liabilities.Experience developing and/or reviewing environmental cost estimates.Willingness to travel up to 25% of the time.Preferred QualificationsMasters degree in Accounting, Finance, Information Technology, Business Management, or Environmental Engineering OR one or more of the following certifications: CPA, PMP, CGFM, CDFM, or CISA."}