{"jobID": "2738746072", "jobLocation": "Davis_CA", "jobTitle": "Scientist, Fungal Molecular Biology", "companyRating": null, "companyInfo": {"Website": "www.adm.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (ADM) ", "Industry": " Agriculture & Forestry", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " For more than a century, the people of Archer Daniels Midland Company (NYSE: ADM) have transformed crops into products that serve the vital needs of a growing world. Today, we're one of the world's largest agricultural processors and food ingredient providers, with approximately 32,000 employees serving customers in more than 160 countries. With a global value chain that includes approximately 500 crop procurement locations, 250 ingredient manufacturing facilities, 38 innovation centers and the world's premier crop transportation network, we connect the harvest to the home, making products for food, animal feed, industrial and energy uses. Learn more at www.adm.com .  Scientist, Fungal Molecular Biology Davis, CA  ADM Research & Development  This is an exempt level position. Position Summary: We seek a molecular biologist with exceptional skills to develop filamentous fungal host strains for production of industrial enzymes. The successful candidate will be responsible for leading and contributing to research projects in collaboration with a cross-organizational team of scientists focused on generation and optimization of fungal enzyme production strains. The individual will be involved in all the steps required for industrial strain construction and testing including experimental design, vector construction, genomic transformation, genome sequence verification, small scale testing, data analysis, interpretation, reporting and follow up discussions. The individual will also be a highly motivated self-starter and able to work in a fast-paced environment on a multi-disciplinary team. Job Responsibilities:Design and engineer fungal strains using state-of-the-art methods, microbiological methods, molecular biology, molecular evolution, and other techniquesInterface and productively collaborate with members of cross-organizational research teams, research and development units, including external and academic partners, and business unitsManage or contribute to research projects including planning, strategic direction, experimental design, data analysis and interpretationMaintain laboratory documentation in accordance to required scientific, regulatory, and intellectual property requirementsPrepare scientific reports and presentations and registration documents as requiredJob Requirements:Ph.D. in Microbiology, Molecular Genetics, Biochemistry, or a related discipline with industrial biotechnology experience is required. Alternatively, a Master's degree with 4 years of industry experience or a Bachelor's degree with 10 years of industrial experience are required.Hands-on experience and extensive knowledge of fungal genetics, molecular biology, genome manipulation, and construction of filamentous fungal strains for industrial fermentation is essentialAbility to manage and guide research projects to successful outcomes.Strong affinity for lab work in industrial environments; results-oriented mind setExcellent organizational, interpersonal and communication skills.Team player and able to work in global, multidisciplinary teamsCreativity, strong problem solving and critical thinking skillsComputer skills (proficiency with MS Office, scientific software packages is expected)Experience with strain/enzyme rational or random evolution principles is a plusSDL2017"}