{"jobID": "2768210634", "jobLocation": "San_Francisco_CA", "jobTitle": "Independent Retail Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.winewarehouse.com", "Headquarters": "Commerce, CA", "Size": "501 to 1000 employees", "Founded": " 1973", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Southern Glazer's Wine & Spirits, Young's Market Company, Classic Wines of California"}, "estimatedSalary": null, "jobDescription": " Warehouse is a multi-generational, family owned and operated, wholesale distributor of fine wine, beer and spirits for California seeking an Independent Retail Sales Representative with Intermediate Product Knowledge covering the following area(s): San Francisco, CA (JR4)Position Description: Develops new prospects and maintains contact with customers to sell the companys products. Solicits and receives orders for products by phone or personally from customers or company employees, and then performs certain procedures before orders can be filled. Requires sales experience in addition to an extensive knowledge of the companys products, and marketing techniques. The position is assigned to a particular region or geographic area. Directs sales campaigns in existing and new territories with Company products visiting 8-10 customers dailyFollows the Company policies for price quotations and availability of product to customersFacilitates product sales on selected items/brands within a pre-determined period, meeting monthly and yearly sales goals and objectivesWorks in collaboration with Company supplier partners in achieving pre-determined monthly and yearly sales objectives (customer rides-with)Develops new accounts through cold-calling on prospective new customersAttend monthly team and general sales meetings, including educational seminars on new or existing productsPlans, designs, and conducts educational product presentations, such as, wine dinners to promote a new product or to present new promotional opportunities to customersReviews and is responsible for product orders, sales activities, commission reports, invoices on products ordered, monthly mileage and expense account (if applicable)Follows ABC (Alcoholic Beverage Control) regulations to be in compliancePerforms will-call activities when required: Picking up product and delivering the product to customersInvestigates customers complaints to ensure resolution of product delivery and pricing accuracyResponsible for timely response (within 24 hours) on all communications within the company or with outside business sourcesQualifications:Product knowledgeFour-year college degree or equivalentStrong business, communication and interpersonal skills.Ability to make a strong business case without over-sellingInnovative and proactiveHighly adaptable and comfortable with changeDemonstrates a commitment to doing it the right way with a high level of attention to detail and high personal standards of performanceProgressive sales experience preferably in the beverage industryExcellent command of written and spoken EnglishResiding within a 10-15 miles radius of the territory is preferablePhysical Standards: Employee must be able to walk, bend, reach, and lift, if necessary 50 pounds or more. The physical demands here are representative of those that must be met by an employee to successfully perform the essential job functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform these essential functions. Visiting an average of 8-10 accounts daily, requiring getting in and out of the vehicle, bending, stooping, and reaching.Handling will-calls: Receiving product from our warehouse and delivering the product to customer(s)Placing cases of wine in the trunk of the car removing each case from the trunk of the car and delivering it to the customer using a hand truck each case is estimated to weigh 50 pounds or more.Handling Draft Accounts. (moving kegs in cold room)Repetitive bending, kneeling, stooping, and occasional climbing required.Re-stocking existing displays with new merchandise and replenishing cold boxes from product on display, which requires work above the shoulders.Traveling to company-scheduled meetings with a minimum travel time of two (2) hours.Wearing appropriate footwear that provides comfort and support for driving, bending, stooping and climbingMust be able to hear with specific vision abilities which include close vision, distance vision, depth perception and ability to adjust focus"}