{"jobID": "2831225954", "jobLocation": "Allegan_MI", "jobTitle": "Associate Scientist / Scientist - Formulations (Solid Oral Dosage Formulations)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Perrigo Company plc, a leading global healthcare company, delivers value to its customers and consumers by providing Quality Affordable Healthcare Products®. Founded in 1887 as a packager of home remedies, Perrigo has built a unique business model that is best described as the convergence of a fast-moving consumer goods company, a high-quality pharmaceutical manufacturing organization and a world-class supply chain network.  Perrigo is the world's largest manufacturer of over-the-counter (\"OTC\") healthcare products and supplier of infant formulas for the store brand market. The Company also is a leading provider of branded OTC products throughout Europe and the U.S., as well as a leading producer of \"extended topical\" prescription drugs. Perrigo, headquartered in Ireland, sells its products primarily in North America and Europe, as well as in other markets, including Australia, Israel and China. Job Purpose: With guidance, provide support of development and commercialization activities to US Consumer Healthcare - Americas R&D; for new or reformulated Generic over-the-counter (OTC) ANDA pharmaceutical, NDA 505(b) (2) and OTC Monograph products meeting the company's First-to-File and First-to-Market strategy at a global level (U.S., Mexico & India).  Properly assimilate principles of Perrigo's Positive Workplace Policies and Code of Conduct by demonstrating and reinforcing appropriate behaviors that foster a workplace of trust, commitment, and accountability while striving towards results. Knowledge, Experience and Education:Bachelor's Degree in Pharmaceutical Sciences, Chemical Engineering or closely allied life sciences discipline with 2 or more years of relevant experience -- orMaster's Degree in Pharmaceutical Sciences, Chemical Engineering or closely allied life sciences discipline with 1 or more years of relevant experience orA Ph.D in Pharmaceutical Sciences, Chemical Engineering or closely allied life sciences discipline"}