{"jobID": "2493433096", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.udacity.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "200000", "jobDescription": "Udacity's mission is to democratize education. We're an online learning platform offering groundbreaking education in fields such as artificial intelligence, machine learning, robotics, virtual reality, and more. Focused on self-empowerment through learning, Udacity is making innovative technologies such as self-driving cars available to a global community of aspiring technologists, while also enabling learners at all levels to skill up with essentials like programming, web and app development. Udacity is looking for people to join our Data team. If you love a challenge, and truly want to make a difference in the world, read on!As a Senior Data Scientist on the Data Team at Udacity, you'll directly impact our students' lives be it by predicting students that need more help to effectively complete a course, devising strategies for effective and timely communication, or by analyzing which content is not resonating with students. Responsibilities: Guide the evolution of product using Data driven analysis.Analyze the student data and predict student engagement and churn.Understand the data architecture, improve it by proposing effective data table layouts, and write data pipelines to transform data.Improve efficiency of course and Nanodegree program content by analyzing which content works and which doesn't.Devise effective A/B tests and effectively analyze data to establish a causal impact.Optimize marketing spend by effectively segmenting studentsEstablish best practices for data science workflows, thorough analysis, and evangelize data driven decision making.Mentor data analysts and other data scientists on the team.Requirements:SQL (intermediate) - Thorough understanding of SQL JOINs, Common table expressions (window functions) to gather and aggregate data.Data munging - Ability to manipulate data effortlessly using Pandas/R.Data visualization - Ability to tell a story with data using appropriate visualizations (packages like matplotlib, ggplot2, etc.).Scripting - Python (intermediate level).ML algorithms (scikit-learn/R) - Prior experience/knowledge of machine learning algorithms such as logistic regression, SVM, k-means, random forests etc.Statistical Inference and Modeling - Thorough understanding of inferential statistics, p-values, confidence intervals, t-tests, etc.Some experience with web frameworks such as Flask/Django is preferred but not required. Our Tech Stack AWS Redshift & Postgres - Data warehousing.Airflow - Data pipelines and ETL.AWS Database Migration Service (DMS) - for ETL.Scikit-learn for ML algorithms.Docker Stacks for sharing a common dev environment.Github, Docker Hub, CircleCI, Datadog, New Relic, Airbrake, Pager Duty.We are an equal opportunity employer and value diversity at our company. Women, people of color, members of the LGBTQ community, individuals with disabilities, and veterans are strongly encouraged to apply."}