{"jobID": "2802504734", "jobLocation": "San_Francisco_CA", "jobTitle": "SMB Account Executive", "companyRating": null, "companyInfo": {"Website": "www.webgility.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As it turns out, were blowing doors off the competition and our sales team needs some help, STAT. If youre sharp and want to make an impact on a rapidly growing tech firm, run, do not walk, to apply for this position. Our products and service areliterallybest in class, and theres no better time to be a player in the e-commerce marketplace. Like a butterfly emerging from the cocoon, things are about to get real, in a good way. We are open-minded, excited to learn, analytical, and a barrel of laughs (not even kidding). If you are also awesome, not afraid to take risks, think creatively, and have a proven track record for sales or an SDR / BDR looking to break into a SaaS closing role, apply now.  Webgility the #1 back-office application for SMBs in e-commerce. We reduce effort and inefficiencies for sellers by automating their busywork and improving their operational workflows. We deliver business insights that sellers need every morning over a cup of coffee. We're headquartered in San Francisco and have a Development Center in Indore, India. Position: SMB Account Executive  The SMB Account Executive is responsible for educating and consulting with prospective customers to identify their business needs and direct them to the right Webgility solution. This position qualifies and closes new accounts. As the most client-facing member of the team, your feedback helps ensure that Webgility continually improves both products and client experiences. The ability to play nice with others is essential to this role. Responsibilities include:Selling Webgility service offerings to SMB e-commerce sellersInteracting with customers through phone, e-mail, and live chatWarm prospecting, develop and close leads across all Webgility offeringsLearning and using CRM, Prospecting, and Sales Performance toolsConstantly working to further develop sales acumen and product knowledgeand having fun in the processRequirements:Bachelor's DegreeEnjoy selling into SMB'sAbility to work in a fast-paced, high energy, high activity sales teamEligible to work in the USAAbility to work on-site in San Francisco, CA1+ year Sales in a closing roleOpen to high performing SDR / BDR folks looking to break into a SaaS closing roleSkills & Experience:Exceptional work ethic and drive to learnExperience with SalesforceResult ForecastingKnowledge of e-commerce industry would give you an advantage. Ever worked with or had an online store?What you get:Competitive OTEHealthcare - Medical, Dental, and Vision401KPre-Tax Commuter (Clipper)Best in class sales trainingImprove your discovery skillsReal World Closing EducationNavigation of a Sales CycleTo Apply:Upload your resume as a PDFCover letters are helpful understanding why you're interested joining the Webgility team"}