{"jobID": "2671824042", "jobLocation": "San_Francisco_CA", "jobTitle": "Research Scientist, Generative Adversarial Networks (GAN)", "companyRating": null, "companyInfo": {"Website": "www.autodesk.com", "Headquarters": "San Rafael, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Location: San Francisco, CA- United States  Job ID: 18WD27033 Position Overview The Design Research Group in the Office of the CTO at Autodesk is focused on discovering new, innovative experiences for designers. We have been working on a large-scale research project, trying to use machine learning and deep learning to redefine Computer-Aided Design (CAD) for people who work in the architecture, engineering and construction (AEC) industry. We believe that human-AI interaction and collaboration can create a paradigm shift for the users to design and create better results more efficiently.  Currently, we have several focused research directions, and Generative Adversarial Networks (GANs) is one of the most important. In the past year, we have looked into numerous GAN structures and applied them for different purposes, and the rich results triggered us to further investigate the potential of it, including the fundamental theories and applications, for example, generating variations, multi-representation translations, and GAN for data types other than images. Therefore, we are seeking for an expert on generative models (GANs and VAEs) who is interested in exploring this new territory with us. ResponsibilitiesResearch, invent, and implement novel machine learning algorithms and systems for generative models including GANs and VAEsWrite technical papers to top-tier conferences such as NIPS, CVPR, ICML, ICCV, ECCV, and SIGGRAPHBuild prototypes for deep-learning-assisted interactive design systems with a cross-disciplinary team, including designers, developers, researchers and internsKeep current with latest trends and technologies to help future research subjects and anticipate development needsMinimum QualificationsPh.D. in Computer Science or any other relevant disciplines with a background in Machine Learning, Deep Learning, Artificial Intelligence, and Applied MathTop-tier publication records, including but not limited to NIPS, CVPR, ICML, ICCV, ECCV, and SIGGRAPHHands-on experience in Machine Learning, Deep Learning, Artificial Intelligence, and Data Science and their frameworks, such as Tensorflow, Pytorch, and CaffeBroad and deep understanding of the rapid development of machine learning and deep learning researchAbility to quickly adapt to new situations and to learn new technologiesAbility to collaborate and communicate effectively with a multicultural local and remote teamPreferred QualificationsKnowledge of 2D and 3D computer graphics and visualization techniquesKnowledge of architectural design and/or construction is a plusInterests in Reinforcement learning is a plusExperience with HPC, GPU computing, cloud computing and parallel programming is a plus"}