{"jobID": "2803676556", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - IGN", "companyRating": "2.8", "companyInfo": {"Website": "www.j2global.com", "Headquarters": "Hollywood, CA", "Size": "1001 to 5000 employees", "Founded": " 1995", "Type": " Company - Public (JCOM) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " EasyLink, OpenText, CallWave"}, "estimatedSalary": "63000", "jobDescription": "Research Analyst IGN Entertainment (IGN.com) is seeking a Research Analyst to work in our San Francisco, CA office.  As a part of IGN’s product team, the Research Analyst (“you”) will help shape our decision making process through the compilation and presentation of analytical information and insights. You’ll primarily be working with 1st party web analytics but will also use 2nd and 3rd party data sets to fill out your understanding and provide more accurate, nuanced insights. You’ll also work closely with our product, content and sales teams to help them understand how they are tracking against their goals.  This role is suitable for those looking to get into either data science or data insight career tracks. Some travel may be required. What does that mean for responsibilities? Maintain and improve mechanisms to report regular, key analytics information to  stakeholders.  Support internal groups with their requests for information. Teach and train internal  groups on how to self-serve.  Utilize analytics, usability studies, research and qualitative feedback to provide accurate  information.  Identify opportunities to make more, actionable information available to a wider audience  internally.  Execute and possibly lead 1st party research studies. (Depending on experience)  Owning day to day relationships with some of our analytics vendors.  This is a service oriented role that will handle numerous internal requests every week.  Setting expectations and delivering on them is a key requirement. What will get you in the door? A intermediate background in various forms of data manipulation such as aggregation,  hygiene, analysis and presentation, and the various forms of math required to do so.  (Recent school experience acceptable)  Experience working with Excel and Google Sheets. Bonus points for experience with R,SQL, SPSS or business intelligence applications such as Mode or Looker.  Experience working with web analytics and digital media.  Excellent written and verbal communication skills, of course, but also the ability to distill  complex, nuanced insights into easily digestible formats for a wide variety of audiences.  Comfortable with public speaking and presenting your ideas to others.  Must be self-motivated, able to manage and prioritize workload and meet deadlines.  Attention to detail and a “measure twice, cut once” mentality.  You have a passion for games or entertainment related to the gaming audience. Here’s the good stuff about us… You’ll make an impact. We reach 150MM unique users each month. We’re big time, but  we are a small team — and we’re not afraid to give you real opportunities to make a  difference in grand, visible ways.  Gaming is the culture here. That means it’s actually fun, even when we’re not trying. We  share the same passions as our audience, and want to be here.  We value irreverence. We want you to be yourself, speak your mind, lead shenanigans,  and know that nothing here is above question.  There is value in games and entertainment. We’re the experts and we’re preparing for a  future where gaming is everywhere.  Come geek out with us, but be prepared to work as hard as you play. It’s serious business, after all.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records."}