{"jobID": "2824658896", "jobLocation": "Richardson_TX", "jobTitle": "Master Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.fossilgroup.com", "Headquarters": "Richardson, TX", "Size": "10000+ employees", "Founded": " 1984", "Type": " Company - Public (FOSL) ", "Industry": " Retail", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": "Job Title Master Data Analyst  20-Jun-2018 Your RoleThe Master Data Analyst will support operations by monitoring and analyzing master data, including certain key field data such as material, customer, and retail store attributes across Fossil’s SAP systems. This team serves as corporate experts on all master data business initiatives including (but not limited to) logistics, sales and distribution, material master, value-added services and retail stores master data by supporting data integrity across various SAP systems for the entire Fossil organization. The team also acts as the central processing unit for all business data, relationships and requirements needed for internal and external customer setup in SAP AFS. The Analyst will enable the consolidation, harmonization and distribution of master data in Fossil’s SAP systems by ensuring accuracy and continuity of data.  Roles and Essential Duties: Works closely with business stakeholders such as IT, sales, product, and retail operations departments to ensure master data operations meet all business requirementsAssists in data integrity checks and audits to ensure master data is consistent globally, meeting business needs and in compliance with policies and procedures at Fossil such as the authority to commit (ATC)Manages, analyzes and resolves business issues and revisions to best meet the internal and external customer requirements while adhering to Fossil’s standard operating proceduresCollaborates with subject matter experts (SMEs) across the organization to define and implement data governance strategies to ensure master data is consistent, secure and accurate globallyEnsures master data in all systems is aligned in order to support ongoing maintenance as needed through assuring data integrity by testing and validating in QA environmentsDocuments and updates approved best practices for all areas of responsibility as needed or determined by managementGet To Know Us Fossil Group is a global retailer specializing in the design, innovation and marketing of fashion lifestyle and accessory products. At the heart of Fossil Group's vision is a commitment to fostering creativity and delivering the best in design through its three core businesses: the Fossil brand; the Skagen brand; and a multi-brand watch portfolio business. This portfolio includes adidas, Armani Exchange, Burberry, Diesel, DKNY, Emporio Armani, Karl Lagerfeld, Marc by Marc Jacobs, Michael Kors, Michele, Relic, Tory Burch and Zodiac. Fossil Group is constantly developing its businesses through core competencies in innovative branding, world-class design and dynamic global distribution. Division Corporate Job Status Full Time Brand Name Fossil Your Skills2+ years SAP experience or equivalent2+ years previous retail industry experience highly preferredBachelor's degree in Fashion Merchandising, Marketing, Business or relevant field preferredProven ability to balance multiple projects at one time in a fast-paced environmentProficiency in Microsoft Office suite and/or Google apps (specifically Excel and/or Google Sheets)Ability to work independently and as part of a teamExcellent organization, analytical and problem-solving skillsStrong written and verbal communication skillsStrong interpersonal skills such as (but not limited to): FlexibilityPositive AttitudeRelationship BuildingTeamworkLocation TX - Corporate Accommodations Statement Fossil is an Affirmative Action and Equal Employment Opportunity Employer. We consider applicants without regard to race, sex, religion, national origin, disability or protected veteran status. Anyone requiring special accommodations to our normal application process please email applicationaccommodation@fossil.com and we will assist you. Brand Highlights Fossil is an American lifestyle brand, creatively rooted in authentic vintage and classic design. Fossil stands for the optimism and creativity at the heart of American culture. Inspired by vintage design, we take the best from the past and update it for today’s consumers. Since 1984, we have shared our quality products with our fans as we celebrate living an authentic life. As we approach our 30th anniversary, we will continue to reinvent the best of vintage culture with a modern eye. "}