{"jobID": "2661224631", "jobLocation": "Dallas_TX", "jobTitle": "Computational Scientist - Bioinformatics", "companyRating": "3.8", "companyInfo": {"Website": "jobs.utsouthwestern.edu", "Headquarters": "Dallas, TX", "Size": "10000+ employees", "Founded": " 1943", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Baylor Scott & White Health, HCA Healthcare, Parkland Health & Hospital System"}, "estimatedSalary": "60000", "jobDescription": "Security This position is security-sensitive and subject to Texas Education Code 51.215, which authorizes UT Southwestern to obtain criminal history record informationSalary Salary NegotiableExperience and Education Bachelor's degree in Computer Science or a related field and three (3) years of scientific software development/analysis. Experience with HPC is a strong plus. Master's or PhD preferred. Will consider demonstrated success in publishing computational science results in lieu of experience.Job DutiesSupport faculty and students in adapting computational strategies to the specific features of the HPC infrastructure. Working with a range of systems and technologies such as compute cluster, parallel file systems, high speed interconnects, GPU-based computing and database servers.Develop software and methods to explore, analyze and visualize biological data sets including genomic, imaging and protein structure data.Participate in the design and execution of collaborative research studies in biomedical informatics.Train users on the application and usage of computational systems to help accelerate the pace of scientific discovery.Other Job ResponsibilitiesUT Southwestern Medical Center has built a state-of the art high-performance computing infrastructure that includes an HPC cluster containing conventional and GPU-based nodes for parallel computing, large-scale data storage, and integration of HPC with high-performance desktop workstations. We need a talented individual to join our highly-dynamic research team as an HPC Computational Scientist. This person will work on the ongoing operations of the system and provide user support for high-end computational projects. This position will include specific responsibilities for developing our software environment and network of Linux workstations configuring, supporting and developing the tools available to researchers at UTSW. The successful applicant will also have opportunities to work with a range of HPC systems and technologies such as compute clusters, parallel file systems, high-speed interconnects, GPU-based computing, and database servers.UTSouthwestern Medical Center is committed to an educational and working environment that provides equal opportunity to all members of the University community. In accordance with federal and state law, the University prohibits unlawful discrimination, including harassment, on the basis of: race; color; religion; national origin; gender, including sexual harassment; age; disability; citizenship; and veteran status. In addition, it is UTSouthwestern policy to prohibit discrimination on the basis of sexual orientation, gender identity, or gender expression."}