{"jobID": "2664672977", "jobLocation": "Washington_DC", "jobTitle": "Director, Data Labs", "companyRating": "4.1", "companyInfo": {"Website": "www.pewresearch.org", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "133000", "jobDescription": " Organization OverviewPew Research Center is a nonpartisan fact tank that informs the public about the issues, attitudes and trends shaping America and the world. It currently conducts public opinion polling, demographic research, media content analysis and other empirical social science research in the areas of U.S. politics and policy views; media and journalism; internet and technology; religion and public life; Hispanic trends; global attitudes and U.S. social and demographic trends. Pew Research does not take policy positions. It is a subsidiary of The Pew Charitable Trusts. Pew Research Center’s work is carried out by a staff of approximately 160 based in Washington, DC. Position Description Pew Research Center is looking for a Director to lead the Data Labs team in our Washington, DC, office. Data Labs uses computational methods to complement and expand on the Center’s existing research agenda. The team collects text, network, and behavioral datasets, uses innovative computational techniques and empirical strategies for analysis, and generates original research in tandem with experts from across the organization. Data Labs also explores the limitations of these data and methods, and works toward establishing standards for use and analysis. Data Labs projects can be found here: http://www.pewresearch.org/topics/data-labs/.  The Director will lead a diverse team of data scientists, engineers and computational social scientists who use new methods to deliver on (1) substantive research products that inform decision-makers and the public and (2) methodological contributions that expand the Center’s capacities and/or inform the data science community. The director oversees the lab’s collaboration with other research groups at the Center and external partners.  The long term goal is to expand both the range of questions the Pew Research Center asks and the tools available to provide answers, while maintaining the Center’s reputation as an honest and trusted source of neutral information through transparency, nonpartisanship and methodological clarity. The Director will be a thought leader in the area of data science, and drive innovation in these areas.  Reporting to the Vice President of Research, the Director of Data Labs is a member of the Center’s leadership team, and will work collaboratively to set organizational priorities and direction. The Director will serve as a credible, knowledgeable, and trusted resource to his/her team, Center staff, his/her colleagues, Center leadership, and external audiences. The Data Labs team is made up of six highly competent professionals, all of whom report to the Director.Primary Responsibilities Work with the team and the Center’s leadership to set the research direction and agenda for the Data Labs group.Supervise execution--research design, analysis, producing deliverables.Provide feedback and guidance on projects that rely on high dimensional behavioral data sources, machine learning, and/or other emerging research assets and methods.Identify and gain access to a wide variety of newly emerging forms of data, including establishing partnerships for access to data in private hands.Network and maintain relationships with key external constituencies, including other researchers, government officials, and journalists.Disseminate the team’s findings through media appearances and public speaking events.Lead, coach and develop the Data Labs team. Set the department’s vision and execute its staffing and development initiatives. Ensure world-class output, high levels of contribution and ownership from team members.Lead the formation and management of relationships between the Data Labs team and other departments to ensure all projects are delivered to meet the high quality standards of Pew Research Center.Hire and retain top talent, work with and lead diverse teams.Develop and maintain standards for research conducted with new data and methodologies that can and will be publicly available to all researchers.Supervise the dev ops team’s maintenance of the center's computing infrastructure, which relies on AWS, Docker, Linux, Python, Django and R.Education/Training/ExperiencePhD, or equivalent experience, with a strong quantitative focus, familiarity with computer science basics and the latest advances in social science research designStrong previous experience at a management level in a research-oriented environmentExperience working with large relational and semi structured data sets (e.g., SQL and JSON) and building reproducible workflows using Python and RFamiliarity with scraping data from the web, interacting with APIs, and analyzing high dimensional data, including natural language processing, computer vision, and machine learningUnderstanding of modern software engineering fundamentals (e.g. version control, cloud platforms, ETL pipelines, containers, object-oriented programming) Knowledge and Skill Requirements Proven leader:People management experience with proven staff mentorship and development expertiseSets a high bar, leads by example and draws unexpected performance from subordinatesUncompromising eye for quality work product and a willingness to hold people accountableSuperior organizational and project management skills with creative problem-solving and multi-tasking skills, and the flexibility to effectively and quickly adapt to changing priorities.Exceptional interpersonal skills, with the ability to convey complex information understandably to a wide variety of audiences. Ability and drive to partner effectively with all levels of stakeholders, including staff, managers, leadership, and the Board of Directors.Enthusiasm for exploring big questions with data, using methods like machine learning, and honest communication about the strengths and limitations of data scienceStrong writing skills in both journalistic and academic styles"}