{"jobID": "2796529409", "jobLocation": "San_Francisco_CA", "jobTitle": "IT Support Specialist - Part Time", "companyRating": "4.2", "companyInfo": {"Website": "www.revinate.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " Revinate is looking for a Part-time IT Support Specialist to service our internal teams and help to build the right set of IT tools and processes to enhance overall team productivity. We are looking for someone who is a self-starter and takes on full ownership of company wide IT excellence by building short, medium and long term strategies. ResponsibilitiesYou will be the front line support for our internal customers - the ambassador of technologyDocument all IT processes and tools and provide end user guides to build a self service first culture and minimize wait time for resolving issues.Troubleshoot hardware and software problems with Apple and Windows products, including tablet and laptop hardwareBuild and deploy laptops and desktops using standard deployment tools/processes. Roll out services to remotely manage all Revinate devices (Laptops, Phones etc) using industry standard solutions like Mobile Device Managers.Support and assist employees using AV systems, both onsite and remote, projectors, audio and videoconferencingEnsure proper IT services are in place to conduct all company wide and executive team meetings smoothly.Respond to support requests in the IT Helpdesk email inbox. Eventually roll out a ticketing system to track IT support needs.Manage inventory for hardware and softwareCreate and manage accounts for new hiresPlan and roll out Company wide SSO (Single Sign on) for a variety of services that are being used in Revinate.Partner with HR team to ensure new hires have proper IT set-up, and employee exits run smoothly from an IT equipment / security perspectiveServe as main point-person for IT set-up for Revinates annual internal events & conferences -- e.g. Sales Summit, Hackathon, PS/CS Summit, Holiday Party / Awards CeremonyPartner with HR and Finance to manage IT budget, ensuring we have the right resources in place to support the company, managed in a cost-effective wayExperience & Skills2-3 years of experience in IT direct customer support rolesMust be available to work 3 days a week during normal office hours (Monday is a reqt)Strong communication and problem-solving skillsBasic networking skills, including an understanding of servers, switches, WiFi, etc.Knowledge of administration of Apple computer products using enterprise management tools.Strong OS X, Windows and Mac hardware troubleshooting experienceImplementing SSO solutions like OneLogin, Okta etcBonus points for any previous scripting or programming experience"}