{"jobID": "2818990052", "jobLocation": "Alexandria_VA", "jobTitle": "Business Analyst-Data Analytics", "companyRating": "3.1", "companyInfo": {"Website": "www.nttdata.com/joinus", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (9613) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Capgemini, Accenture, Deloitte"}, "estimatedSalary": "76000", "jobDescription": " At NTT DATA we know that with the right people on board, anything is possible. The quality, integrity, and commitment of our employees have been key factors in our company’s growth and market presence. By hiring the best people and helping them grow both professionally and personally, we ensure a bright future for NTT DATA Services and for the people who work here.  Req ID: 5681     Support the implementation and maintenance of business intelligence and data visualization tools as part of an integrated set of management processes that produce credible business intelligence to drive decision-making.     Develops dashboards, data models, reports, custom visualizations and optimize their performance.     Required Qualifications: 4 years of experience with data analysis and data managementKnowledge of data analytics programs and concepts a mustExperience with data analysis, including developing data queries and troubleshooting data model structureExperience with using Microsoft Excel or Visio for business modeling    Bachelor's degree or equivalent experience  In the fields of Mathematics, Economics, Statistics, Operations Research, Finance, Computer Science, Information Systems, Engineering or similar quantitative discipline desired.     Desired Skills Experience in a business intelligence tool or reporting environmentExperience with TableauExperience with SPSS, SAS, or JMPKnowledge of travel data, travel Global Distribution Systems, travel policyAbility to work independently in a fast paced, team-oriented environmentPossession of excellent oral and written communication skillsThis is a full-time salaried position with a group company within NTT DATA. Please note, 1099 or corp-2-corp contractors will NOT be considered. This position is only available to those interested in direct staff employment opportunities. We offer a full comprehensive benefits package that starts from your first day of employment."}