{"jobID": "2831990627", "jobLocation": "The_Woodlands_TX", "jobTitle": "Materials Modeling Scientist (Enterprise Research) Greater Houston", "companyRating": null, "companyInfo": {"Website": "www.bhge.com", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (BHGE) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Role Summary:About Us:Baker Hughes, a GE company (NYSE:BHGE) is the worlds first and only fullstream provider of integrated oilfield products, services and digital solutions. Drawing on a storied heritage of invention, BHGE harnesses the passion and experience of its people to enhance productivity across the oil and gas value chain.BHGE helps its customers acquire, transport and refine hydrocarbons more efficiently, productively and safely, with a smaller environmental footprint and at lower cost per barrel. Backed by the digital industrial strength of GE, the company deploys minds, machines and the cloud to break down silos and reduce waste and risk, applying breakthroughs from other industries to advance its own.With operations in over 120 countries, the companys global scale, local know-how and commitment to service infuse over a century of experience with the spirit of a startup inventing smarter ways to bring energy to the world.Follow Baker Hughes, a GE company on Twitter @BHGECo, or visit us at BHGE.com.Role Summary:Baker Hughes a GE company has  an opening for research scientist specializing in materials science and  molecular modeling. Position is based in the Greater Houston area.Essential Responsibilities:Modeling  of materials from atomic to mesoscale to provide support for materials research  and development programsMaterials  analysis for research, product development and support with emphasis on  scientific understanding of structure-property relationships, failure analysis,  design of manufacturing processes and reliability analysisCandidate  should be comfortable among other things, in working independently and in team,  project presentations, and travel to vendors and universitiesAssignments  can be a significant portion of a larger projectMay  be the lead Scientist on smaller projects with some functional supervisionAssignments  are broad in nature, requiring originality and ingenuityUsually  works with minimum supervision, conferring with superior on unusual mattersMay  be assisted by entry or junior level personnelAssists  in project planning and reviewMay  participate in customer interface with or without team leaderSelects  scientific techniques to solve problems and makes sound recommendationsAssesses  results for applicability, validity and conformance to specificationsHandles  special projects, as assignedQualifications/Requirements:Bachelor's  Degree in Scientific discipline 4+ experience, Master's Degree and 2+ yrs  experience, or Ph.D.Understanding  of materials science, metallurgy, polymers, corrosion, & structure-property  relationshipsExperience  in the use of thermodynamic, ab-initio  and molecular dynamics modelingVersed  in materials selection of typical alloys, polymers and corrosion failures in  oil& gas, automotive, aerospace, marine or similar industriesGood  problem solving skills with a drive for resultsGood  written and verbal skills in EnglishAbility  to build peer relationships as well as work independentlyMust  be action-oriented, ethical in value, and have a strong customer focusDesired Characteristics:Advanced  degree in Chemistry, Physics, or Materials SciencePh.D.  and 4+ yrs experienceExperience  working in laboratory environmentFamiliarity  with microstructural and continuum modeling techniquesExperience  working in, and troubleshooting, high-performance computing environmentsFamiliarity  with the science, formulation, and manufacturing of elastomersFamiliarity  with testing and characterization of elastomers.Familiarity  with mechanical testing, thermal analysis, compositional analysis, and  microstructural characterization.Familiarity  with techniques used to analyze fundamental science in composition, fracture,  strength, and ductility. Particular techniques include: optical microscopy,  scanning electron microscopy (SEM), energy dispersive spectroscopy (EDS), x-ray  diffraction (XRD), statistical data analysis and other surface analysis  techniques.Locations:Greater Houston, TX areaBaker Hughes, a GE company is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Learn moreLocations: United States; Texas; THE WOODLANDSGE will only employ those who are legally authorized to work in the United States for this opening."}