{"jobID": "2753332568", "jobLocation": "Chicago_IL", "jobTitle": "Principal Product Development Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.mars.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": " Apply now » Apply now  StartPlease wait... Principal Product Development Scientist - Chicago, IL LOCATION:Chicago, IL, US, 60642#job-location.job-location-inline {  display: inline;  }JOB CATEGORY: R&D;REQUISITION NUMBER: 166736A mutually rewarding experience.  Work. Realize your ambitions. And realize there’s more to being in business than just making a profit. That’s the Mars philosophy. And the opportunity we offer every one of our Associates. An opportunity to take what you do and make it mean more for you, for those around you and for the planet. What you get here is challenging, interesting work. You get the tools you need to do a great job and you get to have the best possible people on your side to help you do it. And at the same time as getting to find ways to do business better today than we did it yesterday and driving a great career, you also get to build a more enlightened business and drive sustainability.  Because it’s never just about a single person, a single project or a single brand. It’s about how you can grab everything that’s within your reach here and use it to pursue mutual, long-term gain. It’s about having ideas. And ideals. Being prepared to risk failure because the promise of success means we’ll all be a little better off. It’s that mix of integrity and ambition that makes Mars such a special place to work. And why working here is always about more than just a job. About Mars, Incorporated Mars is a family-owned business with more than a century of history making diverse products and offering services for people and the pets people love. With almost $35 billion in sales, the company is a global business that produces some of the world’s best-loved brands: M&M;’s®, SNICKERS®, TWIX®, MILKY WAY®, DOVE®, PEDIGREE®, ROYAL CANIN®, WHISKAS®, EXTRA®, ORBIT®, 5™, SKITTLES®, UNCLE BEN’S®, MARS DRINKS and COCOAVIA®. Mars also provides veterinary health services that include BANFIELD® Pet Hospitals, Blue Pearl®, VCA® and Pet Partners™. Headquartered in McLean, VA, Mars operates in more than 80 countries. The Mars Five Principles – Quality, Responsibility, Mutuality, Efficiency and Freedom – inspire its more than 100,000 Associates to create value for all its partners and deliver growth they are proud of every day.  Mars Wrigley Confectionary is looking for a Principal Product Development Scientist in Chicago, IL.  The Principal Product Development Scientist of Global Fruity Confections is accountable for leading research & development initiatives to assist in building pipeline of innovative ideas through ingredients, product and consumer benefit solutions for the Fruity Confection Category Business Unit (CBU) at Mars Wrigley Confectionery. Responsibilities for this role spans from project management, development & commercialization of new products, new technology assessment & application and innovation pipeline identification for the Fruity Confection CBU. The role will be key driver and enabler of defining innovative product solution for customers and consumers needs and linking global markets while proactively working with Marketing, Supply Chain, Commercial, Business Activity Management and other key partners. The role will ensure following Mars Standard processes and procedures, the stage gate process, resulting in reliable delivery against the innovation pipeline, further driving growth. The incumbent will serve as technical expert and advisor on confectionary products & processing to internal customers and stakeholders. Key Responsibilities:Translates business strategies into technical work plans and provides technical guidance from development through commercializationResponsible for development of innovative confectionery products and leading the new initiatives from inception through production.Proactively manages a portfolio of projects that meets objectives and suggests opportunities to fill gapsConnects and leverages global and regional Product Development, Sensory, Regulatory, Science and Technology (S&T;) teams to deliver pipeline of innovative initiatives.Leads & champions several activities including competitive assessment, product benchmarking against competition, market trends, ideation workshops to create a 3 to 5 year project pipeline utilizing elements of the Front end Framework, and leads cross-functional teams to bring ideas forward.Leads assigned growth projects from Idea Generation to Implementation and Launch (QUEST), including: technical feasibility assessment, effectively translating relevant consumer insights and experience design briefs into product options, prototyping, conducting scientific experiments/DOE, leading/partnering with factory teams team on scale-up, troubleshooting, developing robust action plans, leading and managing technical risk assessments and contingency planning, developing critical specifications and identifying opportunities for competitive advantage and intellectual property.Co-creates and communicates innovation strategy and pipeline while ensuring product quality, delivering on CBU business goals, as well as recommending resource and budget requirements to deliver projectsInfluences CBU cross functional team to deliver global & regional growth projects, provides sound technical recommendations/actions while building strong peer relationships to attain alignment for smoother progression through QUEST stage gates to enable successful product launchesEnsures compliance to internal and external policies, quality standards, and regulatory & legal requirementsApplication of the following core competencies: drive for results, learning agility, and peer relationship/collaboration to accelerate deployment of new projectsMinimum Qualifications:Bachelor of Science required in a technical area including; Chemical Engineering, Chemistry, Food Science or related field9 years in R&D; with strong technical knowledge of food ingredients, functionalities, formulation and processing.Ability to mentor and coach junior associates effectivelyAbility to translate consumer insights (sensory) into tangible offering/prototypesDemonstrated ability to lead complex initiatives across various markets and effectively bring others alongStrong grasp of R&D; and innovation process managementDemonstrated leadership and team collaboration competencies, with strong project management, organization and complex problem solving skillsHands on experience in the development and successful launch of new products, packs and processes.High degree of ownership with strong sense of urgency and an action-biased, positive attitude.Good critical thinking, able to operate independently.Excellent communication and interpersonal skills, self-directed, forward thinking, and ability to make recommendations with limited information/data.Technical expertise with abilities to challenge status quo on ingredients, formulation, processing and approaches to build robust ideasWilling to travel internationally up to 25% of timeSuccessful Completion of a drug and background screenPreferred Qualifications:Advanced degree in Chemistry, Food Science, Chemical Engineering, or related field10+ years in R&D; with strong technical knowledge of food ingredients, functionalities, formulation and processing.Technical knowledge of confectionery ingredients & functionalities Company paid relocation is available for this role.  Mars is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need assistance or an accommodation during the application process because of a disability, it is available upon request. The company is pleased to provide such assistance, and no applicant will be penalized as a result of such a request.Job Segment: Scientific, Engineer, R&D; Engineer, Chemical Engineer, Project Manager, Engineering, TechnologyApply now » Apply now  StartPlease wait..."}