{"jobID": "2782235846", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Scientist (Clinical)", "companyRating": "3.4", "companyInfo": {"Website": "www.knowesis-inc.com", "Headquarters": "San Antonio, TX", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": "Job Description:**This position is contingent upon contract award**Support AFMS Analytics staff by creating queries to collect data from appropriate central MHS and AFMS database systems and provide analytical support in evaluating and making recommendations from the data. Design, analyze, and develop information products, technical reports, and presentation for higher headquarters, MAJCOMs, MTFs, AFMOA, and others, as needed. Provide research expertise especially with respect to literature-reviewed, evidence-based methodologies, processes, benchmarks, models. Provide advanced statistical support including recommendations for data and predictive models, validation of existing and proposed models, development of data and predictive models in addition to support and requirements listed under &apos;Statistical Analysis Support&apos;. Support AFMS research efforts including, but not limited to, providing guidance for POCs for IRB, protocol review, DSA, DUA. Support AFMS research efforts including, but not limited to, accessing, processing, analyzing data as appropriate.Recommend, design, monitor, and sustain performance metrics / methodologies and assist with the development of dashboards and suitable benchmarks for comparative measurement. Research and develop methodology for International Classification of Diseases, Ninth Revision (ICD-9) to International Classification of Diseases, Tenth Revision (ICD-10) transition and complete transition on all AFMS databases. Develop methodology, process data, perform analysis and provide documents in support of AFMS/MHS websites including, but not limited to, AFMS/MHS Dashboards. Provide technical expertise to AFMS for the support of clinical processes and standards as well as outcomes related to the various applications supported by AFMS. Assist in population studies, prevention, managed care, medical readiness issues, health promotion, clinical preventive services and other health service-related issues. Provide consultation and customer support for implementation, troubleshooting and management for these and other public health primary care and health promotion activities. Assist in accessing, analyzing and disseminating information about specific populations, by developing, validating and linking various medical, safety, quality, environmental, occupational and personnel databases and dashboards. Provide program management to refine the prototypes for optimal implementation by the AFMS and, potentially, the DoD and other interested agencies. Provide an AFMS view of descriptive analysis (e.g. health statistics) to support research studies. Assist MTFs to develop process improvement measures as they implement population-based healthcare. Support the AFMS as they shift their focus from intervention services to improving the health of the entire population through population health initiatives. Serve on the AFMS integrated product teams as consultants. Serve as consultants to the AFMS staff on various projects/programs Collaborate with the AFMS to research and analyze applicable program data and create and distribute reports Assist other services in analyzing applicable program data. Collaborate with the AFMS to link applicable program data with other health and personnel data to support a longitudinal database. Research and brief the AFMS staff on advances in applicable programs. Research and investigate key business problems through quantitative analyses of utilization and healthcare cost data. Manage complex projects to completion by contributing to data collection, data analysis, statistical modeling and financial reports. Assist with the development of clinical process improvement and outcome metrics. Identify and troubleshoots data import, analysis and display errors. Contribute to the development and delivery of population health curriculum and training related to clinical performance metrics.Provide technical knowledge to customers regarding design methodologies. Provide facility coordinators with guidance as they develop interim measures of efficient and effective healthcare services. Collaborate with the AFMS and MTFs on the use of AFMS/MHS developed clinical metrics and MHS system measures to improve the health of enrolled population. Assist facilities to develop local processes and outcome measures that will allow them to be responsive and accountable to their customers while measuring progress toward optimization plans and goals. Encourage MTFs to view performance measures as a continuous improvement process, subject to change as data systems and key objectives change. Assist MTFs as they periodically refine their measures to keep pace with clinical practice parameters and the influence of outside agencies including The Joint Commission and NCQA. Possess a thorough knowledge of metrics development and process improvement. Possess knowledge and experience working within HESIS measures, the NCQA, the MHS Population Health Portal and IMR requirements. Coordinate with AFMS/MHS regarding metrics policy and development. Explore data, identify problems and develop analytical plans accordingly. Write detailed specifications for analysis plans and data files.Apply descriptive and multivariate statistical methods. Analyze data and interpret results to identify significant differences in relationships. Evaluate sources of information to determine any limitation in terms of reliability or usability. Evaluate procedures used to obtain data to ensure validity, applicability, efficiency and accuracy. Identify relationships and trends in data, as well as any factors that could affect results. Validate, manipulate and perform data analysis on large datasets and &apos;big data&apos;. Interpret and present results in a way that allows for effective decision making. Develop system and service line?specific data models to aid descriptive and predictive analysis of the AFMS patient population and healthcare system. Develop, maintain and utilize data management techniques such as relational databases to manage the flow of information between organizations and various information systems within the AFMS, MHS or other government agencies, where appropriate. Build predictive models using a variety of statistical, established and innovative, techniques. Assess and continually monitor the performance of predictive models and the impact on related outcomes. Develop automatic generation of standard updates covering modeling and performance metrics. Works with a variety of teams to identify areas of opportunity in order to drive financial performance of programs. Participates in the development of business strategy when necessary. Test and evaluate new software packages.Provide consultation to clients or colleagues.  Required Experience:Experience working with Commercial Industry or DoD military and civilian customers.Master’s Degree in Public Health, Epidemiology, Computer Science, Mathematics or other health / research related field. The Government may consider other significant related public/population health experience such as previous participation in a data analytics / informatics fellowship as an appropriate substitute for education.Five (5) years’ experience in the area of public health, epidemiology or population health.Two (2) years’ experience working in the area of healthcare quality improvement.Two (2) years’ experience developing and deploying clinical performance metrics in a population health setting.Five (5) years experience with basic SQL for data manipulation and/or SAS Institute’s statistical analysis software packages. One (1) year of software management and data retrieval experience Demonstrated advanced proficiency in Microsoft Office products PLUS additional software/hardware skills and capabilities BenefitsAbout Knowesis Founded in 2007, Knowesis Inc. has been providing data driven decisions and solutions to federal healthcare clients from day one. Our core capabilities include analytics and information management, planning and operations, and communication and engagement strategies. Knowesis’ highly qualified, customer-focused professionals are committed to providing information and advice to enable client success through holistic, thorough, thoughtful, and aligned approaches. Our clients leverage these capabilities to support data driven decisions for their key business functions. Knowesis is dedicated to earning the loyalty of clients and staff through work ethic, collaboration, and humility. Our intent is to be a positive impact to our clients, team, and community.Knowesis is Service Disabled Veteran Owned (SDVO) (CVE certified) and Small Disadvantaged Business (SBA certified 8a) with offices in San Antonio, Texas and Fairfax, Virginia. We offer a highly competitive compensation and benefits package inclusive of medical, dental, and paid time off.  For more information about working with Knowesis, please visit our website at http://www.knowesis-inc.com.Knowesis is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. Knowesis will consider all qualified applicants for employment without regard to race, color, religious creed, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, Knowesis will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result. Keyword: Clearance, DoD, Military,  From: Knowesis Inc."}