{"jobID": "2673358184", "jobLocation": "Alexandria_VA", "jobTitle": "Data Scientist (Developer)", "companyRating": "4.7", "companyInfo": {"Website": "www.navstar-inc.com", "Headquarters": "Reston, VA", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": " Data Scientist (Developer) Location  Alexandria, VA (Walker Facility) Required Clearance Level TS/SCIApply NowDATA SCIENTIST (Developer)Job Summary: Would you like to perform rewarding work while contributing to the success of an established, growing company? Navstar is an award-winning organization that has a proven track record of successfully providing IT services and solutions both as a prime and sub-contractor on mission focused IT programs. Our employees are integral players in support of mission-critical programs focused on our National Security.  This new team will be focused on building out supplier value capability as part of the GEOINT Broker initiative. This fast-paced team needs to be experienced with GEOINT (or SIGINT) collection systems, sensors, and processes (e.g., CAMS, RMS, GIMS, SLT, CPAT, NPAT, sensor and constellation scheduling, CFT, IP&A;, PRISM, PMAA). Job Duties: Conducts statistical analysis, modeling, and simulation that lead to actionable decisions affecting government operations. Uses statistical methods on large data sets to characterize uncertainty through statistical methods. Leverages knowledge of large data analysis and the ability to perform research at graduate-level mathematics to ensure study results are properly interpreted and documented. Implements analytical approaches that require knowledge of traditional programming languages, such as Java, C++, Python and others. Works closely with stakeholders and teammates from non-mathematical disciplines to ensure that operational strategies are considered in the context of applying statistical theory. Uses statistical theory through modeling, simulation, and large data analysis to deliver lasting measurable improvements to organizations Required Qualifications:JavaTo be considered for this role you must hold an active TS/SCI Security Clearance.Recommended (Plus):Tasking/Collection systemsObject-oriented Programming (OOP)Microservice ArchitectureMavenGitDockerMesosphere DC/OSElasticsearchSparkAccumuloAutomated testing using Junit or similar frameworkDesired Skills, Education, and Abilities:Data Scientist Developer Junior: 4-8 years with Bachelor’s degreeData Scientist Mid: 9-11 years of experience with Bachelor’s degree OR at least 7-9 years of experience with Master’s DegreeData Scientist Senior: 12+ years of experience with Bachelor’s degree OR at least 10+ years of experience with Master’s Degree"}