{"jobID": "2733812898", "jobLocation": "Canoga_Park_CA", "jobTitle": "Scientist II, Research & Development", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "73000", "jobDescription": " Job DescriptionWhen youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.  As a member of the Molecular Biology group, the Scientist II, R&D; is responsible for understanding and performing regular testing using new and established molecular HLA typing products that employ Next Generation Sequencing (NGS), Sanger sequencing, reverse SSO, and other emerging technologies relevant to clinical HLA typing.  Responsibilities: Performing HLA typing experiments using available molecular techniques such as NGS (Ion Torrent PGM), SBT (ABi Genetic Analyzer), SSO (Luminex 200 or 3D) on human DNA samples or equivalentAbility to propose, design and conduct experiments in all aspects of molecular diagnostic methods including but not limited to: NGS, DNA isolation and quantification, gene amplification, Sanger sequencing, to meet goals for molecular HLA typing product developmentPerforming necessary sample processing, management, and storage, including sample record keeping, DNA extraction, quantification, organization, cherry-picking or other necessary tasksReviewing HLA typing results based on current database of HLA alleles to decide on the need for re-testing or the use of alternative typing strategiesComplying with all quality and regulatory policies and actively participating in maintenance and updating of all required SOPs and quality records for equipment maintenance, testing, analysis and design of experiments, as neededManaging and prioritizing daily assignments approved by SupervisorManaging and maintaining required reagents, laboratory environment and equipment needed to carry out assignmentCollaborate closely with and training other members in the group to complete typing work as directedBeing responsible for understanding and implementing relevant company and department policies and proceduresBeing responsible and accountable for maintenance of a safe work environment, including proper staff training in laboratory safety procedures, maintenance and stocking of proper safety equipment and suppliesAttending and participating in regular or ad hoc technical or other meetingsProposing and/or implementing technical and analytical methods in the further development of DNA-based molecular typing for HLA and related genes for clinical useInteracting with laboratory staff, including project leaders and other laboratory staff members in coordinating daily activitiesMinimum Qualifications:Bachelors degree in the Biological Sciences with an emphasis in laboratory skills within molecular biology Knowledge and basic course work in molecular biology, nucleic acid chemistry or related areas3 years of post-graduate, clinical laboratory or equivalent independent research experience with in-depth knowledge and bench skill in DNA sequence and analysis methodsStandard molecular biology laboratory practice including DNA quantitation, enzymatic treatment, gene amplification and manipulation and its optimization knowledge and bench skillProven hands-on experience in repetitive work and theoretical understanding in development of genotyping product for polymorphic gene system under GMP or equivalent environment in industryHighly motivated individual who can perform assays and other tasks with minimal supervisionKnowledge of current genotyping techniques and software-based analysisWorking Conditions/Physical Requirements: General laboratory and office environment, prolonged standing/walking or sitting positions are sometimes required for conducting experiments, data input, and data analysis. Accountability: This individual will maintain confidentiality of sensitive laboratory and business data, including compliance with any and all policies and regulations regarding confidentiality of patient samples. He/she is expected to maintain work schedules as assigned and will, on a timely basis, notify his/her immediate manager of status and completion of assigned work projects/tasks. In addition, he/she will ensure that safe laboratory procedures and protocols are followed at all times, especially in the application of universal precautions in handling of all blood and blood byproducts. All laboratory personnel are expected to notify their immediate supervisors of any unsafe conditions and/or practices and to take appropriate corrective actions. Preferred Qualifications:Experience with Ion Torrent PGM or other NGS sequencer and library preparation for targeted sequencing and/or Sanger sequencing experienceAbility to learn HLA typing using molecular typing methods At Thermo Fisher Scientific, each one of our 50,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer. Apply today http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}