{"jobID": "2826760790", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist - Financial Services MCL", "companyRating": "3.4", "companyInfo": {"Website": "www.baesystems.com/us", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Northrop Grumman, Lockheed Martin, Raytheon"}, "estimatedSalary": "108000", "jobDescription": "About BAE Systems Applied Intelligence: As the market-leading provider of innovative financial crime and compliance solutions, BAE Systems Applied Intelligence helps global financial institutions to take intelligent action, control defences and evolve strategies against fraud, money laundering and other types of financial crime. With clients in over 100 countries, spanning four continents, BAE Systems Applied Intelligence counts seven of the world’s top ten banks among its growing family of clients.  Today, we have over 3,000 staff in 26 offices serving clients across the UK and Europe, the Americas, Asia Pacific and the Middle East. Our people apply intelligence to protect and enhance national and organisational assets so that they can grow and prosper – from improving the health and efficiency of leading corporations to protecting critical infrastructures, safeguarding vulnerable people and catching criminals.  New opportunities and risks are emerging and converging... every day. Come and be part of our team and make a real difference…  BAE Systems Applied Intelligence is looking for an experienced Senior Data Scientist, with a strong Software Engineering background, to join its expanding team. Located in Washington, the successful candidate will be a key asset to the Product Engineering team that is developing a state of the art machine learning analytics platform called 'Model Builder', which is used by Citizen Data Scientists to build robust predictive models in the Banking Fraud and Compliance domains. About The RoleIdentifies and applies different analytic, algorithmic, datamining, data visualization and machine learning techniques to gain data insight and build models to help Banking customers create better Fraud and Compliance detections.Guides efforts to maintain the product roadmap for BAE's Model Builder analytics platform.Leads efforts to define, prioritize and provide justification for items on the Model Builder roadmap.Leads efforts to define detailed requirements for various Analytics workflows within Model Builder.Remains up to date with industry standards in Analytics, especially as it relates to its use in fighting Financial Crime, specifically Fraud and Compliance.Remains up to date with commercial and open source products relating to Data Science and ensures that the Model Builder roadmap is consistent with changes across the industry.Responsible for identifying emerging 3rd party machine learning libraries that should be integrated into Model Builder and exposed as new capabilities within Model Builder.Drives the requirements and strategy for the use of machine learning predictive models within BAE detection engines.Drives the definition of best practices in the use Model Builder's Analytics and Machine Learning capabilities in the Banking Fraud and Compliance domains.Can provide guidance and oversight to Citizen Data Scientists engaged in active Banking customer projects using Model Builder.Can provide subject matter expertise across BAE AI in the area of Analytics and Machine Learning in the Banking Fraud and Compliance domains.Gives customer and industry facing presentations of Model Builder and its use in fighting Financial Crime.Guide and mentor junior staff and interns in order to grow the data science capabilities within the team.Skills and ExperienceEssential: Machine Learning Platforms : Any polular ML platform such as R, Python, H20 or MatLab  Database : Oracle, DB2 (or other relational databases), SQL Desirable: Programming Languages: Java  Big Data : Spark, Hadoop (or other build data technologies)  Build Tools : Ant, Ivy, Team City  Test Tools : Junit Other Attributes:Demonstrate excellent communication skills and the ability to work well with others on several levels within the company, including executives.Demonstrate excellent attention to detail.Demonstrate the ability to learn on the job, acquire new skills as required and put these to effective use.Professional / flexible individual that can adapt quickly to changing requirements or priorities and where necessary divert to assist other teams/projects.Understands data manipulation and analysis techniques ranging from data aggregation to statistical-based analytics such as propensity modelling and segmentation, to advanced approaches such as machine learning and predictive analytic approaches.Able to exploit analytical technology including knowledge of coding languages (e.g. R, Python, etc.)Able to tell stories with data – both verbally and visually, helping key decision-makers move from ad-hoc analysis into continual data conversations.Minimum Requirements:Bachelor's degree or higher in Computer Science or Data Science related field.5 – 7 years commercial development experience.3 – 5 years of experience in data modeling and machine learning, preferably within the Financial Crime domain.Experience coding machine learning algorithms and techniques using platforms such as R, Java, Matlab, Octave or Python.Strong database and SQL development experience.Experience of standards-based development.Experience with Agile software development techniques.Proven track record of technical design and development ability as part of a team."}