{"jobID": "2757806864", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Backend Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.appdirect.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "126000", "jobDescription": "About the Team: AppDirect is the leading cloud service marketplace company dedicated to revolutionizing the way businesses run. We offer a cloud service marketplace and management platform that enables companies to distribute web-based services. The global network of AppDirect-powered marketplaces allows businesses to find, buy, and manage the best applications the cloud has to offer.  With our award-winning platform, service providers can launch a state-of-the-art online application store within a matter of weeks, while developers can integrate once and make their software available across multiple marketplaces worldwide. Our products offer more advanced features and tools than any other competitive solution, putting AppDirect at the forefront of the rapidly evolving market for cloud services delivery. About You: We are rapidly expanding and looking to hire talented and ambitious software engineering talent in San Francisco. As a member of the team, you will create, grow, and manage a distributed network of marketplaces and applications. We love entrepreneurial spirit and those who bring experience from established organizations. You are a highly technical, hands-on developer with a passion for producing maintainable and robust code. You will design and develop well-tested software, build mission critical services, and APIs that scale with our increasingly elegant set of features. What you'll do and how you'll make an impact:You will help shape and evolve the ecosystem for integrations into our platform as we scale with more use cases and areas of extensibility.Architect and build systems that can process a high volume of transactions.Design, implement, and support scalable fault tolerant systems to minimize customer impact in case of failures.Participate in the effort to move to a service oriented architecture.You'll work shoulder to shoulder with some of the best people in different disciplines like product management, design, and sales.What you'll need:Proven track record of delivering end to end solutions from scratch.Enjoy building production grade code then supporting and maintaining it once it goes live.Courage to dig-in, refactor code, and explore new technology.Comfort in code reviewing other engineers code and participating in technical designs.8+ years experience developing in Java.Solid grasp of open source frameworks like Spring & Hibernate.Knowledge of web service technologies and building REST APIs.Strength in SQL and familiarity with concepts like joins, keys and optimizations.B.S. degree (or higher) in Computer Science or related field.About AppDirect:AppDirect is the cloud service commerce leader making software and products accessible globally. The AppDirect cloud service commerce platform unites providers, developers and consumers of cloud services into a single ecosystem. This makes it easy for businesses to find, buy and manage cloud services from a central location and delivers new opportunities for providers to distribute, sell, and market cloud services. AppDirect-powered marketplaces, billing and distribution, and reselling services help providers including Telstra, Deutsche Telekom, ADP and others connect millions of business users to solutions from Microsoft, Google, Box, DocuSign and more.#LI-EG1"}