{"jobID": "2837733195", "jobLocation": "Spring_TX", "jobTitle": "Data Support Analyst", "companyRating": null, "companyInfo": {"Website": "www.kellyservices.com", "Headquarters": "Troy, MI", "Size": "5001 to 10000 employees", "Founded": " 1946", "Type": " Company - Public (KELYA) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Adecco, ManpowerGroup, Allegis"}, "estimatedSalary": null, "jobDescription": "Kelly Services is hiring a Long-Term Temporary Data Support Analyst for a global organization in Spring, TX!Start date August 6th – March 31st 2019MAIN FUNCTIONS Consults with organization to provide specific knowledge and expertise related to commercial or business environment. Serves as subject matter expert to develop, assess operations or current commercial strategy, guide client decisions and make recommendations.  Improve organizational effectiveness via commercial practice improvement initiatives. Promote fit-for-purpose use of commercial practices, standards and tools.  Support prioritization of commercial opportunities or negotiations on behalf of the business. Moderate to minimal work direction needed, highly skilled and knowledgeable on commercial or business subject matter expertise. SKILLS AND QUALIFICATIONSStrong interpersonal and analytical skills.Commercial or business expertise related to subject.Job Role ResponsibilitiesDeveloping and executing supply and market strategies for natural gas or natural gas liquids (NGL) for key upstream resource opportunity capture.Support commercialization of opportunities and resulting projects through implementation.Support development, prioritization and selection of commercial, and as applicable, technical, concepts, for new and existing assets and their associated logistics development.Develop and maintain relationships with market participants.Negotiation of related sales and purchase and service agreements and management of existing long term agreements as needed.Job RequirementsCandidates should be self-motivated and focused on achieving business results through a multi-discipline team.Demonstrated teamwork, communication and leadership skills are essential.Bachelor’s Degree in Engineering - preferably Petroleum, Chemical or Mechanical.Other degrees will be considered commensurate with the individuals work experience.Current experience and knowledge of North America or other regions gas or NGL markets and associated infrastructure.Knowledge of market fundamentals, associated relevant regulations, and standard industry contracting practicesPrevious experience in NGL or gas scheduling; market analysis is helpful • Experience in negotiation, commercial design, contract development and relationship management.Strong project management and change management skills.Experience in asset management / asset divestment preferredStrong value creation orientation and optimization skillsWhy Kelly®?"}