{"jobID": "2693187671", "jobLocation": "Redlands_CA", "jobTitle": "Python API Developer - Applied Data Science", "companyRating": null, "companyInfo": {"Website": "www.esri.com", "Headquarters": "Redlands, CA", "Size": "1001 to 5000 employees", "Founded": " 1969", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pitney Bowes"}, "estimatedSalary": null, "jobDescription": " OverviewDo you want to bring geospatial data science and machine learning into the hands of data scientists worldwide? Are you passionate about building APIs? If yes, join us, as we are doing the same!  We are looking for someone with hands-on experience with statistical analysis, machine learning, predictive analytics, and software engineering to apply a wide variety of analytical and predictive modelling techniques using popular machine learning libraries in combination with ArcGIS API for Python.  The team is comprised of driven and passionate data scientists/programmers integrating machine learning capabilities into the ArcGIS API for Python, which is quickly becoming the Python library of choice for spatial analysis, mapping, and Geo-AI! You will be responsible for not only designing and developing an API in Python, but developing on top of successful open source projects such as pandas and Jupyter Notebooks, using cutting-edge ML and DL libraries such as scikit-learn, TensorFlow, and PyTorch. Responsibilities:Participate in the design, development, and successful adoption of the ArcGIS API for Python among analysts and data scientistsDevelop Jupyter Notebook-based samples, SDK guides, and demos for integrating ArcGIS with data science libraries and workflowsIntegrate ArcGIS API for Python with popular machine learning modules such as scikit-learn, TensorFlow, and PyTorchPerform bug fixes and documentation and maintenance tasksDesign, test, release, and support ArcGIS API for Python to enhance overall product quality and applicability for supporting data science workflows and needsEvangelize the data science community to our software community through various venues such as user documentation, educational materials, social media, and online contentRequirements1-3 years of experience with high level programming languages such as Python or JavaExperience using Python libraries such as pandas and numpy and machine learning libraries such as scikit-learn, TensorFlow, and PyTorchUnderstanding of machine learning as well as deep learning techniques and algorithms such as k-NN, Naive Bayes, SVM, Decision Forests, CNNs, RNNs, LSTMsUnderstanding of REST APIs and web programmingA strong drive and interest to learn new technologies quickly and work in a fast-paced software development environmentBachelor's or master's in data science, information technology, computer science, GIS, or related discipline, depending on position levelRecommended Qualifications:Experience with MATLAB, R, and visualization libraries such as ggplotFamiliarity with ArcGIS suite of products and concepts of GISUnderstanding of multivariable calculus and linear algebra The CompanyOur passion for improving quality of life through geography is at the heart of everything we do. Esri’s geographic information system (GIS) technology inspires and enables governments, universities, and businesses worldwide to save money, lives, and our environment through a deeper understanding of the changing world around them.  Carefully managed growth and zero debt give Esri stability that is uncommon in today's volatile business world. Privately held, we offer exceptional benefits, competitive salaries, 401(k) and profit-sharing programs, opportunities for personal and professional growth, and much more.  Esri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}