{"jobID": "2837722034", "jobLocation": "Monterey_CA", "jobTitle": "Data Management Analyst - ETL", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": "Northrop Grumman is seeking a Data Management Analyst to provide database extract transform load (ETL)support in our Monterey, California facility.Developing, testing, and deploying ETL modifications based on new customer requirementsExecuting and monitoring ETL processesCommunicates with clients, developers and other team membersMaintaining ETL configuration and baseline within a Windows server environmentTroubleshooting issues with ETL connections, performance, or other errorsUpdating, compiling, testing, and deploying changes in response to problem reportsBasic Qualifications:6 years related experience with Bachelor's degree in Engineering, Computer Science, Information Systems, Applied Mathematics or other scientific/technical discipline.10 years related experience without degreeStrong familiarity with Oracle11g/12cExperience with database programming/development using PL/SQL (package, procedures, functions, triggers)Understandingof data warehousing, data quality processesExperience with data dictionaries, data analysis and relational databasesExperience supporting and/or migrating data from other sourcesAbility to hold a DoD Secret Clearance US Citizenship is required in order to obtain and maintain security clearance Preferred Qualifications:Experience withETL concepts and tools for maintenance and scalabilityAbility to analyze complex and large amounts of dataAbility to develop professional relationshipsDoD IT Experience Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}