{"jobID": "2829396464", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Director, Data Science and Analytics", "companyRating": "2.6", "companyInfo": {"Website": "www.immunomedics.com", "Headquarters": "Morris Plains, NJ", "Size": "51 to 200 employees", "Founded": " 1982", "Type": " Company - Public (IMMU) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "159000", "jobDescription": " Overview  Immunomedics is looking for a proven data science leader to join our growing team to deliver innovative cutting edge analytical capabilities.  Position Summary  This position will lead the analytics team in supporting Immunomedics on its digital transformation journey and to realize its vision of delivering breakthrough therapies to treat complex cancers and transform patient outcomes.  The primary responsibility is to lead development of innovative, cutting edge predictive services to support commercial growth, clinical development and ongoing operations of Immunomedics. This role requires significant interaction with business leaders to frame business challenges, and translating to insight generation. Responsible for innovation in Data and Analytics capabilities for the organization.  Immunomedics will deploy these services internally or externally to patients, physicians, payor, suppliers, ecosystem partners. Internal customers include R&D;, Manufacturing, Operations, Commercial teams, IT and Business Office.  Responsibilities  Key Accountabilities  Ideate, collaborate with business leaders to help establish data driven culture to proactively use information and insights from data.  Design, develop and operate analytics services for all customer facing digital solutions. Immunomedics is committed to delivering holistic patient experience and outcomes  Develop novel analytics to pinpoint unmet needs, treatment pathways and improving trial design using new and non-traditional sources of patient data (‘omics, behavioral, Eventstreams).  Develop novel analytical solutions to deliver market intelligence and commercial insights needed to support product launches.  Develop innovative services to drive access and adherence.  Design and deliver integrated payer analytics insights in a world of transforming market access.  Develop and mentor team of data scientists and analysts  Qualifications  University degree required (Biostatistics, Bioinformatics, Computer Science, Engineering Epidemiology,Operations Research).  3 to 5 years leadership experience in building innovative analytics capabilities programs  10 years progressive experience in delivering analytics services, to rapidly growing organizations.  3 years of applying machine learning and/or statistics algorithms to life-sciences applications.  3 years of hands-on programming with Python (Data Science Stack-pandas, sklearn, numpy/scipy), R, SAS  5 years of using relational databases, SQL, big data, visualization tools  3 years of working with cloud platforms (such as AWS) that includes development and deployment  Proven ability to tap into network of experts, consultants, innovative data/AI startups and service providers  Prior hands-on experience in working with clinical and commercial data in life sciences and health care domains, oncology data sets (EMR, NIH research data) preferable."}