{"jobID": "2809449358", "jobLocation": "Monterey_CA", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.chomp.org", "Headquarters": "Monterey, CA", "Size": "1001 to 5000 employees", "Founded": " 1928", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " Bachelor Degree Required Data AnalystPosition Highlights Excellent pay and generous benefits, including continuing education allowance  Excellent team-oriented culture  Free gym for employees  Excellent work environment! Position Summary The Data Analyst owns the population health data of Community Health Innovations (CHI) from beginning to end. Flat files and Excel sheets come to our data team and we use SQL (MSSQL), data pipelines, Powershell and BI tools (Tableau, PowerBI) to process that data and deliver reports supporting the integrated Population Health goals of CHI. The Data Analyst builds out new and maintains existing data flows and reports from a variety of systems. This position works closely with the executive team and clinical staff in developing new reporting and must be able to translate technical details and reports to non-technical audiences. Responsibilities/Expectations: Become subject matter expert on CHI's data sources, available fields in them, and relationships between different data sets  Perform extracts of raw data from source systems and operate pipelines (Powershell, SQL) to process and load that data into CHI's systems  Collaborate with clinical and operational teams in the design and development of executive management level reports  Own the maintenance, design and expansion of existing database schema and ETL tools  Other duties as assigned Experience/Skill Set 2 years' of relevant experience working with data preferred.  o Experience in healthcare preferred, i.e. membership, claims, provider, population health, etc.  Strong SQL experience required to include querying, schema design and stored procedures  Programming experience for scripting used for automating tasks and data processing required  Previous electronic health record or other healthcare system technical experience is preferred  Professional demeanor with effective, tactful, and persuasive written, verbal, and nonverbal communication skills required  Previous client and/or patient customer service experience is preferred  Ability to balance multi-stakeholder goals and objectives required  Experience with Epic (Healthy Planet) or other population health focused systems preferred Education: Bachelor's degree or equivalent education/experience in business administration, medical practice management, informatics, computer science or a similar discipline required  New grads welcome! About CHI: CHI convenes the medical community and articulates a collaborative vision for improving the quality, safety, and efficiency of healthcare in Monterey County through an integrated population management strategy that enhances access to providers, improves caregiver communication and fosters a team approach to care delivery. The patient-centric team approach is supported through in-office and community-based clinical services, and integrative health information technology (HIT).  Integrative HIT facilitates connectivity across the care site continuum and enables the development of evidence-based clinical decision support tools, and performance measurement systems. They also support patient engagement providing information to empower them to be active participants in fostering and maintaining their own health.  In addition, CHI engages payers in designing value-based insurance products that promote evidence-based workplace wellness, primary prevention and disease management to keep our community healthy and reduce the clinical and financial burden of disease.  Equal Opportunity Employer"}