{"jobID": "1625469101", "jobLocation": "Robbinsville_NJ", "jobTitle": "Geologist / Environmental Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.sovcon.com", "Headquarters": "Robbinsville, NJ", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": "Sovereign Consulting Inc., a growing environmental consulting and remediation firm headquartered in Robbinsville, NJ, is seeking a Geologist / Environmental Scientist (2-7 years of experience) for its Robbinsville, NJ location.  Responsibilities include: •Groundwater, soil, surface water, and indoor air sampling;•Monitoring well installations; •Soil boring & boring log preparation; •Preparation of analytical data tables; •Assist with report preparation; •Assist with proposal preparation; •Ability to work in a team environment. Requirements: •2-7 years of geology related experience is required.•A Bachelors or Masters degree in Geology or Environmental Science required.•OSHA 40-hour HAZWOPER Certification required and current 8-hour refresher preferred.•Demonstrated technical writing skills.•Must have excellent communication, analytical, field sampling skills.Employment at Sovereign is contingent upon the results of a Drug & Alcohol screening test and a pre-placement medical evaluation that determines candidates ability to capably and safely perform the proposed job duties. Candidates must present documentation that confirms identity and eligibility for employment in the United States.Salary will be commensurate with experience. These full-time positions offer an excellent benefits package including: group healthcare program, vision and dental coverage plan, life and AD&D; insurance plans, short & long-term disability programs, other supplemental insurance programs, 401(k) retirement plan, tuition reimbursement program, paid holidays and paid vacation. A relocation package will not be offered for this position. Send resumes to Human Resources. Sovereign Consulting Inc. is an Equal Opportunity Employer. "}