{"jobID": "2786572799", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Coordinator", "companyRating": "4.2", "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": "62000", "jobDescription": " Project Coordinator Location  CA-San Francisco Department  121-No CA Project Controls Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance.What You’ll Do: At Webcor, you won’t be just another cog in the wheel. You’ll leave your thumbprint on big, meaningful, and complex projects. You’ll have the support of a small, tight-knit organizational community and of executive leadership. As a Project Coordinator, you will: Provide overall administrative support to the project team for the day-to-day activities on the project including: administration of subcontracts and all associated construction compliances, documents, and documentation; electronic processing of subcontractor and vendor invoices and payroll; job site safety; and office management. You will also initiate and execute project start-up and close-out.Coordinate jobsite office set up, office and phone equipment, office supplies, and vendor’s services.Own the project accounting process within specified timelines.Process new-hire field and transfer employees and coordinate field lay-off paperwork. Approve timecards.What You Need to Succeed:Associate’s degree or equivalent experience required.Construction accounting experience preferred.Previous experience working for a general contractor preferred.Strong computer skills with the ability to use MS Office with proficiency (Word, Excel, Outlook).You are authentic and are known for going above and beyond what is asked of you.You have a keen ability to influence others to meet deadlines and accomplish required tasks. You are pleasant yet firm.You are well organized and possess a highly professional demeanor. #MON123 Webcor is an Equal Opportunity Employer."}