{"jobID": "2261930989", "jobLocation": "Washington_DC", "jobTitle": "Data Science Fellow", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Description: Øptimus Consulting, a data science and software company, is seeking a data science fellow in their Washington D.C. area office. Fellows with the Data Science & Predictive Analytics team will participate in all aspects of work at Øptimus. In an environment where long-term projects last one or two weeks, no two days are the same. You'll work on multiple projects: writing call scripts that are used in hundreds of thousands of calls, streamlining our current workflow, sitting in on meetings to offer your valuable insight, and creating statistical models to meet the needs of our clients, just to name a few. We'll match what you're good at with what you enjoy and what we need. Qualifications:Must be able to learn quickly and juggle multiple projects with moving deadlines.Must have strong analytical skills.Must have at least one course in statistics or equivalent real-world experience.Having courses or experience in machine learning, data mining, regression, generalized linear models, experimental design, and/or GIS is especially desired!Must have killer Excel skills and be incredibly competent in Word, PowerPoint, etc.Must have experience in R or Python - both is a plus!A passion for politics is strongly preferred.Experience with computer programming is a plus.Experience with political campaigns or similar recruitment efforts is a plus.Knowing how campaigns work, even if you don't think it's relevant like going door-to-door in a neighborhood or working phone banks can be very helpful!Experience with statistical modeling is a plus.Compensation: Fellowships with Øptimus are paid and come with benefits including health insurance and paying for your cell phone. Company: Øptimus Consulting is a family of statisticians, graphic designers, data scientists, programmers, social media marketing analysts, and recovering politicos. We handle a wide variety of projects and use many different technologies and programs to meet our clients needs, so our culture here is one of constant learning and curiosity. Our product quality is unparalleled. We like to do things carefully and do them the right way. We boast an office (with a balcony!) five blocks from the White House, no cubicles (think a cross between Slugline from House of Cards and CTU from 24), and a nacho cheese machine and kegerator. If you live by the work hard, play hard philosophy, then you'll be a great fit with the Øptimus team."}