{"jobID": "2744095907", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist Consultant (Resources)", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "142000", "jobDescription": "Basic Qualifications:Masters or Ph.D. (Computer Science, Statistics, Petroleum Engineering, Reservoir Engineering, Geosciences, Physics, Mathematics, Economics)Minimum 1 year of Data Science experience for Ph.D. candidates or 2 years for Masters candidatesMinimum 1 year of work experience in one or more of the industry domains Refining or Chemical Plants with focus on process engineering, plant reliability, asset integrity, operational improvement in manufacuring with hands on experience handling data driven decisionsMinimum 2 years of experience in at least one of the following Supervised and Unsupervised Learning, Classification Models, Cluster Analysis, Neural Networks, Non-parametric Methods, Multivariate Statistics, Reliability Models, Markov Models, Stochastic models, Bayesian Models, Deep Learning, Genetic Algorithms, Fuzzy Logic, Inference SystemsMinimum of 2 years of experience in various statistical and machine learning models, data mining, unstructured data analytics in corporate or academic research environmentsMinimum 2 years of experience in statistical software - Python, R, Octave, Tensorflow, Caffe or Theano)Minimum 2 years of programming experience (Python, R or similar)Preferred Qualifications:Familiarity with relational databases and intermediate level knowledge of SQLAbility to think creatively to solve real world business problemsAbility to work in a global collaborative team environmentExperience leading or collaborating with a team of data scientists in developing and delivering machine learning models that work in a production settingKnowledge of UNIX or Linux environmentsExperience working with large data sets and tools like MapReduce, Hadoop, Hive, etc.Experience working with large data streaming technologies like Spark, Flink, etc.Familiarity with relational databases and intermediate level knowledge of SQLProficient verbal and written communication skills in EnglishOUR COMMITMENT TO YOUYour entrepreneurial spirit and vision will be rewarded, and your success will fuel opportunities for career advancement.Youll make a difference for some pretty impressive clients. Accenture serves many of the Fortune Global 100 on high-profile projects.Opportunities to learn daily through training, assignments and collaboration with experts across the company.Access to leading-edge technology.Along with a competitive salary, Accenture offers a comprehensive package that includes generous paid time off, 401K match and an employee healthcare plan. Learn more about our extensive rewards and benefitsCALL TO ACTIONNow is the time to become a digital disrupter. The opportunity is herewhats stopping you from pursuing it?Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Accenture is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment OpportunityAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state or local law.  Accenture is committed to providing veteran employment opportunities to our service men and women."}