{"jobID": "2767355078", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Analyst, Growth Analytics", "companyRating": "4.6", "companyInfo": {"Website": "www.poshmark.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Are you the type of person who feels they could solve any problem if they just had the right data? Are you curious by nature? We are seeking a Data Analyst to help us better understand and manage the Poshmark business through rigorous data analysis and insights.  The ideal candidate will bring a strong business mindset for approaching problems and have basic technical skills in data extraction and manipulation. This is the perfect opportunity for an analyst with 2-3 years experience to gain valuable experience and drive decisions at a high-growth, mobile commerce start-up. Responsibilities:Develop a deep understanding of business and the key metrics to measure the performance of Growth campaignsPartner with Growth operations team to understand their needs and independently work on a variety of growth analytics projects focused on delivering insights, dashboards and custom reports to help efficiently grow Poshmark’s communityExtract required data from internal systems, develop reports and analyze them to derive insights and understand and monitor key trends in relevant metricsPerform extensive QA on data to ensure the quality of data. Follow the standard process for reporting any issues identified and work with Data team to close the data issuesProactively identify improvement opportunities through systematic and rigorous measurement and analysisMaintain required documentation to ensure inventory of all key findings and growth opportunitiesIdentify the right metrics needed to appropriately manage our business, and work with Data Engineering team to implement the data collection needed.Desired SkillsB.A./B.S./M.S. or equivalent degree with 2 - 3 years of data analytics experience. Data Science experience is a big plus.Expert knowledge of SQL and MS Excel. Experience with Looker is a huge plus.Strong business acumen is required. Experience in Growth area is big plus.Ability to use data and metrics to back up business cases, planning, and decisionsDetail oriented and expert in both qualitative and quantitative analysis with a passion for delivering actionable insights to key stakeholders.Advanced reporting with strong critical thinking and project management skillsExcellent written and verbal communication skillsWhy Poshmark? Founded in 2011, Poshmark is the largest social marketplace for fashion where anyone can buy, sell and share their style with others. Poshmark’s mission is to make shopping simple and fun by connecting people around a shared love of fashion, while empowering entrepreneurs to become the next generation of retailers. Recognized as the go-to shopping destination for millennials, Poshmark’s community of over two million Seller Stylists help shoppers discover the perfect look from over 25 million items and 5,000 brands. The company is backed by the world’s leading venture capital institutions including Mayfield, Menlo Ventures, GGV Capital, Inventus Capital, SoftTech VC, Union Grove Venture Partners, Shea Ventures and AngelList. For more information, please visit www.poshmark.com, or find us on Instagram, Twitter, Pinterest and Snapchat. Here’s what we’ll set you up with:A team that is invested in your career growth and trainingCompetitive salary and equity, based on experienceCompany sponsored health, dental and vision plansA 13” MacBook Air and smartphone reimbursementWork alongside world-class talentFlexible Vacation / Paid Time Off PolicyParental LeaveHealthy and exciting lunches and snacks offered dailyPersonal Style Encouraged (or not, whatever you’re in to)Fun company happy hours, parties, and offsite events"}