{"jobID": "2660387042", "jobLocation": "Rocklin_CA", "jobTitle": "Business Systems Analyst / Data Analyst", "companyRating": "4.7", "companyInfo": {"Website": "www.klove.com", "Headquarters": "Rocklin, CA", "Size": "201 to 500 employees", "Founded": " 1981", "Type": " Nonprofit Organization", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " The Data Science & Insight team at K-LOVE & Air1, scours through massive amounts of data, looking for the story behind it. They query databases and analyze the results to help us find answers to some of our more challenging questions. Then they report it in a way that is useful to our execs. They use the most advanced analytical tools & their naturally inquisitive minds to provide practical insight.  Our Data Science & Insight team is currently looking for a Business Analyst who is more of a \"systems thinker\". This is a hybrid role, blending of the roles of business systems analyst, data analyst, and scrum master.  In this role, you’ll be working on requirements gathering and documentation, user story development, managing the kanban board and partially serving as the scrum master. Here's what we're looking for...3-5+ years of professional experience as a Business Systems Analyst - gathering & documenting business requirements.Experience in the application & facilitation of Agile Methodologies and Scrum phases/ceremonies.Experience with Tableau, Alteryx, SQL, QDA Miner, Nielsen, Sitecore or equivalent analytics or research software is a plus.Understanding of qualitative and quantitative methodologies.Ability to discern and analyze the critical elements of large sets of information.Ability to work in a team-based environment or independently in fast-paced environment often with minimal supervision, sometimes under tight deadlines, with the ability to multi-task and prioritize appropriately while managing multiple projects concurrently.Exceptional written, presentation, and oral communication skills.Desire to learn and grow.Employment Requirements:Must pass a pre-employment background & reference check.Must provide proof of legal authorization to work in the US.EMF does not sponsor applicants for work visas."}