{"jobID": "1154250956", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior BI/Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lat36.com", "Headquarters": "Franklin, TN", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TEKsystems, Collabera"}, "estimatedSalary": null, "jobDescription": " Senior BI/Data AnalystJob  code: 8546Job Category: Data AnalystCity: San FranciscoJob Description:Job Title: Senior Business Intelligence and Data AnalystLocation: CA-San FranciscoDuration: 6 months with hireJob Description/Responsibilities: ? Formulate and perform data mining, mathematical modeling, statistical/quantitative analyses, experiments (A/B testing), optimization and predictive analytics, data investigation, and reporting to support product, research, sales, market intelligences, and management teams  ? Effectively communicate quantitative findings, make and defend meaningful conclusions and recommendations, identify and interpret trends and relationships  ? Work with product and cross-functional teams to tie qualitative data with quantitative data to draw inferences about user behaviors, consumption pattern, and content performance across platforms and devices  ? Identify and synthesize secondary research to complement primary research  ? Design, improve, and automate processes related to tracking and reporting  ? Develop data programs to educate effective product development and optimizations Required Skills/Experience Skills/Experiences: ? Minimum Bachelor’s or Master’s degree in Math, Statistics, Economics, Engineering, Computer Science, Physics, or equivalent quantitative field  ? 2-7 years relevant working experience (in a similar role) with strong technical analytical ability and data mining skills  ? Excellent statistical intuition, application, and knowledge of various analytical approaches  ? Extensive experience querying large, complex, and raw data sets in Teradata/Hive/Hadoop databases.  ? Proficient in advanced SQL and with statistical software (preferably R)  ? Proficient with video/web analytics and tools (Omniture, Tableau)  ? Proficient with Excel and PowerPoint  ? Must be detail-oriented and focused on data accuracy  ? Must have excellent verbal and written communication skills; ability to effectively communicate and present data and information  ? Proven ability to learn quickly, work independently, and adapt to change in a fast-paced environment  ? Passion for news, video, social networking, advertising, and digital entertainment industry  ? Build strong working relationships with coworkers, customers, and company management  ? Must successfully pass a background check Pluses: ? Experience with programming languages (PHP, C, Perl, Python, etc) a strong plus  ? Experience with internal and external APIs (Google, Facebook, Twitter, etc)  Let me know if you are interested in this job role and/or if you can assist us by referring someone who is since we offer the lucrative referral bonuses.  I am looking forward to speaking with you today.  Rohan Mehta | Latitude 36, Inc | Sr IT Recruiter| Desk: 510-578-7570 | Email:rmehta@lat36.com| Web:www.Lat36.comConnect with us on: Like us on Facebook  Follow us on Linked In  Tweet us on Twitter About us: Latitude 36 is a full-service staffing services firm, specializing in recruiting for Information Technology and Healthcare positions. Founded in 2000, Latitude 36 is a WBENC certified woman-owned company. Our clients include Fortune 1000, large (500MM+) privately-held companies and non-profit corporations. Latitude 36’s core service is staffing. Through time-tested recruiting programs, we offer our customers the highest-caliber, pre-screened resources to ensure our customers meet business and project objectives. For more information, please visit us at www.lat36.com"}