{"jobID": "2676694494", "jobLocation": "Midland_MI", "jobTitle": "First Assist Surg Tech III", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "19", "jobDescription": " Position Information  FTE: 0.900000  Exempt: No  Day Shift: 36 Hrs/Wk; 72 Hrs/Pay  Weekend & Holiday Rotation: Per schedule  Pay Grade: 12  Position Summary  This position prepares the surgical suite for the procedure by assisting the surgical technologist along with the registered nurse in gathering equipment, instruments, and supplies to perform the procedure. Assure all supplies and equipment are available for the procedure and in working condition. Assists the RN circulator and anesthesia provider in preparation of the patient to include foley catheter placement, tourniquet placement, placement of intravenous catheters, cricoid pressure application, and other procedures as needed. This position assists the surgeon by providing exposure, aid in hemostasis, closure and other intraoperative technical functions that help the surgeon carry out a safe operation with maximum results for the patient. In providing proper draping, retracting, suctioning, sponging, suturing, tissue handling and cautery techniques. The assistant will apply appropriate dressing material specific to procedure. This position assists the surgeon in the care of the patient while in the operating room through utilization of the operating room team concept.  Responsibilities  ESSENTIAL:  Responsibilities: (50%)* Demonstrates knowledge of surgical procedure, anatomy and physiology, and operative techniques related to specific procedure. (20%)* Assures all necessary supplies, equipment or instruments are opened or available. Ensure items are charged for appropriately by confirming with nurse and surgical technologist. (20%)* Assists physician as directed with proper positioning, draping, retracting, suctioning, sponging, tissue handling, cautery techniques, stapling devices, and suturing. (10%)* Assists team members in transportation, positioning and total care of patients. OTHER DUTIES AND RESPONSIBILITIES: Demonstrates a broad range of knowledge with proficiency in preparation of surgical procedures and has versatility in staffing as a surgical technologist if needed.  Participates in orientation, ongoing competencies, education, and staff development.(including staff meetings).  Participates in regulatory surveys.  Participates in performance improvement activities.  Fulfills on-call responsibilities and extra shift coverage as needed.  Demonstrates a positive, courteous, and helpful attitude toward patients, visitors, physicians, and co-workers.  Remains calm and efficient when working in stressful situations.  Shares information and reports significant changes and./or abnormal findings to appropriate team members.  Attend and/or participate in professional association activities and programs to assure being current on regulations, guidelines, and professional standards of care.  Remain current on new developments in healthcare by reading professional journals and attending seminars when applicable.  Other duties as assigned.  Qualifications  Education: Essential:High School Diploma or GED  Credentials:Essential:Cert Surgical First AssistantBasic Life Support  Credential equivalent experience:"}