{"jobID": "2813074640", "jobLocation": "Arlington_VA", "jobTitle": "Operations Analyst II, Strategic & Data Analysis", "companyRating": "4.8", "companyInfo": {"Website": "www.promnetwork.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Job OverviewLevel ExperiencedJob Location HQ - Arlington, VAPosition Type Full TimeEducation Level Bachelor's DegreeTravel Percentage NoneJob Category Strategy - PlanningDescriptionWhat is the role? You would be a key member of our Strategic & Data Analysis team, responsible for analyzing, providing, and forecasting market- and product-related performance data in support of generating business intelligence insights for our organization, particularly our national sales and marketing teams. You should possess the experience and qualifications to perform these core responsibilities: Apply statistical methods to identify relationships within and among relevant markets and our products;Assist in the development of quantitative, dynamic forecasting models, as well as track and communicate forecast-to-actual results and trends;Assist in development of performance reports and data visualizations for sales management teams;Coordinate with marketing on the content, prioritization, and development of sales and marketing collateral; andProvide ad hoc and ongoing reports and insights to various management teams.QualificationsWhat qualifications are necessary to succeed in the job?Excellent analytical skillsSupreme attention to detailSound problem-solving and decision-making abilitiesExcellent communication skills, both written (business writing) and verbalAbility to excel in a fast-paced, action-oriented environment with concurrent projects and multiple deadlinesAbility to adapt on short notice and to changing prioritiesPrior use of statistics software programs (e.g., R, SPSS, Minitab, Stata, etc.)Intermediate-level experience with the following Microsoft Office products: Excel, Access, PowerPoint, and Word (with emphasis on Excel and Access)Beginner-level experience writing SQL queriesBachelor’s degree with focus in Statistics, Economics, or related fieldHow Do I Apply? Don’t just settle for a job, explore this career opportunity. Take the first step by forwarding your resume to: careers@promnetwork.com (reference Ops Analyst in the subject line).  Promontory Interfinancial Network, LLC is an Equal Opportunity Employer and does not discriminate on the basis of race, color, national origin, sex, religion, age, veteran status, disability, or sexual orientation in employment of the provision of services."}