{"jobID": "2802448864", "jobLocation": "Fort_Sam_Houston_TX", "jobTitle": "Configuration Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.keakitech.com", "Headquarters": "Honolulu, HI", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Contract", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": " Configuration Data Analyst Location  TX - Fort Sam Houston Job Code 4619 # of openings 1Apply NowLaulima Government Solutions is looking for a qualified Configuration Data Analyst to support the US Army Medical Research program with Configuration Management (CM) support for the Department of Defense Trauma Registry database. Primary responsibilities will include maintaining project software and documentation inventory and configuration baselines for both internal and external created applications by establishing and maintaining all standard CM processes. The qualified candidate will also provide support of the evolution and deployment of Joint Trauma System (JTS) and EACE HQ software and hardware. will Duties include version control, integration, configuration, performance testing/verification, monitoring, problem resolution, back-up and recovery, manage user accounts and permissions, migration, coordinating and maintaining network connectivity, technical database support, generate engineering documents that records the current configuration as well as the system changes. DUTIES INCLUDE:.Configuration Data Analyst Support: Review data from multiple sources and determine relevant information to a given situation.Draft, edit and disseminate written reports and status updates that are factual, timely and relatively error free.Ensure the confidentiality, integrity, and availability of systems, networks, and data through the planning, analysis, development, implementation, maintenance, and enhancement of information systems, security programs, policies, procedures, and tools.Maintain information systems certification and accreditation documentation and manages the information assurance vulnerability assessment program.Responsible for developing and implementing security programs, policies and procedures to ensure the security, reliability and accessibility of information systems, networks and data.Conducts system security audits and risk and vulnerability assessments.Participates in network and systems design, to ensure implementation of appropriate security policies and developing information security contingency plans and disaster recover procedures.Manage information system accounts, network rights, and access to information technology resources, to include NT server, workstation, and network devices, using industry recognized tools and methodologies.Database Management Support Services: Assess the needs of customers and identify or tailor products and/or services to meet their needs.Resolve non-routine problems, questions, or complaints and direct the most complex problems, questions, or complaints to the appropriate person.Evaluate the effectiveness of current database management technology; investigate problems and inefficiencies in a well-established data base environment.Determine the impact of new or revised software on system operations and applications.Provide technical information about current and upcoming products and services.Use DBMS software to investigate factors affecting the database such as amount of storage space consumed, access times, frequencies of reads and writes, and problems encountered by other applications and systems programmers.Run utility routine/programs and investigate when reports indicate a decline in computer performance.Develop and recommend certain procedures to insure rapid access to all data.Analyzes use of archived data and develop ways to insure optimum use of existing systems.Implement the conversion of existing databases to meet new release requirements.Provide, maintain and manage end user accounts and profiles.Establish, delete, change, suspend and respond to inquiries for accounts.Provide resolution service to all identified problems with database.Apply patches, perform field-engineering notices, and verifies checksums.Identify and define substantive problems, conduct analyses, develop alternatives and provide recommendations to senior Joint Trauma System leadership for changes to the Department of Defense Trauma Registry and or resolution of unprecedented issues.Provide quick reaction analyses and issue resolution for any database issues related to the Joint Trauma System.Utilize qualitative and quantitative techniques to review and appraise existing policies, operating methods, practices, and procedures to detect operating deficiencies, inefficiencies, or unfavorable trends, with responsibility for recommending and developing adaptable solutions to achieve long-range goals and objectives.Utilize data extraction tools such as (SQL, Excel, etc.) for data pulls from the DoDTR. The extracted data will be cleaned and provided to the JTS Leadership for review prior to them releasing for internal and external customers.Utilize data analytic tools such as (Oracle, Tableau, SASS, etc.) to identify and solve technical problems.REQUIRED DEGREE/CERTIFICATION:Maintains A+ certification in accordance with DoD 8570.01-M and AR 25-2..REQUIRED SKILLS AND EXPERIENCE:Oral and written communication skills.DESIRED SKILLS/EXPERIENCE:Four (4) years' experience as a Configuration Data AnalystFederal and/or DoD experience is preferredCITIZENSHIP/SECURITY CLEARANCE REQUIREMENTS:Ability to pass a National Agency Check (NAC), prefer active Secret clearanceMust be a U.S. Citizen The Alaka`ina Foundation Family of Companies (FOCs) is comprised of industry-recognized government service firms who are designated as Native Hawaiian Organization (NHO)-Owned and fall into the respective categories of standard Small Business, 8(a) certified Small Disadvantaged Business (SDB), and HUBZone. The FOCs includes Ke`aki Technologies, Laulima Government Solutions, Kūpono Government Services, Kāpili Services, and Po`okela Solutions. Alaka`ina Foundation activities under the 501(c)3 principally benefit the youth of Hawaii through charitable efforts which includes providing innovative educational programs that combine leadership, science & technology, and environmental stewardship.  For additional information on Laulima Government Solutions, LLC, please visit www.alakainafoundation.com. We are an Equal Opportunity/Affirmative Action Employer of individuals with disabilities and veterans. We are proud to state that we do not discriminate in employment decisions on the basis of race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. If you are a person with a disability and you need an accommodation during the application process, please click here to request accommodation. We E-Verify all employees."}