{"jobID": "2734682286", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr. Data Analyst Incentive Program", "companyRating": "3.1", "companyInfo": {"Website": "www.altamed.org", "Headquarters": "Commerce, CA", "Size": "1001 to 5000 employees", "Founded": " 1969", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " The Sr. Data Analyst Incentive Program is responsible for managing the data that support AltaMed’s incentive program initiatives. Primary responsibility is the maintenance and enhancement of the database used to gather multiple sources of data and help the incentive programs department monitor the performance of each provider and member for HCC/RAF and quality related incentives. Secondary responsibility is the production of analytical reports on HCC/RAF and quality measures, outcome, and research of additional data sources that could benefit that incentive programs. Position responsibilities can include database maintenance, enhancement, conversion to SQL, analysis and reporting of incentive programs, patient utilization of HCC/RAF and quality measures and their outcome within AltaMed, our partner health plans and Medicare CMS. Works data leakage for HCC Drop off; identifies HCCs for members that have not been captured/recaptured.Builds relationship with internal/external stakeholders to promote HCC programs.Participates in meetings in support of HCC/Data Validation Objectives, as requested in order to establish and maintain interdepartmental and external partner communications and cooperation.Gathers and manages data from AltaMed’s electronic health records, specialized software, and outside sources related to HCC/RAF and other quality incentive programs.Using Microsoft Access build queries, build reports and automate daily tasks that refreshes data from multiple sources.Using data available, identify appropriate targets and assign a priority level to each category of targetsBuild daily Report, for appointment coordinators, to identify targets that are not cancelled, have not been disqualified by appointment coordinators or excluded otherwiseCreate and distribute provider report cards (includes HCC/Quality stats, prevalence of top conditions) to top IPA PCPsCompare HCC/RAF and quality programs electronic data sent to health plans against the data that was received/accepted by the health plansStreamline data sources in order to refresh databases quicklyAccesses proprietary patient, clinical quality and financial performance data from AltaMed’s Data Warehouse and enterprise Data Systems for use in analysis projects.Analyzes external health industry benchmark data to determine AltaMed’s comparative performance in clinical quality, cost efficiency, and patient experience.Leads and manages data analysis projects, including use of quantitative or predictive analytics that support AltaMed’s integration, growth and maximizing value strategic initiatives.Reviews health policy and health care industry information sources to stay current and inform key stakeholders on emerging health care industry issues.Creates summary documentation and detailed informational reports and presentations for AltaMed leadership and management to support business decisions that enable AltaMed to achieve its strategic goals and objectives.Disseminates educational materials pertaining to Clinic Administrator's performance as identified by MHA review and/or internal validation programs.Cultivates and maintains partnerships and collaborations with internal and external business partners.Assists members of AltaMed’s Business Intelligence community and other departmental team members in accessing and analyzing health care data and information.Performs other related duties as assigned.Bachelors in Business Administration in science, social science, public health, health services research or equivalency of a combination of education an directly related experience within a medical area.CPC Certification is a Plus.3 years of experience analyzing and manipulating Healthcare data, including general knowledge of understanding of clinical coding systems (e.g., ICD- 10, CPT, DRG, REV codes)Thorough knowledge of Medicare Risk Model and CMS guidelines, Encounter data submissions, Risk adjustment processing and data validations (RADV) preferred. Proficient using SAS and MS Excel, applies to application of data extraction in various reporting requirements; must have experience in data manipulation using database and spreadsheet applications."}