{"jobID": "2826758826", "jobLocation": "Chicago_IL", "jobTitle": "Data Intern", "companyRating": null, "companyInfo": {"Website": "www.spencerstuart.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1956", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Founded in 1956, Spencer Stuart is the largest privately held global executive search firm specializing in senior-level executive search and board director appointments. With 56 offices located in 31 countries in key regions around the world, Spencer Stuart operates as a partnership and is staffed by more than 400 Consultants with a strong support group of Associates, Analysts and administrative personnel.  Our core business is identifying, assessing and recruiting leaders. Spencer Stuart helps clients find the ideal individual who fits their leadership objectives, tailoring each assignment to reflect clients’ strategic goals and current business situation. The firm is renowned for its work at the CEO, COO and general management levels, and partners with a diverse group of clients across a broad range of industries and sectors. Spencer Stuart conducts more than 4,000 senior-level executive and board searches annually for clients ranging from Fortune 500 companies to private equity-based businesses, start-up companies and not-for-profit organizations. In addition, our consultants advise leading companies on CEO succession planning and provide in-depth executive assessment services.  Spencer Stuart is organized around industry and functional practices throughout all the major business sectors. With senior consultants bringing direct industry experience and knowledge to its specialty practices, the company is focused on responding to and meeting its clients’ unique recruitment needs. Position Summary We are looking for a Data Entry Intern to extract information from contracts to populate a database. There will be an opportunity to help shape and refine the framework for data extraction, and to help with the analysis of the data that is being gathered. The output of this work will be used by a variety of senior stakeholders to make key business decisions. This role will be located in the corporate headquarters in Chicago. Key Relationships Reports to:  Data Scientist Other key relationships: Business Intelligence Team  Finance Team Major ResponsibilitiesEnter data from contracts into an Excel database‘Manage’ the database and suggest revisions to the schema if necessaryWork with Data Scientist to analyze the data and present results to various stakeholders across the firmIdeal Experience:Junior-level college studentFluency in English (written and spoken)Proficient in Microsoft Office SuiteExperience using Excel (knowledge of intermediate functions such as VLOOKUP) applicationsOther Personal CharacteristicsDetail-orientedConfidentialityResearch skills: experience with collecting and organizing information from databases and/or internet resources. Ability to analyze and synthesize data into other formatsAnalytical skills and business acumen Spencer Stuart is an equal opportunity and affirmative action employer F/M/Disability/Vet/Sexual Orientation/Gender Identity"}