{"jobID": "2815630712", "jobLocation": "Cranbury_NJ", "jobTitle": "Sr. Scientist II, Protein Science", "companyRating": null, "companyInfo": {"Website": "www.amicusrx.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Public (FOLD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Shire, Actelion Group"}, "estimatedSalary": null, "jobDescription": " Sr. Scientist II, Protein Science SUMMARY OF POSITION  The successful candidate will have broad experience with the full array skills employed in the biochemistry and molecular biology laboratory. The development, production, and characterization of bio-therapeutic enzymes and proteins is an integral part of this position. Particular importance is placed on the hands-on experience in cell biology, protein purification, enzyme kinetics assays, receptor pharmacology, cell signaling assays, and culture of multiple cell types including stable cell lines, stem cells, and primary cells (e.g. neuronal, muscle, and endothelial cells). Experience with biologic therapies and glycoproteins is strongly preferred.  Roles and Responsibilities Develop lysosomal protein specific assays to evaluate N-linked oligosaccharides on glycoproteins (specialized phosphorylated oligosaccharides)Develop specific reagents for the characterization of lysosomal glycoproteinsDevelop and evaluate novel strategies for targeting and cell uptake of lysosomal proteinsPerform protein purification and analytical characterization during the processSupport assay transfer and process scale upDevelop and qualify analytical assays to support biological drug developmentAccurately interpret experimental data, perform statistical analysis, formulate conclusions and communicate data with colleagues and externallyServe on and/or lead departmental and inter-departmental teamsWrite and review internal and external developmental reports Qualifications and Background Requirements BS in Biology or Biochemistry (or relevant discipline), and minimum of 12 years of relevant experienceMS in Biology or Biochemistry (or relevant discipline), and minimum of 7 years of relevant experienceGeneral biological lab experienceExpression of recombinant proteins using bacterial and mammalian expression systemsEnzymatic or chemical modification of glycoproteinsKnowledge of enzymology, enzyme kinetics and current assay approaches for several enzymatic classes and protein-protein-interaction screening formatsHands-on experience with binding assays (e.g., ELISA, ForteBio Octet, Biacore, flow cytometry, Luminex) and cell-based functional assaysFamiliarity with current plate readers, liquid handlers and other tools to execute assay development and routine screeningKnowledge and experience in enzyme kinetics, assay development, and optimization (colorimetric, fluorescent, and isotopic)GXP experienceExperience with protein characterization including:SDS-PAGE/Western-blot analysisPurification of proteins and enzymes using affinity, ion-exchange, and hydrophobic interaction chromatography using AKTA platformsHPLC/UHPLC chromatography of peptides and small molecules and reverse phase chromatographySteady-state and pre-steady-state kinetic analysesWork within a team structure and on individual projectsExcellent oral and written communication skillsStrong inter-personnel skillsManagement experience Travel 0-5%SDL2017"}