{"jobID": "2828288335", "jobLocation": "Austin_TX", "jobTitle": "Data Mining Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.wholefoodsmarket.com", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (WFM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, Safeway, Trader Joe's"}, "estimatedSalary": "48000", "jobDescription": " Job DescriptionThe Data Mining Team is a center of excellence that provides data-driven solutions through advanced analytics techniques to a broad spectrum of Whole Foods' operations and functions. The successful candidate will be someone who is never satisfied with doing things \"the way they have always been done\", lays awake at night thinking of ways to twist data to gain new insights and very importantly can write the code to execute that vision. The hands-on nature of this role requires the successful candidate to effectively balance his/her own contributions to team deliverables with their need to mentor the rest of the team.  Key Accountabilities Understand and implement data-driven applications and advanced analytical solutions that leverage predictive analytics, data mining techniques, machine learning, open source tools, orchestration tools, Python, R, Spark etc.Understanding data science analytical tools (e.g. Hadoop, Spark, AWS, Azure, Jupyter Notebooks, Alteryx, etc.).Translate complex analytical results into clear, concise and actionable insights to all levels within the organization.Collaborate with Merchandising Operations, Finance, Accounting, Marketing, HR, Tech (IT), Real Estate (site development) and Investor Relations on strategic use of data and analytics. Help fill gaps by solving analytical problems.Maintain a thorough understanding of WFM processes to effectively understand and analyze internal and external data.Aid in the adoption of appropriate methodology and techniques to support analytics within WFM.Keep up-to-date with latest developments in Data Science which encompasses Predictive Analytics and Machine Learning.Performs other related duties as assigned.QualificationsMaster's degree in Computer Science, Statistics, Mathematics or related quantitative field or equivalent experience; 3+ years relevant experience.Ability to take complex business analyses and projects from concept to completion and make the results accessible and relevant to business users at all levels.Self-starter and motivated with a strong attention to detail and commitment to meeting timelines and operating from a sense of urgency.Strong understanding of mathematical and statistical concepts. Experience with utilizing advanced mathematical, statistical and data mining techniques to collect data, analyze and construct solutions for complex business problems.Hands-on experience analyzing large, complex data sets using Python, R, Spark, Java, Scala, Hadoop, Jupyter Notebooks, AWS or any other advanced analytical packages/tools/languagesComfortable with uncertainty: projects and assignments will change rapidly so must be flexible enough to accommodate changing priorities and timelines.Excellent organization and time management skills. Ability to multi-task as well as communicate and reset priorities amidst incoming ad hoc requests with short deadlines.Positive attitude, ability to work well under pressure and provide exceptional customer service. Comfortable in a decentralized structure where results are based on cooperation with and influence of others. Ability to work with partners who have a range of analytical skill sets.Ability to effectively present information and respond to questions in one-on-one and large group situations involving senior leadership and other teams in the organization.Highly skilled at communication (written, verbal and listening), relationship building, influence/negotiation and team buildingWork effectively with others on a team.Ability to travel up to 10%.Ability to maintain confidentiality. At Whole Foods Market we provide a fair and equal employment opportunity for all team members and candidates regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status, or disability. Whole Foods Market hires and promotes individuals solely on the basis of their qualifications for the position to be filled."}