{"jobID": "2831499000", "jobLocation": "San_Francisco_CA", "jobTitle": "Facilities Coordinator", "companyRating": null, "companyInfo": {"Website": "www.juul.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Company: JUULs mission is to improve the lives of the Worlds one billion adult smokers by driving innovation to eliminate cigarettes. JUUL is the number one US-based independent e-cigarette, selling over four million JUUL pods per month. Headquartered in San Francisco and backed by leading technology investors including Tiger Global, Fidelity Investments and Tao Invest LLC, JUUL Labs is disrupting one of the Worlds largest and oldest industries.  Were an exceptional team with backgrounds in technology, healthcare, and biotech, and were growing rapidly to deliver on our mission. Were actively looking to hire the Worlds best scientists, engineers, designers, product managers, supply chain experts, customer service and business professionals. Role and Responsibilities: Reporting to the Director of Facilities the Facilities Coordinator will be responsible for the daily operational needs of multiple facilities at Pier 70 with the ability to prioritize and problem solve in a fast-paced environment. We are looking for a person who can multitask, build vendor relationships, support employee needs, and address building maintenance issues all while providing service with a smile. The key to success in this role will be a positive attitude, and a willingness to help resolve any facility issues that might arise.  This position will be based out of the JUUL headquarters located in the Dog Patch area of San Francisco and will be an hourly position with overtime eligibility. Support the facility needs of multiple suites and teams with a hands on approach and dedication to customer serviceManagement of open facilities service tickets, contracted vendors, janitorial performance, and overall cleanliness of the facilityUnderstanding of lease terms, TIs, and success navigating in a tenant and property management relationshipKnowledge of HVAC, electrical, plumbing, and general construction procedures.Ability to multitask and prioritize the needs of the clients to align with the business goals of JUULCustomer service support related to guest management, catering, event set up, move support and special business needsPERSONAL AND PROFESSIONAL QUALIFICATIONS:Strong written and oral communication skills, and the ability to work in a team environment.Understanding of architectural drawings and the construction processMicrosoft Suite of products including Excel, Outlook, Word, and Power PointFamiliarity with GSuite applicationsHands on approach to problem solving and willingness to self-perform tasksMust be able to lift 40lbsEDUCATION:AA Degree and 2 years of facilities experience4 years of facilities experience in lieu of a degreeJUUL LABS PERKS & BENEFITS:A place to grow your career. Well help you set big goals - and exceed themWork with talented, committed and supportive teammatesEquity and performance bonuses. Every employee is a stakeholder in our successBoundless snacks and drinksCell phone subsidy, commuter benefits and discounts on JUUL productsExcellent medical, dental and vision benefitsWork in the heart of San Francisco, one of the worlds greatest cities"}