{"jobID": "2738612150", "jobLocation": "Hackensack_NJ", "jobTitle": "Variable Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.clickpay.com", "Headquarters": "Hackensack, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Variable Data Analyst  Hackensack, NJClickPay is currently seeking to hire a Variable Data Analyst for our Hackensack, NJ headquarters. ClickPay receives data from our clients, cleanses, modifies and loads the data into our database. The Variable Data Analyst is responsible for the ongoing process of entering and updating data from multiple sources across clients to ensure all data is entered correctly into our database by both manual, and simple excel file-based exchanges. An exceptional candidate will be a quick learner and able to work well with a team. ResponsibilitiesAbility to handle multiple projects and meet client SLAs as well as daily/weekly/monthly deadlines.Ability to work independently to manage ongoing projects.Responsible for the efficient, compliant, timely and secure entry of data and data files.Work with external vendors, clients and internal business and technology staff to accurately gather data sources.Work with a ticketing system to manage open items and enter data and data files accurately.Document data file entry processes, programs and solutions as per established standards.Monitor and administer automated and manual data integration.Assess and document the structure, quality, and compliance of source data and coordinate with business and technology staff to identify and resolve issues.Assist other employees in the data and data file entry and review.RequirementsAssociate’s or Bachelor’s degree in computer science preferred.Significant attention to detail.Experience working with Excel.Experience with handling variable data in multiple file formats and loading of data files into existing database.Strong communication skillsCompany Description As the industry-leading platform for automating real estate receivables, ClickPay accepts all payment methods, including paper checks, e-checks (ACH), cash, and credit & debit cards. ClickPay delivers integrated print and e-bill presentment and payment services to increase operational efficiencies and enable profitable growth. Shaping the future of real estate billing and payments with innovative products and services, ClickPay provides property management companies with customizable solutions to connect with their tenants, residents, and homeowners. To learn more, go to https://www.clickpay.com.Apply for This PositionTo apply, please send a resume and cover letter describing three unique things about yourself, why you would be a good fit, and highlight your strengths for the position."}