{"jobID": "2668813277", "jobLocation": "Princeton_NJ", "jobTitle": "Associate Director, Scientist Clinical Development", "companyRating": null, "companyInfo": {"Website": "www.taihooncology.com", "Headquarters": "Princeton, NJ", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Taiho Oncology, Inc. works urgently to discover and develop innovative cancer treatments. As cancer evolves, we evolve with it—bringing novel technology to cornerstone chemotherapies, while at the same time optimizing new targeted agents. Advanced technology, dedicated investigators, and incomparable facilities—these vast resources empower us to redefine the way the world treats cancer. It’s our work; it’s our passion; it’s our legacy. This position has responsibility assisting in design, execution and reporting of current and future clinical oncology trials ranging from phase 1 - 3. This position serves in assisting the responsible medical monitor or a Lead medical monitor for various clinical phase 1 - 3 trials, as needed.Uses medical/scientific expertise to create or support the creation of relevant clinical documents of high quality such as study concepts, study protocols and reports, investigator brochures, NDA/MAA registration documents and publications.Reviews clinical documents related to clinical studies as outlined by the manager.Builds and maintains effective relationships with clinical key opinion leaders in various different areas of disease in which Taiho is developing drugs.Will collaborate with all department heads within TOI (Head of Clinical Research and Head of Clinical Operations) to establish operational plans and timelines for respective studies within each of the development programs for review by the SVP Clinical DevelopmentKeeps SVP/VP Clinical Development current on status of clinical trials and provides ongoing risk assessments for the study conduct and operational risks.Co-responsible with SVP/VP Clinical Development, Project Management, Head of Clinical Research, and Head of Clinical Operations for delivering the design, conduct, and reporting of clinical trials within agreed timelines.Collaborates with Clinical Operations/trial management in vendor oversight.Continually assesses if adequate resources are available to meet clinical trial deliverables and milestones.Performs other duties as required Educational Requirements: PhD, PharmD or other related Advanced Medical Scientific Degree or equivilant experience Experience: 2-5 years combined experience in academic and/or industry oncology clinical research and drug development.Experience in oncology requiredAt least 2 years in drug development industry in oncology and with previous exposure to clinical development, regulatory and statistical activities such as, e.g., (co-)authoring and reviewing of documents such as clinical trial protocols, statistical analysis plans, IND AR,NDA AR, PSUR, DSUR, IB, ICF, orphan drug designations, regulatory briefing document, etc. is preferable.Ability to critically review and interpret Clinical data Other Skills and Abilities: Working knowledge of the drug development process in the USA and EU is requiredHighly detail and quality oriented.Excellent presentation skills.Ability to learn, integrate complex information, and communicate clinical information in easily understandable fashion to non-clinical team members.Ability to understand and implement prioritization of deliverables as well as recognize and highlight conflicts in prioritiesA positive attitude, flexibility and a proactive thought process Language Skills: Ability to read, analyze and interpret scientific and technical information and data.Excellent English communication skills, both verbal and written Mathematical Skills: Ability to work with mathematical concepts such as probability and statistical measures Reasoning Ability: Ability to define problems, collect data, establish facts, and draw valid conclusions.Ability to interpret an extensive variety of technical information and deal with several abstract and concrete variables Computer Skills: Strong computer skills in MS Office products Physical Demands: While performing the duties of this job, the employee is frequently required to sit, talk and hear.The employee is occasionally required to walk.Must be able to travel domestically and internationally on a reasonably frequent basis -approx. 15-20% of time including some weekend travelDomestic and international travel includes spending time at cancer trial sites/institutions,conference centers, offices and hotels Work Environment: The noise level in the work environment is usually quiet. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions."}