{"jobID": "2813786632", "jobLocation": "Roseland_NJ", "jobTitle": "Technical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.matlensilver.com", "Headquarters": "Bridgewater, NJ", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Matlen Silver is looking for a seasoned Technical Analyst for one of our direct clients!  Location: Roseland, NJ  Job Type: Contract-to-hire  Visa Sponsorship: No Technical Business and Data Analyst This is a contract-based senior position based in Roseland, NJ responsible for developing  innovative, scalable, highly interactive and engaging applications. In this role, the Technical  Business and Data Analyst is specifically responsible for the business process flows, user stories  and functional requirements deliverables for the new, conversation-based  application across mobile, desktop, tablet, and wearable devices.  You’ll work closely with a small team of front-end designers, data scientists, developers, and  research specialists who will value your expertise in defining light weight, yet compliant  processes that makes the experience of our product more intuitive, useful and delightful. You  are comfortable collaborating but equally capable of working independently. Responsibilities ● Develop clear and consistent processes, user stories, and requirements for employees,  managers, and practitioners - with input from the team as necessary  ● Analyze competitor and vendor products to determine gaps and prioritize features  ● Write technical and functional specifications for development teams  ● Craft user experiences that communicate exactly the right message to the right person  at the right time Minimum qualifications ● 5+ years experience in software development and delivery  ● Able to read logical and conceptual data models  ● Experience writing functional and technical specifications across multiple platforms  ● Proven track record in building software for enterprise users  ● Demonstrable knowledge of event-based systems  ● Able to break down complex product development processes into simple, iterative  releases  ● A problem solver who thrives in a fast-paced environment  ● Excellent communication skills and an impeccable eye for detail  ● Strong commercial focus and the ability to prioritize tasks accordingly Preferred qualifications ● Deep understanding and experience with global Staffing processes  ● Has worked on a scrum team as either the leading PO, or as a Business Analyst providing user stories ● Subject matter expert in Human Capital Management General skills ● Communication: understand and express ideas / solutions in a comprehensive and  practical format – knowledge sharing  ● User Focus: an absolute focus on the user (internal or external) experience – every  aspect of a solution should be productized for ease of use  ● Improvisation: the ability to think across disciplines and existing boundaries  (technologies / business / geographies) – lateral thinking  ● Collaboration: teamwork with a positive approach to ambiguity  ● Research: an inclination to continuous research inside and outside the current focus  fields  ● Abstract Thinking: view of ideas and solutions as abstractions / patterns that can be  leveraged / adapted / reused – deliver frameworks instead of point solutions About Matlen Silver Matlen Silver is the hardest working staffing team in the U.S. We do what we know is right for  consultants and companies, creating a unique and powerful recruiting and talent experience. When  the rubber meets the road, Matlen Silver is the powerhouse that cuts through the nonsense and gets  you the job you want—and deserve. If you are a rock star go-getter with a proven track record of  success, put us to the test!- provided by Dice  Analyst, Data, Software Development, Data models, Human Capitol Management"}