{"jobID": "2820902268", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.metabiota.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "119000", "jobDescription": " The Job  Metabiota, Inc is seeking a full-time Data Analyst with a background in public health to collect and collate epidemic data and perform analysis on these data sets. The position is available in our San Francisco office, or as a remote based position in the Washington, DC area.  Who We Are and What We Do  Metabiota is the pioneer in comprehensive risk analytics that help protect global health. Built on a strong foundation of scientific expertise, including a worldwide network of on-the-ground experts, Metabiota delivers actionable, data-driven analytics to help countries and corporations mitigate complex issues. With a strategic global presence and sustained partnerships, Metabiota's agile approach helps identify, analyze and transfer the risk associated with biological threats. The company's international footprint includes operations in nearly 20 countries and offices in San Francisco, Canada, Cameroon and the Democratic Republic of the Congo. For more information, visit www.metabiota.com.  Who You Are  You are a self-motivated, enthusiastic, extremely intelligent problem solver, who enjoys tackling difficult, real-world problems. You are adept at finding information on the internet, pay meticulous attention to detail, and take pride in doing a great job. You have a good understanding of infectious diseases and public health principles. You are an Excel expert, and are well versed in database principles and data analysis programs, especially R. You work well as part of a team and are also able to work independently. Responsibilities:Collect information on infectious disease outbreaks from public sources as well as other formal and informal sources.Collect and collate information on drivers of disease emergence, such as public health infrastructure, population movement, and biodiversity, among others.Clean and standardize large datasets.Develop and implement new R scripts to transform and/or analyze datasets.Provide general analytic and epidemiological support to different parts of the organization.Assist in ongoing evaluation of data to ensure data quality standards are met.Maintain open-line communication, facilitating meetings and other forms of interactive engagement for productive discussion with program personnel, program stakeholders, etc.Other duties as assigned to support regional requirements and Scopes of Work.Skills and Experience required:Demonstrated skill in collecting and manipulating data.Adept at sourcing information from multiple internet sources.Significant experience using software such as Microsoft Excel, Access, and R.Good understanding of infectious diseases and public health principles.Ability to work in a fast paced, agile development environmentSelf-motivated and able to work independently with minimal direct supervisionExcellent interpersonal and communication skillsEducation:B.Sc. in biology, health information sciences, public health, epidemiology, or related life-science (required)Statistical analytical skills preferred.Second language proficiency a plus (written Chinese, Arabic, French etc.,) This is a contract to full-time position. No relocation or work visa sponsorship available."}