{"jobID": "2811027912", "jobLocation": "Houston_TX", "jobTitle": "Data Mapping & Validation Analyst- Loan Transfers", "companyRating": "3.9", "companyInfo": {"Website": "www.shellpointmtg.com", "Headquarters": "Greenville, SC", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Selene Finance, BB&T, Reverse Mortgage Solutions"}, "estimatedSalary": "72000", "jobDescription": "Summary: Contribute to the Mapping, Validation and Activations team in Loan Transfers. Ensure all loan transfer data mapping is completed according to existing processes and procedures. Maintain all SLA’s within the transfer timeline while aiming for zero defects within the transfer. Act as the accountable party for all assigned data mapping from start to finish. Data Mapping is responsible for all data that is loaded into Servicing Director for transfers assigned to the analyst. Responsible for loan data, payment histories, and comments being added to all incoming loans. Work with the Supervisor to create, document, improve and enforce department policies, procedures, and SLA’s. Responsibilities:Map all data using SDI from prior servicers to SMS’ systemsValidate all data using internal checks as well as validating with operational business units who are the owners of the data.Activate loans per the schedule set by the Deal Managers to ensure legal and contractual compliance.Maintain stated performance level for all assigned transfer mapping and validationSME and business owner for the Servicing Director Import Tool (SDI) leading the changes and direction it needs to goFollow established processes within the group to ensure maximum efficiency of the process and other company resources.Develop with management solid data validation routines for all Level 1 Data Mapping Analyst reviews which are completed by this Mapping team.Maintain and update exceptions in SDI from SCSM tickets submitted to improve quality downstreamEnsure reported errors have an SCSM ticket available to track mapping changes. This includes communicating to individual business units to create ticket before mapping is changed.Maintain and update exceptions in SDI regarding transfer errors and work with the Portfolio Management and Deal Management groups to improve processes and eliminate upstream transfer errorsContribute to the creation, manage and deliver reporting to senior management of the timeliness and accuracy of the groupAssign SCSM tickets to Deal Managers and individual business units for data sign-off for all preliminary data mapping within stated SLA.Perform Level 1 review of each transfer data mapping at prelim and final for all assigned transfers. This should be performed prior to the Level 2 review of the Deal Manager or setting up for Level 3 review from the business units.Run automated review checks for all transfers at prelim and final for all assigned transfersResponsible for each assigned transfer meeting the established mapping SLAs.Balance all transfers from loan set-up prior to activation using the designed process and formOther tasks or responsibilities as assigned by management.Qualifications/Skills:Excellent interpersonal skills when dealing with internal and external groupsStrong skills with project management, process management, and documentation thereofSignificant SQL querying and analysis experienceExpert in mapping data between two different systems while ensuring data integrityExpert in the analysis of and the reconciliation of differences in dataSignificant experience in Mortgage Servicing & all underlying data that drives how the business operatesEducational Requirements:College or university degree in the field of Business, Data Analysis, computer science, process improvement, project management, etc. or significant experience in the field Work Schedule & TravelTypical work schedule is Monday – Friday, 8:00 – 5:00 with some minor flexibilityCertain after hours/weekend work may be necessary for projects or high business volume situationsAfter hours/ weekend email monitoring to ensure internal, client and homeowner satisfaction with transfers.Up to 10% travel to other company locations for projects, training, etc."}