{"jobID": "2828116416", "jobLocation": "Interlochen_MI", "jobTitle": "Academic & College Counselor", "companyRating": null, "companyInfo": {"Website": "www.interlochen.org", "Headquarters": "Interlochen, MI", "Size": "201 to 500 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title Academic & College CounselorLocation Academic/College CounselingDepartment Name 1420-Academic/College CounselingDescription Interlochen Arts Academy seeks an experienced part-time academic and college counselor with a passion for the arts and academics. The part-time academic and college counselor will advise and assist students and families on issues related to curriculum, standardized testing, and the college applications. In addition, the counselor will provide academic support to ensure students are utilizing the available resources.  The part-time academic and college counselor will advise and assist students and families on issues related to curriculum, standardized testing, and the college applications. In addition, counselor will provide academic support to ensure students are utilizing the available resources.  The part-time academic and college counselor will: Oversee the college application process for every Junior, Senior and PG assigned to him/her.Monitor each student’s academic/artistic progress.Educate and communicate with stakeholders (students, parents, faculty, staff, and educators) on the college admissions process.Meet with all assigned students to map out a plan for academic course selection and registration, summer plans and college admissions.Teach college-counseling workshops throughout the year.Write letters of recommendation and advocate on behalf of students when communicating with college representatives.Assist with course schedulingDemonstrate proficiency in MS Office, Google Drive, Docs, and Spreadsheets. The part-time academic and college counselor will effectively communicate with students, parents, faculty and colleges while maintaining a clear, honest, and appropriate plan of action in regards to academics, arts and applications. Counselor will make independent decisions regarding their advisement of both curricular choice and post secondary options. Qualifications: Candidates for this position will have a Bachelors degree, though a Masters in Counseling, Psychology, or another related field is preferred. Experience in academic/college counseling at the high school level or college admissions is strongly preferred. This position works as part of a six person office and must have excellent communication skills. The work is deadline driven and highly student centric in nature. Additional Information:Compensation: A competitive salary and benefit package is being offered, commensurate with experience and qualifications. Lunch is provided when Dining Services is open. Application Process:Required documents for application are: cover letter/letter of interest, resume and a current listing of three references. Please upload your documents in a pdf format during the submission of the application process by selecting \"Apply and continue to upload documents\" button.  Review of materials will commence immediately and continue until the position has been filled. Materials submitted will be held in strictest confidence, and references will not be contacted without the permission of the applicant. The next step of the application process will ask you a series of questions, some are required by the EEOC concerning Protected Veteran Status and Voluntary Self-Identification of Disability. For more information please view the following hyperlinks. EEOC Voluntary Self-Identification of Protected Veteran Status  Voluntary Self-Identification of Disability More information about Interlochen Center for the Arts: Interlochen Center for the Arts description  Interlochen Center for the Arts is the recipient of the National Medal of Arts and the only organization in the world that brings together: a 2,500-student summer camp program; a 500-student fine arts boarding high school; opportunities for hundreds of adults to engage in fulfilling artistic and creative programs; two 24-hour listener-supported public radio stations (classical music and news); more than 600 arts presentations annually by students, faculty and world-renowned guest artists; a global alumni base spanning eight decades, including leaders in arts and all other endeavors. For information, visit Interlochen online at www.interlochen.org.  Interlochen Center for the Arts MISSION…  To engage and inspire people worldwide through excellence in educational, artistic and cultural programs, enhancing the quality of life through the universal language of the arts.  Interlochen Arts Academy MISSION…  Interlochen Arts Academy provides artistically gifted high school students pre-professional arts instruction, college-preparatory education and life skills development. THE CORE PURPOSE… To ignite lifelong passion for the arts THE CORE VALUES… Nurturing, Inspiring,Transforming, Enlightening and Enduring Interlochen Center for the Arts includes: Interlochen Arts Academy  Interlochen Arts Academy, a fine arts boarding high school, offers the highest quality artistic training combined with comprehensive college-preparatory academics. The Academy also offers post-graduate opportunities.  Interlochen Arts Camp  Young artists from around the world gather at Interlochen each summer to learn, create and perform alongside leading artists and instructors. Programs are offered to students in grades three through twelve.  Interlochen College of Creative Arts  Adult artists thrive on opportunities to learn and express themselves creatively. The College of Creative Arts offers programs in a variety of arts disciplines.  Interlochen Public Radio  Classical Music: 88.7 FM, Interlochen; 88.5 FM, Mackinaw City; 94.7 FM, Traverse City and 100.9 FM, East Jordan/Charlevoix  News Radio: 91.5 FM, Traverse City; 90.1 FM, Harbor Springs/Petoskey; 89.7 FM, Manistee/Ludington  Streaming online at ipr.interlochen.org. Through two listener-supported broadcast services, Interlochen Public Radio (IPR) connects northwest Michigan with arts, news and culture on a global scale. IPR also gives significant focus to local and regional news, information and artists.  Interlochen Presents  Interlochen brings dozens of world-renowned artists to northwest Michigan, enhancing the region’s position on the global arts map. Interlochen presents more than 600 events each year by students, faculty and guest artists, making Interlochen one of the nation’s largest arts presentersSelf Identification Text Our company is an equal opportunity employer that supports workforce diversity. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, race, gender, veteran status, disability or other protected category. To allow our business to evaluate their diversity recruiting efforts, and as a government contractor with regulatory reporting obligations, we collect information about race/ethnicity and gender during our application process. Your cooperation is appreciated in providing the information below, which will be used by our business for statistical reporting and any required government reporting (Responding to this request is voluntary and this information will not be used in assessing your qualifications for any position)."}