{"jobID": "2792569573", "jobLocation": "Los_Angeles_CA", "jobTitle": "Entry Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We are looking for a Entry Level Data Scientist to join Uptown Treehouse's expanding Data Science team. This person will be crucial to our efforts to provide richer insights to our clients in order to help them develop stronger strategies for earning attention that leads to a higher share of heart and share of wallet.  Functionally, the hire will be responsible for creating pipelines to APIs, managing and sorting acquired data into databases, as well as analyzing data sets and building UIs to display data and insights for reports both internal and external. This person will be a conduit to both our Strategy and Creative teams, providing clean data with initial insights.  The ideal candidate is an expert in python with packages such as Django/Flask and has experience building both UI and Restful APIs with MongoDB databases on top of AWS architecture. In addition, the hire must have strong analytic skills and be familiar with Pandas and general machine learning packages such ask SKLearn. They must be self-directed and motivated. This position will require supporting the data needs of multiple teams, systems, and products. The right candidate will be excited to help Uptown Treehouse leverage data-driven technologies to deliver strategic insight and intelligence as well as create new data-related services to offer. Essential Job Functions:Build data pipelines capable of fetching data from both APIs and UIs (e.g., Facebook, Instagram, Google, etc.)Build and manage relevant databases for the data pipelineIn tandem with the different teams, build a python based UI capable of performing data analysis and returning reports for clients and internal teamsProvide technical expertise in analytics methodologies, performance measurement, and running research using advanced analytical and experimental social and digital platformsResearch and development of emerging technologies that can be used for improving digital and social intelligenceLead ad-hoc projects within the agency; collaborate with internal teams to quickly get up to speed on new technology, challenges, and/or opportunities and help drive the solutionDevelop new client services with the data teamQualifications:Minimum 2-4 years of experience in Data Science or Data Analysis with an agency, brand, or an established media companyMinimum 2-4 years of experience with python relevant packageBachelor's Degree in computer science or a Graduate Degree in a Quantitative FieldMinimum 1-2 years in a digital marketing and/or social media analytics-based roleCandidates with experience with database and AWS highly preferredBasic to advanced skills with XML, HTML5, CSS, and JavaScriptFamiliarity with digital management and reporting tools (e.g., Google Analytics, Omniture /SiteCatalyst, and CoreMetrics), social SaaS platforms (e.g., Sprinklr and Spredfast), and listening tools (e.g., Radian6 and Crimson Hexagon)A clear understanding of key digital and social measurement metrics and reporting techniques required to optimize the effectiveness of campaignsDemonstrated ability to think critically in a strategic and creative mannerStrong research skills, both qualitative and quantitativeAbility to effectively multitask and work seamlessly with cross-functional teams in a deadline-driven environmentHigh level of attention to detail and emphasis on the integrity of workA strong communicator, both written and verbalSDL2017"}