{"jobID": "2710989813", "jobLocation": "Chicago_IL", "jobTitle": "Big Data Java Engineers", "companyRating": null, "companyInfo": {"Website": "www.olooptech.com", "Headquarters": "Aurora, IL", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "REQUIRED Skills: 1.Java Developer (candidates must be tool agnostic and be open to not only coding in Java but also Python or Perl, etc.) SpringRestful API (producing and consuming)MicroservicesSpark or KafkaAgilePLUS: Ab Initio & Docker would be nice to have's but are not required.Job Description: Transunion has an immediate need for a Big Data developer to join their team to help with two major products (Shape & Prama). The candidate will be involved in new development building and adding features to these products and in addition will be helping phase out some of the legacy technology that is utilized for these products. This is an opportunity to join a 30 Petabyte environment and work directly with 3 petabytes of data.  Over the last year TransUnion has set up an environment to do self reporting (Shape) shared analytics platform. This is essentially a big hadoop hive mapr cluster where they dump every piece of data they can get their hands on. This team is responsible for getting this data from the source system to the shape platform. Ab Initio is the primary ETL application that drives this. It is picking up flat files that are dropped from different source systems, sucking it in and cleansing it, and then pushing into MapR Hive.  In addition to Shape you will be working on an Transunion's external product Prama.  The Prama portfolio consists of three flagship solutions: Prama DataHubPrama InsightsPrama Studio**Prama DataHub is built on a world-class, big data architecture and houses TransUnion proprietary data, along with credit, non-credit, and public records data. Prama Insights delivers on-demand, 24/7 customer access to massive, depersonalized data sets and key analytics for portfolio understanding, benchmarking, and peer analysis. Prama Studio empowers you to create, test and manage attributes that support model development to achieve your growth, risk and compliance goals. Prama DataHub includes extensive data management capabilities for cleansing, linking and matching, plus a module for archive data extract.  \"Prama Data Extract provides self-service access to 100% of TransUnion's depersonalized, archive credit data through secure overnight delivery. **Prama Insights currently offers three modules that allow customers to subscribe to the information and benchmarks they deem most valuable. \"Vintage Analysis allows for seven years of depersonalized credit performance comparisons between portfolio segments.  \"Market Insights provides quarterly views into depersonalized market credit activity and delinquency trends.  \"Benchmarking allows you to measure your performance across 60 months of data and compare it to the industry and your peers  Prama Insights provides customers the specific insights they need to grow smarter and make better business decisions. **Prama Studio currently offers one module to help you extract more value from big data. \"Attribute Manager: allows you to develop attributes, modify attribute definitions, and centralize the development and management of attributes.  This role is for a services engineer that will operate as a member on one of the core teams responsible for enabling new features and optimizing strategic Analytics platforms across TransUnion. Our multi-Petabyte platforms support a diverse community of internal and customer-based data scientists, statisticians, modelers, product developers and data strategists.  As a contributing member on one of our agile development teams, you will have both the accountability and freedom to build systems that are taking TransUnion to the next level. Success in this role requires a blend of skills in the following technology areas:  \" Agile (Scrum) SDLC  \" Services and Micro-Services  \" Relational Database Design  \" API & Interface Design  \" Systems Engineering ( \"DevOps )  How You'll Contribute  \" Function as a core team member within one of our Agile teams building service applications and micro services that support the Analytics platforms of TransUnion  \" Deploy and Implement leading-edge analytics environments including software, end-user tools and other data services  \" Collaborate with product owners and team members on requirements and implementation approaches for addressing demand and challenges  \" Design and Develop tools and services enabling end-user productivity and system integrations  \" Partner with business resources to troubleshoot issues, manage capacity, and plan for the optimization and expansion of environments  \" Assist in technology innovation activities such as research, evaluations, and prototyping  \" Train, coach and support users on environment, tools, data and services  \" Maintain and ensure availability and quality of systems  What You'll Bring  \" Five or more years of hands-on experience in a software development profession  \" Proficiency with one or more programming languages (Java, Python, Scala, C/C++)  \" Proficiency in SQL, relational and non-relational databases, query optimization, and data modeling  \" Proficiency working in a Linux-based environment, including shell scripting and basic system administration  \" Experience with Big Data tools, such as Hive, Spark, and Drill  \" Experience working on teams operating under an Agile Scrum delivery methodology  \" Experience working within CI/CD environments and a passion for automation and system quality  \" Excellent analytical skills and the ability to provide alternative solutions to technical problems  \" Strong written and verbal communication skills  \" Bachelor's degree in Computer Science, Information Systems Management or equivalent experienceAdditional Information: This team consists of 3 separate agile teams  They will be impacting TU's financial and insurance customer segments  This will be adding new capabilities as well as tearing down old environment."}