{"jobID": "2737968420", "jobLocation": "Alexandria_VA", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.panderasystems.com", "Headquarters": "Orlando, FL", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": " Pandera prides itself in being a leader in the analytics field, creating an artful blend of analytics and product expertise to create beautiful, data-driven products and platforms. Our mission is to remain the leader in existing and emerging toolkits. We accomplish this by promoting your continuous development, both personally and professionally.  Pandera is now looking to expand our success by continuing to build our team of passionate, curious, and creative engineers, product developers, data gurus, and UX experts! Join us!  As the ideal Data Scientist, you are someone who can do a deep technical dive and communicate effectively with others. You love wrangling messy data into an elegant solution, and helping others understand the power of their data. This role is a chance to have a huge impact on how millions of users collaborate. As a Data Scientist at Pandera, you will...Partner with cross-functional teams focused on product improvements to insightDive deep into a wide range of data (behavioral, financial, etc.) to identify opportunities and recommend solutionsContribute to data team initiatives focused on ensuring fast, reliable, and comprehensive dataServe as a trusted consultant and promote data literacy across the companyWork with Redshift, Python, R, JavaScript/CoffeeScript, and MongoDB to unblock data questions. Experience in these isn’t a requirement for applying, but you’ll get exposure to them on the job.Do your best work in a fun, respectful, and supportive environmentYou may be ideal for the position if...You have experience analyzing data in a business setting. You know how to pick the right approach for a question, from statistical models to A/B tests to data visualizations. You know that sometimes the simplest solution is the best.You are creative and resourceful, with a passion for deriving insights from data and telling a story.You’re great at collaborating with non-technical consumers of data.You’re curious about the business side of – well business. You’re eager to get to the guts of our customer’s data in order to answer questions across the company.You’re self-motivated and thrive when working autonomously. You know when to run with something, and when to ask for help.You’re extremely proficient when it comes to writing SQL and Python/R, and you know how to write code to answer complicated questions and expose useful data.You strive to master any technology or language that is needed or useful.You’re a fast learner, adept at prioritizing, and can bring good opinions to the table.Bonus points if…You have experience working ina consulting capacityYou have worked with some seriously huge datasetsWhat do you get out of this? You’re a hot commodity and having you on the team would be an honor to us! Here’s some of the ways we pay it forward to recognize your contribution to our vision! Be Healthy Health, dental, and vision offered through top tier providers and unlimited sick leave to keep you feeling at the top of your game. Be Inspired Collaborative workspace and unlimited vacation to keep your mind fresh and ready to take on the next new idea. Be Supported A large network of industry experts, internal training platform, and external learning opportunities to grow your skills and experience. Additionally, we offer a phone plan so you can reach out whenever you would like. Be a Team Team outings, happy hours, passion presentations, volunteer opportunities, meetups, etc. we are creating a community to continuously share and grow as a team."}