{"jobID": "2711447524", "jobLocation": "San_Francisco_CA", "jobTitle": "Quantitative Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.firstrepublic.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1985", "Type": " Company - Public (FRC) ", "Industry": " Finance", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Silicon Valley Bank, City National Bank (Texas)"}, "estimatedSalary": "98000", "jobDescription": " OverviewFirst Republic is an ultra-high-touch bank that provides extraordinary client service. We believe that one-on-one interactions build lasting relationships. We move quickly to serve our clients’ needs so that their financial transactions are handled with ease and efficiency. Client trust and security are paramount in our line of business. Ultimately, our goal is unsurpassed client satisfaction which will lead to personal referrals – our number one source of new business.  We recognize that our competitive advantage starts with our people and our culture. At First Republic, we work hard and move quickly as a very coordinated team. If you are looking for an opportunity to grow and contribute in a fun, fast-paced environment, First Republic is the place for you. We have exceptional people focused on providing extraordinary service.ResponsibilitiesDuties and Responsibilities:Start-to-finish development of credit loss forecasting models in R for CECL modeling. This includes writing of code, the training / fitting of the model parameters, and working with model validation team.Independent model testing including evaluation of mathematical soundness, developmental evidence, historical performance, statistical testing, back testing, model benchmarking, and appropriate sensitivity analysesFull documentation of the model development process, any associated testing performed, any and all modelling assumptions (particularly management assumptions), and relevant control and governance processes surrounding the model.Respond to model scrutiny and inquiries from both internal and external validators as well as federal regulators to ensure conceptual soundness, model accuracy, and robustness.Team work is essential for the position. Challenge and validate models created by other members of the Finance team or other departments throughout the bank.Assist in data collection, extraction, scrubbing, validity and sanity checks, transformation, and validation for a variety of projects.Perform other ad-hoc data analysis including business intelligence on customer behaviors, general business support through data collection and processing.Proactively identify opportunities for efficiencies and improvements to processes and controlsSignificant cross-departmental and senior management exposure and interaction. Strong communication and interpersonal skills and ability to explain complex modeling techniques to the management teamMaintain knowledge of changes in the regulatory environment to help the team manage the dynamism in the industry.Perform duties & responsibilities specific to department functions & activities.Performs other duties & responsibilities as required or assigned by supervisor.Additional responsibilities include: (1) adhering to and complying with the applicable, federal and state laws, regulations and guidance, including those related to Anti-money laundering (i.e. Bank Secrecy Act, USPATRIOT Act, etc.) (2) adhering to Bank policies and procedures, (3) completing required training, (4) identifying and reporting suspicious activity to the AML Officer, and (5) knowing and verifying the identity of any customer(s) that enters into a relationship with the Bank. QualificationsThe candidate should have excellent programming skills in R and SQL. The person will develop credit loss models to meet the FASB ASU 2016-13 accounting standards, which is aka Current Expected Credit Loss (CECL) and fundamentally changes the way U.S. financial institutions calculate and hold allowance for loan and lease losses (ALLL). The candidate will be an integral member of the Finance department. Functions of the position include: Advanced degree in data science, statistics, engineering, applied mathematics, economics, finance or a related fieldMinimum 2 years of relevant corporate work experience working on computer programming, analytics, or quantitative modelingAbility to work effectively in a team environment under guidance of senior team members, both with internal and external resourcesStatistical skills and experience with languages like RAbility to work with large databases and write queries using SQLMust be highly analytical, technical, and quantitativeCandidate must be team-oriented, able to juggle multiple tasks, and comfortably work and deliver high-quality results under tight deadlinesAbility to write high-quality model document The Finance team seeks to hire people who can fulfill First Republic's corporate values, which include 1) doing the right thing, 2) providing extraordinary service, 3) respecting the team, 4) taking responsibility, 5) thinking positively, 6) moving forward, moving fast, 7) growing, and 8) having fun. Physical Requirements:Vision must be sufficient to read data reports, manuals and computer screens.Hearing must be sufficient to understand a conversation at a normal volume, including telephone calls and in person.Speech must be coherent to clearly convey or exchange information, including the giving and receiving of assignments and/or directions.May be required to lift 25-50 lbs.Position involves sitting most of the time, but may involve walking or standing for brief periods of time.Must be able to travel in a limited capacity."}