{"jobID": "2386975987", "jobLocation": "Washington_DC", "jobTitle": "Sales Development Representative", "companyRating": null, "companyInfo": {"Website": "www.jifflenow.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Location: USAExperience: 2+YrsCompensation: AS PER INDUSTRY STANDARDQualification: Bachelor’s degreeWorking at JifflenowJifflenow is a Sillicon-Valley based company that has occupied a leadership position in enterprise meeting scheduling and analytics space. At a time when most event marketing solutions were still solving automation pain points, we asked why meetings should not be measurable. Today over 150 of the world’s largest companies use Jifflenow to not just schedule important executive meetings at events but measure their outcomes and success rates. We’re backed by Accel Partners and Saama Capital and Jifflers are spread over 3 offices in San Jose, Sacramento, and Bangalore, India.In this role you will:Develop in-depth knowledge about the events and meetings spaceEvangelize and educate the market on Jifflenow’s platform and applicationsGenerate new business opportunities through face-to-face meetings at events, strategic outbound calling and emailing into large, enterprise companiesEstablish, build and nurture relationships with senior sales and marketing executives at prospect companies by developing an understanding of their business, the challenges they face, future projects and plans in order to address their needs with JifflenowQualify inbound leads and turn them into actual appointments for Account Executives (AE)Achieve monthly and quarterly quota of the number of new demos set up for AEsPartner with experienced AEs as well as Email Marketing & Market Research teamsRecord prospect interactions and statuses regularly in Salesforce.com to ensure efficient lead managementRun Account Based campaigns to convert Jifflenow’s strategic prospect accountsHave fun!In terms of skills, you will need to:Understand the event technology landscape and customer needs so you can effectively position JifflenowProvide support for account-based marketing activitiesPitch the product to prospects at live eventsCall into prospect accounts and build relationships to get Jifflenow introducedHave excellent verbal and written communication skillsBe familiar with consultative selling methodologiesPossess a self-starter attitude with the ability to work in a dynamic environmentHave strong verbal and written communication skillsBe a team player willing to work across regionsOur requirements and preferences:Bachelor’s degree2+ years’ experience30% travel (mostly within USA, some international likely)Preferred locations (not a necessary factor for the right candidate)Jifflenow office locations: Sacramento, San Francisco Bay AreaOREvent destinations: Chicago, Las Vegas, New York, Philadelphia, Washington DC, Miami, San Diego, Phoenix, Atlanta, DallasThe Jifflenow ‘COMMIT’ cultureWe chose to build our culture code based on the word ‘COMMIT’ because every meeting and sales advancement discussion is based on people committing their time to a common cause. As a result, we wanted the word COMMIT at the very core of how we build, sell, and grow as a company. The key traits of a Jiffler are as follows:Coaches and celebrates talent. You will find every Jiffler ready and willing to help you do a better job. And recognizing you for being awesome.Obsessed with customer success. Yes, all of us ensure we contribute to an excellent customer experience, right from the very first time you hear from us.Motivated and purpose driven. We are extremely goal-oriented, so we plan, prepare and execute.Magnificent, all-star team member. Jifflers work in groups because we believe that’s how we do our best work.Integrity, open and transparent. We all respect, support and care for each other.Thankful for everyone’s support. You will always find people here are thankful for every little thing you do for them.Do you want to be a part of this COMMIT culture? Let’s start the conversation today."}