{"jobID": "2651155764", "jobLocation": "Chicago_IL", "jobTitle": "Consultant, Data Engineering - New York", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "76000", "jobDescription": " The Analytics talent community at Avanade is responsible for designing and developing analytics solutions for our clients. From infrastructure to architecture to engineering to end-user reporting and collaboration, our team enables organizations to make use of data-driven insights to understand context, make better decisions, and ultimately realize direct value from their data assets.  As an Analytics Architecture Consultant, you will work on client solutions involving the design, planning, development, and support of enterprise-grade analytics infrastructure and architecture. You will help gather requirements, conduct proofs of concept and pilots, engineer and deploy solutions, and provide support and training to our clients. You will also serve in an advisory capacity to our clients, providing thought leadership and best practices on modern analytics architectures, data strategy, and digital transformation.  Day-to-day, you will:  Gather client requirements and deliver logical and physical solution architectures, following industry best practices  Understand business objectives, and maintain a focus on business outcomes  Establish governance protocols, support systems, and training materials to support solutions within clients internal BI and Analytics organizations  Conduct proofs of concept and technologies to educate clients and assess their needs  Develop data storage and modeling solutions using tools such as SQL Server, Azure SQL Data Warehouse, Azure Data Lake, and Hadoop  Engineer data pipelines using ETL tools including SSIS, Azure Data Factory, U-SQL, and Polybase  Profile data, understand and improve data quality, and bring best practices in data management to our clients  Support complex event processing, streaming, and IoT client solutions using tools such as Azure Event Hubs and Azure IoT Hub, Azure Streaming Analytics, and Azure Functions  Deliver data to end user experiences using tools such as SQL Server Analysis Services, Microsoft PowerBI, and downstream applications and REST Services  Travel as needed.Qualifications"}