{"jobID": "2674303233", "jobLocation": "Troy_MI", "jobTitle": "Quality and Patient Safety Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.wspg.org", "Headquarters": "Troy, MI", "Size": "Unknown", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "Quality and Patient Safety Data Analyst Wayne State University Physician Group, one of Southeast Michigan’s largest multi-specialty Physician Practice Groups, is currently seeking qualified candidates to join our Budget and Decision Support team located in Troy, MI.  As a Data Analyst, you will be responsible for: Development and presentation of quality and patient safety data to and for various constituents.Under the leadership of the Medical Director, QPS and the QPS Program Manager, work with other administrative groups to develop reporting methods/tools, and an analytic approach to QPS data.Develop a report to track MACRA activities and other quality initiatives.Develop and implement data analyses, data collection and other strategies that optimize statistical efficiency and quality.Acquiring, collating and distributing data from primary and secondary data sources and maintaining databases.Interpreting data, analyzing results using statistical techniques.Design and data integrity for related databases and processes Required Qualifications and experience: Bachelor of Science or Business required, with major in mathematics, economics, computer science, statistics, or information management preferred.Health care experience preferred.Technical expertise regarding data models, database design and reporting.Strong knowledge and experience with reporting capabilities (examples: Cognos, SQL, XML).Strong analytic skills with the ability to collect, organize and analyze data and development of reports to share that information.Minimum 5 years’ experience. We offer a competitive salary and benefits package, including a retirement plan with a corporate contribution, free parking and tuition reimbursement. Qualified applicants please submit resume and salary requirements.  E.O.E"}