{"jobID": "2825073621", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Calling all Data Analysts! Come join our team of professionals in Washington, DC!  Kiliuda Consulting, LLC provides expertise in the areas of Information Technology Consultation Services, User and System Virtualization, Information Research & Analysis, Cyber Security, Program Management, Administrative Services, and Document Management. Kiliuda is an 8(a) Program certified, Alaska Native Corporation (ANC)-owned, Small Disadvantaged Business (SDB). We are a subsidiary of Three Saints Bay, LLC, which is owned by Old Harbor Native Corporation. Our Corporate Headquarters is located in Anchorage, AK and our Corporate Office is in Manassas, VA.  Data Analysts perform, but are not limited to, the following duties:  Principally perform high-level scanning of master file documents to convert them into an electronic format  Provide meticulous organization and management of case files, to include sorting and categorizing documents prior to scanning  Analyze documents to ensure proper placement in physical files  Review data for accuracy (completeness of information, proper execution, no duplicate data)  Interpret data for proper execution in records management database  Establish/maintain physical file to include proper placement of documents as they are created  Disseminate significant amounts of information with attention to detail and accuracy  Perform word processing tasks  Perform data entry and metadata entry for electronic documents  Reconcile inconsistencies  Gather information and organize investigative packages, case files, or presentations  Obtain additional information from other investigative agencies/databases  Verify information and files against tracking system  Maintain internal status information on the disposition of designated information and files  Distribute and receive documents  Assist Analyst or Government Official in obtaining/collecting all documents/information to complete case file  Provide administrative information and assistance concerning case or file to other agencies or organizations  Data Analysts shall have the ability to:  Review and analyze data and information from multiple sources  Establish case/project files  Enter and retrieve data from databases  Manipulate, transfer, compute, and print information  Work independently on tasks and be a self-starter but complete projects on a team as they arise  Lift and move boxes up to 25 pounds as well as frequently utilize hands, arms, and legs for file placement and removal  Perform driver and messenger activities  Data Analysts shall meet the following minimum qualifications:  US Citizen;  Active Top Secret Clearance;  High School Diploma;  1 year of related work experience;  Good verbal and written communication skills;  Experience with scanning programs, ScandAll experience preferred  Must be willing to work either 6am to 2:30pm or 2pm to 10:30pm.  This is for proposal recruitment. Employment is contingent upon contract award.  VEVRAA Federal Contractor  Three Saints Bay, LLC and its subsidiaries offer a diverse, team-oriented working environment and the opportunity to work with exceptional dedicated industry professionals. We offer our employees a comprehensive benefits package and the opportunity to take part in exciting projects with government and commercial clients, both domestic and international.  We are an EEO/AA employer. We invite resumes from all interested parties without regard to race, color, religion, creed, gender, national origin, age, genetic information, marital or veteran status, disability, or any other category protected by federal, state, or local law."}