{"jobID": "2823175788", "jobLocation": "Herndon_VA", "jobTitle": "Senior Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.cgi.com", "Headquarters": "Montreal, Canada", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (GIB) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " IBM, Accenture, Booz Allen Hamilton"}, "estimatedSalary": "87000", "jobDescription": " Job Description:Senior Data Analyst Position Description CGI has an immediate need for a Senior Data Analyst to join our financial services team in Herndon. This is an exciting full-time opportunity to work in a fast-paced team environment supporting one of the largest leaders in the secondary mortgage industry. We take an innovative approach to supporting our client, working side-by-side in an agile environment using emerging technologies. This is the chance to further advance your career. Why? • We partner with 15 of the top 20 banks globally, and our top 10 banking clients have worked with us for an average of 26 years! • Full-time opportunity to become a member of a stable, growing organization with over $8.5 billion+ in annual revenue • We have over 73,000+ CGI Members in 40 countries and over 5k+ loyal Clients who are leveraging our end-to-end services across the globe • We offer a competitive total compensation package that includes medical, dental, vision, 401k, paid vacation, and much more - and all CGI benefits begin on your first day of employment! Your future duties and responsibilities In this role, you will work with a risk management applications that are data-centric with a lot of emphases given to analytics, reporting, and financial modeling. You will assist in the overall effort to replace these applications. Required qualifications to be successful in this role - 6-8 years working experience as a data analyst - Strong knowledge of and experience with data mapping and SQL - Strong knowledge of and experience with working on multiple applications and establishing data interfaces - Strong analytical skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracy - Should have skills documenting data requirements - Ability to translate ETL requirements (source to target mappings) - Ability to document business processes - Excellent communication skills - Ability to multitask is critical Education: BS Degree in Computer Science Build your career with us. It is an extraordinary time to be in business. As digital transformation continues to accelerate, CGI is at the center of this change-supporting our clients' digital journeys and offering our professionals exciting career opportunities. At CGI, our success comes from the talent and commitment of our professionals. As one team, we share the challenges and rewards that come from growing our company, which reinforces our culture of ownership. All of our professionals benefit from the value we collectively create. Be part of building one of the largest independent technology and business services firms in the world. Learn more about CGI at www.cgi.com . No unsolicited agency referrals please. CGI is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to their race, ethnicity, ancestry, color, sex, religion, creed, age, national origin, citizenship status, disability, medical condition, military and veteran status, marital status, sexual orientation or perceived sexual orientation, gender, gender identity, and gender expression, familial status, political affiliation, genetic information, or any other legally protected status or characteristics. CGI provides reasonable accommodations to qualified individuals with disabilities. If you need an accommodation to apply for a job in the U.S., please email the CGI U.S. Employment Compliance mailbox at US_Employment_Compliance@cgi.com . You will need to reference the requisition number of the position in which you are interested. Your message will be routed to the appropriate recruiter who will assist you. Please note, this email address is only to be used for those individuals who need an accommodation to apply for a job. Emails for any other reason or those that do not include a requisition number will not be returned . We make it easy to translate military experience and skills! Click here to be directed to our site that is dedicated to veterans and transitioning service members. All CGI offers of employment in the U.S. are contingent upon the ability to successfully complete a background investigation. Background investigation components can vary dependent upon specific assignment and/or level of US government security clearance held. CGI will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation cond"}