{"jobID": "2830015571", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineering Manager", "companyRating": "2.9", "companyInfo": {"Website": "www.karauctionservices.com", "Headquarters": "Carmel, IN", "Size": "10000+ employees", "Founded": " 2007", "Type": " Company - Public (KAR) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Cox Automotive, Comerica, Ritchie Bros."}, "estimatedSalary": "123000", "jobDescription": " Summary: DRIVIN Data Engineering team is looking for a strong technical leader to help drive the next generation of data science platform for KAR. The perfect candidate would be knowledgeable in Big Data and classic Data Warehousing techniques, proficient in AWS technologies, and possess strong leadership and mentoring skills.  In addition to leading the team, this person will be relied on to help prioritize and set delivery schedules and working closely with Product Owners and Data Science to drive discovery on initiatives and align the teams for success.  DRIVIN Data teams are using Python, SQL, Spark, EMR, ECS, Redshift, Elastic Search and Postgres to build an enterprise wide Data Science and Data Analytics platform. This team supports the internal Data Science and product teams, and also provides data engineering best practices across the KAR enterprise. Job Description:Requirements:4+ years managing and leading development teams5+ years working with data integration, data warehouse/lakes, and data infrastructureExperience working in an agile environmentExperience with Spark, Python, SQL requiredExperience with Data Warehouse requiredExperience with AWS preferredExperience architecting and developing data pipelinesExperience supporting a Data Science team with model deploymentStrong communication skills and collaboration with multiple teamsProven ability to lead a technical teamProven experience with innovation and new technology evaluationResponsibilities:Working closely with Product teams to prioritize and set delivery scheduleManaging on-call support rotationMentoring and setting training schedules for data engineering resourcesCoordinating with DevOps on infrastructure needs and changesDefining best practices for delivery of solutions (documentation, monitoring, style guides)Defining quality gates for delivery of solutions to productionCoordinating with Data Science to deploy modelsCoach and develop the data engineering team to grow capabilitiesWork with Data Science and DevOps to create scalable infrastructure for predictive mode.#CB"}