{"jobID": "2835796905", "jobLocation": "Santa_Clara_CA", "jobTitle": "App Store Analytics - Data Scientist, Product Analytics", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "App Store Analytics - Data Scientist, Product Analytics Job Number: 113205479Santa Clara Valley, California, United StatesPosted: May. 17, 2018Weekly Hours: 40.00 Job SummaryAt Apple, extraordinary ideas have a way of becoming great products, services, and customer experiences very quickly. If you are a self-motivated, high-energy individual who is not afraid of challenges, we’re looking for you.  Since the App Store launched nine years ago, millions of apps have been downloaded billions of times while more than $70B has been paid out to developers, making it the most successful place to discover amazing and innovative apps from developers.  In September, we redesigned the App Store from the ground up, adding creative stories and editorial to make discovering apps and games easier than ever before. At Apple, Analytics is a key driver in making strategic decisions like the App Store redesign. Looking for talented, passionate and results-oriented individuals to join our team and develop new insights to craft the future of the App Store for years to come.  The App Store Analytics team analyzes large-scale data across customer and developer touch points so we may develop metrics and deep insights to measure performance and drive strategy. Our culture is about getting things done iteratively and rapidly, with open feedback and debate along the way; we believe analytics is a team sport. We inspire independent decision-making and taking smart risks.  Our team collaborates deeply with partners across product and design, engineering, and business teams: our mission is to drive innovation at Apple through deep quantitive research. FURTHER READING:The App Store - https://www.apple.com/ios/app-store/Introducing the New App Store - https://developer.apple.com/videos/play/wwdc2017/301/Apple unveils all-new App Store - https://www.apple.com/newsroom/2017/06/apple-unveils-all-new-app-store/Developer earnings from the App Store top $70 billion - https://www.apple.com/newsroom/2017/06/developer-earnings-from-the-app-store-top-70-billion/Key Qualifications4-7 years of recent experience in a Data Scientist role. Preferably experience in the app industry or related field.Familiarity with measuring UX, customer engagement, planning and analyzing AB experiments.You have a real passion for improving the customer experience through refining the product.You have excellent presentation, communication and social skills, with strong attention to detail.You have a strong business mindset, possessing an ability to condense complex analysis and technical concepts into clear and concise takeaways for business leaders.You have the ability to operate appropriately and effectively in a dynamic, highly multi-functional, energizing environment.Excellent time management skills and are able to lead work to tight deadlines and handle the pressure of product launches and executive requests.You are well-versed in SQL languages.Experience with big data frameworks preferred. Ability to comprehensively understand data elements, sources and relationships in business and technical terms.Strong familiarity with multiple platforms, tools, methodologies in data analysis and insight synthesis. Description- Dive deep into the large-scale data to identify key insights that will inform product improvements and business strategy. Define how best to measure and monitor our products and their features. Engage with the business, engineering, product management teams as a thought partner.You will build and maintain strong partnerships with key partners across the company in order to successfully deliver actionable insights You will partner with other Apple organizations on data gathering, data governance, democratizing data with reporting tools and evangelizing critical metrics.EducationMinimum of a Bachelor’s degree in Economics, Computer Science, CIS/MIS, Statistics, Mathematics, Engineering or relevant field. Ideally, Masters in related field."}