{"jobID": "2774689554", "jobLocation": "Houston_TX", "jobTitle": "Program Data Design Analyst (Business Analyst) - Information Technology", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Description  Location: 13013 Northwest Freeway Houston, TX 77040  Job Type: Full Time  FLSA Status: Exempt  Close Date: July 18, 2018 Position Summary: The person in this position will serve as a member of the Business Relationships team in the Information Technology Division. Required skills include standard enterprise business analysis core competencies, project management, quality assurance, automation, and process improvement. The position's duties include assisting with the business case, planning and monitoring, eliciting requirements, requirements organization, translating and simplifying requirements, requirements management and communication, test cases, process change requests, and management a project's scope, development, user acceptance testing, and deployment. Essential Duties and Responsibilities: This information is intended to be descriptive of the key responsibilities of the position. The list of essential functions below does not identify all duties performed by any single incumbent in this position. Serves as Business Analyst for the IT division of the Harris County Appraisal DistrictCase planning and monitoring, including collecting and organizing business requirements and ensuring deliverables effectively address requirementsMaintains proper documentation of applications and processes responsible forMaintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; participating in professional societiesEvaluation of strategic risks and returns associated with proposed business solutionsPerforming standard BA tasks such as defining business needs, capability gaps, solution scopes, and business casesParticipates in cross-training of staff members Minimum Requirements Education: Bachelor's Degree with a major emphasis in Business Analysis, Project Management, Information Technology, related fields of study or equivalent experience. Experience: At least 3 years of experience in as a Business Analyst or Project Manager. Knowledge and experience with the standard enterprise business analysis or project management core competencies including demonstrated proficiencies in documentation, presentation, data analysis, models, flowcharts, wireframing, mockups, communication and collaboration. Required Knowledge, Skills and Abilities:Knowledge and experience with generally accepted principles of Business Analysis or Project Management3 years Business Analysis or Project ManagementTroubleshooting and test case scenarios for reporting of bugs and software enhancementsSoftware Development Life CycleAttention to detailMultitaskingTeam playerMicrosoft Office including VisioPreferred Knowledge, Skills and Abilities:PMI Certified Associate in Project Management (CAPM)® or PMI Project Management Professional (PMI-PMP) ® certificationPMI Professional in Business Analysis (PMI-PBA) ® certificationTools such as Balsamiq, Pencil, Rational Requisite Pro, Case Spec, QA Complete or similarWorking knowledge of CustomCAMA application suite and business processes such as roll processing; value noticing; hearings; and exemptions Working Conditions, Physical & Mental Abilities Positions in this class typically require repetitive motions, sitting or standing for prolonged periods of time in an office setting.Must be able to lift up to 50 pound file boxes. The position requires considerable flexibility, concentration, creativity, and ability to manage time effectively.The position is subject to stress caused by a changing public environment, mandatory deadlines and heavy workload. Requires the ability to ask questions that will bring forth the information needed to make sound decisions. Equal Opportunity Employer  The Harris County Appraisal District is committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, genetic information, veteran status, gender identity, or pregnancy.SDL2017"}