{"jobID": "2774785794", "jobLocation": "Troy_MI", "jobTitle": "Data Systems Analyst/T-SQL Programmer", "companyRating": null, "companyInfo": {"Website": "www.captevo.com", "Headquarters": "Troy, MI", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " // Due to the Nature of this project, Visa Independent candidates are only accepted at this time//  We have an immediate opening for a contract-to-hire Data Systems Analyst/T-SQL Programmer with 3-5 years of experience, to work in our Data Analysis/Maintenance/Reporting team. This person would be performing data analysis, creating specifications and program design, programming in T-SQL (heavy use of Stored Procedures), unit testing and following through to maintenance. The candidate will be working in a team environment but PFI is a very \"independent\" shop, so the candidate must be comfortable taking direction, then working independently.  Some high level requirements follow. Data Systems Analyst/T-SQL ProgrammerRequired Skills:3 or more years of technical analysis and development experience with T-SQLKnowledge of Relational Database Modeling Systems (RDBMS) with SQL Server Management Studio 2005 or later database environments.Experience with SVN, MS EXCEL, MS ACCESS, Mantis and Mediawiki desirableHighly proficient developing technical data analysis design documents, and performing thorough analysis and testing.Must be able to work effectively and independently with limited immediate supervision, and have the ability to communicate technical recommendations through meetings and knowledge-sharing presentations.Work with a team of experienced Data Systems Analysts, Data Architects, Developers and business resources to build highly-performing enterprise systems that increase staff productivity and financial performance.Education / Experience Requirements:SQL and T-SQL expertiseAs is in-depth experience and understanding of programming languages, including constructs and protocols.Undergraduate degree in a technology or related field preferred"}