{"jobID": "2802323166", "jobLocation": "Detroit_MI", "jobTitle": "Speech Pathologist", "companyRating": "3.5", "companyInfo": {"Website": "www.tesidea.com", "Headquarters": "South Pasadena, CA", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Progressus Therapy, PresenceLearning, K12"}, "estimatedSalary": "56000", "jobDescription": "Speech TherapistTotal Education Solutions (TES) is a leading national provider of outsourced special education and therapeutic services to public, private, and charter schools as well as healthcare organizations throughout California, Michigan, and Ohio. Our professional, multi-disciplinary staff delivers therapeutic services in our family-centered clinics, in schools, at home, and on-line. We also provide a variety of support and management services to the non-profit Institute for the Redesign of Learning.  Seeking a Speech Pathologist to provide services at one of our client school locations in Detroit Michigan.  We're offering a $1000.00 sign-on bonus for this position.  We are looking for fun, innovative, and flexible candidates who want to be a part of a dynamic team of professionals and play a vital role in continuing to build an exceptional multidisciplinary program as well as make a difference in the lives of children and families. A license and Masters degree in Speech and Language Pathology is required. Qualifications:Must be licensed according to state mandates as a Speech Language PathologistInsurance credentialed highly preferredStrong case managementExperience supervising paraprofessionalsTES Advantage :Varied caseloadsFlexible hoursVariety of settings and populationsMultidisciplinary teams and cross collaborationState of the art family friendly clinicsBenefits:Employees may be eligible for health, dental, and vision insurance: paid vacation, holiday, and sick leave; 401-k retirement plan; education assistance and flexible spending accountsFlexible schedulesMentoring for new graduatesRewarding career with multiple growth opportunities If you enjoy working with children, and are interested in employment with us, please contact the following Career Agent:  Jim Esnault  248-544-0360  jesnault@tesidea.com  For additional information about our company please go to our website at  www.tesidea.com . In addition, employment opportunities are also available for SchoolPsychologists, Occupational Therapists, Speech Language Pathologists and Adaptive Physical Education Teachers. Please contact us at your earliest convenience.  Total Education Solutions is an Equal Opportunity Employer. We do not discriminate in employment and personal practices on the basis of race, sex, age, handicap, religion, national origin or any the basis prohibited by applicable law. Hiring, transferring, and promotion practices are preformed without regard to the above listed."}