{"jobID": "2796884601", "jobLocation": "Chantilly_VA", "jobTitle": "Project Data Analyst I", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Compass Strategy Solutions, LLC is a Small Woman Owned Government Contracting business specializing in law enforcement support services for the Federal Government. Join a team of experienced professionals and a fast- growing business. We offer competitive benefits. We are an Equal Employment Opportunity employer. Project Data Analyst I - Chantilly, VAResponsibilities: The contractor tasks shall include but are not limited to the following: Record a variety of source documentation into financial and other management systems, spreadsheets and databasesProcess, verify and submit paymentsProvide support in general accounting clerical operationsCheck that transactions and expenditures do not to exceed the amount of the obligationsComplete data input assignments, prepare letters/emailsPerform one or more routine accounting clerical operations, such as: examining, verifying, and correcting accounting transactions to insure completeness and accuracy of data, and proper identification of accountsTotal, balance, and reconcile collection vouchersPost data to transaction sheets where employee identifies proper accounts and items that are to be postedCode documents in accordance with a chart (listing) of accountsContractor shall follow specific and detailed accounting procedures. Completed work is reviewed for accuracy and compliance with procedures. Perform related work as required.Basic Qualifications: A degree in Accounting, Finance or Business Administration preferred; or 4 years specialized or relevant educational experience/knowledge of accounts payable/receivable experience, or Financial/Logistics training including the development of financial diagrams, exercises and training; or a combination of both totaling 4 years. The contractor shall have the ability to work within stringent time constraints and meet deadlines. Good oral and written communication skills. Other Responsibilities Include: Developing, memorializing, and standardizing business processes with team members with similar responsibilities to stay abreast with change in demands and work requirements. Other Requirements: Personal Security Clearance at the Secret level is required."}