{"jobID": "2600451140", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Demand Generation", "companyRating": null, "companyInfo": {"Website": "www.entelo.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Entelo is transforming the way companies hire. We leverage big data and predictive analytics to make recruiting better for candidates and recruiters alike. In 2017, we were thrilled to be named one of Glassdoors Best Places to Work!  Were looking for a Director of Demand Marketing to develop, plan, execute and measure integrated marketing campaigns that generate qualified sales opportunities. Are you excited by the prospect of owning the largest budget in the company? Are you eager to make an impact on the companys success through the programs that you run? Do you eat, breathe and sleep demand marketing? Then were looking for you. What youll be doing:Optimize our entire demand generation funnel to cost-efficiently drive pipeline.Manage all digital marketing and online acquisition programs, including SEM, display advertising, retargeting, and content syndication.Define and manage the largest budget in the company and prioritize program spend based on ROAS.Develop sophisticated email nurture flows to engage and qualify captured leads and convert to qualified leads (MQLs).Manage lead scoring program to prioritize leads.Work with product, content and customer marketing teams to develop materials relevant to lead qualification and nurturing.Develop marketing programs, including webinars, online demos, gated content, etc., to capture new leads.Partner with third parties to manage lead generation campaigns.Partner with our sales development representatives (SDR) team to prioritize, qualify and score leads, and support SDR nurture programs.Lead, mentor and develop the demand generation team. Recruit and train new team members.What we're looking for:Experience creating and running integrated marketing campaigns.Expertise in marketing automation and marketing operations - email campaigns, landing page development, lead nurturing, etc. using HubSpot, Marketo, Pardot or similar system.Creative thinker who can develop new programs that drive new pipeline.Deep analytical mind who obsessively tracks and improves KPIs.Familiarity with account-based marketing tactics.Able to meet deadlines and work collaboratively in a fast-paced, loosely structured, highly dynamic environment.Highly effective communicator with exceptional EQ who can work effectively both within the marketing team as well as sales, SDR, customer success and other teams.Minimum 7 years experience in technology marketing.HR technology industry experience a plus. At Entelo, perks mean so much more than free lunches and unlimited PTO (although we provide both!). Were committed to helping Entelopes grow; we offer opportunities for professional development and a generous learning and development stipend. Entelo is also committed to the community; we partner with impactful non-profits, volunteer regularly, and provide a charitable match. We perform at a high level while respecting our teammates' lives outside of work.  We celebrate diversity and welcome all qualified applicants regardless of race, religion, sex, age, national origin, sexual orientation, disability, veteran status, genetic information or criminal history. Weve taken the White House Equal Pay Pledge and are committed to maintaining a welcoming and equitable environment."}