{"jobID": "2831843140", "jobLocation": "Sunnyvale_CA", "jobTitle": "Business Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.cognizant.com", "Headquarters": "Teaneck, NJ", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (CTSH) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tata Consultancy Services, Accenture, Capgemini"}, "estimatedSalary": "95000", "jobDescription": " CognizantTechnology Solutions is looking for \"Businessdata analyst\" who could join in our team of IT professionals in apermanent role. If you meet our background requirements and skills andlooking for an opportunity to be rewarded for your skills and expertise, hereis the ideal opportunity for you!  Role: Business Data analyst  Location: Mountain view, CA  \"Cognizant will not sponsor H-1Bor other U.S. work authorization, or lawful permanent residence (otherwiseknown as a \"Green Card\") for this role.  Experiencerequired: 10+yrs in BI tools such as tableau, qlikview Key skills Responsibilities:Identifies project requirements by interviewing customers; analyzing operations; determining project scope; documenting results; preparing customer contracts.Develops problem solutions by describing requirements in a work-flowchart and diagram; studying system capabilities; analyzing alternative solutions; preparing system specifications; writing programs.Develops project estimates by identifying phases and elements, personnel requirements, and costs.Verifies results by completing tests.Prepares customers to use system by conducting training.Provides reference for customers by writing documentation; providing support and help.Maintains systems by researching and resolving problems; maintaining system integrity and security.Maintains quality service by establishing and enforcing organization standards.Prepares reports by collecting, analyzing, and summarizing information.Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; participating in professional societies.Contributes to team effort by accomplishing related results as needed.Take care of adhoc data, access, and configuration related tickets. Equal Opportunities Employer: Cognizant Technology Solutions is an Equal OpportunitiesEmployer and welcomes applications from all sections of society and does notdiscriminate on grounds of race, religion, or belief or national origin,disability, age, citizenship, marital, domestic or civil partnership status,sexual orientation, or gender identity. Cognizant is an Equal OpportunityEmployer M/F/D/V"}