{"jobID": "2801687569", "jobLocation": "San_Antonio_TX", "jobTitle": "Environmental Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.anser.org", "Headquarters": "Falls Church, VA", "Size": "201 to 500 employees", "Founded": " 1958", "Type": " Nonprofit Organization", "Industry": " Government", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "OVERVIEW: ANSER enhances national and homeland security by strengthening public institutions. We provide thought leadership for complex issues through independent analysis and we deliver practical, useful solutions. ANSER values collaboration, integrity, and initiative and we are client focused in all that we do. Because we were established for the purpose of public service and not for profit, we measure our success in the impact of our service. SPECIFIC JOB DESCRIPTION:ANSER is seeking qualified personnel to support the AFCEC Environmental Management Directorate (EMD). AFCEC EMD collects, compiles and analyzes environmental data for reporting and training on several product areas benefiting the Air Force. These services support USAF environmental compliance, conservation, pollution prevention, and restoration support activities.Environmental Scientific Analysis: ANSER is seeking candidates with the environmental science background and experience to provide journeyman level environmental scientific study and analysis in support of AFCEC EMDs Environmental Management Compliance Division. Services include:Supporting design and production of media productsTechnical interchange through research, analysis and presentationTechnical review of Environmental Impact Analysis Process (EIAP) documentationProject management supportData analysis supportEIAP strategic planning and reporting*This position is contingent upon contract award.SKILLS & EXPERIENCE:3+ years relevant experienceAbility to apply basic principles of environmental science, engineering or the physical sciences to analysis, studies and reportingExcellent verbal and written communication skillsAbility to analyze laws and policies, gather data and build solutionsAbility to organize and plan multi-tiered projectsAbility to working in varied outdoor environments to include broken or steep terrainAbility to apply scientific principles to organize, develop and present applicable studiesEDUCATION & YEARS OF EXPERIENCE: Bachelors degree plus three years relevant experience in the physical sciences or related engineering.DISCLAIMER: In compliance with the Americans with Disabilities Act Amendment Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position with ANSER, please call 703-416-2000 or e-mail Recruiting@anser.org An Affirmative Action Equal Opportunity Employer M / F / D / V"}