{"jobID": "2774803969", "jobLocation": "Thousand_Oaks_CA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.amgen.com", "Headquarters": "Thousand Oaks, CA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (AMGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Genentech, AbbVie, Janssen Biotech"}, "estimatedSalary": "99000", "jobDescription": " Amgen is seeking a Data Scientist to be based in our Thousand Oaks, CA global headquarters, who will report into the Senior Data Scientist.  The Next Generation Insights & Intelligence Amgen Full Potential (NGII AFP) initiatives remit is to drive systematic utilization of data, analytics, artificial intelligence, and automation across all aspects of the business to reduce costs and increase revenue, speed and efficiency.  As part of the Strategy, Commercialization & Innovation function, the Data Scientist will interface across Amgens value chain in advancing projects and technical deliverables for the NGII AFP. Additionally, the Data Scientist will execute on projects and/or provide technical input to projects involving data science, machine learning, and artificial intelligence across Amgen.  With respect to projects executed within the scope of NGII, the Data Scientist may advance technical projects with aims to systematically integrate data, derive insights, and automate processes. These projects may touch across the entire value chain and hence offers the opportunity for the candidate to interact and learn from teams involved in Amgen processes ranging from R&D; to Commercialization. Successful execution of these projects will not only demonstrate technical feasibility for advanced informatic capabilities but will also ultimately derive substantial business value for Amgen. Primary Responsibilities for the Data Scientist include:Engages with the business function to identify and prioritize opportunities to deliver business value whilst understanding highly technical scientific business needs as well as communicating effectively across disciplinesDevelops requirements based on consulting with the respective business functionDrives the technical solution for the business function either through quick prototypes or engagement with broader technical teamBasic Qualifications: Doctorate degree  OR  Masters degree and 2 years of Data Science experience  OR  Bachelors degree and 4 years of Data Science experience  OR  Associates degree and 10 years of Data Science experience  OR  High school diploma / GED and 12 years of Data Science experience Preferred Qualifications:Experience with variety of data analysis and modeling methods particularly in their application to biological systems (i.e. Unsupervised (PCA, K-Means), Supervised (Linear/Logistic Regression including PLS, Deep Learning approaches), Bayesian, Fourier/LaplaceFamiliarity with DevOps and good software practices (i.e. version control, continuous integration, test driven development)Proficient in SQL, Python, R and familiar with big data approachesFamiliarity and background with biotechnology processes and regulatory requirementsStrong analytical / quantitative skillsStrong communication and interpersonal skillsSelf-starter with the ability to take on several projects at one timeComfort and agility with changes in business priorities Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.  Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.  #DS2018Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}