{"jobID": "2693591045", "jobLocation": "Bowie_MD", "jobTitle": "Data Analyst", "companyRating": "2.5", "companyInfo": {"Website": "www.inovalon.com", "Headquarters": "Bowie, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Public (INOV) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " McKesson, Thomson Reuters"}, "estimatedSalary": "75000", "jobDescription": " Inovalon is a leading technology company that combines advanced cloud-based data analytics and data-driven intervention platforms to achieve meaningful insight and impact in clinical and quality outcomes, utilization, and financial performance across the healthcare landscape. Inovalon's unique achievement of value is delivered through the effective progression of Turning Data into Insight, and Insight into Action.  Inovalon has an exciting opportunity for a Business Analyst to join our Business Planning and Analytics Team. The ideal candidate will develop, document and manage key business process tools and reports including, but not limited to: financial analysis, operational metrics, key performance indicators, pricing, costing, budgeting and FTE management. Perform complex pre requirement analysis, for multiple internal processes and procedures;Translate business requirements into technical requirements proposing automated solutions, designs and development strategies;Perform UAT on different processes before directed to production and resolve post implementation technical and business issues;Preform and manage the monthly Invoice generation for two of the main products of Inovalon;Analyze data requirements, develop complex MS SQL Server queries to extract data using advanced techniques to research causes for data gaps, discrepancies, inconsistencies and drive insights via longitudinal analysis;Perform Quality improvement analytics on operational activities across the client-base and consolidate reports by identifying and defining metrics, thresholds and benchmarks;Develop and maintain dashboard reports using MS SQL, MS Excel and Tableau to visualize data and provide insight applying accurate and appropriate interpretation of data;Automate the generation of new & existing reporting solutions/dashboards using, Tableau, excel macros, pivot/power pivot;Production of queries in support of ad-hoc and routine management or customer requests;Create and maintain technical design documentation which includes current functionality, data dictionary, data mappings and flows/diagrams; andSupport automation and enterprise consolidation of data used in monthly, quarterly, and annual metrics reports for Inovalon.Bachelor’s degree in Engineering, Health Science, Business Administration or equivalent;3+ years of experience in an analytic/data analysis;Experience in generating and automating reports and dashboards in MS Excel;Experience in VBA and other reporting platforms is a plus;Strong experience in SQL/T-SQL, SQL Server 2008/SQL server 2012;Strong Business analytical skills: problem solving, process flows, spreadsheets and modeling;Ability to work independently by setting priorities;Work on multiple tasks simultaneously; andEffective verbal and written communication skills.Inovalon provides equal employment opportunities (EEO) to all employees and applicants for employment. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, or protected veteran status and will not be discriminated against on the basis of disability."}