{"jobID": "2803276971", "jobLocation": "Washington_DC", "jobTitle": "Premium Audit Auditor II", "companyRating": "2.9", "companyInfo": {"Website": "www.zurichna.com", "Headquarters": "Schaumburg, IL", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Public (ZURN) ", "Industry": " Insurance", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Travelers, AIG"}, "estimatedSalary": "54000", "jobDescription": "Zurich is currently looking for a Premium Audit Field Auditor to work in our Southern Ohio and Kentucky territory. Our Field Auditors work from home within their assigned territory and we provide a company car as well as additional support to manage the territory.  As a Premium Audit Field Auditor, your role is critical to providing clarification and insight to premiums paid and due, which directly effect the underwriting results of a company. To perform examination of policyholder´s accounting and financial records to ensure accurate calculation of earned premium for risks of moderate complexity and that audited exposures are accurately calculated. In this role you will audit large accounts in all industries for both workers compensation as well as liability.  Client Externally Focused - The job’s core deliverables rely on delivering service to external clients and/or customers. Typically involves building relationships and promoting the company.  About Our Premium Audit Group:  Premium Audit provides services to Zurich North America Commercial insureds. Performing numerous physical and voluntary audits annually. Our Field Auditors are located near our customers, across 30 states.  Our Field Auditors have strong technical skills, provide great customer service, and have superior verbal and written communication skills. Zurich's accounts are large, interesting and complex, we are seeking candidates who are looking for a challenge.  We offer a rewarding environment, and look for individuals that will help us continuously improve our quality, automation and work processes. Additionally, we encourage a work-life balance, with a management team that provides regular feedback and training.Job QualificationsBasic Qualifications:Bachelors Degree and 5 or more years in the Casualty Premium Audit areaORHigh School Diploma or Equivalent and 7 or more years of experience in the Casualty Premium Audit areaORZurich approved Apprenticeship Program including an Associate Degree and 5 or more years of experience in the Casualty Premium Audit areaANDExperience with laptop computer auditing and Microsoft OfficeKnowledge of NCCI Workers Compensation and ISO General Liability rules, manuals and industry practices"}