{"jobID": "2497673349", "jobLocation": "San_Jose_CA", "jobTitle": "Data Scientist Risk Analytics", "companyRating": null, "companyInfo": {"Website": "www.signifyd.com", "Headquarters": "San Jose, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Your Role: You will have the opportunity to apply your knowledge of machine learning, statistics and your analytical skills to develop models detecting fraud patterns. You will ideate, test and deploy advanced predictive signals to improve fraud detection performance. You will collaborate with other data scientists and engineers to build data pipelines, do feature prototyping, and write production-grade code to implement analytical algorithms and flexible strategies. Specific job duties may include: Writing or modifying data pipelines to process and mine historical data  Processing and analyzing data collected with research prototypes  Ideation, prototyping, measuring predictive features transforming data into actionable information  Prototyping and validating models and algorithms to boost model performance  Writing production code (python, SQL, etc.) to deliver analytics content Required Skills and Experience: An advanced degree (M.S. or Ph.D) in computer science, applied mathematics, or a comparable analytical field from an accredited institution  Expert proficiency with an advanced data analysis toolkit (such as python/matplotlib, R, ROOT, etc.)  3+ years experience in analytical team targeting fraud in online commerce, banking and finances  Superior SQL skills with proven experience in relational databases and data warehouses  5+ years experience or demonstrated fluency with python and at least one other programming language  2+ years experience with NoSQL databases and unstructured data  2+ years experience setting up and using distributed/parallel processing frameworks such as Spark, Hadoop, Storm etc. is a big plus  Demonstrated ability to develop high-quality code adhering to industry best practices (i.e., code review, unit tests, Gitflow)  Possession of core analytics skills and expertise (as demonstrated by prior work):  Knowledge of applied statistics and key concepts underlying statistical inference and inductive reasoning  Experience designing experiments and collecting data  Experience developing models based on sensor data, and an understanding of error propagation and the limitations of data subject to measurement uncertainties  Demonstrable expertise in one or more areas: applied mathematics, predictive analytics, expert systems, ANNs/deep learning, graph theory, Markov Chain Monte Carlo, geo-informatics (GIS), language processing, risk analysis  Work/project history reflective of a self-motivated professional who excels when given open-ended problems and broadly-defined goals, having an innate desire to discover the patterns and relationships in data that can be leveraged to provide business value  Who We Are  Signifyd was founded on the belief that e-commerce businesses should be able to grow without fear of fraud. Signifyd solves the challenges that growing e-commerce businesses persistently face: billions of dollars lost in chargebacks, customer dissatisfaction from mistaken declines, and operational costs due to tedious, manual transaction investigation. E-Commerce Assurance, Signifyd’s financial guarantee protecting online retailers in case of chargebacks, is supported by a full-service cloud platform that automates fraud prevention allowing businesses to increase sales and open new markets while reducing risk. Signifyd is in use by multiple companies on the Fortune 1000 and Internet Retailer Top 500 list. Signifyd is headquartered in San Jose, CA.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law."}