{"jobID": "2758528748", "jobLocation": "Imlay_City_MI", "jobTitle": "Production Seasonal Handpacker/Empacador", "companyRating": null, "companyInfo": {"Website": "www.pinnaclefoods.com", "Headquarters": "Parsippany, NJ", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (PF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " General Mills, Conagra Brands, The J. M. Smucker Company"}, "estimatedSalary": null, "jobDescription": " At the Vlasic Division of Pinnacle Foods we are at the top of our game and the key to our success is clear. Everything we do is driven by our purpose: unleashing brand potential, dynamically evolving and improving our already beloved products to bring more convenience, taste, nutrition, and joy to today's consumers.  The results? Our well-recognized products are found in 85% of American households and are leaders in their respective categories, holding the #1 or #2 market share position in 10 of the 14 categories in which we compete — and we're just getting started. We are committed to adding value through strategic growth that synergizes our portfolio of \"Leadership\" and \"Foundation\" brands and plays to our strengths in R&D;, consumer insights, and senior management experience. SCOPE: At Vlasic, the handpacking tradition continues. The successful Handpacker is hardworking and dependable. The Handpacker associate is responsible for ensuring customer satisfaction by packing quality produce while following production standards. Persons who succeed in this role are eligible to earn production bonus (2017 the average wage with bonus exceeded $14.50/hr.).  These are afternoon shift positions (which pays a shift premium of $0.25/hr), 8 to 9 hours per day, typically starting at 3:30pm. Handpacking production can continue through December 15th. New for 2018!Improved Training ProgramProduction Line EnhancementsImproved Ergonomics and Adjusted StandardsDUTIES: The Handpacker will follow the process for doing each task as trained. Handpackers will receive direction from Supervisors, Production Leads, and Crew Leaders. RESPONSIBILITIES Duties include, but are not limited to, the following: Ability to accurately place product in jars at a rapid and constant rateReport deviations from product requirements to the crew leader or supervisionAbility to constantly stand in one areaAbility to constantly turn from side-to-sideAbility to constantly push, pull, and reachAbility to follow and execute instructionMust learn and follow standard work procedureMust learn and follow good manufacturing practicesMust learn and follow safety procedures while working with equipmentMust work accurately with minimal supervisionMust work well with others as a production teamMust practice consistent and reliable attendanceMust maintain area in a neat and sanitary fashionMust be available to work different shifts and overtime as requiredUnderstand and follow Pinnacle Foods, Vlasic Division, policies and procedures Empacador ALCANCE: En Vlasic, la tradición de empacar continúa. El empacador exitoso es muy trabajador y confiable. El Empacador es responsable de garantizar la satisfacción del cliente al embalar productos de calidad mientras sigue los estándares de producción. Las personas que tienen éxito en este rol son elegibles para ganar un bono de producción (2017 el salario promedio con un bono excedió $ 14.50/ hr).  Se trata de puestos de turno de tarde (que paga una prima de turno de $ 0.25 / hr), de 8 a 9 horas por día, generalmente a partir de las 3:30 p.m. La temporada de producción de empaque comienza en abril y puede extenderse hasta el 15 de diciembre. ¡Nuevo en el 2018!Programa de Entrenamiento MejoradoMejoras en la Línea de Producción Ergonomía Mejorada y Estándares AjustadosDEBERES: El Empacador seguirá el proceso para realizar cada tarea como fue entrenado. Los empacadores(as) recibirán instrucciones de Supervisores, líderes de producción y líderes de equipo. Las responsabilidades del trabajo se enumeran a continuación. RESPOSABILIDADES: Los deberes incluyen, pero no están limitados a lo siguiente: Posibilidad de colocar el producto con precisión en tarros a un ritmo rápido y constanteInformar desviaciones de los requisitos del producto al líder de la tripulación o supervisiónCapacidad de estar parado constantemente en un áreaCapacidad de girar constantemente de un lado a otroCapacidad de empujar, tirar y alcanzar constantementeCapacidad de seguir y ejecutar instrucciónDebe aprender y seguir el procedimiento de trabajo estándarDebe aprender y seguir buenas prácticas de fabricaciónDebe aprender y seguir los procedimientos de seguridad mientras trabaja con el equipoDebe trabajar con precisión con una supervisión mínimaDebe trabajar bien con otros como equipo de producciónDebe mantener una asistencia consistente y confiableDebe mantener el área de una manera ordenada y sanitariaDebe estar disponible para trabajar diferentes turnos y horas extras según sea necesarioComprenda y siga las políticas y procedimientos de Pinnacle Foods, Division Vlasic. Pinnacle Foods is an Affirmative Action/EEO Employer –  qualified applicants will be considered for employment without regard to  protected veteran or disability status, race/color, religion, gender, national  origin, age, sexual orientation, gender expression, gender identity or any  other legally protected basis."}