{"jobID": "2826813594", "jobLocation": "Des_Plaines_IL", "jobTitle": "Engineer/Scientist R&D; 2 / Analytical Organic Chemist - GC x GC", "companyRating": "3.2", "companyInfo": {"Website": "www.honeywell.com", "Headquarters": "Morris Plains, NJ", "Size": "10000+ employees", "Founded": " 1885", "Type": " Company - Public (HON) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " GE, Johnson Controls, United Technologies"}, "estimatedSalary": "75000", "jobDescription": " Engineer/Scientist R&D; 2 / Analytical Organic Chemist - GC x GCJoin a team recognized for leadership, innovation and diversityHoneywell UOP is seeking to fill a position in the R&D; Materials Characterization group at their site in Des Plaines, Illinois. Honeywell UOP R&D; Materials Characterization in Des Plaines is a corporate center of excellence (CoE) supporting Honeywell UOP, Specialty Materials and corporate needs for chemical and materials analysis. The Senior R&D; Analytical Chemist would work within a team of scientists utilizing gas chromatography, comprehensive gas chromatography, liquid chromatography and mass spectrometry systems (including GC-TCD, GC-FID, GC-qMS, GCxGC-SCD/NCD/FID, IC, HPLC, FIMS, FT-ICR-MS, and LC-TOFMS) along with other CoE staff to support organic materials analysis needs.Candidates should have basic understanding of organic chemistry matched with prior experience and skills in chemical analysis. Familiarity with organic reaction mechanisms, classical and instrumental organic functional group analysis is preferred. Direct experience in operating traditional gas chromatography and comprehensive gas chromatography required and liquid chromatography is a plus. Previous experience in a Research and Development environment is desirable.This position is for a full-time chemist. Occasional travel may be required to support troubleshooting and/or training at customer locations.YOU MUST HAVEPhD in ChemistryWE VALUESome industrial experience in analytical chemistry associated with organic chemistry preferredExperience with chromatographic and mass spectrometry instrumentationGC x GC, GC, LC, SFCLow resolution single-quadrupole and accurate mass high resolution systems (QTOF)Skilled in operation of chromatographic data acquisition and processing software packages, such as: Chemstation/Chemlaunch, Chromeleon, ChromaTOF, GC ImagePrior experience in routine maintenance and troubleshooting of instrumentation.Experience with Agilent, Leco, Thermo and Bruker instrumentation a plusEffective communication skills - oral and writtenAble to understand customer needs and develop a plan to meet those needsAnalyze and characterize materials and organic compounds to aid in the development and support of Honeywell UOP technologies.Ability to work effectively in a multidisciplinary team environment to contribute to multiple, complex and competing projects.Effectively participate and maintain compliance of Safety activities through Compliance Operating System (COS) and perform work with a high degree of attention to safety.Maintain quality control programs and assist with problem solving related to data.Exempt  Created with SnapChromatography, i.e. GCxGCMass Spectromotry relatedInterfacing with other labs; miscINCLUDES Continued Professional DevelopmentRelocation ProvidedADDITIONAL INFORMATIONJob ID: HRD33058Category: Technology R&D;Location: 50 E Algonquin Rd, Des Plaines, IL 60017-5016 USA Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status."}