{"jobID": "2666213574", "jobLocation": "Holmdel_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.icims.com", "Headquarters": "Holmdel, NJ", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " ADP, Oracle, Jobvite"}, "estimatedSalary": "114000", "jobDescription": " Have you designed and implemented large-scale data projects? Have you done so in a corporate setting? We’re looking for a statistical and computer science whiz to join our team as a Data Scientist IV, where you’ll be responsible for analyzing and modeling big data to develop analytics that will influence our products and customers. In this role, you’ll work with data engineers and data analysts and use data mining, statistics, and database techniques to extract actionable insights from both large data sets and economic time-series. We’re looking for someone experienced in tool selection, methods, and processes - someone who’s comfortable leading a team, and can make recommendations with confidence. If you’re a top-notch communicator who loves diving into the details and can engage effectively with stakeholders, this could be your next big thing  iCIMS extends a work culture unlike any other East Coast-based technology provider. We focus on hiring candidates who display our seven core competencies – passion, drive, transparency, adaptability, empathy, kaizen, and customer commitment. If you eat, sleep, and breathe our competencies and desire to work in a casual yet results-driven environment that embraces innovation– then you’re just what we’re looking for!  iCIMS is a high-growth Software-as-a-Service (SaaS) company that’s voted one of the Best Places to Work in New Jersey. We are the industry's premier recruitment software provider – delivering technology that supports more than 3,500 contracted customers around the globe. Committed to both growth and stability, we have a lot of opportunities for career advancement within our organization. Come grow with us. Apply today!  • Extract actionable insights from huge volumes of data using data mining, statistics, and database techniques Apply advanced statistical and predictive modeling techniques to build, maintain, and improve on decision makingConduct studies, rapid pilots, and identify metricsGuide other team members on best practices and review their analysis.Be the go to person for advanced models, analysis and data science.Identify best practices on data quality issues, root causes and remedies to be implemented by the data engineersDesign and implement large scale data projectsInfluence and persuade others to support large scale projects and hypothesesCommunicate ideas and theories to a wide audienceWork directly with business teams and leaders to understand requirements and communicate resultsConsistently ensure that business is conducted with integrity at all times and that behavior aligns with iCIMS policies, procedures, and core competencies  • Minimum of 7 years of related work/graduate experienceExperience working with big data is a plusStrong written and verbal communication skills with an ability to communicate ideas clearly to a wide audienceAbility to develop and query databases, and perform statistical analysisSkills to create examples, prototypes, demonstrations to help management better understand data science workA good understanding of design and architecture principlesExperience with high level statistical software (R, Matlab, Pandas, SAS etc)Experience with SQLExperience with Apache Spark is a plusPrevious work experience with machine learning is a plusAbility to influence and lead othersExperience in designing and leading large scale projects Education/Certifications/Licenses RequiredBachelors or preferably Masters/PhD degree in statistics or another quantitative discipline iCIMS is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, protected veteran status, disability status or any other characteristic protected by law."}