{"jobID": "2832070923", "jobLocation": "Mount_Prospect_IL", "jobTitle": "Master Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Looking for a challenge tailored for you? Look no furtherthe opportunity is here! Fujitsu America can offer you exciting projects with a wide range of clients, in various domains of expertise. Over 170,000 Fujitsu people support customers in more than 100 countries. We use our experience and the power of ICT to shape the future of society with our customers. You will enjoy our dynamic work environment where showing initiative and creativity is strongly encouraged, and where your contribution is recognized, no matter what your talents or skills are. Fujitsu America values collaboration and innovation. For more information on Fujitsu America's business scope, visit http://solutions.us.fujitsu.com/.  Fujitsu America, an innovative company known for its commitment to employee work/life balance, learning, and professional development, is growing! The SAP practice at Fujitsu America is looking for motivated professionals with SAP experience. Fujitsu America's partnership with SAP spans more than 40 years, services clients around the globe, and is committed to delivering real-world value. Join our cutting edge team of professionals, support our SAP clients, and work with our Center of Excellence to develop next generation solutions and applications.  COMMENTS: This job description reflects assignment of essential functions. It does not prescribe or restrict the tasks that may be assigned.  SUMMARY: This position will be responsible for representing and enforcing the Master Data department policy guidelines and procedures. The individual will be also be responsible for Master Data object creation and maintenance adhering to an agreed upon SLA for the department. ESSENTIAL DUTIES AND RESPONSIBILITIES:Customer Master: Customer master creation and maintenance, EDI and Sales reporting configuration. In this role, you will work in close collaboration with Sales Management and AR/ Credit to set up all new customers in SAP/AX.Vendor Master: Vendor master creation and maintenance. In this role, you will work in close collaboration with Purchasing Management and AP to set up all new Vendors in SAP/AX.Material Master: New material creation. Following and enforcing business processes and procedures that could add products/SKUs to our portfolio include the proper steps, roles and tools to assure that master data is loaded into our ERP, APO and supporting systems properly. Support or coach and train the resources needed to create and/or modify material master data, directly impacting the company's ability to execute business processes and generate effective reporting. Communicate to the business when new product configurations are contemplated to assure that our master data management processes can accommodate these evolving needs with existing ERP environments.Pricing Master: Maintain all pricing master data in SAP/AX. Day to day and annual process for updating global list price, promotions, discounts and surcharges. Adherence to strict timelines. Communications to internal and external stakeholders.Finance Objects: Creation and maintenance of Cost Center, G/L Accounts, Work Centers, Profit Centers and any other Finance Master Data related objects. In this role, you will work in close collaboration with Finance and Accounting to set up all Finance objects in SAP/AX.Enforce global SOP's (Standard Operating Procedures) across all business units to govern and control the integrity of master data in the context of existing business processes.Demonstrates ownership of assigned responsibilities.Confident, autonomous, tenacious attitude.Ability to apply preventative not just remedial and corrective measures.Good risk and situation judgement, leading to balanced escalation. Reports risks and issues to Management (not majority of occasions).Rigorous, disciplined approach to work. Good process awareness. Adheres to procedures at all times.Builds and maintains effective working relationships with other teams that support the delivery of quality work.Interacts effectively with others both individually and in group environments.EDUCATION, EXPERIENCE, AND QUALIFICATIONS:5 years Master Data experience in SAP (Materials Management, Customers, Vendors, Finance)Working knowledge of Microsoft Dynamics AX a plusWorking knowledge of GS1, Data Sync or 1WorldSync a plusLSMW or other 3rd party mass maintenance automated script writing and recording software experience a plus (i.e. WinShuttle, HP Functional Testing etc.)Strong planning and organizational skillsGood communication skillsStrong analytical skills, demonstrates the ability to successfully develop and execute plans in a dynamic environmentSystem knowledge: MS Office, strong skills in Excel. If you meet these qualifications and are pursuing new challenges that focus on delivering innovative solutions that increase business value, we'd like to talk with you today. Come be a part of the action at Fujitsu America!  Fujitsu is an Equal Opportunity/ Affirmative Action Employer of Minorities, Females, Individuals with Disabilities and Protected Veterans.SDL2017"}