{"jobID": "2822383530", "jobLocation": "San_Diego_CA", "jobTitle": "Data Scientist II", "companyRating": "3.9", "companyInfo": {"Website": "www.elevate.com", "Headquarters": "Fort Worth, TX", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Public (ELVT) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": "General Summary: Responsibilities include development and monitoring of complex models and tools that are used to drive business decisions for our organization. Principal Duties and Responsibilities:Develop statistical models or nonlinear machine learning techniques for usage in: Underwriting, Existing Customer Management, Marketing Campaigns, and Collections.Conduct the implementation of scorecards.Create weekly and monthly reports to monitor model performance.Develop business logic, pricing strategies, business forecasts, while optimizing profitability.Utilize advanced statistical software to develop regression based, tree based, nonlinear machine learning, and/or other statistical methodologies to minimize credit/fraud losses, maximize response and approval rates, and profitability of products.Present findings and make recommendations to Risk Management team and business leaders.Experience and Education:Minimum M.S./M.A. in a highly quantitative field (Statistics, Economics, Mathematics, or other quantitatively-oriented degree) required.Strong quantitative / statistical modeling/ machine learning capabilities, with 1-2 years of experience in credit scoring.Solid experience in analyzing, recommending and implementing Risk strategies.Strong SAS (Statistical Analytical Software), Python, or R programming skills, with ability to conduct extensive data research.Proven experience working in fast-paced environment with ever-changing demands.Good communication skills for communication with Risk Management peers.Experience in financial services and/or Credit Risk Management preferred.Required Skills and Abilities:Motivation Skills - History of achieving aggressive organizational goals and objectives, conveying sense of urgency while moving beyond challenges and obstacles.Thinking and Administrative Skills - Solid analytical and problem solving skills. Ability to analyze trends and suggest solutions to challenges.Achieve Successful Results– Takes the initiative to get things done.Demonstrates Adaptability– Works effectively in the face of stress, ambiguity, difficult situations and shifting priorities.Innovates– Challenges the status quo thinking to generate new ideas; takes open minded approach to situations.Communication Skills - Refined written and verbal communication skills. Ability to foster open communications, listen effectively and build strong partnership networks.Technological Competence– Extensive knowledge of SAS and risk management technology with the ability to leverage such tools to improve the organization’s decision making criteria."}