{"jobID": "2816105434", "jobLocation": "Sacramento_CA", "jobTitle": "Assistant/ Associate Project Scientist, University of California, Davis, Department of Psychiatry", "companyRating": "2.9", "companyInfo": {"Website": "www.hrsonline.org", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "The University of California, Davis, Department of Psychiatry and Behavioral Sciences is recruiting for a Project Scientist position at the Assistant/Associate level.  This position will require the applicant to contribute to cognitive neuroscience research in the Translational Cognitive and Affective Neuroscience (TCAN) program. Specifically, the candidate will focus on research projects investigating cognition in schizophrenia using a cognitive neuroscience approach, particularly those involving human electrophysiology (EEG) and transcranial direct current stimulation (tDCS) methodologies. This will include contributing to the design, development and execution of these studies, including preparing competitive grant applications, conference presentations and manuscripts for publication. This position will also require behavioral, EEG and tDCS data analysis, and the training and supervision of volunteers and research staff in these areas. In addition, the position will require the application of expertise in language, attention and cognitive control research to translational neuroscience research questions.  This recruitment is conducted at the Assistant/Associate rank. The selected candidate will be hired at the Assistant/Associate rank, regardless of the proposed appointee's qualifications.  This position is open effective June 18, 2018. Applications should be submitted by July 18, 2018 for initial consideration. However, the position will remain open until filled or June 30, 2019.  Qualified applicants should upload a Letter of interest, Curriculum Vitae, along with contact information for 3 to 5 references online at:  https://recruit.ucdavis.edu/apply/JPF02258  UC Davis commits to inclusion excellence by advancing equity, diversity and inclusion in all that we do. We are an Affirmative Action/Equal Opportunity employer, and particularly encourage applications from members of historically underrepresented racial/ethnic groups, women, individuals with disabilities, veterans, LGBTQ community members, and others who demonstrate the ability to help us achieve our vision of a diverse and inclusive community. For the complete University of California nondiscrimination and affirmative action policy see: http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct. If you need accommodation due to a disability, please contact the recruiting department.  Under Federal law, the University of California may employ only individuals who are legally able to work in the United States as established by providing documents as specified in the Immigration Reform and Control Act of 1986. Certain positions funded by federal contracts or sub-contracts require the selected candidate to pass an E-Verify check. More information is available http://www.uscis.gov/e-verify.  UC Davis is a smoke & tobacco-free campus (http://breathefree.ucdavis.edu/). Internal Number: JPF02258"}