{"jobID": "2828116797", "jobLocation": "Interlochen_MI", "jobTitle": "HRIS Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.interlochen.org", "Headquarters": "Interlochen, MI", "Size": "201 to 500 employees", "Founded": " 1960", "Type": " Nonprofit Organization", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "Title HRIS Data AnalystLocationDepartment Name 9610-Human ResourcesDescription Interlochen Center for the arts is seeking a Human Resource Information Systems (HRIS) Analyst. The HRIS data analyst is an intermediate position within the HR structure. The primary focus of this position is the support and maintenance of the Human Resource Information System (HRIS) in addition to other HR systems.  This position serves as a technical point of contact for assigned functional areas and assists subject matter experts with ensuring data integrity, testing of system changes, report generating and analyzing data flows for process improvement opportunities. The HRIS Analyst also supports HRIS upgrades, patches, testing and other technical projects as assigned.  Responsibilities: Manage all HRIS dataHires new employees in the system year round and generates offer letters and contractsWork with IT to maintain HRIS system requests and any new system implementationsRun various reports of all levels in HRIS system for HR, Finance/payroll, and Senior Managers as neededOversee retirement contribution and planning processOversee the compensation process & creation/updates of all employee records for payrollManages annual benefits enrollment process in HRIS System and assists employees with logging in as neededOversee the ACA reporting processManage changes to employee handbooksAssist with annual summer employee camp check-inOther HR projects as needed Qualifications: Bachelor’s Degree Preferred/or Associates Degree and two years of experience working within an HRMust be detail oriented and able to manage multiple responsibilities in a timely mannerPosition requires extreme attention to detailMust be computer savvyMAC and/or PC experience a plusADP & SalesForce experience a plusApplication Process:If interested in applying please submit an application by clicking the \"Apply Now\" button at the bottom of the page.Required documents for application are: cover letter/letter of interest, resume and a current listing of three references. You can upload these documents during the submission of the application process by selecting \"Apply and continue to upload documents\" button. Please upload your documents in a pdf format.  Review of materials will commence immediately and continue until the position has been filled. Materials submitted will be held in strictest confidence, and references will not be contacted without the permission of the applicant. The next step of the application process will ask you a series of questions, some are required by the EEOC concerning Protected Veteran Status and Voluntary Self-Identification of Disability. For more information please view the following hyperlinks. EEOC Voluntary Self-Identification of Protected Veteran Status  Voluntary Self-Identification of Disability If interested in applying please submit an application by clicking the \"Apply Now\" button at the bottom of the page.More information about Interlochen Center for the Arts:COMPANY DESCRIPTION Interlochen Center for the Arts is the recipient of the National Medal of Arts and the only organization in the world that brings together: a 2,500-student summer camp program; a 500-student fine arts boarding high school; opportunities for hundreds of adults to engage in fulfilling artistic and creative programs; two 24-hour listener-supported public radio stations (classical music and news); more than 600 arts presentations annually by students, faculty and world-renowned guest artists; a global alumni base spanning eight decades, including leaders in arts and all other endeavors. For information, visit Interlochen online at www.interlochen.org.  Interlochen Center for the Arts MISSION…  To engage and inspire people worldwide through excellence in educational, artistic and cultural programs, enhancing the quality of life through the universal language of the arts. THE CORE PURPOSE… To ignite lifelong passion for the arts THE CORE VALUES… Nurturing, Inspiring,Transforming, Enlightening and Enduring Interlochen Center for the Arts includes: Interlochen Arts Academy  Interlochen Arts Academy, a fine arts boarding high school, offers the highest quality artistic training combined with comprehensive college-preparatory academics. The Academy also offers post-graduate opportunities.  Interlochen Arts Camp  Young artists from around the world gather at Interlochen each summer to learn, create and perform alongside leading artists and instructors. Programs are offered to students in grades three through twelve.  Interlochen College of Creative Arts  Adult artists thrive on opportunities to learn and express themselves creatively. The College of Creative Arts offers programs in a variety of arts disciplines.  Interlochen Public Radio  Classical Music: 88.7 FM, Interlochen; 88.5 FM, Mackinaw City; 94.7 FM, Traverse City and 100.9 FM, East Jordan/Charlevoix  News Radio: 91.5 FM, Traverse City; 90.1 FM, Harbor Springs/Petoskey; 89.7 FM, Manistee/Ludington  Streaming online at ipr.interlochen.org. Through two listener-supported broadcast services, Interlochen Public Radio (IPR) connects northwest Michigan with arts, news and culture on a global scale. IPR also gives significant focus to local and regional news, information and artists.  Interlochen Presents  Interlochen brings dozens of world-renowned artists to northwest Michigan, enhancing the region’s position on the global arts map. Interlochen presents more than 600 events each year by students, faculty and guest artists, making Interlochen one of the nation’s largest arts presentersSelf Identification Text"}