{"jobID": "2833023714", "jobLocation": "Santa_Monica_CA", "jobTitle": "Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.truecar.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Public (TRUE) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Edmunds.com, Autotrader, Cars.com"}, "estimatedSalary": "74000", "jobDescription": " Job Description:Auto manufacturers (OEMs) spend over $40B annually on consumer incentives. TrueCar wants to make that spend more effective, while at the same time providing exclusive savings to users of TrueCar sites. TrueCar is investing in our OEM Solutions and Insights team as a key priority for growth. The Analyst, OEM Insights & Solutions role offers a great opportunity to get in on the ground floor of this entrepreneurial initiative. We're looking for an enthusiastic and analytical solution-driver who thrives on engaging with data to help our business understand and grow our auto manufacturer incentive programs. This is an outstanding opportunity to dig deep into a key TrueCar priority, integrate data from a wide variety of internal and external sources, and produce compelling insights for growth. ABOUT THE JOB:Own all aspects of analytics, reporting, optimization insights and forecasting for TrueCar OEM incentive programsDevelop analytics and reporting capabilities for new OEM programs as they launchGather data from various sources, including TrueCar business intelligence, Omniture, TrueView, automotive data providers, and OEM to develop well-rounded and robust analysis on current programsProduce client-ready reporting covering program performance for both internal audiences and OEM clients, including monthly reporting to OEMs summarizing performanceUnderstand program results from key marketing and product initiatives and articulate the key drivers of program success or needs for improvementLeverage insights created by the OEM team into actionable recommendations to improve program performanceCreate program forecasts for current and prospective OEM programs. Present to key stakeholders (executives, finance, OEMs) and track performance vs. projections.Work closely with OEM client solutions managers to create proposal presentations for new OEM programsCollaborate with developers and data scientists from the business intelligence team to build a data infrastructure that supports OEM analyticsWHAT YOU NEED: 3-5 years corporate experienceBA or BSStrong analytical background, with experience identifying trends and key takeaways from dataStrong understanding of user needs in report and forecast requestsAbility to analyze, organize, and integrate large amounts of complex data into clear and concise presentations and status reportsOutstanding attention to detail and time-management skillsIn-depth knowledge of Microsoft Excel and PowerPointExperience analyzing online metrics using MicroStrategy, Omniture or similar business intelligence tools requiredNICE TO HAVE:Passion for the automotive and internet industries a plusDegree with coursework in a quantitative discipline (e.g. statistics, mathematics, econ, engineering) Location(s): Santa Monica Offices"}