{"jobID": "2817598576", "jobLocation": "Okemos_MI", "jobTitle": "Position Title Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.dnvgl.com", "Headquarters": "Høvik, Norway", "Size": "10000+ employees", "Founded": " 1864", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": " Location US-MI-Okemos  Requisition ID 2018-10824  Business Area Energy  Category/Discipline Consulting  Position Type Permanent employment  Local Unit & Position Description  DNV GL - Energy's Sustainable Energy Use is seeking a Data Analyst to join our Program Delivery and Implementation (PDI) team. PDI helps commercial and industrial utility customers save energy and money. The successful candidate will think strategically and apply skills in project management, business analysis, requirements gathering, functional testing, change management, troubleshooting and training to implement business processes and applications. This position is based in our Okemos, Michigan office.  Tasks May Include Interview business stakeholders to gather detailed product requirements (scope, background, business case, etc.)Develop Business Requirements Document (BRD) to define business rules and objectives, current operational procedures, risk, input and output requirements, system access, etc.Translate Business Requirements into functional requirements by developing As-Is and To-Be process documentation, use case scenarios, data models, logic details, work instructions, etc.Create test case documents to facilitate quality assurance and user acceptance testing prior to product releaseEvaluate business processes, anticipating requirements, uncovering areas for improvement, and developing and implementing solutionsManage projects, including client interaction, developing analysis plans and leading an analytical teamMeets financial objectives by forecasting requirements; preparing budgets; scheduling expenditures; analyzing variances; initiating corrective actionsAnalyze data from energy efficiency programs, including energy savings, incentive calculations, technology cost impacts, and application processes/statusesPerform a variety of quality control checks to maintain and assure the accuracy and consistency of data in tracking systemsPerform database (SQL server, Access, or Oracle) queries and program data analysis as requestedGather and prioritize user requirementsWrite reporting requirement documents, create product specifications and technical mock-ups for new business intelligence tools to support decision making and performance trackingMaintain existing dashboard tools, identify enhancements, track and promote usage across companyPerform and/or manage user acceptance and regression testingWrite user manuals, train users, and provide technical support on reporting toolsTrack portfolio/program savings and budget progressTrack and prepare monthly invoices; ensure accurate billing and reconcile changes Position Qualifications  What We're Asking Bachelor's degree in an analytical discipline, such as engineering, mathematics, statistics, finance, or computer programming is strongly preferredMinimum of 3 years of experience in writing business requirements documents, software design, documentation, and maintenance is requiredA proven grasp of database and analysis tools such as Access and Excel, and demonstrated analytical skills to solve business issues. In Excel, familiarity with pivot tables, VLOOKUP, and sum functions are required. Familiarity with SQL is preferredEnergy efficiency experience is preferred, and the ability to learn how energy savings are calculated is requiredExperience working in a fast-paced environment, managing multiple deliverables, and remaining flexiblePrevious experience in business intelligence is highly preferredThe successful candidate should also have excellent written and oral communication skills, and is able to translate complex concepts in a clear and concise wayPresentation and training experience is requiredMost importantly, this individual should display a positive, team-oriented attitude to match our friendly work environmentStrong verbal and written English communication skillsWillingness and ability to travel up to 5% of the time (domestic)We conduct pre-employment drug and background screeningPreferred Skills (Not Required): SQL, SQL Server Reporting Services, SharePoint *Immigration-related benefits (for example, visa sponsorship) are not available for this position** Opportunities Beyond Business  Our mission is to safeguard life, property and the environment. By joining us, you will work towards our meaningful vision: to make a global impact for a safe and sustainable future. DNV GL offers a congenial working environment, competitive salaries, and an exceptional benefits package.  DNV GL is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without regard to race, color, religion, age, sex, national origin, disability or protected veteran status. For more information about your rights under the law, see: *************************************************************** Please visit our website at *************  Company & Business Area Description  DNV GL is a global quality assurance and risk management company. Driven by our purpose of safeguarding life, property and the environment, we enable our customers to advance the safety and sustainability of their business.  We provide classification, technical assurance, software and independent expert advisory services to the maritime, oil & gas, power and renewables industries. We also provide certification, supply chain and data management services to customers across a wide range of industries.  Combining technical, digital and operational expertise, risk methodology and in-depth industry knowledge, we empower our customers' decisions and actions with trust and confidence. We continuously invest in research and collaborative innovation to provide customers and society with operational and technological foresight.  With origins stretching back to 1864 and operations in more than 100 countries, our experts are dedicated to helping customers make the world safer, smarter and greener.  DNV GL delivers world-renowned testing and advisory services to the energy value chain including renewables and energy efficiency. Our expertise spans onshore and offshore wind power, solar, conventional generation, transmission and distribution, smart grids, and sustainable energy use, as well as energy markets and regulations. Our experts support customers around the globe in delivering a safe, reliable, efficient, and sustainable energy supply."}