{"jobID": "2644209948", "jobLocation": "Plainsboro_NJ", "jobTitle": "Real World Data Scientist HEOR", "companyRating": null, "companyInfo": {"Website": "www.greenkeyllc.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Beacon Hill Staffing Group, PageGroup, Solomon Page"}, "estimatedSalary": null, "jobDescription": " Job Description:  The Real World Data (RWD) Scientist conducts specific in-house HEOR studies across the entire client portfolio. In addition, the incumbent also coordinates certain department-wide activities including but not limited to HEOR website, staff meetings, HEOR Health Economics and Outcomes Research, Research Review Committee (RRC) meetings, and key contacts with outside researchers. S/he may also participate in HEOR studies and research projects as a research project manager.  The RWD Scientist, reports to the Head of RWD and works closely with all colleagues in the HEOR department.  Responsibilities:  Perform real world data analyses: Performs analyses for in-house projects based on the \"Database Warehouse\", in close collaboration with HEOR program leads.  Support entire portfolio: Leverages methodological and analytical expertise and access to databases to support key strategic initiatives across the entire company portfolio such as product strategy, HEOR methodologies and policy for the US market.  Serve as an internal research method expert: Acts as a key subject matter expert in various methodological and analytic functions and provides consultation to / collaborates with key internal and external stakeholders directly to provide tangible solutions that are aligned to portfolio strategy.  Coordinate across projects: Supports all analyses of the HEOR data warehouse and supports various HEOR research projects either done internally or with third party (e.g. vendor) relationships as needed.  Support HEOR studies and programs: Works closely with HEOR researchers as a member of the research team on select research projects."}