{"jobID": "2724464638", "jobLocation": "Vienna_VA", "jobTitle": "Principal Data Scientist- Clickstream Enterprise Customer Intelligence", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "121000", "jobDescription": " Towers Crescent (12066), United States of America, Vienna, Virginia  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Principal Data Scientist- Clickstream Enterprise Customer Intelligence  Principal Data Scientist, Enterprise Customer Intelligence  At Capital One, data is at the center of everything we do. When we launched as a startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and this little innovation and our passion for data has skyrocketed us to a Fortune 100 company and a leader in the world of data-driven decision-making. Team Description: Enterprise Customer Intelligence (ECI) is a team of product managers, data scientists, program managers and engineers who are passionate about enabling financial products to be aware and adaptive to consumers needs. We develop APIs, data platforms and tools for Capital One to develop and apply continuous customer understanding and context in all our consumer products and experiences.  We believe deep understanding of our customers and consumers at large will help us deliver innovative customer experiences, drive differentiation in the marketplace, and simultaneously create business and consumer value. Role Description Clickstream Modeling Data Scientist: In this role, you will: Collaborate closely with business and product teams to conduct targeted analyses of clickstream and log data, developing findings that guide improvements to business outcomes and customer experience.Work with technical teams to operationalize findings in production systemsExperience analyzing web traffic or building marketing/advertising models is a plus. All data scientists on the ECI Data Science team: Write software (Python, Scala, e.g.) to collect and analyze numerical and textual data (billions of customer transactions, clicks, payments, etc.) using tools like Hadoop, Spark, Elasticsearch, and AWS. Build tools to explore and visualize data in order to uncover meaningful customer behavioral patterns.Collaborate with business and product teams within our Digital Products organization as well as other parts of Capital One to understand their business drivers, data landscape and customer needs.Build machine learning models through all phases of development, from design through training, evaluation and validation, to deployment to production for 30+ million customers. The Ideal candidate will be: Curious and creative. You thrive on bringing definition to big, undefined problems. You love asking questions, and you love pushing hard to find the answers. Youre not afraid to share a new idea. You communicate clearly and effectively to share your findings with non-technical audiences.Technical: You have hands-on experience developing data science solutions from concept to production using open source tools and modern cloud computing platforms. You are not afraid of petabytes of data.Statistically-minded. You have built models, validated them and backtested them. You know how to interpret a confusion matrix or a ROC curve. You have experience with clustering, classification, sentiment analysis, time series analysis and deep learning.Customer and product oriented. You share our passion for changing banking for good. Twenty-five years after Capital One was started its still led by its founder. Be ready to join a community of the smartest people youve ever met, who see the customer first, and want to use their data skills to make a difference.  Basic Qualifications: Bachelors Degree plus 2 years of experience in data analytics, or Masters Degree plus 1 year of experience in data analytics, or PhDAt least 1 year of experience in open source programming languages for large scale data analysisAt least 1 year of experience with machine learningAt least 1 year of experience with relational databases Preferred Qualifications:  -Masters Degree or PhD  -At least 1 year experience working with AWS At least 3 years experience in Python, Scala, or RAt least 3 years experience with machine learningAt least 3 years experience with SQL Capital One will consider sponsoring a new qualified applicant for employment authorization for this position."}