{"jobID": "2543595939", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Clinical Data Analytics Manager", "companyRating": null, "companyInfo": {"Website": "www.mpro.org", "Headquarters": "Farmington Hills, MI", "Size": "51 to 200 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Clinical Data Analytics Manager  Summary Description  The Clinical Data Analytics Manager is a key team member and has a thorough understanding of the complexities of healthcare delivery within the context of regulatory and reporting requirements. This role will work closely with multiple members of the MPRO team, including our Medicare Quality Improvement team, Applied Epidemiology and Evaluation, Finance and Review Services, to ensure organizational goals regarding various quality measures are met. Additionally, the position will provide external reporting for those that are clinically relevant to our constituent audiences (hospitals, health systems, provider groups, post-acute care, etc.) The Manager will also work closely with our Business Development team to assist in the development of new products for the provider market, and to enhance existing ones with useful data analytics. ResponsibilitiesSupports teams in the implementation of data-driven, quality initiatives, improves the flow and use of information, develops queries and analytical products that support team members and leaders in their deliverables and other goals.Collaborates closely with teams engaged in quality improvement helping to identify performance measurement information and data quality needs.Participates in broader data harmonization initiatives while championing the use of data and performance analytics within and across all MPRO partners.Creates, designs, tests and deploys data collection, validation and reporting tools and processes for extracting and managing performance data.Identifies gaps in data availability, and defines and implements solutions to close those gaps.Provides consultative and analytical support regarding the collection, interpretation, analysis and presentation of data to help teams ensure that clinical information management practices support best practice standards.Creates effective working relationships with multiple teams and manages data quality, business process improvement, report development and other projects using effective project management practices.Works with peers and other team members on standards development and data harmonization priorities. Provides detailed project status updates to support scheduling and workload management.Conducts analysis and develops reports and presentations using statistical reporting packages, and presents information to a variety of audiences.Regularly monitors, identifies and evaluates performance and industry trends to serve as a source of information and advisement for leadership. Monitors activities for and ensures compliance with laws, government regulations and MPRO policies.Monitors activities for and ensures compliance with laws, government regulations and MPRO policies.Contribute to the design, creation and lifecycle management of data collection, validation, reporting and presentation. Skills Required Analytical ability to develop programs, gather/interpret/monitor data for accuracy and reporting; to analyze and assess needs to create solutions to difficult administrative or technical situations; to anticipate and resolve a broad range of issues and concerns on multiple, sometimes unrelated topics; to determine the need for process development and refinement; to independently evaluate situations and outline ramifications of multiple solutions or options; to recommend goals for a function/area and understand when intervention in current work processes must occur to ensure successful delivery of service.Excellent communication and interpersonal skills for contact with internal and external customers/stakeholders to obtain and interpret a variety of information based on knowledge of departmental practices, MPRO policies and programs. Discretion must be exercised in deciding what and how to communicate. Diplomacy, tact and listening skills are required. Ability to read, interpret and write technical materials is required.Willingness to pursue roles with increasing levels of accountability, comfort with decision-making responsibilities, coaching, teaching and counseling skills, and the ability to inspire and build confidence in others and to forge alliances and garner support.Analyze financial aspects of company by collecting, monitoring and studying data to recommend actions. Knowledge and understanding of general finance principles required.Must be able to pull data from a small population in a short time span for more immediate knowledge and output.Ability to handle a variety of concurrent assignments and to work independently.Minimum QualificationsMasters Degree in Information Technology, Biostatistics/Epidemiology, Finance, Business Administration, Hospital Administration, Statistics, Health Sciences or other related field; or the equivalent combination of related education and/or experience.Three years of experience in clinical information systems and database management in a provider space to possibly include applied knowledge of clinical and business systems; and experience in programming languages and reporting writing tools.Prior experience in a hospital, large physician organization or other healthcare provider group required. Must understand workflows in these environments.Experience with clinical reporting tools such as Clarity, Epic and PowerInsight. Advanced proficiency in MS Suite and statistical software such as SPSS and SAS.Excellent oral and written communication skills for contact with internal and external customers to obtain and interpret a variety of information. Ability to read, interpret and write technical materialsProject management skills including the ability to define program, project, or process objectives, identify stakeholders interests, plan steps, and coordinate and allocate resources appropriately.SDL2017"}