{"jobID": "2820056773", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Competitive Intelligence Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Network and Technology Spend Strategy & Analytics team is hiring a passionate and strategic thinker to join a high profile, high visibility team that powers Network analytics and strategic thinking for Employer. You will be part of a team that builds tools, analyses, and insights that informs, quantifies, and enables the visualization of data to drive business decisions and investment for the Employer Wireless and Wireline Networks. We create strategic insights and visualizations for senior leaders in the company across multiple organizations. You will be part of the team that shapes multi-billion dollar investments for the nation's largest and fastest 4G LTE Network. This is a job for an intelligent, decisive, quick, forward-thinking, strategic, and tactical thought leader. You have exceptional influencing skills and preferred experience working across areas and levels of an organization. The Data Scientist will contribute in a team of at least four engineers in one of two functional disciplines. Responsibilities will primarily be competitive intelligence. You will lead competitive research and intelligence, remain current with the competitive landscape and work in partnership with cross functional teams to develop strategies to counter competitive threats. RESPONSIBILITIES: Role: Individual contributor role will report to Manager of Data Analytics. Deliver results at a high level of independence to drive decisions and recommendations beyond routine tasks. Develop insight from data collected through data science methodology, to create meaningful connections between us and our competitors. Competitive Analysis: Connect information to stimulate conversation related to competitors, products, macroeconomic, social, political indicators and support the organization in making strategic decisions. Work with 3rd party companies to pull data related to tests/trials and compute key benchmarking metrics for network parameters. Create consumer empathy/understanding across the business team by effectively communicating existing consumer understanding and identifying actionable learning needs. Communicate and embed learning to increase the impact of insights into action by making them relevant to the business strategy. Assist with and participate in product launches, product demonstrations, partner/customer conferences, and strategic planning sessions. Cross Functional Collaboration: Ability to manage multiple projects simultaneously, adapt to changing priorities and meet aggressive deadlines. Being the go-to-person for the analyst of competitive intelligence. Collaborate with data management engineers and business stakeholders to ensure data governance audit standards. Executive Presentations: Ability to analyze complex data sets, draw conclusions and relationships and develop actionable recommendations. Effectively communicate actionable insights to category leads supporting their goals and objectives. YourMembership_RPM. Keywords: Business Intelligence Analyst, Location: Basking Ridge, NJ - 07920"}