{"jobID": "2827573120", "jobLocation": "Saint_Joseph_MI", "jobTitle": "Clinical Leader - Nursing and Scheduling", "companyRating": null, "companyInfo": {"Website": "www.lakelandhealth.org", "Headquarters": "Saint Joseph, MI", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities: · The Clinical Leader oversees the staff that cares for hospice patients and their families; oversee EMR documentation; oversee adherence to hospice regulatory compliance.  · The Clinical Leader also leads the assigned team/s in the collaboration process to assess, plan, implement, coordinate, monitor, and evaluate patient/family care strategies and services by using the strengths of all of the members of the interdisciplinary team in providing holistic, relationship centered care for all hospice patients.  · Supports organizational goals to increase access to hospice services, serve more people, and achieve customer service quality measures.  · Demonstrates personal accountability for own continuous growth and development.  · Seeks out appropriate opportunities to enhance competency and improve performance.  · The person in this position serves as the leader/coach for all nurses on the hospice interdisciplinary teams and in partnership with the other clinical leaders, will work closely with the Nurse Care Managers and LPN's to assure documentation excellence, nursing care that exceeds expectations, and regulatory compliance.  · All daytime triage and scheduling staff report to this person. Requirements: · Current license to practice as Registered Nurse in Michigan; strongly encourage CPR certification; valid Driver's License required.  · Graduate of approved School of Nursing required.  · Bachelor's Degree in business, health care or related field preferred.  · 2-3 years' experience in healthcare elated field preferred.  · 2-3 years supervisory experience preferred.  · Hospice program experience preferred. Critical thinking skills.  · Proficient in use of electronic medical records.  · Demonstrates an ability to establish a high level of rapport with patients/families, placing them at ease across a range of cultures, ethnicities, spiritual, environmental, physical and emotional backgrounds.  · Demonstrates diplomacy, integrity, and a positive professional attitude when working with staff of facilities, physicians' offices, pharmacies, or other professional agencies and contacts.  · Demonstrates emotional intelligence through behaviors of cooperation, adaptability, flexibility and self-control. "}