{"jobID": "2761604614", "jobLocation": "Los_Angeles_CA", "jobTitle": "Business Intelligence Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.herbalife.com", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Public (HLF) ", "Industry": " Consumer Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Beachbody, Guthy-Renker"}, "estimatedSalary": "97000", "jobDescription": "About Herbalife Nutrition Herbalife Nutrition is a global nutrition company whose purpose is to make the world healthier and happier. We have been on a mission for nutrition - changing people's lives with great nutrition products & programs - since 1980. Together with our Herbalife Nutrition independent distributors, we are committed to providing solutions to the worldwide problems of poor nutrition and obesity, an aging population, skyrocketing public healthcare costs and a rise in entrepreneurs of all ages. Herbalife Nutrition offers high-quality, science-backed products, most of which are produced in Company-operated facilities, one-on-one coaching with an Herbalife Nutrition independent distributor, and a supportive community approach that inspires customers to embrace a healthier, more active lifestyle.  Herbalife Nutrition’s targeted nutrition, weight-management, energy and fitness and personal care products are available exclusively to and through dedicated distributors in more than 90 countries.  Through our corporate social responsibility efforts, Herbalife Nutrition supports the Herbalife Family Foundation (HFF) and its Casa Herbalife programs to help bring good nutrition to children in need. Herbalife Nutrition is also proud to sponsor more than 190 world-class athletes, teams and events around the globe, including Cristiano Ronaldo, the LA Galaxy, and numerous Olympic teams.  Herbalife has over 8,000 employees worldwide, and our shares are traded on the New York Stock Exchange (NYSE: HLF) with net sales of approximately $4.4 billion in 2017. To learn more, visit Herbalife.com or IAmHerbalife.com. POSITION SUMMARY STATEMENT: The Business Analyst will be responsible for analyzing and presenting information relating to the company sales, Member and Herbalife Marketing Plan. Use knowledge of the Herbalife business and keen analytical skills, while leveraging technology to access and integrate data from various systems, to identify business trends, monitor key performance metrics to support decisions related to Members, events and promotions, sales/marketing and overall company strategy. The role will also support reporting and analysis for wide range of company strategic initiatives and business enhancements. DETAILED RESPONSIBILITIES/DUTIES: · Generate on-going statistical reports, data investigations, “what-if” modeling and analyses for Sr. Management to support critical decisions related to the overall company strategy.  · Support monthly and quarterly Member Metrics and trends validation process to ensure accuracy. The validation process includes ensuring that data is accurately captured from various data sources, understanding and interpretation of data formulas, and calculations and troubleshooting of variances.  · Develop and execute complex data mining analyses, which involve the design and execution of statistical programs to extract data.  · Develop logic, build from scratch and maintain Member analytical reports (both ad-hoc and scheduled) using Excel, BI/Micro Strategy and/or Access programs.  · Design, build, and implement new report formats and layouts on a customized basis. Extract data to manipulate/calculate/format into presentable reports, charts, and graphs for PowerPoint presentations for regional teams and management.  · Collaborates with IS and Business Intelligence team, in ongoing decisions regarding data collection, validation, methodology and integration of new functionalities.  · Optimize and improve efficiencies, quality, timeliness and sort out relevance of current routine reports and processes. Seek opportunities for automation or enhancement of existing methodologies.  · Participate in the projects supporting company strategic initiatives.REQUIRED QUALIFICATIONS:Skills:Proficient knowledge of pivot tables, macros, editing VBA/SQL, v-lookup, queries, and report writing to analyze data and consolidate reportsProficiency with MS Excel, MS Word, Power Point and AccessStrong analytical skills to evaluate, understand and interpret data from both internal and external perspectiveMust be able to communicate ideas and analysis results effectively both verbally and in writing to both analytical and non-analytical audienceMust demonstrate an ability to recognize and define problems, understand business and system processes, collect data, establish facts, and draw valid conclusionsMust be able to formulate and communicate questions to gather the necessary missing information to resolve a problem.Self-motivated with the ability to work both independently and in a team environmentGoal oriented, multi-task projects, superior time management and organizational skillsAble and willing to work in the fast pace environment with demanding deadlinesExperience: 3 years of experience in the functional areas of business analysis, financial analysis, statistical model development, and data mining and/or CRM (Customer Relationship Management) database analysisKnowledge of Relational Models and Data Warehouse methodologyExperience with Web based project management toolsExperience with Business Intelligence applications such as MicroStragegy, Cognos, Tableau.Education:BA/BS in Business, Economics, Finance or related field,or equivalent work experience.PREFERRED QUALIFICATIONS:Expert knowledge of Herbalife Marketing Plan and business modelProject Management backgroundExperience with T-SQL and the SQL Server Platform"}