{"jobID": "2812846668", "jobLocation": "San_Bernardino_CA", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.sbccd.org", "Headquarters": "San Bernardino, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Job Title: Data Analyst-352 Location: 114 South Del Rosa Drive, San Bernardino, California 92408 Full-Time/Part Time: Full-time  Job Description:Class specifications are intended to present a descriptive list of the range of duties performed by employees in the class. Specifications are not intended to reflect all duties performed within the job; however, any additional duties will be reasonably related to this class.SUMMARY DESCRIPTION Under administrative direction, the Data Analyst performs a variety of complex technical work related to the interpretation, maintenance and reporting of data; coordinates, maintains and facilitates the District wide processes and reporting of data to State and federal agencies and other approved external agencies.  This position audits, prepares, and verifies the quality of the data for a variety of program activities, and reporting requirements, such as Management Information Systems (MIS), Clearinghouse, and Integrated Postsecondary Education System (IPEDS), and other approved external databases. This position also interfaces with users and administrators to assess, train, and assist with the implementation, conversion, and customization of administrative software solutions.  Incumbents are assigned to perform a wide range of general technical, and program support duties independently for assigned program area requiring a broad knowledge of the assigned program or functional area. REPRESENTATIVE DUTIESThe following duties are typical for this classification. 1. Develops training solutions and trains Administrative Systems users on procedures and innovations related to Administrative Systems and data management functions and provides technical training and support to the District departments, staff and administrators with regard to data reporting.  2. Writes and/or revises user training manuals and procedures.  3. Assists District management in compliances with federal and state data requirements provided in a variety of laws and regulations. Reviews state changes and updates the college's procedures to ensure continued compliance; creates files and maintains records as appropriate.  4. Assists users and Computing Services technical staff in diagnosing and resolving problems.  5. Develops and maintains relations and communication between users of the Administrative System and District Computing Services (DCS).  6. Assists District department managers to stay current with operational best practices, federal and state data requirements provided in a variety of laws and regulations that relate to functional use of Administrative Systems.  7. Coordinates on-going large systems functions that interface with external organizations' or that involves multiple colleges, departments or other disparate groupings.  8. Reports status on in-process work and/or projects. Attends meetings as appropriate to keep informed of issues and decisions being made in assigned areas.  9. Evaluates, tests, and documents new or modified functionality of the Administrative Systems when patches or upgrades are being applied to the software; maintains operations and user documentation as system modifications are implemented.  10. Assists users in the decision making process regarding codes, parameters, data conversion specifications, standards and regular reporting needs; assists with critical user production and project scheduling; makes recommendations for new reports, screen designs, implementation strategies, and priorities.  11. Assist college management and users in the development of forms and work procedures related to Administrative Systems processes and data collection.  12. Investigates and resolves problems and errors related to Administrative Systems processes and data collection.  13. Maintains and documents help desk tickets related to those issues handled.  14. Develops calendar of events and other schedules related to assigned District activities and services; reviews, updates, and informs others of essential timelines; coordinates assigned District activities; assures the timely completion of work in accordance with established policies and procedures.  15. Applies applicable policies and procedures to verify and review various files and reports for completeness and compliances with established regulations and procedures.  16. Compiles information from various sources and prepares appropriate reports; reviews data and prepares special and periodic reports related to an assigned project and/or program area including state and federally mandated reports; verifies accuracy, completeness, and compliance to rules, procedures, regulations, policies, and other mandates.  17. Utilizes various computer applications and software packages; maintains and generates reports from a database or network system.  18. Coordinates, develops and maintains communication and activities with other District departments and personnel, educational institutions, governmental and private agencies.  19. Attends professional group meetings and workshops; stays abreast of new trends and maintain a working knowledge of information related to area of assignment.  20. Performs other related duties as assigned. QUALIFICATIONSThe following generally describes the knowledge and ability required to enter the job and/or be learned within a short period of time in order to successfully perform the assigned duties.Knowledge of:Principles, practices, procedures, and techniques involved in the collection, interpretation and reporting of data.Computer systems common in higher education administrationData mart concepts, structures, and technologies.State reporting and State Management Information System.Considerable knowledge of Title 5 and other guidelines related to mandated reporting.Current office computer technology, procedures and practices.All aspects of computer operations with a special emphasis on general business applications.Program testing and implementation.Principles of training/supporting technology users.Ability to:Provide training and support to technology users on new and existing systems and software.Work independently in performance of duties.Prepare clear, accurate and concise tables, schedules, summaries and other materials in statistical and narrative form.Analyze information, solve problems, and develop and implement solutions.Understand and interpret federal and state laws, regulations, and guidelines.Use correct English grammar, punctuation, and spelling.Establish priorities, schedule and coordinate work flow.Follow oral and written instructions.Communicate clearly and concisely, both orally and in writing with technical and non-technical employees.Establish and maintain effective working relationships with those contacted in the course of work.PHYSICAL DEMANDS AND WORKING ENVIRONMENTThe conditions herein are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions.Environment: Work is performed primarily in a standard office setting. Physical: Primary functions require sufficient physical ability and mobility to work in an office setting; to stand or sit for prolonged periods of time; to occasionally stoop, bend, kneel, crouch, reach, and twist; to lift, carry, push, and/or pull light to moderate amounts of weight; to operate office equipment requiring repetitive hand movement and fine coordination including use of a computer keyboard; and to verbally communicate to exchange information. Vision: See in the normal visual range with or without correction; vision sufficient to read computer screens and printed documents; and to operate assigned equipment. Hearing: Hear in the normal audio range with or without correction. SALARY AND BENEFITS Salary Range is from $4,664.00 to $5,671.00 per month plus family medical, dental, vision coverage, and employee life insurance (employee contribution dependent upon plan selected). This position contributes to CalPERS Retirement (employee contribution will depend on membership status). CSEA union dues are 1.5% up to a maximum of $47.25. *Salary and position job description under review and subject to change*Requirements:Education and Experience Guidelines - A typical way to obtain the knowledge and abilities would be:Education/Training:An Associate's degree from an accredited college or university with major course work in computer science, business systems, or a related field.Experience:Four years of experience in educational administrative support, data management and reporting.Preferred:California Community College experience in administrative student systems, data management and reporting.Special Instructions: All interested parties must apply through the website and submit ALL of the following documents to be a considered qualified applicant:  1. Completed San Bernardino Community College District online Application. Do not state \"see resume\" on the application form.Determination of applicants meeting minimum requirements will be based upon information provided in the SBCCD application.Resumes will be reviewed by the committee only after information satisfying minimum requirements have been listed in the SBCCD application.Paper applications will not be accepted.Incomplete applications will not be accepted. 2. A resume summarizing your educational and professional experience.  3. A cover letter explaining how your experience and background demonstrate that you meet the minimum requirements for the position stated in the posting.  4. Unofficial Transcripts that show you meet the minimum educational requirement(s) for the position. Transcripts and documents must be legible.Only transcripts showing that the minimum requirement is met will be accepted.Copies of diplomas will not be accepted in lieu of transcripts.Transcripts must be from a US accredited institution.Transcripts from outside the US must include an official evaluation for equivalency.Official Transcripts will be required upon hire.Work Schedule:Closing Date: Jul 5, 2018 "}