{"jobID": "2835344903", "jobLocation": "San_Antonio_TX", "jobTitle": "Meta Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.innove.com", "Headquarters": "Boerne, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB DESCRIPTION: Description of Position, Primary Function or Responsibilities  Air Education and Training Command is creating a new Chief Data Officer function. The Metadata Analyst will be part of the technical support team who would define, build and manage a new learning services system to modernize the commands learning environment. This would include engaging with stakeholders to learn about needs and existing solutions, creating a new technical backbone for the command, and helping develop a modern data strategy.  The Metadata Analyst is responsible for the methods and procedures for proper use and maintenance of the metadata environment with primary focus on enabling management, preservation, discovery and re-use of the information resources. Defines strategy, approach, and architecture for metadata solutions, and develops rules and methodologies for data collection and analysis. Coordinates day-to-day metadata processes, data models, and operations in alignment with established goals and deadlines while advising Agency stakeholders of improvements for optimal use of data at various levels for new data sources, workflows, and process flows to ensure stakeholder satisfaction. MINIMUM QUALIFICATIONS & EXPERIENCE Bachelors Degree in associated discipline area (e.g. computer science, information technology, statistics, etc).  Two years of experience in enterprise data projects and in implementing metadata processes and solutions. One year of experience with relational databased and SQL. Solid project management, data modeling and data analysis experience.  Secret clearance. PREFERRED QUALIFICATIONS & EXPERIENCE Experience on MAJCOM staff; familiarity with flying training, aircraft maintenance and related data systems; strong research, problem solving, interpersonal and communications skills.  Contingent upon contract award.SDL2017"}