{"jobID": "2812171166", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.cyndx.net", "Headquarters": "Santa Monica, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Cyndx Networks is hiring an experienced and talented Senior Data Engineer! The Senior Data Engineer will construct a scalable, stable, and performant data infrastructure to support our multiple SaaS products and data science team. The Senior Data Engineer will collaborate with a team of engineers and product managers to identify and build data layer components and best-practice frameworks for data ingestion, cleansing, normalization, manipulation, and expunction.Responsibilities Develop software to ingest and store large datasets from varied sources Build ETL processes to translate data from native format to usable, application-ready data Collaborate across teams to gather data requirements for our applications Employ state-of-the-art frameworks and technologies to deliver reliable and maintainable data services Assist in real-time support of production services Participate in agile ceremonies such as sprint planning, daily standup, demos, and retrospectivesTechnologies SQL Python Git Docker PostgreSQL, Neo4j, Redis Apache SPARK ElasticSearch AWS - VPC, EC2, Glue, Redshift, Kinesis, RDSQualifications 3+ years experience building and maintaining large scale data systems Expert-level knowledge of Python and SQL programming languages Experience developing and deploying software in a containerized environment Demonstrated strength in data modeling, ETL development, and data warehousing Working knowledge of statistics and experimental design Proficiency in Named Entity Resolution Bachelor's degree in computer science or engineering; master's degree preferredPerks and Benefits Competitive health care plans (medical, dental and vision) Paid time off and paid holidays 401(k) retirement savings program Complimentary lunch, snacks and drinks Brand new MacBook Pro when you start Dynamic, stimulating and open environmentAbout Us Cyndx Networks enables financial transactions through software. We don't simply connect companies with capital, we foster relationships between businesses and investors based on data-driven metrics and algorithms that predict success. We are a low-maintenance, high-performance team. Independence and autonomy is the norm. Our headquarters is located in Santa Monica, CA, where our team of engineers, designers and product managers collaborate to build the future of fundraising. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status or disability status."}