{"jobID": "2796774891", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.nielsen.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NLSN) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Data Scientist - 11648 Data Science - USA Chicago, Illinois As the world’s largest research organization, Nielsen is powered by talented creative scientists. Our Data Scientists come from diverse disciplines such as statistics, research methodology, mathematics, psychology, business, engineering and demography. These professionals drive innovation, new product ideation, experimental design and testing, complex analysis and delivery of data insights.The Data Scientist is responsible for supporting all analytical needs for the Methods Center.Job Responsibilities:Use natural language processing and machine learning techniques to greatly speed up the coding of external product descriptions to Nielsen internal reference databasesParticipate in the complete overhaul and redesign of the Nielsen flagship e-commerce measurement serviceIdentify, coordinate and make use of widely disparate data sources to solve pressing research problems and enhance existing methodologiesDevelop dashboards, user interfaces and other tools that can be used to provide structure to otherwise unstructured dataApply sanity checks and help address major quality escapes in Nielsen measurement and reportingPresent findings and recommendations on methodology to a wide range of both technical and non-technical audiencesRole Requirements: E=essential, P=preferred.Advanced degree in mathematics, statistics, computer science, operations research, economics or fields that employ rigorous data analysis2-3 years’ experience preferred in at least one of the following fields: data science, software development, computer vision, data analysis, information systems, operations research or database management.E-Highly proficient in open-source statistical packages, especially Python and RE-Comfortable working in Linux environments and querying data using SQLE-Knowledge and experience with advanced machine learning concepts and packages including: Keras, TensorFlow and PytorchP-Familiarity with big data technologies like Spark, Hive and HadoopP-Experience with web scraping, web application development, and browser-based data visualization libraries like D3.js is a big plus!Disposition to simplify research, work processes, and complex statistical concepts to tell a coherent storyCreative thinking skills and the ability to improvise when confronted with technological challenges#Li-USAbout Nielsen: Nielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.  By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P; 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location: Chicago,Illinois Secondary Locations: NY - New York City, , , Travel: Yes, 10% of the Time"}