{"jobID": "2802103565", "jobLocation": "Chicago_IL", "jobTitle": "Senior Analytics Consultant -Predictive Modeling - Statistic", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Chicago Interviews but with Axiom Technology Group, Inc.  ChicagoInterviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Axiom is working with a direct client to fill a contract position in your area! Please see below for details and be sure to check out our website for more open roles.  Job Title: Senior Predictive Modeling Consultant - Analytics - Statistics  Work Location: Northbrook, Illinois  Contract duration: 6 months Contract/ Contract to hire  Target Start Date: 5/1/18 Job Details: As an analytic champion on the Analytic Development team, you will be responsible for designing, developing and delivering analytic solutions. The role requires mainly collaboration with our specialty product development partners but also with finance, and marketing for development and deployment of predictive modeling functionality. The goal is to improve efficiency the client's products and services, enable data-driven strategic decision-making, and identify opportunities for existing product improvement and new product development. Must have skills:SAS and SQLR and PythonPredictive ModelingProject ManagementTop 3 responsibilities:Constructing and Manipulating large datasetsPull-Run-Build-Present Managing complex projects financial, utilization and opsCompany DescriptionAxiom is a highly agile organization, facilitating requirements in both IT and Talent solutions. We have been providing solutions across many verticals since 1999. Axiom’s client’s come from multiple verticals which include: banking/financial services, healthcare, transportation, government and insurance. Named one of Inc. 500 Americas Fastest Growing Private Companies; Axiom’s latest expansions to the India and Singapore markets has helped us bolster our solutions services. This growth has allowed us to further our partnerships with some great companies like: SAP, Cisco, Genesys, Oracle and Pega to name a few. See all of our current opportunities at: http://axiomtechgroup.com/careers/#/jobs Apply"}