{"jobID": "2565495770", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Data Science", "companyRating": null, "companyInfo": {"Website": "www.twitch.tv", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "The Science team at Twitch is central to evidence-driven decision-making. We are researchers and leaders who advise product and business decisions, help build a culture of evidence-based decision-making, and identify ways to use data to develop new capabilities. The Director of DS leads a 20-person team of data scientists working on tough problems across the business, including real-time chat moderation, content recommendation, LTV models, content pricing, forecasting, purchase fraud, and more. You will be responsible for setting and executing a research agenda, using research results to shift strategies or create new capabilities. You will aim to solve problems durably through writing, tools, processes, and programs. You will have relentlessly high standards for research on your teams, and raise the bar for what rigorous, important, timely, and business-relevant research is at Twitch.Responsibilities Define the research vision for data science, and oversee planning, staffing, and prioritization to make sure the team is advancing that roadmap. deliver on concrete work that advances that roadmap.Invest in your team’s skills, tools, and processes to improve their velocity.Attract, retain, and developPartner with the executive team on how to apply your team’s research to our most challenging strategic questions.Manage our five embedded, product-focused data science teams and grow our new central research team, with a particular focus on keeping the team focused on the most important problems that data science could address.Work closely with your Science colleagues in engineering, user research, and analytics to deliver cross-functional research work and data systems.Requirements Professional experience as a data science leader, setting the vision for how to most effectively use data in your organization. This could be through technical leadership as an IC with ownership over a research agenda, or developing a team as a personnel manager in a new area at a larger company.Evidence you’ve successfully been able to scope, deliver and sell your own research.Excellent written and verbal communication skills on quantitative topics for a variety of audiences: product managers, designers, engineers, and business leaders.Fluent in data fundamentals: SQL, data manipulation using a procedural language, statistics, experimentation, and modelingBonus Points We encourage candidates to apply who have held the responsibilities above, regardless of years of experience or educational credentials. But we roughly expect competitive candidates to have: A PhD or MS in a quantitative field. 6+ years of experience working in data science in a consumer product company 3+ years of experience managing data scientists, including intermediate managers 3+ years of experience partnering with executive staff on data topicsPerks Full benefits, including medical, dental, vision and life401(k) savings plan with a company matchCatered daily lunch and dinners (and hearty breakfasts three times a week)Unlimited snacks and drinksMonthly in-office massagesCorporate gym membershipCommuter benefitsFlexible time off policyWeekly happy hoursTop of the line technology to help you build your own workspaceAbout TwitchTwitch is the world’s leading video platform and community for gamers, with more than 100 million visitors per month. We connect gamers from around the world by allowing them to broadcast, watch, and chat with each other. Twitch’s live and on-demand video platform forms the backbone of a distribution network for video game broadcasters including pro players, tournaments, leagues, developers and gaming media organizations. Twitch is leading a revolution in gaming culture, turning gameplay into an immersive video experience. Learn more at http://twitch.tv.We are an equal opportunity employer and value diversity at Twitch. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.#LI-MS1"}