{"jobID": "2834638967", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Sr. Program Support Specialist", "companyRating": "3.9", "companyInfo": {"Website": "www.bissell.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 1876", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " SHARK, TTI, Dyson"}, "estimatedSalary": "47000", "jobDescription": "Job Title: Sr. Program Support Specialist Job Number:1800124Job Description:The Sr. Program Support Specialist -- Consumer Care has the primary responsibility to elicit, analyze, validate, and specify designs for business solutions to improve the consumer support experience, business efficiency, and productivity. This position will develop data-driven insights to support initiatives domestically and globally for Consumer Care. This role will understand operational constraints, develop models, analyze work flows, discuss findings and design appropriate solutions including work automation, optimization, and incorporation of new technologies. The position is responsible for onboarding new programs ensuring all processes and procedures are delivered based on program goals initiated by the organization and supported by the Global Consumer Care team.Job Requirements:1. Lead efforts to discover new business requirements using interviews, existing documentation, workshops, site visits, business process descriptions, use cases, business analysis, task and workflow analysis Maintain Global Consumer Care project planServe as thought leader for business processes and technology solutions in Consumer Care and convert strategies to roadmaps and execution plans.Partner with other stakeholders across business units (e.g., Digital Marketing, Finance, Product Quality, external vendor partners) to develop requirements in a collaborative way.Evaluate information gathered to reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding of true needsEngage in multiple projects and prioritize initiatives to bring to completionPresent designs to management and internal customers and work closely with the business partners to implement the solutionRecommend appropriate program KPIs for consistent service deliveryAlign program launch timing and resources with Consumer Care stakeholders including the Quality and Training Manager, Operations Manager, and Systems AnalystDevelop reports, track performance, and report out new program performance to stakeholders  REQUIRED CORE COMPETENCIES for MANAGER JOB FAMILY:  Global strategic thinking and implementation Change leadership/management Ability to motivate external teams Oral and written communication with impact  Professional expertise Interpersonal/collaborative skills  Continuous improvement Manage/contribute to multiple dynamic priorities  REQUIRED EXPERIENCE/EDUCATION: (i.e. degree, years of experience, etc.)  * Degree minimum: Bachelor's Degree Specific concentration: Business, Contact Center OperationsExperience level: 3-5 years  PREFERRED EXPERIENCE/EDUCATION: (i.e. MBA, certifications, etc.)  SPECIALIZED TRAINING OR SKILLS REQUIRED:  Supervisory experience in a direct or indirect capacity Familiarity with basic project management principles"}