{"jobID": "2746763497", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist (Analytical Methodologist)", "companyRating": null, "companyInfo": {"Website": "www.plan-sys.com", "Headquarters": "Columbia, MD", "Size": "201 to 500 employees", "Founded": " 1988", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " ManTech, 7Delta, Leidos"}, "estimatedSalary": null, "jobDescription": "PSI Title: Data Scientist (Analytical Methodologist)Work Location: DC - Washington DescriptionThis position located at Bolling AFB supports the development and application of analytic methods within the process of intelligence analysis and collection. Analytic methodologists leverage substantive research methods and quantitative analysis to provide rigor and insight to the processes of intelligence production. As experts in research and means, methodologists are responsible for identifying and evaluating a wide range of existing –and emerging– methods, models, and algorithms to develop more accurate, complete, objective and anticipatory analysis to guide, assist and improve the skills of intelligence personnel according to their specific discipline or research specialty. Essential Functions and Job Responsibilities: Such a preferred person is heavily involved in selecting and resolving choosing which algorithms and models are used. Ideally, they've got deep skills AND they're already acclimated to IC domain contexts. This is in contrast to what to avoid, an analytical methodologist who is primarily more peripherally involved, who does training or workflow transition for analysts learning new methodologies. These two positions share the same titles within the community but differ greatly in their scope and responsibilities.  The candidate's core responsibilities will include, but not be limited to: Frequently works with ambiguous information, deconstructs key questions, suggests/applies methodologies, develops data schema to structured observations, and supports visualization of applicable data.Identifies and evaluates a wide range of existing methods, models, and algorithms to develop more accurate, complete, objective and anticipatory analysis for intelligence production.Teams with substantive experts and data scientists to develop and prototype new methodological processes and tools, applying innovative approaches to streamline research and gain new insights from diverse, large datasets.Categorizes, retrieves, manipulates, relates, and/or exploits structured data sets from all available sources.Employs the use of scripts, visual analytic modeling tools, and Standard Operating Procedures (SOPs) for repeatable, widely applicable procedures.Combines empirical or quantitative methods with data analysis for intelligence production of complex and data-driven assessments.Crafts written products, together with briefings and discussions, as directed on results of research, findings, evaluations, recommendations and processes in a concise and an easy-to-understand fashion.Collaborates with team members to ensure collective efforts are progressing according to the customer’s satisfaction.Minimum Requirements:B.S./M.S. degree relevant to one-or-more disciplines relevant to all-source intelligence analysis: statistics, mathematics, econometrics, GIS/remote sensing, operations research, behavioral and social sciences, computer or mathematical programming, demography, survey research, design, analysis, gaming and modeling etc.Experience with Bayesian modeling, Markov chain (MC) & Hidden Markov Model (HMM), predictive analytics, uncertainty models, decision risk, agent-based modeling, etc.)Demonstrated work, research or educational experience in a field relevant to intelligence analysis; for example, international affairs, economic analysis, military science and capabilities, human factors, industrial analysis, spatial analytics, big data analysis, operational planning, wargaming/exercise planning and facilitation, etc.Extensive and relevant experience with research methods and data analysis; including a demonstrated understanding of evidence-based behavioral/social science analytic methods, including the understanding of structured analytic techniques, probability theory, decision analysis, statistical and data analysis, signal detection theory, game theory, operations research, qualitative analysis, etc.Strong verbal presentation and writing skills, including the demonstrated ability to write clear and concise textual products.Ability to contribute as part of a team in a collaborative work environment.Must have TS clearance. Planned Systems International provides our customers with value-added management consulting and information technology services that consistently deliver success, and we are recognized as a world-class provider of innovative solutions that benefit mankind. From Systems Lifecycle Support and Healthcare IT Solutions to Network and Desktop Solutions and e-Business, PSI is focused on making our clients’ businesses run smoother and better. With a highly trained technical staff, we apply state-of-the-art information technologies, the industry's most advanced methodologies, and broad-based support services to clients in U.S. Government agencies and the commercial sector. PSI is an Equal Opportunity Employer.All qualified candidates are encouraged to apply, including:Minorities, Women, Individuals with Disabilities, and Protected Veterans.NOTE TO JOB SERVICE: VEVRAA Federal Contractor requesting priority referrals of Protected Veterans. Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here."}