{"jobID": "2800446043", "jobLocation": "Reston_VA", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "87000", "jobDescription": " Data Analyst will be responsible for using a variety of tools and methods to extract information of critical information to US policy makers. Data analysis blends the use of digital forensics, data science, and all-source analysis. This position requires knowledge of IC sponsor tools and data holdings. Work includes, but not limited to: Exploiting raw digital data from a variety of sources.Correlating data from multiple data sets.Applying sophisticated techniques to indentify data of interest.Creating and implementing new methodologies/algorithms for data analysis and correlation.Creating and preparing intelligence products that explain the meaning of findings in a way that reasonates with senior policy makers.Colloborating with IC partners. Minimum requirements include: Education Bachelors Degree in Computer Science or a related technical discipline, or the equivalent combination of education, professional training or work experience. Qualifications 5-8 years of related experience in data analysis and administration. Clearance Requirement: This position requires a Top Secret/SCI with POLY security clearance, based on current background investigation (SBI), as well as the favorable completion of polygraph. Clearance and polygraph processing will be completed by the U.S. Government.KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability. How to Apply? Please click apply on the right.  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.  KeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve. Clearance Requirement: This position requires a Top Secret/SCI security clearance, based on current background investigation (SBI), as well as the favorable completion of polygraph. Clearance and polygraph processing will be completed by the U.S. Government.KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability. How to Apply? Please click apply on the right.Apply!"}