{"jobID": "2829231119", "jobLocation": "N_o_n_e", "jobTitle": "Data Analyst Disaster Recovery Implementation", "companyRating": null, "companyInfo": {"Website": "www.icf.com", "Headquarters": "Fairfax, VA", "Size": "5001 to 10000 employees", "Founded": " 1999", "Type": " Company - Public (ICFI) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Booz Allen Hamilton, Abt Associates, Oliver Wyman"}, "estimatedSalary": null, "jobDescription": "Working at ICF Working at ICF means applying a passion for meaningful work with intellectual rigor to help solve the leading issues of our day. Smart, compassionate, innovative, committed, ICF employees tackle unprecedented challenges to benefit people, businesses, and governments around the globe. We believe in collaboration, mutual respect, open communication, and opportunity for growth. If you’re seeking to make a difference in the world, visit www.icf.com/careers to find your next career. ICF—together for tomorrow.  ICF is currently seeking staff to support state and local post-disaster recovery efforts implementing programs funded by federal disaster recovery programs. We seek a Data Analyst. These are full-time positions located in hurricane affected areas. This important work takes a special commitment and you’ll need to be able to commit to some long hours under challenging circumstances but we, like you, know why this matters. Our opportunities span a variety of levels and our team is excited to explore your career at ICF with you! As you learn more about ICF you’ll discover that longer-term opportunities abound that give you opportunities for a superb learning environment surrounded by smart and passionate leaders in their field! US Citizenship is a requirement and you may need to successfully complete a Public Trust Security Clearance. Key Responsibilities: - Collect data on Hurricane Harvey impacts on individuals, businesses, and communities - Conduct quantitative analysis of data and present data in formats to support executive decision-making - Writing background summaries for program management  Basic Qualifications: - Bachelor's degree - 5+ years of data analytics and data visualization experience - Expertise in Microsoft Excel and Microsoft Access. - Experience using GIS and other data sets to support understanding and identification of effected individuals in specific geographic spaces - Experience using analysis to reviewing and evaluate program performance measures in grant distribution and financial performance Preferred Skills/Experience: - Data retrieval from Data bases and Data warehouses - GIS plotting - Integrating data from external sources to FEMA disaster software programs - SharePoint development and expansion Professional Skills: - Excellent verbal, interpersonal and written communication skills - Self-starter/team player with the ability to work in a fast-paced environment with experience handling multiple priorities and ability to work extended hours. - Demonstrated level of professionalism in providing administrative support, including ability to exercise good judgment, discretion, tact, diplomacy and commitment. About ICFICF (NASDAQ:ICFI) is a global consulting and technology services provider with more than 5,000 professionals focused on making big things possible for our clients. We are business analysts, policy specialists, technologists, researchers, digital strategists, social scientists and creatives. Since 1969, government and commercial clients have worked with ICF to overcome their toughest challenges on issues that matter profoundly to their success. Come engage with us at icf.com. ICF offers an excellent benefits package, an award winning talent development program, and fosters a highly skilled, energized and empowered workforce. ICF is an equal opportunity employer that values diversity at all levels. (EOE – Minorities/Females/Protected Veterans Status/Disability Status/Sexual Orientation/Gender Identity) Pay Transparency Statement: For more information, please click here: https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf  Texas Remote Office (TX99)"}