{"jobID": "2789272581", "jobLocation": "San_Francisco_CA", "jobTitle": "People Scientist", "companyRating": null, "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Role Uber is continuously growing and evolving as a business and as a company. We're constantly looking at our organization and our culture and thinking about opportunities to change for the future. But change isn't always easy or predictable - and we could use help thinking very scientifically about our processes.  We're looking for an Industrial Organizational Psychologist to help us assess and validate processes related to hiring, testing, compensation and other related processes. What You’ll DoDesign hiring and promotion assessments, tools and processes for technical and non-technical jobs to drive selection of exceptional candidatesDesign and conduct job analyses and validation studies; write technical validation reports and client presentationsProvide consulting support to business units on issues related to competency modeling, performance appraisal, survey design, and change managementCollaborate with and manage external vendors to solve business challengesWhat You’ll NeedMaster’s degree in Industrial/Organizational Psychology or a closely related field required, Ph.D. preferredAt least three years of experience in conducting job analyses and validation of hiring and promotion practices consistent with the Uniform Guidelines on Employee Selection Procedures, with some experience preferably in the technology sectorExperience in employee selection, employee assessment, job analysis techniques, competency modeling, change management, performance appraisal, and survey designWorking knowledge of employment law relevant to job analysis, employee selection, and performance evaluationExpertise in statistics and data analysisExcellent interpersonal, consulting, and project management skillsAbility to persuade and influence without authorityOutstanding critical thinking and writing skillsDemonstrated ability to successfully manage complex projectsHighly skilled with statistical software, preferably SPSSAbout the Team Our People Strategy & Planning team defines and drives the most critical initiatives on the People agenda. We work cross functionally and collaboratively with many different teams at Uber, while also serving as internal consultants to various stakeholders and leaders.  We are nimble and flexible - individuals that can wear many different hats. We don’t mind working through ambiguity and love adding organization to chaos. We are strategy driven, with an execution mindset. Success is not defined by any one individual, but rather by the collective work of the entire team."}