{"jobID": "2706100812", "jobLocation": "Long_Beach_CA", "jobTitle": "Billing Clerk", "companyRating": null, "companyInfo": {"Website": "www.patriotenvironmental.com", "Headquarters": "Wilmington, CA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Clean Harbors, American Integrated Services, Veolia"}, "estimatedSalary": null, "jobDescription": "Basic Functions:Patriot Environmental Services needs to immediately fill the position of Billing Clerk / Senior Billing Clerk for our Wilmington, CA office. This position will in our account receivable department and support operation in the Los Angeles and Long Beach area. You will be responsible for invoicing, collecting and communicating with customers on all billings related needs. You must also communicate with our operation managers and maintain proper support and records. If you discover inaccurate billing information, it is important to correct as quickly as possible on your own or by communicating the issue with your supervisor.The position is located in Wilmington, CA and requires no traveling.Responsibilities:Issue invoices daily to customersIssue monthly customer statementsUpdate customer files with issued invoicesUpdate customer master file with contact informationUpdate customer master file with billing proceduresEnter invoices into customer invoicing website (Portals)Email or mail invoices to customersAnswer customer questions about invoicesFollow up with operation manager on missing supportSetup new customer specific billing templatesFollow up with the customer on timely payment and send subsequent invoices when initial attempt to collect was unsuccessfulAssist accounting in month end revenue accrualsRequired Qualifications:High school Diploma / GED3+ years billing industry experience (emergency response, environmental cleanup)Knowledgeable and experienced in time and material billings as well as retainer billingsBasic proficiency in MS Excel (copy, paste, SUM, etc.)Intermediate proficiency in Outlook (use the search function)Comfortable using electronic records (search folders)Comfortable to contact operation manager by email or phone on a daily basisAttention to detail and organizedAbility to work in a changing environmentAbility to meet strict and short deadlinesAbility to work in a team environmentExcellent customer service skills, in person, on the phone, and via emailPreferred:Associate DegreeIntermediate proficiency in Excel (key keyboard shortcuts)Experience in collectionExperience in AcumaticaExperience in AvidXchange"}