{"jobID": "2827557595", "jobLocation": "Thousand_Oaks_CA", "jobTitle": "Senior Data Scientist - Development Supply Chain", "companyRating": "3.6", "companyInfo": {"Website": "www.amgen.com", "Headquarters": "Thousand Oaks, CA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (AMGN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Genentech, AbbVie, Janssen Biotech"}, "estimatedSalary": "123000", "jobDescription": " Development Supply Chain (DSC) is responsible for Amgens complex and dynamic clinical trial supply globally. The scope of the organization includes demand and supply planning, sourcing, manufacturing and distribution logistics to ensure efficient supply of clinical product to patients around the world. The Senior Data Scientist will drive systematic utilization of data, analytics, artificial intelligence, and automation across all aspects of the business to reduce costs and increase revenue, speed and efficiency. As part of the Development Supply Chain Business Team, the Senior Data Scientist will interface across Amgens value chain in advancing projects and strategic deliverables for Development Supply Chain and Operations  Responsibilities: Strategic planning and development of data science, machine learning, and artificial intelligence capabilities across Development Supply ChainLead cross functional teams on projects and/or programs with aims to systematically integrate data, derive insights, and automate processesExecute projects allowing for demonstrated technical feasibility for advanced informatic capabilities, as well as ultimately derive substantial business value for Development Supply Chain.Technical and people leadership with both internal and external stakeholdersBasic Qualifications: Doctorate degree and 2 years of information systems and/or functional leadership experienceORMasters degree and 6 years of information systems and/or functional leadership experienceORBachelors degree and 8 years of information systems and/or functional leadership experienceORAssociates degree and 10 years of information systems and/or functional leadership experienceORHigh school diploma / GED and 12 years of information systems and/or functional leadership experiencePreferred Qualifications: Experience with variety of data analysis and modeling methods particularly in their application to biological systems (i.e. Unsupervised (PCA, K-Means), Supervised (Linear/Logistic Regression including PLS, Deep Learning approaches), Bayesian, Fourier/Laplace)Proficient in Spotfire/Tableau, SQL, Python, R and familiar with HDFSFamiliarity and background with biotechnology processes and regulatory requirementsBiological domain understandingMasters or PhD in a biologically relevant field (i.e. biological engineering, biomedical engineering, chemical engineering, bioinformatics)Strong statistics and programming background with proven experience delivering on data science and machine learning projects (experience with Bayesian and deep learning approaches are a big plus)Familiarity with DevOps and good software practices (i.e. version control, continuous integration, test driven development)Strong communication skills and experience with client engagement Amgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.  Amgen focuses on areas of high unmet medical need and leverages its expertise to strive for solutions that improve health outcomes and dramatically improve peoples lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the worlds leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.Amgen is an Equal Opportunity employer and will consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, or disability status."}