{"jobID": "2835007298", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Analyst, Digital Marketing", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "107000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. Title: Data Analyst, Digital Marketing Description Whether you are working on innovative new hardware like PlayStation VR, AAA software like God of War, or disruptive network service products like PlayStation Vue, you will take part in the complete marketing experience, as you are involved in every facet of ideating, executing, analyzing, and optimizing our digital campaigns. From determining target audiences, designing test strategies, and communicating with internal or external partners, you will help shape the way that we communicate with gamers to grow our loyal PlayStation customer base.  Be part of building the Paid Media and CRM Analytics team at Sony Interactive Entertainment (SIE) - a new team built behind dedicated leadership and deep investment in people and technologies. This role sits within the Marketing organization that oversees marketing for SIEs entire portfolio of products and services.  You will be generating actionable insights from complex customer data to drive growth in product engagement and customer lifetime value across all stages of the customer lifecycle. You will lead the way in helping the team develop a deep understanding of its current and potential customers. Your primary goal will be to ensure that we design and execute data-driven lifecycle marketing strategies that drive measurable growth in usage, cross-sell and customer retention/loyalty for all target segments. To achieve this goal, you will be responsible for identifying and communicating key customer insights and trends across multiple products within our portfolio.  You will be making an impact on marketing decision-making but also shape the customer experience. You will be a key stakeholder providing strategic guidance to the management and maintenance of our marketing tech stack, and bring data-driven thought leadership to our marketing efforts by conducting analysis and developing testing strategies that provide insight into the key drivers of digital marketing performance.  Marketing at SIE starts and ends with the gamer. Our job is to demonstrate how PlayStation truly is the Best Place to Play. ResponsibilitiesDefine and implement customer segmentation and profiling strategiesTranslate business challenges into testable hypotheses, own/manage execution, tracking and results in ways that change the way we do businessManage, mine and analyze a broad array of quantitative and qualitative data assetsLead the application of insights to influence marketing strategies that drive measurable growth in customer acquisition and ongoing retention/satisfaction.Compile analyses for reports and conduct presentations to a broad audience, including marketing leadership, to shape strategic and operational decisionsEnsure the enforcement of legal and privacy standards for managing dataWork across numerous internal and external marketing automation platforms (Sales Force Marketing Cloud, DMPs, Publisher and Social Partners, etc)Minimum Qualifications: SQL programming experienceExperience with web analytics tools such as Google Analytics or Adobe AnalyticsExperience with data visualization software such as TableauMinimum 3-5 years experience working with relational databasesMinimum 5-7 years marketing analytics experienceWell versed in spreadsheet modeling and presentation-making skills that effectively present data in a compelling way, both verbal and written, to influence marketing decisionsA passion for and the belief in the power of making data-driven decisionsA demonstrated interest in digital entertainment and gamingBA/BS degreePreferred Qualifications: Experience in the video game industryProfessional experience working at, or with, a media or digital agencyExperience using algorithmic attribution models for media optimizationAdvanced degree in a related field (MBA, Statistics, Economics, etc)"}