{"jobID": "2827924181", "jobLocation": "Raritan_NJ", "jobTitle": "Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.rangam.com", "Headquarters": "Somerset, NJ", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Insight Global, Collabera, Artech Information Systems"}, "estimatedSalary": "67000", "jobDescription": " Email  LinkedIn  Twitter  Facebook  Google+Job DescriptionThe successful candidate will perform basic research to discover and characterize bacterial antigens with the goal of advancing novel vaccines to prevent bacterial infections.  The primary responsibilities include the expression and purification of proteins, and the characterization of these proteins through biochemical and immunological techniques.  These responsibilities require  (1) basic skills in molecular biology, including PCR, DNA purification and cloning  (2) experience with protein purification and characterization, including affinity chromatography, assessing protein solubility, binding affinities, and protein-protein / protein-substrate interactions, and  (3) immunological techniques such as Western blots, ELISAs, and bead-based immunological assays.  The candidate will be responsible for data analysis and interpretation using various computer applications, such as Excel, GraphPad and statistical programs. Maintaining a clear written record of experimental design and results is a requisite, as is the ability to participate in writing reports, protocols and manuscripts. The candidate will also be responsible for maintaining laboratory equipment and supplies, as well as ensuring a safe laboratory environment.  The candidate must demonstrate good oral and written skills, strong organizational skills, and the ability to work in a team environment. QualificationsBS, BA or MS in biochemistry, microbiology, immunology or related discipline required• Experience in basic biochemistry and molecular biology is requiredExperience in basic immunology is a plusExperience with vaccine development, including immunological assays, preferred but not essentialExcellent verbal and written communication skillsWorks well in a team environment Protein expression and purification, affinity chromatography, ELISA, DNA cloning"}