{"jobID": "2834728966", "jobLocation": "Washington_DC", "jobTitle": "Senior Data Management Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.grantthornton.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1924", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Deloitte, KPMG"}, "estimatedSalary": "70000", "jobDescription": " Grant Thornton is seeking a Manager to join its Technology Strategy & Management service line and take an active role in engagement execution, project management and key business development activities.  Grant Thornton Public Sector helps executives and managers at all levels of government maximize their performance and efficiency in the face of ever tightening budgets and increased demand for services. We give clients creative, cost-effective solutions that enhance their acquisition, financial, human capital, information technology, data analytics, and performance management. For more information, visit grantthornton.com/publicsector.  At Grant Thornton, our professional staff applies traditional, cutting-edge approaches and methods to a variety of analyses. As part of our team, the Manager will utilize various methodologies and models to execute client projects. ESSENTIAL DUTIES:Synthesize Stakeholder Input to Inform the Federal Data Strategy.Provide Research Support for Pilot on Integrated Data Quality Reporting.Manage Data Use Case Collection, Analysis, and Curation.Provide Support for “Federal Data Incubator”.Perform engagement management responsibilities, including performance reviews, task delegation, project scheduling, project financials, quality review and client management.Meet or exceed sales targets for new and follow-on work.Manage business development activities, such as proposals, capture, account teams, whitepapers, conferences, and/or other thought leadership materials.Meet or exceed targeted billing hours (utilization).Act as performance manager (coach) for up to four coachees outside of engagement responsibilities.Interview campus and/or experienced candidates.Understanding and application of data management principles.Master level oral and written communication skills.Requirements development and management experience.Workshop facilitation and interviewing experience.As-is, to-be visioning.Bachelor’s Degree required from an accredited college or university in a related field.Ability to obtain and maintain certain job-related certifications if no job-related advanced degrees.U.S. citizenship may be required. Ability to work in the United States indefinitely required.Travel may be required.Coach and mentor junior staff members.Ability to work overtime required on occasion.Ability to sit in an office environment for long periods of time.Ability to obtain and maintain a security clearance.Ability to communicate clearly in writing and verbally.Ability to obtain and maintain firm independence and abide by firm ethics requirements.Meet or exceed continuing professional education (CPE) requirements. Grant Thornton LLP is the U.S. member firm of Grant Thornton International, one of the six global accounting, tax and business advisory organizations. Grant Thornton’s Public Sector, based in Alexandria, VA, is a global management consulting business with the mission of providing responsive and innovative financial, performance management and systems solutions to governments and international organizations. Visit Grant Thornton’s Public Sector at www.grantthornton.com/publicsector.  It is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law. "}