{"jobID": "2823052571", "jobLocation": "San_Jose_CA", "jobTitle": "Staff Data Miner / Global Sales", "companyRating": null, "companyInfo": {"Website": "www.cypress.com", "Headquarters": "San Jose, CA", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Company - Public (CY) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Renesas Electronics America, Texas Instruments, Qualcomm"}, "estimatedSalary": null, "jobDescription": " Job ID  Requisition Id:- 11781 Job DescriptionPosition Summary The Staff Data Scientist will be critical in our efforts to become a truly data-driven business. The ideal candidate will have experience in both the technical, day-to-day management of data and the ability to derive insights from it. This is a highly visible, roll-up-your-sleeves role that will require considerable interaction with leaders in multiple functional areas across the company. Responsibilities Work closely with functional area leads (Finance, Marketing, Sales, Operations, Manufacturing) to define data and information needs  Manage data synchronization and transfer between disparate sources such as Eloqua, Salesforce, Jive and internal databases  Implement data collection, cleansing, combination, migration, synchronization and storage mechanisms  Ensure data integrity for reporting and analytics  Automate and improve existing company processes and workflows related to data  Lead analytical efforts to identify opportunities for operational improvement  Build reporting tools and dashboards to provide efficient visibility on key performance indicators  Drive self-serve analytics across the company with high-quality data models, reports, reliable QA procedures and user guides  Work with the data architect to build a business intelligence platform that scales across the company  Be one of the experts on all things data at Cypress Skills 2 to 5 years of relevant work experience, in sales/marketing operations, finance, operations, quantitative analysis, predictive analytics or business intelligence  Demonstrated ability to manage large amounts of data from disparate sources: collecting, consolidating, analyzing, and synthesizing  Experience with a self-serve BI tool (OBIEE, Tableau, Micro Strategy, QlikSense) would be a plus  Experience in SQL, R, Python, Hadoop or related tools  Strong analytical and problem-solving skills, ability to quickly grasp and implement analytical and creative problem-solving techniques  Advanced proficiency with Excel, including importing data from multiple sources, organizing data using pivot tables, utilizing macros and advanced functions, and creating charts to visually display data  Ability to interpret information and communicate effectively at multiple levels of the organization  Self-motivated, proactive, get-things-done team member who lives to improve data and drive results  BS/BA degree in information technology, business, or equivalent  Note  Cypress is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, physical or mental disability, or status as a Protected Veteran. TO ALL RECRUITMENT AGENCIES: Cypress Semiconductor does not accept unsolicited agency resumes. Please do not forward resumes to our jobs alias, Cypress Semiconductors employees or any other company location. Cypress Semiconductor is not responsible for any fees related to unsolicited resumes.  Nearest Major Market: San Jose  Nearest Secondary Market: Palo Alto  Job Segment: Database, Data Mining, SQL, Sales Operations, Technology, Sales"}