{"jobID": "2832129447", "jobLocation": "San_Pablo_CA", "jobTitle": "Assistant Community Manager", "companyRating": "4.1", "companyInfo": {"Website": "www.goldrichkest.com", "Headquarters": "Culver City, CA", "Size": "501 to 1000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Goldrich Kest has an immediate need for an Assistant Community Manager for our apartment community. The Assistant Community Manager is responsible for assisting with daily operations. Maintain high occupancy levels by helping the Community Manager maintain a viable waiting list and preparing lease files for move-in, in compliance with all applicable regulations.Ensure compliance with all applicable federal and state agency requirements including, but not limited to HUD Multifamily programs, HOME, Bond, Tenant Selection Plan requirements (i.e. Fair Housing and Occupancy compliance).Respond to resident inquiries and work with Community Manager to provide resolutions.Assist with preparing lease documents. Verify compliance with lease files, accurate completion of applications, income verifications, asset verifications, and other related paperwork.Monitor community compliance with all Fair Housing regulations and with local ordinance and laws related to company or community specific guidelines in occupancy standards, demonstrating at all times firm, fair, and consistent administration of all legal and company policies and practices.Requirements:Ability to apply policies and procedures to solve everyday issues.Knowledge of Fair Housing and Tenant Landlord laws, and HUD policies.Proven professional verbal and written communication skills in exchanging information with residents, corporate, and site team members.Demonstrate knowledge of demographic surrounding communities.Possess professional, friendly telephone and greeting skills. Must be self-motivated and a positive team member with effective communication and customer relation skills, internal and external.Knowledge of basic office practices and procedures. Ability to establish priorities and coordinate work activities. Ability to exercise initiative and problem solving skills.Knowledge of computer systems and applications. Demonstrate high-level proficiency in the use of Microsoft Office Programs, Internet and e-mail. Must have prior property management software knowledge. Goldrich Kest provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, marital status, veteran status, or any other consideration made unlawful by federal, state, or local laws. Goldrich Kest is committed to providing reasonable accommodation for qualified applicants, and employees with disabilities to ensure they enjoy equal access to all employment opportunities and benefits of employment as required by the Americans with Disabilities Act."}