{"jobID": "2837663705", "jobLocation": "Burbank_CA", "jobTitle": "Salesforce Administrator and Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.akraya.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Palo Alto Staffing, Artech Information Systems, TEKsystems"}, "estimatedSalary": null, "jobDescription": " Salesforce Administrator and Data Analyst - 18-02112  Ref No.: 18-02112  Location: Burbank, California  Akraya is looking for a  Salesforce Administrator and Data Analyst for one of our clients. If the job description below is a fit, please apply directly or call  Ajay Gurav @ ************, If this position is not quite what you're looking for, visit ********** and submit a copy of your resume. Our recruiters will get to work finding you a job that is a better match at one of our many clients.  Primary Skills: Salesforce administration, Agile, Scrum, Data Analysis, Business Administration,SQL  Job Title : Salesforce Administrator and Data Analyst - CRM Systems  Duration: 6 Months  Contract Type: W2 Only Job Description/Responsibilities: : The Salesforce Administrator and Data Analyst - CRM Systems will work closely with SalesConnect program staff, technical team members, project managers, business users, and KPIT staff to deliver customer management projects ranging in size from minor enhancements to major multi-year initiatives. The analyst will play a key role in supporting and administering SalesConnect, and assist in data loading, cleansing and transformation requests. Duties/Typical Activities : The Salesforce Administrator and Data Analyst - CRM Systems will perform a variety of project-related activities, including: Serving as a knowledge resource for Salesforce administration, reports, dashboards and data import/export tools.Support ad hoc requests from reports, dashboards, data load, data migration, data cleansing and data transformationConfiguring working prototypes and performing business process reviews to validate and refine prototypes.Defining the ************** configuration required to support functional and non-functional requirements and business processes.Required Experience and Qualifications :Degree in Computer Science, Software Engineering, Business Administration or related field.3 or more years of progressive experience as a Salesforce administrator with strong knowledge of ************** reports and dashboard.Experience using data import/export tools such data loader or workbench.Certification as ************** Administrator or equivalent experience.Experience working with ************** in a large organization.Experience using MS-Excel, MS-AccessExperience with query languages such as SQL or T-SQLEffective personal communication and client-facing skills with technical and management staff.Familiarity with Scrum framework artifacts and ceremoniesExperience in summarizing and presenting complex topics to non-technical audiences. Please apply directly with your updated resume or call Ajay Gurav at ************  About Akraya  Akraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the Best Staffing Firms to Temp for by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit ********** to search through all of our current openings or to submit your resume to our recruiting team."}