{"jobID": "2815550623", "jobLocation": "Austin_TX", "jobTitle": "Data Insights Analyst", "companyRating": null, "companyInfo": {"Website": "www.homeaway.com", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Airbnb, TripAdvisor, 9flats.com"}, "estimatedSalary": null, "jobDescription": "HomeAway, a world leader in the vacation rental industry, is the place to book beach houses, cabins, and condos with more than two million places to stay in 190 countries. The site makes it easy to find and book the perfect vacation rental for any getaway, often for less than the cost of traditional hotel accommodations. HomeAway is part of the Expedia Group family of brands. The Opportunity: You have the opportunity to join HomeAways global Analytics & Data Insights team in Austin, TX The mission of the team is to enable stakeholders with strategic and operational insights that allow them to make better decisions. Our culture is one that strives to solve difficult problems through rigorous hypothesis-based testing, empowering people to come up with ideas and data-driven solutions quickly. Our analysts are passionate about learning the drivers of the business and leveraging data, technology and analytics to provide valuable data insights to drive companys critical business decisions.  This particular role will be responsible for supporting our Global Advertising team. The Advertising team aims to deliver a personalized ad experience to our travelers in the right format and at the right time in the conversion funnel to maximize conversions/bookings and ad monetization. They will do that by: Building out ML-based targeting models using on-site and off-site signalsDiversifying our ad product portfolio based on conversion funnel use casesUnderstanding the full impact of advertising on our travelers and conversion / booking metrics (this includes impact from our ad tech stack)Understanding the performance of our ad products(CTR, CPM, Viewability) and brand awareness campaignsThe Ads data insights analyst will partner with them to achieve those goals by providing a broad spectrum of support including advice for and results from A/B tests, working with developers and data engineers to set up data pipelines and tracking, deep-dive investigative analyses, business modeling, and strategic analysis.Key Responsibilities:Partner with internal stakeholders both technical and non-technical to answer complex business questionsThrough data mining and analysis, apply and implement hypotheses and recommendations of things we should change, leading to experiments that will confirm or deny those hypotheses and ultimately improve operationsBe a HomeAway data guru - be the point of contact for all data questions and insights in your respective areaPartner with key stakeholders to prioritize asks based on highest potential value added, and proactively drive initiatives from there.Work with the broader Analytics Platform team in an Agile model to implement self-service data products that will allow the Ads teams to access accurate information directly and easily.Monitor key corporate and Advertising-specific metrics daily, quickly identifying areas of concern and proposing analyses and/or corrective actionsParticipate in weekly Advertising team meetings to ensure insight-based decision makingGeneral Skills:Passion for number crunching, logical problem solving and intellectual challengesAbility to structure / work on data exploration problems, with innovative approaches and creative solutions, leveraging strong reporting and data visualization skillsMust be comfortable with uncertainty by prioritizing effectively and flexibly handling changesAble to work across different business units/countries to communicate findings company-wideStrong organization skills, and some ability to manage multiple projects concurrentlyTechnical Skills:Expert-level SQL knowledgeIntermediate level Tableau knowledgeIntermediate A/B testing knowledgeIntermediate-level knowledge of big data tools / languages (Hadoop, Hive, Spark)Beginner level R, Python or other coding languageClickstream data exposure: 1-2 years of experience (preferably running A/B tests and extracting data from BigQuery)Experience/Education:Bachelor's in an analytical field (e.g., Marketing Science, Computer Science, Mathematics, Statistics) and 4+ years of experience in data analytics OR Master of Science in an analytical field (e.g. Marketing Science, Computer Science, Mathematics, Statistics) and 2+ years of experience1+ years experience in either web/ travel industry or data consulting is preferredBackground in relevant area advertising is a strong plusBenefits & Perks:Competitive health and insurance benefitsCompetitive salaryAnnual target bonus or commissionPaid vacation and sick timeVacation rental on a yearly basis (taxable benefit)Employee Stock Purchase ProgramFree snacks and beveragesFrequent company update talks with our leadership teamFree listing on HomeAway.comElectronic, adjustable stand-up deskDiscounted Metro & Rail passCasual dress We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}