{"jobID": "2802501016", "jobLocation": "Battle_Creek_MI", "jobTitle": "Slot Technician - 2nd Shift", "companyRating": null, "companyInfo": {"Website": "www.firekeeperscasino.com", "Headquarters": "Battle Creek, MI", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Other Organization", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employment Status:Full-timeDate Posted:6/4/2018Job Code:SlotTechLocation:FireKeepers Casino HotelAddress:11177 Michigan AveCity:Battle CreekState:MICountry:United States of AmericaDescriptionSCOPE OF POSITION: Responsible for the repair, preventative and routine maintenance of all Slot Department equipment and machines under the direction of the Slot Performance Manager and Supervisor. ESSENTIAL DUTIES AND RESPONSIBILITIES: The following is a list of the main duties and responsibilities. However, other duties may be assigned as deemed necessary by management. All duties must be performed in accordance with Tribal, Federal, and other applicable requirements, organizational specific policies, procedures and practices. Performs moves, installs, overhauls and configures slot machines as directed by management.Participates in Slot Department special projects in a team environment by interpreting gaming documents, gathering materials necessary to complete the project, including RAM clears, key chipping, machine moves, conversions, and upgrades.Verifies that all slot games communicate accurately with internal systems for accounting purposes; researches and resolves issues that arise with same.Expected to demonstrate proficiency in the use of all slot testing equipment provided by the department.Maintains knowledge of local jurisdiction gaming laws (federal, Tribal, state, etc.) and associated regulations as well as the company’s internal controls, policies and procedures.Brings disputes and unusual guest activities and/or behavior to the attention of management.Assists in ensuring gaming machine integrity when jackpots occur and at other times as requested.Assists Slot Attendants in verifying jackpots as needed.Encourages mutual respect, dignity and integrity with all employees and guests, promotes positive guest service by use of the FireKeepers Guest Service Culture; WEEA (Welcoming, Engaging, Enthusiastic and Appreciative).Maintains knowledge of all current property promotions.Maintains the highest level of confidentiality.Responsible for maintaining a consistent, regular attendance record as outlined in the FireKeepers Casino Hotel Attendance Policy.Outstanding example of and a credit to FireKeepers Casino Hotel.Minimum RequirementsMINIMUM REQUIRED QUALIFICATIONS An applicant’s education, training and experience must be sufficient to demonstrate that the applicant possesses the ability to successfully perform each of the essential duties and responsibilities satisfactorily. FireKeepers reserves the right to verify the sufficiency of a candidate’s education, training and competencies through the interview process, testing and methods.  The requirements listed below are generally representative of the education, experience, and skills and/or abilities required to enable one to successfully perform the essential duties and responsibilities:  High School diploma or GED. Three years’ experience in electronics repair or two year’s proven progressive experience in full-scale slot operation with slot machine experience. Strong organizational and interpersonal skills. Must be at least 21 years of age. GENERAL OR PREFERRED QUALIFICATIONS No general or preferred qualifications. LANGUAGE SKILLS Ability to read and interpret documents such as safety rules, operating and maintenance instruction, and procedure manuals. Ability to write routine reports and correspondence. Ability to speak effectively before groups of customers or employees of organization. MATHEMATICAL SKILLS Ability to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimal, and work with mathematical such as probability and statistical inference. REASONING ABILITY Ability to define problems, collect data, establish facts, and draw conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. PHYSICAL & ENVIRONMENTAL DEMANDS: The physical demands described here are representative of those that must be met by a Team Member to successfully perform the essential functions of this job.  Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this position, a Team Member is regularly required to talk or to hear. The Team Member is also regularly required to stand, walk, sit, and use hands to handle or feel objects, tools or controls. A Team Member is occasionally required to reach with hands and arms, and to sit; climb or balance; and stoop, kneel, crouch or crawl. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus. The ability to push, pull and maneuver up to 200 pounds, for the purpose of installation, repair or maintenance.  Work is performed throughout all areas of the facility where the noise level varies from quiet to loud depending upon business. Must be able to work in a smoke filled environment. INDIAN PREFERENCEIndian preference will be applied in the selection of qualified applicants in accordance with the NHBP Indian Preference in Employment Code, which affords employment preferences to NHBP Tribal citizens, parents or spouses of NHBP citizens and other Native Americans. For purposes of this preference, NHBP law defines \"Native American\" as: (a) an enrolled member of any other federally-recognized Indian tribes; (b) an enrolled member of a Canadian Indian tribe or First Nation; or (c) an enrolled member of the Grand River Band of Ottawa Indians or the Burt Lake Band of Ottawa/Chippewa Indians. FireKeepers Casino Hotel reserves the right to make changes to the above job description as necessary. Apply Now Back to ResultsSave this JobRefer this Job Apply Now"}