{"jobID": "2825079051", "jobLocation": "Southfield_MI", "jobTitle": "Executive Assistant to CFO (Regular-Full Time)", "companyRating": "4.0", "companyInfo": {"Website": "www.suncommunities.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1975", "Type": " Company - Public (SUI) ", "Industry": " Real Estate", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Equity LifeStyle Properties, RHP Properties , UMH Properties"}, "estimatedSalary": "47000", "jobDescription": " Are you an administrative professional looking for a dynamic and growing organization that will both challenge and reward you? Join our team at Sun Communities and embark on an exciting new opportunity! We are looking for an Executive Assistant to provide administrative support to the Chief Financial Officer. If you're creative and enjoy working in a cross-functional environment that is results-driven and customer-service oriented, keep reading! OVERVIEW As an Executive Assistant you'll provide support to the CFO, SVP of Finance and SVP, Corporate Controller in a one-on-one working relationship by performing advanced, diversified and confidential administrative duties, both of a personal and business nature. You'll serve as the primary point of contact for internal and external constituencies on all matters pertaining to the CFO and SVP's, act as a liaison to the Board of Directors and senior management teams, and oversee special projects. JOB DUTIESManage CFO and SVP's calendars and schedule appointments, meetings, and conference calls with both internal and external parties as directed or independently; prepare meeting agendas, notices, minutes and reports as needed.Arrange complex and detailed travel plans and itineraries and compile documents for travel-related meetings with minimal direction; compile expense reports for approval.Screen incoming calls and correspondence; research, resolve and follow-up on issues and concerns in an appropriate and confidential manner.Perform general administrative functions such as scheduling meetings and calls, monitoring email, event planning, typing, copying/scanning, filing, and other duties as assigned.Compose and prepare a wide range of general, confidential and complex correspondence; ensure proper sentence structure and grammar.Communicate directly and on behalf of the CFO with board members, investors, analysts, bankers, auditors, and others on matters related to the CFO.Serve as an administrative liaison to the Audit Committee, as well as members of the Board of Directors and other committees. Assist board members with travel arrangements and meal planning as needed.Administer and maintain Iron Mountain off-site storage contract including coordinating deliveries, preparing inventory lists, scheduling pick-ups, and preparing labels.Review, code, and submit invoices for approval and payment.Maintain petty cash fund for Main Office, recording expenditures in proper accounts.Ensure office equipment is in operating condition and adequate levels of office supplies for the department.Coordinate logistics for onboarding of new hires within the Accounting department as needed (i.e. office/workspace locations, technology needed, etc.).Other duties and special projects as assigned.REQUIREMENTSHigh School Diploma or GED; Bachelor's degree in Business or related field, preferredMinimum of 10 years administrative experienceMinimum of 5 years direct executive administrative experienceStrong attention to detail, organizational and multitasking skillsExcellent communication and interpersonal skillsAbility to independently as well as a team in a fast-paced, multi-tasked environmentAbility to maintain confidentialityAdvanced computer proficiency with the Microsoft Office Suite, Adobe Acrobat, email, internet, and the ability to provide data entry in a timely and efficient manner Apply"}