{"jobID": "2820897800", "jobLocation": "Washington_DC", "jobTitle": "Mechanical Service Technician", "companyRating": "3.5", "companyInfo": {"Website": "www.intralox.com", "Headquarters": "Harahan, LA", "Size": "1001 to 5000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Habasit America, Rexnord"}, "estimatedSalary": "24", "jobDescription": "Location:Baltimore/Washington D.C.CategoryCustomer Service & Technical Support, Engineering, Manufacturing & ProductionDivisionIntraloxHoursDaysApply nowIntralox, L.L.C., a division of Laitram, LLC, the world leader in conveyor equipment solutions utilizing modular plastic conveyor belts, has a position available for a Mechanical/ Electrical Field Service Technician. This individual will work with our field installation teams to assist with the installation and commissioning of our products at customer locations throughout the United States. The individual will have strong mechanical aptitude with industrial electrical controls experience, including knowledge of control panels and control panel/ field components. This individual will also provide design and assembly support for industrial conveyor equipment, as available. This position is located in Savage, Maryland. Responsibilities:Mechanical installation and customer site support while assisting in other mechanical work.Lead field mechanical assembly, installation, and commissioning of equipment.Collaborate with mechanical and electrical subcontractors engaged by Intralox for installation of equipment at customer facilities.Lead training, troubleshooting, and repair/ adjustment of mechanical and electrical control systems.Work with Test Engineering Group and perform factory acceptance tests of finished equipment.Assemble discrete pieces of equipment that incorporate Intralox belting in the Savage location.Requirements:High school diploma or equivalentMinimum 5 years experience as a Mechanical or Electrical Technician in an industrial environment with automated production equipment.Ability to understand and work from mechanical drawings. Electrical drawing schematic reading is a plus.Ability to independently install, troubleshoot, and repair mechanical/ electrical control systems.Ability to read and understand manufacturer’s manuals to “self-teach” new technology.Basic mechanical expertise, advanced skills desired.Computer proficiency in Microsoft OfficeEffective communication (verbal and written) and relationship skills with engineering groups, customers, suppliers and subcontractors.Knowledge of electrical panels, motors, drives, networks, and PLCs.Methodical approach to troubleshooting and good analytical skills.Ability to travel up to 60%, work weekends, holidays and overtime when required, some trips are up to 2-3 weeks long.Ability to lift up to 40 lbs and climb ladders.Excellent verbal and written English communicationDesired Qualifications:Knowledge of or prior work with industrial conveyor systemsAdeptness with RSLogix 5000, Studio 5000, RSLogix 500 Rockwell applications is required, with Siemens Step 7, and/or TIA PortalExperience with the Installation & Programming of Allen Bradley Powerflex DrivesExperience with bar code scanners and cameras are a plus.EOE/M/F/Vet/DisabledLI-MD1"}