{"jobID": "2803099625", "jobLocation": "San_Jose_CA", "jobTitle": "Social Innovation Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.paypal.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (PYPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Square, Amazon, Apple"}, "estimatedSalary": "127000", "jobDescription": " Job Description Summary:At PayPal, we continue to push the boundary of what technology can do to make a difference in the world we live in. We believe that now is the time to reimagine money, to democratize financial services so that managing and moving money is a right for all citizens, not just the affluent. For that, we are seeking far and wide for that select handful of exceptional world-class problem solvers with a passion for data insights and relentless focus on execution.  PayPal’s Social Innovation efforts build upon our unique expertise and sense of purpose, and extend them to have meaningful, lasting social impact through our business. We focus on two key areas: enabling more financial opportunity for individuals and merchants, and increasing the volume and scale of charitable giving around the world.Job Description: About You:You are passionate about social impact and enthusiastic about the opportunity to further financial inclusion and charitable givingYou are curious and inquisitive: love digging into data and uncovering insightsYou are hyper-analytical and intellectually honest, truly believing in data-driven decisions and communicating your ideas through storytellingYou are a highly motivated, result-oriented self-starter, enjoy working in a fast-pace environment, and can deliver successful results with minimal guidanceYou are a fun-loving, adventurous team playerRole: As the analytics lead for Social Innovation, you will Become an expert in PayPal’s Social Innovation efforts, conducting rigorous analysis and driving recommendations across a diverse portfolio including marketing analytics, product analytics, business insights, and external reportingConduct independent analyses leveraging data from a variety of sources, manage a team of outsourced contractors to execute heavy and recurring work, engage peers from other analytics specialties as appropriate for specific projectsWork cross-functionally with key stakeholders on the Social Innovation and Cause product teams; make clear, coherent and holistic recommendations based on analyses and findingsLeverage Objective & Key Results (OKR) framework to identify key metrics and monitor product performance through dashboards and ad hoc analysisPresent findings and recommendations to senior-level/non-technical stakeholdersRequirements:Data driven mindset with degree in a quantitative discipline such as Computer Science, Statistics, Economics, Engineering, or MathematicsFluent in SQL, Excel, and visualization tools such as Tableau or Qlikview; experience with a statistical programming language (e.g., R, Python) and/or web analytics tools (e.g., Adobe Ominture, Google Analytics) preferred4-6 years of relevant work experience in analyzing large, multi-dimensional data sets and synthesizing data insights into actionable recommendationsExceptional written and verbal communication skills to influence cross-functional teamsPrior work experience with management consulting, investment banking, website analytics and/or consumer financial products is highly valued Subsidiary:PayPalTravel Percent:0Primary Location:San Jose, California, United States of AmericaAdditional Locations: We're a purpose-driven company whose beliefs are the foundation for how we conduct business every day. We hold ourselves to our One Team Behaviors which demand that we hold the highest ethical standards, to empower an open and diverse workplace, and strive to treat everyone who is touched by our business with dignity and respect. Our employees challenge the status quo, ask questions, and find solutions. We want to break down barriers to financial empowerment. Join us as we change the way the world defines financial freedom.Paypal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities."}