{"jobID": "2782757848", "jobLocation": "Vienna_VA", "jobTitle": "President and CEO", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Established, thriving, 100% employee-owned US analysis, modeling and research company seeks an experienced leader to blend stability with growth by strengthening the company’s current market position and steering it to a compelling future as a small-medium sized business (SMB). Working from a well-informed strategic perspective on the research, development and analysis (RD&A;) industry and your history of direct technical engagement with analytical products and services, you will shape and pursue an agile plan of realistic value creation for clients and employee-owners. Drawing on a rich portfolio of leadership and management experience, you will collaborate with a proven core of dedicated professionals to align the organization and rationalize resources to achieve project-specific benefits and advance company-wide goals. With an intuitive sense of human and organizational behavior, you will embrace the virtues of our unique corporate culture and exploit it to attract and retain the talent needed to satisfy discerning customers. Your qualities of channeled energy, passionate objectivity, analytic empathy, and principled realism are keys to success. QualificationsGeneralStable work historyAbility to gain and maintain a DoD security clearanceRequired Education and Experience ·  Bachelor’s degree from an accredited institution Technical role performing and leading RD&A; activitiesSenior-level management role with operational responsibility for a complex, small-medium size organizationDemonstrated understanding of one or more markets/sectors in terms of how RD&A; products and services are acquired and usedPreferred Education and Experience ·  Advanced degree in a discipline directly related to RD&A; Executive-level management role with strategic responsibility for a complex, large RD&A; organization demonstrating value creation for stakeholdersDirect involvement in corporate-level contracts evaluation, bid preparation, and negotiation (teaming, cost, and award)In-depth knowledge of US regulations involving corporate contracts, workplace environment, labor, compensation, security, and retirement issues Interested and qualified applicants are encouraged to respond with a cover letter, current resume, and salary requirements. Only direct responses from principals are being solicited. Submissions from third-party agencies will not be accepted."}