{"jobID": "2689123111", "jobLocation": "Chantilly_VA", "jobTitle": "Data Analystics and Operations Intern", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "42000", "jobDescription": " Data Analystics and Operations Intern Req #: 205197Location: Chantilly, VA USJob Category: AdministrationSecurity Clearance: Favorable SSBIClearance Status: Must be ObtainableJob DescriptionRESPONSIBILITIES:  Serve in an internship program geared towards students who have diverse backgrounds and are equipped to solve the complex and multidimensional problems that CACI face every day. Work with internal or external clients through stages of assignment planning, data gathering, data analysis, developing solutions, generating recommendations, communicating results, and implementation and follow up. Gather required data, exhibit excellent listening expertise, demonstrate analytic problem solving, present ideas clearly and logically, compose appropriately structured text, work with individuals at all levels, provide input on reports and other deliverables, execute multiple assignments, meet agreed deadlines, and adjust to changing client demands. REQUIRED SKILLS: - Experience Excel for data manipulation, analysis, or modeling  - Experience with using key analytic computer tools, including Microsoft Word, PowerPoint, and Excel  - Ability to obtain a security clearance  -Pursuing a BA or BS degree  -Ability to select, analyze, and present data and information in oral, written, or graphical form CLEARANCE: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. PHYSICAL DEMANDS: Ability to pass a mandatory Pre-Employment drug test. Normal demands associated with working in an office environment. Job Location US-Chantilly-VA-VIRGINIA SUBURBAN  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}