{"jobID": "2720736177", "jobLocation": "Chicago_IL", "jobTitle": "Microsoft Data & Analytics Consultant (Remote)", "companyRating": null, "companyInfo": {"Website": "www.blue-granite.com", "Headquarters": "Portage, MI", "Size": "1 to 50 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Pragmatic Works, Slalom, Neal Analytics"}, "estimatedSalary": null, "jobDescription": " BlueGranite is growing and looking for new team members who are passionate about working with clients to build Microsoft-based data and analytics solutions. This full-time, work-from-home consultant position with 25%-30% travel is for individuals who enjoy making an impact with data and analytics solutions using Microsoft Azure and Power BI.At a minimum, we’re looking for:Professional consulting experience with Microsoft data/analytics platformsPassion about the business and curiosity about dataComputer science and database fundamentals; ability to translate data-driven insights into decisions and actionsExperience developing enterprise reports , dashboards, or data visualizationsStrong aptitude and experience with SQL statements (T-SQL and Spark), data manipulation with Python, and DAX calculationsSelf-starter, quick learner, problem-solver with a positive, collaborative, and team-based attitudeExcellent communication skills, with interests in presenting and/or blogging; ability to engage with senior business leadersDegree in information technology, computer science, business, or engineeringAbility and desire to travel to clients, with an average of 25%-30% overnight travel to locations across the U.S. and CanadaAbility to work from home when not on-site at client locationsAuthorization to work in the U.S., without the requirement for an employment visaIn addition, these score you extra points (but are not required):Microsoft certifications for BI, DW, SQL, AI, or machine learningSpark / Databricks certificationMicrosoft Azure data platform and Power BI project experienceExposure to data science and machine learning languagesDemonstration of thought leadership, community volunteering, recognition or awardsMaster’s degree in technology or businessYour primary responsibilities may include:Developing data and analytics solutions using Azure Data Platform technologiesSupporting or developing solutions for machine learning and deep learningBuilding solutions for data ingestion, compute, and consumptionWriting database queries, flows and movementsObtaining and maintaining technical certifications in these core areas of expertiseThis position is predominantly remote, work from home, with an average of 25%-30% overnight travel per year across the U.S. and Canada. The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.BlueGranite is the driving force of data innovation for our customers. We are trusted advisors who use our aptitude and experience to deliver value to our clients. We invest in our team to become better at who we are and what we do. Our core strategy is to lead with offers for data, insights, and analytics that deliver business value on the Microsoft platform.The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. All personnel may be required to perform duties outside of their normal responsibilities from time to time, as needed.BlueGranite is the driving force of data innovation for our customers. We are trusted advisors who use our aptitude and experience to deliver value to our clients. We invest in our team to become better at who we are and what we do. Our core strategy is to lead with offers for data, insights, and analytics that deliver business value on the Microsoft platform."}