{"jobID": "2835298875", "jobLocation": "Southfield_MI", "jobTitle": "Credit Data and Reporting Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.sterlingbank.com", "Headquarters": "Southfield, MI", "Size": "201 to 500 employees", "Founded": " 1984", "Type": " Company - Public (SBT) ", "Industry": " Finance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " Title Credit Data and Reporting Analyst DescriptionSummary This position is responsible for designing, developing and maintaining business data, reporting, and statistical models which allow for insights into loan data and lending portfolio risk trends. Candidate would be expected to complete research and analyze data within the markets the bank services, including existing portfolios and new oppurtunites.  The individual will need a deep understanding of analytical techniques and tools and it is helpful to have a strong understanding of lending practices and processes.  Analyzes credit data to estimate degree of risk involved in extending credit or lending money to firms or individuals by performing the following duties. Essential Duties and Responsibilities include the following. Other duties may be assigned.  Conduct research and compare to existing and planned portfolio characteristics, through multiple internal and external sources.  Analyze complex and large customer loan data sets for use with evolving statistical methods (i.e. lending stress testing, concentration analysis,  Allowance of Loans and lease Loss (forthcoming CECL) reporting), identifying and reporting on risk trends.  Formulate narrative, analytics reporting and credit risk analysis of lending programs in presentation form.  Enhance report and dash boards through data mining analytics and internal reporting tools, following departmental standards, presenting information and  solutions to management and the Board of Directors.  Participate simultaneously on multiple work efforts and high priority activities.  Maximize the use of manual and automated technology to achieve the highest level of data integrity, while producing quality reporting metrics in support of multiple financial systems.  Provide support for the lending projects including re-developing data feeds, data improvement and documentation, development and evidence of lending portfolio management.  Ongoing date improvement and developing from changing date.  Stay well informed about lending practices and procedures throughout the industry. Supervisory Responsibilities\u0081 This job has no supervisory responsibilities. \u0081Competencies No competency or factor selected. Position RequirementsQualifications To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Education and/or Experience Bachelor's degree in business, finance, accounting or related field from four-year college or university; and three or more years of related experience and or training; or equivalent combination of education and experience. Full-Time/Part-Time Full-Time Req Number ADM-18-00006 Location Southfield Office About the Organization Sterling Bank & Trust, FSB was originally chartered in 1984 with a focus on residential and commercial lending and providing a full array of financial products in the neighborhoods we serve. Our niche lending products have resulted in progressive growth and expansion of our California Branch network.  A key part of Bay Area neighborhoods and now Los Angeles, the bank has fourteen neighborhood branches in San Francisco and branches in Burlingame, Daly City, San Rafael, San Mateo and Alhambra, California. EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.This position is currently accepting applications.Apply Now"}