{"jobID": "2823627694", "jobLocation": "Washington_DC", "jobTitle": "Graduate Enrollment Data Analyst", "companyRating": "4.1", "companyInfo": {"Website": "www.american.edu", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1893", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "37000", "jobDescription": "Summary/Objective The Graduate Enrollment Data Analyst will collect, verify, conduct descriptive analyses on and help interpret data on graduate applications at American University. The incumbent will recommend business process changes for business units to conform to university-wide data standards and develop reports and/or presentations for business units, the provost, vice provost, and the president. The incumbent will also be expected to conduct and develop initial statistical analyses on application data and build standard reports for campus stakeholders using common visual and numeric summaries. The incumbent will coordinate with the Office of Information Technology (OIT) and the units to maintain a database of internal graduate financial aid and develop quarterly reports. The incumbent will develop reports for the Office of Sponsored Projects using the Cayuse system. The incumbent is responsible for developing and maintaining expertise in Colleague, MicroStrategy Business Intelligence, Ellucian Recruiter, Cayuse and all other relevant software used for data analysis. The incumbent will also work with the Office of Information Technology to verify the accuracy of data entered into Ellucian Recruiter and proactively correct problems in the Recruiter database. Work EnvironmentThis position reports directly to the Assistant Director of Statistical Modeling and Data AnalyticsThis position is part of the Office of Graduate Studies (OGS)Position Type/Expected Hours of Work35-ExemptCoordinator/Analyst ASalary RangeCommensurate with experienceRequired Education and ExperienceBachelor’s degree in a quantitative/analytical/statistical fieldMinimum of one year of professional experience in data collection or one year in university admissions, enrollment, research development, administration, and/or marketingExperience using Microsoft Office Products (Word, Excel, PowerPoint)Ability to develop written communications and oral presentations to explain quantitative results effectively to various audiencesAbility to communicate with diverse academic audiencesAbility to learn new software and systemsExcellent organizational and time management skillsAbility to work collaboratively and effective customer service skillsPreferred Education and ExperienceExperience using MicroStrategyExperience using statistical software packages (e.g. SPSS, SAS, R, or JMP)degree in quantitative/analytical/statistical fieldExperience with analyses and/or predictive models related to graduate school admissionsTwo or more years of experience in either business/finance or university admissions, enrollment, and/or marketingAdditional Eligibility QualificationsHiring offers for this position are contingent on the successful completion of a background checkCurrent American University Employees: If you are a current full-time or part-time staff member at American University, please log into AsuccessfulU through the myAU portal. Once in AsuccessfulU, please select the Careers tile which will take you to our internal career page. Contact Us: For more information or assistance with the American University careers site, email AsuccessfulU@american.edu. American University is an equal opportunity, affirmative action institution that operates in compliance with applicable laws and regulations. The university does not discriminate on the basis of race, color, national origin, religion, sex (including pregnancy), age, sexual orientation, disability, marital status, personal appearance, gender identity and expression, family responsibilities, political affiliation, source of income, veteran status, an individual’s genetic information or any other bases under federal or local laws (collectively \"Protected Bases\") in its programs and activities.Nearest Major Market: Washington DC"}