{"jobID": "2542703727", "jobLocation": "Houston_TX", "jobTitle": "Principal Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.h-gac.com", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " 1966", "Type": " Government", "Industry": " Government", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": " Job Title: Principal Data Analyst  Job ID: TR14019  Full/Part Time: Full Time  Regular/Temporary: Regular  Salary: $68,636.00 - $91,515.00  Date Posted: 9/22/2017  H-GAC Overview  Serving more than 6 million people in our region, the Houston Galveston Area Council is the cornerstone to address issues that cross city limits and county lines every day. HGAC is made up of 13 county governments, 107 cities, and 11 school districts. HGAC prides itself in serving as an instrument of local government cooperation, promoting the region’s orderly development and the safety and welfare of its citizens.  Opportunity  H-GAC is seeking a Principal Data Analyst to join the modeling team within our transportation department. Through cooperation with local governments, H-GAC’s transportation department improves the quality of life for residents across the region. Improving mobility and creating multimodal transportation options are core elements in H-GAC’s Transportation programs.  As the Data Analyst, you will have the responsibility for developing a data management program for HGAC. We are seeking an experienced traffic engineer or transportation planner with knowledge of traffic statistics, traffic count analysis and traffic count technology. You will be leading a team of HGAC staff and consultants to code traffic count, classification and speed data, for the eight county HGAC region.  The candidate must demonstrate experience in development and execution of large data sets the of travel related data, including counts data and speed data, and should can work with consultants and HGAC staff to develop online applications to publish data to the web. Strong project management, team building, communication and presentation skills are essential for success in this role. You must be able provide professional and timely feedback to a variety of audiences.  The ideal candidate will also have experience in the development of scopes of work, contracting processes, data analysis, public input, management of consultant teams, review of invoices and reports, in the implementation of transportation planning studies consistent with federal, state, and local requirements. The Transportation Department is one that demonstrates strong team work, an “all hands-on deck” attitude and are passionate about doing whatever it takes to improve the quality of life for our citizens. We are looking for someone who shares these same values and who is not afraid to think outside of the box, brainstorm and bring innovative ideas to the table. Requirements The successful candidate will have at a minimum: Bachelor’s degree in Planning, Engineering, Statistics, Economics or a related field of study.Five (5) years’ experience in urban or regional planning, monitoring and reporting.Thorough knowledge of traffic statistics, traffic count analysis and traffic count technology, policies, regulations and best management practices.Experience in data frames, data set designs, and maintaining large volumes of data.Knowledge of large sets of traffic or transportation-related data.Data analysis, statistical analysis, and GIS experience.Ability to plan and effectively manage complex projects.Preferred Qualifications Include:Bachelor’s degree in Civil Engineering or Transportation Engineering with a concentration. in traffic or transportation.Eight (8) years’ experience in a previous data analytics role.Strong knowledge and experience with relational databases.Proven experience with long and short-term projects.Apply online via:https://h-gac.com/careers H-GAC is an equal opportunity/AA employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, or protected veteran status."}