{"jobID": "2821613260", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Deep Learning Data Scientist - Think Big Analytics", "companyRating": "3.3", "companyInfo": {"Website": "www.teradata.com", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (TDC) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " EMC, IBM, Oracle"}, "estimatedSalary": "151000", "jobDescription": " Think Big Analytics provides end-to-end solutions and services in big data, data science, analytics and data warehousing, enabling companies to become analytics-driven businesses. Think Big Analyticss strategy is to work with customers with business-driven consulting, to create analytic solutions in a technology neutral manner, and to develop its underlying platform to better support market needs. Think Big Analytics is building an Artificial Intelligence team that is growing a business focused on the emerging field of Deep Learning for enterprise analytics.  Our cutting-edge advanced analytics and discovery technology is helping Fortune 1000 organizations to be efficient and innovative by uncovering new opportunities to grow revenues and cut costs. From large financial services organizations to global communication services providers to healthcare providers to auto manufacturers, the largest organizations globally are using our Big Data analytics and discovery technology to make sense of petabyte scale multi-structured data to better understand customer behaviors, anticipate customer needs and develop better products and solutions.  Think Big Analytics is looking for a Senior Data Scientist with hands on experience developing, implementing and solving complex machine learning problems using emerging approaches in Deep Learning.  Responsibilities: Deep Learning expert providing leadership for client projects.Design, build and implement Deep Learning models for Think Big Analytics customers.Communicating complex analytical and technical concepts to a business audienceEvaluating and differentiating techniques, tools and approaches to Deep Learning problemsStaying up to date with Deep learning research and applications, and sharing expertise at industry conferencesSupporting asset development, including providing field experience back to product development teamsResponsible for overall quality of software deliverablesSupport, lead and mentor junior members of the team in Data Science techniquesCollaborate with Sales and Services Directors to assist in developing new business and manage existing client relationships Qualifications: High level hands on knowledge of deep learning models and frameworks.Building deep learning solutions with tools such as Keras, TensorFLow, PyTorch, MXNet, Caffe2 et al.Knowledge of big data technologies such as Hadoop and SparkUnderstanding advantages and disadvantages of CPU, GPU, FGPA and ASIC in Deep Learning training and inference preferred.Strong programming skills in Python and Linux command line skills a mustCreativity and curiosity for unique ways to solve complex customer problemsExcellent verbal and written communicationAbility to give both technical and sales presentationsAbility to communicate past experiences in sales and speaking opportunitiesAbility to communicate with both technical and business stakeholdersAbility to travel up to 50%Previous professional consulting experienceAdvanced degree in CS or related technical field5+ years machine learning, including 3+ years working on Deep Learning projects Preferred Skills: Masters DegreeProfessional consulting experience This position is working in a virtual office environment, including home office & customer site.  Our total compensation approach includes a competitive base salary, 401(k), strong work/family programs, and medical, dental and disability coverage.  Teradata is an Equal Opportunity/Affirmative Action Employer and commits to hiring returning veterans. #LI-AR1"}