{"jobID": "2745096403", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.hhsc.state.tx.us", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1912", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "Posting Type: Open to All ApplicantsCategory: Computer and Mathematical FLSA Exempt/  Non-Exempt: ExemptAgency: Health & Human Services Comm Department: HDIS Operations SupportJob Title: Senior Data Analyst Posting Number: 379453Full Time/Part Time : Full Time Regular/Temporary: RegularJob Location: 909 W 45TH ST City: AUSTINContact: AccessHR Service Center Telephone: 888-894-4747Salary Range: $4,917.00 - $6,243.00 Salary Group: B24Shift: Days (First) Travel: 5%Closing Date:Job Description: The Senior Data Analyst (Systems Analyst V) reports to the Data Analytics and Reporting Team Manager in Health, Developmental and Independence Services (HDIS), Medical and Social Services Division. The Systems Analyst V conducts advanced agency data analysis for reporting on agency operations and programs within HDIS and for management decision support. The Systems Analyst V interacts with program subject matter experts, and/or executive management in defining business problems, understanding specialized programs, and gathering data for reporting, and coordinates projects with other analysts in the unit as needed. The Systems Analyst V is responsible for evaluating and/or monitoring the evaluation of existing complex business systems and procedures for possible redesign. Duties include program system maintenance and analyses in areas of specialization. The Systems Analyst V serves in a leadership role to guide, support, and mentor other staff in a team setting. The position works under limited direction with extensive latitude for the use of initiative and independent judgment. The amount of travel involved is expected to be minimal. The Systems Analyst V will perform other duties as assigned, including those required to maintain HDIS operations.Essential Job Functions: Conducts ad hoc, routine, and long-term data analyses using highly advanced analytical and data-conversion methods and reports results in an appropriate format, including performing quality assurance review and documenting processes for technical and non-technical users. These analyses will be planned and conducted with considerable latitude and without routine oversight from the analyst’s manager. (30%) Collaborates with unit staff, subject matter experts, and/or executive management in data analyses and design of business information products and systems, including providing technical expertise to aid in decision making and problem resolution. This function requires considerable use of independent judgment and decision making. (25%) Performs leadership functions within a team-based environment, including mentoring or training junior staff. (20%) Assists agency and unit staff with design and development of business information systems and reports, including developing code and report layout to ensure user requests are properly translated into useful reports. (20%) Other duties as assigned include, but are not limited to, actively participating and/or serving in a supporting role to meet the agency’s obligations for disaster response and/or recovery or Continuity of Operations (COOP) activation. Such participation may require an alternate shift pattern assignment and/or location. (5%)Knowledge Skills Abilities: Knowledge of Texas state government. Knowledge of the collection, analysis, and dissemination of health and human services data, including applying state and federal reporting requirements and guidelines. Knowledge of research methods, principles, techniques and philosophies. Knowledge of statistical concepts, methods, and their application to data analysis. Skill in analyzing complex data and synthesizing large amounts of information using computer software package applications including but not limited to SAS, SQL, Tableau, or SPSS. Skill in analyzing and evaluating systems and procedures. Skill in preparing, interpreting, and presenting complex statistical and data analysis reports. Skill in communicating and interacting effectively with stakeholders including co-workers, program managers and staff, and HDIS executive leadership. Skill in organizing research findings and developing creative solutions for presentation and implementation. Skill in developing presentations. Skill in writing concise reports. Skill in planning, coordinating, and monitoring projects and/or supervising the work of others. Skill in functioning effectively as both a team member and team leader. Ability to work independently under tight deadlines and manage multiple projects and deliverables. Ability to interpret program directives and policies. Ability to plan and coordinate activities. Ability to organize tasks and projects. Ability to communicate orally and in writing, including presenting research results in non-technical language.Registration or Licensure Requirements: Initial Selection Criteria: Graduation from an accredited four-year college or university with major coursework in a relevant field (e.g., information technology, computer science, statistics, public health, epidemiology). Minimum three years’ experience in SAS programming, data analysis, or similar job function. Additional work experience may substitute for education on a year-for-year basis. Master’s degree preferred."}