{"jobID": "2835297746", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Senior Research Scientist I", "companyRating": "4.3", "companyInfo": {"Website": "www.mtu.edu", "Headquarters": "Houghton, MI", "Size": "1001 to 5000 employees", "Founded": " 1885", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": " Position Information Position Title Senior Research Scientist IDepartment Michigan Tech Research Institute (MTRI)Location Michigan Tech Research Institute (Ann Arbor, MI)Position Type StaffFull-time/ Part-time Full-timeFull-Time Equivalent (1.0=100%) 1.0Appointment Term 12 MonthPay Type Salary BasisSalary or Hourly Rate Negotiable based on experience.ShiftPosition Duration Dependent on External Funding? YesTitle of Position Supervisor Senior Research Engineer/Scientist II Position Summary InformationTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Job Description SummaryMotivated, creative principal investigator to provide technical and business development leadership for MTRI activities focused on the design, development, evaluation and exploitation of remote sensing systems for national security applications. The position requires a strong background in mathematics, probability and statistics, physics, and engineering and a proven record of program development and capture. The position is based at MTRI in Ann Arbor, MI.Essential Duties & Responsibilities (other duties may be assigned)1. Lead the formulation and development of new sensor and exploitation programs. Serve as principal investigator on research programs.Participate in research-related activities such as formulating and writing proposals, planning and management of research projects, report preparation, and presentation of findings on an as needed basis.Provide technical assistance to federal, state and local agencies on sensing and processing related issues.Deliver program-related presentations to clients and related professional organizations.Supervise project staff and student interns.Commit to learning about continuous improvement strategies and applying them to everyday work. Actively engage in University continuous improvement initiatives.Apply safety-related knowledge, skills, and practices to everyday work.Integrate safety practices into daily activities.Cooperate with safety personnel.Follow all written and oral safety instructions.Apply safety-related knowledge, skills, and practices to everyday work.Required Education (minimum requirements)PhD degree in a science related field such as physics, electrical engineering, optics, mathematics, or statistics, and 10 years of experience in remote sensing, sensor development or data science.  OR  Master’s degree in a science related field such as physics, electrical engineering, optics, mathematics, or statistics, and 15 years of experience in remote sensing, sensor development or data science.Required Experience (minimum requirements)• Experience with the development and execution of applied research programs."}