{"jobID": "2820731142", "jobLocation": "Imlay_City_MI", "jobTitle": "Warehouse Supervisor", "companyRating": "3.1", "companyInfo": {"Website": "www.pinnaclefoods.com", "Headquarters": "Parsippany, NJ", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Public (PF) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " General Mills, Conagra Brands, The J. M. Smucker Company"}, "estimatedSalary": "50000", "jobDescription": " At Pinnacle Foods we are at the top of our game and the key to our success is clear. Everything we do is driven by our purpose: unleashing brand potential, dynamically evolving and improving our already beloved products to bring more convenience, taste, nutrition, and joy to today's consumers.  The results? Our well-recognized products are found in 85% of American households and are leaders in their respective categories, holding the #1 or #2 market share position in 10 of the 14 categories in which we compete — and we're just getting started. We are committed to adding value through strategic growth that synergizes our portfolio of \"Leadership\" and \"Foundation\" brands and plays to our strengths in R&D;, consumer insights, and senior management experience. SCOPE OF POSITION: The Warehouse Supervisor is responsible for planning, directing, and coordinating warehousing activities within the department. This person ensures a safe work environment is maintained while meeting departmental warehousing targets. This person will work with teams of supervisors in other departments, department heads, and other staff on a daily basis to deliver targets and improvement objectives. ESSENTIAL DUTIES AND RESPONSIBILITIES:Maintain plant Shipping and Receiving and Warehouse policies and procedures.Ensure warehouse supplies are received, documented and stored properly.Ensure inventories are accurate, transactional activity is timely processed, as well as production verification.Monitor inventories and track production progress to identify factors that could impact production and shipping schedules.Ensure finished products are properly received, documented and stored and that storage facilities are properly maintained.Ensure compliance with corporate quality policies and procedures, including product hold, detained product, rework, product traceability and destruction of out-of-code product.Provide continual leadership and guidance to team members for the purpose of increasing their effectiveness, accuracy, and establishing good working relationships.Actively promote and comply with plant safety training programs/procedures that are in accordance with corporate and regulatory requirements.Actively promote adherence to corporate Quality, Sanitation, GMP and SQF standards to achieve a finished product within quality control specifications.Manage staffing levels to current labor contract / labor standards requirements.Assign responsibilities to team members.Determine proper shift staffing required based on performance of production and shipping operations.Apply disciplinary actions in accordance with plant policies and procedures.Conduct thorough inspections on a routine basis to ensure warehousing areas comply with all regulatory requirements for sanitation and housekeeping.Identify and take corrective action and/or recommend solutions to problems requiring special attention.Promote an environment conducive to teams, teamwork, and line-driven accountability.Complete MVP, special projects, duties and assignments, as appropriate.Manage end of shift finished goods detained/hold activities.SKILLS & EXPERIENCE:Minimum of 3 years of supervisory experience, preferred.Minimum of 3 years of supervisory experience in a distribution or warehousing environment, preferred.Professional experience in a food manufacturing environment or food products industry, preferred.Experience with continuous improvement methodologies, preferred.Experience working with a diverse group of people.APICS Certification, preferred.Ability to maintain high expectations for self and others, demonstrating a dedication to achievement of results.Proficient in Microsoft Word, Power Point and Excel and able to become proficient with the company mechanized inventory control systems.Ability to analyze data and information, and to make effective and timely decisions.Ability to use innovative approaches and embraces change to resolve complex problems.Ability to work under pressure and to react to situations with a strong sense of urgency.Strong written and verbal communication skills, with the ability to effectively communicate throughout all levels of the organization.Solid problem solving, project management, multi-tasking and prioritization skills.Detail oriented, organized, reliable and resourceful.Ability to work effectively both independently and within a team environment.EDUCATION:Undergraduate Degree, preferred.Bachelor of Science in Business Administration with a concentration in Materials Management, Logistics, Industrial Distribution Management, or equivalent, preferred.TRAVEL:10% travel required Pinnacle Foods is an Affirmative Action/EEO Employer –  qualified applicants will be considered for employment without regard to  protected veteran or disability status, race/color, religion, gender, national  origin, age, sexual orientation, gender expression, gender identity or any  other legally protected basis."}