{"jobID": "2650024949", "jobLocation": "San_Mateo_CA", "jobTitle": "Senior Engineering Director - Game Engine", "companyRating": "4.6", "companyInfo": {"Website": "corp.roblox.com", "Headquarters": "San Mateo, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unity Technologies, Valve Corporation, Facebook"}, "estimatedSalary": "202000", "jobDescription": "Roblox, Senior Director Engineering - Game Engine, San Mateo, CAWHY ROBLOX? Robloxs Imagination Platform is ushering in the next generation of entertainment, enabling kids of all ages to imagine, create, and play together in immersive 3D worlds. Powered by a global community of millions of developers and creators, Roblox allows anyone to build, publish, and monetize any experience imaginable.  comScore ranks Roblox as one of the top online entertainment platforms for audiences under the age of 18 based on average monthly visits and time spent. In addition, Roblox has been named one of Americas Fastest-Growing Private Companies on the Inc. 5000 for the past two consecutive years.  Work with the most passionate, team-oriented, visionary, crazy-smart people youll ever meet. The engineers at Roblox are working on the hardest problems in tech today -- distributed systems, real time communication, 3D co-experience, massive data processing, social networking, rendering, physics, and more. As a Roblox engineer, you will have real ownership and impact across one or more of these domains.As the Senior Engineering Director - Game Engine, your will focus on performance, memory usage, and stability in every area. By extending our embedded Lua VM with new language features for networked communication, we make it easier to create great multiplayer content. We are building a new constructive solid geometry engine to intuitively compose objects in real-time. Simultaneously, we are pushing our immersive vision forward with projects like procedurally generated sky and weather systems as well as new groundbreaking dynamic lighting technology.  Were looking for an exceptional leader to help guide the team on this journey. Youll lead a world-class team to solve hard technical challenges unique to our dynamic ecosystem.You Are:Skilled in C/C++ with 5+ years in a technical lead roleExperienced: 5+ years in delivering a high quality real time 3d platform, such as a game engineData-driven with a mastery of developing and using precise stability and performance metricsPassionate about the developing great talent and have a proven track record of running successful teamsAn Expert in game development skills like rendering, networking, and physics a plusA Leader with a track record with shipping a real-time client server networked product such as an MMOYou Will:Drive the development of an engine used by millions of peopleBuild upon our highly collaborative, high quality cultureEnsure continuous improvement and delivery of a robust, blazing fast game engineDemonstrate technical leadership over complex engineering and architectural problemsHelp define the technical roadmap of the core Roblox engineCollaborate cross-functionally across engineering and product teamsProvide mentorship and develop talented engineersEstablish best practices, tools, and processYou'll Love:Excellent medical, dental, and vision coverageA rewarding 401k programFlexible vacation policyFree catered lunches five times a week and several fully stocked kitchens with unlimited snacksOnsite fitness center and fitness program creditAnnual CalTrain Go PassA super-cool Roblox Admin badge for your avatarRock star status with our communityRoblox Powering Imagination. [ID820]"}