{"jobID": "2750322585", "jobLocation": "Arlington_VA", "jobTitle": "Senior Data Analyst - (SECRET CLEARANCE)", "companyRating": "3.7", "companyInfo": {"Website": "www.acifed.us", "Headquarters": "Washington, DC", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " KeyPoint Government Solutions, Infosys, ActioNet"}, "estimatedSalary": "97000", "jobDescription": "ACTIVE SECRET CLEARANCE REQUIREDPOSITION SUMMARYPlans and manages system-wide data analyses regarding the allocation of enterprise application functionsfor the IPPS-A program. Manages data analysis of systems in coordination with developers, businessanalysts, system owners. Ensures functional business requirements and process issues are resolvedusing comprehensive enterprise applications solutions in reference to data needs. Works with seniormanagers to identify and solve data issues, design solutions, develop conceptual models, map functionalrequirements into technical requirements, and support design and implementation of conversions andinterfaces. Analyzes the IPPS-A information system baseline and performs a data analysis between thebaseline, user operational requirements, and the operating capability of products. Supports technicaldata design reviews, enterprise approach validations, and work product assessments.Duties and Responsibilities-Elicits and documents data requirements and specifications from functional users, system owners andsubject matter experts-Translates data requirements into a best fit within the application, and develops processes anddocumentation that support data-Perform data analysis, mapping and transformation rules to convert and interface data-Develops and maintains standard systems requirement documents including but not limited to:interface design documents, run books, run books, test plans, test scripts, business process workflows,data requirements documents, and use cases.-Supports application configuration and security setup as needed-Implements complex enterprise system configurations and end to end development design-Evaluates and provides feedback on system and functional design documents, test plans, scenarios, andother associated artifacts-Defines test scenarios based on data requirements-Creates test scripts to prove each scenario through system and user acceptance testing-Supports-Meets deadlines and manages multiple, dynamic priorities-Communicates effectively and demonstrates ability to work in a team-oriented environment-Applies HCM knowledge and industry best practices in developing the to-be business processes andproceduresRequired Qualifications-Bachelor's degree in Computer Science or Information Systems or other technically relevant degree-Versed in the design, implementation, test and deployment of PeopleSoft ERP HCM version 9.x-10+ years of experience with a minimum of 4 years of functional or data experience with PeopleSoft HCM 9.x-Expertise with one or more of the following PeopleSoft modules: HR Core, Global Payroll, Base Benefits,Benefits Administration, Time and Labor, Talent Acquisition-Must be a team player and be able to adjust to a dynamic working environment that supports agovernment agency-Must have strong written, verbal, and listening skills-Must have strong analytical skills and can demonstrate strong problem solving skills-Ability to communicate in a clear and concise manner and success working in Integrated Product Teams(IPTs)-Must have an active security clearanceDesired Qualifications- Experience with PeopleSoft HCM 9.x- ERP implementation experience in large scale projectsPhysical DemandsNormal demands associated with an office environment. Ability to work on computer for long periodsand communicate with individuals by telephone, email and face to face. Up to 10% of time for travel may be required."}