{"jobID": "2835266574", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.atrilogy.com", "Headquarters": "Irvine, CA", "Size": "1 to 50 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Greetings !!!  Looking for a Data Engineer in El Segundo, Austin, or New York.  This is a 12+ Months contract position. The candidate needs to have expertise in data warehousing, strong AWS experience, and hands-on coding experience. Job Requirements:BS in Computer Science or equivalent education/professional experience is required.5+ years in a data engineering role with demonstrable experience with data integration and data warehouse projects.Experience designing and building data warehouses, customer profile databases, data marts, etc.Experience with data modeling, warehouse design, and fact/dimension concepts.Experience working with different query languages (i.e. T-SQL, PostgreSQL, PL-SQL).Prefer some experience in at least one programming language (i.e. Python, Java, Scala, C#, etc.).Prefer some experience in data integration projects and automation via ETL Tools (i.e. Talend, Informatica, SSIS, etc.)Experience with AWSPreferred:Experience in Amazon Redshift is a big plus.Experience with marketing data (Google Double-Click, Site Analytics, Paid Search, etc.) is also big a plus.Understanding and experience working with cloud platform services: Redshift, Aurora, Data Factory, SQL DW, Azure Datawarehouse, Data Lake, BigQuery, etc.Experience working with code repositories and continuous integration (i.e. Git, Jenkins, etc.) For immediate consideration please submit your resume in Word format, along with daytime contact information. LOCAL CANDIDATES ONLY PLEASE unless you are willing to relocate yourself at your own expense. Client is unable to provide H-1B Visa sponsorship at this time. All submittals will be treated confidentially. Selected candidate may be asked to pass a comprehensive background, credit and/or drug screening. Principals only, no third parties please.  Established in 2000, Atrilogy Solutions Group, Inc. provides organizations of all sizes with high-quality, cost effective information technology (IT) and business process consulting & staffing services. Our industry-leading service model combines experienced project managers with seasoned technical and functional consultants to eliminate client uncertainty and deliver superior value and results.  Clients turn to Atrilogy for expertise in: IT staffing and placement (Project Managers, Agile/Scrum Masters, Business Analysts, DBA’s, Software Engineers, Mobile Developers (iOS, Android), DevOps, Automation, QA, Systems & Network Engineers, Cyber Security / Information Security Specialists)All major ERP & CRM packages (including Oracle, Workday, PeopleSoft, JD Edwards, Lawson, SAP, Dynamics AX, Salesforce, Microsoft CRM, NetSuite)Business Intelligence, Data Warehousing, and Big Data Integration)Creative (Interactive Project Manager/Art Director, Information Architect, UI/UX Designer, Web/Graphic Design) Atrilogy has been recognized by Inc. magazine as one of the nation’s fastest-growing, privately-held companies. Headquartered in Irvine, California, Atrilogy also has offices in Denver, Phoenix, Atlanta, and Dallas with satellite offices in Boston, Jersey City, Las Vegas, Seattle, and Delhi, India.  Atrilogy Solutions Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, protected veteran status, or any other basis protected by applicable law, and will not be discriminated against on the basis of disability.  In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire- provided by Dice  Data Engineer, AWS , data warehousing"}