{"jobID": "2832215232", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Optimization", "companyRating": null, "companyInfo": {"Website": "www.unity.pl", "Headquarters": "Wroclaw, Poland", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist - Optimization San Francisco, Full-time  We are looking for an experienced Data Scientist who has a shrewd business sense and an exceptional background in science and programming. You will work as a part of an international data science team to develop best-in-class targeting and decision-making mechanisms. The work will be day-to-day researching for new ways to improve, testing and validating the ideas, and implementing the solutions in production.  Unity Monetization Team, a division of Unity, builds advertising and IAP solutions and technologies used in hundreds of thousands of apps. Our Ads team builds the technology infrastructure and ad serving systems that manage the delivery of relevant advertisements to hundreds of millions of users every day. Our data systems process massive data sets to develop targeting criteria and analytics that maximize the effectiveness and profitability of our advertising business.  In this role, you will develop the processing, services and algorithms on various machine learning aspects, from providing ideas to developing procedures in production. You are comfortable with quick-paced cycle of development and you have the business acumen to understand what needs to be done and why.  This role is located onsite at the Unity office in San Francisco, CA. ResponsibilitiesWorking machine learning challenges in implementing algorithms and building infrastructure to run these in production environments in scalable and reliable wayImplementing algorithms, knowing and understanding Python/Scala + Tensorflow/Caffe, Spark/Samza/Flink, Druid/Cassandra/Redshift, and Data structures, data distribution and storingProbabilistic methods, different deep learning and reinforcement learning conseptsRequirementsMinimum 5 years of relevant work experienceDeveloper or Machine learning expert by experience and education (PhD, MSc in Machine Learning, math or Comp Sci)Experience implementing algorithms and decision making systems in real-time environmentInterest in emergent technologies, machine learning and AIExperience on programmatic or mobile advertising is preferred Who We Are // About Unity  Unity is the creator of the world's most widely-used real-time 3D (RT3D) development platform, providing content creators around the world with the tools they need to build rich, interactive 2D, 3D, VR and AR experiences. In fact, apps made with Unity reach 2.7 billion devices worldwide, and were installed more than 24 billion times in the last 12 months.  The global engineering team keeps Unity at the forefront of technology and working alongside partners like Magic Leap, Google, Facebook, Oculus and Microsoft ensures optimized support for the latest technology and platforms. Unity is powering the real-time revolution, expanding beyond games and breaking into other industries including automotive, film, architecture, engineering, construction and more.  Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.  Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.  Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.  Job details  Location  San Francisco  Department  Engineering  Job type  Full-time  Apply now!  Other positions in Engineering  No"}