{"jobID": "2803336004", "jobLocation": "Arlington_VA", "jobTitle": "Lead Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.excella.com", "Headquarters": "Arlington, VA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "112000", "jobDescription": " About ExcellaExcella is a technology consulting firm serving commercial, non-profit, and federal clients in the Washington, DC area. Excella builds innovative custom software solutions with a strong focus on Agile engineering practices. We believe that great work leads to great things –- for our clients and our employees. We are growing fast and need passionate, innovative people who love working with technology and are ready to make an impact.  Here's what you can expect from us: We care about our employees. In fact, The Washington Post and The Washington Business Journal consistently rank us as a \"Best Place to Work.You'll work with great people who love what they do: our team includes published authors, certified trainers, and internationally renowned speakers.We have a \"bring your own device\" workplace and will share the cost of a new computer of your choice -- Mac or PC. It's up to you.We'll invest in your career by providing 3 days of paid professional development every year, including travel and registration fees to attend classes and conferences, in addition to tuition assistance for degrees and certifications.Starting day one, every employee is bonus eligible and receives 17 days of paid vacationYou can bike, drive, or metro to work -- our commute reimbursement plan has you covered.We cater dinner once a month, and always have healthy snacks available!You'll have fun! We hold monthly happy hours and events all year long, including a summer weekend getaway for you and your family OverviewThe Data Scientist is responsible for using advanced statistical, algorithmic, machine learning, mining and visualization techniques to help advance and complete client projects. The Data Scientist must also be able to communicate complex quantitative analyses in a clear, precise, and actionable manner to management and executive level audiences.Responsibilities Working directly with client stakeholders to understand and define analysis objectives and then translate these into actionable results.Obtaining data from multiple, disparate data sources including structured, semi structured and unstructured data.Using machine learning and data mining techniques to understand the patterns in large volumes of data, identify relationships, detect data anomalies, and classify data sets.Working with data integration developers to assess data quality and define data processing business rules for cleansing, aggregation, enhancement, supporting analysis and predictive modelling activities.Designing and building algorithms and predictive models using techniques such as linear and logistic regression, support vector machines, ensemble models (random forest and/or gradient boosted trees), neural networks, and clustering techniques.Deploying predictive models and integrating them into business processes and applications.Validating and optimizing model performance upon deployment and tracking over time as necessary.Presenting complex analysis results tailored to different audiences (e.g. technical, manager, executive) in a highly consumable and actionable form including the use of data visualizations.QualificationsBachelors Degree in a quantitativediscipline and 4+ years of analytics experience or;Masters Degree in a quantitative disciplineand 2+ years of analytics experience2+ Hands on experience in applied machine learning with either Python or R2+ years using data mining methods, such as clustering and anomaly detection, to understand data patterns and select appropriate predictive techniques.Proficient understanding of relational SQL (e.g. Oracle, SQL Server, PostgreSQL) and NoSQL (Mongo, Neo4j) databases and data structures.Excellent communication skills to be able to interact directly with non-technical client stakeholders and act in a business-to-technical translation role.Experience working in an onsite client technical consulting environment preferred.Experience working within the Agile Scrum Framework.Self-motivated and self-managing.Proficient in creating reasonable and accurate time estimates for assigned tasks. Prefered Qualifications: Masters Degree or PhDExperience with modern natural language processing techniques (embeddings, deep learning for NLP)Experience with advanced deep learning methodsExperience with deploying machine learning models in AWS"}