{"jobID": "2832822338", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Tracking Code NHTSA-18-1139-F  Job Code 18-1139  Posting Title Data Analyst  Post Date 6/28/2018  Full Time / Part-Time Full Time  Travel No Travel Required  City Washington DC  State DC  Country US Description DATA ANALYST (NHTSA-18-1139-F): Bowhead seeks a Data Analyst to join our team in Washington, DC. The Data Analyst will be responsible for developing visualization dashboards using data retrieval methods and visual analytics software such as SAS Visual Analytics Software, Tableau, Microsoft Power BI or COGNOS to be deployed to servers for public consumption. The Data Analyst will also be responsible for graphic operations, Word processing of OTRA's annual or technical reports and formal responses to request for data. Essential functions may include:Design and create visualizations through the collection of customer requirements, determination of available data sources, and mapping of data collection fields.Ensure data validity, statistical integrity, and optimal user experience.Work with the Engineering team to determine source of needed data and assist with design and development of database tables to optimize reporting and dashboards.Perform statistical analysis of large data sets to better understand trends, relationships between variables, and to formulate predictive insights.Reasons independently - complex data architectures.Employ new research tools to derive unique findings.Design and build data visualizations using diverse sets of structured and unstructured data.Ensure research reports are created using credible qualitative and quantitative methodologies based on key insights and findings from studies.Identify internal and external information sources. About this Contract Engineering, Statistical, and Technical Support Services (ESTS): The scope of work includes providing support to the U.S. Department of Transportation (DOT) National Highway Traffic Safety Administration (NHTSA). Bowhead delivers to DOT NHTSA critical safety data and analysis for distribution to the public. Other areas of support include: Vehicle Crash Evaluation and Engineering Research Support, Web Page Design and Development, and Database Analytics and Database Research Support. RequirementsBA/S is required in addition to five to eight (5 to 8) years of professional experience is required.Must have demonstrable experience in building analytics/visualization solutions with SAS Visual Analytics Software, Tableau, Microsoft BI or COGNOS in a professional (non-academic) environment.Experience with requirements gathering, analysis and documentation as well as synthesizing large amounts of information effectively and creatively.Must have a basic understanding of Software Development Life Cycle (SDLC) - process for planning, creating, testing and deploying an information system.Experience with analytics, databases and business intelligence is preferred.Intermediate to advanced level skills in Microsoft Office software suite - Word, Excel, Outlook, PowerPoint in addition to the visualization software listed above is required.Ability to communicate effectively with all levels of employees and outside contacts.Strong interpersonal skills and good judgment with the ability to work alone or as part of a team as well as having a high level of initiative and excellent attention to detail. SECURITY CLEARANCE REQUIRED: Must be able to obtain a security clearance at the Public Trust level. A minimum of three (3) years US residence is required for a Public Trust clearance at this location.  Applicants may be subject to a pre-employment drug & alcohol screening and/or random drug screen, and must follow UIC's Non-DOT Drug & Alcohol Testing Program requirements. If the position requires, an applicant must pass a pre-employment criminal background history check. All post-secondary education listed on the applicant's resume/application may be subject to verification.  Where driving may be required or where a rental car must be obtained for business travel purposes, applicants must have a valid driver license for this position and will be subject to verification. In addition, the applicant must pass an in-house, online, driving course to be authorized to drive for company purposes.  UIC is an equal opportunity employer. We evaluate qualified applicants without regard to race, age, color, religion, sex, national origin, disability, veteran status, and other protected characteristics EOE/AA/M/F/D/V. In furtherance, pursuant to The Alaska Native Claims Settlement Act 43 U.S.C. Sec. 1601 et seq., and federal contractual requirements, UIC and its subsidiaries may legally grant certain preference in employment opportunities to UIC Shareholders and their Descendants, based on the provisions contained within The Alaska Native Claims Settlement Act.  All candidates must apply online at *****************, and submit a completed application for all positions they wish to be considered. Once the employment application has been completed and submitted, any changes to the application after submission may not be reviewed. Please contact a UIC HR Recruiter if you have made a significant change to your application. In accordance with the Americans with Disabilities Act of 1990 (ADA), persons unable to complete an online application should contact UIC Human Resources for assistance (******************************************************  UIC Government Services (UICGS / Bowhead) provides innovative business solutions to federal and commercial customers in the areas of engineering, maintenance services, information technology, program support, logistics/base support, and procurement. Collectively, the fast-growing Bowhead Family of Companies offers a breadth of services which are performed with a focus on quality results. Headquartered in Alexandria, VA, we are a fast-growing, multi-million-dollar corporation recognized as one of the top 25 8(a) companies for government contracting. ^ Cut/Paste this Link to Apply:*******************************************************************************Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.Please view Equal Employment Opportunity Posters provided by OFCCP here.The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)"}