{"jobID": "1930496857", "jobLocation": "Cranbury_NJ", "jobTitle": "Scientist IV", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "RESPONSIBILITIESPerform routine testing to support manufacturing and stability. Analyze in-process control samples, drug substances, drug products using UV/Vis, CE-SDS, icIEF, SEC HPLC, SEC HPLC, CEX HPLC, Protein A HPLC, qPCR, potency, ELISA and compendial assays.Operate the instruments and interpret analytical data using Empower, Agilent, 32 Karat, SoftMax Pro, etc.Perform method qualification and validation activities. Write qualification and validation protocols and associated reports.Write and revise test methods and SOPs.Provide investigative analysis for nonconformance results.Perform timely peer review of analytical results.Assist in training junior analyst to perform assays.Provide compliance support for corrective actions preventive actions (CAPA) and Change Control.Contribute to departmental activities such as safety inspections and internal audits.Help troubleshoot and investigate analytical instrumentation and equipment issues.Contribute to continuous improvement initiativesParticipate in maintaining inspection readiness.Calibrates and maintains lab equipment.Performs other duties as assigned.REQUIREMENTSBS/MS in Chemistry/Biochemistry or related field.Minimum of 10 years Quality Control laboratory experience in a pharmaceutical or biopharmaceutical industry.Desirable to have experience with protein molecules, such as monoclonal antibodies.Demonstrated knowledge and experience with HPLC and UPLC techniques.Hands-on experience with potency and ELISA assays for Host Cell Protein, residual DNA and Protein A desirable.Familiarity with cGMP requirements. Knowledgeable of USP, Ph. Eur. requirements for compendial testing.Demonstrated experience with performing method validation according to regulatory guidelines."}