{"jobID": "2809784178", "jobLocation": "N_o_n_e", "jobTitle": "Senior Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.maximus.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1975", "Type": " Company - Public (MMS) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " *This is a remote position that requires working from a home office; candidates may be located anywhere in the US.  MAXIMUS is looking for a Senior Data Scientist to develop and lead efforts in operationalizing data science in support of government service operations and create data-driven products that help our customers improve their program performance and have measurable impacts on the lives of the beneficiaries we service. This role will provide insight into leading analytic practices, design and lead iterative development cycles, and produce new and creative analytic solutions that will become part of our core product capabilities. In this role you will work with cross-functional team members to identify and prioritize actionable, high-impact insights across a variety of business processes. You will lead the application of analytics initiatives, including the research, design, implementation and validation of machine learning and predictive algorithms to analyze program performance and improve operational processes. In addition, the role will participate in other continuous process improvement activities, help in managing projects, and execute ad-hoc requests. The position is expected to travel up to 50% of their time. International travel is possible. Selecting features, building and optimizing classifiers using machine learning techniquesData mining using state-of-the-art methodsIdentify appropriate decision technology techniques to apply to relevant analytic frameworks. Examples of decision technology tools that may be used include optimization, simulation, regression, decision trees, neural networks, cluster analysis, mixed models, etc.Creating automated anomaly detection systems and tracking of model performanceApply appropriate statistical analysis and quantitative methods to analyze data and predict future trends and variability especially in producing and maintaining reliable forecastsIntegrate and use simulation and optimization technologies and tools for both process design and ongoing operational decision support especially in the area of staffing optimizationExtending company’s data with third party sources of information when neededEnhancing data collection procedures to include information that is relevant for building analytic systemsProcessing, cleansing, and verifying the integrity of data used for analysisDoing ad-hoc analysis and presenting results in a clear mannerSetup and lead meetings to gather business requirements.Identify and catalog strengths and weakness of respective data sources, noting areas of questionable data that could sidetrack analytic output.Have a clear understanding of and ability to communicate the uses and limitations of statistical applications.Ability to balance accuracy of analysis with needs for rapid response.Possess a proven ability to develop partnerships with technical peers and business partners.Perform other duties as assigned.BS, MS (preferred), or PhD in Statistics, Mathematics, Operations Research, Computer Science, Machine Learning or a related field.5+ years of experience in data analysis with heavy emphasis on data-driven decision making.Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.Experience with common data science toolkits, such as R, Weka, Python/NumPy, MatLab, etc Excellence in at least one of these is highly desirableExperience with data visualization tools, such as D3.js, GGplot, etcGood applied statistics skills, such as distributions, statistical testing, regression, etc.Proficiency in using query languages such as SQL and expert use of relational databases and SQLExperience working with large data sets, experience working with (not architecture design of) distributed computing tools a plus (Map/Reduce, Hadoop, Hive, etc.)Experience working directly with business users to gather requirementsAbility to work independently with minimal supervision or work cooperatively in a technical team as required.Must possess superior oral and written communication skills.A strong passion for empirical research and for answering complex questions with data.Experience with government sponsored health care programs and operations desirable. Active military service members, their spouses, and veteran candidates often embody the core competencies MAXIMUS deems essential, and bring a resiliency and dependability that greatly enhances our workforce. We recognize your unique skills and experiences, and want to provide you with a career path that allows you to continue making a difference for our country. Were proud of our connections to organizations dedicated to serving veterans and their families. If you are transitioning from military to civilian life, have prior service, are a retired veteran or a member of the National Guard or Reserves, or a spouse of an active military service member, we have challenging and rewarding career opportunities available for you.  A committed and diverse workforce is our most important resource.  MAXIMUS is an Affirmative Action/Equal Opportunity Employer.  MAXIMUS provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disabled status. "}