{"jobID": "2817655738", "jobLocation": "Kenilworth_NJ", "jobTitle": "Associate Principal Scientist, Early ADME", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Associate Principal Scientist, Early ADME - RES******  Description  Merck Research Laboratories South San Francisco, a wholly owned subsidiary of Merck and Co., is focused on driving discovery research. Our new multi-disciplinary discovery research site offers state-of- the-art resources to explore the most promising science combined with Merck's world-class R & D expertise in small molecules and biologics. Located within the heart of the Bay area's biomedical community, research conducted in our new laboratories spans exploratory biology through early clinical development and is an integral part of Merck's powerful world-class network of drug and vaccine discovery.  At Merck, we are inspired by the belief that a research-driven enterprise dedicated to scientific excellence can create medicines and vaccines that save and improve lives. Every employee is building on our proud legacy of scientific breakthrough. Our ability to impact the lives of patients worldwide depends on the integrity, creativity, humility and scientific acumen of our team. We are creating a diverse organization that is inspired by invention and founded on a culture of respect and collaboration. At Merck Research Labs South San Francisco, you'll have the opportunity to expand your knowledge and skills through collaboration with talented and dedicated colleagues while advancing your career.  This position will support Merck's drug discovery efforts in the Department of Pharmacokinetics, Pharmacodynamics and Drug Metabolism (PPDM) and specifically within the Early Absorption, Distribution, Metabolism and Excretion (eADME) group where the scientific focus is aimed at leveraging in silico, in vitro and in vivo tools to rapidly progress compounds primarily in discovery.  Responsibilities include and are not limited to the following: Design and execute studies utilizing in silico, in vitro and in vivo approaches to predict, understand, and optimize ADME properties of our therapeutics entering developmentPerform computational experiments and data analyses that accelerate the discovery of high-quality drug candidates, in close collaboration with chemists, biologists and other project scientistsContribute to the application of in silico approaches to inform decision making and compound follow up related to the characterization of metabolism, transporter interactions, exposure-response relationships and variability. Work with other computational chemists and cheminformaticians to discover new computational methodology, create workflows and share successful methods for novel ADME applicationsRepresent PPDM and ADME on Discovery Teams throughout all stages of discovery to build key structure-property relationships across multiple drug modalities and present analyses to teams and to senior managementMust excel in a team environment, where they will also collaborate with development functions (chemistry, modeling and informatics, pharmaceutics, and toxicology) in order to prepare early data sets that can be translated to early clinical developmentExpected to effectively present their work at team meetings as well as promote Merck science through publications and presentations/lecturesThis position reports to the eADME Team Lead based at our Kenilworth, NJ site with a dotted line into the local ADME manager in South San Francisco.QualificationsEducation and Work Experience Requirements:Bachelor's degree with a minimum of (12) years Industry experienceMaster's degree with minimum of (8) years Industry experiencePhD with a minimum of (4) years Industry experience in a Pharmaceutical Preclinical Development or Discovery organizationRequired Experience:Strong leadership, interpersonal, communication, problem solving, and collaboration skills along with strengths in delivering results on firm deadlines in support of discovery/early development programs.Experience of providing ADME support to drug discovery teams and guiding the optimization of small molecule therapeutics towards development candidates.Preferred Experience:Ability to implement and apply approaches to multi-parameter optimization that use molecular design strategies to include biological activity, physicochemical and ADME attributes.Experience in the prediction of one or more aspects of human pharmacokinetics and/or safety related endpoints as it relates to human therapeutics.Experience in establishing Pharmacokinetic-Pharmacodynamic/Efficacy relationships using modeling softwareExperience in collaborating on multidisciplinary project teams that span cardio-renal, metabolic, and/or ophthalmic areasDemonstrated recognition in the field, creativity and innovation via a strong publication/presentation record. The quality of our team is essential to our success. We are creating a new and innovative approach to rewarding our employees and establishing a comprehensive value proposition. Our competitive compensation program and benefits are designed to support the wide range of goals, needs and lifestyles of our employees, and the people that matter the most in their lives. If you need an accommodation for the application process please email us at .  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. Today, we are building a new kind of healthcare company - one that is ready to help create a healthier future for us all.  Job Research Science  Primary Location  Other Locations Regular  Employee Status No  Number Of Openings"}