{"jobID": "2821581606", "jobLocation": "Chicago_IL", "jobTitle": "Clinical Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.uchicago.edu", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1890", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Department******* BSD - Center for Research Informatics  About the UnitSince 2011, the Center for Research Informatics (CRI) has advanced the forefront of biomedical and biological sciences at the University of Chicago and beyond. Our 35+ member staff has expertise in clinical data analytics, machine learning, natural language processing, software engineering, and genomic analysis. Recent projects have included designing predictive models of adverse clinical events, developing a clinical trials management software system, and creating custom genomics pipelines. Our team built and now manages one of the largest research-based clinical data warehouses in the country, along with an infrastructure environment that supports high performance computing, compliant storage, and virtualization. In addition to working on world-class research at UChicago, we collaborate on major multi-institutional projects that are changing the face of healthcare and data science. Our work also extends into the private sector, where we support both mature and start-up firms with expert consulting on clinical and genomic data analysis.  Job Information Job Summary: We are looking for a highly motivated Clinical Data Analyst to join our growing research team currently constructing a Pediatric Cancer Data Commons (PCDC) at the University of Chicago. The PCDC is transforming research in childhood oncology by creating a single platform of harmonized clinical data that will serve as a global resource for medical investigators. The Clinical Data Analyst will play a key role on defining the ontologies of the PCDC and working with CRI software engineers to develop the data model.  This position is funded for 11 months and will terminate at the end of this period. Responsibilities:Assist PCDC developers and clinicians in harmonizing extant clinical trials dataAssist PCDC developers and clinicians in mapping these harmonized data to standard biomedical ontologies (e.g. SNOMED CT, NCIT, etc.)Provide clinical subject matter expertise to PCDC developers as they design and implement a data model for prospective collection and aggregation of clinical trials data for secondary re-useWork with owners of biomedical ontologies (e.g. SNOMED CT, NCIT, etc.) to extend these when necessary to accommodate new concepts or mappings.Competencies:Knowledge of biomedical ontologies (SNOMED CT, NCIT, etc).Understanding of clincial trials data.Ability to translate medical knowledge into technical requirements for software developers. Additional Requirements Education and Experience:Education:B.S. in Biological Sciences requiredPh.D. or M.D. preferredExperience:Minimum 2 years working with biomedical ontologies, clinical trials or similar settings.Required Documents:Cover LetterResumeNOTE: When applying, all required documents MUST be uploaded under the  Resume/CV  section of the application  Benefit EligibilityYes  Pay Frequency  Pay Range  Depends on Qualification  Scheduled Weekly Hours37.5  UnionNon-Union  Job is Exempt?No  Drug Test Required?No  Does this position require incumbent to operate a vehicle on the job?No  Health Screen Required?No  Posting Date2018-06-18-07:00  Remove from Posting On or Before2018-12-18-08:00 Posting Statement: The University of Chicago is an Affirmative Action/Equal Opportunity/Disabled/Veterans Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, age, status as an individual with a disability, protected veteran status, genetic information, or other protected classes under the law. For additional information please see the University's Notice of Nondiscrimination.  Staff Job seekers in need of a reasonable accommodation to complete the application process should call ************ or submit a request via Applicant Inquiry Form.  The University of Chicago's Annual Security & Fire Safety Report (Report) provides information about University offices and programs that provide safety support, crime and fire statistics, emergency response and communications plans, and other policies and information. The Report can be accessed online at: *********************************** Paper copies of the Report are available, upon request, from the University of Chicago Police Department, 850 E. 61st Street, Chicago, IL 60637."}