{"jobID": "2778842628", "jobLocation": "McLean_VA", "jobTitle": "People Advisory Services – Analytics – Data Scientist - Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.ey.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $10+ billion (USD) per year", "Competitors": " Deloitte, KPMG, PwC"}, "estimatedSalary": "121000", "jobDescription": ".Managing global workforces is increasingly complex. People Advisory Services (PAS) builds and improves organizational and individual performance, delivering a highly complex and challenging mission, especially in an ever changing working environment. As a member of one the PAS pillars you’ll be part of a team with a wide variety of experiences and a supportive environment. When you join us you will gain unique experiences and valuable knowledge working across capabilities, sectors and geographies and have the opportunity to take your career in the direction you want.The opportunityAnalytics is revolutionizing many areas of business and the management of people is no exception. EY’s People Advisory Services (PAS) Analytics leverages the most advanced modeling tools to help our clients identify the drivers of key workforce processes. Specific examples of work include: predicting which potential employees are most likely to succeed, identifying the most effective interventions to retain high performers, ensuring pay equity for all demographics, and developing custom analytic solutions for unique client challenges.Your key responsibilitiesYou will have the opportunity to apply and develop your most advanced skills every day and play an important role in helping us to develop new services and reinvent existing services with embedded analytics. You will also have the opportunity to influence business strategy and interact with senior executives, both internally and externally.Skills and attributes for successAbility to develop new analytic tools to transform workforce management practices and sharpen existing consulting tools with advanced analytic techniques Have a passion for data analysis and a willingness to learn and share knowledge Ensure our analytic work is rigorous, accurate, and serves our clients well Work independently, show a willingness to take the initiative, and be comfortable sharing your knowledge with the team Have an entrepreneurial spirit, a strong work ethic, and a passion for data.To qualify for the role you must haveA Master’s degree in analytics, economics, statistics, operations research, computer science, or related field and around six to ten years of experience. Strong quantitative and qualitative skills and analytical expertise Ability to work in a fast-paced, dynamic environment A passion for communicating analytical insights graphically The ability to quickly learn new technical tools, and share your knowledge Proficiency with at least one of the following: R, Stata, Python, Tableau, SQL/SSIS Experience with the following is a plus Analysis of unstructured text data, Social network analysis, GIS analysisIdeally, you’ll also haveThe ability to play key part of a nimble, high-energy team while launching products with the support and resources of a global organizationWhat we look forWe’re interested in professionals with the drive to take on new responsibilities and projects. You’ll need the confidence to speak up with your own creative thoughts on a wide range of areas. You’ll also have the opportunity to achieve your potential by being given professional development and experiences with clients across geographies. If you’re keen to play a pivotal role within a highly focused expat tax team, this role is for you.What working at EY offersWe offer a competitive compensation package where you’ll be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, both pension and 401(k) plans, a minimum of 22 days of vacation plus ten observed holidays and three paid personal days, and a range of programs and benefits designed to support your physical, financial and social well-being. Plus, we offer:Support, coaching and feedback from some of the most engaging colleagues in the industry Opportunities to develop new skills and progress your career The freedom and flexibility to handle your role in a way that’s right for youAbout EYAs a global leader in assurance, tax, transaction and advisory services, we’re using the finance products, expertise and systems we’ve developed to build a better working world. That starts with a culture that believes in giving you the training, opportunities and creative freedom to make things better. Whenever you join, however long you stay, the exceptional EY experience lasts a lifetime. And with a commitment to hiring and developing the most passionate people, we’ll make our ambition to be the best employer by 2020 a reality.If you can confidently demonstrate that you meet the criteria above, please contact us as soon as possible.Join us in building a better working world. Apply now.EY, an equal employment opportunity employer (Females/Minorities/Protected Veterans/Disabled), values the diversity of our workforce and the knowledge of our people."}