{"jobID": "2833944217", "jobLocation": "Zeeland_MI", "jobTitle": "Financial Project Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.odl.com", "Headquarters": "Zeeland, MI", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " It’s fun to work in a company where people truly BELIEVE in what they are doing! We’re committed to bringing passion and customer focus to the business. Position Overview: The role of the Financial Project Manager is to support project teams with financial projections and analysis that help facilitate profitable financial decisions or improvements in both pre-production and production phases of the business. This includes responsibility for planning, costing, and financial reporting. Essential Job Functions:Manage all financial aspects of assigned projects throughout lifecycleLead project team in all financial aspectsEvaluate engineering changes for cost, price, and capital impactPrepare and report on project financial metrics as needed (Sales growth, Income before tax, ROA%, Payback)Sales price and manufacturing cost tracking to latest engineering levelsReview capital appropriation requests and capital purchase ordersMaintain costed BOM and cash flows for launch programsManage tooling costUnderstand a variety of manufacturing processes and related costsChampion achievement of financial commitmentsConduct make vs buy analysis and other special studies or financial scenario analysis as neededAttend weekly project meeting with entire project team. Call and lead meetings when required.Develop project expense budgetsAssist in preparation of forecasts and annual budget.Create, develop, and implement new procedures and processes to achieve efficiency gains within the department.Other duties as requiredCandidate Requirements:Bachelor’s degree in Accounting or Engineering. MBA and/or CPA/CMA certification preferred.Minimum 5 years’ experience.Computer skills and experience with database programs such as Oracle, plus proficiency in Microsoft Office, especially Excel, Powerpoint.Strong finance skills and familiarity with business case preparation – financial metrics.Demonstrate ability to lead and manage complex projects and programs. Must be able to research and recommend new programs, coordinate necessary resources for programs/projects, and manage timing and implementation.Strong leadership ability including communication, communication, and negotiation skills to interact and influence various functions of the organization. Must be able to quickly identify risks, evaluate exposure, and plan appropriate action.Treat all information in a confidential and professional manner. Proposed new Job description for Financial project manager Eric.docProposed new Job description for Financial project manager Eric.doc"}