{"jobID": "2827274253", "jobLocation": "Hopewell_NJ", "jobTitle": "Principal Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "143000", "jobDescription": " As a Principal Scientist within Mechanistic Pharmacology in Leads Discovery and Optimization at Bristol-Myers Squibb Company, the successful candidate will be trained and skilled in enzymology as it relates to discovery of novel enzyme inhibitors. They will be responsible for leading a team of scientists to drive the design, execution, and interpretation of assays probing enzyme activity and important mechanistic and kinetic questions in support of our drug discovery programs across therapeutic areas. The ideal candidate will be an enthusiastic, self-starter with in-depth knowledge and a demonstrated publication record in relation to enzyme kinetics, mechanisms of inhibition and enzyme assay platforms. As a member of the organization, the person will be expected to collaborate closely with existing team members as well as actively collaborate with chemists and biologists within relevant therapeutic areas in order to support and provide insight for a robust enzyme inhibitor drug discovery portfolio. Therefore, strong inter-personal, oral and written communication skills are a must.  Qualifications:  * PhD, plus relevant postdoctoral work and 10+ year’s of industry experience in enzymology, enzyme kinetic and drug discovery research  * Design and execution of de novo assays to explore kinetics and mechanism of action of enzyme inhibitors  * Tangible experience with cutting-edge assay design techniques for interpreting classes of enzyme inhibitors  * Familiarity with common assay platforms and approaches such as stop-flow and mass spectrometry  * Highly skilled in troubleshooting experimental design with the ability to effectively organize, analyze and depict data using common software packages  * Demonstrated ability to innovate in order to create new ways of studying enzymes in a HT manner  * Ability to learn quickly and work closely with others in a team environment"}