{"jobID": "2815727172", "jobLocation": "Southfield_MI", "jobTitle": "Data Analytics Manager", "companyRating": "3.7", "companyInfo": {"Website": "www.p3-group.com", "Headquarters": "Southfield, MI", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " Are you someone who enjoys designing, developing and implementing business intelligence solutions, then look no further than P3! As a global consulting, management and engineering services company, we develop and implement innovative solutions to today’s complex technology challenges and industry changes that help our clients succeed at every stage.  As a Data Analytics Manager, you will work closely with our data engineers to help our customers solve complex problems by analyzing terabytes of data. By taking initiative, you will help drive technical prototypes and proofs of concept. This will include understanding current client needs, identifying solutions, organizing a strategy around customer outcomes and delivering value back to our clients. A Day in the Life:Conduct business development in the areas of data analytics and business intelligenceJointly define data solutions with stakeholders by providing support and developing project/solution proposalsManage the global data delivery team for data visualization, processing and advanced analytics related to projects working with terabytes of dataAssist data engineers in defining and implementing business use cases for new servicesCollaborate with P3’s executive team to develop data practice competencies and growth strategiesWhat You Have:Master’s Degree in Computer Science, Engineering, Mathematics, or a related field is preferred8+ years of Data Analytics or IT implementation project experience is required4+ years of experience using data platforms such as cloud and “on-prem” solutionsExperience with all data analytics (SAS, Hadoop, SPSS, SQL, Python and R), visualization (Tableau, Power BI, Qlikview, etc.) and ETL solutions/software (SQL, RDBMS, Cloudera, Mongo DB, etc.)2+ years managing a Data Analytics Team or IT project is requiredPrevious business related or business development experienceAutomotive industry experience is a mustStrong communication skills with the ability to initiate high level discussions with the clientWhat you might also need:(optional/if applicable) Preferably automotive IoT architecture and solution experienceDisplays an entrepreneurial mindset and has the ability to work independently or within a teamDemonstrates the ability to think critically and understand complex processes"}