{"jobID": "2821125568", "jobLocation": "San_Francisco_CA", "jobTitle": "Brand Asset Manager", "companyRating": "4.5", "companyInfo": {"Website": "www.maximusrepartners.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Greystar, The Related Companies, Alliance Residential"}, "estimatedSalary": "123000", "jobDescription": " Brand Asset Manager The Brand Asset Manager is the primary steward of Maximus property brand(s) and their attractiveness to both future and current residents, including driving demand and enhancing the resident experience. S/he will work with the extended marketing, operations and sales teams to support the goals for the property, including traffic, sales, community building and resident retention.Responsibilities/Essential Job Duties Drive the customer acquisition and retention strategy for select Maximus properties.Oversee and track results of demand generation programs.Manage the creative execution of marketing materials.Lead the onsite brand experience by managing application of the brand identity to elements of the property, from physical signage to written and printed pieces.Work with Operations and extended marketing team on resident events.Work with the Digital Team on website developments, updates, and management including design and content updates, SEO optimization, and SEM strategy, budget and monthly goals.Participate in asset meetings at each property, representing the Marketing Department.Work with the social media team on advertising, reputation management, etc.Report back to management on marketing performance.May require some weekend work as needed.QualificationsProven success with demand generation and customer experience marketing.Strong communication, organizational, and problem-solving skills.Creative, out of the box thinker.Analytical and results orientedKnowledge of Microsoft Office including PowerPoint, Outlook, Word and Excel.Highly organized, self-starter -- project management experience a plus. Education and/or Experience Bachelor’s degree and 5+ years of experience.Previous marketing experience, property management marketing a plus."}