{"jobID": "2519561038", "jobLocation": "Palo_Alto_CA", "jobTitle": "Sr. Data Scientist - Advanced Analytics", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "179000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. About the Data Science Driver Team The Driver team at Uber is focused on accelerating driver growth, engagement, and retention across 300+ cities worldwide. Data Scientists on Driver play a central role in guiding product development and strategy through the discovery of insights from data. In this position, you will offer a data-driven perspective and work closely with product, engineering, and marketing. You will be on the forefront of analysis and leverage our data sources to propose new ideas related to every area of our product, including developing predictive models of driver behavior, studying market balance and developing a growth model in the context of a two-sided market, and creating experiment designs for product changes with difficult constraints (e.g. extensive product network effects). Our team's autonomy gives us the flexibility to focus on the highest-impact projects in this adaptive and challenging role as we bring increasing numbers of riders and drivers onto the Uber platform. What you could be doing:Leverage data to perform intensive analysis across all areas of our business to catalyze product developmentDesign experiments and interpret the results to draw detailed and actionable conclusionsBuild cutting-edge machine learning models to make our product intelligent (NLP, OCR, neural network, etc)Generate and execute on ideas for exploratory analysis to shape future projects and provide recommendations for actionsPerform time-series analyses, hypothesis testing, and causal analyses to statistically assess relative impact and extract trendsCreate models to enhance understanding of user behavior and predict future performance of cohortsCreate dashboards and reports to regularly communicate results and monitor key metricsPresent findings to senior management to guide business decisionsCollaborate with cross-functional teams across disciplines such as product, engineering, operations, and marketing Here are the skills we're looking for:At least 4 years of experience in quantitative analysis experience (preferably in an engineering or product role).Superb quantitative background in a quantitative domain such as Computer Science, Machine Learning, Operations Research, Statistics, or similar.Experience with common analysis tools - SQL, R, and Python.Demonstrable proficiency in coding, programming concepts, and technical tools with analysis combined with the enthusiasm and passion to build.A product mindset - you ask and address the most important analytical questions with a view on enhancing product impact.Passionate and attentive self-starters, great communicators, amazing follow-through - you are entrepreneurial and love the responsibility of being personally empowered."}