{"jobID": "2783314821", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.castlighthealth.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (CSLT) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "181000", "jobDescription": " We’re hiring data scientists for a team of data scientists and engineers to take on difficult problems in navigating benefits and in health and wellness outcomes. We are a team that is focused on personalizing the user experience across our health benefits platform and optimizing users' health and wellness outcomes. This team has already leveraged data science and machine learning techniques to build critical, revenue-driving products for the business. We are actively engaged in bringing research prototypes into production, performing basic research on new initiatives, and developing multiple new products.You will work with other data scientists on an unparalleled set of healthcare data and data from other sources, such as wearables. Using this data, you will contribute to research to enhance and personalize existing products and to develop new products. You will also work closely with data and infrastructure engineers as well as other product teams (e.g. user experience, search) to develop stable, scalable production systems to deliver machine learning driven products to our users.The ideal candidate will be an entrepreneurial, motivated data scientist who is eager to learn new things and make an impact on the industry. Health data experience is a plus, but it's not necessary - the team includes clinical experts who can supply the necessary medical background. You should be interested in solving very tough problems and pragmatic enough to figure out what can be solved now and what should be saved for later.  Minimum Qualifications: BS in a relevant field such as Computer Science, Mathematics, Physics or Engineering (MS or PhD preferred)5+ years of experience in a data science role engaged in all aspects of work to bring insights to production: exploratory analysis and reporting, feature engineering, developing machine learning models and continuously evaluating their performance for the purposes of tuning and enhancementAbility to perform independent research and analysis of complex data sets and communicate insights derived from this research to other stakeholdersSome programming and/or software engineering experienceExperience with SQL Additional Qualifications Experience working with health care (e.g. claims) data, especially in HIPAA environmentsExperience with Python scientific and machine learning libraries Scikit-Learn, NumPy, PandasExperience with distributed PostgreSQL databasesCreativity and a startup mindset - we look to our data scientists to independently generate important new product and feature ideasComfortable in a Unix environmentExperience working in an agile environment"}