{"jobID": "2776356172", "jobLocation": "Emeryville_CA", "jobTitle": "Junior Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.zaplabs.com", "Headquarters": "Emeryville, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " Junior Data Analyst  14-May-2018 Auto req ID165BRJob descriptionJob Title: Junior Data Analyst  At ZapLabs, we work to build and improve a platform that helps real estate professionals work effectively, and helps delight home buyers and sellers with an excellent experience. We do that by combining great technology with great people-and we're looking for a Junior Data Analyst to join our team. What we're looking for: You're a self-proclaimed data geek with killer quantitative skills and some experience in data analysis, and you're looking to apply those skills with ZapLabs' data team. You're excited about working closely with ZapLabs' data scientists, product managers, engineers, and senior leadership to provide insights and analyses that drive product strategy, innovation, and adoption of our products. Fast-paced environments, details, and a deluge of data all sound like your cup of tea. What you'll do: You'll acquire, clean, and structure data from multiple sources, including Google Analytics, AdWords, and internal databases, and analyze data to discover and interpret trends, patterns, and relationships. You'll monitor and evaluate our search marketing (including SEO and SEM) performance and identify opportunities. Working across departments, you'll help us ensure data quality and present data in a way that makes it easy to communicate among different groups. You'll also help the team with ad hoc data requests-and you'll learn something new every day. Skills, accomplishments, & interests you should have:Bachelor's degree in Mathematics, Statistics, Computer Science, Engineering, or other quantitative field from a top educational institution1-3 years of relevant experience preferred; equivalent combination of education and experience will be consideredExperience with Google Analytics and SQLHighly analytical and quantitative, with strong attention to detailSelf-starter with excellent written and verbal communication as well as interpersonal skillsAbility to thrive in a fast-paced, ambiguous, interruptive environmentAbility to work independently as well as work collaboratively toward a common goalNice to haves:Advanced computer and modeling skills, with high proficiency in Excel modeling, data mining, Python, and scenario analysis We’re always looking for folks to join our culture of passionate hobbyists! We have a tendency to nerd out on everything from LOTR and Star Wars to competitive baking to our company soccer team, the Lab Rats. #LI-MW1#HTF1External Title Junior Data Analyst Company ZapLabs LLC Employment type Full-time About us ZapLabs LLC (www.zaplabs.com) is the innovation and technology hub for Realogy, and the driving force behind inventive technology for brokers and agents affiliated with Realogy s world-renowned real estate brands. ZapLabs delivers its highly effective consumer, sales associate and broker solutions in support of Realogy s leading franchise brands and is positioned to expand the scope of its technology development efforts to encompass Realogy s other business segments, including residential brokerage, relocation and settlement services. ZapLabs is headquartered in Emeryville, California. EEO statement EOE AA M/F/Vet/Disability State/Province/Region California City Emeryville "}