{"jobID": "2822744957", "jobLocation": "Wood_Dale_IL", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.parkerlynch.com", "Headquarters": "Jacksonville, FL", "Size": "501 to 1000 employees", "Founded": " 1992", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analyst position in Wood dale, IL.  Perm Position  Fortune 500 Company  One of our top clients is seeking to add a Data Analyst to their team. This person will report directly to the director of Management of Global reporting. This person will need to extract and interpret data to answer ambiguous questions working directly with personnel across the network, Utilize SQL to analyze data sets and generate insights and give initiatives. This person will need to be expert in SQL, Microsoft excel, ideally someone who has experience using various reporting and analytical tools such as Tableau. They offer a competitive compensation package around 70K in base and excellent benefits including medical, dental, and vision insurance, paid holidays and vacation, disability insurance, life insurance, 401K with company match, profit sharing, Employee Stock Purchase Plan, and the opportunity to prosper in a growing Fortune 500 company. If this position is something of interest please email me your most up to date resume and the best time to connect to [Click Here to Email Your Resumé]  Key job functions include, but are not limited to, the following: Collaborating with key internal and external stakeholders to gather and analyze needs and requirements to design and implement robust analytic solutionsAccessing data, constructing and manipulating large datasets to support planned analyses, using SAS, SQL, and similar tools;Assist in developing, testing predictive modelsCollaborate with other analyticConstructing and delivering written reports of the analytic findings in a variety of formatsApplying creativity in developing analytic solutions based on available data sources, and in representing analytic findings in reports, tools, and other media to support most effective translation and application of internal and external customers; •Managing complex projects related to a wide variety of financial, utilization, and operational business needs.Required Qualifications:To be considered for this exciting analytical opportunity,candidates will need to have a minimum of 1+ year of professional experience in analysis/ SQL at a company (not on your own)Bachelor degree in finance or related degreeData access and manipulationretrieving data from large databases with SQL If you are interested in applying for this Data Financial Analyst opportunity, please email your resume in a word document to Sterling Bokos at [Click Here to Email Your Resumé]"}