{"jobID": "2822137015", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Analyst - Corporate - JSEC/ Operations", "companyRating": "3.5", "companyInfo": {"Website": "www.jefferies.com", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1962", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "79000", "jobDescription": " Jefferies, the global investment banking firm focused on serving clients for over 50 years, is a leader in providing insight, expertise and execution to investors, companies and governments. The firm provides a full range of investment banking, sales, trading, research and strategy across the spectrum of equities, fixed income, foreign exchange, futures and commodities, and also select asset and wealth management strategies, in the Americas, Europe and Asia. Jefferies Group LLC is a wholly-owned subsidiary of Leucadia National Corporation (NYSE: LUK), a diversified holding company. Group: The Jefferies Security Master (JSEC) team oversees the firm’s internal security master reference database that utilizes multiple internal and external reference data sources. The core services provided by JSEC security master database include providing internal uniform product classification for all securities of interest including OTC and exchange traded derivatives, providing horizontal and vertical product identifiers cross references for securities of interest and providing security attributes. Daily internal data quality governance process has been established and has been critical part of daily responsibilities of its members (What does this mean?). Regular facetime with corporate business users is expected and required. As part of this process, team monitors on global basis various users reports that utilize JSEC security master data. Team members as part of that process are interacting with various business users and address any exceptions that are JSEC security master related. In addition, the team is involved in price validation process for customer held positions and it monitors security set up exceptions in the internal settlement systems to accommodate STP trade processing.Primary Responsibilities: Perform data governance functions, that will include monitoring and resolving of any internal JSEC exceptions. Conduct attribute validation checks against external data sources for securities of interest. Perform cross reference data validations and reconciliations for various reports used by corporate users. Perform data analysis and testing for any new projects involving any new data sources or new data services. Run ad hoc queries for various corporate uses.Required Background: 2-4 years of relevant experience with financial securities, preferably security reference data exposure. Knowledgeable in MS Excel, PowerPoint, Bloomberg terminal functions. SQL language a plus."}