{"jobID": "2829531302", "jobLocation": "San_Clemente_CA", "jobTitle": "Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.stance.com", "Headquarters": "San Clemente, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " We exist to celebrate human originality.  Our goal is to create a culture where smart, ambitious, and positive people can thrive. We value our community and want to improve our local schools, neighborhoods, and businesses. People are the most important element of our business. Our actions, words, and relationships represent what we believe and what we value. Since culture is the collective nature of the people working at Stance, we place a premium on the environment that fosters freedom and accountability across both individual and community levels.  Entrepreneurship  Creativity  Performance  Personal Responsibility  Gratitude  These are the values we place above all others. We seek out individuals whose personal constitution of values overlaps with ours. We believe in living these values will bond our teams and create a company culture that our competitors can never duplicate. As a result, we hire and promote the individuals who get results in a way that aligns with our five core company values. Summary of the Stance Data Analyst: Stance has an immediate opportunity for a skilled and experienced Data Analyst to provide thought leadership in measurement and analysis for digital marketing, e-commerce, and optimization efforts. This person would be directly responsible for analyzing and reporting on large datasets to uncover insights about our customers to help Stance make informed marketing decisions.  This position reports directly to the Manager of E-Commerce Marketing.As a Stance Data Analyst, you will:Work with e-commerce marketing team and additional stakeholders to analyze data and report on findings from customer database platform (Amazon Redshift) and Domo (data visualization tool)Deliver customer analytics and reports including but not limited to: customer segmentation, lifetime value, repeat purchase, churn, cumulative revenue, and misc. acquisition and retention metrics related to the customer, product, or marketing channelAnalyze data from multiple sources (online and offline data) from marketing campaigns (emails, paid social, loyalty, and other digital marketing efforts): response rates, web site conversions, multi-touch attribution, incremental sales revenue increases, ROI, etc. which relates to the customerDirectly querying Redshift database to create data visualizations of reports and findings in DomoGenerates daily, monthly, and quarterly reports from multiple sources to assist parties in analysis and marketing effectivenessWorking closely with many cross-functional teams to educate on our customer based on data and insights from analysisUtilizing customer data to fuel/drive real-estate locations and decision-makingMay be involved in projects related to product assortment and demand planning decision-making in the future as the role evolvesWe are looking for someone with the following skills and qualifications:Bachelor’s degree in marketing, statistics, business, or related fieldMinimum 3+ years of experience working with data or marketing analyticsStrong proficiency in working within Excel with large data sets, using a data visualization tool like Domo a plus.Experience in data mining and complex data analysis highly preferredExperience with Google Analytics and other web analytics tools preferredKnowledge of SQL and ability to write SQL queries is highly preferred; additional statistical modeling experience a plusExperience with CRM or Email marketing platforms is a plusExperience working in a marketing automation platform preferredExperience with customer data and analytics, including development of insights in customer behavior, loyalty, etc.Independent worker with a self-starter attitude and initiative"}