{"jobID": "2818959149", "jobLocation": "Irving_TX", "jobTitle": "RCM Data Analyst", "companyRating": "2.4", "companyInfo": {"Website": "www.miracalifesciences.com", "Headquarters": "Irving, TX", "Size": "1001 to 5000 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " The Healthcare Data Analyst supports our Revenue Cycle Management (RCM) department. The successful Healthcare Data Analyst will be articulate, analytical, and a team player who understands the power of data in healthcare settings. The analyst enjoys coordinating with interdisciplinary teams to create solutions for quality and process improvement. S/he learns quickly, works independently, and is relentless in overcoming technical, process, and organizational obstacles. Responsible for empowering RCM users with data across the institution, providing a unique blend of clinical, technical, and analytical expertise. Work with multiple groups within the organization to improve quality, enhance decision making and streamline operations.Combine clinical process knowledge with technology to empower decision makers and believes that analytics and data can improve outcomes, optimize processes, and reduce costs.Act as an internal consultant for process improvement projects.Build relationships with key stakeholders, be an expert in multiple data sources, and implement sustainable solutions.Create innovative and appropriate data solutions and data analysis for the measurement of RCM processes.Elicit, gather, create and document business requirements.Develop and maintain financial and operational models metrics, KPIs, and other measurement tools.Retrieve and format data from multiple sources into useful toolsets.Contribute to projects and data requests from beginning to end.Monitor and track sub-processes and routines and interfaces to ensure efficient operations.Requirements:Bachelor's degree in Healthcare Information Systems, Computer Science, or related technical field; or 3 years of equivalent experience.Experience in healthcare financial analysis, revenue cycle processes, denials and cash applications strongly desired.Ability to demonstrate well developed and proven organizational, problem solving, analytical, customer service and oral and written communication skills.Ability to engage in multiple initiatives simultaneously while working in a dynamic environment subject to impromptu changes in schedules and priorities.Excellent verbal and written communication skills and the ability to interact professionally with a diverse group, executives, managers, and subject matter expertsIntermediate MS SQL queries/SSRS reports, including joining tables, CASE statements, and others.Advanced Microsoft Excel and Access skills, including pivot tables and charts.Experience with data analysis and data modeling to enable operational processes.Strong initiative - establish personal goals and take responsibility for meeting them within defined timelines.Proficient in other Microsoft Office applications, including Visio, Word, Outlook, PowerPoint, Project, and SharePoint. This job description reflects management's assignment of essential functions. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time.SDL2017"}