{"jobID": "2817056458", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.atterro.com", "Headquarters": "Minneapolis, MN", "Size": "1 to 50 employees", "Founded": " 1982", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kelly Services, Adecco, Aerotek"}, "estimatedSalary": null, "jobDescription": "Job TitleSr. Data AnalystJob ID3976LocationChicago, ILFull/Part TimeFull-TimeFavorite JobRegular/TemporaryRegularJob TitleSr. Data Analyst, Home Health CareCompany InformationAt Atterro’ we employ a group of Hire Thinking®, industry pioneers providing innovative workforce solutions for Automotive, Engineering, IT, Manufacturing, Professional and Supply Chain clients and candidates. Our award winning team is growing!Position SummaryThis position will drive strategy and enhanced value via impactful analytic insights, statistical analyses, data visualization and reporting related to Home Health Care (HHC) / Durable Medical Equipment on the Health Services Team.  The candidate selected for this position will lead the development and production of complex analytics and reporting suites that will guide how senior leaders view the business. The day-to-day experience of the role will vary – aligning key stakeholder and team leadership to analytical projects, developing and maintaining statistical models that monitor pharmacy and front store HHC sales, developing metrics and dashboards for field teams and senior leadership, and developing hypotheses and conducting analyses to identify, size, and monitor business growth opportunities.  The ideal candidate will have strong independent leadership skills, as well as analytical and communication skills. In addition, the individual must be able to independently interact with and influence a wide range of senior stakeholders and demonstrate a consistent track record of delivering results. The senior analyst will be responsible for developing materials for and making recommendations to senior leaders (VP and above).RequirementsBachelor’s Degree required; Major in Statistics, Computer Science, Economics, MIS or Mathematics or related field (or related experience) a plus.2+ years of data analysis experience, using SQL, SAS and/or other advanced analytic tools with strong knowledge and hands-on experience extracting and manipulating data2+ years of analyzing data and developing analytic tools, templates, reports, and financial/statistical models for senior leadership strongly preferredHigh level of independent judgment and initiative, and demonstrated ability to develop analysis plans and structure project work streamsAbility to communicate effectively in a manner that is clear, logical and consistentAbility to distill detailed analysis into higher level insights and takeaways for multiple levels of the business.Excellent interpersonal skills, including the ability to interact and influence at all levelsHighest level of attention to detail and the ability to manage multiple projects simultaneously, adjusting priorities as needed and meeting deadlinesResponsibilitiesConduct complex analysis using analytical and statistical tools such as SQL/SAS to identify, develop, and monitor growth opportunities. This includes developing and enhancing data algorithms and statistical models, working with data warehouse teams and outside vendors to capture data and create internal and external reporting and dashboards, conducting analytical deep dives on potential product and growth opportunities, and developing communication for store teams, field leadership and senior leaders.Brainstorming with your colleagues to build out a creative approach for a new problemBe able to prioritize, structure timelines and project plans, engage and align stakeholders across multiple groups, define measures of success, incorporate feedback and analyze results across multiple work streamsActively contribute to the generation of hypotheses and the articulation of conclusions that will enable the Health Services team to make critical business decisions.Prepare material that expresses concepts in a way that is easily understood by others who may not have the same background or expertise. Materials range from operational dashboards of key metrics to graphical views of key trends and PowerPoint presentations.Equal Employment OpportunityAdvantage Resourcing Americas, Inc. is an Equal Opportunity Employer offering employment without regard for race, color, religious creed, national origin, ancestry, gender, marital status, age, sexual orientation, sex, gender identity, disability, veteran status, or other legally protected categories. Advantage is a VEVRAA Federal Contractor."}