{"jobID": "2617340438", "jobLocation": "Houston_TX", "jobTitle": "Big Data Engineer, Senior Consultant (Chicago)", "companyRating": "3.6", "companyInfo": {"Website": "www.avanade.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Slalom, Cognizant Technology Solutions, Deloitte"}, "estimatedSalary": "95000", "jobDescription": " Big Data Engineering Sr Consultant / Manager is a member of the delivery team. This role leads architecture, design and implementation of projects focused on collecting, aggregating, storing, reconciling and making data accessible from disparate sources to enable analysis and decision making. Big Data engineers and architects are a critical part of the data supply chain, ensuring stakeholders can access, manipulate data for routine and ad hoc analytics. This role leads analytics team for creation of big data and analytics solutions, spanning full lifecycle of data from ingesting through analytics to action. Manages the planning and delivery of bid data platforms and solutions by leveraging Azure Big Data & Analytics PaaS Services including but not limited to Azure Data Factory, Azure Data Lake Store, Azure Data Lake Analytics, Azure Storage, Azure Cosmos DB, Azure SQL, Azure DW, Azure Analytics Services and Power BI. Analyzes current business practices, processes and procedures as well as identifying future business opportunities for leveraging Microsoft Azure Data & Analytics PaaS Services.  Works closely with client architects and software and hardware vendors to understand the potential architectural impact of different vendor strategies.  Manages the design and development of standard/custom big data platforms; warehouse schematics, layouts, architectures, and relational databases for data storage and data mining.  Ensures data is delivered to clients in ways that meet requirements and drives business value.  Customize data storage and extraction, data mining, database architecture, metadata and repository creation.  Leads creation and implementation of effective metrics and monitoring processes.  Leads design and development of business intelligence reporting tools.  Work with deal teams to provide subject matter expertise and solutioning support for client proposals and RFPs.  Produce actionable reports that show key performance indicators, identify areas of improvement into current operations, and display root cause analysis of problems.Qualifications"}