{"jobID": "2830571554", "jobLocation": "Orange_CA", "jobTitle": "Sale Lead/Manger", "companyRating": null, "companyInfo": {"Website": "www.rooterhero.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "If you believe you have the Drive, Focus, and Determination to go further up the ladder of success, then send us your resume. This Sales Leader position is based in Orange County . Our Sales Leaders are expected to make $150k-$350K/yr, but earning potential is unlimited. No cold calling! We provide great leads, company vehicle, tablet and cell phone allowance.Responsibilities and DutiesThe Channel (Sales) Leader will work with a team of plumbing technicians and make proposals and recommendations to customers by providing options and up selling.Drive revenue and meet/exceed goals for the shop on a weekly/monthly/yearly basis.Must be flexible to work the scheduled shift, which may include evenings, weekends and holidays.This is a leadership position and reports to branches' Operations Manager. It is a key role in the branch and directly impacts its success and the company's.Qualifications and SkillsIn-home Residential Sales experience a must!Plumbing, HVAC, Electrical, Window Replacement or Construction experience preferred, but we will train you in the industry if you are motivated to earn while you learn to create a new career for yourself.The successful person needs to have a positive attitude, perseverance, foster a team environment and focus on being a Hero and providing excellent customer service and follow through.We require background checks and drug tests, but we hire on ability and determination to win.Benefits and PerksHealth, vision & dentalHonest and values-based sales trainingPaid vacation401K programDifferent compensation plans are available, including base plus commissions. Extensive training and support ensure success for dedicated professionals determined to create a lucrative career path.Apply only if you are a superstar and overachiever. License #1028886 AA EOE M/F D/V"}