{"jobID": "2760289609", "jobLocation": "Stanford_CA", "jobTitle": "Research Data Analyst 1", "companyRating": "4.0", "companyInfo": {"Website": "med.stanford.edu", "Headquarters": "Stanford, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "67000", "jobDescription": " 74114Job Code: 4751 Job Grade: GEnthusiastic and focused Research Analyst for Neuroimaging labDo you want to help Stanford University develop world-leading research to better diagnose and treat people suffering from Parkinson’s disease and Dementia?If you…Have experience with functional or structural MRI neuroimagingUnderstand basic statistics principlesAre exceptionally organized and can balance multiple projects at one timeEnjoy learning new skills, such as how to analyze neurological and memory testsAre a proven quick learner who doesn’t need handholding to get startedThen we offer…The opportunity to contribute to understanding dementia and Parkinson’s diseaseChallenging but positive environment where you will always learn new thingsTeamwork and camaraderieCompetitive full time salaryExcellent Stanford benefitsThe Poston lab studies cognitive and motor brain networks in Parkinson’s disease by developing and applying leading edge functional and structural neuroimaging methods. Responsibilities for this position include participation in research projects, data collection, development, implementation, and maintenance of a research databases, assistance with data analysis, and general support of the laboratory, including collection and analysis of data from the 7 Tesla scanner and PET/MR. We are supported by funding from the National Institutes of Health and the Michael J Fox Foundation for Parkinson’s Research. The desired candidate is self-motivated, detail-oriented, independent, patient, punctual, and conscientious, with excellent written/oral communication and interpersonal skills. We like working with other smart, motivated, fun people looking to better the lives of our patients through scientific discovery. Preference will be given to candidates with UNIX or computer programming experience. The exceptional candidate will have the opportunity to participate in manuscripts.In addition to submitting your on-line resume, please include a cover letter describing your prior programming and/or fMRI experience and the top five qualities that make this the right job for you. For more information about our lab and research, please see http://neurology.stanford.edu/labs/postonlab/Duties include:Collect, manage and clean datasets.Employ new and existing tools to interpret, analyze, and visualize multivariate relationships in data.Create databases and reports, develop algorithms and statistical models, and perform statistical analyses appropriate to data and reporting requirements.Use system reports and analyses to identify potentially problematic data, make corrections, and determine root cause for data problems from input errors or inadequate field edits, and suggest possible solutions.Develop reports, charts, graphs and tables for use by investigators and for publication and presentation.Analyze data processes in documentation.Collaborate with faculty and research staff on data collection and analysis methods.Provide documentation based on audit and reporting criteria to investigators and research staff.Communicate with government officials, grant agencies and industry representatives.* - Other duties may also be assigned DESIRED QUALIFICATIONS:Experience with UNIX and/or computer programming. At least 6 months experience with fMRI neuroimaging, either in running the MRI scanner or in analyzing data.Experience using functional MRI software such as SPM or FSL.Experience using MATLABExperience with advanced statisticsExperience using statistical software such as SPSS, R, or SigmaPlot.Experience using graphics software such as Adobe Illustrator or similar.Computer Science, Engineering, Statistics, Neuroscience, or Economics degree desired. EDUCATION & EXPERIENCE (REQUIRED):Bachelor's degree or a combination of education and relevant experience. Experience in a quantitative discipline such as economics, finance, statistics or engineering. KNOWLEDGE, SKILLS AND ABILITIES (REQUIRED):Comprehensive understanding of scientific principles. General computer skills and ability to quickly learn and master computer programs, databases, and scientific applications.Strong analytical skills and excellent judgment.Ability to work under deadlines with general guidance is essential. Excellent organizational skills and demonstrated ability to accurately complete detailed work.Strong writing and analytical skills.Ability to prioritize workload.PHYSICAL REQUIREMENTS*:Sitting in place at computer for long periods of time with extensive keyboarding/dexterity.Occasionally use a telephone.Rarely writing by hand.* - Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.WORKING CONDITIONS:Some work may be performed in a laboratory or field setting.WORK STANDARDS:Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, http://adminguide.stanford.edu."}