{"jobID": "2787718595", "jobLocation": "Washington_DC", "jobTitle": "Medical Transportation Coordinator", "companyRating": null, "companyInfo": {"Website": "www.gateway-ems.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: Professionally manage incoming customer requests via phone and email for ground and air medical transportation worldwide to ensure all requests are scheduled, assigned, dispatched, and recorded according to company procedures and policies. Responsibilities:Transcribe all details of coordination for transportation and maintain all records of interaction with clients and vendorsMonitor workflow of missions, ensuring high level of accuracyUtilize database and operating systems to determine appropriate quotes, logistics, and vendors for each caseProcess and resolve complaintsKey Qualifications:Proficiency in Microsoft Word, Microsoft ExcelMultitask and prioritize incoming tasks, cases, and inquiriesUnderstanding of when cases need to be escalated to a supervisorAbility to work independently, take initiative, and forward thinkingMust be willing to work night and weekends in a rotating shift plan environmentBachelor’s Degree preferred, but not requiredFluent in English; Foreign language highly desired, but not requiredOther Details:D.C. Metropolitan Area; work from homeFull Time, Exempt StatusCompensation commensurate with experience and qualificationsWhy Gateway EMS? Here at Gateway, we expect that each team member respects each other, the team as a whole and our customers. We live by our core values of reliability, loyalty, trust, responsibility and fairness. We treat our customers like we treat each other, with respect, which leads to superior customer service. We are committed to providing unparalleled customer service through high level quality management."}