{"jobID": "2594628992", "jobLocation": "Glendale_CA", "jobTitle": "Maintenance Helper", "companyRating": null, "companyInfo": {"Website": "www.forestlawn.com", "Headquarters": "Glendale, CA", "Size": "501 to 1000 employees", "Founded": " 1906", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Rose Hills"}, "estimatedSalary": null, "jobDescription": " In this very important role, our Maintenance Helper is responsible for performing a wide variety of maintenance tasks associated with the care of cemetery grounds and facilities. Will work under direct supervision, may work individually or with a team of employees. Duties are typical grounds maintenance functions found in any large-scale municipal park or garden. Much of the work will be performed with hand tools and as experience allows, equipment operation will be included in duties.  This is an entry-level position and candidates for this position can expect to receive much of their training on the job. Some of the duties include: General grounds clean-up and trash disposal.Cleaning and maintenance of storm drains.Repairing lawn damage.Mowing of section and garden lawns.Trimming memorial tablets.Replanting landscapes.Applying landscape chemicals such as fertilizers, wetting agents, herbicides.Assisting client families and other guests with grounds maintenance requests.Operating specialized equipment to move materials.Assist in completing interments.Assist in set-up and clean-up before and after special events.Installing tents for funeral services.Requirements:Minimum of 6 months maintenance experience; previous cemetery/Mortuary experience is a plus.Valid California Driver’s LicenseAbility to lift up to 100 lbs.Must have a caring and professional demeanor and enjoy helping families at a difficult time.Must be able to work some weekends and holidays.Forest Lawn will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance."}