{"jobID": "2828562668", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Engineer", "companyRating": "3.0", "companyInfo": {"Website": "www.healthtap.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Teladoc, WebMD Health, Epic"}, "estimatedSalary": "114000", "jobDescription": " Description  Data Engineer San Francisco  Are you convinced that data is an invaluable resource for companies? Do you get excited when you build and model data to analyze and interpret into meaningful information? Are you ready to add your data touch to the future of A.I.?  Three times yes? Sounds like we found a match!  HealthTap is a technology company dedicated to helping billions live a healthier, happier, longer life. We deliver a suite of connected health apps designed to provide simplified access and compassionate guidance to care for consumers while enabling practitioners to focus on what matters most.  HealthTap is well capitalized, having raised $85m with the most recent funding of $50m in 2017.  HealthTap is backed by an esteemed collection of venture capital firms including Mayfield, Mohr Davidow, and Khosla Ventures. Each of these firms is very committed to HealthTap and are very optimistic about the future of A.I. applied to healthcare and the Virtual Care Cloud.  HealthTap offers the worlds most comprehensive Virtual Care Cloud, running on our proprietary Healthcare Operating System (HOPES), and powered by our doctor-trained artificial intelligence (Dr. A.I.). HealthTap makes our basic services available to everyone for free while providing enterprises such as health systems, insurers, and employers a connected healthcare ecosystem. At HealthTap, we combine the otherwise disjointed elements of healthcare into a single seamless experience for consumers, administrators, and practitioners.  Health & Care. Simple & Accessible. What we offer you As our Data Engineer, youll create data pipeline and tools to analyze the data that drives our Dr. A.I technology and the HOPES platform and the millions of active patients and doctors on it.  Examples of data projects you could work on: Provide leadership and strategic direction for the design, organization and expansion of HealthTap's knowledge representationsDiscover and refine medical relationships from the ever-expanding repository of medical dataBuild out the next generation of real-time analysis platform to serve millions of users and our strategic partnersNeed to haveYoure passionate about making the world a happier, healthier placeYou have a BS/MS in Computer Science, Engineering or related fieldYou have 3+ years of experience in ETL, Data Warehouse, Data Mart, Advanced SQL, Reporting, and Business DashboardsYou bring expert-level knowledge of ETL tools such as Talend, Pentaho, Informatica, etc.You have good experience with BI tools such as Tableau, Qlik, Alteryx, MicroStrategy, Looker, etc.You have worked on Linux, know Shell Scripting, Python, and tools such as awk, sed, grep, etc.You dont stop until the problem is solvedYou like extreme ownershipNice to haveYou are familiar with AWS, Redshift, S3, DynamoDBYouve used Big Data technologies such as Hadoop, Hive, Pig, and SparkWorking experience in a smaller hyper growth startup is a plusMore about working with usOur contemporary offices are based in downtown Palo Alto, and San Francisco in Jackson Square.We take care of our team and offer fantastic benefits. We provide daily catered lunches, chef-prepared dinners, and healthy snacks. We offer competitive compensation and equity. We provide full medical, dental and vision coverage, as well as subsidized gym memberships, and much more.Learn more about us, our story and how we are revolutionizing healthcare virtually and globally. Visit us: HealthTap.com We are an equal opportunity employer. We value diversity and inclusion. We want to see you grow!"}