{"jobID": "2796068743", "jobLocation": "San_Antonio_TX", "jobTitle": "Business Intelligence Developer/Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "72000", "jobDescription": "Job Number: R0021122 Business Intelligence Developer/Data ScientistKey Role:  Work as a senior data visualization developer and data analyst responsible for creating enterprise-wide BI solutions while analyzing large data sets and developing automated analytics to assist decision-makers with making sense of data. Develop machine learning, data mining, statistical, and graph-based algorithms to analyze massive data sets and use modeling and measuring techniques, mathematics, statistical methods, engineering methods, operational mathematical techniques, and other principles and laws of scientific and economic disciplines in determining solutions. Analyze the actual and predictable interacting operational activities of a military, governmental, or business system to obtain a quantitative, rational basis for decision-making or resource allocation while developing scripts that extract information from a variety of data formats, including SQL tables, structured metadata, and unstructured data. Produce data visualizations that provide insight into data set structure and meaning. Develop and implement statistical, machine-learning, and heuristic techniques to create descriptive, predictive, and prescriptive analytics.  Basic Qualifications:  -5+ years of experience in the data science and analytics field  -3+ years of experience with using visualization software, including Tableau and Tableau Server  -3+ years of experience with Microsoft SQL and equivalent database technology  -2+ years of experience with delivering database solutions in direct support of BI and analytics requirements  -Ability to support application, BI, and analytics efforts requiring data and database expertise independently with little or no supervision  -Ability to obtain a security clearance  -BS degree  Additional Qualifications:  -Experience in programming with data analysis software, including Python or R in a professional work environment  -Experience with deep learning  -Experience with applying machine learning at scale using recommended systems, NLP, or time series prediction  -Ability to develop statistical tests to make data-driven recommendations and decisions  -MS degree in Engineering, Finance, Mathematics, Statistics, Operations Research, CS, or related field Clearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}