{"jobID": "2830663437", "jobLocation": "Boise_ID", "jobTitle": "Senior Surface Scientist", "companyRating": null, "companyInfo": {"Website": "www.micron.com", "Headquarters": "Boise, ID", "Size": "10000+ employees", "Founded": " 1978", "Type": " Company - Public (MU) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Samsung Electronics, Hynix, Toshiba"}, "estimatedSalary": null, "jobDescription": " Req. ID: 112982  As a Senior Surface Scientist in Micron’s Surface Analysis Lab located in Boise, Idaho, you will utilize various analytical tools, primarily related to AFM, to provide essential support to Technology Development (TD) research groups and enable them to develop new processes and materials as well as support various manufacturing activities to expedite improved yields and process monitoring. This position would primarily be responsible to develop and provide advanced scanning probe microscopy analysis in support of all aspects of semiconductor and micro-electronics manufacture and development at Micron. It would also include technical oversight of associate scientists and technicians who are responsible for providing the bulk of the routine AFM analyses. In addition to typical topographical scanning, some of the other techniques required are SSRM, SCM, C-AFM, PFM, EFM, and QNM.      Your responsibilities will include, but are not limited to, the following:     Take ownership of one or more equipment types related to the development and operation of AFM based techniques: Contribute expert subject area knowledge to resolve issues and solve highly complex problems by documenting potentially innovative solutions to new equipment modifications and process research, etc.Lead significant projects to support technical innovation in areas such as process or product application that can be delivered across multiple manufacturing sites.Implement changes to technologies and services to improve metrics in scrap, cost, rework, cycle time, throughput or yield.    Resolve complex integration issues through process development: Identify and evaluate interactions between equipment and processes and resolve related issues.Impact: Achieve end results for significant projects without which there will be an inability to reach crucial organizational objectives and would profoundly affect the image of the organization.    Set process level roadmap to drive improvement and technical innovation and implement new strategies and processes as they relate to TD strategic objectives: Define and lead complex, multi-disciplinary projects of critical importance to the organization such as managing area specific, technical project roadmaps.    Identify alternatives by continually improving design and reliability: Recognize opportunities and provide feedback to TD personnel for technical innovation.    Mentor new surface analysis engineers and technicians.     Drive development and improvement by formulating data needs and developing new methods and procedures: Standardize methods and procedures across area, department and/or manufacturing sites.    Establish clear and strong lines of communication allowing a quick response to customer requirements. Interact positively with the Lab team, development engineering, vendors, manufacturing, management, and senior customers on matters requiring coordination across organizational boundaries: Interact on a regular basis with counterparts in manufacturing.Understand manufacturing issues.Interact with manufacturing and TD on projects.Transfer owned process to manufacturing with good support and documentation.Act as a ‘go to person’ for materials analysis issues related to AFM.    Safety: Identify and promptly report hazardsFollow safety procedures and area work rules including proper PPE, lockout and chemical safety.Operate and maintain equipment and tools within manufacturer’s and company guidelinesUse proper lifting techniques and work in an ergonomically correct manner    Requirements: Education: PhD in Materials Science and Engineering, Mechanical Engineering, Physics, Chemistry or related field. (Master’s degree would be considered with extensive AFM experience)Experience: At least 5 years of experience working with AFM toolsets. We recruit, hire, train, promote, discipline and provide other conditions of employment without regard to a person's race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity and expression, pregnancy, veteran’s status, or other classifications protected under law. This includes providing reasonable accommodation for team members' disabilities or religious beliefs and practices.  Each manager, supervisor and team member is responsible for carrying out this policy. The EEO Administrator in Human Resources is responsible for administration of this policy. The administrator will monitor compliance and is available to answer any questions on EEO matters.  To request assistance with the application process, please contact Micron’s Human Resources Department at 1-800-336-8918 (or 208-368-4748).  Keywords: Boise || Idaho (US-ID) || United States (US) || Technology Development || College || Regular || Science/Laboratory || #LI-KV1 ||   "}