{"jobID": "2731980483", "jobLocation": "Arlington_VA", "jobTitle": "IT Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.promnetwork.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job OverviewLevel ExperiencedJob Location HQ - Arlington, VAPosition Type Full TimeEducation Level Bachelor's DegreeTravel Percentage NoneJob Category Information TechnologyDescriptionYou would be a key member of our IT development team, which is responsible for the definition and development of internal and external business applications. Your primary role will be to support new services and products, as well as the diverse needs of a growing network of customers. Working with both the development and operations teams, you will help define the tools and strategies used by IT to foster a culture that embraces automation and DevOps processes.  At Promontory Network, you can have a challenging, impactful career. We combine the attractive traits of a smaller company (e.g., a fast-paced, entrepreneurial environment where “the sky’s the limit”) with the sought-after resources and funding of a much larger company—and add an open culture that’s filled with high energy, intellectual challenge, and lots of fun.  You should possess the experience and qualifications to perform core responsibilities, such as: Serve as a liaison between the business and technical teams and perform requirements-analysis activities;Work with top talent in a fast-paced, entrepreneurial environment where automation and technical craftsmanship are a top priority;Leverage commercial or custom software to develop solutions to grow our businesses and facilitate participation in our services;Independently complete functional analysis for new features; document functional and system requirements; and produce supporting artifacts, including user stories and acceptance criteria, story maps, data flows, process flows, etc;Independently create designs of solutions or facilitate activities with a technical team to design solutions to complex business challenges;Usher feature development from inception to release--continually engage in the development process; answer questions, provide detail, address changes to requirements, and facilitate dialog across teams when issues and challenges are encountered to ensure the end product is delivered as specified; andOperate across multiple projects simultaneously, and perform a variety of tasks from addressing production issues to designing new applications.QualificationsExperience: Demonstrated experience with Agile methodologies, specifically Scrum. Ability to independently create user stories, manage a product backlog, and ensure that regular backlog grooming is effectively performed. A Business Analyst at Promontory Network is truly a Solution Architect and must be able to define technical solutions to complex business challenges. Abilities: Exceptional written and oral skills sufficient to communicate effectively with nontechnical and technical business clients and teams. Excellent analytical and problem-solving skills. Outstanding customer and interpersonal skills. Proactive. Self directed. Able to work independently or with a group of people as the situation requires. Technical Skills: Strong skills with writing SQL queries required. Experience with Oracle desired. Experience with Amazon Web Services, as well as Atlassian products, very helpful. Previous hands on development and/or QA experience is a plus. Education: Bachelor’s Degree or equivalent experience."}