{"jobID": "2819941089", "jobLocation": "Fort_Worth_TX", "jobTitle": "Senior Principal Scientist (Analytical Chemistry)", "companyRating": null, "companyInfo": {"Website": "www.alcon.com", "Headquarters": "Fort Worth, TX", "Size": "10000+ employees", "Founded": " 1945", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Allergan"}, "estimatedSalary": null, "jobDescription": "Posting Title Senior Principal Scientist (Analytical Chemistry)  13-Jun-2018 Job ID243375BRJob Description The purpose of this position is to influence, lead and manage all Research and Development project activities and apply scientific and technical expertise as well as leadership to address complex R&D; issues. This role is responsible for the oversight of activities to ensure preparation and timely delivery of drug product, processes, procedures, batch records and/or technical documents. The position will be held accountable for leading and managing all project activities, supporting and/or coaching team members, providing technical guidance and participating in sub-functional teams and/or functional cross-department teams to contribute to overall group strategies and goals. Independently designs multiple studies and/or develops non-standard procedures of higher complexity which require studying multiple variables and critical attributes to achieve functional deliverables.Demonstrates excellence in scientific leadership.Troubleshoots complex, cross-functional problems and provides guidance to multiple projects.Oversees the development of technical solutions which require the regular use of ingenuity, creativity, and team coordination across functions.Mentors co-workers on multiple projects and provides guidance to others.Contributes to and ensures the achievement of multiple project milestones in a timely manner using minimum amount of resources.Oversees the execution of studies, testing and/or batch preparation utilizing developed, novel, standard and/or complex manufacturing processes/procedures without deviation.Analyzes data from multiple, complex studies to derive decisions on standard, as well as non-standard department deliverables.Reviews experiments in laboratory notebook and/or batch record; prepares technical documents for single, multiple, standard and complex studies.Writes sections of regulatory documents related to department deliverables.Leads a functional sub-team and/or participates as a cross-functional representative on a project core team or other inter-departmental team.In addition to basic activities, may assume one or more responsibilities in the area of Science and Technology, People Management, Project Management and/or Device DevelopmentMinimum requirementsFluent in verbal and written English communication skills.Bachelor’s degree in a related field with 7+ years of directly related working experience OR equivalent combination of education and work experience.Experience with pharma product and/or medical device research and critically assessing current trends and upcoming techniques for current and future applications.Thorough understanding of development processes in R&D; and good understanding of development activities in some functions external to R&D.;Proven track record to lead interdisciplinary and cross-cultural teams.Thorough knowledge of relevant SOP, GLP, GMP and Novartis/Alcon regulations and policies. Preferred Requirements Advanced degree in life-sciences discipline with a focus on chemistry and/or medicinal scienceJob Type Full Time CountryUSAWork Location Fort Worth, TX Functional Area Research & Development DivisionALCONBusiness UnitRESEARCH & DEVELOPMENT ALEmployment Type Regular Company/Legal Entity Alcon Research, Ltd. EEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status. "}