{"jobID": "2836004184", "jobLocation": "Arlington_VA", "jobTitle": "GIS Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Summary  ======  Our small, passionate team is looking for a diligent GIS data analyst to preprocess local government GIS data for our emergency management solution.  Why You Should Apply  ===============  We make Crisis Track, which is a cloud based system that local governments use to manage disasters and other emergency events like search and rescue. When there is a hurricane, forest fire, flooding or other disaster, our system is used to track the situation, collect data, and help make decisions based on analytics that we provide them. We are changing the way that cities and counties are operating during these critical events.  You will work as a member of a small team of seasoned, enthusiastic GIS experts, software developers, and emergency management professionals. The work you will do will help support real-world, high-profile emergency management operations. You will also be exposed to new and different technologies and processes.  What We Need  ==========  We are in need of someone with previous GIS experience, good communication skills, and the ability to complete a project accurately and on time. You will be expected to manipulate local government GIS data for data loading and set up ArcGIS Online services.  Basic Qualifications: Demonstrable experience in Esri ArcMap or QGISFamiliarity with standard local government GIS dataHighly organized, able to take responsibility, and complete assignments accurately and on-timeExcellent written and verbal communication skillsComfortable with adjusting to changing circumstances in emergency management incidents. This is a full-time telecommute/work-from-home position. We will meet with you weekly to review the assignments, discuss upcoming tasks and provide you with technical leadership and troubleshooting help to make you and the project successful. You take it from there. You will perform the work on your schedule and produce results on a previously agreed upon milestone basis.  Crisis Track is an Equal Opportunity Employer. To be considered applicants must be eligible to work in the United States."}