{"jobID": "2812118474", "jobLocation": "Evanston_IL", "jobTitle": "Decision Analytics Consultant", "companyRating": "3.6", "companyInfo": {"Website": "www.zs.com", "Headquarters": "Evanston, IL", "Size": "5001 to 10000 employees", "Founded": " 1983", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Decision Analytics Consultants deliver high-quality sales and marketing projects to clients. Consultants possess unstructured problem solving skills as well as strong analytic and communication skills. Consultants may work on multiple projects simultaneously. As Consultants advance in their career, they specialize in a particular industry, practice area and/or client relationship.  Responsibilities:  Work with project leadership to define project scope and develop approach;  Lead project task execution by ensuring progress, organizing project data and coordinating team meetings;  Conduct issue analysis and develop hypotheses on the key client issues;  Design and execute qualitative or quantitative analyses to test hypotheses and improve client commercial effectiveness;  Synthesize findings, develop recommendations and communicate results to clients and internal teams;  Provide thought leadership and innovation within projects and practice areas;  Participate in business development;  Contribute to internal firm activities;  Coach and mentor junior team members.  Qualifications:  MBA with bachelors (and often graduate) degrees in Operations Research, Applied Mathematics, Management Science, Data Science, Statistics, Econometrics or Engineering with a strong academic record. Alternately, candidates may possess a PhD in marketing, economics, decision sciences or related field with a business application. In lieu of an MBA or PhD, 5-8 years of relevant work experience may substitute;  Up to 3 years of post-MBA relevant work experience, and 3-5 years of pre-MBA relevant work experience;  High motivation, good work ethic, maturity and personal initiative;  Aptitude for, and enjoyment of, leading and managing teams;  Strong oral and written communication skills that enable personal impact with senior-level decision makers;  Strong attention to detail, with a quality-focused mindset;  Analytic problem solving skills, with a creative and innovative outlook;  Client service orientation.  ZS is a global consulting firm; fluency in English is required, additional fluency in at least one European or Asian language is desirable."}