{"jobID": "2830591637", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Engineer - Python", "companyRating": "4.2", "companyInfo": {"Website": "www.consumertrack.com", "Headquarters": "El Segundo, CA", "Size": "51 to 200 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " ConsumerTrack™ is unique in the digital marketing and media industry - we combine marketing, digital, content and fintech. Our performance based approach increases brand awareness and generates targeted audience engagement on our internal web properties and partner sites.  Learn More About What We Do  The ConsumerTrack has big growth plans ahead and is looking for a rockstar Data Engineer experienced in Python to join our Data Engineering team. The CTI Data Engineering team is responsible for designing and developing the enterprise database, data warehouse, reporting solutions, and near-term machine learning and predictive analytics. If you are a critical thinker with a solid track record of developing data solutions and solving complex problems with Python, we want you to join our team! You will play a vital role in designing and developing our next generation data pipelines and data platform. Join the team and prototype new data product ideas and concepts! Responsibilities: Build and maintain multiple data pipelines to ingest new data sources (API and file-based) and support products used by both external users and internal teams.Optimize by building tools to evaluate and automatically monitor data quality, develop automated scheduling, testing, and distribution of feedsWork with our data science and product management teams to design, rapid prototype, and productize new data product ideas and capabilitiesWork with the data engineering team to migrate and enhance our existing Pentaho-based ETL pipeline to a new Python-based systemConquer complex problems by finding new ways to solve with simple, efficient approaches with focus on reliability, scalability, quality, and cost of our platforms.Build processes supporting data transformation, data structures metadata, and workload managementCollaborate with the team to perform root cause analysis and audit internal and external data and processes to help answer specific business questionsRequirementsBasic Qualifications: Bachelor’s degree in Computer Science or related field of study.3-5+ years of professional software engineering experience.Strong Computer Science fundamentals and basic working knowledge of statistics.Strong skills Python programming language, extensive knowledge in Python libraries / frameworksComfortable working directly with data analytics to bridge business requirements with data engineering.Experience with AWS infrastructure.Excellent troubleshooting and problem solving skills.Experience with workflow management tools (Airflow, Oozie, Azkaban).Ability to operate in an agile, entrepreneurial start-up environment, and prioritizeExcellent communication and teamwork, and a passion to learnPreferred Qualifications: Experience with Redshift, Snowflake or other MPP databases is a plus.Experience with SQL is a plus.Familiarity with other distributed computing platforms (e.g. Hadoop, Spark, Storm).Some experience with LAMP based web applications.BenefitsCompetitive salary with excellent growth opportunity; we pride ourselves in having a team that exudes leadership, high initiative, creativity, and passion.Awesome medical, dental and vision plans with heavy employer contribution.Paid vacation, holidays, and sick days.401k- We match 3% of employee’s salary after the first year of employment.In-office gym and weekly fitness and yoga classes.Fully stocked kitchen with snacks and beverages.We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}