{"jobID": "2804001433", "jobLocation": "Jersey_City_NJ", "jobTitle": "Business/Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sigconsult.com", "Headquarters": "Fort Lauderdale, FL", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " ComforceHealth, TEKsystems, Allegis Group"}, "estimatedSalary": null, "jobDescription": "Business/Data Analyst Summary: Signature Consultants is seeking a highly experienced Business/Data Analyst for an opportunity in Jersey City, NJ. The ideal Business/Data Analyst should also have Project Management knowledge and is able interface with internal and external teams. The role requires excellent written and verbal communication skills and proven capability of producing high quality, clear business friendly design specifications that can also be easily interpreted by technology peers. This Business/Data Analyst role also requires regular interaction with Executives/ Leaders and business users. Extensive background in financial products is a must. Required Skills:10+ years experience in business analysis and extensive product knowledge within Global Markets & Communications Surveillance domain.Experience in business driven projects impacting trading platforms /transaction managers / finance sub-ledgers platforms / regulatory reporting platforms / risk platforms.Extensive experience in playing a key role in complex high volume data processing and migrations within/between systems (Oracle Exadata, Hadoop)Excellent written and verbal communication skills and capable of producing high quality, clear business friendly design specifications that can also be easily interpreted by technology peersProficient in SQL for data analysis related activitiesTechnically Capable - Strong appreciation of how software is designed and developed, tested and released end to end (SDLC) and Agile experienceKnowledge of financial products including Equities, Fixed Income, Derivatives, Option, Swaps, FX, Commodities, IPOs and more. About Signature Consultants, LLC"}