{"jobID": "2688763667", "jobLocation": "Austin_TX", "jobTitle": "Electronic Data Interchange (EDI) Business Analyst/B3 Sr. Analyst", "companyRating": null, "companyInfo": {"Website": "www.b3groupinc.com", "Headquarters": "Leesburg, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " B3 Group Inc. is looking to hire multiple Electronic Data Interchange (EDI) Business Analysts to provide program management support, technical requirements management, and technical documentation analysis for the Department of Veterans Affairs in Austin, TX.  These roles will have experience in gathering data regarding performance, cost, and compatibility attributes of commercial off-the-shelf software and development applications. They will have experience in the analysis, design, and integration of information systems as well as the ability to detect problems with software applications. The B3 Sr. Analyst will be able to translate systems requirements from the business, and be experienced in gathering and compiling data necessary to analyze software architecture. They will be able to evaluate data to quickly identify problems, issues and gaps and recommend solutions.  Key responsibilities include: Support functional analysis and working to establish a framework within the accepted tools for the identification, documentation, and management of the requirements for all related components of the program at hand.Provide documentation and traceability of requirements and requirement metrics reporting.Operate and facilitate the requirements management tool, VA Rational Tools Suite, as the repository for all business and technical requirements.Facilitate the access and use of the business, requirements and development teams to use this tool to document and trace requirements and development efforts.Identify and communicate gaps, missing requirements and use cases to the requirements team, and provide a monthly Requirements/Use Case Gaps Report.Document the progress of all requirements within a weekly Requirements Status Report.Represent as being a SME (Subject Matter Expert) for X12 EDI formats.Prefer experience with FHIR In order to be successful in this position, we expect you to have the following skills and experience: Bachelors Degree required in Engineering or related scientific or technical discipline, OR a minimum of 8 years equivalent work experience will be considered in lieu of degree. At least 10 years of related work experience, preferably in a healthcare or federal organization. Intermediate skills with Rational Tools Suite and Microsoft Office suite.Excellent written and verbal communication skills.Strong aptitude to learn and adapt to technology. Ability to adapt well to diverse environments. Ability to communicate clearly with all levels in an organization. Detail oriented with strong analytical, organizational, and time management skills. Excellent interpersonal skills and ability to work collaboratively in dynamic team environment.Knowledge of X12 EDI formats and structures, EDI technology options and EDI exchange implementationsKnowledge of HL7 file formats is a plus. FHIR experience preferred.Perform Business Analyst duties such as project planning, gathering requirements, developing and executing test plans.Experience in healthcare claims processing is a plusExperience in healthcare payments electronic transactions or purchase orders Desired / Preferred Qualifications:  • Experience supporting Federal clients and/or experience supporting Department of Veterans Affairs strongly preferred.  • Preference will be given to those individuals where their primary residency is located in a qualified HUBZone (https://maps.certify.sba.gov/hubzone/map/)  Successful B3 Group employees will display the following characteristics: You strive to be an expert in your field currently and in the future.You take care in learning your customer’s business and drivers in order to ensure solutions meet not only technical needs, but also support their mission properly in a way that meeting their client's mission.You like to make your client look good.You find solutions, where others only see problems.You are proactive, you make and meet commitments, and you perform your duties exceedingly well.You are aware of the client’s needs at all times and are well-versed in what both your team and B3 Group can offer them as a whole.You have the ability to work with diverse, integrated, deliverable-driven teams to accomplish the larger mission. Our Benefits  Our reputation is built upon the talents and integrity of our employees. We value the contributions of each and every person who is a member of our organization. We offer challenging career opportunities, competitive salaries and a comprehensive benefits package to include the following: Paid Federal HolidaysAnnual Leave/Paid Time Off (PTO) and Sick LeaveHealth, Dental and Vision Insurance401(k) plan with contribution matchContinuing education assistanceFlexible Spending AccountsProfit SharingEmployee Referral ProgramLife and Accidental Death and Dismemberment (AD&D;) InsuranceShort (STD) and Long-Term Disability (LTD) Insurance About B3 Group, Inc.  B3 Group, Inc. is a fast-growing Service-Disabled Veteran-Owned Small Business (SDVOSB) and HUBZone certified health IT firm providing end-to-end technology support services to the federal government and enterprise customers. Our values-driven team of business, IT and management professionals blend innovation and client-first thinking to deliver sustainable solutions for better healthcare outcomes.  Established in 2008 and located in a Historically Underutilized Business Zone (HUBZone) headquartered in Leesburg, Virginia, B3 Group is founded on the principles of servant leadership. Those principles are reflected in every aspect of our operations. B3 Group, Inc. does not discriminate in employment opportunities, terms and conditions of employment, or practices on the basis of race, age, gender, religious or political beliefs, national origin or heritage, disability, sexual orientation, or any characteristic protected by law."}