{"jobID": "2834868457", "jobLocation": "Richardson_TX", "jobTitle": "Big Data Engineer (Hadoop/Hortonworks)", "companyRating": null, "companyInfo": {"Website": "www.beaconhillstaffing.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aerotek, WinterWyman, Hollister Staffing"}, "estimatedSalary": null, "jobDescription": "***CANDIDATES MUST BE LOCAL TO DALLAS, TX AT THE TIME OF SUBMITTAL & AVAILABLE TO FACE TO FACE INTERVIEW IN DALLAS******NO SKYPE***Job: Big Data Engineer-Hortonworks/Hadoop Location: Richardson, TX Term: 12 mo+ CT, possible CTH TOP SKILLSSparkHive QLSQLHDFSWorking with Large volumes of Data (>15 TB)This candidate has to have HANDS ON Experience with Hadoop NOT Proof of Concept experienceRESPONSIBILITIESAs a Big Data Engineer, you will provide technical expertise and aptitude to Hadoop technologies as they relate to the development of analytics.Responsible for the planning and execution of big data analytics, predictive analytics and machine learning initiatives.Assist in leading the plan, building, and running states within the Enterprise Analytics Team and act in a lead role driving user story analysis.By creating optimization and stability to the platforms, you will play a key role in the architecture design and data modeling of the platform and analytic applications.Engage in solving and supporting real business issues with your Hadoop distributed systems and Open Source framework knowledge.Perform detailed analysis of business problems and technical environments and use this data in designing the solution and maintaining data architecture.Focus will be in creating strategy, researching emerging technology, and applying technology to enable business solutions within the organization.Design and develop software applications, testing, and building automation tools.Design efficient and robust Hadoop solutions for performance improvement and end-user experiences.Work in a Hadoop ecosystem implementation/administration, installing software patches along with system upgrades and configuration.Conduct performance tuning of Hadoop clusters while monitoring and managing Hadoop cluster job performance, capacity forecasting, and security.Define compute (Storage & CPU) estimations formula for ELT & Data consumption workloads from reporting tools and Ad-hoc users.Analyze Big Data Analytic technologies and applications in both business intelligence analysis and new service offerings, adopting and implementing these insights and standard methodologies.REQUIREMENTS8+ years of experience supporting various enterprise platforms, performance tuning and application performance optimizations.5+ years of experience working in Linux servers and platform optimization.3+ years of experience in architecture and implementation of large and highly complex projects using Hortonworks (Hadoop Distributed File System) with Isilon commodity hardware.4+ years of experience with Big Data platforms and tools and Hadoop implementation experience including the following:Hands on experience in the platform operations.Performance and delivery of Hadoop ecosystem (Hadoop, Hive, Spark, Hbase, Ambari, Kafka, Pyspark & R).Application performance tuning.Experience as a DBA on any RDBMS or Hive Database.Experience managing Big Data platform operations or any other large platform. Please reply to MEPPS@BEACONHILLSTAFFING.COM for consideration! Thank you!  Find Us on Facebook!  Follow Us on Twitter!  Beacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply. Company Profile: Beacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries on a contract, direct (permanent), contract-to-direct and project basis. Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs.  Beacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles.  Learn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Pharma and Beacon Hill Technologies by visiting www.beaconhillstaffing.com.  We look forward to working with you.  Beacon Hill. Employing the Future"}