{"jobID": "2622025757", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.letslinc.com", "Headquarters": "Sunnyvale, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Why you should join: Join us in building the best ecommerce SaaS platform to revolutionize how retailers and brand engage with shoppers for post-purchase activities and more. Linc is looking for data scientists who are passionate about applying AI to revolutionize the customer care industry, who thrive on challenges and who believe in success through collaboration – people who would complement our existing team of world class developers! We offer a fun, dynamic and result-driven environment. If scale and complexity in a high growth startup excite you, Linc is the right place to be. About Linc: Linc is an AI-powered Customer Care Automation Platform that transforms one time purchasers into lifetime customers through a better than Amazon experience around tracking, returns, exchanges, and reordering. We also allow retailers to re-target and offer cross sells and upsells based on purchase history rather than browser history. We make this available to e-retailer or brand client via a number of channels including; web, email, text, and the emerging channels of Facebook Messenger and Voice. The end result is higher shopper retention rates and a higher lifetime value with those clients.  As a fast growing startup, Linc has delighted tens millions of shoppers, and customer list includes world-class brands like Carter’s, P&G;, Crocs, GoPro, Hugo Boss, eBags, and L’Oreal. Learn more at letslinc.com. Responsibility:Responsible for one or more ML related application areas: Natural Language Understanding, Dialog System, Statistical NLP, Contextual Understanding, Probabilistic Inferencing/Reasoning, Reinforcement learning, Product RecommendationDevelops and demonstrates viability of novel solution in the context of Linc’s platform and data to deliver business results as well as best of breed user experience.Be a part of an engineering team with total responsibility of both algorithms, modeling, engineering and production scaling and support – full soup to nuts ownership and empowerment!Key Qualifications:PhD program in Computer Science, Mathematics or a related field with demonstrated academic excellenceAcademic background in deep learning, natural language processing, machine learning5+ years of programming experience, proficiency in Python, JAVA, Scala or RStrong knowledge in general software design, data structures, and relational databaseStrong written and oral communication skillsStrong analytical skills, data driven mindsetDesired:Huge plus with experience in spoken dialog system, chatbot and reinforcement learning2+ years of hands-on cloud platform experience: AWS or AzurePrevious experience working in a start-up environmentExperience with Ecommerce space, knowledge of product taxonomy buildingExperience with NLP toolkits such as NLTK, OpenNLP, Stanford CoreNLP etc.Experience with open source machine learning toolkits: tensorflow, CNTK, scikit-learn, pandas, numpy, libsvm, kerasPerksWe will sponsor VisasFull medical and dental coverageCompany provided lunches and close to downtown SunnyvaleKnowledge sharing sessions with some of Silicon Valley’s best minds"}