{"jobID": "2783979365", "jobLocation": "Bridgewater_NJ", "jobTitle": "Commercial Analytics/Data Science Consultant-PHARMA", "companyRating": null, "companyInfo": {"Website": "www.smithhanley.com", "Headquarters": "New York, 061", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kforce, PageGroup, Robert Half"}, "estimatedSalary": null, "jobDescription": " Title: Commercial Analytics/Data Science Consultant-PHARMALocation: Central NJSalary: $110- 125K + bonusContact: Eda Zullo, ezullo@smithhanley.comMy client, a boutique pharmaceutical consulting firm, is seeking an \"Analytics Consultant-PHARMA\" Professional!Job Summary:Translate business questions into an analytical framework, partner closely with stakeholders, manage and execute project successfully, publish milestones and results. Incumbent will manage projects and should possess excellent client management and project management skills. Responsibilities:-Manage projects in areas of Marketing Mix Modeling, Promotional Responsiveness (ROI), Segmentation/Targeting, Multi-Channel/Digital Marketing Effectiveness and Sales Forecasting-Understand and translate client requirements to offshore team in terms of clearly defined deliverables with timelines-Create insightful summary and deck (storyboarding) in order to provide strategic recommendations to clients and other stakeholders.-Maintain seamless communication with client, get necessary clarifications and resolve outstanding issues proactively. Visit client office three days a week. -Independently work on ad-hoc projects end-to-end with necessary support from off-shore teamRequirements:- 5- 7 yrs. of experience in Marketing and Sales Analytics in the Pharma/Healthcare space. Prior experience of having client management and project management is mandatory. -MA- Engineering, Operations Research and/or Statistics from top university-Hands-on experience with Base SAS and SAS Macro, knowledge of R will be valued too.-Strong analytical aptitude and technical ability to explore and innovate-Must possess good interpersonal skills along with excellent presentation and communication skills-Proficient in Microsoft Excel & PowerPoint. Ability to work with visualization tools e.g. Tableau, Spotfire etc. will be considered good to have skill-set. -Ability to think out of the box, assess current processes and offer ideas for improvement."}