{"jobID": "2804442444", "jobLocation": "Detroit_MI", "jobTitle": "Validation Engineer 46648 (DM6) (RP5) (SD2) - BHJOB13738_46648 GD", "companyRating": null, "companyInfo": {"Website": "www.fastswitch.com", "Headquarters": "Dublin, OH", "Size": "501 to 1000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob ID: 46648Validation Engineer The energy at our company is contagious. We’re driven by our immense passion, as we constantly seek out challenges and identify new opportunities. We work hard to connect with our customers and earn their loyalty for life. Bring your talent to our company – our opportunities for growth span the globe. We will give you the training and opportunities to unleash your ambition. Required3+ years of software development and/or software testing experience IT QA experience Experience in C#, JAVA, and Selenium Experience with DB Tools such as SQL and Oracle PreferredExperience with Cucumber/Gherkin/Specification by Example (SBE) Experience in Infotainment, connectivity and Telematics system validation Knowledge of practices and methods used to validate End-to-End connected systems Working knowledge of major automotive subsystems and Back-Office protocols Experience with CAN bus messages, NeoVi, or VehicleSpy or Vector ToolsLead Cross-Functional E2E Infotainment/Telematics Feature ValidationPlan, define and drive Infotainment validation execution to ensure flawless launch of new connected features/functionsDefine and drive Infotainment validation execution to ensure consistent, robust, and thoughtful rollout of Infotainment products and services that meet performance expectationsParticipate in feature/system technical reviews and guide, consult, drive, and help author Test Procedure and Technical SpecificationsTrack upcoming Back-Office releases, IT change requests and new feature content roll out to assess validation impactsCreatively incorporate best ideas into a single working process/ potential solution with cross-functional LeadsResearch nuances of individual feature areas and creatively develop solutions to unique feature area roadblocksLead interface meetings with Cross-Functional organizations to ensure alignment on primary deliverable's and clear rationale for any infotainment unique feature area processesSupport automation initiatives and develop automation strategy for current/future projectsLead, manage and promote standardization of processes, tools and practicesLead defect resolution and triage meetings as requiredExecute test cases and generate daily/weekly execution status reportsPerform risk assessment and come up with risk mitigation plan/strategy to meet tight deadlinesEscalate and lead mission critical issues to help drive resolution in timely mannerWorking within a group setting at the beginning but will be required to work independently as well.Preferred Work Schedule:8AM to 5 PM Fast Switch, Ltd., delivering the Right Talent at the Right Time for over 21 years. We are an IT Consulting company with offices in Detroit, MI, Columbus, OH, Cleveland, OH, Cincinnati, OH, New York, Hartford, CT, Massachusetts, Minneapolis, MN, Los Angeles, CA, San Francisco, CA, and Tucson, AZ. We’re doing business in almost half the states in the union.  We're a financially strong, privately-held company that is 100% consultant and client focused. You are our most important asset!  We've differentiated ourselves by being creative, flexible, and fast. Throw out everything you've heard, seen, or felt about every other IT Consulting company.  We're different. Our consultants and clients tell us so, and it's our great people who make the difference! We do unique things, and we do them for Fortune 10 companies, Inc. 500 companies, and technology start-ups. We also have a strong belief in giving back to the communities we serve.  Our benefits are second to none and thanks to our flexible benefits options you can choose just the benefits that you need or want, options include:  • Medical and Dental (Fast Switch pays majority of the medical program)  • Vision  • Personal Time Off (PTO) Program  • Long Term Disability (100% paid)  • Life Insurance (100% paid)  • 401(k) with immediate vesting and 3% (of salary) dollar-for-dollar match  Plus, we have a lucrative employee referral program and an employee recognition culture.  In 2013, 2014, 2015, 2016 and 2017, Fast Switch was named one of the Top Work Places in Michigan by the Detroit Free Press and one of the Best Staffing Firms in 2016 and 2017. We have won the Columbus Business First “Fast 50” award 9 times in 12 years because of our strong growth which translates into more and better opportunities for our consulting staff members.  To view all of our open positions, please go to: www.fastswitch.com and at the bottom of the page click Job Portal, or get there directly at: https://www.jobs.net/jobs/fastswitch/en-us/all-jobs/  You can also follow us on Twitter at: www.twitter.com/fastswitch  And you can become a fan of Fast Switch on Facebook at: http://tinyurl.com/y9y3gdp"}