{"jobID": "2558031375", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.villagemd.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " Data engineers at VillageMD implement data pipelines to aggregate data from EHRs, claims data, smart devices, and more. This data provides vital insights that drive every aspect of our business. This isn’t your standard ETL role – we’ve built our technology by standing on the shoulders of tech giants allowing us to craft a flexible, scalable architecture that’s nimble enough to handle real-time messaging and data file transfers. We bring to bear proven, open-source technologies developed at Airbnb, Amazon, and Facebook. We participate in the open-source ecosystem and OHDSI. WhatareexamplesofworkthatDataEngineershavedoneatVillageMD?Built and implemented a data profiling tool to reverse engineer data schemas from new data sources facilitating normalization of the data into our data modelBuilt the logic to combine real-time messaging and batch query processing so there is a single, accurate source of truth from a source systemAnalyzed and designed the best ways to expand our data model to incorporate more data that’s mission criticalWhatwillmakeyousuccessfulhere?A real passion for problem solving and learning new technologyVision to balance speed and maintainability in solution designStrong analytical and technical skillsThe ability to handle multiple, concurrent projectsExcellent ability to craft and implement requirements, keep projects on track, and engage partnersChallenging the status quo to improve our processes and toolsCommunicate complex technical details in meaningful business contextA low ego and humility; an ability to gain trust by doing what you say you will doWhat you might do in your first year:Own ten projects working multi-functionally with the Physician Success and Analytics teams to design and implement best-in-class data processing enabling clean data flow directly to our data modelWork with an HIE, engineering, analytics, and operations to design and implement an integration that streamlines our transitional care management workflowsDesign a new concept within our data model to meet a new operational or analytical needBuild a python app to send data anomalies to operationsThe following experience is relevant to us:2+ years of full-time experienceExperience with Java or Python is helpful (C# and Ruby can work too)Excellent with SQLPreferred experience with clinical and financial healthcare dataTrack record of successfully executing projects with multiple partnersBS/MS in computer science, math, engineering, or other related fieldsWe are an equal opportunity employer and value diversity at VillageMD. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}