{"jobID": "2768456950", "jobLocation": "Austin_TX", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.dosh.cash", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our mission: Our mission is to Move Billions of Dollars to Millions of People. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for everyone on our platform.Your job: As a Data Engineer at DOSH, your role is to deliver the information your business partners need to grow the business. You will assist business teams in drawing insights from our data. You are someone who wants to see the impact of their work and make a difference every day. You know what it takes to deliver quality reporting and business intelligence solutions to the organization. You understand the value and benefit of solid data practices and how to translate that into satisfied business partners. You are an experienced Software Engineer. You are skilled in extracting, transforming, and loading data. You are able to translate business requests into database or streaming data designs. You have experience working with relational and nosql databases for consumption by numerous consumer applications and business orgs. You are someone who is passionate about data-driven approaches. You enjoy exploring large data sets and get excited about learning new technologies and learning in a collaborative environment. You are skilled at eliciting requirements from a wide range of different teams.Responsibilities: Experience leveraging Python, R, Scala, Matlab or other tools to manipulate data and set up automated processes as per business requirements Familiarity with analytical techniques and machine learning workflows Familiarity with financial data sets and use cases Strong familiarity with AWS Knowledge of Lambda architectures Experience building/operating highly available, distributed systems of data extraction, ingestion, and processing of large data sets Experience with Big Data Technologies (Hadoop, Hive, Hbase, Pig, Spark, etc.) Experience leading large-scale data warehousing and analytics projects, including using AWS technologies Redshift, S3, EC2, Data-pipeline and other big data technologies Experience building data products incrementally and integrating and managing datasets from multiple sources Strong ability to interact, communicate, present and influence within multiple levels of the organization Track record of manipulating, processing, and extracting value from large datasets Excellent communication skills to be able to work with business owners to develop and define key business questions and to build data sets that answer those questions"}