{"jobID": "2795092538", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.fractalanalytics.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Opera Solutions, Mu Sigma, LatentView Analytics"}, "estimatedSalary": "124000", "jobDescription": " As a Data Scientist, you solve complex challenges and identify new opportunities using a combination of analytical expertise, business acumen, strategic thinking, and project and relationship management skills.  RESPONSIBILITIES Integrate and mine large data sets, connecting data from disparate sources to identify insights and patterns using predictive and prescriptive analytics, and machine learning techniquesConduct intermediate and advanced statistical analysis, such as linear regression, ANOVA, time-series analysis, classification models, neural networks, decision trees, as well as analysis of unstructured data (e.g., social media listening, digital footprints, speech analytics)Prepare and present written and verbal reports, findings, and presentations to key stakeholders, distilling complex statistical information into easy-to-understand business languageApply knowledge of U.S. businesses and corporate groups and relevant industry knowledge to analysis and insightsManage project budgets and timelines, ensuring times and on-budget completion QUALIFICATIONS Experience analyzing large data sets using statistical software, such as SAS, R, Python, and SPSS, to discover new business insightsExcel and PowerPoint a must. SQL Programming and experience of at least one DBMS such as IBM DB2, Oracle, SQL Server or Sybase are required. Java strongly desiredPrior experience with building models, analyzing unstructured data, and/or machine learningRelevant academic experience and work experience in Statistics, with exposure to data structures and data visualizationMasters degree in Mathematics, Statistics, Engineering, Computer Science, or a quantitative discipline plus a minimum of 2-3 years of work experience, or bachelors degree plus 5 years work experienceWell developed written and oral communication skills, with ability to present and explain data to business managerStrong project management skills / experience managing projects, budgets, and schedules to successful completionSome prior exposure to financial services, Telecom or insurance industry desired"}