{"jobID": "2830130069", "jobLocation": "Lubbock_TX", "jobTitle": "Senior Clinical Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.covenanthealth.org", "Headquarters": "Knoxville, TN", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Texas Health Resources, NW Texas Healthcare, BSA Health System"}, "estimatedSalary": null, "jobDescription": "Job Summary:Covenant Health is seeking a dynamic senior data analyst to advance the organization in data intelligence and clinical data analytics. This position is part of the Decision Support Department with accountability to extract and analyze data from clinical quality systems in support of Covenant Health (Texas Region) and related ministries. The position will translate data into meaningful information and knowledge that supports the Covenant Health in decision making or determining action that drives Performance Improvement, Strategy, Quality and Patient Safety. The position reports to the regional Executive Director for Decision Support and is responsible to initiate, coordinate and provide expertise in analytic projects, working with system and local ministries and departments as indicated. The position will also be responsible for developing and maintaining databases as well as conducting research from primary and secondary data sources, analyzing trends, and developing written and graphic reports/presentations. The position is also responsible for reflecting and promoting the mission and philosophy of the St. Joseph Health System.Essential Functions:1. Designs, develops and maintains databases to collect, organize, and analyze primary and secondary data obtained from internal and external sources (Premier, NHSN, RL Solutions, Allscripts, Milliman, EPSI, Amalga, MediTech, PICIS, Crimson, Safety Surveillor/MedMined, etc.).2. Collaborates and provides analysis and interpretation of data identifying key trends and opportunities for improved performance comparing health system, peer group and comparative groups as appropriate including national benchmarking.3. Identifies and uses internal and external sources of information for benchmarking and comparative performance, which includes networking with clinical communities (IHI, Premier/QUEST, etc), researching literature and agencies (CMS, AHRQ, NQF, ISMP), and staying current on new indicators and other requirements.4. Prepares reports, charts, tables and other graphic display of data that demonstrates performance compared to targets/goals, national benchmarks, and/or peer groups. This includes designing and generating system level reports, dashboards and/or scorecards.5. Extracts and validates with ministries the outcome data used in the health system tracker, perfect care scorecard and other quality/safety initiatives.6. Creates standard work for production of reports that can be executed by the local ministries, including report templates and reports that can be autopopulated.7. Perform analytical and special projects, prepare ad hoc reports/data queries as may be assigned/requested, working with Clinical Excellence leadership.Minimum Position Qualifications:Education: Bachelor’s degree in an applicable field, such as Nursing, Health Care Administration, Statistical Analysis and/or Data Administration.Experience: Three years of clinical experience in nursing or other healthcare related specialty with additional experience in data collection, analysis, quality/safety, or computer programming.Preferred Position Qualifications:Experience with Premier, MediTech, Amalga and other such databases preferred. Covenant Health is celebrating nearly 100 years of serving Lubbock and our South Plains region. As the oldest and largest health system in Lubbock and the region, we currently employ over 5,200 people with a medical staff of over 600 physicians.  For nearly 100 years, Covenant has been driven by a mission of providing a Christian ministry of healing and caring for the whole person - mind, body and spirit. Our vision and differentiator is we are the only faith-based, integrated health network in the West Texas/eastern New Mexico region dedicated to a Christian ministry of healing.  As an expression of our mission, we believe we hold an important Covenant with our patients and try and treat every interaction as Sacred Encounters.  Our ministry includes six hospitals with over 1,100 licensed beds:  Covenant Medical Center - CMC  Covenant Children’s  Covenant Specialty  Covenant Plainview - PLV  Covenant Levelland - LVL  Trustpoint (joint venture: Rehab Hospital of Lubbock)  Covenant Medical Group (CMG)  Covenant Health Partners  Hospice of Lubbock  Covenant Health's total service area includes 25 counties that covers most of West Texas and eastern New Mexico. The service area covers approximately 750,000 people and approximately 35,000 square miles."}