{"jobID": "2529011002", "jobLocation": "Dallas_TX", "jobTitle": "Data Engineer", "companyRating": "4.8", "companyInfo": {"Website": "www.dialexa.com", "Headquarters": "Dallas, TX", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " projekt202, IDEO"}, "estimatedSalary": "93000", "jobDescription": " Dialexa is expanding its Data Science practice and is looking for great talent to join us building intelligent, next generation platforms. Are you tired of just pushing out ones and zeros and you yearn to solve hard problems? Do you want to work on an awesome team of designers and developers in a full agile process? Do you want your creative technical ideas to be listened to, heard, and implemented? Do you want to create applications that people love?  We develop for a wide array of technology platforms and frameworks including mobile, web, Internet of Things (IoT), wearables, and embedded devices. We have an awesome culture that includes perks such as fun quarterly team outings, startup swag, healthcare benefits, 401K, PTO, discounts for gym, travel, and mobile carrier, and relocation package (if you have to move to Dallas). To learn more about Dialexa, please visit www.dialexa.com ResponsibilitiesDesigning and building high-level petabyte-scale architectures tailored to clients' needsWrite and monitor ETL processes using distributed computing techniquesCollaborate with designers, managers, product owners, and other engineers to deliver business outcomesDesign and train machine learning models and deploy them to real time analytics systemsAnalyze, explore, and visualize data to produce actionable informationExpectations (the more the better - we want great talent!)Bachelor of Science in Computer Science or related majorPortfolio of applications that clearly demonstrates coding proficiency, an eye for quality, understanding of security, and attention to performanceKnowledge of common data science languages (Python, Scala, Java, R, etc.)Experience with... Cloud infrastructure and services (AWS, Azure, Google Cloud)Big data storage tools (Hadoop HDFS, AWS S3, Azure Blob)Training machine learning models (Scikit-learn, Tensorflow, torch)SQL and NoSQL databases (MySQL, PostgreSQL, Cassandra, MongoDB)Searching and caching storage (Elasticsearch, Solr, Redis)Messaging platforms (Kafka, RabbitMQ, Kinesis)Distributed querying (PrestoDB, Hive, Pig)Distributed processing (Spark, MapR, Storm, Flink)"}