{"jobID": "2816724033", "jobLocation": "Lisle_IL", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.ryerson.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1842", "Type": " Company - Public (RYI) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " O'Neal Steel, Reliance Steel, thyssenkrupp"}, "estimatedSalary": "61000", "jobDescription": "Job ID: 4662 Position Description: Joseph T. Ryerson & Son, Inc., one of the largest metals distributors in the US, is currently seeking a Data Analyst to join our Analytics team in Lisle, IL. The successful candidate plays a vital role in driving financial performance by automating the collection, cleansing and enhancement of data to enable the creation of analytic tools used by the Business. The Analytics team is part of the office of the Chief Data Officer and supports key decision makers throughout all functional areas and management levels of Ryerson. Our toolset includes best in breed software such as IBM Cognos, Oracle, SAP and Salesforce.com as well as the ability to leverage in-house programming resources for custom application development. Roles and Responsibilities:Understand the content, structure and business meaning of data from various systems such as the Data Warehouse, ERP Platforms, web site and various external sources. Help enable ongoing expansion of same.Gather and document requirements for datasets and reports as well as business user training materials.Aid in the data collection, testing and validation for newly created and expansion of existing data sources.Collaborate on development of analytic tools with business experts, programmers, developers and other analysts. These tools include reports, dashboards, models and ad-hoc queries used by decision makers to gain required insight into complex business circumstances utilizing software such as Cognos, Salesforce.com, SPSS, SAP, Google Analytics or Excel.Troubleshooting the analytic database environment and reportsWork with data from a variety of business disciplines ranging from the local service center operations to corporate departments such as Sales, Supply Chain, Operations, Human Resources, Accounting, and Treasury.Provide tactical analytical support to meet business demands as required.Position Requirements:Bachelors degree in a quantitative major such as Supply Chain, Business Analytics, Information Management, Industrial Engineering, Mathematics, or similar business area.5 7 years applicable work experienceStrong analytical and organizational skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.Comfortable working with very detailed levels of data and enjoys working behind the scenes.Demonstrated ability to quickly learn and understand new software products and concepts, including ability to self-instruct using available texts and other resources.Ability to manage multiple projects, create and maintain documentation, prioritize work and meet deadlines with minimal direct supervision.Advanced level abilities in Microsoft Excel and/or Access, including knowledge of pivot tables, vlookups, and query writing to collect, transform and evaluate data to provide actionable information is a must.Excellent communication and interpersonal skills; ability to interact across multiple departments and levels within a medium to large size enterprise.Experience working with business analytic software such as IBM Cognos BI / TM1 and CRM software such as Salesforce.com is a strong plus. We are an Equal Opportunity Employer and do not discriminate against  any employee or applicant for employment because of race, color, sex,  age, national origin, religion, sexual orientation, gender identity,  status as a veteran, and basis of disability or any other federal,  state or local protected class. ."}