{"jobID": "2786511035", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Infrastructure Engineer", "companyRating": null, "companyInfo": {"Website": "www.plumewifi.com", "Headquarters": "Palo Alto, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary Plume has built a data driven \"over-the-top\" services delivery platform to manage consumer wireless networks and devices in real time at \"massive\" scale - 100s of millions of devices spanning mobile, IoT, and other applications.  We are looking for experienced Data Infrastructure engineers that would help us make sure that the platform service we are delivering will meet both our and our customers reliability expectations.  Candidate should be a talented engineer that can show initiative, adaptability to challenging environment, problem solving skills, and understanding of Data Infrastructure. 3+ years industry experience is a must! ResponsibilitiesCreate infrastructure and abstractions that can enable anyone (engineer or data scientist) to create a scalable ETL pipeline for whatever the purpose is: metrics, analysis, machine learning, dashboard visualizationsWork closely with ops team to monitor and tune existing infrastructure.Make intuitive decisions about what services, frameworks, and capabilities need to be in place before they are desperately needed.Build and maintain a data collection system that robustly extracts relevant data from multiple sources and data storesQualificationsBA/BS in Computer Science, Information Systems or related technical field.3+ years of experience in Data Infrastructure, with Cloud SW experience a plus.Strong analytical and problem-solving skills.Experience in designing and scaling data infrastructure, models, and pipelinesHands-on experience with a variety of data infrastructures, such as: Processing: Spark, Flink, Hadoop, LambdaMessaging: Kafka, Zookeeper, PulsarStorage: Hive, Mongo DB, Athena, Phoenix, Splice, Redshift, DynamoDBMachine Learning: Sagemaker, H2O, Keras,Open and active in sharing knowledge as well as excellent communication skillsProgramming experience in one or more application or systems languages: Scala, Java, PythonThe ability to manage a project from inception to completion"}