{"jobID": "2771853219", "jobLocation": "Houston_TX", "jobTitle": "Data Reporting Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.texaschildrenspeople.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1947", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": " Job SummaryWe are searching for a Data Reporting Analyst — someone who works well in a fast-paced setting. This position will develop and coordinate information analysis and reports for supporting clinical and business outcomes. The role will oversee quality improvement, care management, and other performance improvement initiatives.  Think you’ve got what it takes?Responsibilities Develops and coordinates information needed to meet clinical and business outcomesProvides analytical interpretation of dataDevelops and maintains information repositories of dataCollaborates with information services on upgrades to systems to maintain reporting continuityDemonstrates commitment to team and flexibilityProfessional interpersonal, communication, critical thinking, and customer service skillsQualificationsBachelor’s degree in a healthcare-related fieldA combination of four years of additional data analysis experience and/or college coursework may substitute for a bachelor’s degreeThree years of data analysis experienceMust be proficient in utilizing an electronic medical record, such as Epic Company ProfileTexas Children’s Hospital  Since 1954, Texas Children’s has been leading the charge in patient care, education and research to accelerate health care for children and women around the world. When you love what you do, it truly shows in the smiles of our patient families, employees and our numerous accolades such as being consistently ranked as the best children’s hospital in Texas, and among the top in the nation by U.S.News & World Report as well as recognition from Houston Business Journal as one of this city’s Best Places to Work for ten consecutive years.  Texas Children’s comprehensive health care network includes our primary hospital in the Texas Medical Center with expertise in over 40 pediatric subspecialties; the Jan and Dan Duncan Neurological Research Institute (NRI); the Feigin Center for pediatric research; Texas Children’s Pavilion for Women, a comprehensive obstetrics/gynecology facility focusing on high-risk births; Texas Children’s Hospital West Campus, a community hospital in suburban West Houston; and Texas Children’s Hospital The Woodlands, the first hospital devoted to children’s care for communities north of Houston. We have also created the nation’s first HMO for children, established the largest pediatric primary care network in the country and a global health program that is channeling care to children and women all over the world. Texas Children’s Hospital is also academically affiliated with Baylor College of Medicine, one of the largest, most diverse and successful pediatric programs in the nation.  To join our community of 13,000 dedicated team members, visit texaschildrenspeople.org for career opportunities. You can also learn more about our amazing culture at infinitepassion.org."}