{"jobID": "2808199926", "jobLocation": "San_Francisco_CA", "jobTitle": "Workday Time Tracking Senior Consultant – Technology Practice", "companyRating": null, "companyInfo": {"Website": "www.crosscountry-consulting.com", "Headquarters": "McLean, VA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " MorganFranklin Consulting, Slalom, Deloitte"}, "estimatedSalary": null, "jobDescription": "CrossCountry Consulting’s Workday practice is growing quickly, and we are seeking talented professionals to join our SF Office. Being part of our Workday practice is a unique opportunity to join a Full Platform Deployment Partner that strives to provide a better experience for our premier commercial clients and our team. We combine the nimbleness of a Workday boutique firm with the capabilities and stability of a Big 4 consulting firm. Our core values in action empower personal and professional development through excellence, collaboration, energy and impact. You can find out more about our award-winning firm on www.crosscountry-consulting.com and Glassdoor.Responsibilities Participate in full-cycle implementation projects within the Workday HCM Time Tracking product suiteProvide prime deployment, post production and support services to both large multi-billion-dollar enterprises and emerging growth companiesCollaborate with team to help clients navigate the selection, transformation, implementation, and configuration of the Workday HCM applicationAssist Managing Consultants on projects to help convert legacy data into WorkdayPrioritize clients interest and proactively listen to ensure that work exceeds their expectationsImplement performance improvement and cost-reduction initiativesContribute beyond client delivery with practice development, knowledge transfer, operational improvement and recruitingQualifications 2+ years of recent Workday Certified experience implementing HCM and Time Tracking solutionsPrevious consulting experience with a Workday deployment partnerExperience deploying multiple HCM projects simultaneously a plusAbility to build and develop strong client relationshipsStrong leadership skills with the ability to foster an environment of collaboration and excellenceExcellent verbal and written communication skillsAbility to learn technology quickly through instruction and self-trainingAbility to travel up to 50% of the timeStrong attention to detail with the ability to think from a “big picture” perspectiveCreativity, confidence, flexibility and a great sense of humorBachelor’s degree (or higher)Current certifications in Workday HCM and Time TrackingCrossCountry Consulting is the trusted partner and expert advisor to leading organizations that are dealing with pressing business needs. We help our clients transform their finance, accounting, operations, risk, and technology functions in order to effectively prepare them for complex change, optimized performance, and accelerated business growth. Our consultants work collaboratively with our clients to provide customized solutions to our clients’ specific and ever-changing needs.CrossCountryConsulting is built on the fundamental principles of dynamic growth and shared values. Our culture reflects an environment that nourishes and promotes excellent client service, team collaboration, and individual advancement."}