{"jobID": "2747457873", "jobLocation": "Burbank_CA", "jobTitle": "Sr Staff Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "disney.go.com/disneypictures", "Headquarters": "Burbank, CA", "Size": "201 to 500 employees", "Founded": " 1923", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "Job Summary: As a trusted creator of premium entertainment experiences for the whole family, The Walt Disney Studios is committed to making it easier than ever for consumers to grow their digital movie libraries in a seamless and family-friendly experience. Disney Movies Anywhere (DMA) is The Walt Disney Studios’ exclusive cloud-based digital movie service. This app for iOS, Android and Web experiences enables consumers to discover, purchase, manage, and watch movies from Disney, Pixar, Marvel, and Star Wars at home and on the go.  Responsibilities: Work on all phases of projects from design to implementation including specifications, development, testing, rollout, documentation and, if applicable, turnover to the Maintenance Engineering and Operations Team.Work within state of the art engineering practices (i.e. SCRUM, unit testing, design review, code reviews, continuous integration, etc.).Partners with team lead to identify technical requirements and alternatives to accomplish project.Providing accurate estimates for project development and implementation. Work with management to meet those estimates.Participates in design, code, test, maintenance, enhance and decommission phases throughout software life cycle to contribute technical expertise and to identify issues.Presents status, plan and issues/risks at daily stand-ups.Mitigates risk for the project, team and company.Work with the Architecture team in defining software and infrastructure technical solutions.Serve as a mentor and advisor to team members.Ensures knowledge transfer to team members within and outside of immediate group.Participate in interviewing technical candidates and provide feedback.Iteratively improves projects with agile delivery practicesBasic Qualifications:8+ years of full software development lifecycle experience5+ years of experience developing web applications5+ years of Object-Oriented analysis, design and development experience5+ years of experience in a data oriented roleStrong Java 1.7+ ExperienceStrong Linux ExperienceSignificant exposure to and demonstrated proficiency in all aspects of programming and analysis including design patterns, hardware and software requirements, systems requirements and deployment protocolsAgile experience using ScrumExperience with open source technologiesExperience with unit testing & test driven development (TDD)Experience with the Hadoop batch processing framework and map reduce design patternsExperience with a widely used RDBMS’ and SQLExperience with at least one columnar NoSQL solutionPreferred Qualifications:Experience developing, maintaining, and innovating large scale, consumer facing web applicationsExperience working in a large big data enterprise organizationExperience with Apache Spark including Spark StreamingExperience with LinkedIn’s Azkaban, Apache ClosureExperience with Enterprise Integration Patterns and Apache CamelExperience with social, mobile, cloud/SaaS integrationsAPI level experience with Youtube, Twitter and FacebookExperience creating robust and reliable data pipelinesFamiliar with the development challenges inherent with highly scalable and available web applications.Experience with various, modern web frameworksExperience with PostgreSQL RDBMSExperience with Apache hBaseExperience with Apache Hive and/or Apache CrunchExperience with Apache Avro.Experience with Pentaho Weka or Apache MahoutExperience with the uses of various NoSQL solutions including hBase, MongoDB, Neo4jOperational experience with large software systemsExperience with Amazon EC2 and EMRSchema and/or Cube design experienceExperience with a visualization tools such as D3.js, Tableau, MicroStrategyExperience with ETL tools such as Pentaho Kettle, Informatica, Talend, OpenRefineExposure to statistics, machine learning and natural language processing applicationsExposure to security, PII and PCI compliance issuesExposure to R, Python, Julia, Haskell Preferred Education BS in computer science, engineering, mathematics or physical sciencesBS or MS in computer science, engineering, mathematics or physical sciences About The Walt Disney Studios:For over 90 years, The Walt Disney Studios has been the foundation on which The Walt Disney Company was built. Today the Studio brings quality movies, music and stage plays to consumers throughout the world. Feature films are released under the following banners: Disney, including Walt Disney Animation Studios and Pixar Animation Studios, Disneynature, Marvel Studios and Lucasfilm. The Disney Music Group encompasses the Walt Disney Records and Hollywood Records labels, as well as Disney Music Publishing. The Disney Theatrical Group produces and licenses live events, including Disney on Broadway, Disney On Ice and Disney Live!. Ours is a culture of innovation, inspiration and collaboration that brings together visionary artists, gifted technologists and savvy business minds to conjure up magical entertainment experiences for a global audience.About The Walt Disney Company:The Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise with the following business segments: media networks, parks and resorts, studio entertainment, consumer products and interactive media. From humble beginnings as a cartoon studio in the 1920s to its preeminent name in the entertainment industry today, Disney proudly continues its legacy of creating world-class stories and experiences for every member of the family. Disney’s stories, characters and experiences reach consumers and guests from every corner of the globe. With operations in more than 40 countries, our employees and cast members work together to create entertainment experiences that are both universally and locally cherished.  This position is with Movies Anywhere, which is part of a business segment we call The Walt Disney Studios.  Movies Anywhere is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Disney fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best stories and be relevant in a rapidly changing world."}