{"jobID": "2824472123", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.vizientinc.com", "Headquarters": "Irving, TX", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "139000", "jobDescription": " When you're the best, we're the best. We instill an environment where employees feel engaged, satisfied and able to contribute their unique skills and talents. We provide extensive opportunities for personal and professional development, building both employee competence and organizational capability to fuel exceptional performance now and in the future. Summary: Conducts sophisticated data analysis to help address critical business and member questions, the outputs of which enable members to drive improvements in clinical, operational, and economic outcomes. Responsibilities:Provides analysis for Vizient leadership team to identify critical issues/questions around member performance.Conducts exploratory data analysis from complex, disparate data sources to recognize patterns, and identify member performance improvement opportunities.Generates hypotheses and analyzes data to test and interpret results.Designs and develops data models to predict member outcomes or future impact of key member decisions.Communicates findings from exploratory and predictive data analysis broadly to Director of Analytics.Identifies improvement opportunities in reporting and BI tools and collaborates with Products Technology to implement the enhancements.Serves as the resident data expert and share best practices/approaches for statistics, machine learning techniques, data modeling, simulation and advanced mathematics.Qualifications:Advanced degree (Masters or higher) preferred in applied math, statistics, computer science, or related field.5 years minimum of work experience.Programming experience using SAS/Python/R required.Experience managing large disparate data sets and using quantitative and qualitative analysis strongly preferred.Strong communication skills (both oral and written).Must be able to present results to senior leadership, internal and external members.Must be a team player and be willing to collaborate and assist with members of the team as necessary.#IDS Equal Opportunity Employer: Females/Minorities/Veterans/Individuals with Disabilities  The Company is committed to equal employment opportunity to all employees and applicants without regard to race, religion, color, gender identity, ethnicity, age, national origin, sexual orientation, disability status, veteran status or any other category protected by applicable law."}