{"jobID": "2829367842", "jobLocation": "San_Mateo_CA", "jobTitle": "Configuration/Data Management Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.camber.com", "Headquarters": "Huntsville, AL", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " Huntington Ingalls Industries - Technical Solutions Division, Integrated Mission Solutions Group (Camber Corporation) provides mission-critical engineering and technical service to Information Technology, Federal Civilian, and National Security, Aerospace&Defense; and International government and commercial customers at over 100 locations worldwide.  HII-TSD, Integrated Mission Solutions Group (Camber Corporation) was recently awarded a multi-year contract supporting the United States Postal Service (USPS) and is pro-actively seeking Configuration/Data Management Analysts to work out of their client's field office.  It is anticipated that specific opportunities will be announced shortly and the selection process to follow immediately thereafter. Please include a copy of your current resume and updated contact information with a personal email address and phone number with your application submission.  For additional information, please contact uspsjobs@hii-tsd.com.  Duties and Responsibilities (to include but not be limited to the following): Under general direction, responsible for effectively tracking, logging, categorizing, and maintaining changes made against the accepted USPS baseline(s) standardsDevelops, distributes, and tracks all change packages resulting from approved Configuration Control Board actionTrains personnel by conducting workshops and seminars on the proper methodology to maintain a proactive CM programProvides daily support and direction to staff as to change status requirements, deadlines, and problemsResponsible for the effective development and implementation of programs to ensure that all information systems products and services meet minimum company standards and end-user requirementsAdministers the change control process for zero defects software developmentResponsible for configuration management of requirements, design, and codeEvaluates and selects configuration management tools and standardsPrepares configuration management plans and proceduresAdministers problem management process including monitoring and reporting on problem resolutionEnsures adequate product testing prior to implementationCoordinates with users and systems development personnel on releases of softwareVerifies the completeness and accuracy of release libraries before implementation and ensures that correct versions of programs are included in specified releasesMakes recommendations to superiors regarding the acquisition and/or implementation of software to increase information systems efficiency, configuration management activities including product identification, change control, status accounting, operation of the program support library, and development and monitoring of equipment/system acceptance plansOperates and manages program support libraryMonitors library structure and procedures to assure system integrity, including procedures for collection, release, production, test, and emergency libraries and the movement/migration of components between librariesMonitors end-item acceptance plansMay supervise lower level personnelQualifications and Experience:A degree from an accredited College/University in the applicable field of services is preferredAll levels of experience acceptedSpecial credentials (licenses and/or certifications) may be required at the Task Order level on a case-specific basisSecurity:Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified informationMust be able to obtain and keep a USPS Sensitive ClearanceMust be a U.S. Citizen or have a Green Card and have been living in the U.S. for at least the last five yearsMust not have traveled outside of the United States for more than 180 days in the last five yearsAll candidates will be subject to a pre-employment background investigation and drug screening per HII requirements. About Us  Camber Corporation is part of the Integrated Mission Solutions Group of HII's Technical Solutions division. Integrated Mission Solutions Group is a leading provider of Agile Software Engineering and Information Technology solutions; All Hazards services; Modeling, Simulation, and Training solutions and services; Unmanned Systems support; Intelligence Analysis and Operations; and Engineering and Management services to Department of Defense, Federal, and commercial customers.  Integrated Mission Solutions Group (Camber), a subsidiary of Huntington Ingalls Industries, Inc. (HII) is headquartered in Huntsville, AL. From Camber's founding in 1990, we have grown to 32 offices, positioned to provide responsive support to our customers across the United States. We deploy personnel to support our customers globally, including many locations in Asia, Africa, and Europe, providing daily interface on technical, programmatic, and operations issues. Overall, more than 1,600 Camber professionals deliver ISO 9001:2008-certified and CMMI ML3 high-value solutions to customers worldwide.  Camber Corporation is an Equal Opportunity Employer EOE/AA Minorities/Females/Veterans/Disabled Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here."}