{"jobID": "2805271039", "jobLocation": "Washington_DC", "jobTitle": "Manager, Workforce Programs", "companyRating": "3.4", "companyInfo": {"Website": "www.nam.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1895", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Manager, Workforce ProgramsTheNational Association of Manufacturers (NAM) is seeking a Manager, Workforce Programs who wants to work on creative solutions to the greatest challenge facing U.S. manufacturers. You’ll be joining a small team of entrepreneurial problem-solvers designing programs and creating partnerships to attract and prepare the manufacturing workforce of tomorrow. Join the NAM and Make an Impact in the Following Ways: Works with the Vice President, Strategic Initiatives, to manage workforce programs that engage companies, educational institutions, third-party credential providers, and business associations.Assists in the development, launch and growth of creative workforce programs for the manufacturing industry in a variety of regions across the U.S.Helps manage an innovative project to collect and analyze data to evaluate the outcomes of workforce and education programs.Writes public-facing project and program materials, reports and updates.Communicates and collaborates with external partners, including partner non-profits, education institutions, companies, and government agencies.Supports proposal development to company and philanthropic foundations for workforce programs.The above list of responsibilities is representative of the position and is not intended to limit or preclude other responsibilities and tasks that may be associated with or added to the position.Qualifications:Bachelor's degree (B.A. or B.S.) from a four-year college or university;3-5 years related work experience, including experience and interest in:Workforce developmentFamiliarity with community college and technical education systemFamiliarity with third-party credentialsPrior association experience preferred;Comfort and interest in developing public speaking and presentation skills;Ability to travel.Proficiency in Word for Windows, Excel, & PowerPoint.Strong editing and proofreading skills; excellent communication, writing and interpersonal skills;A passion for manufacturing and entrepreneurial outlook preferred.Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.The National Association of Manufacturers (NAM) is the largest manufacturing association in the United States and one of the nation’s most influential advocates for manufacturing. By joining the NAM, you become part of a spirited and dynamic team that is driven to succeed. We recognize and reward our staff with competitive pay and annual performance based bonus programs. We offer an outstanding benefits package that includes health, dental, and vision insurance, life, short-term and long-term disability, flexible spending accounts, SmarTrip, and a 401(k) Salary Deferral plan with employer match and contributions, vacation and sick leave, complimentary on-site gym access and healthy snacks in the break room. Become part of a fast paced team passionate about keeping the United States the world leader in manufacturing. People. Passion. Progress.Join the NAM team. Learn more at www.nam.org/careers"}