{"jobID": "2608445839", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.evolenthealth.com", "Headquarters": "Arlington, VA", "Size": "1001 to 5000 employees", "Founded": " 2011", "Type": " Company - Public (EVH ) ", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "It’s Time For A Change…Your Future Evolves Here Evolent Health has a bold mission to change the health of the nation by changing the way health care is delivered. Our pursuit of this mission is the driving force that brings us to work each day. We believe in embracing new ideas, challenging ourselves and failing forward. We respect and celebrate individual talents and team wins. We have fun while working hard and Evolenteers often make a difference in everything from scrubs to jeans.  Are we growing? Absolutely—56.7% in year-over-year revenue growth in 2016. Are we recognized? Definitely. We have been named one of “Becker’s 150 Great Places to Work in Healthcare” in 2016 and 2017, and one of the “50 Great Places to Work” in 2017 by Washingtonian, and our CEO was number one on Glassdoor’s 2015 Highest-Rated CEOs for Small and Medium Companies. If you’re looking for a place where your work can be personally and professionally rewarding, don’t just join a company with a mission. Join a mission with a company behind it.  We are looking for bright and energetic individuals to fill a data analyst position in our Analytic Services department. This position involves the programming and analysis of healthcare data with an emphasis on clinical measures.. What You’ll Be Doing:Develop programs to monitor physician performance on clinical indicators using SAS and an internally developed Unified Expression Language based syntaxInvestigate issues in healthcare data from acquisition through presentation in the UIPerform ad-hoc analysis for clients and the Evolent teamImplement analytic directives on healthcare data from senior staff and clients and develop reports as neededAssist in designing, documenting, programming and standardizing processes, reports, and other analytic offeringsAssist in clinical quality measure specification documentation and configurationParticipate in quality assurance of clinical quality measures including test case creation, SAS/SQL/Unified Expression Language/XML code review, independent results validation, and pulling of sample cases from client data to support User Acceptance TestingThe Experience You’ll Need (Required):2 years of SAS and SQL2 years of experience with healthcare data and large databasesAdvanced SAS programming skills, including proficiency in Base SAS, SAS MACROS, Stored Procedures, SAS/ACCESS to relational databases, and the SQL Pass Through FacilityMust be analytical, detail oriented, and possess desire to advance and grow personally and professionallyAbility to multi-task and manage multiple projects with varying timelinesExcellent PC and database skillsAbility to effectively communicate with clients and non-technical team membersBS, BA, or Masters in Public Health, Epidemiology, Statistics, Economics, Computer Science or a comparable program with a quantitative emphasis or equivalent experienceFinishing Touches (Preferred):Experience with national healthcare performance measures including HEDIS and PQRS a plusExperience with Unified Expression Language, MapR, Jira, and Confluence a plusEvolent Health is an equal opportunity employer and considers all qualified applicants equally without regard to race, color, religion, sex, sexual orientation, gender identity, or national origin."}