{"jobID": "2826642812", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.culturefit.com", "Headquarters": "Deerfield, IL", "Size": "1 to 50 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data ScientistCompany Description  Our client connects hotel guests and staff using fast, reliable, user-friendly data and voice communications. The unique combination of hospitality expertise and a holistic technology platform is what sets us apart. And our obsession to deliver excellence at every step in the client relationship is what fuels our growth, allowing us to serve more than 4,000 hotels and touch over 1,000,000 users each day. As the pioneer of high speed internet for travel and hospitality clients, we’re leading innovation in the areas of cloud-based PBX/VOIP as well as WAN/LAN management with the goal of delivering guests a “just like home” connectivity experience that boosts guest satisfaction and loyalty for our clients.  Job Details  We are looking for a Data Scientist to work with our engineering teams on data analysis and predictive analytics in the context of a large distributed network/data center environment. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization, identify ‘problem’ trends and metrics, and implementing predictive logic in a proactive sense. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. The right candidate will have a passion for discovering solutions hidden in large data sets and designing large autonomous systems while working with stakeholders to improve business outcomes.  PRIMARY RESPONSIBILITIES INCLUDE, but are not limited to:  Work with stakeholders within the engineering teams to identify opportunities for leveraging company data to drive business solutions  Mine and analyze data from company databases to drive optimization and improvement of product development, marketing techniques and business strategies.  Assess the effectiveness and accuracy of new data sources and data gathering techniques.  Develop custom data models and algorithms to apply to data sets.  Use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.  Develop company A/B testing framework and test model quality.  Coordinate with different functional teams to implement models and monitor outcomes.  Develop processes and tools to monitor and analyze model performance and data accuracy. REQUIRED QUALIFICATIONS: Strong problem solving skills with an emphasis on product development.  Strong Practical experience with Python, (R desirable) with the following libraries/tools: NumPy, Pandas, Seaborn, Matplotlib, Plotly, Scikit-Learn, Tensorflow and SQL/noSQl to manipulate data and draw insights from large data sets.  Experience working with and creating data architectures, specifically within NoSQL environments (experience with Elastic and Cassandra is preferred)  Knowledge and understanding of a variety of machine learning techniques (clustering, decision tree learning, neural networks, etc.) and their real-world advantages/drawbacks.  Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.  Knowledge and understanding of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.).  Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.  Excellent written and verbal communication skills for coordinating across teams.  A drive to learn and master new technologies and techniques. PREFERRED QUALIFICATIONS: Experience using cloud services such as AWS, S3, GCP, etc.  Experience analyzing data using providers such as Google Analytics, Site Catalyst, Coremetrics, Adwords, Crimson Hexagon, Facebook Insights, etc.  Experience with systems management and automation tools such as Chef, Puppet, Ansible, etc.  Experience working with and managing Linux based environments  Knowledge and understanding of general networking concepts  Experience with data ingestion pipelines and distributed data/computing tools such as the Elastic stack, StaMap/Reduce, Kafka, Hadoop, Hive, Spark, Gurobi, NoSQL, etc.  Experience visualizing/presenting data for stakeholders using tools like Kibana, Periscope, Business Objects, D3, ggplot, etc."}