{"jobID": "2721176135", "jobLocation": "Chicago_IL", "jobTitle": "Applied Data Science Lead", "companyRating": null, "companyInfo": {"Website": "www.lumere.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "What you will be doing: As our Applied Data Science Lead at Lumere, you will manage a team responsible for building and maintaining the predictive models that power our product and business. Youll work directly with Product Managers, Engineers and our Director of Clinical Data to conceptualize and develop new applications of our data that further our evidence-based mission to improve healthcare.  The successful candidate will be self-motivated individual with excellent communication and technical leadership skills and a proven track record of delivering robust and actionable models. He or she will be experienced with a wide variety of data science techniques, tools and platforms, able to articulate the benefits of each and appropriately balance speed of delivery with accuracy and maintainability. Responsibilities Include:Managing a cross-functional team of data science and engineering professionalsImproving the quality of our existing models; ongoing maintenance of our modeling infrastructurePresenting outputs to stakeholders for feedback and iterationWorking with product management and engineering to integrate predictions into our solutionsQualifications:4+ years experience in quantitative analysis; 2+ years of data science, predictive modeling, or applied statistics experience; Masters or PhD in a quantitative field preferredStrong product instincts and a demonstrated ability to learn the domain at hand, communicate, and work cross-functionallyExtensive experience with a wide variety of different algorithms and an ability to communicate effectively about the trade offs between approachesExperience with our existing stack (R/Python, scikit-learn, tensorflow)Exposure to natural language processing techniques and distributed compute technologies such as Apache Spark or HadoopStrong SQL proficiency and a working knowledge of both relational database/warehouse technologies (MySQL, Postgres, Redshift) as well as database performance considerationsWorking knowledge of professional software development tools and processes (Scrum, git, etc.)Organized, highly motivated individual with excellent collaboration, project management and problem-solving skills"}