{"jobID": "2829585494", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.northropgrumman.com", "Headquarters": "Falls Church, VA", "Size": "10000+ employees", "Founded": " 1939", "Type": " Company - Public (NOC) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "Northrop Grumman is seeking a Data Scientist to support our Headquarters, Department of the Army (HQDA) Office of the Deputy Chief of Staff G-1, Army Resiliency Directorate (ARD) team in Arlington, VA.The research team conducts advanced analytics and research support for the Department of Defense (DoD). The team works primarily within a data environment that contains administrative, personnel, survey, and medical data representing millions of individuals.Projects focus on health, resilience, and readiness among military service members, and include population-based studies, machine learning applications, measurement analysis, and pilot program evaluations.The Data Scientist will support several projects. Primary tasks include: developing data mining and modeling plans; describing, exploring, and verifying data quality; selecting, cleaning, constructing, integrating, and formatting data; selecting modeling techniques; generating training, testing, and validation designs; building and evaluating models; developing visualizations of model results.Candidates should have a Master's Degree (or Bachelor's degree with equivalent experience) from an accredited college or university in Operations Research, Statistics, Epidemiology, Biostatistics, Applied Mathematics, Industrial Engineering, Economics, or other technical degree in a relevant field. Ideal candidates will have advanced analytical skills, with demonstrated experience with analyses such as predictive analytics, survival analysis, longitudinal modeling, network analysis, and optimization.Responsibilities:Serves as a remote team Data Scientist in the Office of the Deputy Undersecretary of the Army, Army Analytics Group's Research Facilitation Laboratory located in Monterey, CA, responsible for developing statistical models and methods to support predictive analytics to help Army Leaders achieve and sustain individual readiness and optimize human performanceUtilizes data analytics, statistics, mathematical and communication skills while working in a multi-functional team environmentApplies operations research, statistical, mathematical, and analytical techniques related to Health, Resilience, and Personal ReadinessProvides analysis and develops informational papers, presentations, and other correspondence as requiredPresents data to senior military and civilian leaders and provides recommendations as necessaryPerforms data consolidation, cleansing and analysis, and presents data from one or more source systemsCoordinates quarterly site visits for Project Portfolio Manager and research team membersBasic Qualifications:Bachelor's(with at least 10 years' experience) from an accredited college or university in Operations Research, Statistics, Epidemiology, Biostatistics, Applied Mathematics, Industrial Engineering, Economics, or other technical degree in a relevant fieldExperience with statistical analyses involving anomaly detection (e.g., support vector machine, principal component analysis), clustering (e.g., k-means, hierarchical), regression (e.g., linear, multi-level), two- and multi-class classification (e.g., logistic regression, decision tree, neural network)Proficiency with statistical programs such as R (preferred), Python (preferred), SAS, SPSS, and MATLAB.Demonstrated experience in data management (e.g., Oracle, SQL)Ability to collaborate in a team environmentAbility to comprehend and analyze complex problemsAbility to obtain/maintain Department of Defense (DoD) Secret clearanceExcellent written and oral communicationU.S. Citizenship is requiredPreferred Qualifications:Master's Degree (with at least 7 years' experience) in Operations Research, Statistics, Epidemiology, Biostatistics, Applied Mathematics, Industrial Engineering, or Economics.Proficiency in R and/or Python statistical programs; demonstrated experience with SQLDemonstrated experience developing data visualization products such as R Shiny, Tableau, and QlikExperience working on the Army Staff, Army Commands or Joint StaffFamiliarity briefing senior military and civilian leadersModeling and simulation experience, especially with DoD applicationsKnowledge of the U.S. Army's health promotion, risk reduction, and suicide prevention programsActive DoD Secret Clearance Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit www.northropgrumman.com/EEO. U.S. Citizenship is required for most positions."}