{"jobID": "2827367667", "jobLocation": "Palo_Alto_CA", "jobTitle": "Intern, Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "116000", "jobDescription": "Requisition ID: 187738 Work Area: Software-Development Operations Expected Travel: 0 - 10% Career Status: Student Employment Type: Intern    COMPANY DESCRIPTION SAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.  SAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives. Purpose & Objective of Position We are looking for a passionate data scientist to work in Innovation Center Silicon Valley to solve real customer problems through machine learning & AI. This position is meant for you if you are looking for an exciting opportunity to explore new areas, to apply machine learning to complex business challenges.    Expectations & TasksStrong enthusiasm and interest for new technologies and solving real customer problemsAbility to build Machine learning models (deep learning or statistical) based on real customer data & challengeBeing able to tackle complex technical challenges independently and as a member of small teams   Educational Requirements(degrees, class completion, etc.) MS, BS or Ph.D. in Statistics, Computer Science, Electrical Engineering, Applied Math or related topicsExperience with machine learning & artificial intelligence (data science, computer vision, NLP ,etc.).Proficient in one or more programming languages such as Java, C++, Python, JavaScriptFamiliar with one or more machine learning or statistical modeling toolsEnjoying ambiguous challenges, fast iterations and independent thinkin   Qualifications: Requires candidates to currently be enrolled in an undergraduate, Masters, MBA or PhD degree program which is applicable to the position. WHAT YOU GET FROM US Success is what you make it. At SAP, we help you make it your own.  A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now. SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team. (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. Successful candidates might be required to undergo a background verification with an external vendor. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.  Successful candidates might be required to undergo a background verification with an external vendor. Additional Locations:"}