{"jobID": "2703204243", "jobLocation": "Washington_DC", "jobTitle": "Mainframe Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.systemone.com", "Headquarters": "Pittsburgh, PA", "Size": "5001 to 10000 employees", "Founded": " 1979", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ALTA IT Services is seeking a Sr. Data Analyst / Modeler to support our direct client in Washington DC. Candidates must have experience working in a mainframe environment and be familiar with Cobol. Please send resumes to emariani@altaits.com  Data Analyst  Washington DC  Long term contract  Data Cleaning identify erroneous data and determine appropriate resolution  Analyze and assess the quality and integrity of the data  Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality  Understand the meaning/business context of data  Acquire data from internal or external data sources and maintain mapping documents of the files, databases/data systems.  Perform data analysis and data modeling to create source to target mappings.  Evaluate risk from statistical information to determine risk to operations or non-compliance.  Perform gap analysis of data requirements versus current data sources.  Work closely with business analysts and source data experts to develop data requirements.  Assess current data and assist in the resolution of data anomalies.  Interpret data, analyze results using statistical techniques and provide ongoing reports and feedback  Required Qualifications5+ years demonstrated experience as Data Analyst  Strong Structured Query Language (SQL) skills  Demonstrated ability to perform complex queries, assess data quality and develop data mappings.  Working knowledge of U.S. Healthcare Industry  Experience with multiple data warehousing and analytics development projects  B.S. in Mathematics, Engineering, or Computer Science  Preferred QualificationsMaster of Science in Mathematics, Engineering, or Computer Science  Working knowledge of HEDIS, Fraud, Waste & Abuse  Working knowledge of ETL  Experience with Hadoop and Big Data technologies  Working knowledge of ALM  Working knowledge of COBOL  ALTA IT Services, LLC. is an equal opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, disability, veteran status, sexual orientation, or any other factor."}