{"jobID": "2756105942", "jobLocation": "Princeton_NJ", "jobTitle": "Data Scientist - Temporary Project Assignment", "companyRating": "3.9", "companyInfo": {"Website": "www.munichre.com", "Headquarters": "Munich, Germany", "Size": "5001 to 10000 employees", "Founded": " 1880", "Type": " Company - Public (MUV2) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": " Length of Assignment: Varies, depending on skill set of candidate and projects assigned; expect up to 12 months.  Depending on the experience, background, and expertise of the candidate, projects may include: Develop and implement models to enhance pricing and risk selection, working together with actuaries and underwriters.Appropriately document model development, maintenance and use.Develop roadmap to implement models and oversee the implementation of the models, including communication, training, testing.Provide training, guidance, consultation to actuaries or other professionals seeking to applying analytical methods in their work.5 or more years of data and analytics experience including business intelligence, data mining, modeling and using predictive analytics tools.Strong understanding of actuarial knowledge and techniques. Experience in applying analytics in commercial insurance pricing domain, preferred. Experience with building GLMs and other analytics models, a plus.Strong knowledge of various programming languages preferred, ie, R, SQL, SAS, Python, etc.Prior experience working with data and analytics programs through lifecycle (gathering data, design, recommendations, testing, implementation, communication, revisions)Strong analytics and problem-solving capabilities required, including advanced skills in statistical analysis.Strong communication and business relationship skills to effectively explain analysis, both verbally and in writing, to others and translate analysis into a clear business planStrong time management and organizational skills to gather and make use of data (both internal and external). Ability to work independently and drive project to completion"}