{"jobID": "2517767253", "jobLocation": "Ne_Jersey", "jobTitle": "Environmental Scientist –", "companyRating": null, "companyInfo": {"Website": "www.bemsys.com", "Headquarters": "Chatham, NJ", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This opportunity will award the right individual the ability to procure appropriate sample materials from the field by working with other members of the team, including drillers.. Using these materials, you will perform laboratory data validation and review. Additionally, you will also perform the following duties: Environmental laboratory chemical analysis data.Coordinate sampling requirements and schedules with laboratories and BEM’s Project Managers.Work with BEM’s laboratory database management systems.Write reports for environmental projects.Qualifications:Bachelor’s degree or higher in Environmental Science, Chemistry or related area; college coursework in Chemistry (2 years) and Computer Science (1 semester or more) or equivalent experience.2-4 years experience working in a laboratory or environmental consulting company with appropriate field experience.Environmental laboratory analytical data validation experience.Intermediate level in MS Access or any other database management software (SQL Server, Oracle, etc.).Basic level programming experience in any computing language (Visual Basic preferred, includes VBA or other macro languages).Intermediate level MS Excel (formula driven, etc.).Intermediate level MS Word.Intern experience will be considered.Experience supervising and working with external teams in the field.Completion of OSHA Hazwopper40 and 8 hour refresher courses.Self-starter with ability to work with minimal supervision.Attention to detail and excellent communication skills.Well organized, capable of balancing different priorities simultaneously.Ability to perform well under pressure and within established deadlines.Ability to work extra hours during periods of high volume.Demonstrated passion for your profession and how it impacts your world.Benefits: We value our employees’ time and efforts. Our commitment to your success is enhanced by our competitive salary and an extensive benefits package including paid time off, medical, dental and vision benefits and future growth opportunities within the company. All full-time employees are also eligible for participation in our Employee Stock Purchase Plan (ESPP) and company-matching 401(k) Savings Plan. Plus, we work to maintain the best possible environment for our employees, where people can learn and grow with the company. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture. "}