{"jobID": "2815753835", "jobLocation": "Troy_MI", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.cdicorp.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1950", "Type": " Company - Public (CDI) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analyst TROY, Michigan, United States Location: Remote. However, must be able to work onsite for initial training at 1960 RESEARCH DRIVE, SUITE 200, Troy, MI 48083  Maintains the General Motors Corporate Supplier Identification Source (CSIDS). This Database is set up to track all activity and supplier information globally. KEY RESPONSIBILITIES PROCESS CUSTOMER REQUESTS by reviewing data for deficiencies; resolving discrepancies by using standard procedures or returning inaccurate documents to the supervisor for resolution. VERIFIES INFORMATION by searching Dun & Bradstreet databases using established search criteria; identifying appropriate Duns for legal company name and address. PRODUCES INFORMATION by initiating telecommunications to verify supplier data if not identifiable in D & B. PREPARES SOURCE DATA FOR COMPUTER ENTRY by compiling and sorting information; establishing entry priorities. ENTERS SOURCE DATA by inputting alphabetic and numeric information according to CSIDS screen format and customer policies. MAINTAINS HISTORICAL RECORDS by documenting system changes and revisions and storing documentation for a three month period. REQUESTS INFORMATION AND UPDATES by contacting D & B via electronic mail; initiating investigation to update or establish supplier records. ENSURES CUSTOMER AND USER SATISFACTION by resolving open issues by providing instructional information as requested. MAINTAINS OPERATIONS by following policies and procedures; reporting needed changes. CONTRIBUTES TO TEAM EFFORT by accomplishing related results as needed. PREPARES ALL DESIGNATED CDI AND CUSTOMER PERSONNEL TO USE THE SYSTEM by conducting training sessions. MAINTAINS PROFESSIONAL AND TECHNICAL KNOWLEDGE by attending educational workshops.DISCLAIMER: The above essential functions are a summarized list. It is not intended to be a complete list of all the duties and responsibilities.  PERFORMANCE CRITERIADemonstrates Leadership Influences others by example Meets goals and objectives Maintains positive relationshipsActs with Integrity Sound business ethics are consistent Follows through on commitments Honest and fair with allManages Execution Establishes priorities for his/her work Manages time well Handles paperwork effectivelyAchieves Results Action-oriented Doesn't wait to be told to take action Persists despite obstacles and oppositionShows Work Commitment Steps up to responsibilities Sets high standards of performance Champion of corporate valuesTeam Player Supports team goals Helps others Focuses on team successDemonstrates Adaptability Handles day-to-day work challenges confidently Willing and able to adjust to multiple demands, shifting priorities, ambiguity and rapid change Shows resilience in the face of frustration or adversityCommunicates Effectively Speaks in a clear, articulate and concise manner Pays attention when others are speaking Checks and validates for understandingQuality-Focused Demonstrates commitment to quality Supports QBS initiatives Adds value to the organization JOB QUALIFICATIONSPersonal Characteristics Aligned with Performance Criteria Demonstrates leadership Acts with integrity Manages execution Achieves results Shows work commitment Team player Demonstrates adaptability Communicates effectively Quality-focusedJob-Related Knowledge, Skills, Abilities Knowledge of corporate policies Computer skills in Windows XP of Higher Ability to handle multiple tasks simultaneously Organization and time management skills Ability to use analytical thought process Active listening skillsEducation High school diploma required; Associates Degree or applicable professional experience preferredJob-Related Experience Background in an office environment with strong telecommunication skills Order Desk/Help Desk background preferred Type: Contract  Reference ID: 387138"}