{"jobID": "2775895508", "jobLocation": "Pleasanton_CA", "jobTitle": "Data Scientist - Deep Learning", "companyRating": "3.2", "companyInfo": {"Website": "www.veeva.com", "Headquarters": "Pleasanton, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Unknown", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " Our Company  At 2,000 employees and growing, and consistently strong financials (NYSE:VEEV), Veeva was named among the top fastest growing public technology companies on Forbes' annual Fast Tech 25 list. We build innovative cloud solutions for some of the world's largest pharmas and biotechs, and we need great people like you to make it happen.  Our Culture & People  Our core values are Employee Success, Customer Success, and Speed. We are innovators, collaborators, and thought leaders out to create best-in-class solutions that help our customers improve and extend human life. It's genuine, straight-forward, and no fuss.  Job Summary  We're looking for a talented Deep Learning focused Data Scientist to join our growing analytics team, with strong machine learning background, to help us deliver next generation smart features for Veeva Life Science customers. Our ideal candidate is machine learning / statistician / data wrangler who has extensive experience with deep learning frameworks specifically like Tensorflow, or others like MXNet, Theano, or Caffe, and a strong sense of the emerging client side technologies like CoreML.  As part of our growing analytics team at Veeva, you will work side by side with other analytically focused scientists, developers, and product managers, to deliver analytically driven applications in our Veeva Commercial Solution Suite. Veeva sits in a unique position within Life Sciences, with critical relationships with most of the biggest companies in the industry, and is delivering data driven capabilities to change the way business is done. If you relish using data to transform an industry, play well on smart teams, driving deep learning techniques to change the industry, enjoy helping our customer's find the needle in the haystack, and are looking for an opportunity to work with a fast growing company let's talk! ResponsibilitiesWork with engineers to integrate NLP and Vision deep learning methods to facilitate advance \"Smart\" features for Veeva mobile users.Develop framework and platform for mass-training of advanced modelsEvaluate emerging technologies for server and client model evaluation, frameworks, platforms.Combine your love and knowledge of quantitative data analysis across large data sets with solid presentation skillsUse statistical methods to derive new metrics, to help Veeva customers gain competitive advantageRequirementsB.S. in Engineering (CS, Math, Stat or computer related)5+ years experience in data analytics or data science, or experience in a suitable advanced analytic domain (analytic-driven research, etc.)Exceptional knowledge of, and extensive experience with, SQL for data analytics, loading, and transformation.Hands on coding experience with Python or JavaHands on experience with ML frameworks like CoreML, TensorFlow, MXNet, Theano and strong understanding of core Tensor Flow concepts.Good understanding of ML techniques such as Natural Language Processing, Computer Vision. Nice to Have Hands on experience with CoreMLExpertise working within an Agile development environment.Expertise working with Real-time Analytic environments, providing instant model feedback from high volume transactions.Familiarity with source control platforms, primarily GitHub, and data engineering & development best practices About Veeva  Veeva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, sex, sexual orientation, gender identity or expression, religion, national origin or ancestry, age, disability, marital status, pregnancy, protected veteran status, protected genetic information, political affiliation, or any other characteristics protected by local laws, regulations, or ordinances.SDL2017"}