{"jobID": "2707895266", "jobLocation": "Mountain_View_CA", "jobTitle": "Chief Data Scientist (Search & Discovery)", "companyRating": null, "companyInfo": {"Website": "www.coupang.com", "Headquarters": "Seoul, South Korea", "Size": "1001 to 5000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Coupang is one of the largest and fastest growing e-commerce platforms on the planet. Our mission is to create a world in which Customers ask How did I ever live without Coupang? We are looking for passionate builders to help us get there. Powered by world-class technology and operations, we have set out to transform the end-to-end Customer experience -- from revolutionizing last-mile delivery to rethinking how Customers search and discover on a truly mobile-first platform. We have been named one of the 50 Smartest Companies in the World by MIT Technology Review and 30 Global Game Changers by Forbes.Coupang is a global company with offices in Beijing, Los Angeles, Seattle, Seoul, Shanghai, and Silicon Valley.About the role:PhD degree in Statistics, Mathematics, Operations Research, Econometrics, or related field5+ years of experience in analyzing large data sets to drive significant business decisionsStrong statistical background, especially in experimentation and modellingProficiency in a statistics tool like R and Big Data tools (Hive, Spark, Presto)Exceptional presentation skills and ability to communicate methodologies, results clearly and concisely to company's top executivesLead strategic analyses to understand customer behavior and develop business success metricsStrong interpersonal skills to work with cross-functional teamsAbility to drive research projectsBonus points for:Experience with experimentation methodologies - post-stratification, quasi-experimental research designs, sequential testingExperience with Bayesian techniques, Multi-armed bandit algorithmPerks:Autonomy to make decisions in a rapidly growing companyFree medical, dental, and vision insurance15 days PTO + 12 national holidays off + 3 floating holidays401K matchingPre-IPO stock optionsMobile & fitness reimbursementFlexible working hoursCatered lunchIt is the policy of Coupang Global LLC to afford equal opportunity for employment to all individuals regardless of race, color, age, national origin, physical or mental disability, history of disability, ancestry, citizenship status, political affiliation, religion, gender, transgender, gender identity, marital status, status as a parent, sexual orientation, veteran status, genetic information or other factors prohibited by law, and to prohibit harassment or retaliation based on any of these factors."}