{"jobID": "2721402761", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Data Analyst - Maps Navigation Insights", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "115000", "jobDescription": "Senior Data Analyst - Maps Navigation Insights Job Number: 55538198Santa Clara Valley, California, United StatesPosted: Jun. 8, 2018Weekly Hours: 40.00 Job SummaryLocation-based services are a significant part of our everyday lives. Whether you are looking for the fastest way home, trying to plan out your next road trip or want to know how bad traffic is, you are relying on services provided by our team.  We will help you contribute to the foundation of building great customer experiences. With features that have become an indispensable part of millions of lives around the world. Helping to address questions like \"Where have you been?\" and \"Where do you need to go next?\" and \"When should you leave to get there?\" are all questions we strive to address in our every day solutions.Key Qualifications Our team is looking for a creative and dedicated individual to join us in building the most innovative solutions possible. In this position, you will be using data to develop insights into product performance and identify area for improvement. Responsibilities include analyzing large quantities of data to determine potential areas of improvement and working with navigation engineers to develop solutions.FOR OUR TEAM, YOUR TOOLKIT WILL INCLUDE:5-8+ years of experience in an analytics role with large imperfect data setsExpert SQL skillsExperience with statistical or data mining methodologies Strong faculty with at least one programming language (C++ or Java preferred)Exceptional attention to detail and attention towards the customer experienceSelf-motivated, curious and dedicated, with demonstrated creative and critical thinking capabilities and an innate drive to improve how things workExcellent communications skills with experience presenting data driven and actionable insightsFlexible and able to deal with ambiguity, address uncertainty and adapt to changing prioritiesWilling to work at a very detailed level while still being able to abstract ideas for communication to diverse teams and senior management DescriptionThe Maps Navigation team would love to partner with a senior data analyst to work with the engineering and analytics teams to help identify and champion service improvement opportunities. You will identify and execute work by developing hypotheses and utilizing data quantify impact. As a member of our team, you will help identify root cause by working with your engineering counterparts and will become an integral part of helping develop solutions. Furthermore they will work multi-functionally to ensure the insights are well understood, correctly interpreted, and optimally applied. Ideally, you will thrive in a small cross-functional team, collaborates well with others, and enjoy working on all aspects of improving our user's experiences.EducationBS or MS in Computer Science or a related field, or equivalent experience.Additional RequirementsThe following experience is nice to have, but not required: Navigation or GIS software Large scale data processingPython/Ruby"}