{"jobID": "2820633373", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "PMTS Data Science", "companyRating": null, "companyInfo": {"Website": "www.cmp.jobs", "Headquarters": "New York, NY", "Size": "1 to 50 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Network Capital Analysis and Strategic Transformation team is hiring a strategic thinker to join a high profile, high visibility team that powers Network analytics and strategic thinking for Employer. You will be part of a team that drives business decisions and optimized capital investment for the Employer Wireless and Wireline Networks. That includes building tools, creating analyses, and discovering insights into our Networks that can be used to optimize our capital plan. We create actionable operational and strategic insights as well as visualizations for senior leaders in the company across multiple organizations. You will be part of the team that shapes multi-billion dollar investments for the nation's largest and best networks and guiding Employer into future network investments. This is a job for an intelligent, decisive, quick, forward-thinking, strategic, and tactical thought leader. You have exceptional influencing skills and preferred experience working across areas and levels of an organization. Specifically this employee will be managing the global network & technology multi-year strategic network plan spanning across all of Employer's network technology domains. RESPONSIBILITIES: Data Science: Architect and design solutions to complex predictive & prescriptive modeling challenges including capital optimization across our Networks Research and develop analyses, forecasting, and optimization methods to improve the quality of Network quality of service; example application areas include throughput optimization & end-user behavioral modeling Develop and implement machine learning and optimization algorithms across multiple platforms to create scalable solutions with actionable insights from complex data sets Lead strategic efforts across the Network organization, leveraging advanced analytics to optimize processes and procedures that lead to improved Network KPIs, capital optimization and cost reduction Use statistical modelling and analysis to understand relationships between diverse forms of customer data, network data and business KPI's. Design and implement data architecture, analytics environments, and methodologies for analyzing and storing large sets of structured and unstructured data. Business Intelligence: Make business recommendations (e.g. cost-benefit, forecasting, experiment analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information. Define key success metrics and create dashboards / reports to communicate results and monitor KPIs. Lead a large strategy team to develop and communicate Employer's network technology strategy Lead the creation of new data processes as identified through industry benchmarking and collaboration with Employer's data scientist community. Lead a large cross-functional team to create resource (Full Time Equivalent) models that support the Intelligent Edge Network, Network Transformation, OneFiber, & Business as usual activities Cross Functional Collaboration Ability to manage multiple projects simultaneously, adapt to changing priorities and meet aggressive deadlines. Being the go-to-person for network & technical modeling questions, including familiarity with next-gen network architecture and applications. Collaborate with IT and business stakeholders to ensure data governance audit standards. Participate in cross-functional project teams as predictive modeling subject matter expert. Executive Presentations: Ability to analyze complex data sets, draw conclusions and relationships and develop actionable recommendations. Effectively communicate actionable insights to category leads supporting their goals and objectives. Prepare executive level presentations to clearly articulate results of complex mathematical analyses. YourMembership_RPM. Keywords: Data Scientist, Location: Basking Ridge, NJ - 07920"}