{"jobID": "2757838222", "jobLocation": "Austin_TX", "jobTitle": "Data and Reporting Analyst, Content", "companyRating": "3.6", "companyInfo": {"Website": "www.indeed.com", "Headquarters": "Austin, TX", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Simply Hired, CareerBuilder, Glassdoor"}, "estimatedSalary": "53000", "jobDescription": " Ref#: R0011379 Our mission.  As the world’s number 1 job site, our mission is to help people get jobs. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for job seekers. The team.  We are the people behind the scenes of Indeed's search results. We ensure that our results are ranked as best as they can be for our job seekers and that they’re not being duped by scams or fraud. Beyond search, we invest heavily in ensuring that Indeed has the best data analysis tools available to optimize our recruiting products and run accurate A/B tests. Simply put, we help people get the right jobs. Your job.The Content Operations team’s main goal is to develop, launch, and scale market-appropriate content scouting initiatives to advance Indeed's global comprehensiveness and increase our understanding of international employment landscapes.  Data and Reporting Analyst works closely with stakeholders across functions and regions to support the team in organizing approaches to the study of the information needs of Indeed organization's management at every level in making operational, tactical, and strategic decisions. Its objective is to design and implement procedures, processes and routines that provide suitably detailed reports in an accurate, consistent, and timely manner.  Indeed employees are united by one common mission: they help people get jobs. The company’s success is due to the fact that their employees are laser-focused, collaborative, passionate, data-driven and committed to results.  Responsibilities: Scope, design and execute market/segment specific insights, analyses and toolsSupport the evaluation of workflows and automation solutions through data analysis to expedite and improve precision of manual processesAbility to scale and maintain reporting, tools across Content Operations TeamLead sophisticated research and analysis through internal and external tools (e.g. revenue, customer satisfaction, content strategies, competitive trends and insights) for leadership to support decision-makingMonitor and measure the effectiveness of processes post-implementation to ensure they continue to provide a positive impact on the team and are appropriate for the businessCollaborate cross-functionally (with Sales, Finance, BI, Quality and Service teams) to refine recommendations and develop joint action plansAble to synthesize data and research into clear and concise proposals for management About you.Requirements: Bachelor's degree with quantitative coursework (e.g., Economics, Computer Science, Finance, Management) or equivalent practical experience4+ years of work experience in Sales, Marketing and/or ConsultingWorking experience with programming languages, especially for data manipulation (e.g. SQL, Python, R, etc)Experience with Tableau or equivalent tool to create impactful reports, visualizations, and interactive dashboardsDistinctive problem solving and analysis skills, ability to solve complex and diverse business problems (commercial, operational, organizational)Demonstrate leadership and gain respect across functions/teamsTech-savvy with interest in product and strong analytical problem solving skillsExperience with an online CRM/SalesForce preferredProficiency with Google G Suite (Gmail, Sheets, Docs, Hangouts, etc.) or Microsoft OfficeProject management skills and experience with process evaluation and design (lean principles)International experience and/or multicultural skillsExcellent written and oral communication skillsClient service mentality, adaptability and willingness to collaborate openly with other functionsExperience with fast-paced, sales-force driven business modelIndeed provides a variety of benefits that help us focus on our mission of helping people get jobs. View our bounty of perks: http://indeedhire/IndeedBenefits"}