{"jobID": "2808173458", "jobLocation": "Princeton_NJ", "jobTitle": "Associate Research Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Position Description and ResponsibilitiesThe position will be responsible for characterizing transporter phenotyping of investigational compounds in support of discovery and development. As an Associate Research Scientist within the Metabolism and Pharmacokinetics (MAP) group, this individual will work closely with MAP representatives and transporter lead to conduct various in vitro transporter studies including cell-based uptake/efflux transporter and hepatocyte uptake studies, and generate research reports. The position will also involve in developing new technologies to advance our understanding of drug transporter involvement in pharmacokinetics (PK) and drug-drug interactions (DDI). The individual is required to design/conduct/report in vitro assays and coordinate in vivo studies. The scientist will be responsible for data quality, reports and meeting project timelines. This scientist will maintain critical reagent supply and adhere to budget for assigned assays. Ensuring proper controls to maintain high data quality is an absolute expectation.Position Description and ResponsibilitiesThe position will be responsible for characterizing transporter phenotyping of investigational compounds in support of discovery and development. As an Associate Research Scientist within the Metabolism and Pharmacokinetics (MAP) group, this individual will work closely with MAP representatives and transporter lead to conduct various in vitro transporter studies including cell-based uptake/efflux transporter and hepatocyte uptake studies, and generate research reports. The position will also involve in developing new technologies to advance our understanding of drug transporter involvement in pharmacokinetics (PK) and drug-drug interactions (DDI). The individual is required to design/conduct/report in vitro assays and coordinate in vivo studies. The scientist will be responsible for data quality, reports and meeting project timelines. This scientist will maintain critical reagent supply and adhere to budget for assigned assays. Ensuring proper controls to maintain high data quality is an absolute expectation.Position RequirementsBS in chemistry, biochemistry, biology or related field with minimum of 1 year experience in ADMET or related field. The position requires close collaborations with functions across BMS sites to support project teams. Experience in cell culture (such as HEK, immortalized cells, or primary cell lines), cell transfection, transport kinetics, transporter inhibition, transporter phenotyping is required. Knowledge of drug-metabolizing enzymes, PK, LC-MS/MS quantification is preferred. Experience with using radiolabeled substances is required. Good communication, interpersonal and organizational skills are essential so are ability of multitasking, rapid study execution and working in the laboratory with limited supervision."}