{"jobID": "2819754297", "jobLocation": "San_Jose_CA", "jobTitle": "Manager, Platform Engineering", "companyRating": "4.2", "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": "171000", "jobDescription": "The challenge: Adobe is an industry leader in customer intelligence. We have solutions to empower our enterprises to understand their customers as people – what they want, need, and believe, and to leverage insights to help business to deliver the most delightful customer experiences.  Our engineering team is responsible for the Adobe Data Platform which is the foundation for the Adobe Experience Cloud. Adobe has dozens of petabytes of data to manage and bring value to our customers. The Data Platform provides state-of-the-art capabilities for data integration, data governance, advanced analytics and machine learning services. We use Big Data and open source technologies to develop various services for Adobe Solutions, Customers and Partners.  The scalable database engine is a key component of the Adobe Data Platform. We are building a next generation of Query Services that can scale at the petabyte level. We are looking for strong candidates with expertise in both SQL and no-SQL databases as well as commercial or open source SQL query engines. What you need to succeed:5+ years as Engineering Manager3+ years as an Architect working on enterprise software (this is a very technically \\\"hands-on\\\" management role)Recognized Subject-Matter Expert in database / big data engineering.Plus to be a Committer or PMC Member with the Apache Software Foundation on big data technologies: Apache Spark, Hadoop Stack, Kafka, Drill, Atlas, ImpalaIn depth experience with No-SQL as well as RDBMSProficiency in data structures and algorithmsCost consciousness around computation and memory requirementsTrack record of extraordinary achievements in the industry of big data & cloud computingStrong verbal and written communication skillsPhD/MS in Computer ScienceStrong management and leadership skillsProficiency in developing very large distributed systems with low-latency streaming.What you’ll doLead the technical design, vision and implementation strategy for major systems & components of the Adobe Experience Cloud data platform.Build and own critical parts of the services and deliver to productionAbility to articulate the design and code choices to cross functional teamsAbility to mentor and guide a high performing teamReviewing and providing feedback on features, technology, architecture, designs, time & budget estimates, and test strategiesManaging projects, mitigating risks & creative problem solvingDeveloping and evolving engineering and business processes to optimize team efficiencyPartner with other teams across Adobe for achieving common goals Adobe values a diverse workforce to help us become a stronger more innovative company.  At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}