{"jobID": "2811292699", "jobLocation": "Chicago_IL", "jobTitle": "Lead Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.nielsen.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1923", "Type": " Company - Public (NLSN) ", "Industry": " Unknown", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": "Lead Data Scientist - 671 Data Science - USA Chicago, Illinois Do you know what consumers buy? What consumers watch? Nielsen Knows!Nielsen is the world’s leading marketing and media information company. We’re passionate about measuring and analyzing how people interact with digital and traditional media, and in-store environments-locally and globally. Businesses worldwide use our services to better manage their brands, launch and grow product portfolios, and optimize their media mix.The primary role of a Lead Data Scientist in Product Enhancement will be to lead the enhancement of the Nielsen set of products throughout Lead Markets. This role will be used to primarily support The Nielsen Connected System, a new way to align your client&apos;s organization around the right data and insights and connect everything they use to measure and improve performance. This role will include in depth data analysis and platform comparisons through the support of internal and external requests, the understanding and application of Nielsen methodologies, and collaboration with internal and external clients. This role provides a great opportunity to work in a global team environment, with touch points into many different departments.Key ResponsibilitiesLead detailed analysis to support product enhancements and key initiativesManage multiple projects simultaneouslyRepresent Product Enhancement in meetings and in interactions with other departmentsOversee end to end implementation of product solutionsAbility to evaluate current methodologies quickly to identify opportunities for enhancementPresent findings and recommendations on methodologyDocument findings, methodologies, and best practicesDetect, troubleshoot, and resolve system anomalies that disrupt client deliverablesMay directly interact with the client to understand its needsProvide explanation of products and methodologies directly to the client in a format that meets their level of understandingContinually develop technological skill setQualificationsAdvanced degree in mathematics, statistics, computer science, operations research, economics, business or fields that employ rigorous data analysis7-9 years’ experience in at least one of the following fields: data science, survey design, behavioral methods, data analysis, business administration/operations, consulting, logistics/supply chain, management information systems, or operations management/researchDesire to learn and continually upgrade skillsDisposition to simplify research, work processes, and complex statistical conceptsQuantitative aptitude with proven data analysis and problem solving skillsProficiency with Python, SAS, R or other statistical packagesExperience in big data technologies and machine learningStrong verbal, presentation, and written skillsStrong planning and organizational skillsProficiency in Excel, Access, PowerPoint and WordAbility to work independently as well as in a team environment #LI-MJ1 About Nielsen: Nielsen N.V. (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers Watch and Buy. Nielsen’s Watch segment provides media and advertising clients with Total Audience measurement services across all devices where content — video, audio, and text — is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry’s only global view of retail performance measurement.  By integrating information from its Watch and Buy segments and other data sources, Nielsen provides its clients with both world-class measurement as well as analytics that help improve performance. Nielsen, an S&P; 500 company, has operations in over 100 countries that cover more than 90 percent of the world’s population. For more information, visit www.nielsen.com Nielsen is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action-Employer, making decisions without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, protected veteran status or any other protected class.Job Type: Regular Primary Location: Chicago,Illinois Secondary Locations: FL - Tampa - Oldsmar, NY - New York City, , Travel: Yes, 15% of the Time"}