{"jobID": "2819788799", "jobLocation": "Laredo_TX", "jobTitle": "DPS - LES - Forensic Scientist I-III (Drug)", "companyRating": "2.8", "companyInfo": {"Website": "www.txdps.state.tx.us", "Headquarters": "Austin, TX", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "DPS - LES - Forensic Scientist I-III (Drug) (00002218) Organization: TEXAS DEPARTMENT OF PUBLIC SAFETYPrimary Location: Texas-Laredo Work Locations: LAREDO (BOB BULLOCK LP)1901 BOB BULLOCK LOOP Laredo 78043Job: Life, Physical, and Social ScienceEmployee Status: RegularSchedule: Full-time Standard Hours Per Week: 40.00State Job Code: 6052 6053, 6054Salary Admin Plan: BGrade: 19 B20, B21Salary (Pay Basis): 3,615.69 - 4,933.11Number of Openings: 1Overtime Status: Non-exemptJob Posting: Jun 18, 2018, 12:53:23 PMClosing Date: Jun 30, 2018, 4:59:00 AMDescriptionPLEASE NOTE:All applications must contain complete job histories, which includes job title, dates of employment, name of employer, supervisor's name and phone number and a description of duties performed. If this information is not submitted, your application may be rejected because it is incomplete. Resumes do not take the place of this required information.  SUBMITTED THROUGH WORK IN TEXAS: Work In Texas (WIT) applicants must complete the supplemental questions to be considered for the posting. In order to complete the supplemental questions please go to CAPPS Recruit to register or login and access your profile. Go to CAPPS Recruit to Sign In https://capps.taleo.net/careersection/ex/jobsearch.ftl?lang=en*****Official Transcripts are Required (Applications without Official Transcripts will be subject to rejection)*****GENERAL DESCRIPTION: Forensic Scientist I - Drug Performs (entry-level) independent laboratory tests, analyses, classifications, comparisons and identifications of all types of physical evidence from crime scenes with emphasis and specific recognized expertise in an option or specialty area identified above. Work involves interpreting analytical and instrumental results, and preparing written opinion reports. Performs crime scene investigations. Testifies as an expert witness in court as to results of analyses. Works under close supervision, with minimal latitude for the use of initiative and independent judgment.  Forensic Scientist II - Drug Performs routine (journey-level) forensic science work. Work involves conducting laboratory tests, conducting analyses, and identifying physical evidence from crime scenes; interpreting analytical results; establishing and maintaining records pertaining to casework and court testimony; preparing technical reports; and testifying as an expert witness in court. Works under moderate supervision, with limited latitude for the use of initiative and independent judgment.  Forensic Scientist III - Drug Performs moderately complex (journey-level) forensic science work. Work involves conducting laboratory tests, conducting analyses, and identifying physical evidence from crime scenes; interpreting analytical results; establishing and maintaining records pertaining to casework and court testimony; preparing technical reports; and testifying as an expert witness in court. Works under general supervision, with limited latitude for the use of initiative and independent judgment.  The following Military Occupational Specialty codes are generally applicable to this position. Applicants must fully complete the summary of experience to determine if minimum qualifications are met. 31B, 31D, 311A, 31A, 649X, 749X, 401, 023, OAP12, 5805, 5803, 7S0X1, 3P0X1, 31PX, 71SXESSENTIAL DUTIES / RESPONSIBILITIES: 1. Receives and returns evidence items and complete proper forms according to strict transfer procedures to guarantee and maintain the integrity of accepted chain of evidence for each item.  2. Contacts various law enforcement officials, crime victims, and others to obtain and/or provide information related to offense to which provided evidence items are relevant.  3. Prepares preliminary and final reports concerning results of each analysis performed.  4. May assist in crime scene investigations, as assigned.  5. Serves as an expert witness in court.  6. Attends work regularly and observes approved work hours in accordance with agency leave and attendance policies.  7. Performs other duties as assigned. Forensic Scientist I - Drug 8. Receives instruction on the operating of complex analytical instrumentation used in the analysis of controlled substances. Reads required training materials and performs proficiency tests on samples provided.  9. Learns and performs basic analysis of plant substance and other drug-containing materials, and completes competency requirements.  10. Learns theory behind clandestine drug manufacturing processes and how to properly process clandestine laboratory and to collect evidence. Forensic Scientist II - Drug 8. Performs analysis of plant substance and other materials for presence of drugs and identifies the drugs present.  9. Learns and performs basic analysis of plant substance and other drug-containing materials, and completes competency requirements.  10. Learns theory behind clandestine drug manufacturing processes and how to properly process clandestine laboratory and to collect evidence.  11. Assists in training technical personnel in laboratory procedures, as assigned. Forensic Scientist III - Drug 8. Researches forensic science field and studies current material in scientific journals regarding new advances and techniques in forensic examinations.  9. Lectures to or instructs law enforcement groups, schools, and others at the discretion of, or, in absence of supervisor.  10. Represents the Department at conferences and meetings.  11. Maintains professional contact with nationwide forensic examiners.  12. Performs more exacting and intricate examinations in most difficult cases and assists and teaches other examiners in the more difficult examinations.  13. Performs analysis of plant substance and other materials for presence of drugs and identifies the drugs present.  14. Learns and performs basic analysis of plant substance and other drug-containing materials, and completes competency requirements.  15. Learns theory behind clandestine drug manufacturing processes and how to properly process clandestine laboratory and to collect evidence.  16. Assists in training technical personnel in laboratory procedures, as assigned.QualificationsEducation and Experience:  Education – Graduation from an accredited four-year  college or university with a major in chemistry with at least 30 semester hours  of chemistry. Experience–Forensic Scientist I - Drug None  Forensic Scientist II - Drug A minimum of one (1) years of full-time work experience as a Forensic Scientist I or the equivalent experience in a recognized crime laboratory in the same respective forensic discipline. Forensic Scientist III - Drug A minimum of three (3) years of work experience as a Forensic Scientist II or the equivalent work experience in the same forensic discipline. Licensure and/or Certification – If driving is required must possess a valid driver license from state of residence. Regulatory knowledge – Working knowledge of, or the ability to rapidly assimilate information related to TXDPS, State and Federal regulations, legislation, guidelines, policies and procedures. Forensic Science – Thorough knowledge of principles, techniques and procedures of related forensic science discipline; of understanding of identification principles. Knowledge of safety procedures for handling hazardous chemicals; of proper evidence handling procedures. Skill in use of laboratory equipment and materials. Ability to:  Coordinate the handling of evidence between sections;  Recommend improvements in methodology and equipment to management;  Communicate findings, orally and in writing, in a clear, concise and effective manner;  Conduct microscopic examinations requiring accuracy and concentration when relevant;  Conduct testing used in examination of evidence  Testify in court as an expert witness. Interpersonal Skills – Must demonstrate an ability to exercise poise, tact, diplomacy and an ability to establish and maintain positive, working/professional relationships with internal/external customers. Ability to work effectively with laboratory, legal, and law enforcement personnel. Organizational and Prioritization Skills – Must be organized, flexible, and able to effectively prioritize in a multi-demand and constantly changing environment; able to meet multiple and sometimes conflicting deadlines without sacrificing accuracy, timeliness or professionalism. Presentation/Communication Skills – Must be able to construct and deliver clear, concise, and professional presentations to a variety of audiences and/or individuals. Research and Comprehension – Must demonstrate ability to quickly and efficiently access relevant information, and be able to utilize and/or present research and conclusions in a clear and concise manner.  Analytical Reasoning/Attention to Detail – Must demonstrate an ability to examine data/information, discern variations/similarities, and be able identify trends, relationships and causal factors, as well as grasp issues, draw accurate conclusions, and solve problems. Technology (computers/hardware/software/operating systems) – Must possess appropriate levels of proficiency with utilized software and systems and be able to learn new software/systems. Demonstrated proficiency with Microsoft Office Suite (Word, Excel, PowerPoint, and Outlook). Confidentiality and Protected Information – Must demonstrate an ability to responsibly handle sensitive and confidential information and situations, and adhere to applicable laws/statutes/policies related to access, maintenance and dissemination of information. Safety – Must be able to work in safe manner at all times, avoiding shortcuts that have potential adverse results/risks, and must be able to comply with safety standards and best practices. Travel and/or Schedule – Availability for after-hour and weekend work, on occasion, may be required  PHYSICAL and/or ENVIRONMENTAL DEMANDS: The physical and environmental demands described here are representative of those encountered and/or necessary for the employee to successfully perform the essential functions of this job; reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  • Environment: Office, Laboratory ;  • Ambulatory skills, e.g. stand, walk, sit;  • Hand-eye coordination and arm/hand/finger dexterity;  • Ability to speak; hear; and exercise visual acuity to perceive minute differences/details, and to withstand the strain of continued close work.  Stereoscopic vision sufficient to perform detailed work;  • Ability to transfer weights of 25 pounds anticipated for this position;  • Driving requirements: Moderate frequency 10%. DPS employee who is selected for a position in their current salary group and state title will be transferred with no salary change.DPS employee who is selected for a position in their current salary group with a new state title may receive an increase up to 3.4%.Salary is contingent upon qualifications and is subject to salary administration and budgetary restrictions. Travel: 5%  DUE TO THE HIGH VOLUME OF APPLICATIONS WE DO NOT ACCEPT TELEPHONE CALLS. ONLY CANDIDATES SELECTED FOR INTERVIEW WILL BE CONTACTED. State of Texas retirees may be rehired for full-time, non-commissioned positions only under very specific circumstances."}