{"jobID": "2693063730", "jobLocation": "Allendale_NJ", "jobTitle": "Senior Scientist, Formulation Technology", "companyRating": "2.8", "companyInfo": {"Website": "www.lonza.com", "Headquarters": "Basel, Switzerland", "Size": "5001 to 10000 employees", "Founded": " 1897", "Type": " Company - Public (LONN) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Perrigo, Covance, DSM"}, "estimatedSalary": "72000", "jobDescription": " At Lonza, we invest in great people. We encourage our employees to challenge themselves and we offer an environment that fosters creativity and success. Headquartered in Basel, Switzerland, we operate production, R&D;, and business sites around the world, including Europe, North America, and Asia.Our vision:We strive to be the leading supplier using science and technology to improve the quality of life.Our mission:We work with passion, using advanced technologies, to transform life science into new possibilities for our customers.Do you want to help us as we shape the future of this great organization?Job Description Summary“This position will be temporarily based in Allendale, NJ or South Plainfield, NJ until approximately Q4 2018. In Q4 2018, Lonza will be moving to our newly designed state-of -the US headquarters located at 412 Mount Kemble Ave., Morristown, NJ.” Full responsibility for in development of the Programs and Concepts coming out of the Biocidal Discovery group and the Delivery Systems group. Prepare and test biocidal formulations in order to generate the relevant data to support a “Proven Concept”. Will work independent or as a member of a project team for these responsibilities.Plans and executes experiments in a laboratory environment to include; DOE, data collection, data analysis and summary, while safely operating in and maintaining a shared lab/platform. Collects, summarizes, analyses data to prepare reports and makes presentations, as appropriate, to disseminate best practice throughout the function.Develop know-how on relevant technologies to formulate within Lonza’s core markets, with a focus on new trends in formulation additives, their functionality, and effects on biocidal activity. Represents the team in meetings with internal customers as key technical resource to develop effective customer relationships.Anticipation, evaluation and implementation of trends and innovations in the area of function/expertise. Attend appropriate conferences, symposiums and trade shows in order to remain current on formulation additives trends and business landscapes. Qualifications Ph.D, MS or BS DegreePreferred area of study: Physical Chemistry, Formulation, Surfactants.Sound problem solving skills in the field of own discipline and must demonstrate the ability to readily obtain new technical competencies.Demonstrate the ability to work effectively as an individual contributor and as a member of a global team. Demonstrates scientific/technical leadership at project level.Strong written, oral, and interpersonal communication skills to effectively communicate technical achievements/progress and present research findings in a clear manner.Effective comprehensive & communication skills necessary to exchange complex informationMust be effective and efficient operating independently or in a team environmentAble to respond to changing priorities and handle multiple projects at a time.Entrepreneurial spirit with a strong customer focusAbility to influence others at various levels of the organizationAbility to manage uncertainty and complexity Lonza is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a qualified individual with disability, protected veteran status, or any other characteristic protected by law.Lonza. The place to Go, Stay and Grow."}