{"jobID": "2787624835", "jobLocation": "Irving_TX", "jobTitle": "Business Intelligence Analyst II", "companyRating": "3.0", "companyInfo": {"Website": "www.exeterfinance.com", "Headquarters": "Irving, TX", "Size": "501 to 1000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Santander Consumer USA, GM Financial, Ally Financial"}, "estimatedSalary": "80000", "jobDescription": " At Exeter Finance, we are committed to helping customers find the right financing for their next vehicle purchase. By building strong relationships with our customers and network of dealer partners we are able to give options that make sense, getting customers behind the wheel of their car.  Every team member is integral to our success. Whether you’re at a servicing center helping customers with their loans, in the field building relationships with dealers, or supporting the company from its corporate offices, you'll enjoy a nurturing, invigorating and positive work environment.  Our vision is to be a premier finance company and lender of choice known for its People, Performance and Service. Assists in the development, modification and maintenance of analysis related to loan origination, performance and forecasting. Manages individual projects as assigned to ensure adherence to schedule, as well as quality and accuracy of delivered results. Performs ad hoc projects related to the entire function of credit risk, and summarize results using verbal, written, and formal presentation techniques.  Analyzes business intelligence data. Assesses data extraction, report generation and bugs appearing in operations involving the data warehouse or applicable reporting applications. Synthesizes current business intelligence or trend data to support recommendations for action. Documents specifications for business intelligence or information technology (IT) reports, dashboards, or other outputs.  Collects business intelligence data from various resources. Generates standard or custom reports summarizing business, financial, or economic data for review by executives, managers, clients, and other stakeholders. Maintains and updates business intelligence tools, databases, dashboards, systems, or methods.  Validates system applications. Programs the user interface and application side of business intelligence solutions.  Creates reports in SSRS.  Other duties as assigned.Additional Job DescriptionAdditional Job DescriptionBachelor’s Degree in Economics, Math/Statistics, Finance, Engineering or similar discipline.  Two (2) + years Business Intelligence experience, working with BI applications, to include:  One 1 + years of SQL development experience, and  One 1 + years of experience in data mining, with strong understanding of data flow and structure.  Ability to analyze detailed statistics, and summarize findings.  Experience deploying reports and dashboards in visual studio.  Able to quickly grasp both technology and business concepts in an ever changing environment.  Excellent communication skills, and able to understand business requirements.  Understanding of relational databases, and quality/testing concepts.  Interact frequently with Business Analysts, Senior Developers, and IT staff. Exeter Finance LLC is an Equal Opportunity Employer."}