{"jobID": "2821035477", "jobLocation": "Pennington_NJ", "jobTitle": "GPVE PV Scientist", "companyRating": null, "companyInfo": {"Website": "www.synectics.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Post Index  1F6386-Sy## Location  Pennington, NJ Description:Key Responsibilities and Major DutiesSupport Medical Safety Assessment Physicians (MSAP) in leading Safety Data Review (SDR) Teams.Perform core signal detection activitiesElevate program or portfolio issues impacting benefit risk, priorities, resources, milestones with appropriate oversight.Author safety data query responsesContribute to specified sections of the Periodic Benefit Risk Update Report (PBRER) and Development Safety Update Report.Ensure pharmacovigilance regulatory compliance with oversight, as needed.Lead Safety Data Review (SDR) Teams, and participate in related PV and product-development subteam(s) in a specified therapeutic area. Appropriately elevate signal detection findings impacting risk benefit to the MST Chair.Author PV contributions to specified sections of the PBRER and DSURs with oversight, as needed.Author safety data query responses to health authorities including coordination and integration of input from other functional groups, as needed to support responses to ad hoc queries with oversight, as needed.Periodic summary of pertinent safety-related literature, analysis of pre-determined core signal data. Provides summaries, evaluations and conclusions with oversight as needed.Collaborate within and across company functions with appropriate disciplines to identify and ensure management of internal and external documentation and support when required.Apply knowledge of product goals, strategy, partnership agreement, individual functional area responsibilities and ensure regulatory compliance."}