{"jobID": "2815270413", "jobLocation": "Raritan_NJ", "jobTitle": "Senior Scientist Clinical Pharmacology", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": "Janssen Research & Development, LLC discovers and develops innovative medical solutions to address important unmet medical needs in oncology, immunology, neuroscience, infectious diseases and vaccines, and cardiovascular and metabolic diseases. Please visit http://www.janssenrnd.com/ for more information.We are Janssen. Our mission drives us. Our patients inspire us. We collaborate with the world for the health of everyone in it.Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion. Proud to be an equal opportunity employer.  The TA Scientist GCPs role is to apply and promote Clinical Pharmacology (GCP) knowledge, including pharmacokinetics/pharmacodynamics analyses and principles of model-based drug development in the programs for all stages of drug development ranging from pre New Molecular Entity (NME) declaration through Post-marketing support, in collaboration with various stakeholders, QS-Project Matrix teams, GCP and PM Leaders. With oversight, the TA Scientist GCP can also execute the day-to-day operations for the clinical pharmacology aspects of the assigned programs.  Accountabilities and responsibilities of the TA Scientist GCP can directly impact the operational results, as they are focused on investigation and characterization of how drugs interact with biological systems or diseases so they can be used safely and effectively, and with the appropriate pharmaceutical formulation. The TA Scientist GCP applies the understanding of (1) the impact of intra- and inter-subject variability in physiology and/or pathology, concomitant medication use, and biopharmaceutics, on PK and PK/PD, and (2) requirements for the clinical pharmacology regulatory submission packages and submission processes.  The TA Scientist GCP will assist GCP and PM leaders with the execution of scientifically robust and efficient clinical pharmacology strategies for NME and/or development candidates.  The TA Scientist GCP carries out functional responsibilities in accordance to applicable SOPs, regulatory requirements and Johnson & Johnson Credo principles.Main Accountabilities: With assistance from senior members of the group"}