{"jobID": "2802117738", "jobLocation": "Los_Angeles_CA", "jobTitle": "Benefits Consultant (Partner Analytics Consultant) with Inno", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with LA Interviews but with Innovu  LA Interviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Innovu, a Pittsburgh-based healthcare analytics company, is looking for a Partner Analytics Consultant (PAC) to work with our partners and customers in the Greater Los Angeles Area.  Who You Are  An experienced employee benefits consulting professional excited about working with clients to deliver customized consulting, financial reporting, and data analysis to minimize benefit risk exposure.  A thoughtful person with a desire to use their accumulated benefits and healthcare knowledge to assist a broader range of clients and other benefit advisors in transforming how benefits and healthcare programs are created, deployed, and managed.  A creative and analytical employee focused on engaging clients to solve problems and a proven ability to diagnose and resolve issues.  Someone able to communicate data-driven actionable results and recommendations clearly and concisely to a variety of audiences.  Someone with a customer-first mindset and experience engaging with clients and partners and a strong commitment to adding value for every client.  A passionate person with an entrepreneurial personality, who is results focused and thrives in a dynamic environment with lots of personal autonomy and responsibility.  An individual capable of managing multiple projects and producing client-ready deliverables.  A self-starter interested in continuously challenging themselves and a willingness to step outside of their comfort zone.  A team player who is flexible, creative, willing to roll up their sleeves, and eager to learn. Qualifications Five or more years of experience consulting directly with clients in the healthcare and employee benefits industries.  Experience assisting with the development and implementation of Total Reward strategies for self-insured and fully-insured clients.  Exposure to benefit solutions across different product lines.  Ability to uncover outliers and anomalies in healthcare and benefits related data and identify actionable solutions.  Experience benchmarking healthcare and benefits related data, with a strong sense of what the marketplace yields.  Demonstrate natural ease when dealing with clients of all levels.  Knowledge of regional marketplace and national healthcare and benefits landscape.  Prior experience working ‘hands-on’ with claims data and or other types of healthcare related data.  Strong written and oral communication skills.  Outstanding Excel and spreadsheet skills, including pivot tables, vlookups/hlookups, formulas, and macros.  Understanding of healthcare reform requirements and their impact.  Strong sense of customer service to consistently and effectively address client needs.  Self-motivated; comfortable working independently under general direction.  Demonstrate extensive leadership ability both externally with clients and internally with staff.  Requires a bachelor's degree.  A consultant and/or producer with Life, Accident, and Health Insurance licensure.  Bonus Points  Data analytics background.  Actuarial or underwriting experience.  CEBS designation.  MBA or advanced degree.  Ability to identify business development opportunities.  Experience with large data sets and/or the analysis of unstructured healthcare data.  Experiences with data mining, machine learning, and predictive modeling techniques, and their applications.Company DescriptionInnovu is a data analytics company that empowers its clients to use total rewards and risk data differently to better manage and mitigate business and employee population risk. By integrating and validating all data sources into a single, secure, cloud-based solution, clients gain control of their data, generating a 360-degree view of their employee populations. With collaboration and messaging built into Innovu’s solutions, clients can easily work with their advisors and Innovu’s benefits and risk experts, healthcare analysts, and business specialists, ensuring clients have the actionable insights needed to make more informed business decisions.  Innovu's culture is that of an entrepreneurial company; fast-paced and team oriented. We believe in:  Relentless Focus - We are technologists, entrepreneurs, and healthcare and benefits industry experts who have come together with a relentless focus to empower data-driven organizations by unlocking the power of employee health and benefits information.  Agility Leanness - Healthcare and employee benefits are going through profound changes that require our customers and our people to be able to quickly adapt. Technology is always in a state of change. Agility and lean thinking pervade our actions, our development processes, and our company.  Innovation - To empower and change an industry takes more than just cool technology. It takes unique and innovative approaches to solving previously unsolvable business problems. Innovu's people supply this innovation each day, in each process and function.  Teamwork Communication - Our culture is based around radical candor, low ego personalities, and a straightforward and open communications style. We are committed to retaining this distinctive personality as our team grows.  Apply"}