{"jobID": "2837708483", "jobLocation": "Rahway_NJ", "jobTitle": "Senior Scientist, Biostatistics", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  This position is for a Statistician who will contribute to clinical pharmacogenetics / pharmacogenomics and / or oncology biomarker discovery projects aimed at identifying, developing and validating genetic or oncology biomarkers and platforms to be used as drug development tools for Merck compounds. The Translational Biomarker Statistics group in the Biostatistics and Research Decision Sciences Department (BARDS) is searching for a highly collaborative and inquisitive statistician or scientist to join an inter-disciplinary team to transform clinical pharmacogenetics and/or oncology biomarker discoveries into clinical practice. These projects may be identified from internal and external, early and late phase clinical trials.  Primary responsibilities will be to:  Develop, coordinate, and provide statistical leadership and support for pharmacogenetics/pharmacogenomics projects (i.e., GWAS / NGS / Imputation / Association analysis etc.) and / or oncology projects focused on molecular and other exploratory biomarkers.  Interact with Clinical, Regulatory, Statistical Programming, Data Management, and other Merck Research Laboratories Scientists in designing and analyzing data from clinical trials. Coordinate all statistical activities for ongoing clinical projects. Interact with Contract Research Organizations, as appropriate.  Primary activities:  Analyzes clinical pharmacogenetics / pharmacogenomics and / or oncology biomarker data and interprets results from clinical trials to meet objectives of the study protocol. Independently applies and implements basic and complex statistical techniques to these analyses.  Serves as a statistical representative on cross-functional teams for the strategic planning and execution of product development  Develops individual protocols and statistical analysis plans and independently determines appropriate statistical methodology for analysis.  Prepares oral presentations and written reports to effectively communicate clinical trial results to the project team, Merck Management, regulatory agencies, or individual investigators.  Consults on biomarker aspects of the clinical development strategy to meet scientific and regulatory project goals.  Is involved in clinical development planning to ensure that study designs are consistent with program objectives and meet worldwide regulatory and marketing needs.  Independently identifies and anticipates technical or other potential problems arising in the design, conduct, and analysis of clinical trials, proposes solutions and carries them out.  Participates in database design meetings as needed, to ensure that the data evaluated are in high quality and satisfy analysis requirements.  Collaborates with statistical programming staff to ensure all programs meet analysis requirements, internal standard operating procedures, and external regulatory requirements  Evaluates appropriateness of available software for planned analyses and ascertains needs for potential program development of novel statistical methodology.  Responds to queries relating to study design, analysis, and interpretation posed by clinical monitors, regulatory agencies, and/or investigators.  Participates with management in discussions with corresponding scientific personnel at regulatory agencies and with investigators concerning proposed or ongoing studies.  Conducts research activities for innovative statistical methods and applications in clinical trial development, especially related to the use of pharmacogenetics and oncology biomarkers Qualifications Education Minimum Requirement:  Ph.D or equivalent degree in statistics / biostatistics, statistical genetics or related discipline with a minimum of 3 years relevant experience, or a Master’s Degree with a minimum of 6 years relevant experience  Required Experience and Skills:  Solid knowledge of statistical analysis methodologies and experimental design including how to analyze GWAS / NGS / WES / gene expression etc. data.  Solid knowledge of statistical programming skills e.g. R / Python / Shell and / or SAS and statistical genetics analysis software e.g. PLINK / MaCH / IMPUTE2 / METAL / EIGENSOFT / etc.  Strong project management skills  Good understanding of worldwide regulatory requirements and clinical trial expertise from phase I to II  Ability to work with large complex data sets  Strong oral and written communication skills  Ability to function effectively both independently and in a team environment  Demonstrate strong interest in statistical research activities and in application of novel methods to clinical trial association with biomarkers  Demonstrate the ability to learn, be proactive and motivated, and consistently focus on details and execution  Ability to collaborate with scientists and work on multi-discipline teams  Preferred Experience and Skills:  A specialization and relevant experience in pharmacogenetics and / or oncology  An understanding of the biology of disease  An understanding of modern techniques for statistical and / or machine learning"}