{"jobID": "2818209840", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist - Mid Level -Active Top Secret - immediate need", "companyRating": null, "companyInfo": {"Website": "www.visualsoftinc.com", "Headquarters": "Vienna, VA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Visual Soft, Inc is seeking qualified candidates (US Citizens with active TOP SECRET clearance - a requirement on its Project with a Major Prime) for the following position for a federal agency. Job Title: Data Scientist - Mid LevelLocation: Washington, DC or Chantilly, VA Compensation: up to a max of 150k/yr with Active Top SECRET is a MUST. the preceding compensation is based on experience, certifications and educationJob description: Perform as a data scientist with a focus on computer science to apply knowledge of and expertise in distributed scalable Big Data store, including Accumulo, Cloudbase, or HBase Bigtable and apply expertise in the MapReduce programming model. Leverage expertise in requirements analysis, installation, integration, evaluation, enhancement, maintenance, testing, and diagnosis or resolution. Use statistical methods on large data sets to characterize uncertainty through statistical methods. Leverage knowledge of large data sets to characterize uncertainty through statistical methods. Leverage knowledge of large data set analysis, perform research, and ensure study results are properly interpreted and documented. Desired Qualifications: Experience with developing software in Java, C, C++, or Scala other high-level languagesExperience with developing software for UNIX or Linux, including Red Hat, CentOS, or UbuntuExperience with Apache Spark or Apache StormExperience with software integration or testing, including analyzing and implementing test plans and scriptsExperience with MapReduce programmingExperience with the Hadoop Distributed File System (HDFS) and JSON or BSONExperience with distributed scalable Big Data store or NoSQL, including Accumulo, Cloudbase, HBase, or BigtableExperience with the design and development of an objectoriented system, developing solutions, and integrating, extending, and contributing to OpenSource softwareExperience with version control systems, including Github or GitlabBS degree with 2+ years of experience is required Our standard benefits include: Our standard benefits include 3 weeks of Paid time off (PTO that includes sick leave). Any unused PTO will be issued as a check at the end of an employee's anniversary with us. we also provide 2 floating and 8 public holidays. Floating and holidays expire at the end of every year of service of an employee. In addition, company will cover 50% of health and dental insurances only for all full time employees, however, dependents can be added at extra cost. Employee's health and dental coverage becomes effective after 30 days or first of the month after an employee completes initial 30 working days, we cover 50% for the employee's health and dental insurances. An employee has to finish all of your paper work for health and dental in the first 30 days of your employment with us. We provide STD, LTD and one time salary equivalent of life insurance at NO cost to all full time employees. All full time employees or w-2 employees with no benefits will be eligible to participate in company's 401k program after 90 days of employment with a company match of 4%, immediate vesting. In addition, all w-2 employees are eligible to be part of company's profit sharing, no employee contributions required."}