{"jobID": "2818584726", "jobLocation": "Washington_DC", "jobTitle": "Principal Software Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "151000", "jobDescription": " Our Principal Software Engineers are the best and brightest in the industry. Their passion for the mission and ensuring customer success is second to none. A day in the life of our engineers includes working closely with the Scrum Master assigned to the project, coordinating and prioritizing development activities with their team which may include Java engineers, UI/UX designers and engineers, automation engineers to quickly deliver new and innovative solutions. Our Principal engineers fully understand the technical stack, they functionally design and code with the team, and have the technical depth/breadth to work alongside all engineers of the team. Principal engineers work diligently to fully comprehend product owner requirements and facilitate the definition of success criteria for all worked performed by their teams. Principal’s engineers also work closely with other principal engineers to share new and innovative ideas and principals across the teams, allowing a cohesive design and delivery pipeline.  Being in a lead role provides you the opportunity to mentor and shape the future direction of the team, and we encourage all our principal engineers to build the next generation of successful leaders by mentoring them on all aspects of the software delivery pipeline.  If your passion is to lead challenging and rewarding technical solutions for a mission driven customer, then seriously consider this opportunity. Our management and leadership team focuses on enablement of our engineers; we encourage team cohesion and independence with principal software engineers afforded significant latitude to deliver solutions for our organization. Responsibilities:Design, develop, enhance, debug and implement software as part of several key initiatives in support of the FBI.Address problems related to systems integration and compatibility with multiple platforms, providing technical leadership and supervision of others during the project.Design and develop Java software applications, yep you will need to roll up your sleeves as well.Work independently on tasks and initiatives if requested.Work on complex tasks requiring extensive problem solving abilitiesWork in a fast-paced agile environment. Be well versed in full lifecycle development with a strong understanding of UI/UX front end development leveraging tools such as AngularJS and Bootstrap.Demonstrate strong understanding of ORM tools and persistence of large transactional data.Possess the ability to understand a large monolithic program, and assist with it continuous evolution to a microservices design patternPossess full understanding of how to deploy products into a production environment in support of DevOps culture.Understand multilevel network environments and activities required to pass data between them.Basic Qualifications:Bachelor’s degree or equivalent work experience10 years of full life cycle and agile software development.Demonstrated Knowledge of programming languages including: Java, JavaScript, AngularJSWorking knowledge of jQuery, Hibernate, EclipseExperience in an Agile Development Environment.Ability to communicate business needs to technical teams.Previous experience leading Agile Development teams of various skillsets and backgrounds to include, developers, DBA's, Business Analysts, etc. to ensure team success.Have successfully lead a team of 5 to 7 members from story creation to deploymentUnderstand Cloud computing environments and the complexities involved with developing systems that operate in them.Additional preferred skills/experience:Ansible scriptingLinux shell scriptingPython scriptingSOLRSQLAndroid mobile programmingAdvanced Spring, Spring MVC, Spring ORM, etc.Qualified candidates must possess a Top Secret clearance.Degree: A bachelor ’s degree in computer science, engineering, mathematics or a related discipline. Clearance Requirement: This position requires a Top Secret/SCI security clearance, based on current background investigation (SBI), as well as the favorable completion of polygraph. Clearance and polygraph processing will be completed by the U.S. Government.KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability. How to Apply? Please click apply on the right.  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.  KeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve. Clearance Clearance Requirement: Top Secret clearanceApply!"}