{"jobID": "2735944265", "jobLocation": "San_Francisco_CA", "jobTitle": "Director - Data Infrastructure Engineering", "companyRating": null, "companyInfo": {"Website": "www.affirm.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Is data infrastructure engineering your passion? Do you enjoy building teams and seeing your teammates excel in complex technical and business domain areas? Do you enjoy hands-on coding culture and player-coach style leadership? On the Data Engineering team at Affirm you will find a unique opportunity to leverage your leadership skills, while continuing to be hands on and responsible for the design and implementation of some of the most innovative software solutions.We are looking for someone who cares deeply about data to lead our Data Engineering efforts within our Platform Engineering team. Your team will be responsible for designing and building scalable systems that can support our analytics and data science teams, owning components for collecting, processing, storing and analyzing the sensitive data generated by millions of users, thousands of merchants, their transactions, logs, activity and interactions across multiple product lines. Your customers are the engineers, analysts, and data scientists within the company.What You'll Do Manage a team of engineers responsible for designing, building and operating the ever growing data infrastructure at Affirm.Identify and analyze requirements and use cases from multiple internal teams (including financial planning and analytics, risk operations, data science, machine learning and engineering); work with other technical leads to design solutions for the requirements.Work with your team and customers to sketch out the company’s vision for a data warehouse architecture.Drive project execution and implementation, ensuring that these projects contribute towards that vision.Enable your team to operationalize, automate, and scale our large data pipelines.Mentor and guide other engineers towards overarching architecture goals, applying sound engineering principles and design philosophies.Work cross-functionally across the engineering organization as well as with internal and external stakeholders. Collaborate with other Platform teams on security, reliability and automation.What We Look For Solid leadership and communication skills.Experience in managing diverse engineering teams.5+ years of software engineering experience.Experience with distributed systems, distributed data stores, data pipelines and other tools in the Hadoop and AWS ecosystems.Experience with developing and scaling of production systems.Experience in Postgres / MySQL is a plus.Strong understanding of computer security and data privacy.Strong system fundamentals, and experience working in various parts of the data analytics stack.Exposure to architectural patterns of large distributed systems.Experience with AWS and/or other cloud providers is a plus.Strong tooling and automations development experience is a plus.Computer Science Degree with industry experience is a plus.ABOUT AFFIRMAt Affirm we are using technology to re-imagine and re-build core parts of financial infrastructure to enable friendlier and more transparent financial products and services that improve lives.We believe the financial industry is fundamentally broken. Not only is the core infrastructure built with technology from the 1970s, but there are a dwindling number of people who say \"I trust my bank to look out for me\". It doesn’t have to be this way, and it’s our mission to fix this problem.We are based in San Francisco; founded by Max Levchin (founding CTO of PayPal), Jeff Kaditz (CDO DeNA/ngmoco), and Nathan Gettings (founding CTO of Palantir); and building a team of exceptionally talented people to join us on our mission."}