{"jobID": "2819608639", "jobLocation": "Rahway_NJ", "jobTitle": "Associate Principal Scientist Statistical Programming", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Associate Principal Scientist Statistical Programming - STA******  Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R & D expertise to create breakthrough science that radically changes the way we approach serious diseases.  The Associate Principal Programmer, Statistical Programming Oncology, leads the statistical programming activities for multiple and/or large/complex late stage drug/vaccine clinical development projects. Accountability predominantly includes the development and execution of statistical analysis and reporting deliverables (e.g. safety and efficacy analysis datasets, tables, listings, figures), the span of which range from individual clinical trials to world-wide regulatory application submissions and post marketing support.  The incumbent is responsible for the design and maintenance of statistical databases that support multiple stakeholder groups which include clinical development, outcomes research and safety evaluation.  The position is a key collaborator with statistics and other project stakeholders in ensuring that project plans are executed efficiently with timely and high quality deliverables.  For assigned projects the position serves as the statistical programming point of contact and knowledge holder through the entire product lifecycle.  Key areas of focus include (1) the assurance of deliverable quality and process compliance, (2) effective deliverable development utilizing global and TA standards that optimize analysis and reporting and promote a strategic knowledge-base data model, (3) maintaining and managing a project plan including resource forecasting, (4) coordinating the activities of a global programming team that includes outsource provider staff, (5) membership on departmental strategic initiative project teams such as new statistical computing platform evaluation and development. QualificationsEducation Minimum Requirement: Bachelor's or Master's (preferred) Degree or equivalent in Computer Science, Statistics, Applied Mathematics, Biological Sciences, or Engineering Required Experience and Skills: BS plus 9-12 years or MS plus 7 years SAS programming experience in a clinical trial environment  Experience leading large and/or complex statistical programming projects that include coordinating the activities of a programming team  Broad knowledge and significant experience in developing analysis and reporting statistical programming deliverables (datasets, statistical analyses, report tables, and graphics) using global and TA standards and according to quality, compliance and timeliness requirements.  Expertise in SAS and clinical trial programming including data steps, procedures, SAS/MACRO, SAS/GRAPH; systems and database expertise. Familiarity with statistical analysis methods and clinical data management concepts.  US and/or worldwide drug or vaccine regulatory application submission experience at the leadership level including the development of electronic submission deliverables  Strong project management skills; A program leader; Determines appropriate programming methodology, assures programming consistency across protocols and projects, completes programming tasks, and directs the program development effort of other programmers; an experienced programming mentor; ability to engage key stakeholders  Ability to comprehend statistical analysis plans which may describe statistical methodology to be programmed; Understanding of statistical terminology and concepts Designs and develops complex programming algorithms;  Excellent communication and negotiation skills with a demonstrated history of teamwork and collaboration; deals well with change and seamlessly assimilates to new projects and stakeholders.  Strategic thinking - ability to turn strategy into tactical activities; design of statistical databases with the end in mind that optimize analysis and reporting and leverage departmental standards and industry best-practices  Experience in CDISC and ADaM standards.  Demonstrated success in the assurance of deliverable quality and process compliance.  Ability to anticipate stakeholder and regulatory requirements Preferred Experience and Skills: Strong working knowledge of reporting processes (SOPs) and software development life-cycle (SDLC)  Ability and interest to work across cultures and geographies.  Experience providing technical and/or programming guidance and mentoring to colleagues  Ability to complete statistical programming deliverables through the use of global outsource partner programming staff  Experience developing and managing a project plan using Microsoft Project or similar package  Active in professional societies  Experience in process improvement  Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to . Search Firm Representatives Please Read Carefully: Merck & Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  For more information about personal rights under Equal Employment Opportunity, visit:  Job Statistical Programming  Primary Location NA-US-NJ-Rahway  Other Locations Regular  Employee Status  Number Of Openings  Categories HealthcareManagementBiotechnology / ScienceMarketing"}