{"jobID": "2709682400", "jobLocation": "Washington_DC", "jobTitle": "Data Warehousing Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.grantthornton.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1924", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Deloitte, KPMG"}, "estimatedSalary": "80000", "jobDescription": " Grant Thornton is seeking a Manager to join its IT Advisory service line and take an active role in engagement execution, project management and key business development activities.  Grant Thornton’s Global Public Sector helps executives and managers at all levels of government maximize performance and efficiency in the face of ever tightening budgets and increased demand for services. Our public sector team members find solutions that help government leaders with issues including acquisitions, financial management, human capital, information technology and performance management in federal, state, local and international governments.  At Grant Thornton, our professional staff applies traditional, cutting-edge approaches and methods to a variety of analyses. As part of our team, the Manager will utilize various methodologies and models to execute client projects. ESSENTIAL DUTIES:Provide technical team leadership support for the full systems development life-cycle (SDLC) data warehouse.Assist the project manager in establishing project plans, work breakdown structures (WBS), milestones, deliverables and risk assessments.Assign and coordinate project tasks among technical personnel.Work with clients to understand requirements and translate them into the appropriate technical solution.Architect data warehouses/marts by developing technical infrastructure designs, data mappings, flows and report dissemination mechanisms.Design and implement data models for database applications using Oracle Designer (Star Schema/Dimensional Modeling).Analyze source data of different types and design programs for extraction, transformation and loading into an Oracle database.Create and manage database objects including tables, indexes and procedures.Develop and test programs using SQL, PL-SQL and SQL*Loader for database applications.Manage unit, system, and integration testing for accuracy and performance.Develop and generate standard and ad hoc reporting capabilities from new and existing data sources.Develop and modify queries, programs and stored procedures to support standard and ad hoc reporting.Perform data loading and manipulation using Oracle and Informatica software.Meet or exceed sales targets for new and follow-on work.Manage business development activities, such as proposals, capture, account teams, whitepapers, conferences, and/or other thought leadership materials.Meet or exceed targeted billing hours (utilization).Act as performance manager (coach) for up to four coachees outside of engagement responsibilities.Interview campus and/or experienced candidates.Perform engagement management responsibilities, including performance reviews, task delegation, project scheduling, project financials, quality review and client management.TS/SCI required.Bachelor’s degree in information systems or related field; master’s a plus.Six years of experience in data warehousing or business intelligence (BI) and experience working with Client Relationship Management systems (CRM)expertise in Oracle. 9i and/or 10g relational database system preferred.Six years of experience using Oracle with expertise in SQL, PL/SQL and SQL*Loader utilities for ETL processing.Experience in at least one reporting/OLAP tool such as Oracle Express, Cognos, Brio or Business Objects.Experience in data modeling and database design (dimensional and third normal), life-cycle development methodology and user training. Knowledge of Oracle Designer/2000 or other data modeling tool.Experience in UNIX programming and shell scripting.Experience in conducting performance, sizing and optimization analysis using Oracle performance tools.Experience in Informatica.Experience with Oracle Portal desirable.Proficient in design and maintenance of real time data warehousing and business intelligence platforms with real time data acquisition and reporting.Familiarity with information data security concepts, practices and procedures.Ability to determine file organization and indexing methods for user applications under Oracle.Demonstrated ability to implement business rules using Oracle procedures, functions and triggers.Demonstrated ability to respond to changing priorities, multiple tasks and demands within short timeframes.Demonstrated ability to lead technical teams.Ability to obtain and maintain certain job-related certifications if no job-related advanced degrees.Outstanding background in qualitative and statistical analysis.Strong organizational skills with a task oriented mindset.U.S. citizenship may be required. Ability to work in the United States indefinitely required.Travel may be required.Coach and mentor junior staff members.Ability to work overtime required on occasion.Ability to sit in an office environment for long periods of time.Ability to obtain and maintain a security clearance.Ability to communicate clearly in writing and verbally.Ability to obtain and maintain firm independence and abide by firm ethics requirements.Meet or exceed continuing professional education (CPE) requirements.Grant Thornton LLP is the U.S. member firm of Grant Thornton International, one of the six global accounting, tax and business advisory organizations. Grant Thornton’s Global Public Sector, based in Alexandria, VA, is a global management consulting business with the mission of providing responsive and innovative financial, performance management and systems solutions to governments and international organizations. Visit Grant Thornton’s Global Public Sector at www.grantthornton.com/publicsector. It is Grant Thornton’s policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability, or any other characteristic protected by applicable federal, state, or local law."}