{"jobID": "2682433945", "jobLocation": "Santa_Monica_CA", "jobTitle": "Scientist, Quality Control Raw Materials", "companyRating": "4.1", "companyInfo": {"Website": "www.kitepharma.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": " For Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this jobJob DescriptionKite Pharma is a clinical-stage biopharmaceutical company focused on the development and commercialization of novel cancer immunotherapy products designed to harness the power of a patient’s own immune system to selectively target and kill cancer cells. Our core technology involves the genetic engineering of T cells, or white blood cells, to express either chimeric antigen receptors (CARs) or T cell receptors (TCRs) for the treatment of advanced solid and hematological malignancies. We are on a rapid growth trajectory and have a highly energized and accomplished team. Kite is publicly traded (NASDAQ: KITE) with a current market well over $2 Billion.  We are seeking Raw Materials Analytical Scientist to join the team. Responsibilities (include but are not limited to):Development and qualification of cGMP analytical methods for release of Raw Materials for KITE Cellular Therapy ProductsDevelop, optimize, and qualify test methods for assigned projects.Identify new analytical technologiesServe as technical resource for analytical method issuesCreate and review technical documents including analytical method development reports, method qualification protocols and reports, standard operating procedures in compliance with regulatory requirements. Prepare SOPs, protocols, scientific reports and technical documents for external publicationCollaborate with other research and development departments, and actively support testing of raw materials during various stages of development leading to commercial projectsMay coordinate the activities of external research laboratories that have been contracted to conduct assay development or sample testing of Raw MaterialsParticipate in technical transfer of assays to internal labs to and contract labs in a cGMP or GLP environment.Critical scientific/technical data analysis and presentation of data in project team meetingsConduct investigations regarding out of specifications (OOS) , invalid results and address and manage deviations related to analytical proceduresMonitor the GMP systems currently in place to ensure compliance with documented policiesWork independently with minimal supervision and ability to identify, effectively communicate, and troubleshoot issues.Other duties may be assignedRequirements: The ideal candidate would possess: Ph.D in Analytical Development 5-7 + years of hands-on laboratory experience , preferably in the biotech/biopharmaceutical settingExperience with standard biological analytical methods SDS-PAGE, HPLC (SEC-,RP-,EC-,HIC-), capillary electrophoresis (CE-SDS, icIEF), mass spectrometry, particle analysis, UV spectroscopy, FT-IR and fluorescence spectroscopyStrong scientific background in protein analytics and protein drug developmentAbility to think critically and creatively to identify and solve scientific problemsExperience with operating under GMP’s and CRO/CMO’s management a plusAbility to work independently and manage multiple projects simultaneouslyStrong interpersonal skills and excellent oral and written communication skill a must Kite is a biopharmaceutical company engaged in the development of innovative cancer immunotherapies with a goal of providing rapid, long-term durable response and eliminating the burden of chronic care. The company is focused on chimeric antigen receptor (CAR) and T cell receptor (TCR) engineered cell therapies designed to empower the immune system's ability to recognize and kill tumors. Kite is based in Santa Monica, CA. For more information on Kite, please visit www.kitepharma.com. Sign up to follow @KitePharma on Twitter at www.twitter.com/kitepharma.For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Kite Pharma Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}