{"jobID": "2817715985", "jobLocation": "El_Segundo_CA", "jobTitle": "SQL Data Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.divihn.com", "Headquarters": "Hoffman Estates, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "115000", "jobDescription": "DivIHN (pronounced Divine) is a nationally-recognized Business Technology Solutions and Staffing services provider headquartered in Chicago. Since our formation in 2002, we have been trusted by Fortune 500 organizations to help them locate and hire best-in-class talent through our Award-winning Professional Workforce Solutions program.  One of our customers has engaged us to help them hire a SQL Data Engineer to work out of their EL Segundo office; details can be found below.This is a 6 month contract opportunity for a SQL Data Engineer. This opportunity will likely become a long-term engagement for the right person. You will be working alongside other world-class engineers on a groundbreaking platform for rapid-cycle analytics of real-world healthcare data.Responsibilities: The following duties include, but are not limited to: Parse large volumes of patient data into formats amenable to scientific analysis. For scale, data sets contain ~10-20 million patients, and ~50 million patient-years of diagnoses, procedures, and paymentsWork closely with our scientists to understand client data sets and validate data integrityExtend and leverage our Spark SQL based platformWork with our other Data Engineers and Leads on specifying ETL platform enhancementsOptimize performance of data import and analysis over large data setsRequirements:Expert level SQL. Systems and Java programming experience is a plus.Expertise in building and maintaining scalable, reliable, and production ETL jobsExperience in data profiling (i.e. source data analysis)Ability to work with various data infrastructure technologies, including: SQL relational databasesDistributed processing engines (e.g. Spark)No-SQL data stores (e.g. Redis/Cassandra)Data modeling skills, both relational and non-relationalExperience with healthcare data and working in HIPAA regulated environment a plusAbout us:DivIHN, the 'IT Asset Performance Services' organization, provides Professional Consulting, Custom Projects, and Professional Resource Augmentation services to clients in the Mid-West and beyond. The strategic characteristics of the organization are Standardization, Specialization, and Collaboration.  Check out our careers page to see all of our job openings:  http://divihn.com/careers/find-a-job/ - provided by Dice  Java,SQL,Spark SQL"}