{"jobID": "2541980851", "jobLocation": "Culver_City_CA", "jobTitle": "Data Analyst - ShopNation", "companyRating": "3.2", "companyInfo": {"Website": "www.meredith.com", "Headquarters": "Des Moines, IA", "Size": "1001 to 5000 employees", "Founded": " 1902", "Type": " Company - Public (MDP) ", "Industry": " Media", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Hearst, Media General"}, "estimatedSalary": "70000", "jobDescription": "Job Title Data Analyst - ShopNation Job Description I. Job Summary | Major goals and objectives.  Meredith Commerce Network is looking for a talented, detail-oriented, self-starter to join our team. The Data Analyst position will analyze data to generate useful conclusions and actionable recommendations - for both business users and developers.  II. Essential Job Functions  Weight % Accountabilities, Actions and Expected Measurable Results  100% * Provide data-driven insights to enable decision-making. Create data visualizations using various BI tools and Excel.Work with the business units to establish KPIs and methodology, and then create the appropriate reports and analysis.Track, analyze and interpret trends in data in order to provide relevant conclusions and recommendations to managementUpdate and run statistical data models and other algorithms, tracking results against forecasts and fine-tuning when requiredDevelop, own, and present dashboards to Senior Management that provide actionable insights.Collaborate with other team members to support efforts to improve the quality of our outputs and deliverablesOwn and manage multiple BI initiatives and projects both on an on-going and an ad-hoc basis100% III. Minimum Qualifications and Job Requirements | All must be met to be considered. Education: BS/BA degree in a quantitative discipline (e.g., Math, Statistics, Economics, Business) or related field; or equivalent training and/or experience Experience: Minimum 3 years related experience Specific Knowledge, Skills and Abilities:At least one year of experience working with large data setsStrong background in analytics with a desire to constantly improve processesMust be a proactive problem solver and able to handle complex projects and tasksStrong organizational skills and attention to detail a mustPrioritization and time management skills essentialExpert proficiency in Microsoft ExcelPrevious internet industry experience is highly desirable. % Travel Required (Approximate): 0% #NMG#"}