{"jobID": "2827960708", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Data Scientist, Oracle Supply Chain Operations", "companyRating": "3.4", "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": "152000", "jobDescription": " Designs, develops and programs methods, processes, and systems to consolidate and analyze unstructured, diverse \"big data\" sources to generate actionable insights and solutions for client services and product enhancement.  Interacts with product and service teams to identify questions and issues for data analysis and experiments. Develops and codes software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Identifies meaningful insights from large data and metadata sources; interprets and communicates insights and findings from analysis and experiments to product, service, and business managers.  Leading contributor individually and as a team member, providing direction and mentoring to others. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. 8 years relevant work experience. BS/BA preferred.  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.  Title: Senior Data Scientist, Oracle Supply Chain Operations  Location: Santa Clara, CA or willing to relocate to the area  Do you view Supply Chain as a playground of opportunity?  Oracle Supply Chain Operations manages the hardware supply chain for both the (external) commercial business and also for internal customers in support of the rapidly growing Oracle Cloud. In responding to increasingly complex business environment, a new Center of Excellence organization within Global Planning&Fulfillment; has been formed to focus on designing, scaling&transforming; business processes, system capabilities&advanced; analytics to enable successful GP&F; operations&optimize; business outcome.  We are seeking highly-talented supply chain professionals who can strengthen our capabilities and help enable the broader business objectives. The Data Scientist is responsible for enabling predictive analytics/models for GP&F; operation consumptions. You will work closely with Business Architect, Functional Experts&Operations; to provide business insights extracted through various models from large structured or un-structured data.  If you enjoy taming ambiguity and complexity by developing value-add structure, new capabilities&process; agility, this challenge may be for you. Specific Duties and Responsibilities:Create Business insights for large dataset / structured&un-structured;Design, develop and deliver actionable insights to drive growth, improve forecast accuracy and increase profitability&customer; satisfactionAnalyze large data sets to develop new models and algorithms to predict demand&supply; performance, trend, cost, customer satisfactions etc.Develop data driven algorithm for optimization of desired variable performanceImprove model accuracyPartner with cross-functional team members to identify and prioritize actionable, high-impact insights across a variety of core business areasProvide expertise on mathematical concepts for the broader applied analytics team and inspire the adoption of advanced analytics and data science across the entire breadth of our organizationQualifications:College degree or equivalent and 7 years of data management experienceBroad experience in high tech Supply Chain strategy and executionMathematical and Statistical Analysis - Probability, Regression, Correlation, Significance testing, Forecasting, Optimization, Multivariate Analysis, Factor Analysis, CyberSecurity Machine Learning - Regression, Clustering, Decision Trees, K-Means, Neural nets, Naive Bayes, Artificial Intelligence, Fuzzy Logic, Predictive Analysis Predictive Modeling and Analytics: R, SAS, Excel, Octave, SciPY, NumPY, Pandas,Tableau, Microstrategy, Qlikview, OBIEE, SAS, Business Objects, PentahoDatabases: MySQL, Postgres, Oracle, SQL Server,VerticaBig Data / NoSQL: Hadoop, HDFS, Map Reduce, Pig, CassandraLanguages: Python, R, SAS, Java, C#, SQL, PL/SQLAbility to thrive in a fast-pace and dynamic environment with a level of ambiguity consistent with new business modelsTeam player, excellent leadership, interpersonal and communication skills at all levels Candidates should send resumes directly to: alex.lyubelsky@oracle.com  Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.  As part of Oracle's standard employment process, candidates will undergo a complete background check prior to an offer being extended. These background checks are conducted by a professional third party firm at no charge to the applicant and include: prior employment verification, education verification, social security trace, criminal background check and motor vehicles records (where required for position)."}