{"jobID": "2664450213", "jobLocation": "Washington_DC", "jobTitle": "Sr. Data Infrastructure Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.novetta.com", "Headquarters": "Mc Lean, VA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Digital Reasoning, Unisys, Booz Allen Hamilton"}, "estimatedSalary": "116000", "jobDescription": "Novetta focuses on three core areas: Cyber, Entity, and Multi-Int Analytics. Our products are focused on processing and analyzing vast amounts of data in these core areas. Our services are focused on helping our customers move from complexity to clarity. At Novetta, we bridge the gap between what our customers think they can do and what they aspire to achieve.  Our culture is shaped by a commitment to our Core Values:  Integrity: We hold ourselves accountable to the highest standards of integrity and ethics.  Customer Mission Success: Customer mission success drives our daily efforts—we strive always to exceed customer expectations and focus on mission success beyond contractual commitments.  Employee Focus: We value our employees and demonstrate our commitment to them by providing clear communications, outstanding benefits, career development, and opportunities to work on problems and technical challenges of national significance.  Innovation: We believe that innovation is critical to our success – that discovering new and more effective ways to achieve customer mission success is what makes us a great company  Job Description: Provide infrastructure and database support for a new and exciting analytics program at a federal financial regulation and consumer protection agency, working with a team of talented data scientists, analysts, and developers. Basic Qualifications: • Experience using infrastructure automation tools, such as Puppet or Ansible• Utilizing Apache or other webserver configuration, as well as other open-source product deployment experience.• Using Linux administration, automation, and shell scripting• Experience in Database optimization, performance tuning, health monitoring, administration• Some exposure to and experience working with one of Python, Ruby, Java or C At least a Bachelor’s degree with a focus in a relevant field. Demonstrated experience documenting and communicating best practices, work outputs, and potential improvements for technical audiences.  • Hadoop and/or Spark experience or certifications  • Exposure to big data environments, high availability environments, and/or Greenplum or Redshift.  Get a referral bonus for the great people you know! With our amazing referral program, you could be eligible to win outstanding rewards for referring qualified new hires to Novetta. Novetta is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law."}