{"jobID": "2770386226", "jobLocation": "Sunnyvale_CA", "jobTitle": "Principal Scientist, Medicinal Chemistry", "companyRating": null, "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": null, "jobDescription": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.  More than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer. To learn more about us, please visit us at http://www.pharmacyclics.com/Principal Research Scientist, Medicinal ChemistryWe are expanding a world-class medicinal chemistry team to drive innovation in small molecule oncology Discovery. The Principal Research Scientist will lead this expansion and manage medicinal chemistry team in support of small-molecule Drug Discovery. Working with the project director and line manager, he/she will be responsible for driving medicinal chemistry of assigned projects and ensuring the delivery of high quality tools, leads and candidate molecules within competitive time-frames. The candidate will participate in planning and implementing the short-term strategy and long-term vision of the supported project team. Responsibilities:Directly contribute to high quality candidate delivery at the bench level as a synthetic chemist.Familiar with modern drug discovery design and modeling tools, able to anticipate challenges and creatively apply knowledge of the latest concepts and technology platforms to solve problems.Responsible for developing medicinal chemistry strategies and ensuring efficient execution of tactics to meet project goals. Provide scientific oversight and accept accountability of medicinal chemistry activities in assigned projects. Manage a medicinal chemistry team of multiple MS/PhD-level scientists within ongoing hit to tool and lead optimization projects, develop the capabilities of the staff through mentoring and by promoting a culture that embraces open scientific debate and agile, accountable decision-making. Ensure the team maintains the highest laboratory safety standards. Effectively augment SAR by coordinating medicinal and synthetic organic chemistry outsourcing activities and collaborations within assigned projects. Quick learner of project biology, DMPK, safety and toxicological data to enable design and interpretation of project study results. Demonstrate strategic thinking and have excellent communication skills, effectively communicate to internal and external partner pharmacology groups and senior management through oral presentations and written reports. Establish strong, productive relationships with key partners and diverse groups across R&D; disciplines through clear, transparent communication of medicinal chemistry strategies and progress. BBuild a strong network and ensure visibility in the medicinal and synthetic organic chemistry field by participation in scientific meetings and by publishing high quality science.Qualifications:· PhD/PostDoc in synthetic organic/medicinal chemistry.· 10+ (Ph.D) years medicinal chemistry and drug discovery industrial experience.· Deep knowledge of biology, pharmacology, and DMPK principles· Experience with all phases of drug discovery from hit identification to delivery of development candidates using state-of-the-art platform technologies.· Proven ability to innovate and a track record of significant scientific contributions with publications in peer-reviewed journals and protection of intellectual property through patents.· Experience effectively managing, supervising and leading other professionals.· Exceptional communication skills; ability to develop, implement and clearly communicate chemistry/project strategies to team, management and collaborators.· Strong interpersonal and influencing skills and comfort working in a rapidly changing environment.· Ability and track record to lead the delivery of candidate transitions through LO and clinical candidate selection.· Ability to work across disease/therapeutic areas and diverse teams.· Proficient in assessing patent landscape and independently driving patent filing to protect project intellectual propertiesKey Leadership Competencies :· Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performance.· Learns fast, grasps the \"essence\" and can change course quickly where indicated.· Raises the bar and is never satisfied with the status quo.· Creates a learning environment, open to suggestions and experimentation for improvement.· Embraces the ideas of others, nurtures innovation and manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}