{"jobID": "2818607105", "jobLocation": "Bridgewater_NJ", "jobTitle": "Sr. Scientist", "companyRating": "2.7", "companyInfo": {"Website": "www.valeant.com", "Headquarters": "Laval, Canada", "Size": "10000+ employees", "Founded": " 1960", "Type": " Company - Public (VRX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Technical Operations is the organization within Global Manufacturing & Supply (‘GMS’) responsible for ensuring that externally sourced pharmaceutical products are scientifically robust, manufactured under control and remain in a constant state of validation throughout their product lifecycle in order to maintain a consistent supply of safe and effective products to patients  .  Provides technical support to R&D; support during manufacturing scale-up, process/packaging validation and launch of new products at external manufacturing organizations (EMOs).  Provides technical research and process knowledge in the implementation of change controls and technical transfers.  Monitors process yields, reliability, robustness and associated stability/shelf-life for trends and triggers for improvement via change control.  In collaboration with Quality, supports the accurate execution of routine process change controls, process validations and the analysis of Annual Product Reviews (APRs)/Product Quality Reviews (PQRs).  Supports a continuous process verification program for assigned projects via the collection and trend analysis of Critical Process Parameters (CPP) and Critical Quality Attributes (CQAs) at EMOs  Collecting and analyzing key performance indicators (KPIs) to enable meaningful CPP/CQA trending and reporting of key process data as well as to quickly identify changing quality trends and issues.  Providing scientific leadership of technology transfers to/from external manufacturing sites to ensure right first time transfers.  Authors technical transfer protocols and reports to support regulatory filings (technical transfers, scale-up and post-approval changes.  Contributes scientific guidance during process/product deviations, out-of-trend/ out-of-specification (OOT/OOS) investigations and product complaints.  Use scientific and statistical analyses (of KPIs) to develop process understanding. Uses knowledge further in root cause analysis investigations.  Provides written technical justifications for regulatory proposals or regulatory submissions related to externally manufactured products.  Bachelor’s degree in Chemistry, Chemical Engineering, or Pharmaceutical Chemistry with minimum 7 years of experience or Master’s Degree with 5-7 years of experience or Ph.D. with 3-5 years of experience in Pharmaceutical Technical Services encompassing Technical Transfer, Technical Trouble Shooting and Process Optimization.CMC Subject Matter Expertize across a broad range of pharmaceutical dosage forms.  Demonstrated industry experience supporting approved commercial products.  Direct experience with transferring technology and products from R&D; to manufacturing.  Strong trouble shooting skills  Must be action oriented, make informed decisions and be self-motivated  Working knowledge of databases. Ability to utilize minitab or other statistical analysis software as needed.  Understanding of CMC regulatory requirements and technical risk management.  Strong working knowledge of applied statistics, quality systems and regulatory requirements across multiple health authorities.  Ability to detect and resolve problems, own decisions, and accomplish tasks/goals.  Ability to quickly change priorities and deliver targeted support.  Ability to present complex scientific information to a business audience.  Excellent verbal and written communication skills, detail oriented, and ability to work productively in an interdisciplinary team environment.  Experience:  Pharmaceutical Chemistry with minimum 7 years of experience or Master’s Degree with 5-7 years of experience or Ph.D. with 3-5 years of experience in Pharmaceutical Technical Services encompassing Technical Transfer, Technical Trouble Shooting and Process Optimization.CMC Subject Matter Expertize across a broad range of pharmaceutical dosage forms.  Job Applicants should be aware of job offer scams perpetrated through the use of the Internet and social media platforms.  To learn more please read Valeant’s Job Offer Fraud Statement.  Valeant Pharmaceuticals International, Inc. is committed to leveraging the talent of a diverse workforce to create great opportunities for our business and our people. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status."}