{"jobID": "2807750374", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst - Will Relocate To Houston, TX! - G", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Analyst - Will Relocate To Houston, TX ***Company has experienced consistent growth adding 20% to their headcount each year!*** We are seeking a talented Java or Python Data Analyst to join a highly motivated and innovative Data Engineering team. As part of the Software Engineering department, the Data Analyst efforts will be critical to the success of the company’s global trading businesses.  Fantastic opportunity with a very successful, growing company with cutting-edge technology and a staff consisting of many of the brightest technical talent in the world. Will relocate the right candidate. Will sponsor visa’s. Will consider recent college grads with stellar academic record.  Seeking Data Analyst with experience at finance, trading, software and/or technology companies preferred.  Responsibilities:  -The Java or Python Data Analyst will curate massive amounts of data for thousands of different tradable instruments, including stocks, bonds, futures, contracts, commodities, and more.  -The Data Analyst will perform manual steps and develop programs and processes to perform statistical/quantitative analysis on datasets to ensure completeness and integrity.  -The Java or Python Data Analyst will coordinate project-related work with researchers and others on the engineering and business teams.  -The Data Analyst will be part of a team to support the data used by production trading algorithms.  Qualifications:  -A bachelor’s degree, which includes university coursework in programming and computing systems and 1-2 years of related data analysis experience or A master’s degree or equivalent in physics, math, statistics, computer science or related field.  -Need data cleaning and processing experience.  -Experience in UNIX/Linux and Windows environments.  -Intermediate programming skills. Ideally Java or Python with some additional scripting experience such as Bash or Perl.  -Experience with SQL and working with a relational database system, such as Microsoft SQL Server or MySQL.  -Obsessive attention to detail.  -Excellent problem-solving, communication, and analytical skills.  -Eagerness to work in an evolving and fast-paced environment.  -While financial industry experience is a plus, we are open-minded in our search for critical thinkers who are passionate about technology and data.  *Bachelor’s and/or Master’s degree from a top computer science program preferred. Prefer degrees from Rice University, University of Texas-Austin, Texas A&M;, University of Houston, Texas Tech University, University of Georgia, University of Virginia, Duke University. Also, Carnegie Mellon University, Massachusetts Institute of Technology/MIT, Stanford University, University of California-Berkeley, Cornell University, University of Illinois-Urbana-Champaign, Princeton University, University of Washington, Georgia Institute of Technology, California Institute of Technology, University of Wisconsin-Madison, University of Michigan-Ann Arbor.  Keywords: Houston TX Jobs, Data Analyst, Java, Python, UNIX, Linux, Scripting, Bash, Perl, SQL, Data Cleaning, Data Processing, Texas Recruiters, Information Technology Jobs, IT Jobs, Texas Recruiting If you are an employer and recruiting for similar IT professionals / positions, please contact our Technical Recruiters at Next Step Systems. We are a national IT Recruiting Firm / Agency specializing in full-time direct hire Information Technology employment opportunities.Company Will Sponsor Visas! Company Will Relocate Candidates!No Corp-To-Corp Or Third Party Recruiters; W-2 Direct Hire Only.- provided by Dice  Data Analyst, Java, Python, UNIX, Linux, Scripting, Bash, Perl, SQL, Data Cleaning, Data Processing"}