{"jobID": "2747412882", "jobLocation": "Chicago_IL", "jobTitle": "Reporting and Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.compsych.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 1984", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Aetna"}, "estimatedSalary": "54000", "jobDescription": "About ComPsych ComPsych® Corporation is the world’s largest provider of employee assistance programs (EAP) and is the pioneer and worldwide leader of fully integrated EAP, behavioral health, wellness, work-life, HR, FMLA and absence management services under its GuidanceResources® brand. ComPsych provides services to more than 45,000 organizations covering more than 100 million individuals throughout the U.S. and over 160 countries. By creating “Build-to-Suit” programs, ComPsych helps employers attract and retain employees, increase employee productivity and improve overall health and well-being. Job Summary The Reporting and Data Analyst will support the business strategy for Customer Reporting and Data Analytics. You will play an important role in identifying customer business requirements for standard and custom reporting and data analytics projects, and either working with IT to determine solutions for those needs, or creating solutions using available software. Primary ResponsibilitiesRegularly engage with customers, partners, Implementation Managers, and Account Managers to make reporting and data analytics recommendations and provide strategic inputCommunicate reporting requirements to IT, work in partnership with IT to ensure these projects are implemented in alignment with business needs by planning, coordinating, and executing User Acceptance TestingAssist or lead data analytics projects and fulfill ad hoc reporting and data requests as neededProactively analyze customer business processes related to ComPsych products and services with the purpose of identifying reporting and data needs that determine our strategyAnalyze existing reporting and data analytics products to recommend improvements to ensure quality, accuracy, and consistency, and lead efforts to implement those recommendationsJob QualificationsBachelor’s degree requiredAdvanced Microsoft Excel experienceExperience with Business Intelligence/Analytics software, such as Tableau, Qlik Sense, Microsoft Power BI, etc.Superior communication, critical thinking, and analytical skillsExcellent time management and organizational skillsStrong attention to detailStrong customer service orientationMust be able to work on-site in the Chicago OfficeAdditional Benefits We OfferOur US headquarters are located in one of Chicago's premier buildings, the NBC Tower. Nestled between Michigan Avenue and Lake Michigan, ComPsych's downtown Chicago location is easily accessible by public transportation and has plenty of parking nearby.Full benefit package with paid holiday and vacation timeBreakfast on Fridays and snacks/juice dailyEOE/AA/M/F/Vet/Disability ComPsych Corporation maintains a drugfree workplace."}