{"jobID": "2698422822", "jobLocation": "Los_Angeles_CA", "jobTitle": "PMC: Senior Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.pmc.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "PMC: Senior Data AnalystPenske Media Corporation (PMC), parent to celebrated brands like Variety, Rolling Stone, Deadline, IndieWire, WWD, and many more, is recruiting for Senior Data Analyst to support its Sales, Marketing, Product, Technical, Editorial, Finance and Accounting teams in analysis and planning of its digital properties. The ideal candidate must possess a goal-oriented approach and a dynamic personality as this position interacts with business teams across the organization.  S/he will support the team in presenting detailed data driven analytical recommendations to improve overall results. General knowledge of applied data analysis and business concepts are essential. The ability to get your hands dirty while wrangling complex messy datasets to extract meaningful business insights is key. This position also requires strong interpersonal and communication skills and the ability to interact effectively with people at various levels of the organization.This position will have dual reporting structure: PMCs SVP Finance and Data Scientist Job Duties:Assess and track key performance indicators and perform trend analysis.Monitor and report on various business trends from platforms including Google Analytics, Looker, ComScore, MRI, Nielsen, Google Ad Server, and 3rd party reporting tools as provided by vendors and partners (training will be provided)Become a key data subject matter expert across all aspects of the business within PMC.Special research and analysis projects as requested by business stakeholders across sales, finance, editorial, marketing and productEnd to end creation of ongoing dashboards and KPI reports from data ETL to business metric crafting to final stakeholder visualizationsCreate, manage, and perform various financial models to deliver meaningful information to business unitsAssist in month end close, including journal entries and revenue reporting and recording.Contribute to technical and product development by ensuring every technical upload has adequate tracking and analysis for performance optimization and decision makingJob Requirements and Experience:A desire to dig deeper to solve problemsA self-driven, goals oriented individual who loves using data to help answer complicated questionsBachelors degree in Engineering, Economics, Statistics, Finance, Accounting or related field.Google Analytics accreditation a plus3 years of experience in reporting and data analytics - experience in digital media or content publishing is a big plusExperience using statistical techniques and approaches to analyzing data a plusExperience using SQL to wrangle data for downstream business reportingSome level of experience with programming for data analysis, extracting data from APIs etc. (any language will do- R, Python, Java, etc.)Experience with BI tools like Tableau, Looker, etc also a big plusAbility to analyze large datasets and to proactively identify issues and make recommendationsAbility to function efficiently in an environment with multiple and shifting prioritiesAbout PMCPenske Media Corporation (PMC) is a leading digital media and information services company whose award-winning content attracts a monthly audience of more than 180 million and empowers more than 1 million global CEOs and business thought-leaders in markets that impact the world. Our dynamic events, data services, and rich content entertain and educate todays fashion, retail, beauty, entertainment and lifestyle sectors. Headquartered in New York and Los Angeles with additional offices in 11 countries worldwide, Penske Media is the way global influencers are informed, connected, and inspired. To learn more about PMC and its iconic brands, visit www.pmc.com."}