{"jobID": "2832864324", "jobLocation": "Alexandria_VA", "jobTitle": "Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.spa.com", "Headquarters": "Alexandria, VA", "Size": "201 to 500 employees", "Founded": " 1972", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " The Data Scientist will provide advanced analytical support to the Department of Homeland Security (DHS) and apply rational, systematic, science-based techniques, and critical thinking to help inform and improve the Department's decision-making abilities for preparation, response and recovery to man-made and natural disasters and impacts on the Nation's critical infrastructure. Apply principles of mathematics and statistics, computer science, software development, and the latest technologies to design and implement an analytical infrastructure and tools, workflow processes, and complex data visualizations. Contribute to the development of capabilities such as text analytic engines for automated document review and metadata discovery dashboards. Job duties/responsibilities: Assist in identifying, prioritizing, and executing programs to help demonstrate and expand analytical capabilities.  Develop data standards and frameworks to collect, integrate and link, and manage data.  Build data governance and structure for enterprise data integration.  Run, develop, and document models and analytic methods.  Create software code to extract and transform data for use in analysis.  Develop automated analytic algorithms to assist with data management.  Develop plans of action and timetables in order to meet established deadlines. Requirements Bachelors' Degree in Mathematics, Operations Research, Statistics, Computer Science, Engineering, or a related discipline.  5+ years of related experience, preferably in national security related programs.  3+ years' experience with data analytics (e.g., descriptive statistics, predictive modeling, data visualization), this can include significant academic projects.  Experience with one or more scripting or high-level programming languages such as Python, R, MATLAB, Java.  Experience with designing and developing automated analytic software, techniques, and algorithms.  Proficient in developing relational databases and mining data.  Proven ability to prioritize and execute workload to meet requirements and deadlines.  Experience developing compelling written and visual communications that are clear, concise, and suited to the audience.  Advanced knowledge of Microsoft Office Suite (e.g., Excel, Access, Word, PowerPoint).  Possess an active SECRET clearance with the ability to obtain TS. Desired: Master's Degree.  Experience providing analytical support to the Department of Homeland Security.  Experience with discrete system simulation software such as Arena or ExtendSim.  Experience with ArcGIS.  Experience within cybersecurity and/or critical infrastructure domains.  Active TS clearance.  DHS Suitability.  Associated topics: data administrator, data integration, data quality, data warehouse, database, database administrator, etl, erp, mongo database, sql"}