{"jobID": "2810310389", "jobLocation": "Southlake_TX", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "75000", "jobDescription": "Job Description What you'll be doing...  This position is responsible for assisting the Wireless NOC and/or NRB with data analysis, dashboard and reporting requests, creating data insights and performing research and making recommendations based on large volumes of data. Tracking ROI of specific initiatives, monitoring performance or volume patterns, etc.Demonstrate broad decision-making authority in determining the approach to reporting requirements within the assigned functional area.Collaborate with peers to reach consensus. What we're looking for... You'll need to have:Bachelor's degree or four or more years of work experience.Three or more years of relevant work experience.Knowledge of Network Repair Bureau (NRB) or Network Operations Center (NOC) ticket data structure and work processes.One or more years of experience writing complex SQL queries.One or more years of experience publishing with Tableau.Three or more years of experience with MS Access and Excel.Even better if you have:Degree in CIS or IT-related course of study.Strong analytical and communication skills.Strong ownership and demonstrated ability to work autonomously with a small team and little supervisory input.Experience with extracting meaningful data from large data sets in a variety of database structures and creating data relationships via joins and nested queries.Experience working directly with requesters to understand and shape reporting requirements.Certifications in SQL and Tableau.Knowledge of Python or other scripting language.Knowledge of Hadoop, Spark or other big data platform. When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}