{"jobID": "2754823506", "jobLocation": "Livonia_MI", "jobTitle": "Account Manager, Client Success", "companyRating": null, "companyInfo": {"Website": "www.valassisdigital.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Account Management is the core of our customers experience. This team provides our customers consultative solutions that maximize value and results for their business and growth for our company. Through strategic planning of additional new products and targeting, they scale existing accounts and ensure seamless and continuous support/guidance that deliver as expected.The Account Manager oversees the development and implementation of the post campaign process, while contributing to its strategic direction. This position includes daily Account Management tasks and a focus on upsell/resell and overall client health.Key Duties / Responsibilities:Account Growth Demonstrates a thorough understanding of the Client's business and actively seek opportunities for further account development.Performs strategic account planning, based on insights, client objectives/KPIs and Valassis Digitals product suite and capabilities.Owns & delivers insights, recommendations, and upsell & cross-sell opportunities to clients.Develops overall Client Strategy through frequent collaboration with Media Strategy and Operations leads.Executional Excellence & Client Service Single point of contact for Client, Sales, & Operations.Accountable for seamless campaign execution.Provides internal focus responsibilities such as ensuring campaigns, reports and projects are functioning properly escalate improvements to tools and process as needed.Maintains solid knowledge of Company capabilities; is at ease answering questions from the Sales team and Clients regarding capabilities and product offerings.Team/Employee Development Participates in role and team trainings, proactively shares feedback/ideas for the betterment of the AM role.Communicates with Account Supervisor to manage bandwidth and workload, ensuring tasks and assignment deadlines are always 100% met.Actively participates in helping to drive incremental revenue in order to meet team and company revenue goals and sharing successes across team members..Experience / Skills / Abilities:4-5 years experience in strategic Account Management (track record of meeting/exceeding upsell/resell quotas is a plus).Bachelor's degreeSolid understanding of the customer journey process and idea-driven toward the improvement of existing strategies and executions.Demonstrated mastery of presenting innovative solutions to Clients business and problems.Ability to see the big picture, identify key issues, and provide proactive tactical and strategic recommendations.Excellent communication skills, including the ability to produce exceptional work (written, PowerPoint, Excel, etc.) independently and efficiently.Strong cross-functional partnerships / established relationships.Ability to excel in a highly dynamic, fast-paced environment that requires fast learning and flexible thinking.Detail-oriented and diligent work ethic with excellent organizational, project/time management, and problem-solving skills.Strong team player.WHO WE AREValassis Digital is a leading digital marketing intelligence company, providing a best-in-class data management platform and online and offline targeting capabilities that fuels superior display advertising and expanded media offerings, such as in-store campaign solutions, for advertising clients. Through proprietary technology, Valassis Digital creates meaningful marketing and advertising impact for businesses from planning, delivery, and attribution. Valassis Digital taps into meaningful, actionable insights that drive better campaign performance.WHAT'S IN IT FOR YOU?Valassis Digital offers a generous total rewards benefits package that includes medical, dental and vision coverage, 401k matching, long-term cash incentives program, and PTO allowance. A wide variety of additional benefits like life insurance, employee assistance and pet insurance are also available!Valassis Digital considers applicants for all positions without regard to race, color, creed, religion, national origin or ancestry, sex, age, disability, genetic information, veteran status, or any other legally protected status. In addition, Valassis Digital will provide reasonable accommodations for qualified individuals with disabilities. If you need assistance with completing the online application process, please contact DL_Recruiting@MaxPoint.com.AE123 MXGD #LI-CB1"}