{"jobID": "2740306051", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Science Intern", "companyRating": null, "companyInfo": {"Website": "www.squareup.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Public (SQ) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company DescriptionWe believe everyone should be able to participate and thrive in the economy. So we’re building tools that make commerce easier and more accessible to all. We started with a little white credit card reader but haven’t stopped there. Our new reader helps our sellers accept chip cards and NFC payments, and our Cash app lets people pay each other back instantly. We’re empowering the independent electrician to send invoices, setting up the favorite food truck with a delivery option, helping the ice cream shop pay its employees, and giving the burgeoning coffee chain capital for a second, third, and fourth location. Let’s shorten the distance between having an idea and making a living from it. And make it easier for customers to shop and pay at their favorite businesses. We’re here to help sellers of all sizes start, run, and grow their business—and helping them grow their business is good business for everyone.Job DescriptionYou will: Partner with Square’s product teams to prioritize and answer the most important questions where analytics will have material impactWork on Square’s Central Data team with Data Scientists and Product AnalystsUse your experience in analytics tools and scientific rigor to produce actionable insightsCollaborate with business leaders, subject matter experts, and decision makers to develop success criteria and optimize new products, features, policies, and modelsBuild visualizations that expose the health and performance of our productsCommunicate key results to senior management in verbal, visual, and written mediaQualificationsYou have: Pursuing a degree in Economics, Statistics, Computer Science, Mathematics, or related technical fieldHands on experience in executing data analysis, plus for experience using SQL, Hive, R, and/or PythonAbility to understand complex business and data systemsAbility to clearly communicate complex results to technical and non-technical audiencesVersatility and willingness to learn new technologies on the job Even better: Programming experience in one or more object-oriented languages, including: Python, C, C++, Java, Ruby, Scala, and Go.An advanced degree (M.S., PhD.), preferably in Statistics, Computer Science, Physical Sciences, Economics, or a related technical fieldFamiliarity with Linux/OS X command line, version control software (git), and general software developmentExperience in programming or scripting to enable ETL developmentFamiliarity with Machine Learning ( e.g. regression, ensemble methods, etc.)Familiarity with relational databases such as Postgres, VerticaPrevious industry experience or internships in product related analyticsIndependent research experience Technologies we use and teach: Python ( numpy, pandas, sklearn)Vertica, HiveStatistics (Bayesian methods, experimental design, causal inference)TableauAdditional InformationAt Square, we value diversity and always treat all employees and job applicants based on merit, qualifications, competence, and talent. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance."}