{"jobID": "2817451669", "jobLocation": "Pleasanton_CA", "jobTitle": "Junior Business/Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.ascent-sys.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Jr. Business/Data AnalystPleasanton, CA1 yr. Contract?Description: Seeking a full-time Data Analyst. You will be responsible for analyzing, reporting, and normalizing large data sets. Your goal is to continuously improve the data foundation so the Product and Engineering teams can build products that deliver high value to our customers. If you have a \"get it done? positive attitude, business acumen, and analytical thinking skills, this may be the perfect opportunity for you. ?Responsibilities:Monitor and improve database quality through the use of internal data toolsPerform industry and company research to improve how we classify Big Data.Document and summarize findings that support research resultsCreate and run reports, enter data as required, and conduct research inquiries as directed?Requirements:College Degree (BA/BS)Strong research and analytical skills or demonstrated aptitudeDiscipline and determination to resolve complex problemsExcellent writing, editing, communications, organizational, and decision-making skillsAbility to work in a fast-paced environmentComputer proficient and experience using packages such as Microsoft Office and Google SpreadsheetsThis is an entry level position; recent graduates are encouraged to apply!?Company Description:About Ascent:  Ascent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.  If you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}