{"jobID": "2486344122", "jobLocation": "Alsip_IL", "jobTitle": "Advisory Scientist II -", "companyRating": null, "companyInfo": {"Website": "jobs.crowncork.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1892", "Type": " Company - Public (CCK) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "This details all the information about the job posting. Job Title Advisory Scientist II Plant/Location Alsip, IL 60803 US (Primary) Job Type Salary Category Research, Development & Engineering Career Level Experienced (Non-Manager) Education Bachelor's Degree Job Accountabilities CROWN Packaging Technology, the R&D; arm of CROWN CORK AND SEAL a global leader in rigid metal packaging, is searching for an experienced Aluminum Metallurgist / Materials Scientist to join our R&D; team. The successful candidate will possess a unique combination of technical and interpersonal skills and a demonstrated ability to thrive in a flexible and fast-moving organization. Essential ResponsibilitiesContribute to performance evaluation and qualifications of Aluminum metal components as part of our Technology teamWork closely with the Sourcing and Operations teams to support the development of material specificationsEfficiently execute hands-on sample preparation in a laboratory environment to generate the data needed to make recommendations or generate specifications that lead to product and process improvementsContribute as part of a cross-functional development team and drive short-term and long-term projects to completionFoster a safety conscious work environment and meet environmental, health and safety goalsRepresent R&D; at manufacturing trails and bring the voice of the customer back to the product development teamEffectively work with suppliers on new material technology developments. Job RequirementsQualifications/RequirementsDegreed professional in Materials Science and/or Metallurgical Engineering with a minimum of 5 - 10 years of laboratory and manufacturing plant experience. Knowledge and experience in metal stamping and drawing operations a plusFamiliar with a broad range of laboratory methods for microstructural and mechanical characterization. Technical expertise in scanning electron microscopy (SEM), energy dispersive spectrometer (EDS) and failure analysis desiredAbility and willingness to travel 20-30%Excellent problem distillation skills, with ability to analyze process data and to identify root cause of performance issues.Ability to identify opportunities for improvement and implement major changesStrong project management skillsAbility to be versatile in a dynamic marketGood communication and presentation skills, with the ability to communicate at all organizational levelsStrong interpersonal and problem-solving skillsSelf-starter and can-do attitudeExperience in lean / six-sigma a plusEEO/AA/Vets/Disabled Travel 20 - 30%"}