{"jobID": "2649433019", "jobLocation": "Fremont_CA", "jobTitle": "Data Science Engineer, Advanced Manufacturing", "companyRating": null, "companyInfo": {"Website": "jobs.wdc.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1970", "Type": " Company - Public (WDC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Seagate Technology, Toshiba"}, "estimatedSalary": null, "jobDescription": "Description At WD, we are building a “Big Data” analytics infrastructure to streamline our analytics platforms for our process and product engineering community.  WD Magnetic Head Operations is seeking a Data Science Engineer to join our Analytics team. The Data Science Engineer will be responsible for developing exploratory and predictive analytic systems, creating efficient algorithms and improving data quality. This individual will work closely with the design, engineering and IT to identify, evaluate, design and implement statistical analysis solutions.  The ideal candidate demonstrates a deep passion for applying advanced analytic approaches, an eagerness to dig into large data sets, and a vision for turning disparate data streams into a cohesive view for empowering a diverse engineering community. Responsibilities:Lead development of machine learning models/predictive analytics techniques leveraging both repeatable patterns in data and discovering new features that reduce variability, improve quality and enhance product yields in magnetic head wafer manufacturing operations.Understand challenging business problems and develop tools & techniques to find patterns and insights within structured and unstructured data generated in nanoscale manufacturing environment.Manage data analytics project requiring critical thinking about the relationships of different metrics measured (metrology) and process steps to land the right features (physics & integration) for a given model.Prototype creative solutions for improving product performance predictability, and be able to lead others (Domain/IT stakeholders) in crafting and implementing smart factory solutions in wafer operations.MS or PHD in Computer Science, Applied Math, Statistics and/or Engineering with an emphasis on Machine Learning.Solid fundamentals, knowledge of machine learning algorithms, classification, clustering, regression, Bayesian modeling, probability theory, algorithm design and theory of computation, linear algebra, partial differential equations, Bayesian statistics, and information retrieval.Possesses strong combination of theoretical knowledge and hands-on experience in data mining, feature selection, dimensionality reduction, statistical techniques, regression analysis, machine learning algorithms and failure predictionPossesses ability to mathematically model complex problems in machine vision, learning, and automation related to metrology and wafer operationsDeep understanding of materials science and ability to apply that knowledge to create novel big data analytics approaches to nanoscale device fabrication a plusFamiliarity with open source software tools for machine learning, deep learning and image analysis. Prior TensorFlow and/or H20 experience is a plus.Experience/proficiency in at least one programming language e.g. Java/C++, Python, MATLABProficiency with statistical analysis tools (e.g. JMP, R, SAS)"}