{"jobID": "2830181271", "jobLocation": "Muskegon_MI", "jobTitle": "Environmental Project Manager", "companyRating": null, "companyInfo": {"Website": "www.ergrp.net", "Headquarters": "Wixom, MI", "Size": "1 to 50 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Environmental Resources Group, LLC (ERG) is seeking candidates open positions in our Detroit, Wixom, and Muskegon, Michigan OfficesEnvironmental Resources Group, LLC (ERG) is a premier, fully integrated professional environmental services firm positioned to service public-and private-sector clients. ERG employs engineers, designers, planners, scientists and management and construction services professionals. The firm is a leader in the key markets that it serves, including agriculture, transportation, facilities, environmental, energy, oil and gas, water, and government. More information on ERG and its services can be found at www.ERGrp.net. Please e-mail your resume to info@ERGrp.net.About the Business LineEnvironment Our team of environment specialists offer expertise in air quality, impact analysis and permitting, environmental health and safety management consulting/due diligence, remediation consulting/engineering and construction/site restoration, specialty and emerging technologies, waste services and water and natural resources.ERG is looking for an engineer, geologist, or environmental scientist to join its Muskegon office. The person selected for this position will manage, complex work on projects related to site characterization, and evaluation of contaminated sites.Project work will include managing scope, schedule, and budget using teams of resources; preparing and implementing work plans and cost estimates for many types of environmental projects. ERG project managers oversee completion of reports, interact with internal and external customers, and track project budgets.Candidates must possess a Bachelor’s degree in engineering, geoscience, geology or hydrogeology, have 5 or more years of experience related to Phase I/Phase II ESAs, site investigations, site characterization, data interpretation, and reporting, and have project management experience. Strong interpersonal, verbal, and written communication capability is required.Preferred QualificationsAdvanced degree in environmental engineering or hydrogeology is preferred. Candidates will have business development and client relationship experience and have an established network with industry personnel and industry associations.What We OfferERG is a place where you can put your innovative thinking and business skills into high gear and work alongside other highly intelligent and motivated people. It's a place where you can apply your skills to some of the world's most challenging, interesting, and meaningful projects worldwide. It's a place that values the diversity of our areas of practice and our people. It's what makes ERG a great place to work and grow. ERG is an equal opportunity employer and Minorities, Females, Veterans, and Disabled persons are encouraged to apply."}