{"jobID": "2821568873", "jobLocation": "Los_Angeles_CA", "jobTitle": "Adjunct Professor of Data Sciences and Operations", "companyRating": null, "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Marshall School of Business invites applications for a part-time faculty position in the Department of Data Sciences and Operations (DSO) starting in Fall 2018.  The candidate should demonstrate several years of experience teaching Information Systems and related disciplines at the undergraduate and graduate levels. We are especially interested in candidates with teaching experience in spreadsheet modeling, digital media, and candidates who also have the versatility to teach in related areas in the DSO department as needed. Candidates should have a Ph.D. from a top university in a related discipline.  Qualified candidates must submit an application online.  Information about the Data Sciences and Operations department, its faculty and the Marshall school can be obtained at: http://www.marshall.usc.edu/dso.  USC is an equal-opportunity educator and employer, proudly pluralistic and firmly committed to providing equal opportunity for outstanding persons of every race, gender, creed and background. The University particularly encourages women, members of underrepresented groups, veterans and individuals with disabilities to apply. USC will make reasonable accommodations for qualified individuals with known disabilities unless doing so would result in an undue hardship.  Located near the heart of Los Angeles, the University of Southern California is home to approximately 31,000 students and 4,300 faculty. USC Marshall is renowned for its high-ranking undergraduate, graduate, international and executive education programs, an exceptional faculty engaged in leading-edge research, a diverse and creative student body, and a commitment to technological advancement. The research productivity of Marshalls 200 full-time faculty ranks among the top 15 business schools in the world.\\  USC is an equal-opportunity educator and employer, proudly pluralistic and firmly committed to providing equal opportunity for outstanding persons of every race, gender, creed and background. The University particularly encourages women, members of underrepresented groups, veterans and individuals with disabilities to apply. USC will make reasonable accommodations for qualified individuals with known disabilities unless doing so would result in an undue hardship."}