{"jobID": "2832398046", "jobLocation": "Irving_TX", "jobTitle": "Data Analytics-Consultant II", "companyRating": "3.5", "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": "70000", "jobDescription": "Description : Where good people build rewarding careers.  Think that working in the insurance field can't be exciting, rewarding and challenging? Think again. You'll help us reinvent protection and retirement to improve customers' lives. We'll help you make an impact with our training and mentoring offerings. Here, you'll have the opportunity to expand and apply your skills in ways you never thought possible. And you'll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life. Job Description Position available in one of the following locations: Irving, TX Roanoke, VA Charlotte, NC  Job Family Summary  The Data Analytics job family is responsible for collaborating with clients to make objective customer-focused and data-driven decisions by providing analytical insight, actionable data and recommendations. They are also responsible for projects, providing analytics support, and serving in a consultant role across Operations.  Job Summary  The Consultant II is responsible for supporting and consulting on the metrics and reporting for the assigned business unit through projects, meetings, data gathering, analysis and research to build and maintain custom applications and tools. The consultant will act as resource for metrics and reporting for Leadership and team members. With limited guidance, the consultant will independently build tools and reports to produce insights and actionable recommendations to Operations business partners/leaders in the form of analytic projects, striving to positively impact and influence operational efficiencies and business decisions. The consultant will have a passion for problem solving, comfort with ambiguity and the ability to think conceptually, analytically and creatively.  Key Responsibilities Design/Create/Update custom Windows Applications and Web Applications (within .Net environment).Development of Data Infrastructure through creation/update of SQL DBs.Identifies systems and technical constraints, potential technology risks, and document possible mitigation strategies for high complexity projects.Understands the technical details, integration, and functions of multiple applications within a team.Recommends technology solutions to meet business requirements.Collaborates, consults, and is a resource to Leadership and team members by providing training, support, and problem resolution for technical inquiries around metrics, reporting, tools, and project requests.Collects, analyzes, and acts on Leadership and team member feedback on user experience with custom-built tools.Investigates and resolves complex inquiries regarding large quantities of data, data sets, reports, and custom-built tools.Communicates effectively with the ability to explain technical processes, tools, and projects.Creates and maintains job aids for understanding of custom tools.Creates and maintains standard processes for in-team tasks.Presents facts, data, reports, and information in team and business meetings.Develops and maintains ongoing partnerships and relationships with Leadership and teams in supported business areas.Ensures successful completion of assigned projects.Identifies opportunities to improve processes, metrics, reports, and reporting tools.Creates customized reports with visual views for key performance and business metrics. Job Qualifications College Degree preferredProficient knowledge of .Net (VB.Net / C# / ASP.Net)Proficient knowledge of T-SQLKnowledge of Visual Basics for Applications (VBA) programming language requiredKnowledge of Microsoft Office requiredReporting and Analytics knowledge preferredStatistics and/or Statistical Analysis knowledge preferredStrong communication skills and the ability to simplify complex technical ideasStrong time management skills including ability to handle multiple projects, prioritize and organize The candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen.  Good Work. Good Life. Good Hands®.  As a Fortune 100 company and industry leader, we provide a competitive salary but that's just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you'll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video.  Allstate generally does not sponsor individuals for employment-based visas for this position.  Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.  For jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.  For jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.  It is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}