{"jobID": "2655669425", "jobLocation": "San_Francisco_CA", "jobTitle": "Principal Data Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.demandbase.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Engagio, Marketo, Evergage"}, "estimatedSalary": "179000", "jobDescription": " What do industry leaders like Adobe, American Express, Box, Salesforce.com and SAP have in common? They all use Demandbase solutions to power their business-to-business (B2B) marketing!  Demandbase, a leading SaaS-based B2B marketing technology, is looking for more inspired and driven people to join us. With a roster of loyal, blue-chip customers thats growing every day, were in a phase of pre-IPO growth and building the team that will take us to the next level. If you thrive on innovation and working with the best in industry, youre probably a good fit for us.  The Principal Data Engineer will own all aspects of engineering including technical design, architecture, implementation, quality assurance, deployment, and operations. You will be responsible for scaling our machine learning pipeline, including requirements, architecture, design & development. You will establish the ins and outs of building a highly available, scalable, distributed, and robust system that uses all the modern cloud computing paradigms, techniques and tools.  To apply for the role, you should possess strong analytical, design, and problem diagnosis skills. You like thinking outside the box, are not afraid of ambiguity, get excited about difficult challenges, and are a motivated self-starter. You are a strong team player and thrive in a startup environment where flexibility is essential and delivering rock solid, customer focused solutions is paramount. Responsibilities:Core responsibilities will be to help scale large scale machine learning modelsOwn and drive processing of tens of petabytes of unstructured and structured dataProvide leadership to the data science and engineering teams in terms of big data processingEnable machine learning systems to become more real-time in terms of decisions but also large scale data ingestionWorking with the latest open source technology on highly distributed, scalable productsRequirements:Master's Degree in Computer Science or related fieldExperience working with terabyte level, real-time datasetsMust have build applications in the past (at the start/mid career point)Multiple large scale distributed systems or data platforms, including Spark, Flink, Kafka, Dataflow, BigQuery, BigTable, Dataproc etcExperience with Scala and/or Java and PythonExperience building large scale crawlers, using Nutch, Gora, MapReduce, HBase, Elasticsearch etcStrong algorithm & data structure knowledgeExcellent communication skills and the ability to work well in a teamKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operationsStrong customer focus, ownership, urgency and driveWhy join us?Be part of a rapidly-growing, pre-IPO companyOpportunity to extend our ABM leadership position and fast-track innovation behind AI-powered Account-Based Marketing solutionsDrive the next generation of intelligent CRM technologies and invent how Artificial Intelligence, product design, and applications convergeWork with a world class team of engineers, PMs, data scientists, sales and marketersHave the flexibility of a start up with the security of a sizable, well-funded organization (we recently closed a $65M round of funding)About Demandbase: The Demandbase ABM Platform is the only comprehensive set of ABM solutions, Artificial Intelligence and patented technology purpose built for the account-based needs of B2B. This allows B2B companies to execute their marketing and sales efforts across the funnel to identify, attract, engage, and convert their target accounts and then measure the results. You can scale and grow your efforts with the leading ABM vendor instead of trying to patch everything together with multiple point solutions. The Demandbase ABM Platform allows customers to define their ABM strategies and initiatives and then take action from a single platform. It leverages unique B2B data sets, Artificial Intelligence and IP targeting technology, Real-Time Intent as well as ingesting our customers first party and CRM data in order to provide insights and initiate account activities. Enterprise leaders and high-growth companies such as Accenture, Adobe, DocuSign, GE, Grainger, Salesforce and others use Demandbase to drive their ABM strategy and maximize their marketing performance. Demandbase was named a Best Place to Work by SF Business times in 2015, 2016, and 2017 and Glassdoors Top 10 Best Places to Work in 2016. For more information, please visit https://www.demandbase.com or follow the company on Twitter @Demandbase. Benefits: Our benefits include 100% paid for Medical, Dental and Vision for you and your entire family, short-term/long-term disability, life insurance, flexible vacation policy, 401k, commuter benefits, free snacks, catered lunch every Friday, Pinot Noir Fridays, chair massages, weekly yoga and much more!"}