{"jobID": "2795202230", "jobLocation": "Princeton_NJ", "jobTitle": "IT Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.stiorg.com", "Headquarters": "Princeton, NJ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Unknown", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Hi ,  Hope you're doing great!!  This is Bhanu Prakash from STI / Software Technology Inc. We have an Immediate Job Opportunity.Please respond back to meASAP. Kindly ignore, If the below job do not match your criteria/location. Title :IT Data AnalystLocation :Princeton, NJ (Only Locals)Duration : 6+ MonthsJob Description:Must have proven working experience as a data analyst or business data analyst..Knowledge of statistics and knowledge of statistical packages for analyzing datasets e.g. Excel, SPSS (Statistical Package for the Social Sciences), SSAS (SQL Server Analysis Services), R, etc.Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy. Adept at queries, report writing and presenting findings.Must have a proven track record of working with business and IT partners in delivering solutions.Such experience must include lead roles in driving a strong data culture in project deliveries.Knowledge and experience in data mining, or information retrieval utilizing database toolsets. Must be highly proficient in SQL, data model concepts (both logical and physical).Experience processing large amounts of data.Practical experience and programming knowledge to clean and scrub noisy datasets. Hands on experience with HADOOP toolsets such as HDFS, HIVE is required. Thanks, BhanuPrakashSr. Talent Acquisition SpecialistOffice: 609 447 3345 (Direct)609 232 8700 Ext 124SMS: (501) 943-6537\"Email is the best way to reach me\"Email:bhanu.prakash@stiorg.comHangouts:bhanu.sti.recruiter@gmail.comSoftware Technology Inc./STI"}