{"jobID": "2829111598", "jobLocation": "Traverse_City_MI", "jobTitle": "Mid-Level Geologist / Hydrogeologist / Environmental Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.woodplc.com", "Headquarters": "Aberdeen, United Kingdom", "Size": "10000+ employees", "Founded": " 1848", "Type": " Company - Public", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " Wood Environmental & Infrastructure Solutions is seeking a Mid-Level Geologist or Hydrogeologist to join our team in Traverse City, MI.  Are you a Geologist or Hydrogeologist with 10 to 15 years environmental/consulting experience that enjoys technical challenges as well as client, agency and public interaction? Are you looking for an opportunity to work with an established environmental consulting firm that values its employee’s enthusiasm and technical contributions? We encourage you to apply for this opportunity. We are seeking for a Mid-Level Geologist or Hydrogeologist to join our Traverse City, MI team and are dedicated to providing the atmosphere to allow individuals to grow their careers. This position requires an individual with effective communication skills as significant client, agency, public and team interactions are expected.  Key Responsibilities Manages the development of work scope, schedule, and budget definition for proposalsDirects the execution of work, including subcontractor procurementAssists the Project Manager and team in ensuring effective client and regulatory agency communication and relationsPrepare reports, work plans, health and safety plans, and quality control plans under the supervision of senior staffPerforms data quality assurance review of field and laboratory work product to determine whether data quality objectives have been metDirect multi-media sampling, including soil, groundwater, vapor, indoor air, asbestos, and other regulated materialsAssists the Project Manager on technical assignments and management of specific elements of the project in the field as well as in the office (i.e., task management)Evaluates compliance of subcontractor work against technical specifications and scopes of workDemonstrates competency in a combination of areas including field supervision, technical knowledge and task managementConducts moderately complex scientific assessment and analysisPrepares or assists in preparing remedial investigation reports, remedial/corrective action plans, remedial designs, due diligence reports, and related documents; Includes work summaries, data summaries, data synthesis (e.g., conceptual site models), engineering calculations, summary tables, figures, engineering drawings and specifications, and report textAssists Project Manager with cost and schedule controlReviews payment applications, requests for information, change order requests and other subcontractor submittalsDemonstrates and maintains competency in a diverse set of local, state, and federal environmental regulationsMotivates, trains, and mentors subordinate staff assigned to his/her tasks or projectsThe position may entail approximately 90% office work and 10% field work on a variety of projects, primarily for industrial and commercial clientsB.S. or M.S. degree in Geology, Hydrogeology, Environmental Science or related field. P.G, or CPG preferable (or willingness to attain license)10 - 15 years environmental consulting experienceProficient in MS Office Suite (MS Word, Excel, PowerPoint)Proficient in Surfer or other contouring softwareSome experience with analytical models (e.g., REMChlor, BIOChlor, etc.)Excellent communication, both verbal and written, and organizational abilitiesWillingness and ability to interact with regulatory agencies, stakeholders and clients and develop effective teamwork relationshipsFlexibility to work outside of normal business hours as requiredAbility and willingness to travel to project sites primarily in Michigan and surrounding states in the Great Lakes areaOSHA HAZWOPER 40 hour training in accordance with 29CFR 1910.120Must pass drug test, entrance physical, background check and must have a satisfactory driving record in accordance with the Company's driving (MVR) policy Wood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 55,000 people, with revenues of around $10 billion. We provide performance driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets including the upstream, midstream and downstream oil & gas, power & process, environment and infrastructure, clean energy, mining, nuclear and general industrial sectors. We strive to be the best technical services company to work with, work for and invest in. www.woodplc.com  We are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws."}