{"jobID": "2757498809", "jobLocation": "Washington_DC", "jobTitle": "Web Developer", "companyRating": "3.1", "companyInfo": {"Website": "www.peraton.com", "Headquarters": "Herndon, VA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "101000", "jobDescription": " OverviewPeraton is seeking a Software Developer for Web Applications in Alexandria VA to support our Naval Research Laboratory (NRL) Customer.Responsibilities Develop and implement security architectures for enterprise systemsCreate and implement federated identity management and access control solutions for data sharing among different organizationsProvide data protection mechanisms that satisfy need-to-knowPerform vulnerability assessments of systemsDevelop applications using tools such as JDBC and TOMCAT (non-exhaustive list) to enable access to databases housing enterprise data to support the development of security measures.Candidate must be proficient in the development of applications in Java with the capability to handle massive data inputs from various platforms and other sources.Proficiency with the development of security measures in a heterogeneous environment is a plus. QualificationsREQUIRED: Bachelors’ Degree in Computer Science (or equivalent work experience (3+ years))Minimum of 3+ years in web based software development (focused on Service Layer development) in an Agile development methodology.The list of tools/libraries/architectures that a candidate should be highly proficient in are: Java, JSON, Configuration Management Tools (JIRA, Confluence, git), Continuous Integration Tools (Jenkins, Maven), Web design tools e.g. MVC (Spring), Annotations (as used in Spring), REST-based web services, Java Design Patterns & Best PracticesSECURITY CLEARANCE:This position requires the candidate to be able to obtain and maintain a Secret Clearance. About PeratonPeraton provides innovative, reliable solutions to the nation’s most sensitive and mission-critical programs and systems. Peraton has significant experience providing highly differentiated secure communications, space, and technology solutions to key customers, and has become a trusted partner on missions that are critical to the security priorities of the United States. Capabilities include complex software and technology services and solutions, as well as end-to-end mission operations abilities, including Software Systems Development, Cyber, Modeling & Simulation, Mission Operations, Signal Intelligence (SIGINT), and Quick Reaction Capabilities (QRC) / Research & Development. The company is headquartered in Herndon, VA, with approximately 3,500 employees across the U.S. and Canada.EEO StatementWe are an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law."}