{"jobID": "2778385496", "jobLocation": "Murray_Hill_NJ", "jobTitle": "Clinical Scientist", "companyRating": null, "companyInfo": {"Website": "www.bd.com", "Headquarters": "Franklin Lakes, NJ", "Size": "10000+ employees", "Founded": " 1897", "Type": " Company - Public (BDX) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Siemens, Baxter"}, "estimatedSalary": null, "jobDescription": "Job ID: 2018-11570 Career Level: experienced Division: BDI Corporate Relocation: Yes Location: Murray Hill,New Jersey,United States Summary of Position with General Responsibilities:The Clinical Scientist serves a medical research function and applies a broad knowledge of clinical research activity, therapeutic area knowledge and regulatory requirements to facilitate the development and implementation of clinical studies. The primary objective and purpose of this position is ensuring that clinical trial protocols and study reports are developed and written with scientific rigor. He / she is responsible for all aspects of clinical science including research, developing and writing study protocols, investigator brochures, study summaries, clinical study reports, or other clinical documents. The Clinical Scientist will oversee the scientific aspects of clinical studies throughout the duration of the study and may be asked to respond or provide guidance to address questions regarding scientific and related procedural issues from investigators. He / she will support clinical teams as the medical writing representative, bearing the responsibility for timely and accurate completion of medical writing deliverables.  The Clinical Scientist works closely with Medical affairs at Corporate and Business Units, Principal Investigators and statisticians to develop clinical documents. He / she may present or assist with preparing responses to regulators or present data to data monitoring committees, investigators, etc.Essential job Functions:Conduct background research on indications and studies to establish references and scientific base;Utilize knowledge of clinical trial design to develop specific study concepts and protocols;Participate/lead discussions concerning scientific and procedural aspects of study design;Develop clinical documents (study protocol, investigator brochures, consent forms, study reports, etc) in accordance with FDA regulations;Provide input to the design of CRFs;Identify and resolve issues related to study design and execution;Assist with the ongoing review of summary data including safety, primary efficacy variables and lab data;Assist in the preparation and review of key regulatory documents, submissions, and annual reports. Present clinical performance data to FDA reviewers and other regulatory officials.Plan, draft and revise scientific manuscripts for publication;Write and present abstracts describing study data for clinical conferences.Support business units with posting of protocols, study results and adverse events report on ClinicalTrials.gov;Identify best practices for study design and execution, update SOPs and templates accordingly, and provide training sessions for appropriate personnel. * Additional areas of responsibility as assigned.Basic Qualifications:Minimum of BS or equivalent, MS, PharmD or PhD in field relevant to clinical research preferredMinimum 3 years with PharmD or Ph.D, 5 years with M.S. and 8 years with BS.Must be able to use scientific and clinical knowledge to conceptualize study designMust demonstrate excellent writing and organizational management abilitiesFamiliar with clinical operations and FDA and HIPAA rules, regulations and guidelinesKnowledge of good document management practicesAdditional Desirable Qualifications Skills and Knowledge:Ability to anticipate and resolve problemsAbility to lead cross functional efforts and teamsProficiency in data interpretationClinical project management skillsExcellent skills in oral and written communicationsAbility to work independently with minimal guidance as well as collaboratively within a team setting #LI-JW1"}