{"jobID": "2652072700", "jobLocation": "Los_Angeles_CA", "jobTitle": "Lead Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.ashleyellis.com", "Headquarters": "Naperville, IL", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Lead Data Engineer Posted:  02/01/18 Type:  Full Time  Location:  Los Angeles / Orange County, CA  Category:  Information Technology  Salary:  DOE Job ID:  DC801022AEDP7 Apply  Email  ShareAre you seeking the opportunity drive the direction of data in a global organization?We are seeking a Lead Data Engineer to design complex enterprise-level solutions for data collection, analysis and consumption. You will be responsible for gathering requirements, creating documentation (BRD’s, FSD’s), designing data workflows, and creating / making presentations to stakeholders. In addition, you will be responsible for collecting data from various sources, scrubbing the data, data modeling, data preparation, data optimization, developing analytical / predictive analytic solutions, constructing datasets, and applying data tools and algorithms for trend / pattern identification.  In addition to competitive compensation and benefits, you will also be offered the rare opportunity to join a global firm that will support you in your career growth. Culture fit is key – our teams are tight-knit and our turnover is low.  You must have at least 5 years of relevant in-depth experience as a Data Engineer, and a BS degree in a related field is highly preferred. This must include hands-on experience with SQL or a variation (NoSQL), and top-notch skills with the following: data scrubbing, data collection, data blending, data standardization, data mining, data migrations / integrations, data quality, and solution development. Additionally, we are seeking experience with IaaS Cloud micro-services (AWS, Azure or similar) and statistical languages, including SAS, Python, R, as well as experience with a version control system. Extremely strong problem-solving, analytical, interpersonal and communication skills needed for this role. While you must love data, this position also involves a lot of interaction within all levels of the organization. Ability to travel up to 25% required.  Required: 5+ years as a data engineerSQL / SQL Server / NoSQLData ScrubbingData MiningData MigrationsData IntegrationData Quality**IMPORTANT: If offered employment, applicant must be able to show proof of eligibility to work in theUnited States as required by Federal Law. Ashley Ellis will not sponsor applicants for work visas, nor do we offer corp-to-corp contract opportunities. We do not accept resumes from 3rd parties. Apply"}