{"jobID": "2811573031", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Lead Software Engineer - Media Delivery", "companyRating": "3.7", "companyInfo": {"Website": "www.akamai.com", "Headquarters": "Cambridge, MA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (AKAM) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Level 3 Communications, Mirror Image Internet, Limelight Networks"}, "estimatedSalary": "156000", "jobDescription": "Overview: Would you like to lead team that provides API services to some of Akamai's largest partners? Do you have what it takes to run a service with high availability? Does the idea of tracking software behaviors in distributed environments excite you? Akamai's Media Engineering seeks a hands-on technical leader to join and drive a team which designs enterprise scale configuration services for its thousands of server across the globe. We believe in agile development, continuous integration, maintainable software, and modular architecture. You would work with Python based services deployed at scale and that provide high 9s of availability. You will lead technical execution of a highly skilled team, collaborate across functions and influence key design and implementation decisions.  As a Senior Lead Software Engineer you will: Bring experience of strong SDLC practices for improved code quality - through improved peer code reviews, continuous integration/delivery and release management.Collaborate with architects and support teams in improving supportability, resilience and scalability of existing software.Provide technical leadership for the design and architecture fulfilling multiple product requirements, which includes keeping the Akamai platform up-to-date with cutting-edge technologies.About the Team: Organizations that host workloads such as websites, applications, and media content with Public Cloud Providers need delivery as a part of their Cloud architecture. These workloads are designed for specific experiences – buying products and services; watching videos or listening to audio; downloading files, games, or photos; submitting or uploading information; or reading content. However, if the user experience is suboptimal, then the users will abandon their session, resulting in lost revenue and wasted investment. A global delivery solution enables the application owner to instantly improve the user experience and reliability of their workloads for any user, on any device, anywhere in the world. Required Education and Experience: 8 years of relevant experience and a Bachelors degree or6 years of relevant experience and a Masters degreeRequired Skills:8+ years of experience programming in Python8+ years of experience with Linux or Unix-based OS5+ years of experience developing scalable services at enterprise scale.2+ years of technical leadership experienceDesired Skills:Strong leadership, communication, organizational and technical management skills.Previous experience with geographically distributed teams is highly preferred."}