{"jobID": "2812828906", "jobLocation": "East_Hanover_NJ", "jobTitle": "Quality Control Scientist", "companyRating": null, "companyInfo": {"Website": "www.eurofins.com", "Headquarters": "Hasselt, Belgium", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public (ERF) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Eurofins Lancaster Laboratories, a nationally recognized laboratory, is searching for a Scientist to support our Professional Scientific Services group in the East Hanover, New Jersey.  Scientist responsibilities include, but are not limited to, the following: Responsible for performing routine QC Stability testing of all active substances, excipients, finished dosage forms and complaint samples. Knowledge of HPLC, GC, UV/VIS, Dissolution and other typical QC Analytical instrumentation. Verifies / validates US CPO Quality Control data, while monitoring for trends and abnormalities. Reports and acts on data results. Individual will initiate laboratory investigations. Individual will initiate deviations as applicable. Responsible to ensure that established QC procedures are followed. Responsible for following laboratory schedules (as applicable). Responsible to ensure good documentation practices are followed. Responsible for serving on various project teams to fulfill activities as assigned. Responsible for writing and updating applicable SOP's Assist with compilation of QC laboratory documentation metrics. Individual may provide internal training to other individuals (if applicable). Individual is capable of independently troubleshooting analytical and instrument problems. Individual is responsible for assuring adherence to Federal (FDA, DEA, EPA), OSHA regulations, cGMP's, SOP's, company policies and procedures. They may work independently on projects. The individual will comply with Good Manufacturing Practices, Health, Safety and Environmental policies and other federal regulations and company policies and procedures.The ideal candidate would possess: Individual must possess a good knowledge, understanding and ability to apply typical chemical analysis techniques Understand and practice c GMPs and industry methodologies as it applies to quality assurance Knowledge cGMP is a plus Knowledge of stability regulations is a plus Strong computer, scientific, and organizational skills Excellent communication (oral and written) and attention to detail Ability to work independently and as part of a team, self-motivation, adaptability, and a positive attitude Ability to learn new techniques, perform multiple tasks simultaneously, keep accurate records, follow instructions, and comply with company policies Experience with LIMS preferredBasic Minimum Qualifications: Bachelor's degree in scientific discipline or Associate's 0-2 years experience working in the analytical chemistry profession Knowledge of laboratory practices and instruments required Authorization to work in the United States indefinitely without restriction or sponsorship Position is full-time, Monday-Friday, 8 a.m.-5 p.m., with overtime as needed. Candidates currently living within a commutable distance of East Hanover, New Jersey are encouraged to apply.  As a Eurofins Lancaster Labs employee, you will become part of a company that has received national recognition as a great place to work. We offer excellent full-time benefits including comprehensive medical coverage, life and disability insurance, 401(k) with company match, paid holidays and vacation, personal days, and dental and vision options.  To learn more about Eurofins, please explore our website www.eurofinsus.com . Eurofins is a M/F, Disabled, and Veteran Equal Employment Opportunity and Affirmative Action employer."}