{"jobID": "2791597397", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.copart.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Company - Public (CPRT) ", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "Full-Time/Part-Time: Full-time Regular/Temporary: Regular  Job Description:Copart is looking for a data scientist who will work closely with IT and various other departments to drive insight into data and deliver machine learning solutions to improve Copart's operations. This data scientist will also design/manipulate large scale data sets from a multitude of sources, work to operationalize and integrate machine learning solutions into Copart's current products, and visualize and report on findings and results to provide insight to the organization. ResponsibilitiesDevelop new predictive models using advanced techniquesApply critical thinking to ensure data integrity and quality control is applied to each dataset, model and other analysis prior to presenting with internal customersCoordinate with different functional teams to operationalize, and monitor machine learning solutionsApply statistical methodologies such as cluster and regression analysis, if necessary.Act as a proponent of data science/analytics to senior leadership and others by being able to explain the benefits of machine learning, and other techniques.Requirements: 2 years of experience with machine learning, statistical modeling, and data mining techniques.Proficiency in either R or PythonProficiency in data sourcing/manipulation in SQLBachelor or Master's degree in highly quantitative field (computer science, mathematics, machine learning, statistics) or equivalent experienceExperience applying various machine learning techniques, specifically neural networks and gradient boosted machines, and understanding the key parameters that affect their performanceStrong data visualization skills using open source tools (plotly, ggplot2, shiny)Experience with both supervised and unsupervised modeling techniquesBusiness Line: Copart, Inc. "}