{"jobID": "2830527673", "jobLocation": "Grand_Rapids_MI", "jobTitle": "1st Shift Part Time Warehouse Team Member", "companyRating": "3.1", "companyInfo": {"Website": "www.meijer.com", "Headquarters": "Grand Rapids, MI", "Size": "10000+ employees", "Founded": " 1934", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, Walmart, SpartanNash"}, "estimatedSalary": "9", "jobDescription": "Currently, Meijer is looking for a Warehouse Team Member. The individual selected for this position will be responsible for product selection and loading of trailers for store delivery within our distribution facility. The individual will also maintain a friendly working relationship with a diverse team and leadership to promote productivity and maintain an attitude of positive customer service. The ideal candidate must be at least 18 years old and able to work any shift.Key responsibilities include:Working safely and promoting safety regulations throughout the facilityKeeping work area clean and orderlyMaintaining an excellent attendance recordTaking pride in a job well doneIdeal candidate will have a high school diploma, GED or equivalentAvailable to work weekends, holidays and overtime when requiredSuccessful completion of physical and background checkHave reliable transportationCustomer focus orientation, acts with customers in mindDrive for results, exceeds goals and focuses on the bottom lineEthics and values, acts in line with core values in good and bad timesInterpersonal savvy, relates well to all kinds of people and builds effective relationshipsPossesses good listening and communication skillsAbility to work in various temperatures, several buildings are refrigerated so working conditions ranging from -20 degrees F to 34 degrees or 34 degrees F to 55 degrees depending on assignment while other buildings may have temperatures around 95 degrees F in the summer monthsAbility to lift, carry, push, pull, bend and twist while handling product up to 75 pounds continuously Thank you for your interest in this position. There may not be current openings for this position at this time. By submitting an application to this position, you are expressing interest should an opening become available in the future. Our recruiters routinely review available applications as openings become available. Submitting an application is no guarantee for consideration as we are unable to predict the availability of open positions."}