{"jobID": "2585164503", "jobLocation": "Ne_Jersey", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.primussoft.com", "Headquarters": "Duluth, GA", "Size": "51 to 200 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities: Analysis of VoC data from multiple sources (i.e OL, Foresee, Tealeaf, Chat) and distilling information into actionable insights.  Measuring themes weekly to identify trends and making recommendations to appropriate teams to address issues or opportunities identified in research.  Partnering with internal groups to ensure insights are used towards current projects in queue and/or to create new projects for optimization.  Tracking and measuring impacts of insights to business goals.  Analyze verbatim customer feedback for trends and sentiment on digital experiences and promotions.  Conduct surveys and/or Voc analysis for key product launches.  Keep track of key themes weekly, distill insights and provide reports containing analysis and recommendations.  Present insights to appropriate teams, gather implementation dates and track performance post implementation.  Conduct competitive analysis and review secondary data sources.  Maintain in-depth knowledge and understanding of different research methodologies and data analysis techniques as well as channel and industry best practices.  Partner with other team members to provide holistic view of customer experience and plan of action to address issues and opportunities identified through research.  Self manage all research/testing projects as assigned in requested timeline.  Required:  3-5 years of relevant experience in qualitative research and analysis, or similar role in a professional environment.  At least 1 year of e-commerce experience.  Self-starter who is comfortable with minimal day-to-day guidance and independently managing deadlines.  Exhibit strong problem solving, analytical, and critical thinking skills with the ability to make sound recommendations and decisions based on data and prior experience.  Proven track record of consistently producing deliverables that are well-written and contain helpful information, providing solid and actionable recommendations.  Proven ability to synthesize lots of information and distill it into meaningful data.  Excellent written and verbal communication skills.  Ability to quickly learn and adapt in a fast-paced, highly interactive environment. Proficient in Microsoft Word, Power Point, Excel, and Outlook.Highly Preferred: Experience with research tools including Opinion Labs, Foresee, Usertesting.com, Survey Monkey.  Experience within the telecommunications industry."}