{"jobID": "2770831857", "jobLocation": "Redlands_CA", "jobTitle": "ArcGIS Data Scientist Product Engineer - Imagery", "companyRating": "3.7", "companyInfo": {"Website": "www.esri.com", "Headquarters": "Redlands, CA", "Size": "1001 to 5000 employees", "Founded": " 1969", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pitney Bowes"}, "estimatedSalary": "119000", "jobDescription": " OverviewJoin our imagery team and work to design, implement, and test imagery machine learning, deep learning, and artificial intelligence techniques in order to detect objects in imagery, label the objects, and classify pixels. This is an exciting opportunity to innovate traditional GIS and remote sensing workflows for extracting information from imagery. In addition, you will have the opportunity to contribute to writing great user documentation, conceptualize and build demonstrations, and collect user requirements which will help drive future releases. You will also have a chance to exercise and develop your software development experience with programming languages such as C++ and Python. Responsibilities:Design and test new ArcGIS integrations with common toolkits such as CNTK and TensorFlowExplore transfer learning and other techniques to make use of existing modelsHelp design and test modules in the ArcGIS API for PythonDesign, document, and execute regression test suites as well as acceptance criteria workflows and user scenariosAnalyze daily test results and report daily quality statusRequirements2-5 years of experience in machine learning or data sciencePrior experience or significant academic project work involving training modelsAdvanced programming skills with C++ or PythonBasic knowledge of GIS and remote sensingExcellent test engineering and problem-solving skillsDesire and ability to learn new skills and contribute to producing quality commercial softwareBachelor’s or master’s in GIS, computer science, geography, or related field, depending on position levelRecommended Qualifications:Expert in the Python language and package ecosystemPrior experience with CNTK, TensorFlow, or other machine learning toolkitsFamiliarity with cloud infrastructure such as AWS or AzureArcGIS Pro experience The CompanyOur passion for improving quality of life through geography is at the heart of everything we do. Esri’s geographic information system (GIS) technology inspires and enables governments, universities, and businesses worldwide to save money, lives, and our environment through a deeper understanding of the changing world around them.  Carefully managed growth and zero debt give Esri stability that is uncommon in today's volatile business world. Privately held, we offer exceptional benefits, competitive salaries, 401(k) and profit-sharing programs, opportunities for personal and professional growth, and much more.  Esri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}