{"jobID": "2745544233", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Product Manager (War Commander: Rogue Assault)", "companyRating": "4.2", "companyInfo": {"Website": "corp.kixeye.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Media", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "147000", "jobDescription": " You are at the epicenter of game execution. You provide direction, coordination and measurable performance to the game design process. You own game and feature specification. Improving monetization and performance is your mantra. You creatively solve problems and understand data can accelerate performance. You motivate and strengthen team culture bringing it all together and keeping everyone moving forward.  What you get to do every day: Own the development of new features in the productWork with leadership to define and promote the product vision, and overall strategy throughout the teamLead other product managers in the coordination of cross functional teams developing features for the productOwn the results of your team's impact on the total success of the productDrive features from concept to ongoing optimization working with all relevant cross functional disciplines to provide the best outcomes at the lowest costIdentify opportunities for key initiatives to enhance the customer experience and make the game funLiaison and collaborate with all relevant cross-functional teams to guarantee smooth, efficient implementation and rolloutCommunicate product releases and implementation plans to all key stakeholdersDefine and implement feature testing protocols – A/B, multi-variateSet up process using optimization tools, write test projections, and measure performance using relevant data points to report on variances and make recommendationsAct as a leader for in the quality assurance process in delivering a flawless productWhat you bring to the role:Experience managing other product managers strongly preferredProven experience in making demonstrable impact on revenueAble to deeply understand the game development process and push maximum impact relative to costAble to partner with cross-functional disciplines, and to influence effectively while remaining diplomaticDeep understanding of feature development process; aware of all relevant considerations (UI/UX, design, engineering costs, monetization, analytics, etc.)Advanced use of MS ExcelStrong organizational and analytical skills & attention to detailPerformance-driven self-starter and team playerAn ability to interact and communicate effectively with others in your teamAble to meet deliverables and drive your work to completion within specified timelinesGreat communication skills both written and verbalCan work cross functionally in many areas without being constrained by your jobKnowledge and passion for interactive entertainment and games is preferred"}