{"jobID": "2788746095", "jobLocation": "Corpus_Christi_TX", "jobTitle": "Engineer Scientist", "companyRating": null, "companyInfo": {"Website": "www.camber.com", "Headquarters": "Huntsville, AL", "Size": "1001 to 5000 employees", "Founded": " 1974", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Huntington Ingalls Industries - Technical Solutions Division, Integrated Mission Solutions Group (Camber Corporation) provides mission-critical engineering and technical service to Information Technology, Federal Civilian, and National Security, Aerospace & Defense and International government and commercial customers at over 100 locations worldwide.HII-TSD, Integrated Mission Solutions Group (Camber Corporation) is currently seeking an Engineer/Scientist to work out of their Corpus Christi, TX office. Duties and Responsibilities (to include but not be limited to the following):Providing technical expertise for various Army rotary wing product lines including but not limited to engines, gear boxes, rotor heads, and rotary wing aircraft. Verify that all in-process testing, manufacturing, inspection, assembly, and repair processes produce a conforming product. Serve as an integral participant of product planning in areas of program supportability analysis, acquisition of new equipment, modernization, Lean Six Sigma, and technical data changes. Review technical data and conducts process surveys/surveillance to ensure compliance with technical data and process procedures. Evaluate engineering change proposals and waivers/deviations for impact on product integrity and ensures shop floor Depot Maintenance Work Requirement compliance. Identify specific production problems in current operations and implement preventive measures to reduce/eliminate quality escapes and/or non-conforming products. Evaluate the applicability of new technology for repair/overhaul processes.Qualifications and Experience:Required-The candidate will have a BS or MS in Aerospace or Mechanical engineering. The ideal candidate will have at least 4 years of experience related to the manufacturing and/or repair of aircraft. The candidate must have a team-oriented mindset and the ability to provide technical guidance to less experienced engineers and technicians. Candidate must be an effective communicator, and be able to develop and deliver periodic presentations, management briefs, project tracking, status reporting, and draft technical documents. The candidate will have experience with root cause analysis, testing, materials analysis, product quality deficiency reports, failure analyses, manufacturing oversight, manufacturing plans, stress analyses, corrosion control, and data analysis supporting system safety and airworthiness for all Army aircraft is desirable. Travel up to 25% is required.Preferred –A strong working knowledge of Maintenance, Repair, Overhaul (MRO) of aircraft components, systems, and structures is preferred. Experience with Aviation Maintenance and/or Army aircraft systems, or prior military service is desirable.Experience and working knowledge of Depot Maintenance Work Requirements, other military aviation technical data, Complex Assembly Manufacturing Solution (CAMS) and LEAN Six Sigma principles are a plus.This position is office based, but requires frequent shop visits and outdoor travel between various locations within the industrial complex.These duties require everyday use of steel-toe shoes, eye protection, hearing protection, and may require infrequent use of other PPE as needed.Security: Ability to obtain and maintain a DoD Secret security clearance is required.All candidates will be subject to a pre-employment background investigation and drug screening per HII requirementsAbout UsCamber Corporation is part of the Integrated Mission Solutions Group of HII’s Technical Solutions division. Integrated Mission Solutions Group is a leading provider of Agile Software Engineering and Information Technology solutions; All Hazards services; Modeling, Simulation, and Training solutions and services; Unmanned Systems support; Intelligence Analysis and Operations; and Engineering and Management services to Department of Defense, Federal, and commercial customers.Integrated Mission Solutions Group (Camber), a subsidiary of Huntington Ingalls Industries, Inc. (HII) is headquartered in Huntsville, AL. From Camber’s founding in 1990, we have grown to 32 offices, positioned to provide responsive support to our customers across the United States. We deploy personnel to support our customers globally, including many locations in Asia, Africa, and Europe, providing daily interface on technical, programmatic, and operations issues. Overall, more than 1,600 Camber professionals deliver ISO 9001:2008-certified and CMMI ML3 high-value solutions to customers worldwide.Camber Corporation is an Equal Opportunity Employer EOE/AA Minorities/Females/Veterans/Disabled"}