{"jobID": "2802104215", "jobLocation": "Chicago_IL", "jobTitle": "Data Governance and Analytics Analyst with C4 Technical Serv", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Chicago Interviews but with C4 Technical Services  ChicagoInterviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Data Governance and Analytics Analyst  Location: Chicago, IL  Have worked with at least one Enterprise Application (ERP) System or similar (Ex: SAP, Oracle Financials, etc).  5+ years in business/data analysis, Data Governance, or data quality  In depth knowledge of Data Governance / Data Quality processes and procedures  Company DescriptionC4 Technical Services knows the right people in IT and Telecom  C4 Technical Services earns the trust of our clients and candidates by understanding the needs of both, matching experienced professionals with the right opportunity. We are a business that thrives on agility, and because of that, we are able to handle staff needs outside of core competency for a range of clients.  From providing expert contractors for projects requiring temporary staffing, to direct-hire searches for key positions within organizations of any size, C4 Technical Services knows the right people in Information Technology, Telecommunications and Engineering.  A family-owned business, we have seen rapid growth. As our business has grown, we have added capabilities and services that position us as a leader in the staffing industry, all without losing our personal touch.  C4 Technical Services has the experience to handle single client needs, as well as support national firms with hundreds of needs. Our client roster includes small, locally-owned businesses and Fortune 500 companies. We have contractors working in 44 of the 50 states, and our base continues to grow.  Specialties  Information Technology and Telecommunications staffing.  Specialties: Information Technology Services, Consulting, Contracting, Staffing.  Apply"}