{"jobID": "2758925368", "jobLocation": "Tyson's_Corner,_Fairfax_VA", "jobTitle": "Data Analyst, Sales", "companyRating": null, "companyInfo": {"Website": "www.alarm.com", "Headquarters": "Tysons, VA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (ALRM) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "POSITION OVERVIEW Are you passionate about solving complex puzzles and problems? Do you get excited by extreme data sets and analyzing data from the Internet of Things? Alarm.com, a rapidly growing, entrepreneurial technology company, is seeking a highly analytical, problem-solver to focus on the reporting needs for our sales organization. This position will be the main point of contact for the business reporting needs for our sales department, helping to prioritize and deliver reports and analysis to support this critical organization. To be successful in this role, we are seeking a highly motivated person that adapts well to change and can easily navigate multiple priorities in a matrixed organization. This role will have a huge impact on data availability through turning data into insight that will help drive business decisions. RESPONSIBILITIES In this role you will identify and answer research questions of interest to the Sales organization.  The Data Analysts primary job responsibilities will include: Interpret data, analyze results using statistical techniques and provide ongoing reports. Execute quantitative analyses that translate data into actionable insights. Provide analytical and data-driven decision-making support for key projects.Develop and automate reports, solving for the Business Intelligence (BI) and analytical needs of our full range of stakeholders. Work with stakeholders to establish the right metrics for monitoring the business.Work with stakeholder to gather functional requirements and work with engineering to help deliver data driven solutions to stakeholdersCommunicate findings on a regular basis to all levels of business and management.Filter and clean data, and review computer reports, printouts, and performance indicators to locate and correct code problemsPull and model data from internal data warehouses in order to create quantitative models of business trends and, where relevant, implement process improvements.REQUIREMENTSBA/BS in Computer Science, Management Information Systems, Data Science, Math, Physics, Engineering, Statistics or other technical field. Advanced degrees preferred.At 1-3 years proven working experience as a data analyst or business data analystExperience in SQL and familiarity with other programming languages. Some development experience in at least one scripting language (PHP, Python, Perl, etc.)Familiarity with business intelligence tools (MicroStrategy, Tableau, Qlik, BOBJ, Cognos) and statistical package such as R, Python, etc.Demonstrated success when working cross-functionally and is able to translate technical content to a general audience.Understanding of Data Management and the data lifecycle.Excellent written/oral communication and interpersonal skillsStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAn interest in technologyWillingness to learn new skills and tools and flexibility to accept a wide range of responsibilities in our small company, entrepreneurial environment.Highly motivated, self-starter that has ability to operate under minimal supervision, Ability to work on multiple projects simultaneously in a small, fast-paced environmentAbility to travel up to 10% of the timeWHY WORK FOR ALARM.COM?Collaborate with outstanding people: We hire only the best. Our quality standards are high and our employees enjoy working alongside other high achievers.Make an immediate impact: New employees can expect to be given responsibility for bringing new technologies to the marketplace within weeks. You are empowered to perform as soon as you join the Alarm.com team!Gain well rounded experience: Alarm.com offers a diverse and dynamic environment where you will get the chance to work directly with executives and gain a broad knowledge base across multiple areas of the business.Work with latest technologies: As we continue to lead the industry, we require expertise across a broad spectrum of technologies including short and long-range wireless communication, video surveillance, lighting and HVAC automation, web development, and backend application development and hosting.Focus on fun: Alarm.com places high value on our team culture. We even have a committee dedicated to hosting a stand-out holiday party, happy hours, and an annual corporate retreat.COMPANY INFO Alarm.com, founded in 2000, is the industry leading technology provider of interactive security solutions. Through advanced wireless monitoring, mobile and web-based services, and a proven hosted services platform, Alarm.com helps protect over one million residential and commercial customers throughout the United States, Canada and Latin America. Alarm.coms products and services are offered exclusively through a network of over 5,000 licensed and authorized Security Dealers. Alarm.coms headquarters are located in Vienna, VA. For more information, visit www.alarm.com. COMPANY BENEFITS Alarm.com offers competitive pay and benefits including a wide choice of healthcare options with generous company subsidy, a health savings account option with company contribution, 401(k) with employer match, paid holidays and paid time off increasing with tenure, paid maternity and paternity leave, company paid STD/LTD and life insurance, flexible spending accounts, and a casual dress work environment. Alarm.com is an Equal Opportunity Employer"}