{"jobID": "2828254632", "jobLocation": "Austin_TX", "jobTitle": "Big Data Software Development Engineer Intern", "companyRating": "3.7", "companyInfo": {"Website": "www.kla-tencor.com", "Headquarters": "Milpitas, CA", "Size": "5001 to 10000 employees", "Founded": " 1976", "Type": " Company - Public (KLAC) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Applied Materials, Nanometrics"}, "estimatedSalary": "81000", "jobDescription": " Company Overview  Calling the adventurers ready to join a company that's pushing the limits of nanotechnology to keep the digital revolution rolling. At KLA-Tencor, we're making technology advancements that are biggerand tinierthan the world has ever seen.  Who are we? We research, develop, and manufacture the world's most advanced inspection and measurement equipment for the semiconductor and nanoelectronics industries. We enable the digital age by pushing the boundaries of technology, creating tools capable of finding defects smaller than a wavelength of visible light. We create smarter processes so that technology leaders can manufacture high-performance chipsthe kind in that phone in your pocket, the tablet on your desk and nearly every electronic device you ownfaster and better. We're passionate about creating solutions that drive progress and help people do what wouldn't be possible without us. The future is calling. Will you answer?  Group/Division  With over 38 years of semiconductor process control experience, chipmakers around the globe rely on KLA-Tencor to ensure that their fabs ramp next-generation devices to volume production quickly and cost-effectively. Enabling the movement towards advanced chip design, KLA-Tencor's Patterning Solutions Group (PSG) is looking for the best and the brightest research scientist, software engineers, application development engineers, and senior product technology process engineers to join our 5D team.  Our 5D patterning process control technologies control the three dimensions of the device structure, while optimizing the process control loops (time) and minimizing the expense (cost) to create the device; hence five dimensional patterning process control (5D).  The team's mission is to collaborate with our customers to innovate hardware and software technologies that detect and control process variationsat their sourcerather than compensate for them at later stages of the manufacturing process. These patterning process control solutions provide the most accurate process correctables available today; providing real-time feedback and feed-forward control to improve subsequent process steps.  Why join 5D? Think of this team as a \"start-up\" company where you are offered the ultimate challenge to solve the most complex technical problems that enable the digital age. Yet, this \"start-up\" is backed by the most sophisticated and successful process control company in the semiconductor industry. Responsibilities Evaluate Non-SQL database and relational database  Develop feasibility project to evaluate the CRUD performance of databases  Third party machine learning libraries evaluation  Preferred Qualifications  Student pursuing Ph.d / Master's Level Degree or Bachelor's Level Degree Minimum Qualifications Minimal three year college study  Equal Employment Opportunity  KLA-Tencor is an Equal Opportunity Employer. Applicants will be considered for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristics protected by applicable law."}