{"jobID": "2796767106", "jobLocation": "Washington_DC", "jobTitle": "Social Sciences Writer, Science News", "companyRating": "4.0", "companyInfo": {"Website": "www.societyforscience.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1921", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "57000", "jobDescription": " Social Sciences Writer, Science NewsClear and credible science journalism is more important than ever. Science News is committed to delivering readers the latest advances from across the scientific frontiers. To do so, we have a new position for a subject-specific reporter with expertise in social and behavioral sciences. Social Sciences WriterScience News wants a nimble, experienced journalist who will help us expand our coverage of the social sciences to illuminate the modern human experience. This beat reporter will be passionate about exploring new discoveries and trends in psychology, economics, sociology, anthropology, and related fields. This beat includes research into public health, demographics, culture and communities, decision making, and critical thinking. At times, the social sciences writer may be asked to report on new advances in health and biomedicine.  This writer will be able to handle quick turnaround, breaking news as well as enterprising features for the Web and print magazine. The ideal candidate will be eager to experiment with content across platforms, collaborating with our digital team on video and interactive infographics, as well as reaching new audiences through social media. Responsibilities:Stay up-to-date on the latest developments in the social and related sciences, including basic and applied research.Identify and pitch stories on the latest advances in these subject areas.Initiate and develop source relationships with key researchers.Monitor journals and other sources for news and feature ideas.Attend and report from key conferences in your subject areas, as assigned.Identify trend stories and enterprise ideas that other news outlets aren’t covering.Establish yourself as a recognized expert in your subject area.Tell stories across multiple platforms.Oversee acquisition of or aid with the development of art, photos, video, and audio to accompany stories. All applicants must have three or more years of newswriting experience, including the ability to write clearly and concisely on deadline, and should have a strong education/proven interest and understanding in a relevant scientific field.  This is a fulltime position based in Washington, D.C., although a remote work situation will be considered. To Apply To apply send a cover letter, resumem and three writing samples to Nancy Shute at editors@sciencenews.org. Please include the name of the position in the subject line. We are accepting applications through June 24. About Science NewsScience News has been published since 1922. The daily website at www.sciencenews.org and biweekly print magazine cover important and emerging research in all fields of science. It publishes concise, accurate, timely articles that appeal to both general readers and scientists, reaching more than 120,000 subscribers and more than 1 million readers each month. Through the Science News in High Schools program, the magazine now reaches more than 4,000 public high schools around the country. About Society for Science & the Public Society for Science & the Public (Society) is a nonprofit 501(c)(3) membership organization dedicated to public engagement in scientific research and education. Our vision is to promote the understanding and appreciation of science and the vital role it plays in human advancement; to inform, educate, and inspire. We do this work through our award-winning Science News media group and world-class science competitions: the Regeneron Science Talent Search (STS), the Intel International Science and Engineering Fair (Intel ISEF), and Broadcom MASTERS (Math, Applied Science, Technology and Engineering for Rising Stars). Intel ISEF and Broadcom MASTERS begin at local, regional, state, and national fairs that affiliate with the Society to participate. This network includes more than 400 science fairs representing more than 70 countries, regions, and territories. The Society is an Equal Employment Opportunity Employer Society for Science & the Public is committed to equal employment opportunity. In order to provide equal employment and advancement opportunities to all individuals, the Society does not discriminate against employees or applicants for employment on any legally recognized basis, including but not limited to: veteran status, race, color, religion, gender, marital status, sexual orientation, gender identify or expression, ancestry, national origin, disability, personal appearance, family responsibilities, matriculation, political affiliation, age and/or any other categories protected by the laws of the United States or the District of Columbia."}