{"jobID": "2730422563", "jobLocation": "Detroit_MI", "jobTitle": "Senior Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.wayne.edu", "Headquarters": "Detroit, MI", "Size": "5001 to 10000 employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Posting Details Posting Number 043458 Position Title Senior Research Scientist Number of Vacancies 1 School/College/Division/Institutes/Centers 12 - College of Liberal Arts and Sciences Primary Department H1205-Chemistry Essential Functions (Job Duties) Develop, research, and implement new methodologies and techniques to maintain a collaborative competitive research program for researchers using the NMR and EPR Laboratory, Lumigen Instrument Center (LIC) at Wayne State University as well as train users and oversee day-to-day user needs. This approach will promote maximum research productivity in a variety of scientific disciplines.  Develop, research, and implement all operational activities of the NMR and EPR Laboratory of the LIC and train users. In concert with the Director of the LIC and NMR and EPR committee, the scientist will help establish policies, procedures, and processes to improve instrumentation and research operations within the NMR and EPR Laboratory. Currently, the NMR and EPR Laboratory includes six NMR and one EPR spectrometers. Future plans include transitioning from an Agilent NMR facility to a Bruker or JOEL NMR facility, expanding our EPR experiment capabilities, and automation of the Facility.  Train and supervise students, postdoctoral researchers, and other individuals to perform NMR and EPR experiments. Establish training using the manufacture industry-standard software for various NMR and EPR experiments. Current training classes include carbon, proton band/NOE and NOE (Gated), proton broad-band decouple and coupled (DEPT), fluorine, and phosphorous, decoupling elective excitation and proton T1 relaxation 1D, VT experiments, and homo and hetero nuclear 2D correlation experiments. Provide current best practices, professional consultation, and assistance to users, other CORE facilities, University Centers, and local industry.  Assist the LIC Director, and others, to submit proactive instrumentation proposals on a frequent and timely basis to keep the facility relevant and scientifically state-of-the-art. Assist in all aspects of proposals, including solicitation of the proposals, interviews with vendors, instrument installation, oversight of pre- and post-performance tests, facility infrastructure issues, promoting acknowledgement on manuscripts of users, and annual and grant reports.  Provide on-going expertise for trouble-shooting, maintenance, and repair for all instruments in the NMR and EPR Laboratory, including assisting in making decisions of potential service contracts, internal repairs, or decisions to bring in company service technicians to execute repairs. The scientist is also responsible for keeping the laboratory in good standing with the WSU Office of Environmental Health and Safety (OEHS) policies and laboratory-specific safety training. The scientist is to update the chemical hygiene plan as needed, review safety policies regularly, enforce NMR and EPR Laboratory personal-protection-equipment policies, and prepare responses to WSU OEHS inspections.  Assure that experiments submitted from WSU researchers and industry are performed in a timely, effective, and professional manner. Provide consultation with faculty and other colleagues in the preparation of manuscripts based on this data. Assure that instrument access to all users of the LIC is fair and equitable. Assist in promoting the LIC's capabilities to attract increased use from the University and regional scientific communities.  Serve as a resource to faculty and other staff within the University by providing information and guidance on the capabilities and appropriate use of the LIC NMR and EPR Laboratory. Assist faculty in seeking and identifying potential external grant applications. Attend appropriate professional conferences, workshops, and informational development seminars and keep abreast of current trends and practices pertaining to NMR- and EPR-relevant topics.  Perform other related duties as assigned. Unique Duties Qualifications Ph.D. in Chemistry or a related discipline.  The scientist must have extensive experience in designing experiments and maintenance of a variety of NMR and EPR instruments. Scientific expertise indicated by research publications involving NMR spectroscopy, EPR spectroscopy, or both is necessary.  Project management: Ability to manage independently a variety of projects while ensuring appropriate tracking, quality control, follow-up, and deadlines are met. Strong time management skills.  Communication skills: Ability to communicate clearly, concisely, and professionally, both orally and in writing. Strong presentation and training skills.  Computer skills: Proficient in Microsoft Office tools.  Planning and Organization Skills: Demonstrate capacity for multi-tasking, flexibility in face of changing priorities, and the ability to work independently as well as part of a team.  Prioritize and plan work activities; adapt to changing conditions, and develop strategies to achieve organizational goals. Preferred Qualifications Testing Requirements Not Applicable Test Scheduling Working Conditions Job Type Full-Time Job Category Academic Administration"}