{"jobID": "2797024543", "jobLocation": "Chicago_IL", "jobTitle": "Digital Marketing Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.boeing.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1916", "Type": " Company - Public (BA) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Lockheed Martin, Northrop Grumman, Airbus"}, "estimatedSalary": "67000", "jobDescription": " Chicago,Illinois,United States 4A34P3 The Boeing Company is currently seeking a Digital Marketing Data Analyst to join our Corporate Communications Digital team in Chicago, IL or Seattle, WA. This position will focus on transforming the way we digitally offer and market our services offerings to customers in the commercial aviation, general aviation, and government segments and will work in scrum, agile environments.  Primary ResponsibilitiesSupport key digital initiatives and projects for Corporate Communications, such as reporting for paid digital advertising, social media, email marketing, and web.Support new Boeing Global Services digital marketing / customer experience products and initiatives in data analysis, testing, metrics, and data infrastructure.Create daily and weekly reports on digital marketing tests for leadership and communicate results through email and presentations.Define key metrics and identify sources of data to create test projections.Make recommendations for tests to conduct based on performance analysis and consumer insights.Work with scrum teams to ensure necessary tagging and data infrastructure.Collect, clean, and synthesize live test data and derive user insights.Conduct ad-hoc analysis by pulling data from multiple sources including historical performance, trends, and benchmarking.Develop test performance dashboards to represent historical and live test insights for broader audiences.Work closely with different business units, organizations, and finance to define and build reports and dashboards. Boeing is the world's largest aerospace company and leading manufacturer of commercial airplanes and defense, space and security systems. We are engineers and technicians. Skilled scientists and thinkers. Bold innovators and dreamers. Join us, and you can build something better for yourself, for our customers and for the world.Basic Qualifications (Required)Bachelor's degree3+ year's using Tableau or a similar interactive business data visualization software3+ year's working with data visualization3+ year's working with digital marketing solutionsExperience using Microsoft Office Products including the use of Excel for data analysis3+ year's using Salesforce or similar CRM toolTypical Education/Experience Bachelor's and typically 6 or more years' related work experience or  Master's degree and typically 4 or more years' related work experience. Employer will not sponsor applicants for employment visa status.Yes, 10 % of the Time COMMUNICATIONS Individual Contributor  No  No  Standard  United States; The Boeing Company  Seattle;Washington;United States~Renton;Washington;United States~"}