{"jobID": "2729644511", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Intelligence, Data Architecture Analyst, Online Partnerships Group", "companyRating": null, "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": null, "jobDescription": "The Online Partnerships Group (OPG) uses our portfolio of product solutions, including AdSense and DoubleClick tools, to help online publishers grow their businesses. You'll provide innovative, industry-leading online advertising solutions for publishers and developers and proactively identify new opportunities. Some of the largest publishers on the web rely on our products and we're always trying to exceed their expectations and strengthen our long-term partner relationships. Our team helps grow Google's business with the largest online publishers and provides account management for users of AdSense, DoubleClick and more.  The Publisher Intelligence team is an Analytical Business team responsible for helping the Online Partnerships Group (OPG) make the best decisions possible using data.  As a Business Intelligence Data Architecture Analyst on the Publisher Intelligence team, you'll be responsible for acquiring, manipulating, and presenting data in multiple formats, including sophisticated dashboards and tables. You will build ETLs and data pipelines using your SQL skills that will take raw data from various data sources, and transform it into easy to use datasets for the Publisher Intelligence team and broader organization. You'll leverage this data, as well as fellow business analysts and business executives across our organization, allowing users to quickly see and accurately know how key business operations and processes are performing. You’ll also be involved from project inception to design through to delivery, ensuring solutions are delivering high-quality and relevant data so our business can grow intelligently.  Google was founded to organize the world’s information, and our Partnerships team was there from the start, connecting us with the world’s largest generators of online content. Google helps our partners find better ways to reach their audiences and manage their digital businesses. In return, our partners provide great content for our products, and they syndicate our Google products to enhance their sites. Our Partnerships team members expand and nurture these relationships by continually finding new opportunities and solving technical problems for our partners. Responsibilities Manage and develop the data infrastructure of the Online Partnerships Group.Work closely with OPG management and their teams to understand their needs and develop Business Intelligence strategy to fulfill and scale.Build ETLs and data pipelines from various data sources to transform it into easy to use datasets.Identify and acquire new datasets for OPG that will provide new Business Insights. Qualifications Minimum qualifications:"}