{"jobID": "2837826877", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.  JOB DESCRIPTION: Main Purpose of Role This will be a foundational member role in a small team of talented and highly motive data engineers, and big data architects to create big data based advanced analytical platforms and products  Main Responsibilities •Create, deploy and optimize large scale data  •Use extensive data engineering expertise to design and build solutions/ products for analyzing large data sets and identify patterns and relationships  •Manage data sources, organize data and create data assets using identified open source or proprietary tools  •Work closely with SMEs, functional experts in Commercial, R&D;, finance, etc. for building data pipeline from structure and unstructured data sources  •Work on newest tools and technologies powering these analytics wave - Scala, Scalding, Spark, Hadoop  •Deploy advanced machine learning techniques and algorithms and work in a truly Big Data way  Travel occasionally per needs of the assigned project.  Qualifications Education  Education Level  Major/Field of Study  Or  Education Level  Bachelors Degree (± 16 years)  •Bachelors degree in any of the following Math, Physics, Computer Science, Statistics, Economics, Quantitative Sciences  Experience/Background  Experience  Experience Details  Minimum 16 years  •Strong problem-solving skills  •Experience in any from AWS, Python, R, Spark, hive, HBase, Hadoop, Kafka, YARN etc. will be a plus  •Attention to detail and organization/ documentation skills  •Ability to prioritize and triage deadline-driven tasks in a high-pressure environment  •Basic knowledge of distributed computing, parallel processing and large scale data management  •Experience manipulating and analyzing complex, high-volume data from varying sources  •Ability to communicate complex quantitative analysis in a clear, precise, actionable manner  JOB FAMILY: IT Operations  DIVISION: ADD Diagnostics  LOCATION: United States > Chicago : WeWork National Building 125 S. Clark Street  ADDITIONAL LOCATIONS: WORK SHIFT: Standard  TRAVEL: No  MEDICAL SURVEILLANCE: No  SIGNIFICANT WORK ACTIVITIES: Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected : :"}