{"jobID": "2828424982", "jobLocation": "Palo_Alto_CA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.sap.com", "Headquarters": "Walldorf, Germany", "Size": "10000+ employees", "Founded": " 1972", "Type": " Company - Public (SAP) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Salesforce, Oracle, Microsoft"}, "estimatedSalary": "122000", "jobDescription": "Requisition ID: 188241 Work Area: Customer Service and Support Expected Travel: 0 - 10% Career Status: Professional Employment Type: Regular Full Time    COMPANY DESCRIPTION SAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.  SAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift up societies and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives.    PURPOSE AND OBJECTIVES The SAP Innovation Center Network is a strategic development entity within SAP, combining software engineering excellence with thought leadership and entrepreneurial spirit to create new markets for SAP. Across various focus clusters and by building on strong teams, we pioneer game-changing solutions in close collaboration with startups, customers & partners in industry and research as well as with other SAP units. To ensure a successful go-to-market, we follow an end-to-end responsibility approach. By exploring unconventional ideas and developing inspiring proofs of concepts, we push the state-of-the-art in technology and its applied fields to provide SAP with foresight into future trends.     As a Data Scientist, you will work in a team of experience experienced researchers and data scientists taking on challenges posed by the SAP customers and product units. You will have the chance to work with the richest data sets available in the world addressing real-world problems. Your primary goal will be to implement state of the art algorithms and to develop new approaches and technologies for deriving value from our customers’ real business challenge. You will have a chance to select and implement the best technologies and approaches based on your own experience, judgement, and experimentation results. This role combines (1) experience with machine learning with (2) practical knowledge of working with scalable platforms for processing of huge data sets, and (3) ability to understand the data, associated processes and business implications from different domain, (4) scaling from minimum viable product up to shippable production code.       EXPECTATIONS AND TASKSCreate data models and algorithms from huge volumes dataExplore, understand, and implement most recent algorithms and approaches for supervised and unsupervised machine learningThe candidate will be part of engineering team solving and creating algorithms, which can be further used by enterprise applicationsComfortably handle multi-terabyte data sets in scale-up and scale-out environmentsUnderstand business processes which create and consume data so as to be able to select best approaches, evaluate their performance and assess business relevanceCreate excellence both in terms of results quality and system scalability through continuous evaluation, analysis and refinement of the system implementationCommunicate the relevance of implemented systems and achieved results in a visual and consistent way   EDUCATION AND QUALIFICATIONSM.S. or Ph.D. in Computer Science, Applied Mathematics, Statistics or related fieldTrack record of developing novel learning algorithms/systemsRelevant experience in statistical modeling, machine learning, or data mining practiceExperience with Machine/Deep Learning software packages such as TensorFlow / MXNet / SparkML / R etc.Candidate should be able to work in a multi task creative environment, rapid prototype, and agile development environment.Ability to visualize data and present core insights in a clear and compelling wayExcellent communication, relationship skills and a strong team playerAble to work onsite in Palo Alto, CAAble to travel on customer site   Preferred QualificationsExperience with big data techniques (such as Hadoop, Spark)Hands on experience with deep learning with areas of computer vision, natural language processing techniques etc.   WHAT YOU GET FROM US Success is what you make it. At SAP, we help you make it your own.  A career at SAP can open many doors for you. If you’re searching for a company that’s dedicated to your ideas and individual growth, recognizes you for your unique contributions, fills you with a strong sense of purpose, and provides a fun, flexible and inclusive work environment – apply now. SAP'S DIVERSITY COMMITMENT To harness the power of innovation, SAP invests in the development of its diverse employees. We aspire to leverage the qualities and appreciate the unique competencies that each person brings to the company.  SAP is committed to the principles of Equal Employment Opportunity and to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team. (Americas:Careers.NorthAmerica@sap.com or Careers.LatinAmerica@sap.com, APJ: Careers.APJ@sap.com, EMEA: Careers@sap.com). Requests for reasonable accommodation will be considered on a case-by-case basis. Successful candidates might be required to undergo a background verification with an external vendor. EOE AA M/F/Vet/Disability: Qualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, gender, sexual orientation, gender identity, protected veteran status or disability.  Successful candidates might be required to undergo a background verification with an external vendor. Additional Locations:"}