{"jobID": "2599351056", "jobLocation": "Romulus_MI", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.expeditors.com", "Headquarters": "Seattle, WA", "Size": "10000+ employees", "Founded": " 1979", "Type": " Company - Public (EXPD) ", "Industry": " Transportation & Logistics", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " C.H. Robinson, Kühne + Nagel, Deutsche Post DHL"}, "estimatedSalary": "50000", "jobDescription": " Data Analyst 11101 Metro Airport Center Dr, Romulus, MI 48174, USAFull-timeCompany DescriptionGlobal supply chain management is what we do, but at the heart of Expeditors you will find professionalism, leadership, and a friendly environment, all of which foster an innovative, customer service-based approach to logistics. 16,000 trained professionals250+ locations worldwideFortune 500Globally unified systemsJob DescriptionEnterprise Data & Analytics is responsible for providing Districts and Customers with exceptional data analytics support for planning, root cause analysis and process improvement activities that accelerate Expeditors’ business. The Data Analyst position is a broad-spectrum analytics role responsible for leveraging all available data and has a wide range of responsibilities including the collection, cleansing, analysis, reporting, interpretation and presentation of data. Data Analysts have the ability to develop end-to-end data solutions.  Key Responsibilities:﻿ Scope, plan, develop and deploy impactful data-driven solutions for our Districts and CustomersAdhere to a defined analytics development procedure and fully document solutionsParticipate in project requirements gathering and solution designComplete projects on-time and provide frequent progress updates to project stakeholdersPrepare, cleanse and augment data in preparation for analysis and usageDevelop meaningful and intuitive reports, summaries and dashboardsProvide support for data and reporting infrastructure such as scheduling and accessLeverage advanced analytics tools and techniques to extracts insights from dataShare solutions and collaborate with other analysts in the networkManage projects, tasks, time and timelines within our standard project management toolsProvide ongoing training to Districts on available reporting and self-service analytics toolsCross-train team members on new tools and analytics proceduresSupport our District as a subject matter expert on our data, tools and environmentsEnsure solutions are built to scale and use enterprise approved technologies Qualificationsminimum 3-5 years or related experienceBachelor degree or higher in the area of information systems or analyticsAdvanced proficiency in Microsoft Excel (formulas and pivot tables)Advanced proficiency in various analytics tools (i.e.; Microsoft Excel, SAS, R, Python, SQL)Advanced proficiency in various business intelligence platforms (i.e.; Inetsoft, PowerBI, Oracle BI)Ability to clearly communicate and present to small and large groups Additional InformationSuccessful candidate must pass the company's defined background check.  All your information will be kept confidential according to EEO guidelines. Videos To Watch  Job LocationI'm interested"}