{"jobID": "2835260778", "jobLocation": "Burbank_CA", "jobTitle": "Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "JOB SUMMARY Highly organized and motivated individual with excellent communication skills needed to support Sales Planning team and provide critical information for the sales and distribution efforts. KEY RESPONSIBILITIES o Analyze product availability to rapidly resolve distribution and music rights queries, enabling groups optimize revenue potential and develop new opportunities for exploitation  o Systems entry of material deal points for license. Accountable for the consistency and integrity of product and sales data in database systems.  o Proactively update and maintain sales and product information summaries and schedules.  o Manage a comprehensive list of restricted features/series and provide updates as corporate/departmental strategies change.  o Heavy manipulation of metadata in excel to migrate material deal points into a database.  o Draft/generate client notifications and maintain trackers for upcoming due dates.  o Manage and review play tracking data including researching close outs to allow for additional sales opportunities.  o Assist in pre/post sale activities, internal and external interaction both verbal and written with Accounting, Finance, Operations, Legal, etc.  o Perform Audit research and redact license agreements.  o Other duties as assigned. REQUIRED SKILLS & ABILITIES o Comprehensive understanding of underlying distribution rights and music rights, coupled with strong analytical skills to be able to perform analysis of exclusive vs. non-exclusive grant of rights, exclusivities, restrictions/holdbacks.  o Excellent oral and written communication skills for interaction with legal team and sales staff.  o Self-starter with ability to prioritize. Excellent time management skills.  o Ability to multi-task doing analytical, detail-oriented, high volume work, in support of multiple teams  o Excellent computer skills required - MS Office especially advanced Excel, Adobe Acrobat, Outlook, database systems. provided by Dice Accounting, Adobe, Analysis, Analyst, Analytical Skills, Database, Excel, Management, MS Office, Outlook, Research, Sales"}