{"jobID": "2678823468", "jobLocation": "San_Francisco_CA", "jobTitle": "Nurse, Case Manager", "companyRating": "3.3", "companyInfo": {"Website": "www.hospicebythebay.org", "Headquarters": "Larkspur, CA", "Size": "201 to 500 employees", "Founded": " 1975", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Pathways Home Health and Hospice, Sutter Care at Home, VITAS Healthcare"}, "estimatedSalary": "101000", "jobDescription": "Hospice by the Bay is currently seeking a registered nurse to serve as Nurse Case Manager in the San Francisco/San Mateo area. This person will be responsible for the provision of skilled nursing assessment, planning and care in order to maximize the comfort and health of patients and families. The ideal candidate will have finely tuned assessment skills and be knowledgeable about Hospice care best practices. Essential Duties & Responsibilities include(but are not limited to): Assume primary responsibility for a patient/family using the nursing process to assess, plan, implement and evaluate patient/family needs, goals and interventions.Coordinate all patient/family services and prioritization of needs with the members of the transdisciplinary team.Use a case management approach and refer to other services as needed.Coordinate the implementation of the plan of care and insure care coordination and case management for each patient.As applicable, apply specific criteria for admission and re-certification to hospice care to establish appropriate levels of care and patient’s eligibility.Education/Experience:One year experience as a professional nurse in the past three years or Bachelor’s degree in Nursing from an accredited School of Nursing.Experience in acute care/ home health and/or hospice setting preferred.Certificates, Licenses, Registrations:Current license as a registered professional nurse in the State of California.Public Health Nursing certification highly desirable.HPNA certification preferred.Current California Driver’s License and automobile insurance that meets State of California requirements, if driving a car. This full time position offers competitive pay, generous benefits and a supportive work environment and a $2500 sign on bonus.Are you a Hero?"}