{"jobID": "2836642498", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Systems Analyst III", "companyRating": "3.9", "companyInfo": {"Website": "www.ucsf.edu", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1864", "Type": " College / University", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Data Systems Analyst III  03-Jul-2018 Job Code and Payroll Title 7199 Data Systems Analyst III Job SummaryJOB OVERVIEW The Data Systems Analyst will plan, design, administer data-based systems to facilitate clinical research including but not limited to OnCore, an enterprise clinical trials management system at UCSF. Utilizing information architecture and data stewardship principles, the data systems analyst will develop reports, maintain and optimize systems to ensure integrity, data completeness, and also promote best practices including dictionary development, metadata management, and report services across. The Data Systems Analyst will work closely with a diverse team at Office Clinical Research as well as with study teams that conduct research at UCSF. OFFICE OF CLINICAL RESEARCH The Office of Clinical Research provides support to investigators and study teams initiating and conducting clinical trials. This includes maintaining a clinical trial management system (CTMS), conducting Medicare coverage analysis, developing budgets for clinical research studies, negotiating payment terms with industry and nonprofit sponsors, and providing clinical research infrastructure/services. ABOUT UCSF The University of California, San Francisco (UCSF) is a leading university dedicated to promoting health worldwide through advanced biomedical research, graduate-level education in the life sciences and health professions, and excellence in patient care. It is the only campus in the 10-campus UC system dedicated exclusively to the health sciences. Organization Campus Req Number49936BRLocation UCSF Parnassus Job Title Data Systems Analyst Appointment Type Career Percentage100%Shift Length 8 Hours Shift Days Work Days Monday - Friday, 8:00 am - 5:00 pm Required QualificationsBachelor's degree in related area and three or more years of related experience and / or equivalent experience, education/ trainingOne or more years SQL programming/report-writing development life cycle including planning, design, documentation, programming and testingOne or more years of experience working with commercial data reporting & visualization platforms (E.g. Jasper, SSRS, Crystal Reports, Tableau, QlikView, PowerBI)Demonstrated experience working with database systems such as Oracle, MS SQL Server, MySQLProficient understanding of code versioning tools such as GitThorough knowledge of data management systems, practices and standardsThorough knowledge of relevant rules and regulationsFamiliarity with testing techniques to ensure accuracy of reports, experience with code reviewsFamiliarity with data quality, stewardship, and governance conceptsFamiliarity with data model patterns in one or more common business or academic domainsFamiliarity with logical data design and data mapping or data conversionFamiliarity with data quality and governance issues and requirementsAbility to prepare data models unassistedAbility to represent relevant information in abstract modelsStrong analytical and design skills, including the ability to abstract information requirements from real-world processes to understand information flows in computer systemsAbility to represent relevant information in abstract models. Critical thinking skills and attention to detailDemonstrated ability to communicate technical information to technical and non-technical personnel at various levels in the organizationDemonstrated ability to work with others from diverse backgrounds. Demonstrated effective communication and interpersonal skills. Demonstrated service orientation skillsSelf-motivated and works independently and as part of a teamDemonstrated strong problem-solving skills. Able to learn effectively and meet deadlinesStrong organizational skillsPreferred QualificationsExperience or background working in areas of the clinical research lifecycle especially start-up activitiesBroad experience or exposure to academic medical setting including familiarity with rules and regulations such as HIPAALicense/Certification n/a Position Type Full Time Department Name Office of Clinical Research Equal Employment Opportunity The University of California San Francisco is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, protected veteran or disabled status, or genetic information. "}