{"jobID": "2783252019", "jobLocation": "KenTownshipood_MI", "jobTitle": "ASSISTANT STORE MANAGER", "companyRating": "2.9", "companyInfo": {"Website": "www.altardstate.com", "Headquarters": "Knoxville, TN", "Size": "1001 to 5000 employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "31000", "jobDescription": "Altar’d State is a rapidly growing women’s fashion brand with more than 80 boutiques throughout the country. We are a place of respite for the modern-day woman and offer a distinctive shopping experience with the latest fashion finds, the most sought after clothing and accessories and delightful home décor. At the heart of our brand is our mission to change the world. A portion of every purchase is donated to various philanthropic organizations on a local and global scale. We strive to uplift and inspire others to join our movement to stand out. for good.Primary Responsibilities/Accountability:Revenue Generation:Consistently meets or exceeds store and individual goals of Sales Per Hour (SPH), Dollars Per Transaction (DPT), Units Per Transaction (UPT), and contributes to the store’s overall goals.Store operations:Controls workflow through successful planning and delegation.Execution of task directives within designated timeframes.Completes opening/closing procedures.Adheres to loss prevention practices and is aware of and reports potential incidents, to ensure shortage control and to protect Company assets.Maintains a safe work environment and reports any potential hazards.Maintains the store’s organization, appearance, and cleanliness.Participates and assists in the preparation for the stores’ inventory.Participates in store walk-throughs with team, communicating successes/opportunities in key store areas.Communicates effectively with executive team.Recommends ideas to improve standards and processes.Reports to work as scheduled; records time worked accurately by using Altar’d State’s time and attendance system; remains flexible to the needs of the business.Technical expertise:Demonstrates a desire and ability to be a responsible learner and navigates the Altar’d State computer systems.Performs register transactions quickly and efficiently.Processes transactions accurately; able to handle cash and provide change without error.Operates phone, answering calls with an appropriate greeting. Brand integrity:Understands and can clearly articulate the Company’s brand positioning, including the uniqueness of concept, current marketing, promotional initiatives, outreach events, in-store events and ministries.Operates with the highest levels of personal integrity and business confidentiality.Represents the brand by adhering to appropriate standards of dress and grooming.Participates and attends all store meetings.Job Requirements:  Proven ability to develop employees and hold individuals accountable for performance.Ability to function as a role model, ensuring that the guest remains the top priority.Ability to organize, delegate, prioritize, meet deadlines, and follow-up on all store activities.Proven ability to respectfully challenge and motivate the team.Knowledge of visual standards and techniques, and ability to implement and substitute within company guidelines.Demonstration of strong verbal and written communication skills.Previous retail experience preferred. "}