{"jobID": "2565834373", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Manager, Consumer Data Products", "companyRating": "3.6", "companyInfo": {"Website": "www.realtor.com", "Headquarters": "Santa Clara, CA", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Zillow, Trulia, Redfin"}, "estimatedSalary": "146000", "jobDescription": "Senior Engineering Manager, Consumer Data Products We have an exciting and unique opportunity for a skilled and energetic Sr. Engineering Manager to join the realtor.coms Consumer Data Products team in our Santa Clara, CA office. Youll have the chance to work in a startup culture with the support of a large company. You will \"wear many hats planning system design, building products, and directly interacting with customers. The team has a wealth of great real estate experience. Youll be building out product capabilities that digitize the entire real estate transaction process and help bring real-time data to agents, consumers, and vendors.  In this role, your responsibilities will touch on all stages of the software engineering lifecycle: understanding customer requirements, designing the application, reviewing code, and monitoring the system for issues. There will also be an opportunity to exercise your highly developed collaboration abilities interacting with other technology teams on broader cross-organization initiatives. The ideal candidate is a generalist who enjoys challenge and variety and is familiar with a \"Lean Startup\" approach to building a business. Duties and Responsibilities:Directly supervise 4 to 8 highly talented engineersWork with our data scientists on challenging problems that involve AI / Data Science in domains such as natural language processing, image content analysis, and predictive modeling.Lead a talented team of data engineers and backend developers on processing 3rd party data feeds, clickstreams, logs and a variety of large datasets and creating compelling consumer experiences using them.Collaborate with Product Management and User Experience regarding consumer data product definition, schedule, scope, and project-related decisionsDesign, develop, deliver, and maintain features and applications that will excite and please a user base of millions of usersDevelop solutions that are high quality, scalable, reliable, and reusableWork collaboratively in an Agile/Scrum team to plan sprints, expand stories into tasks, work on removing impediments, and execute at top velocityInvestigate technologies that can be leveraged to introduce new innovations in meeting business and customer goalsProvide input into process improvement initiatives to improve quality and timeliness of deliverables with high predictabilityEducation, Skills, and Experience:Bachelors or Masters degree in Computer Science/Engineering or related field.7+ years of hands-on professional software development experience architecting, building, deploying, and maintaining apps at scale.1+ years experience with direct supervision of 5 or more software engineers in a highly demanding engineering environment.Technical lead experience leading a product team and setting day to day technical directionSuccessful track record of delivering on projects, both individually and as a leaderStrong data engineering, backend services / API development experienceExperience with server and client performance optimization for high traffic web applicationsExperience with unit test frameworks, and test automation tools is a definite asset (Preferred) Personal characteristics include: You are passionate about using data to create powerful insights that deliver engaging web experiences for our customers and will work hard to achieve this.Strong problem-solving skills and ability to clearly communicate technical concepts in simple termsPassion for learning, continuous improvement, sharing and working in a team environmentYou take pride in writing clean, quality code, but can balance this with business practicalityYou hold a point of view and arent afraid of challenging assumptions but are humble enough to recognize when you are mistaken.You are able to learn quickly and effectively apply new knowledge, demonstrating the desire to stay in touch with emerging technologiesPassion about real estate or experience with buying/selling a home is a big plus (but not required). We love real estate and it would be great if you did, too! #LI-TW1"}