{"jobID": "2702417783", "jobLocation": "Plainsboro_NJ", "jobTitle": "Associate Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.wuxiapptec.com", "Headquarters": "Shanghai, China", "Size": "10000+ employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " WuXi AppTec is a contract research organization that provides research support in all phases of drug discovery to our clients with laboratories in New Jersey that focus on development and validation of a wide array of in vitro assay protocols. We are seeking skilled and motivated scientists with substantial experience in assay development for either SAR or HTS. Self- motivated, requiring some daily supervision to participate in the processes of in vitro assay screening and high throughput screening (HTS) of a wide array of protocols for a diverse client base that includes pharmaceutical and biotechnology companies.Works on assignments with a diverse team of scientists to facilitate all aspects of performing in vitro screening and running an HTS laboratoryReceives detailed instruction on new assignments and determines next steps with guidance.Maintains research notebooks in a well-organized manner. All necessary documentation is recorded.Complies with all safety rules, practices good housekeeping, and maintains safe workplace without supervision.Regularly reviews goals and objectives with supervisor.Makes logical suggestions of likely causes of problems and independently suggests solutions.Adept in operating semi-automated liquid dispensers, plate readers, and other lab instrumentsPerforms routine calculations, tabulates, and records results. Maintains, calibrates laboratory equipment and coordinates maintenance with vendors.Assumes responsibility for technical accuracy of work.Ability to run assays based on established protocols and troubleshoot, if neededHas skills in any of the following areas:Cell culture including cell banking, cell plating, and transfectionCellular assays including measurement of second messengers, protein translocation, protein:protein interactions.Biochemical assays including enzyme inhibition and protein-protein interaction assaysFamiliarity with luminescent- and fluorescence-based technologies.Experience / Training / Education:MS degree + 0 or BS degree + 3 years of experience in biomedical field.Knowledge / Skills / Abilities:Must work well with othersEffectively communicates with others by giving and receiving feedbackPresents data clearly and conciselyParticipates actively in meetingsAble to work in a fast paced environmentKnowledge of commonly used concepts, practices, and procedures within biological R&D; laboratory settingWell organized, detail oriented, and adaptable to changesExcellent oral and written communication skillsExcellent interpersonal skillsComputer skills: knowledge of internet research, MS Word, Excel, Outlook, and PowerPoint. Ability to learn instrument and data analysis software.Good time management and multi-tasking skills in order to complete multiple projects within timelines.Ability to work in a team environmentRecords experimental procedures and results in notebookDemonstrates attention to details and concern for impact Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}