{"jobID": "2830414581", "jobLocation": "San_Francisco_CA", "jobTitle": "Search and Data Engineering Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "159000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. Search and Data Engineering ManagerLocation: San Francisco, CA (SoMa) We are seeking a highly motivated Software Development Manager to handle day-to-day management duties of a Software Engineering team developing a global-scale multi-tenant search infrastructure.  You will be responsible for creating a highly productive engineering environment both through automation and removal of barriers to your teams productivity, while also making sure your team is growing both in size and in their skill sets.  Responsibilities: Overall management and mentorship of a talented development team of both senior and junior level engineers.Participate in technical communication within the team and to other groups associated with specified projects to define system requirements and/or necessary modifications.Collaborate closely with the Product Management Team to determine appropriate feature set for each product release.Managing a feature through the entire development and release cycle, and owning the outcome.Comfort in proactively and independently driving for results in small team environments. Qualifications: Overall 8+ years of software development experience with exposure to leading the team, with preferred Major background in computer science, math, or equivalent technical disciplines.Prior experience in open source technologies.Solid leadership skills and a passion for building large scale consumer experiences; strong communication, cross-group collaboration, and interpersonal skills.Experience with agile development practices emphasizing on continuous improvement.Team management of developers building scalable applications experience is preferred.Experience in building, deploying and maintaining search engines, Elasticsearch, Solr, etc is a strong plus.Demonstrated ability to manage multiple projects; proven ability to manage, mentor and motivate teams. Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.  We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.  We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.  #LI-SA1"}