{"jobID": "2804529178", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.lendinghome.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "124000", "jobDescription": "Were LendingHome. Were on a mission to revolutionize the world of mortgages and put the power, and the keys, where they belongin your hands. We are seeking a highly analytical and innovative Data Scientist to help to build sophisticated predictive models and draw insights from large data sets and make an immediate impact on the company. The Team Our team is small, tight-knit, and very effective. Were entrepreneurial and diligent and strive to build a culture where the best idea in the room wins, not the one that comes from the most senior person. Our team members engage all dimensions of the business, from sales and marketing to capital markets and underwriting. ResponsibilitiesProcessing, cleaning and verifying integrity of dataExtracting new and innovative insights from complex and/or large datasetsWork closely with various stakeholders to understand their needs, crafting and pitching machine learning use cases to themDesign efficient data visualizations to communicate complex ideas to stakeholdersSupport ad hoc analysis requests.QualificationsB.S. or M.S. in Computer Science, Statistics, Applied Mathematics, Economics, Business, or other computationally intensive fieldsExcellent grasp of fundamentals in statistics and probabilityExpertise in SQL and proven comfort and an intellectual curiosity for working with large sets of dataProficiency in coding and software engineering concepts.Fluency in Python/R preferredExperience with basic classes of machine learning techniques and algorithms (e.g. regression, classification, boosting, clustering, time series, NLP)Familiarity with basic principles of distributed computing and/or distributed databases (Hadoop, NoSQL, etc.) is a plus.Proven ability to communicate findings clearly to both technical and non-technical audiences."}