{"jobID": "2807826579", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Engineer", "companyRating": "2.7", "companyInfo": {"Website": "www.dfsco.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2016", "Type": " Company - Public (DFIN) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " Donnelley Financial Solutions (NYSE: DFIN) provides software and services that enable clients to communicate with confidence in a complex regulatory environment. With 3,500 employees in 61 locations across 18 countries, we provide thousands of clients globally with innovative tools for content creation, management and distribution, as well as data analytics and multi-lingual translations services. Leveraging advanced technology, deep-domain expertise and 24/7 support, we deliver cost-effective solutions to meet the evolving needs of our clients. Job Description  This role, within the Data Science team, is responsible for creating Machine Learning(ML) services to help Donnelley Financial Solutions(DFS) 1) automatize traditional manual tasks to reduce the time and cost 2) extract meaningful information from large data sets. We are looking for a talented data scientist with a strong background in Machine Learning and Natural Language Processing (NLP).  About the role  As a Data Scientist in our data team, you will be responsible for building machine learning and natural language processing solutions that would be used by all DFS applications on premise and cloud-based platforms. We are looking for a self-motivated full stack data scientist who can work with a team and independently. As a Data Scientist, you will Develop ML/NLP solutions using large-scale financial dataScale up and productize models on premise and cloud-based platformWork jointly with data engineers to productize ML models Required Skills Master's degree in Computer Science, Statistics, Electrical Engineering, Mathematics, Economics, Physics, or a related scientific discipline3 + years experience in solving real-world ML problemsStrong understanding of clustering, classification and regressionStrong programming skills (preferably Python)Familiarity with NLP frameworks and libraries like NLTK, Spacy, Stanford CoreNLP, gensimFamiliarity with Data exploration using pandas, numpy, matplotlibExperience in deep learning with Tensorflow, Theano or KerasExperience using Git for version control and collaborationExperience with the Big Data ecosystem in MS Azure (Hadoop/Hive/Spark/Airflow)Experience with building and shipping ML solutions on cloud platform(Azure/AWS/GCP)Ability to work in a flexible environmentDesire to quickly learn new languages and toolsIt is the policy of Donnelley Financial Solutions to select, place and manage all its employees without discrimination based on race, color, national origin, gender, age, religion, actual or perceived disability, veteran's status, actual or perceived sexual orientation, genetic information or any other protected status.   If you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access jobs.dfsco.com as a result of your disability. You can request a reasonable accommodation by sending an email to AccommodationRequests@dfsco.com."}