{"jobID": "2729708874", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Analyst II", "companyRating": "3.1", "companyInfo": {"Website": "www.milestonepowered.com", "Headquarters": "Fremont, CA", "Size": "501 to 1000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " World Wide Technology, Accenture, Taos"}, "estimatedSalary": "78000", "jobDescription": "The Global Security Systems & Technology team both programs and commissions Facebook’s security systems, implements best-in-class technology, and partners with other teams within Facebook to enhance the security systems experience while keeping people and assets safe.  As a Security Data Analyst, you will design and develop creative and innovative analytics and data visualizations that will help the Global Security team make data-driven decisions. The Data Analyst will partner with Informatics Developer to develop core data sets that empower security operational analyses. Additionally, the analyst will help analyze, visualize, and provide analytics on data to build reporting solutions to support various Global Security initiatives.Drive data accuracy and consistency across teams by identifying gaps and issues in data sources and dashboards. Organize project charters, scorecards, and other documentation for the overall roadmap.Generate monthly reporting and ad hoc analysis to support leadership decision-making.Drive data annalistic projects from initial ask, score definition, testing, development, deployment, and support. Gather and document requirements from cross-functional teams and projects and align on visualization expectations. Coordinate data analytics requests from business partners and IT.Data mining of multiple audit and compliance findings to generate standardized corrective action and management of vendor tool. Analyze data for corrective action, create and manage tasks through completion.Ability to extrapolate data from multiple sources of information, and understand its value.Track metrics on multiple discipline levels within the team.Create platform(s) and tools for the Global Security organization to leverage.Continually improve and automate our methods for parsing data and incorporating it into real-time models, analysis, and actions.Write queries, perform ad hoc data analysis, and create data visualizations to keep the nerve center of our operations engine running at full speed. Proactively develop new KPIs/metrics to identify trends in all the regions we operate.Build best practices of marrying financial and operational data. Data sources include Excel, SQL, internal forecasting and planning tools.Build dashboards and visualizations of complex data sets and calculations.2+ years of experience managing, analyzing and reporting on large datasets preferred.Strong communication skills and attention to detail; accuracy is a must!Working SQL experience required.Excel fluency - you may have moved on from spreadsheets as your primary tool for data analysis, or maybe it was never your primary tool but in this role, you'll need to interface with people whose primary tools are Excel. Working Tableau experience for developing data visuals.Balance attention to detail with swift execution - we need to do things quickly, and we need to do them well. Balancing those can be challenging, and this should be a strength.Team player - this is a highly collaborative and supportive team environment.Self-starter - we don't have time or desire to micro-manage. You will take initiative, be proactive, set and drive toward goals.Excellent communication and people skills - numbers are key, but a business is built with people. Relationship building and adept communication are assets in our fast-moving environment.Preferred but not required development experience in at least one scripting language (R or Python preferred).Bachelor's in Computer Science, Statistics, Math, Engineering, Business, and 2+ years of work experience in the field."}