{"jobID": "2822103341", "jobLocation": "Hoboken_NJ", "jobTitle": "Sr. Manager, Data Science Forecasting", "companyRating": null, "companyInfo": {"Website": "www.newellbrands.com", "Headquarters": "Hoboken, NJ", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (NWL) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Position Title: Senior Manager, Data Science Forecasting  Location: Hoboken, NJ  Reports to: Director, Data Science Job Summary: The Senior Manager, Data Science Forecasting will play an integral role in helping the company achieve its ambition by ensuring that Newell Brands is leveraging scientific methods and analytics to drive Supply Chain Improvements. Reporting to the Lead Data Scientist within the Supply Chain Transformation Office. The role will be highly visible with impact across all Newell Divisions. Key Responsibilities:Develop and implement forecast algorithms leveraging time series and machine learning methods to improve forecast accuracy for Demand Planning and Financial Planning.Develop and implement diagnostic tools for use by business users to identify performance oppourtunities and root cause for action planningDevelop and implement optimization programs to improve planning outputs for manufacturing and distribution operationsKey Qualifications:MS in Statistics, Operations Research, or Engineering5 years experience developing and applying statistical and operations research techniques within a business environmentAbility to communicate complex technical concepts to business partners in Supply Chain and Finance communities.Advanced statistical forecasting skills in a practical environmentAdvanced experience in writing forecasting models in open source languages (R/Python)Experience dealing with issues commonly encountered when developing high quality models [robust out of sample evaluation, overfitting, robust and efficient hyperparameter estimation, feature engineering etc.]Experience with cloud infrastructure [Azure/AWS/Google]Exeperience in demand forecasting packages like APO, JDA, and SAS.Strong written and verbal communication skillsInterpersonally savvyAbility to work with and connect with all levels of employeesStrong planning & organizing skillsInitiative & follow-up, including a strong sense of autonomyStrong Character ability to champion the right decision in difficult situationsDemonstrated ability to handle multiple tasks and assignments simultaneously Newell Brands (NYSE: NWL) is a leading global consumer goods company with a strong portfolio of well-known brands, including Paper Mate, Sharpie, Dymo, EXPO, Parker, Elmers, Coleman, Jostens, Marmot, Rawlings, Oster, Sunbeam, FoodSaver, Mr. Coffee, Rubbermaid Commercial Products, Graco, Baby Jogger, NUK, Calphalon, Rubbermaid, Contigo, First Alert, Waddington and Yankee Candle. For hundreds of millions of consumers, Newell Brands makes life better every day, where they live, learn, work and play. Newell Brands and its subsidiaries are Equal Opportunity Employers and comply with applicable employment laws. EOE/M/F/Vet/Disabled are encouraged to apply.SDL2017"}