{"jobID": "2831499012", "jobLocation": "Los_Angeles_CA", "jobTitle": "Audience Data Analyst (PlayStation Vue)", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "91000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. Audience Data Analyst (PlayStation Vue)Los Angeles, CA The Audience Data Analyst is an integral part of the PlayStation Vue team. This position works with the extensive data available to Playstation Vue to ensure customer messaging and treatment is targeted in a high impact way. He/She will work cross-functionally with analytics and other partner teams. A good candidate will be able to use their extensive knowledge of SQL to execute both routine and time-sensitive data pulls from analytics databases to ensure messaging finds the right target. Ideal candidate will possess experience covering trigger-marketing, email campaigns, audience segmenting and advertisitng. ResponsibilitiesPartner with Customer Strategy Manager to understand the messaging requirements for upcoming initiativesProvide reliable estimates for lead time necessary to develop and execute against functional requirementsTranslate functional requirements into SQL and execute to pull lists for messaging campaignsWork collaboritavely to establish a stable, repeatable process for working within a cross-functional team to deliver manual user lists and actionable insightsAct as a backup to Analytics partners to perform more complex data pulls based on ad-hoc requests as necessaryWorks closely with cross-functional teams: Content Strategy, Legal, Marketing (CRM), Product, and financial planning to deliver ad-hoc analysisServe as POC to partner with Ops & CS teams to review service issues, pull customer segments and customer make good programsWork with Dev Ops and BIS teams to streamline reporiting and automation where possible once business requirnments have been determinedOpportunity to expand responsibilities as internal capabilities develop to help define advertising segments, and to provide input on automated tools for trigger messagingQualifications3-4 years experienceBachelors degree requiredExperience in the MVPD or vMVPD space, or within TV | Studio | Entertainment Industry preferredExpert in SQL and Excel requiredProficiency in Adobe Omniture and Audience Manager, Conviva, Microstrategy, Kibana, Splunk and other analytics tools preferredAbility to translate complex requirements for the delineation of distinct customer groups into executable SQL which can return lists of users to send tailored messagingOwner mentality and an entrepreneurial drive; proven ability to think big and influence othersSelf-starter with a bias for action; can make things happen in a fast-paced, dynamic environmentStrong verbal and written communication skills across all levels of the organizationHigh attention to detail and ability to manage multiple, competing priorities simultaneouslyEnjoy getting your hands dirty in day-to-day tasks and working in ambiguous environmentsOccasional travel to other office locations may be necessaryWill report to Vue Custom Strategy and Operations Teams Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, gender identity, marital status, genetic information or membership in any other legally protected category.  We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.  We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation."}