{"jobID": "2810087440", "jobLocation": "Houston_TX", "jobTitle": "Data Engineering Director", "companyRating": "3.1", "companyInfo": {"Website": "www.wolterskluwer.com", "Headquarters": "Alphen aan den Rijn, Netherlands", "Size": "10000+ employees", "Founded": " 1836", "Type": " Company - Public (WKL) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thomson Reuters, Pearson"}, "estimatedSalary": "126000", "jobDescription": " Governance, Risk & Compliance (GRC) is a division of Wolters Kluwer that provides a broad spectrum of solutions, services and expertise to legal, finance, risk and compliance professionals and small business owners to help manage myriad governance, risk and compliance challenges in dynamic markets and regulatory environments, globally. GRC Solutions serves more than 350,000 customers in more than 150 countries, including 70% of Fortune 500 companies, 92% of the world's top banks, 90% of the Am Law 100 and more than 300,000 small businesses. The division has a global footprint, with workforce in 28 countries. Our clients include corporate legal departments, insurers, small businesses, financial services companies, brand professionals, underwriters, governments and compliance and risk professionals. Responsibilities:Drive Artificial Intelligence (AI) and Machine Learning (ML) based solutions to solve the unmet needs of our customers in the legal marketplaceTake on challenges of unknown dimensions and work together with marketing and professional services team, as well as Enterprise Legal Management (ELM) customersAcquire, develop and empower highly talented, passionate, results-driven leaders and specialists to lead and inspire our data engineering teamsLead and inspire teams of Data Architects, Data Scientists, Data Engineers, and Software Developers to deliver highly available, scalable, and reliable data solutionsConduct performance appraisals and provide coaching/mentoring to direct reports.Direct and oversee the design and development of systems used for managing data such as data warehouses, data stores, and other business intelligence systemsProvide proactive technical guidance helping to ensure the team is fostering re-use, design for scale, stability, and operational efficiency of solutionsFoster a \"DevOps\" culture to help ensure that applications can be built, tested, deployed and monitored in an efficient and automated mannerAssess various machine learning frameworks and packagesMonitor trends in AI to influence the solutions within Wolters Kluwer ELM SolutionsQualifications:A minimum of ten years of experience leveraging data and technology to deliver enterprise scale solutions that are scalable, secure, resilient and easy to use; preferably within the legal or financial industryAt least seven years of experience leading, inspiring and growing a team of software and/or data engineersBachelor's degree from an accredited college or university; Master's degree from an accredited college or university with an emphasis in data science, architecture/modeling or database design preferredDeep technical experience with transactional data technologies in a highly available, scalable enterprise environment, as well as experience with agile development methodologies and processesStrong implementation experience and deep subject matter expertise in data architecture, data quality, data governance and analyticsAbility to recommend EDM process, governance, organizational and platform models, tool selections and integration optionsAbility to apply conceptual strategy, facilitate brainstorming, and direct day-to-day execution of projects through to completion with proven experience creating strategies that are executable through creative expressionAbility to travel up to 25% both domestically and internationally Wolters Kluwer N.V. (AEX: WKL) is a global leader in information services and solutions for professionals in the health, tax and accounting, risk and compliance, finance and legal sectors. We help our customers make critical decisions every day by providing expert solutions that combine deep domain knowledge with specialized technology and services.  Wolters Kluwer reported 2017 annual revenues of 4.4billion. The company, headquartered in Alphen aan den Rijn, the Netherlands, serves customers in over 180 countries, maintains operations in over 40 countries and employs 19,000 people worldwide. Wolters Kluwer shares are listed on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices.  For more information about our solutions and organization, visit www.wolterskluwer.com, follow us on Twitter, Facebook, LinkedIn, and YouTube.  Equal Employment Opportunity  Wolters Kluwer U. S. Corporation and all of its subsidiaries, divisions and cSDL2017"}