{"jobID": "2802013535", "jobLocation": "Chicago_IL", "jobTitle": "Associate Scientist/Scientist, Cancer Biology, Oncology Cell Line Biorepository", "companyRating": null, "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": null, "jobDescription": "The Oncology Discovery group has an opportunity available for a highly motivated, organized and skilled Scientist I/II cell biologist to conduct daily activities in our Oncology Cell Line Biorepository. This position will make substantial contributions to the progression of oncology drug discovery programs in a highly collaborative environment. The candidate must be willing to work as part of a multidisciplinary research team under the mentorship of a supervisor. Key Responsibilities The successful candidate will be a member of a cancer biology team focused on delivering high quality drug development candidates for promising novel therapeutic targets. The candidate will be responsible for managing the daily activities to operate and maintain the Oncology Cell Line Biorepository. This includes acquisition, maintenance and propagation of human tumor cell cultures in support of the Discovery Biology Teams. A key responsibility will be the cryopreservation and organization of stocks, the organization of inventory and maintenance of inventory database. The candidate is also expected to work closely with other scientists in the group to implement and perform cellular assays including compound screening, data acquisition and analysis, and report generation.  The successful candidate will be expected to rapidly learn the daily operation of the lab, readily adapt to changing project needs, independently plan and execute projects, and develop sophisticated problem-solving skills. The candidate is expected be an active contributor in group discussions on results interpretation and biology activity direction. Excellent teamwork and communication skills and adherence to good laboratory conduct, documentation practices and safety guidelines are essential. Position will be hired based on level of education and experiencePosition will be hired based on level of experience.Basic: · MS degree in biology or a BS degree in biology with 3+ yrs laboratory experience. Cancer biology and/or drug discovery experience a plus. Solid understanding of cellular biology. · Understanding and experience with mammalian cell culture essential.  · Fluency with general biology lab procedures such as those described above.  · Ability to interpret and document results, prepare reports, and present information to colleagues.  · Ability to independently conduct and interpret experiments and effectively function in a goal-oriented team environment.  · Detail oriented and highly organized.  Preferred:Previous experience in small molecule drug discovery, either in academic or industrial settingExperience in collaborative teamwork in a matrix environment. · Detailed working knowledge of the molecular approaches routinely applied to cellular biology studies (FACS, ELISA, Western blotting, cloning, cellular phenotyping, etc).  · Working knowledge of instrumentation and automation. Key Leadership Competencies:Builds strong relationships with peers and cross functionally with partners outside of team to enable higher performanceLearns fast, grasps the 'essence' and can change the course quickly where indicatedRaises the bar and is never satisfied with the status quoCreates a learning environment, open to suggestions and experimentation for improvementEmbraces the ideas of others, nurtures innovation and manages innovation to reality"}