{"jobID": "2739161610", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Engineer", "companyRating": "4.2", "companyInfo": {"Website": "www.plangrid.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Procore Technologies, Bluebeam, FieldLens"}, "estimatedSalary": "136000", "jobDescription": "About the Role:PlanGrid is looking for a data engineer to grow our analytics infrastructure. Data at PlanGrid is relied upon for decision-making and reporting by major teams in the company: Product, Sales, Marketing, and Finance. It is the data team's job to ensure that the data is always fresh and available.As a data engineer, you will help scale the data team's infrastructure as well as improve its fault tolerance, working on projects such as:Writing tooling to enable real-time monitoring of our data dependency graph, illustrating active nodes, stale ones, and their respective sources.Extending our in-house SQL-table dependency graph build tool.Migrating our existing data warehouse to an architecture that flexibly scales computation resources under loadCreation of an independent code, pipeline, and storage path for testing purposesRefactoring our existing pipeline code to use better abstractionsPlanGrid is on a mission to build the future faster by creating beautiful software for construction, one of the oldest an largest industries on the planet. Were changing that by building tools that automate the mundane tasks around collaboration, planning and version control (think version control for blueprints). Our users are building some of the most amazing construction projects in the world, and our platform is their central information point.About You: You enjoy working in a team; collaboration and learning are acts that you embrace.You have at least two years of engineering experienceYou are fluent in Python and SQLYou have experience with SQL databases/warehousesYou love building robust systemsPerks:Located in San Franciscos Mission District just one block from BART, among local shops, bars, and restaurantsFlexible vacationDog-friendly officeClipper Cards (for public transportation) funded by PlanGridConstruction site tours of the biggest projects in San Francisco using PlanGridVolunteer time off: We encourage employees to give back to our local communities. We organize volunteer days and have worked with organizations such as Glide, SF/Marin Food Bank, Muttville, Family Dog Rescue, and Bryant Elementary School (as part of PlanGrids commitment with Circle the Schools).Catered lunchesPremium medical, dental, and vision coverage for full-time employees and their dependents401kEquityOffice is wheelchair accessibleWe provide paid parental leave for both parentsPlanGrid is the leader in construction productivity software. Used on more than 1 million projects around the world, PlanGrid's value extends over numerous phases of construction, building a massive and accurate history of every jobsite through everyday use that creates a data-rich record set at turnover that is essential to long-term operations.PlanGrid is the first construction productivity software that allows contractors and owners in commercial, heavy civil, and other industries to collaborate easily from their mobile devices and desktop. PlanGrid is used in more than 79 countries by thousands of customers including DPR, Granite, NVIDIA, Target Corporation, and Tutor Perini. PlanGrid was a member of Y Combinators 2012 Winter Class, and has secured over $69 million in funding from Sequoia, Tenaya Capital Founders Fund, GV, 500 Startups, Box, Northgate, and Spectrum 28.For more information, please visit: https://www.plangrid.com/.PlanGrid is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran or disabled status, or genetic informationAs part of GDPR compliance procedures, we have posted our Recruiting Privacy Notice on our website."}