{"jobID": "2318184564", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.h-gac.com", "Headquarters": "Houston, TX", "Size": "51 to 200 employees", "Founded": " 1966", "Type": " Government", "Industry": " Government", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "58000", "jobDescription": "Job Title: Data AnalystJob ID: CE14014Full/Part Time: Full TimeRegular/Temporary: RegularSalary: $47,476.00-$61,447.00 H-GAC Overview Serving more than 6 million people in our region, the Houston Galveston Area Council is the cornerstone to address issues that cross city limits and county lines every day. HGAC is made up of 13 county governments, 107 cities, and 11 school districts. HGAC prides itself in serving as an instrument of local government cooperation, promoting the region’s orderly development and the safety and welfare of its citizens. Opportunity H-GAC’s Community & Environmental Socio-Economic team has an exciting opportunity for a Data Analyst. H-GAC’s Socio-Economic Modeling program produces a regional growth forecast, an essential tool used by local governments in transportation and other long-range planning. The program conducts the ongoing collection and analysis of employment, population, and land use data, and provides tools for local governments to access US Census Data.  In this role you will be responsible for developing and managing regional growth forecasting models with large data sets from various sources. The Data Analyst will provide complex analytical support and serve as a point of contact for internal and external requests for data. Quality control to ensure the accuracy and integrity of data and providing innovative solutions to improve forecasting efforts is an integral part of this job. Strong experience reading and writing SAS code for data processing and management is crucial for success in this role.  Senior level position available for those that possess additional experience and education. Requirements The successful candidate will have at a minimum:  Bachelor’s degree in Economics, Sociology, Planning, Statistics or a related field of study. Three (3)-Five (5) years of experience in data frames, data set designs, maintaining large volumes of data, producing forecasting models and reporting. Master’s thesis, doctoral dissertation or research work relevant to this position may substitute for some work experience. Experience in reading and writing SAS code for data processing and management. Strong background in demographic and economic theory and models. Exposure and understanding of various theories, principles and presentation techniques.Preferred qualifications include: Five (5)-Eight (8) years of experience in a previous data analytics role. Strong hands on experience in BASE SAS, SAS SQL, and SAS MACRO. Proven experience with population, employment and land use forecast modeling.Apply online via:https://h-gac.com/careers H-GAC is an equal opportunity/AA employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, or protected veteran status."}