{"jobID": "2823481990", "jobLocation": "Springfield_VA", "jobTitle": "Image Scientist", "companyRating": null, "companyInfo": {"Website": "www.integrity-apps.com", "Headquarters": "Chantilly, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TASC, Vencore, Booz Allen Hamilton"}, "estimatedSalary": null, "jobDescription": "Integrity Applications Incorporated (IAI) is a software and system engineering company headquartered in Chantilly, Virginia with offices Nationwide. IAI has been selected as one of the best companies to work for in America by The Great Place to Work Institute and as one of the top employers in the DC Metro area by the Washingtonian Magazine. We are always looking for bright, innovative and talented people to join our team of highly skilled professionals. IAI offers challenging work, competitive salaries, an incentive bonus program and top notch health and welfare benefits for you and your family.  This person will be responsible for research and engineering activities related to advanced modeling and processing of geospatial data. These individuals will work with a skilled team of scientists and engineers to implement and test new algorithms and techniques for improving the quality, utility and availability of various geospatial data products. As an image scientist with IAI you will work with fellow researchers to develop remote sensing analysis techniques, validate new methods, and produce deliverable reports to government customers. The image scientist will provide scientific analysis support to colleagues who will leverage results to provide the best possible intelligence to our customers. Formal and informal reporting will be necessary to capture plans, schedules, status updates, and results. Qualifications:Minimum 5-10 years of experience desired in the geospatial or related technologiesA Bachelor's Degree in engineering, science, or mathematics; e.g., electrical and computer engineering, aeronautics and astronautics engineering, geomatics engineering (photogrammetry and remote sensing), physics or related fieldAdvanced degree preferredMust be knowledgeable of current technologies related to imagery, remote sensing, geospatial data, advanced processing techniques and share a vision for testing and improving them into the future.Excellent organizational skillsExperience in project planning, design, development, and evaluation for geospatial projects preferredStrong conceptual, analytical and problem solving skills with the ability to work as an effective member of a teamProven analytical and problem solving abilitiesExperience with photogrammetry a plus.Security Requirements: TS/SCI security clearance required. Must be willing to sit for a CI poly. Integrity Applications Incorporated is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or any other factor protected by law."}