{"jobID": "2831920799", "jobLocation": "Ne_Jersey", "jobTitle": "Data Analyst / Developer", "companyRating": null, "companyInfo": {"Website": "www.newyorklife.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1845", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Analyst / Developer  Date: Jun 24, 2018  Location: Jersey City, NJ, US  Company: New York Life Insurance Co  Apply now  Start apply with LinkedIn  Start apply with Facebook  Apply Now  EmailStart  Please wait...  New York Life Investments (NYLIM), an indirect, wholly owned subsidiary of New York Life Insurance Company, is a top 25 global asset management firm. With more than $500 billion in assets under management, NYLIM is a premier investment management firm serving a variety of client segments including retail, institutional, insurance and defined contribution and benefit on a global basis. New York Life Investments offers a diverse set of investment capabilities ranging from traditional equity and fixed income to alternative investment strategies and multi-asset solutions. Renowned for its premier investment acumen and client focus, NYLIM's vision is to be one of the most trusted providers of investment management expertise and long-term financial security. Job Description The Data Analyst/Developer will provide data and technical support for ICG to assess and monitor many investment strategies including equity, fixed income, as well as alternative investments. Responsibilities Automate data flow and reconcile data used in several portfolio analytics systems  Implement and manage new reports for various users in the firm using different development tools  Working with technology group to ensure accurate and timely data delivery  Provide support for existing code base and contribute to enhance the processes  Provide support for daily reports process  Key Attributes  Some financial product knowledge  Attention to detail  Strong time management skills  Ability to work both independently as well as a team on multiple time-sensitive projects Requirements At least 2- 4 plus years of experience  Bachelor's degree is required (Master's degree preferred) and course work in Finance, Mathematics, Engineering or Computer Science is preferred  Hands-on experience with one or more programming languages preferred (e.g. Python, C#, C, C++, JAVA, VBA, etc.)  Hands-on experience supporting one or more performance and risk based platforms preferred (e.g. Bloomberg, FactSet, POINT, Aladdin, etc.)  Business Intelligence tool experience preferred (e.g. Tableau, QlikView, Spotfire, Power BI, etc.)  Database Experience preferred (e.g. MS SQL, My SQL, Oracle, Hadoop, etc.) SF:LI-KV1EOE M/F/D/V If you have difficulty using or interacting with any portions of this Web site due to incompatibility with an Assistive Technology, if you need the information in an alternative format, or if you have suggestions on how we can make this site more accessible, please contact us at: **************. Based on revenue as reported by Fortune 500, Ranked within Industries, Insurance: Life, Health (Mutual), Fortune Magazine, June 15, 2015. See *********************************** for methodology.Operating earnings is the key measure use by management to track Company's profitability from ongoing operations and underlying profitability of the business. This indicator is based on generally accepted accounting principles in the US(GAAP), with certain adjustments Company believes to be appropriate as a measurement approach ( non GAAP), primarily the removal of gains or losses on investments and related adjustments.Assets under management represent Consolidated Domestic and International insurance Company Statutory assets (cash and invested assets and separate account assets) and third party assets principally managed by New York Life Investment management Holdings LLC, a wholly owned subsidiary of New York Life Insurance Company. Nearest Major Market: New York City  Nearest Secondary Market: Newark  Job Segment: Database, Equity, Accounting, Oracle, Engineer, Technology, Finance, Engineering  Apply now  Start apply with LinkedIn  Start apply with Facebook  Apply Now  EmailStart  Please wait..."}