{"jobID": "2261907631", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.helloinnovation.com", "Headquarters": "Detroit, MI", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "OVERVIEW Join the Revolution. Work with a company thats changing the world. Hello Innovation owns and operates a strong set of businesses powered by innovation and change. We are disruptive by design. We love solving the worlds toughest business challenges. Its in our DNA to change the world and improve lives through our portfolio of companies.  Theres no shame in being ambitious at Hello Innovation; career growth is a priority for us we help one another climb, we dont climb over one another. A team-driven environment and high levels of integrity serve as incubators for brilliant minds.  Intrigued? Perfect. Were hiring like crazy and are looking for driven, forward-thinking problem solvers to join our team. JOB SUMMARY Does swimming through a lake of data and riding a tsunami sized wave of information sound like a fun afternoon to you? Do you have the burning desire to turn unstructured data into information and knowledge? Does semantic analysis keep you up at night? If so, youve come to the right place!  Were looking for a passionate, hyper-focused data scientist who can do whatever it takes to sort through a tsunami of data, text, and content to calm the waters of our ocean of data and information. A quick background on us: While we may have just gotten started 15 years ago, our products have grown quickly to touch 35 million people a month and were still growing faster than ever. But in the middle of that quick growth, our data and content became scattered. Long story short, were looking for a data scientist to spot patterns and mine for the gold in our data and structure the chaos once and for all.  This position requires someone experienced in data and/or text analysis who is comfortable with large sets of content, and can quickly break down our unstructured data into easy to understand reports and information. This role requires someone who is used to working in a fast-paced and dynamic environment, and has an entrepreneurial spirit of building things. With this role, you have the opportunity to be at the center of our revolution and to help shape our future as you help make sense of the chaos.  However, this position isnt for everyone We give people the opportunity to do more, but well also challenge you more than ever. If youre not obsessed with understanding big picture organizational schemes, turning data into knowledge to fuel growth, and creating clear and easy to understand reports, this may not be the role for you. EXPERIENCE GUIDELINESYou must have expert-level knowledge in enterprise data mining, data science, text analysis, and organizing.You should possess a deep understanding of the statistical and machine learning methods as well as semantic web technologies, i.e. RDF, OWL and related methods.Ability to simultaneously be working in multiple systems, formats, and content structuresYou must have experience in bringing structure and clarity to data, allowing our team to create amazing sh*t faster by leveraging the content weve already createdYou must have a solid understanding of organizational structure and experience in semantic analysisExperience in relevant semantic analysis, data and/or text mining tools is also a necessityYou must be a great communicator and clarity focused. Someone who can see it, get it, and communicate it wellYou must be able to provide an online portfolio, email templates, or other work samples demonstrating relevant experienceBENEFITS & PERKSGreat Benefits Our full coverage benefits package is available to all employees and includes health, dental and 401(k).Generous Paid Time Off 15 paid days off to start PLUS additional breaks including 9 paid holidays, a Parental Leave Program, and more!Lunch and Snacks Our kitchen is loaded with snacks, pop, wine & beer, and if you need a caffeine boost weve got you covered with our coffee bar!Conferences Knowledge is power, which is why we encourage all employees to check out the latest industry happenings. Well cover the cost!Plus much more Flexible working hours, monthly tech talks and weekly fitness classes, to name a few.OFFICE LOCATION Detroit, Michigan - in the heart of Greektown!"}