{"jobID": "2793825601", "jobLocation": "Princeton_NJ", "jobTitle": "Scientist, Medical Affairs Operations", "companyRating": null, "companyInfo": {"Website": "www.taihooncology.com", "Headquarters": "Princeton, NJ", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Taiho Oncology, Inc. works urgently to discover and develop innovative cancer treatments. As cancer evolves, we evolve with it—bringing novel technology to cornerstone chemotherapies, while at the same time optimizing new targeted agents. Advanced technology, dedicated investigators, and incomparable facilities—these vast resources empower us to redefine the way the world treats cancer. It’s our work; it’s our passion; it’s our legacy. This position will support Medical Affairs Investigator Initiated Trials (IIT) and Independent Medical Education (IME/CME). In this role, the Specialist, Medical Affairs will support the Director, Medical Information, Sr. National Director, MSLs, and Medical Affairs Project Management. The incumbent will be primarily responsible for (a) preparing, hosting, and documenting IIT meetings and (b) coordination of IITs from start-up to study closure. The incumbent will also work cross-functionally to (a) revise/update IIT Standard Operating Procedures (SOPs), (b) optimize IIT systems for intake, review, and benchmarking, (c) prepare, conduct, and document IME/CME Grant Committee meetings, and (d) other Medical Affairs projects as needed. Serve as the point person for IITs:Work with Medical Affairs, Information Technology, and Compliance to modify Request Management System to align with IIT review and approval processMaintain and update Taiho IIT data base, including enrollment, budget, and milestone paymentsPrepare, facilitate, and document outcomes from the IIT review committee, including, but limited to, collaboration with Pharmacovigilance, Regulatory, Quality Assurance to ensure all applicable internal SOPs and guidances are adhered toLiaison with Alliance Partners to develop monthly reports and tracking for Committee reviewsCollection, review, and tracking of regulatory documentsAssist Clinical Supply with drug projectionsAssist Medical Affairs Directors with budget development, tracking, and reconciliationWork with Field Medical Science Liaison team and IIT study sites to obtain monthly accrual, tracking milestones, resolve site specific queries with internal TOI teamPerform IME/CME grant coordinator activities:Processing of grants including follow up with grant submitters for additional data to ensure completeness for Committee reviewFacilitation of Committee review meetings including preparation of agendas, development of meeting minutes, tracking of budget, and requests for Letter of AgreementAssist Medical Affairs Director in grant process improvement efforts, including, but not limited to, optimization of grants system and revisions to web portalAssist in development of Medical Affairs activity reports to Senior Management by providing quality and timely summariesWork with Medical Affairs Project Management and Finance, including, but not limited to, reconciliation and development of budgets and development of project timelines using Microsoft Project, flocharts using VisioEducational Requirements:BS/BA or equivalent in business, math or scienceExperience:Minimum 2 years’ experience in the pharmaceutical industry with project management, budget tracking, and/or grant or project management systemsManagement of project budgets to ensure timely achievement of milestonesDirect experience in working with vendors, agencies, and internal cross functional stakeholders to jointly work on defined programs, including planning, tracking, and reporting.Experience in working on Oncology related projects is preferred.Other Skills and Abilities:Independent work style with ability to see what needs to get done.Language Skills:Excellent written and verbal communication skills.Physical Demands:While performing the duties of this job, the employee is frequently required to sit, talk and hear.The employee is occasionally required to walk.Work Environment:The noise level in the work environment is usually quiet. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  The incumbent in this position may be required to perform other duties, as assigned."}