{"jobID": "2752868940", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst (LA)", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": " About Uber Were changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now were a part of the logistical fabric of more than 600 cities around the world. Whether its a ride, a sandwich, or a package, we use technology to give people what they want, when they want it. For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer. And thats just what were doing today. Were thinking about the future, too. With teams working on autonomous trucking and self-driving cars, were in for the long haul. Were reimagining how people and things move from one place to the next. Uber is looking for sharp, highly motivated individuals to join our US & Canada Rides Central Operations team. If you love setting a vision, managing cross-functional stakeholders, pushing projects forward to deliver measurable and strategically meaningful results, and solving problems from both 30,000 feet as well as deep in the details, this is the role for you. As one of the worlds fastest growing companies, were generating vast amounts of data every day. We use this data to inform everything we do: ensure balance in the marketplace, identify ways to continually make the Uber experience better for drivers and riders, deploy incentives and promotions, understand customer behavior, develop and launch new product offerings, and more. Central Operations Managers make decisions and create processes using this data every day, and are critical to developing and owning our US & Canada business strategy. What Youll DoDrive analysis on important decisions that inform key business initiatives, including marketplace balancing efforts, promotion targeting decisions, customer engagement programs, and more.Identify operational weaknesses and help improve or innovate new processes Work with other Central Operations managers to solve the hardest problems impacting the customer experience and the overall businessBuild, maintain, communicate, and present detailed reporting at city, regional, and mega-regional levelsPresent models, findings and insights to senior management to drive business decisionsCollaborate with local and other Central Operations teams, as well as marketing, product and other central functions, to ensure that insights inform broader strategic initiatives This role demands excellent stakeholder and project management skillsThe Central Operations team owns the business, and your team will be responsible for monitoring, correcting, and executing business processes in functional areas Some team focus areas include: ComplianceAirports StrategyDriver Onboarding What Youll Need3+ years experience of investment banking / consulting / business intelligence / strategy or related experience; some high-growth operations or startup experience is strongly preferred.Exceptional communication and organization skillsA driver personality - biased toward action - constantly pushing toward clarity and deliveryExceptional Excel / data management skills.Self-motivated, works independently and possesses strong organization and time management skillsBachelor's degree requiredSQL Proficiency strongly preferred"}