{"jobID": "2657273236", "jobLocation": "Roseville_CA", "jobTitle": "Cloud Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.launchcg.com", "Headquarters": "Bellevue, WA", "Size": "501 to 1000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "Cloud Data Engineer Be a part of our success story. Launch offers talented and motivated people the opportunity to do the best work of their lives in a dynamic and growing company. Through competitive salaries, outstanding benefits, internal advancement opportunities, and recognized community involvement, you'll have the chance to create a career you can be proud of. Your new trajectory starts here at Launch.  We’re hiring a Cloud Data Engineer who’s designed and implemented high-scale cloud data solutions. The role will join our team to get a logistical-scale, best-of-breed platform as a service to handle real-time ingesting via Google pub / Sub in Google Cloud. We’ll use tools like FluentD to ensure this platform is fault-tolerant. Responsibilities:Design, implement, and manage large-scale, high-volume data platformsDay-to-day responsibilities include working with architects to implement and automate data ETL and processing pipelines in cloud environments (Google Cloud or AWS)Required Experience/Qualifications:Experience building data pipelines using PythonExperience with Google Cloud, Pub/Sub, Dataflow/FluentDExperience with AWSMust have both operational and development experience with PaaS, IaaS, Google Cloud (AWS a plus), and streaming technologies such as Apache Beam and/or FluentDBusiness Athletes: Launch looks for the same attributes we admire in top athletes and applies them to the business world: MASTERYCOMMITMENTFOCUSDETERMINATIONINTEGRITYTEAMWORKPOSITIVITYGOAL-ORIENTEDHEALTHY COMPETITIONGOOD SPORTS We interview for these traits above and beyond the technical skill set required for a particular role. Surrounding ourselves with Business Athletes leads to a competitive, fun, winning environment.  Qualified applicants, please respond to inquire@launchcg.com with your full name, resume, and a brief description of how your skills match the requirements above.  Please refer to Job #1735 when responding to this posting.  *Launch Consulting is a veteran-owned company and equal opportunity employer. Veterans encouraged to apply."}