{"jobID": "2295113421", "jobLocation": "Los_Angeles_CA", "jobTitle": "Customer Service Representative", "companyRating": "4.7", "companyInfo": {"Website": "www.seekcapital.com", "Headquarters": "Los Angeles, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Lendio, Fundera, Fundwise Capital"}, "estimatedSalary": "14", "jobDescription": " Customer Service Representative  Seek Business Capital is seeking to grow its account management team to develop relationships with small business owners across the united states who are in pursuit of working capital for their businesses. You will have the opportunity to help grow the economy and become an expert in small business funding. Seek Business Capital is an LA Based Fintech firm helping new businesses find capital. We have originated over $100mm in 2017 and projected to grow 100%+ in 2018. Our investors include firms with significant experience in FinTech and are highly regarded in the industry. As part of the Customer Service team, you will:Manage a portfolio of accounts to achieve long-term successOperating as the lead point of contact for any and all matters specific to your accountsEnsure the timely and successful delivery of our solutions according to customer needs and objectivesFollow up on leads and maintain an active pipeline dailyAbout You:You have sales or call center experienceYou have tons of energy, passion, humor, compassion, and enthusiasmDemonstrable ability to communicate, present and influence key stakeholders at all levels of an organizationProven ability to juggle multiple account management projects at a time, while maintaining sharp attention to detailYou share the ability to advance the vision of the departmentYou have a powerful work ethic and emotional intelligenceExperience delivering client-focused solutions to customer needsStrong verbal and written communication skillsYou have the ability to exercise your own judgment and discretion while working independentlyAt Seek Business Capital, you will:Competitive Base Salary plus monthly commission ($45,000-$55,000)Advancement in career oppurtunitiesFull medical, dental, vision insurance plansPaid time offFrequent contests and incentive oppurtunitiesLA Gym fitness membership We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, or disability status, or any other characteristic protected by federal, state, or local law.  Job Type: Full-time"}