{"jobID": "2829534035", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Clinical Scientist", "companyRating": null, "companyInfo": {"Website": "www.immunomedics.com", "Headquarters": "Morris Plains, NJ", "Size": "51 to 200 employees", "Founded": " 1982", "Type": " Company - Public (IMMU) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Overview  The Clinical Scientist will provide scientific leadership for development and oversight of clinical studies. This individual will be responsible for supporting assigned drug development projects specifically with clinical documents and data review. The Clinical Scientist serves as a key clinical resource for the assets in the pipeline.  Responsibilities  Contributes and authors documents for IND/NDA/CTA and other regulatory documents (e.g. briefing documents, protocols, IBs).  Provides scientific and technical leadership for successful study-related documents and correspondence; ensuring each decision affecting study outputs are fully documented in accordance with relevant SOP’s and are in compliance with regulatory review.  Contributes in writing protocol, synopsis, IB and other study related documents.  Responsible for appropriate communication of study progress and deliverables to the project team or senior management, as required.  Provides study-related training and responds to protocol related questions.  Works with data management on case report form development and other data capture activities to ensure adequate data capture.  Reviews study listings and provides the team with input.  Identifies trends with study data.  Works closely with the Medical Monitor, Data Management, Statistics, and the Study Lead.  Ability to interface professionally with a wide spectrum of internal and external academicians, agencies and industry stakeholders in the scientific/clinical development arena  Ability to work on multiple projects with aggressive timelines  Ability to work independently with minimal supervision  Strong interpersonal and communication skills bridging scientific and business needs-integrating clinical science, disease area knowledge and operational requirements.  Working knowledge of all relevant regulatory guidelines and standards (e.g. GCP, ICH, and FDA/FEMA guidance documents) as well as practices and expectations of Quality within GCP.  Proficiency in Word, Excel and Power Point.  Strong problem solving and critical thinking skills.  Strong organization skills and attention to detail.  Strong presentation skills. Qualifications Bachelor degree in science or equivalent required. Master’s degree, Ph.D., Pharm. D. preferred.  Minimum 7 + years of experience in clinical sciences within pharmaceutical/biotechnology industry.  Experience in oncology data review.  Experience with EDC to review patient profiles and listings.  Expertise with clinical drug development and regulatory processes and understanding of the design and conduct of clinical trials. Experience in data review, listings via EDC and other platforms (J review etc.) preferred"}