{"jobID": "2819528670", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Engineer, Degrees", "companyRating": "3.4", "companyInfo": {"Website": "www.coursera.org", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "178000", "jobDescription": "Coursera is scaling a global platform to provide universal access to the world’s best education, and we’re motivated by the passion and mission to transform lives through learning. Our platform has reached over 30 million learners worldwide and we have partnered with 150+ elite universities around the globe with over 2,000 courses in our catalog. We offer Courses, Specializations, Certificates, and Degrees to meet the needs and goals of the diverse learners who come to Coursera.In 2016, Coursera began hosting accredited online Masters degrees provided by University partners, which ​provide ​a​ more convenient, lower-cost,​​ “stackable”​ means of earning credentials identical ​to their ​​traditional​ on-campus​​ counterparts. We also launched Coursera for Business, partnering with enterprise companies around the world to provide access to curated skill development for their employees.Data Engineering is unique at Coursera. Our team doesn’t simply build reports on demand. Rather, we build the semantic infrastructure and products that empower our internal and external customers with the data to innovate and perform their jobs better.We’re looking for a talented and driven data engineer with a keen eye for data and business to help us build and scale our degrees business. Our ideal candidate is an independent, analytically-minded individual with strong data modeling and software engineering skills, who shares our passion for education. In this role, you’ll directly work with cross-functional teams(product, engineering, services) to design, develop, and deploy data solutions for our degree learners and partners.You personally exhibit a conviction that the world needs Coursera to be wildly successful and alignment to our core values:"}