{"jobID": "2795603539", "jobLocation": "Kalamazoo_MI", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.mdlab.com", "Headquarters": "Hamilton, NJ", "Size": "201 to 500 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 18-0255 Post Date 5/30/2018 Title Research Scientist City Kalamazoo State MI Company Genesis PharmOptima, LLC DescriptionGenesis PharmOptima, a member of Genesis Drug Discovery and Development Services LLC, has an immediate opening for a Research Scientist, ADME/DMPK. PharmOptima is a proven provider of ADME/DMPK, Bioanalysis, and Biochemistry research services to the biotechnology and pharmaceutical industries. We are seeking a motivated and talented Research Scientist to  play a central role in our Bioanalytical Department. Responsibilities:  • Perform absorption, drug metabolism, excretion and pharmacokinetic evaluations for small and large molecule bioanalytical measurements of test compounds in biological matrices obtained from a variety of studies including preclinical safety evaluations  and clinical studies.  • Responsible for the hands-on design, conduct, interpretation, and reporting of pharmacokinetic and pharmacodynamic results across multiple modalities including both large and small molecules.  • The successful applicant will have pharmacokinetic expertise to support project teams across multiple therapeutic areas.  • Generating quotes and study protocols, interpretation of data, writing and review of final study reports.  • Interfacing with multiple groups for the successful implementation, conduct, and interpretation of studies. Perform the responsibilities of Study Director.  • Writing final reports, communicating progress and project issues to management and Sponsors. RequirementsRequirements:A Ph.D. in pharmacokinetics or related field with at least 3 years industry experienceExperience using Phoenix WinNonlin is required, and experience with more sophisticated modeling programs is a bonus.Familiarity with regulated bioanalytical studies with an understanding of FDA GLP, GMP and GCP requirements and guidance.Ability to design and implement preclinical pharmacokinetic and PK/PD studies, formulation comparison studies, and other in vivo studies required to support preclinical and first in human clinical trials for small molecules and biotherapeutics.Strong written, presentation and verbal communication skills.Excellent organizational skills.Attention to detail regarding safety and accuracy of procedures performed.We Offer:Competitive SalaryMedical, Dental & Vision InsuranceShort and Long Term DisabilityLife InsuranceDependent Care Flex Spending AccountVoluntary Policies (Accident, Hospital Indemnity, Critical Illness & Supplemental STD)Legal Plan & Identity Theft Protection401(k) PlanPaid Vacation & HolidayBusiness Casual EnvironmentCredit UnionVisit us at www.mdlab.com  Medical Diagnostic Laboratories, LLC is an equal opportunity employer.#CB"}