{"jobID": "2683582814", "jobLocation": "Washington_DC", "jobTitle": "Director of Sales", "companyRating": null, "companyInfo": {"Website": "www.predictivetechnologies.com", "Headquarters": "Arlington, VA", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Building brand recognition for our products is the key to our company’s success. As a Director of Sales, you will be on the frontline of generating excitement and demand for our unique software solutions while leading and partnering with other sales team members to this end. By identifying customer and prospect product requirements, qualifying sales opportunities, and building a pipeline of leads, you will engage in prospect discussions and demonstrations, directly contributing to the company’s profitability and validating its place as a leader in the industry.What does this mean for you? Contribute as an individual salespersonBe a role model salesperson and lead by exampleSteadily increase personal annual sales contribution each yearDevelop and pursue new sales leads in the front-end sales processMaintain and expand relationships with existing clientsWork closely with executive team members to move sales processes into signed dealsAct as a mentor and advisor to inside salespersonGenerate outstanding individual performance while fostering a team oriented environment within the sales group, and with other arms of APTGenerate new business using an existing network of industry contacts within financial services industryDeliver sales presentations to Senior level executivesEstablish productive, professional relationships with key personnel in assigned client accountsCoordinate the involvement of other APT team members, including client services, marketing, and management, in order to meet client objectivesMeet assigned targets for profitable sales volume and strategic objectives in assigned accounts defined by company managementProactively assess, clarify, and validate client needs on an ongoing basis Ideal Candidate Qualifications Demonstrated excellence and career development in a sales role8+ years of sales experience preferably in technology or professional servicesDemonstrated experience selling solutions to c-level clients within financial servicesKnowledge of the corporate procurement processA proven aptitude for learning technical terms and developing an understanding of complex technical productsHigh level of energy, drive, enthusiasm, initiative, and commitmentProfessional with good organization and planning skillsGood communication and persuasion skills, both written and oralProven self-starter with record of success in team oriented environmentBachelor’s degreeAPT is an equal opportunity employer that values diversity and inclusion. Applicants will be considered and treated without regard to gender, gender identity, race, color, ethnicity, national origin, religion, sexual orientation, veteran or disabled status, or any other characteristic protected by applicable law."}