{"jobID": "2796247446", "jobLocation": "Arlington_VA", "jobTitle": "Data Scientist", "companyRating": "4.5", "companyInfo": {"Website": "www.helloinspire.com", "Headquarters": "Santa Monica, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Public", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": "WHAT YOULL BE DOING Do you have an intense curiosity and interest in in data? Does solving problems and finding new ways to extract insights from data and build tools around a positive mission excite you? Then this Data Scientist role may be for you!  Inspire, the largest social network for health, is seeking a highly collaborative professional to work across functional teams and disciplines supporting the dissemination and interpretation of data from across the organization. We work to connect and empower patients and caregivers while finding ways to push forward medical research. This position is both technical and analytical in nature. We are looking for someone to with a very broad interest in getting actionable data from large quantities of patient-authored text.  Our new team member will support initiatives across the company: Utilize natural language processing (NLP) and machine learning (ML) to appropriately analyze and tag content to improve information retrieval for members and researchersCollaborate with the research team on new ways to analyze text and extract information to bolster medical progress and understand the patient experienceDetermine the most efficient ways to increase member engagement by developing new tools and products that allow members to explore content and connect with one anotherBuild strong working relationships with the engineering team and management to understand project needs and deliverablesIdentify new data sources and assist with the development of new tables in the data warehouseFollow the latest developments in statistics, linguistics and health services research to inform management of new opportunitiesWHAT WE ARE LOOKING FOR You excel in a fast-paced work environment and are excited to push the boundaries of your data skills to answer interesting questions. Our new team member will be experienced with most of the items listed below but will also enjoy learning new things and working with a talented group of co-workers to build something truly meaningful. 3+ years of experience programming with Python, R, Julia, Scala or similar language3+ years of experience with SQL and relational databases3+ years of experience with Git and version-control3+ years of experience with working in a unix environment1+ years of experience with natural language processing (NLP), statistics and machine learning (ML) techniquesExperience with AWS products and servicesExperience with NoSQL databasesStrong ethical integrity about the useSolid analytical skills and demonstrated problem-solving abilityAbility to create powerpoint/slides to communicate information across the companyYou thrive in an entrepreneurial environment and have the ability to support initiatives with shifting priorities in a fast-moving environmentBachelor or Master degree in a related field with analytical training OR an equivalent combination of education/experience in technology and operationsDesired Characteristics/QualificationsAn understanding of healthcare systems, clinical trials and biomedical researchAn understanding of marketing, economics and sociologyAn understanding of network science or systems engineeringWHAT WE OFFERCompetitive salary and benefitsGenerous PTO policy (ask us about it!)Stock optionsHealth insurance, including dental and vision401(k) retirement plan with matchingA corporate mission that benefits societyFlexible work scheduleTalented, creative co-workersABOUT INSPIRE Inspire was founded in 2005 out of our interest in health, our personal experiences with difficult health issues, and the vision that we could use the Internet to improve patients' and caregivers ability to find support. We believe patient centricity is the future of healthcare.  Inspires mission is to bring people together and to accelerate medical research. We have developed focused member groups and partnered with over 100 non-profit patient advocacy organizations, including the American Lung Association, National Osteoporosis Foundation, Arthritis Foundation, National Psoriasis Foundation, and Lupus Foundation of America, to provide online patient communities in a safe, privacy-protected environment. Members are resources for each other sharing health information and support without regard to location, background, or status. Together they reduce the feelings of isolation experienced by those with chronic conditions, cancer, rare diseases. We all believe that Together were better.  From marketers, designers, to software engineers and healthcare product experts, we are a diverse community with the goal of changing the patient and caregiver experience through community."}