{"jobID": "2537021207", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.staylyric.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " Unknown / Non-Applicable", "Competitors": " Sonder, The Guild, Stay Alfred"}, "estimatedSalary": null, "jobDescription": "About Wheelhouse: We're building a data-driven hospitality company, and data science is the foundation of our success.  Over the last 2.5 years, our team has worked to develop the world's most accurate pricing engine for short-term rentals. We use this pricing engine to power an increasing set of product lines, including Wheelhouse Pricing. Building this pricing engine required (and still requires) us to borrow from a wide range of statistics and ML approaches, including methodologies we found in bio-sciences and other distributed realms.  Now, we're looking to add another data scientist who is passionate about building interpretable machine learning models, and taking them from research to production. These models help our software customers price their homes accurately, and also serve as the foundation of our relationships with many of the world's largest real estate companies.  Our data science team is closely integrated with the engineering team, and we are not shy of full stack tasks from DevOps to front-end integrations. We use open source and homegrown tools in a cloud environment to build the data-driven foundation of all our products.  We currently use Postgres, Redis, R, Ruby/Rails, React, AWS - so in depth experience in any of these areas is definitely a plus. But we’re always open to new technologies and are just as eager to learn as you are. About you:You have experience with building regression, classification, and recommender systemsYou have been working with large datasets in distributed systems and a constrained environmentYou know a breadth of machine learning algorithms and love to find the best approach to a specific problemYou have the engineering skills to write production ready codeYou have experience in SQL and are excited to optimize your queries but also know how to map-reduce the dataYou like to tell others about your data findings and explain why your models workYou think it sounds fun to write a clustering algorithm from scratch, but you also know how to pick the right tool for the job at handYou want to collaborate with data scientists, software engineers, and product teamsYou are eager to learn new programming languages and tools and to try them outYou appreciate the importance of creating robust quality control processes for you models and dataYou love when your work has an immediate impact on real-world resultsYou like to work autonomously and have no problem finding the most relevant projects to work onWithin 30 days, you will...Meet your new teammates, learn what they do and what makes Wheelhouse a special place to workLearn about our core values, mission, vision and company goals, and how they’ve influenced our culture to dateGet to know our current data infrastructure and take ownership of our market intelligence toolDeploy production ready code and testsStart improving our booking classification systemWithin 3 months, you will...Have a full understanding of our data architecture and recommendation engineIndependently build new features in collaboration with our product teamAdvance & test novel solutions for improving our ability to customize price recommendations for any listing based on that listing’s unique booking historyOwn the analytic and reporting features for the next generation of Wheelhouse pricing for professionalsWithin 6 months, you will...Independently work on additions to our recommendation engineBuild a collaborative recommendation engine that allows our users to share knowledgeImplement a new and improved model to recommend the competitive set of a listing"}