{"jobID": "2786103058", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist, Ad Tech", "companyRating": null, "companyInfo": {"Website": "www.answersetc.com", "Headquarters": "North Richland Hills, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " U.S. Equal Opportunity Employment Information (Completion is voluntary)  Individuals seeking employment at Multiply are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation. You are being given the opportunity to provide the following information in order to help us comply with federal and state Equal Employment Opportunity/Affirmative Action record keeping, reporting, and other legal requirements.  Completion of the form is entirely voluntary. Whatever your decision, it will not be considered in the hiring process or thereafter. Any information that you do provide will be recorded and maintained in a confidential file.  Gender Please selectMaleFemaleDecline To Self Identify  Are you Hispanic/Latino? Please selectYesNoDecline To Self Identify  Please identify your race Please selectAmerican Indian or Alaskan NativeAsianBlack or African AmericanHispanic or LatinoWhiteNative Hawaiian or Other Pacific IslanderTwo or More RacesDecline To Self Identify  Race & Ethnicity Definitions  If you believe you belong to any of the categories of protected veterans listed below, please indicate by making the appropriate selection. As a government contractor subject to Vietnam Era Veterans Readjustment Assistance Act (VEVRAA), we request this information in order to measure the effectiveness of the outreach and positive recruitment efforts we undertake pursuant to VEVRAA. Classification of protected categories is as follows:  A \"disabled veteran\" is one of the following: a veteran of the U.S. military, ground, naval or air service who is entitled to compensation (or who but for the receipt of military retired pay would be entitled to compensation) under laws administered by the Secretary of Veterans Affairs; or a person who was discharged or released from active duty because of a service-connected disability.  A \"recently separated veteran\" means any veteran during the three-year period beginning on the date of such veteran's discharge or release from active duty in the U.S. military, ground, naval, or air service.  An \"active duty wartime or campaign badge veteran\" means a veteran who served on active duty in the U.S. military, ground, naval or air service during a war, or in a campaign or expedition for which a campaign badge has been authorized under the laws administered by the Department of Defense.  An \"Armed forces service medal veteran\" means a veteran who, while serving on active duty in the U.S. military, ground, naval or air service, participated in a United States military operation for which an Armed Forces service medal was awarded pursuant to Executive Order 12985.  Veteran Status Please selectI am not a protected veteranI identify as one or more of the classifications of a protected veteranI don't wish to answer  Form CC-305  OMB Control Number 1250-0005  Expires 1/31/2020  Voluntary Self-Identification of DisabilityWhy are you being asked to complete this form?  Because we do business with the government, we must reach out to, hire, and provide equal opportunity to qualified people with disabilities1. To help us measure how well we are doing, we are asking you to tell us if you have a disability or if you ever had a disability. Completing this form is voluntary, but we hope that you will choose to fill it out. If you are applying for a job, any answer you give will be kept private and will not be used against you in any way.  If you already work for us, your answer will not be used against you in any way. Because a person may become disabled at any time, we are required to ask all of our employees to update their information every five years. You may voluntarily self-identify as having a disability on this form without fear of any punishment because you did not identify as having a disability earlier.  How do I know if I have a disability?  You are considered to have a disability if you have a physical or mental impairment or medical condition that substantially limits a major life activity, or if you have a history or record of such an impairment or medical condition.  Disabilities include, but are not limited to: BlindnessDeafnessCancerDiabetesEpilepsyAutismCerebral palsyHIV/AIDSSchizophreniaMuscular dystrophyBipolar disorderMajor depressionMultiple sclerosis (MS)Missing limbs or partially missing limbsPost-traumatic stress disorder (PTSD)Obsessive compulsive disorderImpairments requiring the use of a wheelchairIntellectual disability (previously called mental retardation) Disability Status Please selectYes, I have a disability (or previously had a disability)No, I don't have a disabilityI don't wish to answer  Reasonable Accommodation Notice  Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.  1Section 503 of the Rehabilitation Act of 1973, as amended. For more information about this form or the equal employment obligations of Federal contractors, visit the U.S. Department of Labor's Office of Federal Contract Compliance Programs (OFCCP) website at www.dol.gov/ofccp.  PUBLIC BURDEN STATEMENT: According to the Paperwork Reduction Act of 1995 no persons are required to respond to a collection of information unless such collection displays a valid OMB control number. This survey should take about 5 minutes to complete.SDL2017"}