{"jobID": "2769294906", "jobLocation": "Emeryville_CA", "jobTitle": "Data Visualization Analyst", "companyRating": null, "companyInfo": {"Website": "www.callistomedia.com", "Headquarters": "Berkeley, CA", "Size": "1 to 50 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Callisto Media was inspired by a single, transformational idea: harness the power of big data to produce timely content that enables consumers to lead richer, healthier, more fulfilled lives.With deep roots in technology and publishing, Callisto Media harnesses the disruptive power of Big Data, creating unparalleled insights into consumer demand and the science of content. Our titles uniquely serve the needs of the reader, enjoy consistent profitability, and delve into the long tail of opportunity.We have an enterprising, collaborative culture and are backed by leading Silicon Valley venture capitalists. We use proprietary technology to identify and meet consumer demand by delivering timely content in sync with the market. Were an intellectually curious team made up of driven analysts, editors, designers, marketers, and engineers based in the Bay Area and New York City who are aggressively expanding the breadth and depth of our portfolio in cooking, specialty diet, health and wellness, mind, body and spirit, parenting, kids, business and more.The R&D; division of Callisto Media is looking for a Data Visualization Analyst who can help devise custom visual components to support our data-driven business process. This person will work with the Data, Finance, and Engineering teams to drive various types of analysis and reporting. This individual will guide internal stakeholders through various interactive visualization procedures using a variety of in-house tools.Required Skills and Abilities Help create state-of-the-art, proprietary data visualizations leveraging our Engineering teams in-house enhancements to standard chart packagesLearn the fundamentals of our data-driven process and work with the Data team to develop visualizations that aid interpretationCreate custom multidimensional overlays of charts, graphs, infographics, etc. to support knowledge acquisition and decision makingBe proactive within the organization when it comes to delivering actionable insights through best-in-class visualizations for various departmentsConduct staff interviews to understand and document current data uses, and to measure felt needs regarding data analyticsCreate visual mock-ups and/or prototypes to validate user requirementsDesign and specify interactive visualizations to allow users to ask and answer questions visuallyDevelop compelling visual stories to effectively communicate meaningful narrative insights from large-scale time-series dataBe passionate about visualization as a means of business optimization and process transformationRequired ExperienceBachelors degree or higher in a relevant disciplineHands-on experience with data visualization methodology and conceptsHands-on experience with SQL database querying toolsStrong knowledge of best practices for visual dashboards and BI reporting with emphasis in design and publishingHands-on experience with MS Office suiteAbility to manage multiple projects simultaneously with minimal supervisionJoin us! We are a team where data drives our decisions. Where culture matters. We put our customers first and they embody our core values. Were entrepreneurial and focused in our approach. We challenge each employee to experiment and drive results while feeling empowered to do their best work each and every day.Callisto Media offers a competitive salary, full benefits, 401k, stock options, for full-time employees, as well as a friendly working environment. This is a full-time, onsite position."}