{"jobID": "2823120083", "jobLocation": "Troy_MI", "jobTitle": "Application Engineer", "companyRating": "2.9", "companyInfo": {"Website": "www.logicsolutions.com", "Headquarters": "Ann Arbor, MI", "Size": "51 to 200 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " Logic Solutions is a full-service development firm headquartered in Ann Arbor, MI with 4 additional offices around the world. Founded in 1995, Logic offers website design and programming, eCommerce solutions, customized web and mobile applications, and application integration services that span the software development lifecycle.  Logic is seeking an experienced Southeast Michigan-based Mobile Technical Architect for its growing technical team. We are looking for a hard-working individual who can work in a fast-paced environment. Responsibilities:Communicate with customers during the project cycle, including requirements, design, implementation, and bug fixingCommunicate with PM and development team in China to make sure the project is on trackSupport and solve critical product and technical issues and troubles onsite.Daily reporting of project process and risksRequirements:Bachelor’s degree is required. Master’s degree is a plus.Over 3 years of experience working on automotive or mobile projectsProficiency in Android developmentFamiliarity with C/C++, NDK, and Android multimedia-related development.Audio and video performance optimization and adaptation experience would be a plus.Experience in IVI mobile projection is preferredExcellent English communication skillsMust be able to work in US-based customer office for a long termProject management experience is a plus This is a full-time position. This is a salaried position with compensation based on experience and skill level. Benefits include medical, insurance, 401(k), paid time off (vacation, holidays, and sick days) and a professional work environment. Logic offers equal opportunities to all people. We would like to thank all applicants for expressing interest; however, only those selected for interviews will be contacted. Reference checks may be conducted with your permission."}