{"jobID": "2837441356", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Business Intelligence Analyst Lead / Business Intelligence Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.umich.edu", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1817", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Clicking \"Apply Now\" opens the link in a new window.How to Apply  A cover letter and resume are required; the cover letter must be PAGE 1 of your resume. The letter should:  (1) Specifically outline the reasons for your interest in the position  (2) Outline your particular skills and experience that directly relate to this position  Starting salary may vary depending on qualifications and experience of the selected candidate.  Job openings are posted for a minimum of seven calendar days. This job may be removed from posting boards and filled any time after the minimum posting period has ended.  Job Summary  The University of Michigan serves the people of Michigan and the world through preeminence in research, teaching and healthcare. If you are inspired by ideas that challenge the present and enrich the future, consider joining our team. The Information Quest Team has a unique opportunity for a Business Intelligence (BI) Analyst Lead or Senior within the Information Technology Services (ITS) Department. The IQ team is transforming the way data is delivered and visualized to drive decision-making across the university. Becoming an IQ team member requires a passion for turning data into actionable information. By clearly defining initiative, goals and objectives and then gathering and validating requirements, this individual delivers quality Business Intelligence solutions that exceed expectations and results in customer gratitude.  This is a highly cross-functional role at the intersection of people, data, and processes. The BI Analyst guides Business Intelligence projects including data analysis, data governance, and systems implementation from inception to completion.  The BI Analyst collaborates closely with our UM administrative and campus partners by acting as a liaison between the business and IT groups. They will be serving as an intermediary who can translate business requirements for functionality into technical plans, and conversely, technical constraints into business reality. Strong communication and interpersonal skills are crucial, as is an understanding of the business processes as well as viable technical solutions. The person will present data visually in a meaningful way that enhances the ability for business partners to understand and act on the information.  Responsibilities* Perform business analysis, data analysis and translate business requirements into data/technical specifications.Lead in the conceptualization and development of the cross-functional client/unit strategic objectives, business processes, and initiatives that drive or increase organizational value.Lead the design and development of data structures and data extracts to support comprehensive data collection, loading, and extraction for complex analyses.Lead strategic assessments to identify current/emerging business issues/problems and contribute to defining high impact business intelligence solutions with a focus on the quantitative methods, modeling, and analytical techniques.Develop processes for capturing and maintaining metadata from all data warehousing components.Lead and guide business process improvement discussions leading to advise on potential problem resolutions, including gathering the support and resources for BI initiatives.Responsible for defining the needs of key stakeholders as they relate to information reporting, analysis, and distribution as well as developing and implementing a vision for the delivery of information solutions to the University's stakeholders.Develop specifications for complex reporting needs, such as data cubes and other reporting tools.Create the structures that deliver information in a way that customers can easily consume the data.Analyze current state, conceive the desired future state, and identify projects needed to successfully implement future goals.Work with business process owners to develop key measures that drive University metrics.Work with data experts to ensure that data is captured accurately.Lead institutional analytical initiatives.Advise on the architecture for data warehouse and reporting tools.Help make enterprise data available to developers, researchers, and decision makers on campus.Engage broadly across the university to present the effective use of data.Develop and present reports and definitions, graphs, dashboards, and portal interfaces appropriate for audience.Identify and lead change management processes for new/improved business processes/BI tools and resources.Manage cross-functional unit projects and/or teams which include project planning, task management, status reporting, etc.Organizational Competencies: Building Relationship / Interpersonal Skills Demonstrated ability to develop and maintain positive and cooperative relationships, inside and outside of work group, interacting in a friendly, open, honest, and accepting manner.Demonstrated ability to use formal/informal networks to accomplish tasks and objectives, developing and maintaining smooth, cooperative working relationships.Demonstrated ability to address and manage conflict and offer constructive criticism and feedback in a positive manner. Creative Problem Solving / Strategic Thinking Defines problems, analyzes causes, identifies possible solutions, selects the best solution, and develops action plans. Generates new ideas and goes beyond the status quo.Demonstrated ability to use creative thinking to improve processes and solve complex problems.Plans and acts strategically, analyzing data and utilizing trend information. Flexibility / Adaptability to Change Demonstrated ability to plan, implement, and communicate effective change approaches within established and changing deadlines.Proactively proposes and implements changes: surfaces resistance to change; works to diminish resistance; and organizes resources to effectively implement large-scale change. Leadership / Achievement Orientation Demonstrated behavior aligned with the values and ethics of the organization and profession.Experience delegating and empowering others while creating a culture in which people do their best.Demonstrated experience acting to address current issues, respond quickly and effectively in a crisis, determining future priorities, and leading ad hoc or project teams. Required Qualifications* Bachelor's degree in a related field and/or equivalent combination of education, certification and experience.Six (6) years professional experience in Business Intelligence Reporting, Analytics, and/or Decision Support. Four (4) years for Senior level.Six (6) years experience with the full software lifecycle including requirements analysis, design, implementation, quality assurance testing and documentation. Familiarity with Agile Four (4) years for Senior level.Minimum of six (6) years demonstrated experience in a IT role requiring confidentiality, timeliness, customer service, organization, prioritization, troubleshooting, and working independently. Four (4) years for Senior level.Demonstrated ability to work with stakeholders developing dashboards and reports using Tableau.Demonstrated proficiency in data visualization techniques for reporting purposes.Fluent in relational database and data integration concepts.Strong consultative, analytical, and problem solving skillsProven ability to work on multiple priorities in a deadline-driven environment.Experience in clearly communicating between the business sponsors, business analysts and stakeholders as well as the technology team with data architects, ETL developers, database administrators, systems analysts and technical support personnel.Experience with data modeling, data mapping, and data mining. Desired Qualifications* Experience with business processes in Financial, Human Resources, Procurement, Research, Development offices in a higher-ed environment.PeopleSoft ERP experience.BI Reporting proficiency in using parameters, data joins / blends / unions, and complex table calculations.Ability to reconcile data across multiple systems to the transactional level.Ability to accurately query, sort, merge, combine, and summarize data in SQL Server and/or Oracle databases.Development experience using programming languages (Python, R).Business Objects design and reporting support.Familiarity with MReports and the UM data delivery environment.Familiarity with Cloud Computing BI Tools.Working knowledge of ETL tools (Informatica, SSIS). Work Schedule  Punctual, regular, and consistent attendance is required. May require working during non-business hours and on weekends.  Work Locations  May require travel to various locations on and off campus  Underfill Statement  This position may be underfilled at a lower classification depending on the qualifications of the selected candidate.  This position may be filled at the FLSA exempt Lead level 10 or at the FLSA exempt Senior level 9. Starting salary and position level are dependent upon the qualifications and experience of the selected candidate. The requirements listed below predominantly reflect the Lead level. Applicants with lesser experience are also encouraged to apply. Additional Information The University of Michigan was featured as one of the \"Great Colleges to Work For\" in the 2015 Chronicle of Higher EducationSDL2017"}