{"jobID": "2822073178", "jobLocation": "Taylor_MI", "jobTitle": "Materials Scientist/Chemist", "companyRating": "3.5", "companyInfo": {"Website": "www.masco.com", "Headquarters": "Livonia, MI", "Size": "10000+ employees", "Founded": " 1929", "Type": " Company - Public (MAS) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": "Job Description Position Overview  Masco Research and Development is currently seeking to hire a Materials Scientist/Chemist.  Masco Corporation is a leading provider of products for new home construction and existing home remodeling. The corporation maintains a facility in Taylor Michigan to support the technical needs of its business units.  Masco Research and Development is Masco Corporation's technical facility located in Taylor Michigan. The facility is staffed by highly trained scientists who are equipped with up-to-date analytical equipment. They have contemporaneous knowledge of materials and product regulatory codes/standards that affect Masco products. Masco Research and development offers testing, research and consulting services to support product compliance, quality control, new product development, litigation/inspection, design changes and risk analysis. The facility has continuously met and/or supplemented the technical needs of all Masco business units since 1975.  The Materials Scientist/Chemist will design and conduct experiments, generate data, and interpret that data to help customers make informed decisions regarding the aforementioned topics. The position offers unique and exciting challenges owing to the vast array of materials and regulatory standards in Masco's product portfolio. The position also presents a great opportunity for networking and learning as the scientist can work closely with other likeminded individuals around the world.  Essential Duties and Responsibilities Plan and carry out projects of various complexityAid in new product developmentPrepare solutions, compounds and reagents used in laboratory proceduresAnalyze materials to determine their composition (organic and inorganic)Conduct analyses per standard methods (ASTM, NSF etc.)Create and validate new test methods to meet customer needsOrganize, write and present technical reports to detail methods and findings to colleagues and ManagersParticipate in manufacturing process improvement efforts, and conduct testing to determine root cause of material performance issuesBe responsible for routine equipment maintenance, calibration and basic troubleshootingConsult with business units regarding material selection/compositionAble to perform other duties as assignedAble to travel up to 5-10% Education and Experience Minimum of BS degree in Chemistry or Materials Science from accredited institution requiredLaboratory experience from University or previous employment requiredKnowledge of both organic and inorganic chemistry required (knowledge of polymers is a plus)Knowledge of analytical instruments required (HPLC, IC, UV-VIS, GC/MS, ICP)Awareness of industry standard methods (ASTM, NSF, EPA, etc.)SDL2017"}