{"jobID": "2764011524", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Analyst - REMOTE", "companyRating": "3.5", "companyInfo": {"Website": "www.suntechnologies.com", "Headquarters": "Alpharetta, GA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "Job Code10527Job Title: Data Analyst - REMOTERequired Skills: R, SAS, Python, Matlab, SQL, Hive, Pig, Spark,Location: Fort Worth, 76108,COPay Rate: DOEDuration: 12 MonthsJob Description• The selected candidate will function as a practicing Data Scientist for advanced analytics techniques in support of Enterprise Operations programs and functions.  • Exhibits an exceptional degree of ingenuity, creativity, and resourcefulness.  • Applies and/or develops highly advanced technical technologies, scientific principles, theories and concepts.  • Exhibits an exceptional degree of ingenuity, creativity, and resourcefulness.  • Applies and/or develops highly advanced technical technologies, scientific principles, theories and concepts The responsibilities of this position include collaboration with business stakeholders to identify business opportunities and requirements to develop associated analytical models that deliver useful, actionable insights, or recommendations.  • Responsible for modeling complex business problems, discovering insights and identifying opportunities through the use of statistical, algorithmic, mining and visualization techniques.  • The candidate will need a combination of business focus, creative thinking, strong analytical and problem solving skills and programming knowledge to be able to quickly cycle hypothesis through the discovery phase of the project.  • Excellent written and communications skills to report back the findings in a clear, structured manner are required  Mandatory Skills:  • Previous experience with artificial intelligence or advanced algorithm development.  • Previous experience in applying data science against open source media to support intelligence collection and data fusion.  • Masters or PhD in Mathematics, Statistics, Computer Science or equivalent  • Must have strong problem solving skills, business acumen, and demonstrated excellent oral and written communication skills.  • Preferred languages: R, SAS, Python, Matlab, SQL, Hive, Pig, Spark  Desired Skills:  • Applying data science against open source media to support Intelligence collection and data fusion.  • Distributed Computing  • Predictive Modeling  • Story-Telling and Visualization  • Math, Stats, Machine Learning  Note: 20% Travel required. Dallas-TX, Philadelphia-PA, Washington DC, Orlando-FL, Denver-CORequired DetailsExperience: 5+ yearsTravel Required: NoClearance Required: NoContact DetailsContact Person: Asha BhatPhone: 678-203-2701Email: ashakb@suntechnologies.comURL: www.suntechnologies.com"}