{"jobID": "2666471232", "jobLocation": "Lewisville_TX", "jobTitle": "Tableau Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.judge.com", "Headquarters": "Wayne, PA", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Adecco, Kforce"}, "estimatedSalary": null, "jobDescription": " Our client is currently seeking a Tableau Data Analyst for a contract to hire role in Lewisville, TX. YOu must be on the judge group W2 to be considered, no sponsorship available.  Business Intelligence / Data Visualization Analyst  As a Business Intelligence / Data Visualization Analyst, this is an opportunity to support the business in the creation of metrics and reporting to deliver on KPIs while driving process improvement and innovation to ensure we deliver meaningful insights to the leadership. This Analyst will serve as liaison between Data Provisioning and various business units to coordinate the onboarding of data and the creation of Analytical solutions. Must have strong database query/analysis skills. Will work with the business source teams to analyze business requirements and review/produce specifications for any new/change to Dashboards. Responsibilities:Develop complex interactive/dynamic dashboards with tools like Tableau.Solicit business requirements from internal and external customer stakeholders.Understand business requirements very clearly then translate and use complex data sources that need to be blended and joined to delivery efficient and quality dashboards.Be involved in all aspects of the dashboard development life cycle, from the initial kickoff through the requirements analysis, design and implementation.Able to build and reuse template/components/web services across multiple dashboards.Develop connected dashboards using web services.Mentor internal development team and promote self-service analytics opportunities.Conduct demos to internal and external stakeholders.Responsible for maintaining consistency across multiple dashboards.Responsible for optimizing user experience.Requirements:2+ years data visualization tool experience-REQUIRED Tableau Desktop Certification a plus • Ability to work on complex SQL queries and SQL Management Studio along Knowledge of Business Intelligence tools including but not limited to Excel, Tableau, Alteryx, Cognos, SSRS, etc.Current experience with major industries in building line of business Dashboards.College degree, or specialized training or equivalent work experienceAbility to work well independently and within a teamAttention to detail and ability to assimilate fragmented facts into a detailed problem statementAbility to learn new tools and systems quicklyExcellent communication skills - both written and verbalExcellent analytical, problem solving and time management skillsProactive in learning the business processes, data flows, and systems functionality in order to support the technical team and provide guidance/advice to business partnersJudge Group Job Order ID: 558815 Salary: Open  Company Description:Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.  The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}