{"jobID": "2774706385", "jobLocation": "Paris_TX", "jobTitle": "alternance - Data Scientist Junior H/f", "companyRating": null, "companyInfo": {"Website": "www.credit-agricole.com", "Headquarters": "Montrouge, France", "Size": "5001 to 10000 employees", "Founded": " 1885", "Type": " Company - Public (ACA) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Société Générale, BNP Paribas, BPCE"}, "estimatedSalary": null, "jobDescription": " Détail de l'offre  Informations générales  Entité Crédit Agricole Assurances est au premier rang des assureurs français et européens*. Son modèle ? Celui d'un bancassureur multi-expert, solide, performant, proche de ses clients, capable de couvrir l'ensemble des besoins de protection et d'épargne des particuliers, des agriculteurs, des professionnels et des entreprises. Nous accompagnons nos clients chaque instant de leur vie travers nos trois grands métiers : l'épargne/retraite - l'assurance dommage la prévoyance/emprunteur.  Depuis plus de 30 ans, le Groupe Crédit Agricole Assurances s'est construit autour de la volonté d'être un assureur complet, diversifié et international au service de ses partenaires, notamment les Caisses Régionales et LCL en phase avec le positionnement et les valeurs de banque universelle de proximité du Groupe Crédit Agricole.  Le Groupe CA Assurances représente 4200 collaborateurs dont 3500 sont basés en France. données fin 2015. Référence 2018-30553  Date de parution 07/06/2018  Description du posteType de métier  Assurances  Type de contrat  Alternance / Apprentissage  Durée (en mois) 12 Date prévue de prise de fonction 03/09/2018 Poste avec management  Non  Cadre / Non Cadre  Non cadre  Missions Mettre en place un modèle, sur la base d'un score d'attrition, en utilisant les outils mis disposition : SAS, plateforme innovation (spark et hadoop sur un socle MapR). ° Etre force de proposition sur les techniques de modélisation : régressions, forêts aléatoires, réseaux de neurones, etc  ° Penser la mise en oeuvre de façon pouvoir industrialiser et automatiser le modèle (ajout ou suppression ultérieure de variables notamment)  ° Prendre en compte la dimension communication dès l'origine du projet, avec une composante data visualisation  ° Prévoir un process de backtesting Challenger les modèles et scores existant et proposer des axes d'amélioration et d'optimisation : ° En rajoutant des données externes  ° En proposant une vision géographique avec représentation dynamique  ° En les adaptant pour appliquer des méthodes de Machine Learning  ° En mettant en place du backtesting  ° En mettant en place une dimension data visualisation Imaginer et réaliser une segmentation générique de notre portefeuille client : ° Etre force de proposition sur la/les classification(s)/segmentation(s) retenir  ° Etre également force de proposition sur les méthodes utiliser Participer l'activité quotidienne de l'équipe (prendre en charge les demandes d'extractions, de ciblages et de bilans d'animations)Mission forte composante d'innovation. Une grande liberté sera laissée dans le choix des techniques, modèles et algorythmes utilisés. Rigueur et méthodologie seront donc indispensables* Localisation du posteZone géographique  Europe, France, Ile-de-France, 75 - Paris  Ville  Paris  Critères candidatNiveau d'études minimum  Bac + 4 / M1  Formation / Spécialisation  Vous préparez un diplôme de niveau master dans le domaine des Statistiques avec une spécialisation en Data Science.  Niveau d'expérience minimum  0 - 2 ans  Expérience  Vous avez idéalement une première expérience en stage.  Compétences recherchées RigueurMéthodolgieSens de l'analyseAutonomieCapacité d'adaptationRéactivitéEtre l'aise avec le traitement de données massives Vous êtes l'aise l'oral.  Outils informatiques SASOffice (avec connaissances en VBA)Programmation : Python, R, SQLDatavisualisation (QlikView)Connaissances en environnement Big Data (Spark, Hadoop)SDL2017"}