{"jobID": "2806629584", "jobLocation": "San_Francisco_CA", "jobTitle": "Associate Brand Manager", "companyRating": null, "companyInfo": {"Website": "www.hotalingandco.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Overview The Associate Brand Manager is a full-time position focused on building Hotaling & Co. brands including Nikka, Kavalan, Dingle, New Zealand Whisky Company, new potential whiskies suppliers (tbd). Organizational Alignment The Associate Brand Manager reports directly to the Marketing Director. This person will also work closely with the marketing team, the global supplier contacts and the national sales team. Job Description The Associate Brand Manager will assist the CMO, Marketing Director and Communication Director with the implementation and execution of special brand promotions and related projects, provide admin and project coordination assistance, and contribute to the development and execution of annual brand plans. This position will also play a key role as day to day supplier contact. Key ResponsibilitiesSupplier RelationsProvide exceptional customer service serving as day to day point of contact and US brand liason (email, phone, in-person meetings)Manage supplier market visit itineraries and supplier trips abroadPrepare and share quarterly QBRs and monthly performance reports Collaborate with Todd and sales department to prepare regular updates and reports on brand performanceCompile and submit monthly reports/marketing recaps to each supplierSupport with other US questions, requests, concerns and coordinationMarketing SupportContribute to the development and execution of consumer and trade marketing programs to drive growth and build brand equityDevelop KPIs to track and measure program effectiveness, ensure reasonable ROIField general customer inquiries relating to designated brandsAssist with brand budgeting, invoice coding and processing, and supplier billbacksSupport day to day brand logistics including new item/single cask launch support, allocations, and inventoryDevelop product expertise and a strong sense of market dynamics through training, market visits, and customer interactionsCommunicaitonsExecute appropriate events for each brand including education programs, bartending contests, sampling, staff trainings, experiential marketing programs, features and incentives aimed at creating brand awareness and encouraging consumer, trade, media advocacy through meaningful/memorable experiences.For events, manage external and internal staffing of events, creating event tools and POS, managing product delivery and all bar needs, and completing event recaps.Act as a Brand Ambassador for the US market; develop relationships with bartending community; gatekeepers and local market influencers. Be a brand champion and brand market expert.Collaborate with the Marketing Director and PR agency to execute the brand plan. This includes sending assets to writers & fact check as needed, manage media mailers & samples, coordinate staff & press/trade trips to suppliers, submitted products for competitions.Work with the Social Media agencies to execute the brand’s social media strategy and create and post accurate, relevant and meaningful content.Sales SupportUpdate brands on website as necessary: awards, cocktails, product info, etc.Work with local market teams to develop marketing tools, educational presentations, meaningful content, update brand guidelines.Assist in the creation of POS for brands as needed. Manage POS and sample area in SF warehouse.Distribute POS to the sales team as needed.Participate in and/or selectively lead other assigned projects important for brand or portfolio development.Education, Experience & AttitudeA bachelor’s degree required, preferably in Business and/or Marketing.Minimum of 3 years of marketing experience, 1 -2 minimum in client relations. Alcohol beverages experience a plus.Exceptional organization and attention to detail. Loves customer service and supporting key stakeholders.High tolerance for multi-tasking, flexible and thrives in a dynamic, fast-paced executional environment.Proficient in Excel, Outlook, PowerPoint and Word.Broad time commitment including some nights. Travel up to 20-30% of the time and may be on short notice."}