{"jobID": "2785658255", "jobLocation": "Chicago_IL", "jobTitle": "PRINCIPAL RESEARCH SCIENTIST- NEW BIOLOGICAL ENTITIES DEVELOPMENT", "companyRating": null, "companyInfo": {"Website": "www.kp-recruiting.com", "Headquarters": "Kansas City, MO", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview:We are looking for a highly motivated person who can lead the extended characterization of new biologics. The candidate will lead a group of motivated scientists who provide in depth characterization of new biologic development compounds and provide key data for regulatory submissions. The candidate must be able to mentor and develop staff with novel experimental approaches to answer difficult scientific questions. Candidate will work closely with analytical and formulation scientists in an integrated group and will develop productive collaborations and communications with scientific teams.Responsibilities:Lead small team in the execution and design of experiments for extended characterization of new biologics (e.g., ADCs, bispecifics and fusion proteins).Drive functional performance by designing and implementing studies aimed at new or improved biologics. Assess current and emerging business challenges enabling functional goal achievement.Advance scientific characterization of novel biologics by generating original ideas for analytical technologies and collaboration with peers and cross-functional partners.Proactively advise and share knowledge and expert opinions with subordinates, peers, and senior management. Mentor staff in troubleshooting equipment and experimental problems.Author and review key regulatory documents, peer reviewed publications, laboratory data, technical memos and reports.Demonstrate scientific excellence in the area of extended characterization of biologics internally and externally and build and foster an active network of academic and consortia collaborationsBS (16+ years); MS (14+ years) or PhD (8+ years) in Chemistry, Biochemistry, or Biology with previous work (6+ years of experience) in a pharmaceutical laboratory setting requiredExperience analyzing biologics by bottom-up and top-down MS analysis with a focus of antibody drug conjugates and/or fusion proteins (intact MS, peptide mapping, disulfide bridges, etc) preferredExperience in advanced bioanalytical techniques, such as AF4 MALS, SEC-MALS, AUC, CD, Biacore, CE, icIEF, PCS, HPLC, particle analysis (MFI, light obscuration, Archimedes, Nanosight, etc).Experience in development and application of high throughput analytical assays for biologics is preferredPrevious supervisory experience of laboratory staff required (4+ years)Statistical knowledge and experience is preferred, e.g. capability analysis, gauge R&R; and design of experiments (DOE) methodologies.Experience in ELN preferred."}