{"jobID": "2837708196", "jobLocation": "Kenilworth_NJ", "jobTitle": "Senior Scientist, Upstream Senior Scientist, Biologics Process Development and Commercialization", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck Manufacturing Division, MMD, is a team of dedicated, energetic individuals who are committed to being the most trusted supplier of pharmaceuticals and health products worldwide. Our facilities, along with our external contractors, suppliers, and partners, comprise an interdependent global manufacturing network that’s committed to delivering a compliant, reliable supply to customers and patients on time, every time, across the globe.  As part of the Merck Manufacturing Division, within Global Vaccines and Biologics Commercialization (GVBC), the Biologics Process Development and Commercialization (BPDC) department provides the technical process leadership and laboratory capabilities in support of late stage pipeline and commercial manufacturing processes for biologics (therapeutic proteins). For pipeline programs, BPDC supports various commercialization activities, including technology transfer to internal and external manufacturing sites, process validation, and authoring of regulatory submissions. For commercial programs, including but not limited to KEYTRUDA and ZINPLAVA, the scope includes site-to-site process transfers, manufacturing investigations and trend evaluations, process enhancements, next generation process (i.e., post approval) development and characterization, process validation, and regulatory submission authoring.  BPDC department is now seeking a talented individual supporting late stage and commercial biologics program activities, under the general scientific and administrative direction of the Director in Upstream Processing and working in conjunction with internal and external partners. The individual will demonstrate scientific, experimental and tech transfer skills focusing on uptream processing.  Technical Scope:  Serve as Subject Matter Expert on novel upstream processes including perfusion and continuous manufacturing.  Support upstream teams on late stage process development, characterization, technology transfer, and validation with line-of-sight for licensure and commercialization.  Collaborate with downstream, process analytics, and other functional teams in both R&D; and manufacturing to advance biologics pipeline.  Conduct laboratory-scale and/or manufacturing scale studies to support commercial process validation, characterization, and investigation evaluations, including studies performed either in-house or externally.  Author required regulatory and technical documentation. Ensure that process/product are developed and documented according to standard Merck practices. Qualifications Education Minimum Requirement:  PhD in Chemical Engineering, Biological Engineering, Biochemistry, Cell Biology, or related biological/engineering sciences or a MS with a minimum of 4 years of experience or a BS with a minimum of 6 years of experience. Required Experience and Skills: Excellent scientific understanding of cell biology and engineering principles for recombinant protein production with mammalian cell culture.  Solid hands-on experience in upstream process development and commercialization, including activities such as medium and process optimization, scale-down model qualification, process characterization, scale-up, and technology transfer.  Solid hands-on experience with advanced statistical and computational tools (e.g. Design of Experiments, multivariate data analysis, etc). Preferred Experience and Skills: Experience in development and commercialization of perfusion based processes and continuous manufacturing  Hands-on experience in applying innovative tools such as PAT (Raman, NIR, capacitance probes etc), soft sensors, and process modelling for biologics manufacture and commercialization.  Experience with applying Systems Biology tools (e.g. transcriptomics, metabolomics, proteomics, and other -omics approaches) to understand cell biology and metabolism.  Strong communication and collaboration skills, passion for scientific excellence, and capability to deliver complex objectives under compressed timelines.  Experience authoring CMC sections of IND/BLA/MAA and other regulatory documents.  Solid track record of scientific contributions and project accomplishments, with ability to deliver high quality presentations/publications"}