{"jobID": "2658431072", "jobLocation": "Detroit_MI", "jobTitle": "Copywriter", "companyRating": "3.2", "companyInfo": {"Website": "www.cw-mccann.com", "Headquarters": "Detroit, MI", "Size": "501 to 1000 employees", "Founded": " 2012", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Your user session will timeout in 5 minutes. Please click OK to continue with your application.Copywriter, Commonwealth//McCannTracking Code  3338-094  Job DescriptionAbout the Role: Commonwealth is seeking a Copywriter. The first job of a Copywriter is to have ideas, to see the world in a new way, and to share that unique vision with consumers in a way that they immediately understand.  We expect that this Copywriter will provide inspiration and leadership for their entire Creative Department, and be the trusted consultant on any matters of language arising in the Agency. This role requires the ability to devise original, strategically sound and persuasive copy that is in line with client-approved direction, working with art resources where appropriate.Required SkillsResponsibilities:Attends briefing sessions and discuss Brand, Selling Strategy and purpose of the brief with the appropriate members of the brand/project management teamsReviews incoming job starts, creative briefs and other forms of project initiation to make sure the team has all the right information and sufficient time (whenever possible) required for the creative team to deliver the best creative solution possible for each client assignmentWhere necessary, challenges preconceptions and propose alternative approaches or solutions where these will more effectively achieve the objectives identified in the briefWorks with an Art Director, the Creative Director (or alone, if necessary) to create appropriate conceptsProvides writing support and expertise on a wide variety of mediaWrite-ups of creative concepts for presentation to clients and internal teamsCreates a team environment that facilitates:"}