{"jobID": "2776665680", "jobLocation": "Annapolis_Junction_MD", "jobTitle": "Systems Engineer - TS/SCI Required", "companyRating": null, "companyInfo": {"Website": "www.synergistcomputing.com", "Headquarters": "Annapolis Junction, MD", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " As a Systems Engineer at Synergist, you will serve as a critical member of an agile software development team where you will be responsible for various aspects of the systems engineering life cycle. Primarily, you will act as a liaison between stakeholders and development team where you will analyze customer needs, concept of operations documents, and high-level system architectures to develop system requirements specifications. You will also assist customers in validating those requirements, advising them of alternative approaches, and conducts feasibility studies when necessary. You may also be required to lead design and development activities and serve as the Scrum Master for the team. Additionally, you will be responsible for guiding system development and implementation planning through the preparation of engineering and system integration and test plans.**Position Requires a Top Secret Clearance with a Full-Scope Polygraph**Degree and Years of ExperienceBachelor’s degree in a technical field of study and five (5) to ten (10) or more years of experience. An additional four to five (4-5) years of equivalent practical experience may be substituted for the Bachelor’s degree.ResponsibilitiesBe an active contributor on an Agile Software development team to deliver custom solutions to the customer.Analyze user requirements, concept of operations documents, and high-level system architectures to develop system requirements specifications.Analyze system requirements and leads design and development activities.Guide users in formulating requirements, advises alternative approaches, and conducts feasibility studies.Provide technical leadership for the integration of requirements, design, and technology.Incorporate new plans, designs and systems into ongoing operations.Develop technical, system architecture and system design documentation.Guide system development and implementation planning through assessment of preparation of system engineering management plans and system integration and test plans.Interact with stakeholders and end users regarding System Engineering technical considerations and associated problems, issues or conflicts.Communicate with other program personnel, stakeholders and users.May supervise or manage a team of Systems Engineers.Minimum Qualifications:Must be U.S. Citizen.Experience performing and providing technical direction for the development, engineering, interfacing, integration, and testing of complex hardware/software systems to include requirements elicitation, analysis and functional allocation, conducting systems requirements reviews, developing concepts of operation and interface standards, developing system architectures, and performing technical/non-technical assessment and management as well as end-to-end flow analysis.Experience leading, providing technical supervision, and guiding mid-level engineering personnel; solving varied technical/scientific problems; and generating and reviewing designs for technical accuracy, completeness and appropriateness in light of objectives, budget, and schedule.Excellent communication, customer service and organizational skills.Passion for technology and the drive to learn.Desired Qualifications:We realize that we are about to enumerate a bunch of skills and experience here. Don’t worry if you don’t have all of these, but we’d like you to have touched some of these technologies or concepts or at least be familiar with them.Experience with the development process of collection systems and/or related components.Experience in requirements analysis/generation and developing systems architectures.Experience as a system engineer in programs that encompass systems architecture, requirements analysis, design, production, integration, test and transition into operations.Experience with independent verification and validation of system requirements.Computer/system architectures design and development for Linux and WindowsExperience with Agile Development methodologies such as Scrum.Experience with real-time processing, computing, control and digital signal processing.Direct experience with electrical power measurement and specification (AC and DC).Direct experience specifying, evaluating, installing and maintaining equipment.Experience writing systems documentation (system CONOPs and other technical documents).Developing system performance, availability, scalability, manageability, and security requirements for mid-to-large scale programs.Developing documentation required to support a program’s technical issues and training situations.Performing a variety of tasks related to knowledge/technique dissemination to groups of analytic workforce and demonstrated an ability to convey new techniques and technologies to analytic workforce and facilitate transference of acquired knowledge from more experienced analysts to new analysts.Assisting with the infusion of emerging technologies emanating from universities, research organizations, and small businesses to include both classified and open source activities.Experienced in analytical environments/intelligence production organizations.Applying agile and/or spiral development models.Integrating information systems into SOA or on to ESB architectures.Experienced “wrapping” legacy systems or components as Web Services within a SOA framework.Developing solutions integrating and extending COTS products.Integrating FOSS, COTS and GOTS products from multiple vendors.Experienced implementing solutions with PKI-controlled access.Developing and deploying integrated desktop applications.Incorporating collaboration services into an integrated desktop environment.Designing and developing applications that contain a user-facing view component. -- Know anyone who may be interested in working at Synergist? Refer them and receive a substantial referral bonus! Visit us at https://synergistcomputing.com/referral"}