{"jobID": "2825807714", "jobLocation": "Santa_Clara_CA", "jobTitle": "Experimentation Scientist - Maps", "companyRating": null, "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": null, "jobDescription": "Experimentation Scientist - Maps Job Number: 113947609Santa Clara Valley, California, United StatesPosted: Jun. 23, 2018Weekly Hours: 40.00 Job SummaryApple Maps Evaluation team is looking for world-class experimentalists to join the team focused on experiment design and analysis, as well as alternative exploratory analysis strategies, using logs and human judgment. This group is responsible for building better tools and processes to push for fast, accurate, informative experimentation to drive product decisions for maps. Specifically, this team works to improve experimentation at Apple by building a better platform, improving process, developing innovative approaches to metrics and analysis, and continuous education of platform users. Our goal with respect to experimentation is to make it easy to deploy well-designed, impactful experiments, monitor them while they’re running, and ensure solid analysis and trustworthy product decisions made in timely manner. In addition we engage in exploratory analysis to find opportunities for improvements, and understand long and short term trends in maps usage.  We're looking for a talented and passionate person to join this amazing team, if you feel this is you, we'd love to hear from youKey Qualifications A key focus of your background has been involved with evaluation methodology, including experimental design.You may have experience with inferential statistics, though understanding predictive modeling and bayesian approaches is a plus.Experience delivering, scaling, and owning highly successful and innovative experiments and data science productsYou possess expert knowledge of SQL and at least one statistical scripting language (R or Python), experience with Java and/or Scala.Experience with big data using technologies like Hadoop, Hive, and Spark.Experience with a variety of relevant data manipulation languages (Python, R, SQL).Experience with data visualization tools and best practices is highly desirableGreat communication skills, oral, written and presentation skills are essential.Ability to translate hard product goals and business problems into data science problemsYou have exceptional analytical ability, enjoys troubleshooting and problem solvingYou are pragmatic, adapt well to changing priorities and changing circumstances, work collaboratively with others DescriptionDesign experiments to evaluate maps services and features.  Develop statistical models/analysis and apply them to solving real-world problems.  Partner with Software Engineering and Product Management teams to build internal infrastructure and programs to drive data-driven decision-making and hypothesis generation.  Communicate with product teams and turn hard and abstract into simple and approachable.  Define and validate critical metrics for experimentation and services impact on business.  Collaborate across teams to design metrics and drive intuitive, actionable and trustworthy dashboards for every aspect of experiment or exploratory analysis and reporting.  Influence the product teams through data driven recommendations and education efforts.  Automate analysis and pipelines via SQL and python based ETL frameworks.EducationA graduate degree or equivalent in applied statistics, experimental science (e.g., biology, social science, economics, physics, neuroscience), computer science or a quantitative domain."}