{"jobID": "2689794853", "jobLocation": "Saint_Joseph_MI", "jobTitle": "RN - Hospice Residence", "companyRating": null, "companyInfo": {"Website": "www.lakelandhealth.org", "Headquarters": "Saint Joseph, MI", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Responsibilities:The RN is responsible for assessing, planning, implementing, coordinating, monitoring and evaluating the strategies and services required to meet the patients/family's end-of-life care needs.An outcome based plan of care is created and continually adjusted through utilization of the nursing process, relationship centered care principles, and holistic philosophy, assuring that the changing needs of the patient/family are met while facilitating a pain-free, peaceful, sacred death.Develops a comprehensive plan of care that addresses physical, emotional, cultural and spiritual needs of the patient/family with input from the patient/family and the interdisciplinary team.Administers and documents medications/treatments as ordered by the physician according to policies in an accurate and timely manner.Exhibits willingness and flexibility to work weekends and extended shifts when needed.Requirements: Basic reading, writing, understanding and ability to speak the English language and skills normally acquired through graduation from high school or successful completion of a G.E.D. program.Current licensure in the State of Michigan as a Registered Nurse required.Certification in hospice and palliative care preferred.Minimum one year nursing experience required, preferably in hospice or related field. Experience with dying patients and their families.Requires the ability to lift up to 50 pounds, stand, walk, push, stoop, kneel.Computer literacy.Driver's license preferred.Current CPR Certification.Successfully pass Food Handlers Training."}