{"jobID": "2738187195", "jobLocation": "Covina_CA", "jobTitle": "Data Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.zenith-american.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "56000", "jobDescription": "Position Summary: Member of the CASA/ISSI Development team responsible for collecting and analyzing data running various queries/calculations to determine validity of the data received. This includes primary engagement in data analysis for the purpose of risk assessment, data interpretation and business decision guidance and process improvement. General Duties:Collaborates with the internal team to successfully perform data analysis for assigned projectsConsults with functional unit management and personnel to identify, define and document business needs and objectives, current operational procedures, problems and input/output requirements.Proactively communicate and collaborate with external and internal customers and team to analyze information needs and functional requirements and deliver the following artifacts as needed: Data Analysis reports, Functional requirements, Business Requirements Document, Client and Client Service Data Requirements.Analyzes the feasibility of, and develops requirements for, new systems and enhancements to existing systems; ensures the system design fits the needs of the users.Tracks and fully documents changes for functional and business specifications; writes detailed universally understood procedures for permanent records and use in training.Identifies opportunities for improving business processes through information systems and/or non-system driver changes; assists in the preparation of proposals to develop new systems and/or operational changes.Provides technical assistance in training, mentoring, and coaching staff.Successfully engage in multiple initiatives simultaneously.Perform other related duties and special projects asMinimum Qualifications:Strong decision-making and organizational skills, with the ability to optimize the use of all available resources and deliver on multipleProficiency with MS Excel, Word, and PowerPoint.1-2 years working knowledge of MS SQL in writing queries, creating stored procedures, functions, and views.Good data analysis skillsExperience loading files into SQL tables from flat files or excel spreadsheets using import server wizard or bulk load query.Ability to interpret flat file layouts to create SQL tables from those layoutsAbility to design database tablesCollege degree or equivalent work experiencePreferred but not required:Knowledge of the TPA IndustryPrevious experience in SSIS (SQL Server ETL tool) for creating automated packages for loading conversion data filesPrevious experience in SSRS (SQL Server reporting tool) design and create reportsZenith American SolutionsReal People. Real Solutions. National Reach. Local Expertise. We are currently looking for a dedicated, energetic Data Analyst with the necessary skills, initiative, and personality, along with the desire to get the most out of their working life, to help us be our best every day.  Zenith American Solutions is the largest independent Third Party Administrator in the United States and currently operates over 44 offices nationwide. The original entity of Zenith American has been in business since 1944. Our company was formed as the result of a merger between Zenith Administrators and American Benefit Plan Administrators in 2011. By combining resources, best practices and scale, the new organization is even stronger and better than before.  We believe the best way to realize our better systems for better service philosophy is to hire the best employees. We're always looking for talented individuals who share our dedication to high-quality work, exceptional service and mutual respect. If you're interested in working in an environment where people - employees and clients - really matter, consider bringing your talents to Zenith American!  We realize the importance a comprehensive benefits program to our employees and their families. As part of our total compensation package, we offer an array of benefits including health, vision, and dental coverage, a retirement savings 401(k) plan with company match, paid time off (PTO), great opportunities for growth, and much, much more!Job Posted by ApplicantPro"}