{"jobID": "2801131283", "jobLocation": "Parsippany_NJ", "jobTitle": "Data Architect", "companyRating": "3.6", "companyInfo": {"Website": "www.guard.com", "Headquarters": "Wilkes Barre, PA", "Size": "201 to 500 employees", "Founded": " 1982", "Type": " Subsidiary or Business Segment", "Industry": " Insurance", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " Overview  We are looking for a data architect interested in working for a dynamic, fast paced organization. You will build, optimize and maintain conceptual and logical database models.  In this role, you should know how to analyze system requirements and implement migration methods for existing data. Hands-on experience with SQL is also required. Ideally, you are familiar with predictive analysis and data visualization techniques using relevant tools (e.g. Tableau, D3.js and R.). You should be a team player and excellent communicator. If you are passionate about data architecture and have commercial property and casualty insurance experience, we'd like to have a conversation with you.  Your goal will be to develop database solutions to ensure company information is stored effectively and securely.  Our team operates as a start-up under the Berkshire Hathaway organization. We follow an agile workflow with an emphasis on continual improvement and communication. ResponsibilitiesDevelop database solutions to store and retrieve company informationInstall and configure information systems to ensure functionalityAnalyze structural requirements for new software and applicationsMigrate data from legacy systems to new solutionsDesign conceptual and logical data models and flowchartsImprove system performance by conducting tests, troubleshooting and integrating new elementsOptimize new and current database systemsDefine security and backup proceduresCoordinate with the business analysts to identify future needs and requirementsProvide operational support for Management Information Systems (MIS)Qualifications3+ Years of experience as a Data Architect, Data Scientist, Data Analyst or similar role with a Commercial Property & Casualty Insurance companyIn-depth understanding of database structure principlesExperience gathering and analyzing system requirementsKnowledge of data mining and segmentation techniquesExpertise in Microsoft SQL and proficiency in MS ExcelFamiliarity with data visualization tools (e.g. Tableau, D3.js and R)Proven analytical skillsProblem-solving attitudeUnderstanding of Agile methodologiesBS/BA in Computer Science or a related field is preferredCommercial Property & Casualty Insurance experience is also preferredSDL2017"}