{"jobID": "2816600833", "jobLocation": "Washington_DC", "jobTitle": "Lead Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.sehlkeconsulting.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "CLEARANCE: DoD Secret ***Must hold an active DoD Secret, or above, clearance upon initial consideration.*** REQUISITION NUMBER: 061418.02-N15 FUNCTIONAL / LABOR CATEGORY: Lead Data Analyst/Programmer POSITION TITLE: Subject Matter Expert I/II LOCATION: Arlington, Virginia DESCRIPTION: Sehlke Consulting is supporting Navy Medicine’s upcoming General Ledger system transformation. We are currently seeking a qualified Lead Data Analyst to assist in the assessment of these systems and in the preparation for development of future implementation activities. EDUCATION: Bachelor’s Degree in Analytics, Statistics, Database Management, Computer Science, Programming, or other analytical or programming field. EXPERIENCE:Five (5) years of experience applying technical and management systems analysis methods to define and develop solutions to complex problems in processes and focus areas.In depth understanding of data analytics, statistical modeling, simulation modeling, spreadsheet modeling, and dashboard development.Demonstrated ability to simultaneously manage several different analytic projects.Experience in directing data analysts on several projects, defining project analysis plans, offering alternate methods of analysis, and providing expertise when needed. LABOR CATEGORY DUTIES / RESPONSIBILITIES:Assists in determining technical project objectives and selecting or performing conceptual and methodological design for the execution of the project.Assists in the design, development, and technical execution of projects in conjunction with the Project Manager.Apply technical and management systems analysis methods to define and develop solutions to complex consultative and/or acquisition problems and issues.Provide expertise in simulation modeling, dashboard development, spreadsheet modeling, and statistics.Conduct analysis of electronic data captured for the hospital or other data systems.Analysis will be used to define current state of operations, impacts of future state improvements, and representation of information for decision makers.Develop dashboard metrics and interfaces that meet the needs of the stakeholders. DESIRED:Experience with healthcare analytics preferred.SharePoint knowledge.  Founded in 2011, Sehlke Consulting is a rapidly-growing Service-Disabled Veteran-Owned Small Business (SDVOSB) and Historically Underutilized Business Zone (HUBZone) headquartered in Arlington, VA – an Equal Opportunity Employer that values the strength diversity brings into the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply."}