{"jobID": "2697513079", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Warehouse Architect", "companyRating": null, "companyInfo": {"Website": "www.ziprecruiter.com", "Headquarters": "Santa Monica, CA", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DATA WAREHOUSE ARCHITECT As Data Warehouse Architect, you'll support the needs of teams while being an expert on data architecture and operations. Key ResponsibilitiesUnderstand our business domain as it relates to our data warehouse needs and guide our data architecture towards supporting those needsOwn the architecture of the companys data warehouse platform, and provide architectural solutions covering data structures, integration, security, and retentionDesign, implement and support the Data Warehouse development effortsCraft top quality ETL processes, scales by monitoring, maintaining, and optimizing performance and scheduling of ETL processes; when stuff breaks, you'll be there to troubleshoot and fix itMigrate legacy systems to new or upgraded processes and technologiesConduct data model reviews with project team members, and provide guidance and direction to team members as well other teams in the organizationBuild cross functional relationships with Analytics, Data Scientists and Software Engineers to understand data needs and deliver on those needsQualifications10+ years of intense technical experience in the areas of data architecture, data modeling, data management, data engineering and data governanceStrong background in master data management, metadata management, information life cycle design and developmentUnderstands the range of options and best practices for common ETL design techniques such as schema evolution and optimizationVery comfortable with Python/Scala/Go/Java, SQL, AWS technology environmentsExperience working with Hadoop Hive/Pig/Presto, Spark, Spark SQL, MySQL, or distributed/MPP database products such as Redshift and VerticaExperience with BI tools such as Tableau, SiSense, MicroStrategy and ZoomDataAbility to work well with people from many different disciplines with varying degrees of technical experienceBenefits/Perks include:A fun work environmentOpportunities for advancement as our young company growsCompetitive salaryGenerous bonus planEmployer-matched 401(k) planCompetitive benefits packageHealthy snacksLocal gym discountAttractive paid time off policy - Open/Flexible vacation policyAbout ZipRecruiter: ZipRecruiter is the fastest growing employment marketplace. We have helped over 1 million businesses and 100 million job seekers find their next perfect match through partnerships with the best job boards on the web, curated email alerts, award-winning mobile apps, and the worlds best search algorithm for jobs.  ZipRecruiter is an equal opportunity employer (M/F/D/V). All applicants must be authorized to work in the U.S. This organization uses E-Verify.  Category: Computer/Software"}