{"jobID": "2722583744", "jobLocation": "Chicago_IL", "jobTitle": "Senior Scientist Technical Operations , Manufacturing Science and Technology", "companyRating": "3.0", "companyInfo": {"Website": "www.adellobio.com", "Headquarters": "Piscataway, NJ", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "109000", "jobDescription": " OverviewAdello Biologics is a privately held, U.S.-based biotechnology company that leads with science to accelerate development and drive manufacturing efficiency. The company's aim is to provide high-quality, affordable biosimilars to patients worldwide. Headquartered in Piscataway, NJ and driven by a team of highly skilled industry veterans, Adello is advancing a strategic pipeline of proteins and complex monoclonal antibodies with lead candidates in oncology and immunology. For more information, visit www.Adellobio.com  Our vision is to make biosimilar medications affordable. We are seeking candidates interested in contributing to a bourgeoning field that has the potential to help millions of patients. As a growing company, Adello Biologics offers real development opportunities for candidates excited to take on responsibility, make an immediate impact and help us achieve our vision. As part of a close knit team, you’ll have the opportunity to work in a unique, high science industry while expanding your career. We are seeking a Senior Scientist Technical Operations , Manufacturing Science and Technology to be based out of our Chicago, IL location.ResponsibilitiesSUMMARY:The role of Manufacturing Science and Technology (MS&T;) is to ensure sustainability, control and constant state of validation of our products across their life-cycle. It is accountable for introducing and transferring technology in close collaboration with Development, Quality and Production, reducing process variability of products in production with a strong focus on process understanding.  The Senior Scientist Technical Operations in Manufacturing Science and Technology will ensure optimal Adello Biologics manufacturing processes, enabling full-scale manufacturing and providing technical support and evaluation of potential post launch process improvements. This role also facilitates use of best practice in handling discrepancy and investigation resolutions, equipment and process validations, training on new process technologies and on significant changes to manufacturing procedures.  ESSENTIAL DUTIES AND RESPONSIBILITIES: Provide technical support for equipment and process validation activities, process overview training to support implementation of new process technologies, and process specifications to support defining the scope of capital projects. Execute change management and implementation for tech transfers and changes to the manufacturing processes and associated systems, provide training on major changes to processes, equipment and documentation Write technical reports summarizing results, generating necessary data to support product impact assessments during discrepancy and investigation. Provide support for: discrepancy and investigation resolution, equipment and process validation activities, training on new process technologies and on significant changes to manufacturing procedures.QualificationsPREREQUISITES:Education & Experience: BS, MS, or PhD, in chemical, biochemical sciences or engineering discipline. BS 15+ years (or MS with 10+ years or Ph.D with 8+ years) in a biotechnology processes at manufacturing scale for protein therapeutics.  SPECIALIZED KNOWLEDGE AND SKILLS: Bioprocess development and operational experience, including process scale-up, scale-down, characterization, optimization, technology transfer, investigation, and improvement. Working knowledge and experience in implementing QbD principles and approaches, including risk assessment, statistical-based DOEs, late phase process characterization, and internal and external technology transfer. Experience executing analytics to support clinical and/or commercial manufacturing of biologics drug substance, drug product, device, and associated troubleshooting or process optimization. Requires strong verbal and written communication, project planning and problem solving skills. Experience leading cross-functional project teams. Experience with FDA audits and participation in BLA submissions is desirable.  WORKING ENVIRONMENT/PHYSICAL REQUIREMENTS:General Work Environment: General office environment. May be required to work in or walk through laboratory settings.Noise: No extraordinary noise levels.Standing/Lifting: Must be able to walk to and through manufacturing cleanroom settings. Must be able to life at least 25 lbs.Visual: No extraordinary requirements.Stress: High-paced demanding environment to meet ambitious project goals.Travel: Occasional travel to manufacturing sites.  Adello Biologics, LLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Adello Biologics, LLC complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, and transfer, leaves of absence, compensation and training. Notice To Agency And Search Firm Representatives Adello Biologics is not accepting unsolicited resumes from agencies and/or search firms for this job posting. Resumes submitted to any Adello employee by a third party agency and/or search firm without a valid written & signed search agreement, will become the sole property of Adello. No fee will be paid if a candidate is hired for this position as a result of an unsolicited agency or search firm referral. Thank you."}