{"jobID": "2777612129", "jobLocation": "Chicago_IL", "jobTitle": "Data Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.risingms.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Rising Medical Solutions has an opening for aSr. Data Engineer to work on claims and insurance data processing, and we want to hear from you! We're a bill review and cost containment company - so what does that mean? Basically we are trying to fix a very broken healthcare system by reducing the cost of healthcare claims through bill review, case management, and utilization review. Our mission is \"To protect the health of healthcare\" and everyone here at Rising works hard to achieve this goal. So take a look at the job, let us know what you think, and let's start working towards a better future!What you'll be doingProvide data and SQL expertise to business teams and analysts.Understand how to apply data to bring clarity and understanding to existing business processes.Design, develop, and implement data processing pipelines at scale to support modeling, reporting, and analytical needs of the company.Write scripts in Python to help manage the data transformation process.Create dashboards in Tableau.Track, diagnose, and repair advanced defects related to existing analytics scripts and applications.Participate in design and code reviews.Lead the development of technical specifications and other required documentation.Research, test, and apply new technologies in order to improve systems and processes.Provides use cases and cost justifications for new technologies when necessary.Be the SME for one end to end big data solution that meets key business objectives.Works closely with team managers/leadership to review business cases and plans for new products and solutions.Provides input into project plans and timelines.RequirementsAt least five years SQL query writing.Minimum 3-5 years of experience with Python script development.Minimum 3-5 years of experience with data modeling.Minimum 1-2 years of experience with BI self-service tools (Tableau, Power BI, QlikView or others)Minimum 1-2 years in role as a team lead, or manager.Very Strong experience working in SQL and relational database management systemsStrong knowledge and experience with PythonMust have understanding of data structures and data warehouse architecture. Familiarity with data lake architecture a plus.Must have exposure to developing in Amazon Web Services (AWS) or another cloud environment.Hadoop / MapReduce or Apache Spark experience a huge plusStatistical programming / visualization experience a plus.BenefitsBeer, soft drinks, and food on Friday afternoonsGenerous Flexible Time Off (take it when you need it!)Competitive base salary, profit sharing, 401k matching, and benefitsA relaxed, yet upbeat, work environment, with a jeans professional dress codeCareer Growth Opportunities - Often promote from withinAwesome downtown location in River NorthClose to public transit"}