{"jobID": "2834891909", "jobLocation": "Houston_TX", "jobTitle": "Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.edftrading.com", "Headquarters": "London, United Kingdom", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "119000", "jobDescription": "Job title: Data ScientistReports to: Head of Power TradingCompany Description EDF Trading North America is a major participant in wholesale energy markets. We operate in every market and provide coast to coast coverage of financial and physical products in power, natural gas and NGLs, environmental products and financial crude oil products. We provide our customers with products and services that deliver access to markets, optimize their energy portfolio, hedge risk and manage assets. EDF Trading operates throughout the value chain in the North American wholesale power markets and we are one of the leading wholesale natural gas marketers. Additionally, we provide environmental, congestion management and value added derivative products. With extensive pipeline agreements, we can manage natural gas offtakes, deliveries, capacities and supply anywhere across the continent. For EDF Energy Services we provide wholesale fuel supply and structured products for its extensive base of electricity and natural gas customers including gas-fired power plants, large scale commercial and industrial retail consumers and retail energy aggregators.  EDF Energy Services is our customer-facing operation providing integrated energy management services to commercial and industrial, power generation, and retail supply customers. Taking into account a customer’s entire energy portfolio, solutions are structured to provide competitive market pricing and to optimize energy usage and generation assets. We offer a complete suite of services to energy-intensive retail customers, from energy supply and hedging to on-site generation management and demand response. And we provide wholesale market access and ISO interface services to a broad network of retail energy providers with footprints across the deregulated markets. For power generation customers, we provide energy management services that encompass fuel supply, scheduling, dispatch, market analysis and risk management all within a single contract. Focused on service, we created a digital integrated platform and customer interface that allows transparent views into energy portfolios and invoices, market prices, analytics and weather.  EDF Trading North America and EDF Energy Services are part of the EDF Group, a global leader in low-carbon energies. Job Summary The primary responsibilities of the Data Scientist include trading application development and support, quantitative modeling, development of data platform, and building tools and reports to facilitate the desk’s data-driven approach to analysis. This position reports directly to the Head of Power Trading. ResponsibilitiesWork closely with on-desk developer to build and support trading applicationsWork with trading desk to support data-driven statistical and fundamental analysisDevelop tools necessary for exploratory data analysis, data validation, and data imputationSupport implementation of machine-learning techniques into tradingTransform and mutate large datasets to create more informative variablesDesign platform to rapidly iterate, tune, and ensemble to optimize model performanceCommunicate model results, uncertainty, and probabilities through well designed visualizationsProvide ad-hoc analysis to trading desk and management teamDevelop and support commercial analytics applications used by trading deskRequirements& QualificationsBachelor’s Degree in Computer Science, Engineering or Mathematics. Masters or PhD preferred.Proficient in SQL and R, Python, or Matlab. Willingness to learn new languages as necessary.Object oriented programming skills with emphasis on numerical methodsGood communication skillsAbility to thrive in time sensitive environmentWork on quantitative projects preferableExperience in a market-facing environment preferableNote: EDF is an EEO employerWe are an equal opportunity employer and all qualified candidates will receive consideration for all positions without regard to race, color, age, religion, sex (including pregnancy), sexual orientation, gender identity, national origin, veteran status, disability, genetic information, or any other characteristic protected by law.EDF participates in the E-Verify Employment Verification Program.EDF is not currently accepting unsolicited resumes from search firms. Regardless of past practice, all resumes submitted by search firms to any employee at EDF via-email, the Internet or directly to hiring managers at EDF in any form without a valid written agreement in place for that specific position will be deemed the sole property of EDF. As a result, no fee will be paid in the event the candidate is hired by EDF."}