{"jobID": "2659925478", "jobLocation": "Carlsbad_CA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "106000", "jobDescription": " Job DescriptionWhen you join us at Thermo Fisher Scientific, youll be part of a smart, driven team that shares your passion for exploration and discovery. With revenues of $20 billion and the largest investment in R&D; in the industry, we give our people the resources and opportunities to make significant contributions to the world.  Do you want be a part of the journey of building smart connected lab solutions for Thermo Fisher Scientific products? Do you have a unique combination of deep technical knowledge, business acumen and strong interpersonal skills? Thermo Fisher Scientific is looking for an IoT Data Scientist accountable for the IoT Data Science platform. IoT connectivity service across multiple business verticals within Thermo Fisher Scientific.  At Thermo Fisher Scientific we want to make science easier with connected ecosystems & digital science innovations. The candidate will be spear heading the data science of the connected solution that can make the vision possible.  BASIC QUALIFICATIONS A Bachelor or Masters Degree in a highly quantitative field (Computer Science, Machine Learning, Operational Research, Statistics, Mathematics, etc.) or equivalent experience7+ years of industry experience in predictive modeling, data science and analysisPrevious experience in a ML or data scientist role and a track record of building ML or DL modelsExperience using Python and/or RKnowledge of SparkMLAble to write production level code, which is well-written and explainableExperience handling terabyte size datasetsTrack record of diving into data to discover hidden patternsFamiliarity with using data visualization toolsPast and current experience writing and speaking about complex technical concepts to broad audiences in a simplified formatExperience giving data presentationsStrong written and verbal communication skills PREFERRED QUALIFICATIONS PhD in a highly quantitative field (Computer Science, Machine Learning, Operational Research, Statistics, Mathematics, etc.)8+ years of industry experience in predictive modeling and analysisGood skills with programming languages, such as Java or C/C++Ability to develop experimental and analytic plans for data modeling processes, use of strong baselines, ability to accurately determine cause and effect relationsConsulting experience and track record of helping customers with their AI needsPublications or presentation in recognized Machine Learning, Deep Learning and Data Mining journals/conferencesExperience with AWS technologies like Redshift, S3, EC2, Data Pipeline, & EMRCombination of deep technical skills and business savvy enough to interface with all levels and disciplines within our customers organizationDemonstrable track record of dealing well with ambiguity, prioritizing needs, and delivering results in a dynamic environment Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}