{"jobID": "2628147603", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.jd.com", "Headquarters": "Beijing, China", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (JD) ", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JD.COM is looking for an exceptional self-motivated data scientist to join our Y Business Unit (JD-Y) in JD.COM Silicon Valley R&D; Center. JD-Y owns the technology platform that drives one of the largest supply chain and fulfillment networks in the world. As a data scientist, you will be able to work with the data generated by hundreds of millions of JD.COMs active users and your work will directly influence critical operations of the multi-billion dollar business such as inventory management, dynamic pricing, product selection, vendor management and more. Responsibilities: Work with business, engineer and product management teams to form understandings of the requirements and processes of existing systems. Apply data mining, quantitative analysis and visualization techniques to exam existing business status and identify opportunities for improvements. Analyze and validate real-world data, work with engineer and product management teams to design solutions to improve data quality. Build predictive models and machine learning models to provide business insights.Qualifications: Master or Ph.D. degree in Computer Science, Operational Research, Statistics, Mathematics or related field. 3+ years of hands-on experience with large scale data platforms such as Hadoop and Hive. Extensive experience with data manipulation and analysis using SQL. Development experience in scripting languages such as Python. Experience with statistical software such as R. Ability to communicate the analysis results with the leadership teams to influence the strategy of product and business development. Excellent written and oral communication skills.About JD-Y team JD Y Business Unit (JD-Y) focuses on building a smart supply chain and using AI to drive retail reform. JD-Y applies AI algorithm and use data-driven approaches in product selection, inventory management, pricing and promotion. It also leverage big data technologies in smart retail to lower the costs of distribution. JD-Y is working with leaders in industry and academia to design and build the next generation supply chain management system. JD.com is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class."}