{"jobID": "2783842943", "jobLocation": "Berkeley_CA", "jobTitle": "Research Data Analyst (6256U", "companyRating": "4.1", "companyInfo": {"Website": "www.universityofcalifornia.edu", "Headquarters": "Oakland, CA", "Size": "10000+ employees", "Founded": " 1868", "Type": " College / University", "Industry": " Education", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " The University of California, Berkeley, is one of the world's most iconic teaching and research institutions. Since 1868, Berkeley has fueled a perpetual renaissance, generating unparalleled intellectual, economic and social value in California, the United States and the world. Berkeley's culture of openness, freedom and acceptanceacademic and artistic, political and culturalmake it a very special place for students, faculty and staff.  Berkeley is committed to hiring and developing staff who want to work in a high performing culture that supports the outstanding work of our faculty and students. In deciding whether to apply for a staff position at Berkeley, candidates are strongly encouraged to consider the alignment of the Berkeley Workplace Culture with their potential for success at http://jobs.berkeley.edu/why-berkeley.html.  Application Review Date  The First Review Date for this job is: May 14, 2018  Departmental Overview  The Haas School of Business develops path bending leaders - individuals who redefine how we do business. Berkeley-Haas, the second oldest business school in the United States, educates 2,200 students each year in six degree-granting programs, and hundreds more through executive education programs. A team of 300 staff members support these students, faculty and alumni through work in areas that include Admissions, Student Services, Career Management, Administration, Development and Alumni Relations.  Berkeley-Haas offers opportunities to champion new ideas, collaborate across boundaries, and learn continually. Our culture is captured by Four Defining Principles (Question the Status Quo, Confidence Without Attitude, Students Always and Beyond Yourself) that distinguish Berkeley-Haas as a place to learnand a place to work.  To learn more about the Haas School visit: http://www.haas.berkeley.edu/haas/about/employment.html Responsibilities Job Announcement: Full-Time Research Analyst  We are looking for a highly skilled and driven individual to work as a full-time Economics Research Analyst for one to three years. The start date is subject to negotiation and may be as early as July 2018 or as late as May 2019. The job will entail close collaboration during all stages of empirical research with Professor Reed Walker and co-authors at UC Berkeley, Princeton, and Yale. Current projects are focused on areas of energy and environmental economics -- exploring the social costs of environmental externalities such as air pollution and how regulations to limit these externalities contribute to gains and/or losses to the economy.  Job responsibilities span all stages of research, including managing projects, collecting and analyzing data, creating presentations, and editing manuscripts. Typical research projects involve the analysis of confidential, administrative environmental and energy data from the United States Census Bureau. Independent thinking, attention to detail, a thorough understanding of economics, and self-motivation are highly valued in performing these functions.  Required Qualifications  BA/BS (or equivalent of experience) in Economics, Statistics, Mathematics, Computer Science or another closely related discipline; previous experience as a research analyst or pursing independent research is preferred; computer-programming skills are necessary; ability to analyze data and write reports required.  The job is ideal for someone with an enthusiasm for empirical research, and the ability and interest to learn new skills and take initiative as a project develops. We welcome candidates with strong technical backgrounds who are looking for more exposure to economics.  Preferred Qualifications  Preference will be given to candidates who aim to broaden their research experience before pursuing a graduate degree in economics  Salary & Benefits  For information on the comprehensive benefits package offered by the University visit:  http://ucnet.universityofcalifornia.edu/compensation-and-benefits/index.html  How to Apply Apply online at http://jobs.berkeley.edu/ (Job ID# 24880)Applications will be reviewed as they are received. This posting will be removed when the position has been filled. Other Information  This is a contract appointment with a duration of 2 years with the possibility of an extension.  Equal Employment Opportunity  The University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. For more information about your rights as an applicant see: http://www.eeoc.gov/employers/upload/poster_screen_reader_optimized.pdf  For the complete University of California nondiscrimination and affirmative action policy see:  http://policy.ucop.edu/doc/4000376/NondiscrimAffirmActSDL2017"}