{"jobID": "2784045295", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Research Scientist/research Investigator", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "90000", "jobDescription": " Bristol-Myers Squibb is seeking an engineer/scientist to join the Engineering Technologies group within the Drug Product Science and Technology department. This Engineering/Scientist role will be responsible for supporting the development of new drug products for oral solids, both large and small molecules with development and application of enabling technologies. The successful candidate will collaborate with scientists across product development leveraging a combination of experience in process sciences, formulation development, and/or process analytical technologies, as well as digital technology expertise to increase understanding, and balance speed with risk. The successful candidate has a strong understanding of engineering fundamentals, strong aptitude for numerical analysis techniques, laboratory and/or manufacturing experience in drug product processing, understanding of formulation science fundamentals, enthusiasm for applying digital technology in new ways, and strong collaboration and communication skills. The individual works well with people from other disciplines and thrives in a multifunctional team environment. Responsibilities: Accountable for providing innovative solutions and analyses which provide key insights and process knowledge for development, including scale-up and process optimization studies for projects within the portfolio.  Facilitate problem solving using scientific, engineering, analytical, and numerical analysis techniques to support drug product development from early development to product launch as a member of a multidisciplinary project team.  Partners with other Functions within Drug Product Science and Technology, and across Product Development to evolve, integrate and optimize support to create a world-class development function.  Responsible for willingly and enthusiastically working at the bench to solve challenging pharmaceutical development problems using his/her expertise in a particular area of development engineering and through demonstrated broader understanding of engineering techniques and how they may be applied to cross functional development challenges.  Accountable for identifying opportunities and/or implementing solutions to improve efficiency, productivity, quality or reduce costs, operate in accordance with safety and compliance standards  Responsible for actively collaborating with other key scientists within the team. Expected to consistently display a can-do attitude and demonstrate the willingness and capability to adapt and grow within a complex and changing environment.  Manage data, and metadata lifecycles from generation to knowledge, identifying opportunity to maximize the knowledge generated from the tools we have.  Qualifications /Requirements: Bachelors / Masters with some experience or Ph.D. in scientific or engineering discipline is required. Practical experience directly relevant to the role is critical to success and minimum degree requirements change relative to experience.  0-5 years of experience in drug product development and problem solving in the pharmaceutical or other life science industry and/or experience with implementing digital technology into laboratory/processing environments.  Excellent interpersonal, collaborative, team-building, and communication skills to ensure effective collaborations within matrix teams. Preferences: Strong aptitude and/or experience in statistical analysis and/or numerical analysis techniques.  High level of energy and strong work ethic is critical to success"}