{"jobID": "2730454328", "jobLocation": "Oakbrook_Terrace_IL", "jobTitle": "Product Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.infutor.com", "Headquarters": "Oakbrook Terrace, IL", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Acxiom, Infogix, Experian"}, "estimatedSalary": null, "jobDescription": "Company Overview Infutor is the expert in Consumer Identity Management. We are 100% focused on enabling brands to know everything they need to about consumers, to instantly make informed marketing and risk decisions. Infutor’s experience linking trusted data sources result in solutions that:Identify, verify and score inbound consumers, on-demand, with as little as a single identifier.Link customer data, update/add missing identifiers and enhanced attributes.Enable improved digital marketing performance through higher match rates and complete insights. Infutor gives brands a secure, privacy compliant foundation to improve inbound engagements and outbound marketing reach, and to minimize fraud and collections risk. Job Summary The Product Data Analyst is responsible for supporting the Product Team to execute the necessary processes to deliver data products and information to our salesforce and clients. We are looking for Product Data Analyst who can jump in and make an impact quickly. This position reports to the SVP Products and Data Services. Responsibilities and DutiesAs an Product Data Analyst, your responsibilities will include, but are not limited to:Delivering of accurate and on-time information for product team requests and client-based projectsIdentifying, translating, prioritizing, and informing important product questions with dataProduce visuals, write-ups, and presentations to clearly communicate analytics insights to everyone from peers to executives.Analyzing historical data, defining best practices, and identifying opportunities for optimizationFulfilling ad-hoc requestsBe an advocate for a data-driven cultureQualifications and Skills The role requires a passion for data and a person who has spent their career developing strong data analysis and measurement skills, and honing your analytical instincts. The ideal candidate should enjoy finding and communicating the data insights that will truly drive change. We are seeking a quantitative, data-minded person who loves tackling problems and telling stories with numbers. Qualified candidates must have the ability to thrive in a dynamic environment, drive change, and collaborate effectively with a variety of individuals.  To be successful in this role, you will need: BA/BS degree in Computer Science, Information Technology, Engineering, Statistics, Economics, Mathematics, or quantitative fields3-5 years of data analysis, preferably with a technology companyProven experience designing, developing and implementing information solutionsKnowledgeable in SQL, Oracle, and/or similar database languagesSolid understanding of statistical analysis, experiment design, and common pitfalls of data analysisExperience with BI tools and predictive analytics solutions a plusCritical thinker: thoughtful, self-aware, and uses available evidence to make decisionsAbility to effectively synthesize, visualize, and communicate your ideas to othersExtreme attention to detail to ensure flawless execution of projects, with the ability to spot errors and inconsistencies in data and analysisSkills in planning, follow-through, prioritizing and adapting within a multi-tasking environment; maintaining a high level of organization and aAbility to work both independently and with a diverse group of teammates, displaying a high sense of accountability to thrive in a fast-paced, high-growth cultureBenefits and Perks100% employer paid monthly premiums for Employee Only Coverage for Medical, Dental, & Vision.A variety of medical plan options available through our provider, Humana, including , a Health Maintenance Organization (HMO) Plan, two Point-Of-Service (PSO) Plans, and a High Deductible Health Plan (HDHP).Dental and Vision insurance.Flexible Spending Accounts (FSAs) for Healthcare and Dependent Care through WageWorks. A Healthcare Spending Account (HSA) is available when you choose the HDHP.100% employer paid Group Term Life Insurance, Accidental Death & Personal Loss Insurance, and Long-Term Disability.401(k) Retirement Savings Plan that allows participants to have the choice of Roth or pre-taxed contributions automatically deducted from your pay.Voluntary Benefits value-based program provides access to a wide variety of insurance products and services that offer the advantage of group rates and the convenience of payroll deductions.Paid Time Off for vacation, illness, and parental leave.Company sponsored events and much more!"}