{"jobID": "2818584720", "jobLocation": "Washington_DC", "jobTitle": "Software Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "113000", "jobDescription": " If you are looking for a rewarding software development program, consider the opportunity below. Our development teams support one of the most important and innovative government programs around. We are leveraging modern technologies and strive to create a “Work-hard, play harder” culture. Engineers will be able to work on various hard problem with your development efforts having a direct and meaningful impact on our customer’s mission. Responsibilities: You are looking at being a part of a small delivery team, where the team as a whole is responsible for delivery new value and capabilities for our customer. As a member of that team, your strengths in software development will be used on day one. From reviewing, previously written code, lashing up new software solutions, to working with UX/UI designers/engineers on a new look and feel front end, to deploying your code to an AWS Gov cloud instance, you will be involved in all aspects of our development and delivery pipeline. Experience with java, JavaScript, angular, bootstrap, nodeJSWork in and Agile environmentExperience developing in an Agile enterprise software development environmentExperience working in a Linux/Unix environment Experience with installations and deployments in a AWS cloud environmentDemonstrated knowledge and experience with the software development lifecycleDevelop documentation on an as needed basisQualificationsBS in Computer Science or Computer Engineering5 plus years of programming experience in Java/C/C++Experience/training with Amazon Cloud Service preferableDegree: BS in Technical Field Clearance Requirement: Top Secret clearance  KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability.  How to Apply?  Please click apply on the right.  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.  KeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve.  Clearance Requirement: Top Secret clearanceApply!"}