{"jobID": "2731287721", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.strava.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "146000", "jobDescription": "About Strava Strava is Swedish for strive, which epitomizes our attitude and ambition: Were a passionate and committed team, unified by our mission to build the most engaged community of athletes in the world. Every day, were searching for new ways to inspire athletes and make the sports they love even more fun. But its not only about achieving were an inclusive team, dedicated to elevating each other and the members of our community. That balanced approach has helped us revolutionize our industry, and were just getting started. Millions of athletes are on Strava, millions more will come. When youre ready for a challenge and a team that will support you along the way, join us. About this Role Strava is looking for an Data Scientist to help establish our Data Science practice and develop insights and products that improve the experience of athletes on our platform. You will work on a variety of projects across product teams, including recommendations, segmentation, and statistical modeling. The successful candidate will have a passion for data, finding the best algorithm for the job, and making an impact on the business. ResponsibilitiesWork with product and engineering teams to define, scope, and implement projects in productionApply machine learning and other relevant techniques to business problemsBuild models from the ground up, from data exploration through feature generation, to model construction and optimizationDesign and evaluate A/B tests to quantify impactPartner with Data Engineering and Platform teams to identify and build tools for Data ScienceRequirementsBachelors Degree in Statistics, Machine Learning, Computer Science, Mathematics, Economics or other quantitative field; advanced degree a plus2 years of hands-on experience as a Data Scientist, Machine Learning engineer, or similar positionAbility to translate business needs into models and data products, and communicate results to product and leadership teamsDevelopment experience with Python or other scripting languageProficient with SQLExperience with geographic data a plus Backed by Sequoia Capital, Madrone Partners and Jackson Square Ventures, Strava is expanding in order to exceed the needs of our growing community of global athletes. By joining our team, you will help push Strava forward in fresh, innovative ways. You will engage in interesting and challenging work that will improve the lives of our athletes every day. And in the same way that Strava is deeply committed to unlocking the potential of our athletes, we are dedicated to providing a world-class workplace where our employees can grow and thrive. Join us! Strava is an equal opportunity employer. In keeping with the values of Strava, we make all employment decisions including hiring, evaluation, termination, promotional and training opportunities, without regard to race, religion, color, sex, age, national origin, ancestry, sexual orientation, physical handicap, mental disability, medical condition, disability, pregnancy or pregnancy-related condition, marital status, height and or weight."}