{"jobID": "2830442593", "jobLocation": "Washington_DC", "jobTitle": "Assistant Marketing Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.one.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "53000", "jobDescription": "ABOUT ONE ONE is a global campaign and advocacy organization backed by over nine million people from around the world who are committed to the fight against extreme poverty and preventable disease, particularly in Africa. We hold world leaders to account for the promises made to the poorest, and we press them to support better policies and aid that is more effective. We also work with leaders in Africa to support greater democracy, accountability and transparency so that these resources can be effectively deployed. We operate from Abuja, Berlin, Brussels, Johannesburg, London, New York, Ottawa, Paris, Rotterdam and Washington DC.  ONE’s members are critical to this work. They come from every walk of life and from across the political spectrum. They’re artists and activists, faith and business leaders, students and scientists. They take action day in, day out— organizing, mobilizing, educating, and advocating so that people will have the chance not just to survive, but to thrive. ABOUT THE OPPORTUNITY Employees of ONE work in a collaborative and creative environment towards reaching a common goal of ending extreme poverty and preventable disease. When you work for ONE, you will receive an exceptional benefits package along with the opportunity to contribute to worldwide causes impacting those most in need.  TheAssistant Marketing Data Analyst is an entry-level role thatwill help the entire Global Marketing Division innovate and increase our impact through the effective collection, analysis and reporting of marketing data and analytics to inform strategy. The Assistant Marketing Data Analyst will assist the Associate Data Analyst and Marketing Director in handling a wide range of data related to performance and testing across ONE’s marketing and supporter communications. The ideal candidate will have an educational background and some work experience in marketing analytics (including social media, e-mail or web), statistical analysis and/or databases. This is a full-time, non-exempt opportunity reporting directly to the Marketing Director sitting on the Marketing Planning& Insights subteam. This position is based in Washington, DC. IN THIS ROLE, YOU WILLCollect, organize and analyze marketing data in order to help develop actionable insights and inform Division strategy.Support data-related needs throughout the Marketing Division and in particular provide support to the Associate Data Analyst, including helping to field data related requestsHelp team members design and execute testing, including coordinating the collection, cleaning, analysis and reporting out of results - with the goal of significantly scaling the amount of regular testing the department undertakes and helping the department meet ambitious targets.Work with the Marketing Director, Associate Data Analyst and wider Division to identify additional key performance indicators we should be tracking, and develop benchmarks.Support various reporting for the Division, including helping with the production of regular reports and readouts.Help the Division improve how we report and present our work to internal and external stakeholders, including through data visualizationsHelp coordinate the annual membership survey and/or other polling and data gathering projects in order to better identify ONE’s audiences and help improve audience targeting and segmenting.Support the maintenance of ONE’s database to ensure clean and accurate data organization.Work with the Associate Data Analyst and broader team to ensure data is stored and shared securely subject to local laws and regulationsConduct other data and analytics projects as required.Keep on top of relevant innovations in marketing, technology and data.TheAssistant Marketing Data Analystis a junior-level professional role and will serve as an individual contributor within the field of marketing data, insights and analytics.Additional duties as determinedWHAT WE NEED FROM YOUBachelor’s Degree in a related fieldMinimum of one years’ experience in a marketing analytics roleExperience managing data using CRM systemsExperience with SQLAdvanced Excel experience, including using pivot tablesExperience with Google Analytics, Facebook Insights and other digital analytics toolsExperience with data extraction and data cleaningAbility to identify and develop actionable insights, and help a team adopt those into work flow and decisionsInterest in marketing and an understanding of how analytics can improve marketing performanceStrong written and verbal communicator; comfortable translating analytics findings to non-technical audiencesAbility to present analytical results visually for external stakeholders, preferably having used data visualization tools such as TableauWorks under minimal supervision with wide latitude for independent judgment.Past digital campaigning experience is a plusDetail oriented and able to successfully manage and prioritize multiple projects in a dynamic and rapidly changing environment;Ability to manage multiple, shifting priorities under tight deadlines while performing in a fast-paced, team-oriented environmentRelated work history in poverty and infectious disease alleviation, advocacy, policy, legislation and/or demonstrable interest in the causes ONE supportsTravel up to 5% international and/or domesticAbility to work and live in United States is requiredOTHER ATTRIBUTESAn understanding of the complexities surrounding collaboration in a global matrix organizationHighly organized, detail oriented and self-motivatedCollaborative mindset and strong interpersonal skillsRemain positive in high pressure and stressful situationsCritical thinking, communication, and relationship-building skillsWell organized, detail oriented and analyticalAction oriented and results focusedFlexible and resourceful approachIndependent problem solverLANGUAGE SKILLS: Fluency in English required. Fluency in other languages highly preferred such as French or German TRAVEL: Travel up to 5% international and/or domestic PHYSICAL REQUIREMENTS/WORK ENVIRONMENT: Standard office work environment. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the job. APPLICATION INSTRUCTIONS If you are ready to join the fight against extreme poverty and preventable disease, please submit a resume and cover letter to this opening atONE jobs (http://www.one.org/jobs).  ONE is committed to providing reasonable accommodations to applicants. When an applicant with a disability needs an accommodation to have an equal opportunity to compete for a job, they may request it orally or in writing (please visit theContact Us page on the web;www.one.org/us/about/contact/). ONE will process requests for reasonable accommodation and will provide reasonable accommodations where appropriate, in a prompt and efficient manner.  ONE is an equal opportunity employer and does not discriminate in its selection and employment practices. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity, marital status, disability, protected veteran status, genetic information, age, or other legally protected characteristics. Due to the high volume of inquiries that ONE receives, we thank all candidates for their interest yet only those who are selected for an interview will be contacted."}