{"jobID": "2822241455", "jobLocation": "Washington_DC", "jobTitle": "Digital Project Manager", "companyRating": null, "companyInfo": {"Website": "www.wideeyecreative.com", "Headquarters": "New York, NY", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Wide Eye Creative is an award-winning digital design agency that empowers campaigns, organizations, and businesses with elegant design and innovative technology. We've worked with organizations and individuals like the Sierra Club, NARAL Pro-Choice America, Hillary Clinton, Stacey Abrams, and more. We are seeking a Digital Project Manager for a full-time position in our DC office. The successful applicant will work directly with our designers, developers, and clients to produce beautiful, engaging digital experiences. Strong applicants will know the fundamentals of digital campaigning and organizing, be an excellent communicator, and obsess over the latest digital trends.  WHY WORK AT WIDE EYE CREATIVE Meaningful causes, campaigns, and organizationsGreat work/life balance, flexibility and professional freedomOpportunities for growth in the role and within the companyA highly-creative, award-winning team with a sterling reputationCompetitive compensation and benefits 15 days paid vacation12 paid holidays plus the week between Christmas and New YearsPaid sick days401(k) plan and 3% employer contribution after 18 monthsAbility to participate in profit-sharing plan after 12 monthsProfessional development opportunitiesAnnual team retreat (last year was in New Orleans!)100% premium covered for platinum-level CareFirst HMO health insurance and Aetna dental/vision insuranceLife insurance and disability insurance optionsHealthAdvocate services to assist with negotiating medical bills, legal and financial planning advice, mental health RESPONSIBILITIES  Manage digital projects start to finish Working with others on the team, take RFPs and new project inquiries and help translate them into actionable project plans and scopes of work.Lead content strategy for client projects, including performing content discovery, leading branding and marketing exercises in coordination with our design team, wireframing, constructing content checklists, sourcing imagery and/or video.Develop detailed timelines and project plans for project deliverables, both with internal teams and with clients, and manage those teams from Day 1 through launch.Triage issues that may arise that can impact scope, budget, and timeline or projects.Provide strategic guidance to clients to support their digital organizing, marketing, communications, fundraising goals.Perform client trainings and draft documentation, educating clients on best practices for their website and digital work.Maintain awareness of industry best practices and trends in digital. Grow and sustain client relationships Be the internal expert on each client you work with, conducting research to deeply familiarize yourself on their structure, goals, and present and future needsTriage questions and issues that come up from clientsBe one of the faces of the company: identify and execute strategies to maintain and grow our client relationships.Look for and lead on opportunities that may include conferences, events, thought leadership/writing, etc.Seek opportunities to market other Wide Eye services, products, and tools to enhance clients’ broader communications and digital strategy. Supplementary responsibilities Where needed, assist design and development teams with minor design and HTML/CSS support.Work closely with our designers and developers in testing and quality assurance for project and product deliverables.Lead post-project debriefs, gathering recommendations for innovating and improving our internal processes and products.Assist with business development efforts by preparing proposal schedules, managing proposal requirements, and assisting with research, writing, editing, and proofreading proposals. QUALIFICATIONS Minimum of 3-5 years of relevant experience in an agency settingDemonstrated experience with WordPressDemonstrated ability to manage and deliver projects on time, in budget, and within scopeStrong verbal and written communication skills, with ability to communicate with a wide range of audiencesExperience with distributed/remote teams preferredAbility maintaining and growing relationshipsPatient, strategic, solutions-focused, and able to remain calm when problems ariseStrong intuition and judgment – always one step ahead and able to make decisions that balance client and company needsExperience working with a wide range of digital technologies: Content Management Systems (CMSs), CRMs, digital analytics toolsDemonstrated ability to balance multiple projects and deadlines at onceDemonstrated ability working with designers and developersProfessional, strong time management, organizational skills, and attention to detailHighly-creative and resourcefulPassion and pride in your work TO APPLY  Please submit: An up-to-date resumeA brief description of why you want to be a Digital Project Manager at Wide Eye Creative and 1-2 examples of recent digital campaigns that have inspired you Wide Eye Creative is an Equal Opportunity Employer that values a diverse working environment. Applicants of diverse backgrounds are encouraged to apply."}