{"jobID": "2261915744", "jobLocation": "Playa_Vista_CA", "jobTitle": "Data Science Intern - PhD/Masters", "companyRating": null, "companyInfo": {"Website": "www.pixalate.com", "Headquarters": "Santa Monica, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Pixalate Pixalate has the Most Advanced Ad Analytics Platform for Display and Mobile Advertising. Our company was created with one purpose: to simplify advertising analytics for advertisers and publishers.  Pixalate's analytics suite fills an unmet need for real-time campaign tracking, fraud detection, optimization, and reporting. Outside of improving existing technologies, Pixalate has created first-to-market white box products for viewability, user interaction mapping, and media discrepancy tracking.  Our clients include publishers and advertisers who use our products and services to better understand their media and get the most of their ad dollars.  Data Scientist Intern Job Description: Candidate needs to be located in Southern California (no relocation offered) In this role, youll work with product and other engineers to build data driven features and products. We need someone who is highly motivated and enthusiastic about keeping up-to-date with the latest technologies. If you are a talented and proven data science/analytics guru who loves to investigate data, we want you. If you have a detail-oriented, creative mind and love complex challenges, we definitely want you. If you enjoy working with data to build products and solve hard problems in creative ways, we know you will fit right into our innovation driven start up environment.  In This Role, Were looking for: Candidate needs to be part of or completed a PhD program (or Masters Program) in Computer Science, Mathematics, Statistics, Theoretical/Computational Physics, or related field, or other quantitative science majorsSolid knowledge of basic probability, statistics, and machine learning algorithmsHands-on experience with advanced SQLHands-on programming experience with one or more of the following: Python, R, or related languagesDemonstrable ability to quickly understand new conceptsSavviness with modern tools for working with unstructured dataPassion for visualization and creative dataProven achievements resulting from data analysisExperience with languages used for querying, preprocessing, and statistical analysisKnowledge of scripting languages and familiarity with web frameworksSomeone who can research, evaluate, implement, and present statistical methods to provide actionable insightsImplement algorithms using machine learning and data mining to analyze and model big data setsAbility to communicate results clearly to non-technical folksResults-driven with ability to effectively function in a fast-paced, start up environmentMore about Pixalate Located 11 blocks from the beach in downtown Santa Monica, the core of Pixalates DNA lies in innovation. We focus on doing things differently and we challenge each other to be the best we can be. We offer: Experienced leadership and founding teamCasual environment (as long as you wear clothes, were good!)Flexible hoursCompetitive compensation and benefitsStock optionsFood! (You name it, weve got it)Fun team eventsHigh performing team who wants to win and have fun doing itOPPORTUNITY (Pixalate will be what you make it) Check out our website: www.pixalate.com  Read more about us from Venture Beat: http://bit.ly/1cIXHIs"}