{"jobID": "2769070637", "jobLocation": "Chicago_IL", "jobTitle": "Wealth Management, CWM Operations - Data Analytics and Insights Analyst - Vice President", "companyRating": null, "companyInfo": {"Website": "www.chase.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "J.P. Morgan Asset & Wealth Management, with client assets of $2.4 trillion, is a global leader in investment and wealth management. Its clients include institutions, high-net-worth individuals and retail investors in every major market throughout the world. The division offers investment management across all major asset classes including equities, fixed income, alternatives, multi-asset and money market funds. For individual investors, the business also provides retirement products and services, brokerage and banking services including trusts and estates, loans, mortgages and deposits.Wealth Management Operations supports the JPMorgan Private Bank and Chase Wealth Management in JP Morgan’s Asset Wealth Management line of business. The Private Bank is the world’s premier service provider for ultra and high net worth individuals. Our goal is to help these affluent individuals across the globe optimize their wealth, after taxes and across generations. Wealth Management Operations provides end-to-end support for all aspects of the client experience, working closely with client service, fiduciary, product specialty groups, third party vendors and other internal groups.Chase Wealth Management encompasses our Chase Private Client (CPC) and Chase Investment Services businesses. Through a dedicated team of a banker and J.P. Morgan Advisor, Chase Private Client brings our affluent clients concierge banking from Chase and access to the investment expertise from J.P. Morgan. Chase Investment Services provides investment solutions to a broad range of Chase customers through Chase Investment Advisors. The J.P. Morgan Securities Client Service Center’s mission is to create a great client experience and help individuals across all 50 U.S states to save and invest wisely. The group works in a team environment to assist clients with service over the telephone and serves as experts on our online platform, such as Chase.com.Role DescriptionThe CWM Operations Data Analytics and Insights Analyst is a position within the Reporting and Analytics team of Chase Wealth Management Operations. The role will perform advanced analysis of data across CWM Operations to identify trends, determine drivers of volumes and changes, and discover opportunities to improve the client experience and operate more efficiently. This person will engage process owners, stakeholders, and subject matter experts throughout the firm to facilitate insights.Key FunctionsWorking across CWM Operations teams and critical partners to assist in determining key data requirementsEnvisioning, orchestrating, and building strategic insights and opportunities to continuously improve our businessIdentifying opportunities for automation and scorecarding to ensure key process improvement opportunities are identified and socializedAnalyzing business results with an eye towards recommendations for enhancementEvaluating data to identify drivers of volumes and emerging trendsDeveloping visualizations of analytics insights for consumption by stakeholdersSupporting ad-hoc reporting and analytics requests5 years of Analytics experience with a focus on large datasets and predictive analytics4 years of demonstrated analytical skills and experience with reporting tools like SSRS, SSAS, QlikView, QlikSense, or TableauProficient with SQL query developmentMinimum 3 years experience working with large corporate databases/applicationsExcellent analytical and problem resolution skillsAbility to synthesize large amounts of data to tell a relevant storyStrong quantitative and critical thinking skills with capacity to learn quicklyStrong ability to communicate with stakeholders across functions and at all levelsProven verbal and written communication skillsBachelor’s degree required, advanced degree desired, with preferred concentration in Math, Statistics, Economics, or similar quantitative disciplines"}