{"jobID": "2809010481", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist with Polygraph", "companyRating": null, "companyInfo": {"Website": "www.tuckerhr.com", "Headquarters": "Santa Rosa, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Recruiting Associates (www.recruitingassociates.net) has been retained by a leading non-profit firm consulting firm to identify a Data Scientist with Polygraph to work in McLean, VA. Our client offers generous compensation package with excellent benefits.  The Data Scientistwill have an emphasis on statistical analysis and survey methodologyto support an Intelligence Community customer. Responsibilities: The ideal candidate will have previously supported initiatives across in the IC, and must possess strong written and verbal communication skills, as well as a demonstrated ability to interact effectively with clients. The candidate will be responsible analyzing international public opinion and regional trend data using SPSS, STATA, or R, assisting government methodologists with structuring the data and advising them on approaches to statistical analysis. The candidate will deliver insights to government methodologists via briefings, written reports, and code.  Candidates should have direct, applied experience with one or more of the following areas or tools: Statistical sampling and analysis (to include correlations, cross-tablulations, and regressions)Survey methodsData modelingSPSS, STATA, or RMS Excel (including pivot tables)Substantive knowledge in international affairsQualifications: A BS or BA degree with a major in a quantitative (such as statistics, mathematics, etc.) or social science discipline is preferred; a master's degree is desired. Must have at least 3 years of experience (preferable with an Intelligence Community customer), to include experience in one or more relevant skills or tools.  Must possess strong written and verbal communication skills.  Must have an active TS/SCI clearance with Polygraph. "}