{"jobID": "2738178734", "jobLocation": "Sunnyvale_CA", "jobTitle": "Associate Formulation Scientist II", "companyRating": "2.4", "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": "71000", "jobDescription": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.  More than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer.General Position Summary/Purpose:Associate Formulation Scientist responsible for the development, evaluation, and characterization of liquid and solid dosage forms primarily in support of pre-clinical studies, and potentially in support of clinical development. This individual will be responsible for development and timely delivery of drug product test articles in support of efficacy, pharmacokinetic and toxicology studies. This position requires collaborative interaction with various internal functional areas to support development programs as per defined timeline and goals. Will assume shared responsibility for the management and development of the Pharmaceutical Sciences laboratory as part of the formulation team.Major Key Job Duties / Accountabilities / Core Responsibilities:Design and conduct pre-formulation assessment studies of various novel drug candidates.Develop suitable formulations and prepare test articles as required to support efficacy, PK, and toxicology studiesEvaluate and characterize the physical and chemical behavior of drug product formulations, including stability studiesDevelop, as required, any analytical methodology required to understand and characterize product formulations or candidatesProvide guidance and expertise on formulations and drug delivery to support the development programs and cross-functional teams. Maintain and manage analytical equipment in the Pharmaceutical Sciences laboratoryKeep accurate laboratory data records and summarize data as neededQualifications (Knowledge / Skills / Abilities):Basic knowledge of liquid formulation development and drug deliveryHands-on experience with analytical methodologies and equipment used to characterize test molecules and formulation systemsDetail oriented, can multi-task and work on multiple projects concurrentlyExcellent verbal and written communication skillsManagement: (Include old & new org chart):Reports to Associate Director, FormulationNature of Contacts (Internal & External): Various cross-functional team members in pre-clinical sciences, pharmaceutical sciences, discovery, and research teams with research associates, scientists, and directors. Less frequent interface above director levels. Cross functional teams may contain members up to VP level.Decision Making Authority / Discretion: Will have discretion on design and conduct of laboratory work, with the guidance of management. Most final project decisions will be vetted through upper management.Experience: 3 or more years of experience in pharmaceutical development, formulation and/or analytical development preferredDirect hands-on experience with HPLC and other standard laboratory equipment and methodologies Education Requirements:Must have BS in the chemistry, biochemistry or equivalent#LI-SH4Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}