{"jobID": "2831218921", "jobLocation": "San_Antonio_TX", "jobTitle": "Business Intelligence Analyst", "companyRating": "4.8", "companyInfo": {"Website": "www.taskus.com", "Headquarters": "Santa Monica, CA", "Size": "10000+ employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "52000", "jobDescription": "About TaskUs TaskUs provides a next-generation customer experience that powers the world’s most disruptive companies through the partnership of amazing people and innovative technology. We provide Ridiculously Good strategy, business process optimization, revolutionary technology and the best talent to deliver transformational, digital scale.  Our people are at the heart of everything we do. We embrace a culture that fosters a best-in-class employee experience. It’s no wonder we have been named as one of the “Best Places to Work” by the San Antonio Business Journal.  TaskUs has been recognized on the Inc. “5,000 Fastest Growing Private Companies in America” list the past five years and The Los Angeles Business Journal’s “100 Fastest Growing Private Companies” the previous three years. TaskUs is headquartered in Santa Monica, California, with operations across the United States, Latin America, and the Philippines. We are currently growing across 4 different locations in the San Antonio, TX metro area, including New Braunfels.  Job Description: The Business Intelligence Analyst position is responsible for working along with Business Intelligence team in order to provide reports, insight, and analysis for campaigns housed in our North American sites. In this highly collaborative role, you will be responsible for formulating sound strategies, coordinating the deliverables, gathering & documenting the requirements, providing insight into business operations through statistical analysis, report creation, and project management. The successful candidate will apply high-quality expertise to the implementation of our Business Intelligence solutions that leverage our reporting packages, technology platforms, and analytical tools.  The Business Intelligence Analyst role will require excellent communication and analytical skills as the candidate will work on department objectives for not just Business Intelligence but also across the business. Essential Functions and Responsibilities:Meet with end users to understand business needs and gather requirementsGathering and documenting the business/functional requirements.Translate requirements into actionable reports by working with the technical teams.Provide consultative support to our clients that is data-based, analysis-driven, and grounded in a solid understanding of call center operations and customer relationship managementManage projects, tasks, and systems utilizing project management methodology and agile methods.Perform various ad-hoc analyses, including but not limited to, customer satisfaction analysis, tenure and learning curve analysis, quality of service analysis, contractual KPI driver analysis, and financial performanceContinually optimize or build a more efficient process around reportingBecome an expert in client-owned systems and tools in order to provide recommendations to the account team on how to best utilize the system for their businessExtracting data from multiple source systems and creating comprehensive reports for our end usersExperience, Skills, and Education Requirements:2-4 years of Analyst experience preferredBachelor's Degree in Business or Computer Science field of study preferredData savvy – must be obsessed with optimization and efficiencyExperience in planning and logistics, preferably in a cross-functioning environmentExcellent verbal and written English skills. Business level Spanish a plusMicrosoft Excel expert (lookups, formulas, pivots, macros)SQL experience (writing SQL statements to analyze data: joining, filtering, aggregating)Experience in or at least ability to learn visual design using the Tableau and/or PowerBIplatformAbility to work with minimal supervision"}