{"jobID": "2639967102", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst - Product & Marketing", "companyRating": null, "companyInfo": {"Website": "www.calm.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Calm - 2017 Apple iPhone App of the Year!Our mission is to make the world happier and healthier through the superpower of Calm. We are developing a range of digital and physical products that enhance mental fitness and alleviate some of the most important mental health issues of the modern age (anxiety, depression, insomnia and stress). Calm has reached over 26 Million users, and is profitable (10x revenue growth in two years).Mental Fitness is fast becoming the new Physical Fitness, and we believe a huge global brand will be built in this space. Our vision is to build Calm into one of the most valuable and meaningful brands of the 21st Century - The Nike of the Mind.Calm was co-founded by Alex Tew (Million Dollar Homepage) and Michael Acton Smith (Mind Candy, Moshi Monsters, Firebox).What Youll Do:You will do deep data dives and track metrics around our product in order to understand how it is being used, how recent changes have affected metrics, and where optimization opportunities are for our business and product. You will also work on data-analytic projects with marketing, life-cycle, operations, the executive team, and even our PR team (e.g., finding stories in the data for journalists) that require you to have flexible quantitative skills. You will communicate your findings in presentations, build dashboards and visualizations, and be the go-to person for questions about data. Who You Are: You have an excellent product sense and 3+ years industry experience in product analytics.Given that you will work across a variety of domains in this role, the ideal person would also have some experience in business, marketing or operations analytics but that is not as important as product analytics.You should have strong SQL skills which will not only enable you to drill deeply down into the data looking for insights but to also help others on the team gain access to more insightful data (e.g., dashboards). If you can supplement or mostly replace SQL with Python, thats a plus but not necessary.Given that this role will require you to present your findings, visually in dashboards and in presentations, and to work with people across teams, it is critical that you are an excellent communicator.Ideally, you would have experience either with Mode, a similar visualization tool, or Pythonic approaches to data visualization.You should also have strong quantitative skills and a basic understanding in statistics (e.g., when you find an interesting pattern, you can figure out when it is just noise). We are not, however, looking for someone with a background in machine learning and advanced statistics.You should be able to work independently and take ownership of your projectsBenefitsCompetitive salary and equityUnlimited PTOWe pay your medical, dental, & vision insurance premiums401KCommuter benefitsLife insurance and disability benefitsApple equipmentFun, energetic work environment, and daily perks - snacks, drinks, catered lunch twice a weekOpportunity to work with a product focused on making the world happier and healthierAnd much more!"}