{"jobID": "2829509973", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "106000", "jobDescription": " McLean 1 (19050), United States of America, McLean, Virginia  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Data Analyst Manager  At Capital One, data is at the center of everything we do. When we were a tiny startup we disrupted the credit card industry by individually personalizing every credit card offer using statistical modeling and the relational database, cutting edge technology in 1988! Fast-forward a few years, and that little innovation and our passion for data has skyrocketed us to a Fortune 200 company and a leader in the world of data-driven decision-making.  Twenty-five years after Capital One was started its still led by its founder. Be ready to join a community of the smartest people youve ever met, who put the customer first, and want to use their data skills to make a difference. What youll do:Drive current and future strategy by leveraging your management and analytical skillsLead a team charged with building and using models to test and validate dataExperience working with vast amounts of data in new and evolving environmentsBe a part of growing and developing our brand in new and emerging marketsLeverage analytics to create a customer experience above our peersLead a team of talented junior analysts on an exciting professional journey while mentoring them and elevating their careersBe a part of the full life cycle of projects and see end resultsCollaborate across department and business unitsWork with top talent in a fast paced, entrepreneurial environment where analytics and good data are a top priorityExperience real work life balance, with little travel involved On any given day you will be: Mining data to arrive at specific and crucial information for the organizationIdentifying and implementing process, data, and reporting improvements for the organizationWorking with large and complex databases containing millions to billions of recordsImproving operational efficiencies and effectivenessConducting analysis to evaluate processes and testsExtracting and analyzing data to gauge product offeringsConsulting on the design and implementation of new production and data storage systemsDeveloping and implementing strategic tests of products, initiatives and marketing materials  - Engaging with customers to problem solve and ensure high quality delivery of products and services  - Engaging with leadership to keep them abreast of current activities, concerns and needs  - Engaging with your team leads to provide guidance, feedback, development and coaching  An ideal candidate will be on the leading edge of Analytical technology with a passion for the newest and most innovative tools. Possessing strong problem solving and conceptual thinking abilities in addition to communication, interpersonal and leadership skills are also important. This position will be in a fast-paced and entrepreneurial environment where you will be handling multiple concurrent projects while working independently and in teams.  Basic Qualifications:Bachelors Degree4 years of work experience in data analysis2 years of programming experience1 year of experience in people managementPreferred Qualifications:Masters Degree7 years of professional data analysis work experience1 year of project management experience1 year of experience with AWS1 year of experience with R, Python or equivalent open source programming language1 year of experience in data visualization with Tableau, BOBJ or BIRST  - 1 year of experience in machine learning  - 3+ years of experience in people management Capital One will consider sponsoring a new qualified applicant for employment authorization for this position."}