{"jobID": "2815886926", "jobLocation": "Midland_MI", "jobTitle": "Patient Placement Coord RN", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "27", "jobDescription": " Position Information  Exempt: No  Any Shift: CASUAL; Hours per schedule  Weekend & Holiday Rotation: Per schedule  Pay Grade: 16  Position Summary  The Patient Placement Case Manager is responsible for accurately applying admission criteria for patients that have a physician requesting an initial bed assignment to ensure timely and appropriate status and room placement. This involves interaction with physicians, nursing staff, Medical Social Work, community resources, patients/families. Medical necessity criteria and record reviews. In addition, the Patient Placement Case Manager practices in accordance with the care management process utilizing tools, standards, models, goals and objectives, and performance improvement concepts. The Patient Placement Case Manager provides pertinent clinical data to outside agencies as needed to assure compliance with their requirements. Active participation in team meetings and education of the staff is a key role.  Responsibilities  ESSENTIAL:  Responsibilities: (50%)* Performs medical necessity assessment to ensure accurate and timely patient status and bed assignment using hospital selected medical necessity criteria such as InterQual. (30%)* Actively educates the health care team and physicians regarding the appropriate patient status and bed assignment. (10%)* Completes all documentation and data entry requirements in SoftMed and EPIC. (10%)* Communicates with outside agencies to ensure accurate information is received to evaluate if transfers are appropriate prior to patient arrival, care authorized per insurance providers recommendations by applying knowledge of third party payer’s criteria. OTHER DUTIES AND RESPONSIBILITIES: Uses critical thinking in all interactions.  Sets priorities so that patient needs are met in a timely way.  Explains the process to use when a patient’s condition does not match the Utilization Review (UR) criteria.  Interacts positively with personnel and shows respect for physicians and other members of the team.  Builds professional relationships with patient, families, facilities and resources.  Accepts mentoring.  Describes how medical necessity and denial prevention relate.  Gives timely notification to Discharge Planner, Case Management, and Social Work for patients requiring a lower level of care i.e. infusion center or EFC.  Assigning bed placement according to medical necessity for surgical admissions, transfers in-house and other affiliates.  Early intervention with review of potential Inpatient and Observation patients by using all available test results including T sheets, radiology reports and other diagnostics.  Willingly and consistently offers to help peers who are experiencing high volume case loads.  Accepts accountability for the clinical outcomes that the Patient Placement Coordinator role can facilitate.  Anticipates potential problems and pitfalls of vacation, holidays and weekends and proactively manages to avoid delays.  Provides excellent customer service to patients, physicians, office staff, and medical staff requiring the service of patient placement.  Other duties as assigned.  Qualifications  Education: Essential:Associates DegreeNursing  Education equivalent experience:"}