{"jobID": "2734259763", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.harrisbank.com", "Headquarters": "Chicago, IL", "Size": "5001 to 10000 employees", "Founded": " 1984", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " J.P. Morgan, Northern Trust, Bank of America"}, "estimatedSalary": "79000", "jobDescription": " Assist the US Corporate Treasury team, with developing, enhancing, implementing and maintaining enterprise-wide quantitative risk and financial forecast modeling used in the CCAR, asset & liability management, and stress testing process. This involves analyzing large financial data sets, developing leading model methodologies, and applying those methodologies to build robust forward looking models that link macro-economic variables and other business drivers to project business activity and profitability. The individual will also provide input to the framework for model development, including financial forecasting principles and standards, ensuring understanding, acceptance and mitigation of risks from the use of models, and the corresponding roles and responsibilities inherited from such use. The details are summarized as follows: Analyze financial data to extract relevant information that can help Line of Business and Treasury to better manage multiple financial products and processes.Develop and maintain various quantitative CCAR, asset and liability management assumption, and stress test models. The model building includes, but is not limited to the acquisition of financial data (internal and/or external), analyzing the data, design and implementation of multiple models that are linked to macroeconomic scenarios as provided by the Federal Reserve or internally developed by the bank, or that quantify the behavior of products in varying economic conditions over time.Recommend potential model methodologies and develop models for forecasting asset balances (including loans and deposits), loan spreads, funding costs, noninterest income and noninterest expense based on macroeconomic scenarios.Document and communicate model results and methodologies to external and internal stakeholders, in clear and concise fashion, both verbally and in written form.Skills:3 years of strong hands-on computing development skills, particularly statistical and database modeling tools (SAS, R, SQL, Python, Hadoop, Access/VBA etc.), ability to adapt to various programming languages and environments.Strong data analysis skills, dealing with large data sets to extract relevant information.Effective presentation and communication skills; Ability to convey complex concepts and outcomes to non-subject matter experts.Experience with statistical/econometric modeling techniquesEducation and Accreditations:Master’s degree in a quantitative field (Statistics, Mathematics, Engineering, Economics, Mathematical Finance) and/or combination of quantitative and business degrees preferredInterest in financial products and aptitude to learn"}