{"jobID": "2816486436", "jobLocation": "Angeles_CA", "jobTitle": "Educational Data Consultant", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "EdTec Inc. is a growing national company that provides business and operational development assistance to charter schools in a number of states with a focus on California, Tennessee, New York, Washington, and most recently Georgia. EdTec is headquartered in the San Francisco Bay Area (Emeryville), with offices in Los Angeles, Nashville, and Atlanta.  We assist charter schools in ensuring accountability for all financially related aspects of school administration, including full-service accounting, payroll, accounts payable, budget development, cash management, and state financial and attendance reporting. EdTec also assists schools in strategic planning, charter development, facilities acquisition, business problem solving, governance, and district negotiations.  While we are a private company, we are motivated by the mission of helping to improve public education through the support of charter schools. Currently, we provide services to 160,000 students, many of them in low-income, inner-city areas and/or with high English Language Learner populations.  We are seeking an Educational Data Consultant who will share our enthusiasm for helping to make a difference in these students lives. Ideal candidates will have an entrepreneurial approach, be a self-starter, and have comfort with fast-growing organizations. Specifically, the Educational Data Consultant will be responsible for:Managing a client load of 10-15 schools, serving as the primary point of contact regarding: School attendance/demographic data, attendance software support, and attendance processes.State/county/district report requirements, deadlines, and processes.Data verification, analysis, formatting, and cleanup.Generation of custom student demographic reports and analyses.Generating, troubleshooting, and extracting a range of school data and attendance reports.Researching and developing (where applicable) new processes, reporting requirements, and technical solutions.Building and maintaining strong client relationships.Assessing client data needs and identifying additional areas for consulting work.Assisting in or overseeing the planning and implementation of student information systems in new and existing schools.Occasional training of teachers and administrators on student information software and systems.Identifying, assisting, and executing strategic projects/initiatives to improve and grow EdTec operations, services, sales, and the overall business. Within EdTec, you will work closely with the Data Group Lead while also providing ad hoc assistance to financial analysts and managers.Qualifications:Understanding of or interest in database systems.A strong client-service orientation, responding efficiently and effectively to client requests.Solid Excel skills.Strong attention to detail.Demonstrated ability to learn quickly.Analytical and problem-solving skills.Ability to set priorities and manage multiple projects while meeting customer expectations.Effective communication skills, both oral and written.Interest in education.The following are pluses, though not required: Exposure to the PowerSchool Student Information System (a web-based database system for tracking student records and attendance) or similar student information systems.Exposure to CALPADS or similar State Reporting systems.Consulting experience.Familiarity with web-based applications and web programming (HTML, JavaScript, etc.).For recent college graduates, a degree in computer science, engineering, business, economics or other quantitative subjects. Competitive salary based on experience + performance bonus. Excellent benefits: health, dental, vision, flexplan, 401k. EdTec will provide training in key facets of student information systems and data management.  Please send resume and cover letter with compensation requirements when applying. Subject line: Educational Data Consultant.  Please note, resumes without cover letters will not be considered.About EdTecEdTec is a social venture founded in 2001 to exclusively serve the needs of charter schools. Our mission is to support operational and academic quality in the charter movement by delivering the highest value charter school support services and expertise to the developers and schools we serve."}