{"jobID": "2822966736", "jobLocation": "Chicago_IL", "jobTitle": "Analyst, Technology Data & Information Management", "companyRating": null, "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": null, "jobDescription": " JLL, an international real estate management company, is seeking an analyst to join our Technology Data & Information Management organization. We are seeking candidates that are self-starters who can work in a diverse and fast-paced environment that can join our team immediately.  ? Independently develops, executes and monitors complex data management / analytic processes to support ad hoc data and information delivery for assigned projects.  ? Develops proficiency in multiple data management disciplines and tools to develop robust data and information management solutions.  ? Proactively identifies opportunities to optimize the performance and efficiency of existing processes/procedures.  ? Monitors data / information management processes to ensure data quality and consistency in support of business initiatives.  ? Ensures proper escalation, prioritization and remediation of data quality issues.  ? Engages with colleagues and internal customers to reverse engineer existing business processes and identify core business requirements for new information deliverables and data infrastructure.  ? Articulates business requirements in sufficient detail such that a technical solution can be designed and engineered.  ? Contributes to the design and development of technical solutions to ensure that business requirements are satisfied.  ? Identifies and acquires new data sources, performs data discovery to understand data values and relationships, and develops prototype solutions to deliver immediate business value.  #LI JLL Is an Equal Opportunity Employer JLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veterans status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.  For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf.  If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at [Click Here to Email Your Resumé]"}