{"jobID": "2835289327", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Product Data AnalystABOUT NEXT COLLEGE STUDENT ATHLETE (NCSA)NCSA is the world's largest and most successful collegiate athletic recruiting network. A wholly-owned subsidiary of Reigning Champs LLC (www.reigningchamps.com), NCSA's 700 teammates leverage exclusive data, proprietary matching algorithms, and personal relationships built over nearly two decades as the industry leader to connect tens of thousands of college-bound student-athletes to more than 35,000 college coaches nationwide across 34 sports every year. You can learn more about NCSA at www.ncsasports.org.Data Analyst Job DetailsAs a Data Analyst at NCSA you be a key member of the data science and product teams to help us drive growth for the business and success for our customers. You will own analysis and reporting for NCSA’s core digital products. You will work closely with the VP Product, product managers and development team. You will provide actionable insights to drive customer success and revenue. If you are interested in being part of a growing data team that is driving real business impact, this job is for you!ResponsibilitiesWork with the product team to create and execute monthly product performance reportsWork with product team to measure impacts of key product initiativesCreate and maintain google analytics dashboardsAssist in adhoc analysis and data requests to inform product development decisionsAnticipate needs of key stakeholders and product managersPresent analytical findings to VP Product, product team and other key stakeholders including C-level and executivesWork with the product team to develop, implement, and optimize revenue and customer success strategiesYou will manage your own project backlog, clearly communicating timelines and setting appropriate expectations with businessRequirementsB.S. or M.A. in computationally intensive field such as mathematics, statistics, computer science, or economicsExpert user of MySql/SQL or PostgresExperience using Excel for data analysisIntimate knowledge of google analyticsAbility to multi-task and manage your own scheduleInquisitive personality – always looking for ways to improve the businessAttention to detail and the desire to take accountability for quality of dataBenefitsMedical, Dental, & Life InsurancePre-Tax Flexible Spending Account401(k) Match Up to 3%Parental LeaveWellness Reimbursement ProgramOnline Health AssessmentsNational Collegiate Scouting Association LLC is committed to providing equal employment opportunities to all employees and applicants without regard to race, religion, color, sex, national origin, citizenship status, uniform service member status, age, disability, sexual and gender orientation, genetic information or any other protected status in accordance with all applicable federal, state, and local laws. - provided by Dice  SQL, Google Analytics"}