{"jobID": "2837781311", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.workbridgeassociates.com", "Headquarters": "Boston, MA", "Size": "51 to 200 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A medical research institute is seeking a Data Engineer who can implement and support software, as well as integrate databases. They have been at the forefront of developing ways to improve the quality of life for all Southern Californians using medical science research and technology. Candidates applying should ideally have more than 5 years of experience using Microsoft SQL Server, using ETL tools, and working with medical ontology. Responsibilities will also include translating workflows for multiple levels of the organization, performing data modeling, and using tools for data profiling.  Required Skills & Experience 5+ years experience with: Data warehouse applications SQL Server SSIS T-SQL Scripting ETL programming tools Data mapping and design specification for applications Working closely on databases with development team Previously working with Medical Ontology Permanent Residency/Green Card Required Desired Skills & Experience Greatmunication skills Motivated team player What You Will Be Doing Tech Breakdown  Production Support: 15% Data Warehousing: 65% Development: 20% The Offer Contract Duration: 12 14 Months You will receive the following benefits:  Medical Insurance & Health Savings Account (HSA) 401(k) Paid Sick Time Leave Pre-taxmuter Benefit Applicants must be currently authorized to work in the United States on a full-time basis now and in the future.  This position does not offer sponsorship.  Workbridge Associates, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) across 11 major North American markets. Our unique expertise in todays highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients."}