{"jobID": "2726765403", "jobLocation": "Holland_MI", "jobTitle": "Production Manager", "companyRating": "2.6", "companyInfo": {"Website": "www.challenge-mfg.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": " The Production Manager directs and coordinates activities in the Business Unit to obtain optimum efficiency and maximize profits by performing the following duties personally or through subordinate Group Leaders and team members. RESPONSIBLITIES AND RESULTS: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Provide leadership and direct weld department operationsResponsible for the Weld schedule; adjusting staffing and work hours to meet schedulesResponsible for Weld department employees, including reviews and addressing concerns to provide a good work environmentWork with engineering to improve or correct weld quality, safety, or production issuesProvide a safe work place. Ensure training, regular communication, auditing for safe practices, and required inspection or completion of inspection findingsParticipate in capacity planning and efficient use of equipment and peopleAdminister company policies and procedures to ensure consistency with company directionCoordinates production activities with materials, purchasing, maintenance, engineering and quality to obtain optimum production.Plans and implements corrective actions for targets that are not achieved.Assists in the screening and hiring process of new hires for the operations group, as well as other key management and supervisory roles.Assists in the development of all subordinate supervisors by sharing knowledge and best practices, and suggesting training opportunities.Travels to customers and suppliers on short notice when needed.Ensures that safety standards are observed and enforced.Drives the improvement of safety, quality, housekeeping, teamwork improvement activities, attendance, and administrative procedures.Drive cost reduction through a systematic approach to identify and eliminate waste with continuous improvement in all processes and products provided by the company.Direct, lead, and maintain the team's 5S excellence and adherence.SKILLS AND KNOWLEDGE:Language Skills: Ability to read, interpret, and explain complex documents including but not limited to work instructions, blueprints, statistical data, CAD data, and CMM data.Mathematical Skills: Ability to utilize statistical tools and interpret complex sets of data including multiple variables.Reasoning Ability: Ability to apply common sense understanding to carry out complex written or oral instructions. Ability to deal with problems involving multiple variables in complex situations.Business Acumen: Understands the \"big picture\" impact of decisions -- how the key drivers of the business impact the company's financial statements.Communication: Excellent oral and written communication skills. Comfortable communicating in difficult situations in both individual and group settings. Consultation.Critical Evaluation: Use an objective and balanced approached toward analysis and decision makingLeadership and Navigation: Possess strategic awareness and the ability to lead a team to meet strategic goals.BEHAVIORAL REQUIREMENTS:Has high standards of performance for self.Takes responsibility for actions, results, and mistakes.Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress.Maintains positive relationships by constructively resolving conflicts.Uses feedback from others to continuously improve performance and work relationships.Moves within own and/or other work areas (flexes) to support plant flow.Works with sense of urgency to meet needs of customers.Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities.Maintains knowledge and skills to perform job effectively.Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.Looks for good in others; works collaboratively with others; shares information and knowledge.Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.SUPERVISORY RESPONSIBILITY: This position manages all employees of the department and is responsible for the performance management and hiring of the employees within that department. WORK ENVIRONMENT/PHYSICAL DEMANDS: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  While performing the duties of this Job, the employee is required to talk or hear. The employee is occasionally required to stand; walk; sit; or kneel. The employee may on occasion be required to lift under 50 pounds.  While performing the duties of this Job, the employee is in a manufacturing environment. The employee will be exposed to dirt, dust and noise. Proper personal protective equipment (PPE) must be worn hen required. REQUIRED EDUCATION AND EXPERIENCE:Minimum three years' experience as a Supervisor or ManagerBachelor's Degree in manufacturing or a technical field or relevant equivalent experience in weld operations within a manufacturing environment preferredSix to eight years relevant experience in an automotive manufacturing environmentWorking knowledge of all aspects of Industrial MIG Welding and weld robot operationsWorking knowledge of 5S, Continuous Improvement, and Quality Systems requiredOTHER DUTIES: Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}