{"jobID": "2733470310", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Senior Business Analyst - Data & Analytics", "companyRating": null, "companyInfo": {"Website": "www.aig.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (AIG) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Functional Area:IT - Information TechnologyEstimated Travel Percentage (%): Up to 25%Relocation Provided: NoAmerican General Life Insurance CompanyThe Business Analyst – Data & Analytics is responsible for supporting short and long term operational and/or strategic business initiatives. This role will develop, enhance, and maintain operational information and models that will have an impact on business decisions. Through the application of data analytics, joining disparate data sources, and working with raw data, this role will work to deliver valuable insights and recommendations to improve operational performance. This role will also be responsible for data governance, nomenclature, master data management and driving up the data quality, confidence and reliability of the organizations data assets.  The Business Analyst will work in highly dynamic environment, working closely with senior leaders, management, and line staff to understand root cause, propose recommendations for improvement, and develop solutions on key business challenges.  It is preferred that the candidate have skills/experience in analyzing and processing large data sets, familiarity with data structure, relational and non-relational databases, big-data concepts, cloud computing, open-source tools and data optimization techniques, excellent oral and written communication skills, client focus and the ability to support and enable teamwork. Must be self-motivated and able to operate independently but with a high degree of collaboration within IT and our Businesses  Responsibilities:  Support the Data & Analytics team in the areas of Data Services, Reporting Services, Data transformation & App IntegrationInterface well with business leads and Sr. management to ensure requirements are clearly understood, documented and solution design meets business requirements.Work independently with the Quality Assurance teams to ensure test plans and test data meets the need to establish sound data quality.Estimate project cost, resource requirements, budget/ forecasting and monitor project financials to ensure the group operates within budget.Ensure smooth, timely and compliant delivery for data sourcing requests.Partner with L&R; CTO team and ensure data/reporting/analytics standards, design patterns are implemented with high quality, high availability, scalability and reliability.Partner with IR / IMG PMO to ensure that all projects supported by the team meet the standards for documentation and communicate statusesCollect and manage status reporting to various stakeholders. The Ideal Candidate will have: Associate's or Bachelor's Degree in Computer Science, Finance, Engineering, Math, Physics, Economics and other related technical disciplines.10+ years experience as a seasoned Business Analyst handling large and complex data sets.Experience in waterfall and Agile methodologiesAbility to handle multiple priorities and adapt to a constantly changing environmentSelf-starter with the ability to work independently and take initiative. Ability to translate ideas and business requirements into business solutions.Experience with the full development life cycle of an application stack - from architecture through test and deployment.Strong skills in SQL and proven experience working with at least one of the major databases platforms (SQLServer, Oracle, DB2, MySQL, Sybase, or Postgres)Experience with key reporting solutions including Cognos, Qlikview, and Power BI.Deep understanding of database and analytical technologies in the industry including MPP databases, noSQL storage, Data Warehouse design, BI reporting and Dashboard development.Strong analytical skills; ability to analyze raw data, draw conclusions, and develop actionable recommendationsExcellent written and oral communication skills, with the ability to communicate with management concisely and effectively.Articulate and bold with a friendly customer focused demeanorExcellent organizational skills. Knowledge of Life & Retirement or Annuities business a plus. It has been and will continue to be the policy of American International Group, Inc., its subsidiaries and affiliates to be an Equal Opportunity Employer. We provide equal opportunity to all qualified individuals regardless of race, color, religion, age, gender, gender expression, national origin, veteran status, disability or any other legally protected categories.  At AIG, we believe that diversity and inclusion are critical to our future and our mission – creating a foundation for a creative workplace that leads to innovation, growth, and profitability. Through a wide variety of programs and initiatives, we invest in each employee, seeking to ensure that our people are not only respected as individuals, but also truly valued for their unique perspectives.We consider qualified applicants with criminal histories, consistent with applicable law."}