{"jobID": "2565128682", "jobLocation": "Oakland_CA", "jobTitle": "Data Scientist - Human Services", "companyRating": "3.8", "companyInfo": {"Website": "www.mathematica-mpr.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "120000", "jobDescription": "Position Description Mathematica Policy Research is dedicated to improving public well-being by bringing the highest standards of quality, objectivity, and excellence to bear on information and analysis for our partners and clients. The company has been at the forefront of design and assessment of public policies and programs since 1968. Our data analytics have yielded actionable information to guide decisions in wide-ranging policy areas, from health, education, early childhood, and family support to nutrition, employment, disability, and international development. Come join our team and make important contributions to improving the design and operations of key public programs.  Mathematica seeks a data scientist with experience in the design, development and implementation of applied data science and advanced analytics efforts for data analytic and statistical programming projects within the human services domain. S/he will contribute to advanced analytic business development strategies, analytic projects, and strategic planning around analytic methods, technologies, staffing and training. S/he will design, develop, and deploy data-driven approaches to solve problems and answer important policy questions for clients using technologies in data mining, machine learning, predictive analytics, statistical modeling, analytics platforms, and business intelligence. Position Responsibilities:Oversee the delivery of scalable and real-time analytical information in support of client decision making and Mathematicas projectsManage data science projects and tasksContribute to business development efforts (proposals, strategies, capabilities) for data science opportunitiesLeverage technical expertise in applied data science and advanced analytics to build sound predictive analytical models and produce business intelligence solutionsApply a wide array of advanced data mining techniques (including supervised and unsupervised methods, dimension reduction methods, and social network analysis methods) in support of research and operational analytic projects.Contribute to methodological standards for the companys data analytics capabilitiesAdvise senior management on gaps in the companys current technical capabilities and recommend plans for growth through the adoption of new methodologies and technologyMentor and support the professional development of new and existing staff in data science and advanced analyticsPosition RequirementsMasters degree or PhD in relevant field preferred; strong statistical background5 years of experience in advanced analytics, data mining, predictive modeling, machine learning, or other data intensive analytical roleProven ability to design and leverage data science methods according to client needs and in support of client decision-makingExperience working with large-scale databases, big data frameworks, and toolsExtensive experience with SAS, R, SQL, and/or business intelligence tools in the application of machine learning, network analysis, text analytics and/or predictive modelingProven ability to effectively communicate design specifications and results of models to internal and external audiencesStrong record of proven leadership ability and excellent communication skillsPrior experiencing leading advanced analytical teams and/or engagements is highly desiredExperience formulating or contributing to proof concept analyses or demos is highly desiredExperience contributing to innovative analytical solutions is highly desiredExperience contributing to business development efforts and business proposals is highly desiredSubject-matter knowledge in a human services substantive area such as education, labor, family support field preferred To apply, please submit a cover letter, resume, writing sample, and salary requirements. We offer our employees a stimulating, team-oriented work environment, competitive salaries, and a comprehensive benefits package, as well as the advantages of employee ownership.  Various federal agencies with whom we contract require that staff successfully undergo a background investigation or security clearance as a condition of working on the project. If you are assigned to such a project, you will be required to obtain the requisite security clearance.  Available Locations: Princeton, NJ; Washington, DC; Cambridge, MA; Ann Arbor, MI; Oakland, CA; Chicago, IL  We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}