{"jobID": "2827390289", "jobLocation": "Escanaba_MI", "jobTitle": "Physical Therapist (PT)", "companyRating": null, "companyInfo": {"Website": "www.selectrehab.com", "Headquarters": "Glenview, IL", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " \"Job Description: Physical Therapist (RPT)Requirements: Master of Science Degree in Physical Therapy or Bachelors Degree inPhysical Therapy Must hold state licensure in Physical Therapy.Supervision: Physical Therapist is responsible for their direct clinical skills, documentation skills, and the compliance to all professional standards. The PT is responsible for supervising the Physical Therapy Assistant and Rehab Aide. The PT will report to the Regional Manger for Paid Time Off approval, staffing, daily facility and corporate operations.Job Description:  The RPT is responsible for the evaluation and treatment of residents who demonstrate disorders of musculoskeletal deficiencies, neurological conditions, balance disorders, and transfer/gait deficits. Evaluation and treatment will only be conducted after a written order is received from the physician. The RPT is responsible for the screening of residents of the facility: The RPT is responsible for the completion of all necessary documentation: The RPT is responsible for attending all required facility meetings and in-services, including Medicare meetings, patient staffing, family meetings, care plans. The RPT will in cooperation with the Regional Manager, develop programs appropriate to the needs of the residents in the facility, to assist them in achieving their highest feasible level of functioning. The RPT will assist the facility in meeting the standards necessary to obtain state, federal, and other appropriate certifications. The RPT will employ and follow all appropriate facility infection control policies and procedures and will respect and follow OBRA Residents Rights Guidelines. The RPT is responsible for the appropriate scheduling of residents on caseload in addition to all required in-services and meetings. The RPT will contact the Regional Manager if productivity levels consistently fall below or exceed the standard to indicate the need for additional staffing or the need for assistance in screening and identifying residents in need of PT services. The RPT is responsible for the scheduling and completing of in-services for facility staff education. The RPT will present her/himself in a professional manner at all times including professional conduct, professional communication, and appropriate dress while in the facility. Other duties as assigned. \""}