{"jobID": "2799469452", "jobLocation": "Auburn_Hills_MI", "jobTitle": "Leasing Manager", "companyRating": null, "companyInfo": {"Website": "www.beztak.com", "Headquarters": "Farmington Hills, MI", "Size": "501 to 1000 employees", "Founded": " 1940", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Paragon Properties, Broder & Sachse Real Estate, Brookdale Senior Living"}, "estimatedSalary": null, "jobDescription": " The Leasing Manager is responsible for achieving and maintaining occupancy goals of the community. This position builds and implements a comprehensive advertising and marketing plan that includes both internal and external marketing and generates required traffic. The Leasing Manager reviews the tour process, examines closing techniques and achieves closing ratios consistent with company standards. The Leasing Manager is also responsible for completing and maintaining an up to date market survey that contains the most accurate and detailed information. ESSENTIAL FUNCTIONS:Leads the training and professional development of self and the leasing staff. Complies with policies in a positive manner.Assists in maintaining a motivational atmosphere in the workplace.Provides and receives open, positive, direct feedback to all team members.Assists in the organization and preparation of move-in, renewals and the move-out of our residents to ensure that the process is a positive experience, (worthy of referral) for our residents.Maintains a strong knowledge of, and accurate database within, all relevant operating systems including Yardi, lead tracking software etc.Assists in the creation of interesting newsletters and social media updates, on-target social events and rent collection, remembering that each of these interactions with our residents should be very positive.Assists in resolution of resident concernsAssist the Property Manager in the pursuit of opportunities to increase income, decrease expenses or add to the overall value of the community whenever possible.Review all reports/leases prior to approval.Maximize the rent roll by monitoring the market and the product as it becomes available and make recommendations to the Property Manager regarding increasing rental rates, (for new leases and renewals), decreasing specials, (if any) and/or changing lease term limits.Maintains awareness of market trends and competitors advertising and strategies. Respond appropriately with action, in order to keep your community in the position of market leader, rather than surviving the market. Ensure that proactive marketing is an integral part of the sites strategic/action plan.Keep the marketing plan/book updated.Ensure that the Leasing office, clubhouse and models present well at all times. (Music, refreshments, cleanliness, etc.).Process all applications adhering to company guidelines and policies. Unauthorized specials, deposits, etc. should not be offered or condoned.Produce weekly measurable results, including leasing apartments weekly. Perform with excellence on the phone, in-person, in follow-up and all other pertinent areas. Request training and brainstorm solutions for any non-performance issues.Personally audit apartment homes, models, amenities and grounds daily to assist the Property Manager and to ensure that excellence is visibly demonstrated. Provide feedback and assist in appropriate planning, recording and corrective action.Successfully manage and foster relationships with third party referral companies/businesses.Communicates effectively with Marketing Director to ensure that all site promotion falls within company standards.PERSONAL QUALITIES:Flexible, innovative and demonstrates the ability to lead and manage.High integrity, positive attitude, mission drive and self-directed.Passion, dedication and commitment for providing seniors an engaging, enlivening and captivating living environment.Ability to identify issues before they occur.Able to handle problems as they arise in relation to the operation of the community and collect data, establish facts, draw valid conclusion and make changes to prevent the problem from occurring again.SUPERVISORY RESPONSIBILITIES:Direct all leasing staff in the successful operation of the department.Responsible for assisting with interviewing, hiring and training employees; planning, assigning or directing work; appraising performances; rewarding and coaching employees; and addressing complaints and resolving conflicts.QUALIFICATIONS AND EDUCATION:Bachelors degree from a four year college or university preferred but not requiredTwo years of experience in the industry or a related field.Working knowledge of the industry.Excellent verbal, written and listening skills.Proficient computer skills including but not limited to Microsoft Word, Excel, PowerPoint, Outlook and Yardi.PHYSICAL DEMANDS AND WORK ENVIRONMENT:The position is required to regularly sit for long periods of time, walk, and communicate with residents, staff, family members and the public."}