{"jobID": "2788981751", "jobLocation": "San_Antonio_TX", "jobTitle": "Value in Prospecting Data Analyst", "companyRating": "2.6", "companyInfo": {"Website": "www.frostinc.com", "Headquarters": "Grand Rapids, MI", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "As a Value in Prospecting (VIP) Data Analyst with Frost, you will be part of a team working together to support and enhance business development efforts across the company. Further, you will be responsible for providing thought leadership in building a database to support the development and enhancement of a prospecting system. Responsibilities will include managing prospect database; developing tables and data standards to allow interface with other systems; determining appropriate data structure to facilitate updates and retention of history; pulling data needed for analysis and reporting from multiple systems and file formats; ensuring data integrity and consistency is maintained; developing quality controls around maintenance of information housed in prospecting tables; and interfacing with external and internal data reps for integration of prospect data from multiple resources. The candidate will facilitate linking of prospecting activity to new relationships for tracking prospect calls and data history; interpret results from data analysis and formulate recommendations; and extract data from various systems to meet reporting requirements.Required:* Proficient in Microsoft computer applications* Bachelor's degree in Information/Database Management, Finance, or Statistics, or equivalent work experience* Working knowledge of data processing concepts and terminology* 2-3 years experience coding using Structured Query Language (SQL) database management* Exposure to data warehouse* Experience acquiring, cleaning, and analyzing data from a wide variety of sources* Familiarity with Extract, Transform, and Load (ETL) processesPreferred:* Working knowledge of geo-coding systems and procedures* Working knowledge of the Cognos reporting tool* Experience optimizing complicated SQL statements* Basic knowledge of Teradata SQL and database management utilities* Basic knowledge of data warehouse practices and procedures"}