{"jobID": "2829013791", "jobLocation": "Roseville_CA", "jobTitle": "Data Conversion/Integration Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.certent.com", "Headquarters": "Pleasanton, CA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Welcome! We're glad you're interested in becoming a part of the Certent team as our Data Integration Analyst.  Based out of our offices in Roseville, CA or remote from the Danbury, CT area, your primary responsibility will be to convert customer data from customer’s source system to our industry-leading platform. Your technical data migration and organizational skills will ensure the customer’s data is converted efficiently and accurately on to the Certent platform. Position reports into the Manager, Conversion Services.  Remote positions will be considered for candidates with equity compensation experience and/or extensive data migration experience. What You’ll Do: Data Conversion/Integration/Migration Guide clients on extracts and reports required from legacy systems.Create mappings from legacy system to Certent import templatesWork with various types of data formats such as Excel spreadsheets, .csv files, Access databases as well as extracts from SQL Server or other relational databases.Write SQL scripts to update data and convert provided data to Certent software formatsUtilize Dell Boomi and other data mapping tools to transform data and optimize transaction flowsSuccessfully works to automate manual integration and/or migration processesManage multiple projects and establish priorities Communication Communicate with clients to scope, develop, test and implement conversionEffectively communicate with Implementation Managers to keep project on targetContinually drive improvements in the implementation processMeasure and monitor individual conversion performance and results including length of conversion to ensure client satisfaction with conversion servicesCollaborate via phone and email with clients throughout the conversion process Data Reconciliation Ensure client’s data is converted accurately and within deadlines established by Implementation Manager.What You’ll Need:2-5+ years of data management/analyst experienceDemonstrated project management skillsStrong SQL knowledgeBA or BS degree requiredExcellent written, oral and presentation skillsSolutions focused approach to creative problem solvingStrong organizational and multi-tasking skills required to successfully lead in a fast-paced work environmentAbility to determine priorities on a daily basis to achieve business objectivesEquity compensation or financial data experience a plus but not requiredJavascript, Groovy or equivalent experience highly desiredExperience with Dell Boomi or other technologies such as (Informatica, SSIS, Mulesoft) a plus but not required"}