{"jobID": "2655900931", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist - Health", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "168000", "jobDescription": " Samsung is seeking a passionate and collaborative Data Scientist to join our Health team in Mountain View, CA.  As a cross-disciplinary Health-focused product development team consisted of research, technology, design, strategy and product functions, we define the next generation of Health services experiences for Samsung products.  Learn more by clicking here: http://www.samsung.com/global/galaxy/apps/samsung-health/  As a Data Scientist, you will work very closely with the product team, marketing team and the UX team to help evaluate and provide insights related to promotion performance, product priority, UI/UX effective and user satisfaction. You will be also be expected to develop algorithms to improve the effectiveness of the promotions and customize user experience. If you love working directly on large scale consumer-facing products, wed love to meet you. Team Vision and Core Values Team Vision Organization: Be the most impactful product team at SamsungService: Empower our users to elevate their health, every day Team Core Values Teamwork: Team and project first. Help others while maintaining your own prioritiesCommitment: All in. Be a trusted professional who delivers whats promised on time and with the highest level of qualityAdaptive: listen and separate signal from noise, embrace uncertainty and be flexible about your approach while maintaining strategic focusResponsibilities Include:Work with large-scale usage data and process data in Hadoop cluster environmentApply machine learning and data mining techniques to derive insightsFulfill common business intelligence requirementsTroubleshoot issues, implement fixes, and apply enhancements to data platform systemsInvestigate cutting-edge technologies for our productsDevelop reports and visualizations of the analytics reportExperience Requirements:M.Sc. or PhD student in data mining/machine learning3+ year experience in data mining or data analytics.Strong programming skills in one or more of Java/Python/Scala/RStrong foundation in machine learning and data mining algorithmsSolid background in SQL/NoSQL databasesExcellent communication and interpersonal skillsPreferred Experience Requirements:Hands-on experience with Amazon Web Services big data stackHands-on experience with big data technologies such as Spark, Kafka, Hadoop, Hive, PigHands-on experience with data visualization such as Zeppelin, Kibana, Tableau, Qlik or Looker Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}