{"jobID": "2780445015", "jobLocation": "San_Francisco_CA", "jobTitle": "Economic Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.trulia.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Realtor.com"}, "estimatedSalary": "74000", "jobDescription": " About the roleTrulia is seeking a Data Analyst to join our Housing Economics Research team. If you are passionate about telling stories through data, have experience crunching large datasets, have gone deep with spatial data, are curious about issues related to housing, real estate or cities, and are looking to expand your analytical toolkit we would love to hear from you. In this position, you will have the opportunity to: Develop new competenciesCreate high-visibility productsCollaborate with multi-discipline areasGrow your careerPitch new ideasWork on meaningful initiativesSee products through the entire processUse the latest technologies You will use your analytical skills, enthusiasm for telling stories through data and knowledge of economics and statistics to build Trulia's brand and credibility. You will work closely with the rest of the research team to respond to data requests, conduct analysis on housing trends, and build data that drives local insight into neighborhoods. In partnership with the Trulia's Public Relations and Communications team, you will develop data and content for the research blog.About the teamTrulia's research team is comprised of economists and analysts passionate about telling stories concerning the housing market using a wealth of proprietary and publicly available data. We work closely with our PR and Communications team to build Trulia's brand and credibility through original content on our research blog and as media spokespeople. Our research has been covered by premier news outlets such as the Wall Street Journal, Bloomberg, the New York Times and The Atlantic's CityLab.Who you are- You have an undergraduate or Master's degree in the social sciences or a quantitative field (e.g. economics, political science, urban studies, statistics, applied math, or engineering). You have 1-3 years of work experience in economic analysis, real estate, data science, quantitative research, or urban analytics.You have strong analytical skills including expertise in Excel, comfort using SQL and an understanding of relational databases, fluency in GIS, and experience using a scripting language such as R or Python.Experience with geospatial analytics software such as QGIS or PostGIS, or packages such as PySAL or GeoPandas.You are well-versed in economic theory and statistical methods, either through coursework or on-the-job experience.You have demonstrated experience deriving insights from large, complex datasets, including publicly available microdata.You have strong written and verbal communication skills and enjoying working with multi-functional teams.You are passionate about housing, real estate, or urban affairs.Bonus:Have experience creating compelling data visualizations using Tableau, D3, or Carto.Familiarity with command line tools and version control.Building and maintaining internal databases.Get to know usAt Trulia, we believe that when it comes to finding a home, what’s outside the front door is just as important as what’s behind it. That’s why we go beyond the typical listings and source insights straight from locals. We offer over 34 neighborhood map overlays to give people a deeper understanding of what living in a home and neighborhood is really like. We’re committed to helping people discover a place where they’ll love to live and where they will feel more connected to the community and to each other. It’s why we strive every day to help build a more neighborly world. Launched in 2005, Trulia is based in San Francisco and is owned and operated by Zillow Group.Zillow Group is owned, fueled and grown by innovators who help people make better, smarter decisions around all things home. We encourage one another at every level, and our efforts are supported by employee-driven, world-class benefits that enable us to enjoy our lives outside the office while building fulfilling careers that impact millions of individuals every day.  Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know."}