{"jobID": "2820906298", "jobLocation": "Santa_Clara_CA", "jobTitle": "Research Scientist - Intern", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": " Research Scientist - InternJob Description  Technical intern with core Machine learning skills and applying ML based solutions to different problem domains.  Responsibilities will include quickly coming up to speed in a new domain and proposing solutions or modifications to existing solutions to meet latency, speed and quality criteria as outlined in the problem domain Qualifications You must possess the below minimum qualifications to be initially considered for this position. Experience listed below would be obtained through a combination of your school work/classes/research and/or relevant previous job and/or internship experiences. Minimum Qualifications: The ideal candidate must be pursuing a PhD degree in Computer Science or Data Science.  Must have strong programming skills with excellent handle on Python and ML based tools  Must have strong computer architecture / compiler / system background and prior work experience working on functional and timing accurate simulators  Inside this Business Group  Intel Labs is the company's world-class, industry leading research organization, responsible for driving Intel's technology pipeline and creating new opportunities. The mission of Intel Labs is to deliver breakthrough technologies to fuel Intel's growth. This includes identifying and exploring compelling new technologies and high risk opportunities ahead of business unit investment and demonstrating first-to-market technologies and innovative new usages for computing technology. Intel Labs engages the leading thinkers in academia and industry in addition to partnering closely with Intel business units.  Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}