{"jobID": "2821544248", "jobLocation": "Kalamazoo_MI", "jobTitle": "Business Analyst Data & Analytics", "companyRating": null, "companyInfo": {"Website": "www.businessimpactinc.com", "Headquarters": "Chapel Hill, NC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Excellent Opportunity with Global Fortune 300 Medical Device Organization!  Business Analyst Data & Analytics  Located in Kalamazoo, MI  Great Career Advancement Opportunities  Relocation Assistance Available  Summary of Position  Our client is seeking a top talent who possesses an acute sense of urgency, attention to detail, and strong analytic skills with a customer service orientation. This role provides a unique opportunity to work cross divisionally and build relationships with both internal and external customers. The primary responsibilities include developing data models, reports, dashboards to analyze business problems/scenarios and recommend solutions. This position works closely with both internal and external customers and requires significant analytical ability, attention to detail, focus on continually improving reporting and a drive for complete accuracy in work product. This role offers an excellent opportunity to add value and join a highly competitive team with a focus in Analytics and Reporting. RESPONSIBILITIES: Provide analysis of customer information, sales information, and historical pricing levels to our client and their divisions within a specific operating group.  Serve as a key process and system resource including the development of reporting templates (using Power BI, SAP BW, Excel), matrix formats, and KPIs as necessary.  Understand existing data models and assist in development of new data models.  Demonstrate proficiency utilizing available tools to support reporting and analysis.  Provide recommendations and interpretations of the data or information provided/collected.  Participate in development of processes and mechanisms for data cleansing, and pro-active monitoring of data quality.  Respond to all ad hoc requests for data from the divisional business teams, and internal team members.  Follow processes and procedures to support, streamline, and in some cases automate, analytic and measurement strategies.  Owner of process improvement projects that will drive efficiency amongst the team.  Engage customer as needed relative to inquiries surrounding reporting, data requests, contract pricing, etc.  Document and maintain process instructions that will assist in the training of new analysts.  Provide exceptional service to both internal and external customers. REQUIREMENTS: Bachelors degree in Computer Information Systems, Business Analytics, Data Science, Business, Accounting, Finance, or related discipline  1 to 3 years accounting or data analysis experience, medical manufacturing/healthcare environment preferred.  Ability to analyze and synthesize large amount of complex quantitative/qualitative data and research findings into easy to understand, actionable fact-based recommendations and strategies.  Experience with information systems, data integration technologies; knowledge of data warehouse concepts and some level of experience with data warehouse technologies.  Must have Strong and Effective presentation, written, verbal communication skills, including the ability to explain data and findings to multiple levels of management.  Experience with reporting and visualization tools such as Power BI or Tableau.  Exceptional skills with data management, pivot tables, and advanced functions in Excel.  Basic data modeling and fundamental core database concepts.  Experience working with business functions (e.g. sales, marketing, finance).  Ability to prioritize work and keep accurate, detailed, and confidential records.  Must be able to understand and work within complex interdivisional procedures and policies.  Must be able to learn quickly.  Must be able to build interpersonal relationships across the organization. Preferred Qualifications: Advanced educational degree/ industry certification in the field of data/business analytics.  Basic/working knowledge in using Statistical packages (R, SPSS, MATLAB).  Experience in B2B sales and financial data analysis to solve business problems.  Experience with writing and understanding SQL scripts.  Experience with DBMS/RDBMS technologies."}