{"jobID": "2822986963", "jobLocation": "Princeton_NJ", "jobTitle": "Cardiovascular Medical Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives. Responsibilities:As lead for NVAF strategy, the incumbent will partner closely with key internal stakeholders, including WW Medical, US and WW Commercial and the Alliance Partner to develop strategic plans and to execute medical plan related to NVAF.Manages 1-2 Eliquis Medical ScientistsCooperates with cross-functional medical team members to deliver key medical activities related to NVAF, including advisory boards, congresses, proactive messaging, reactive medical communication, publication strategy.Anticipates needs of field medical team, including training and contentEffectively partners with commercial organization on both strategy and execution related to NVAF and in light of evolving healthcare landscape.Engages with external Thought Leaders to gather insight into unmet medical needs and educational gaps related to diagnosis and treatment of NVAF.Leads the annual medical strategy planning process and works closely with Medical Lead to ensure coordinated execution of the plan by members of the extended US Medical matrix team.Qualifications:MD/PharmD/PhD or equivalent degree with experience in cardiovascular disease and/or thromboembolic disease.At least 10 years of clinical experience in cardiovascular or thromboembolic disease or industry experience in research and development or medical affairs is preferred.Experience working within an Alliance or Joint Venture would be extremely desirable.Critical thinking skills related to data are a must.Strong interpersonal and communication skills.Proven leadership in managing complex interactions and gaining alignment of stakeholders."}