{"jobID": "2802783060", "jobLocation": "San_Francisco_CA", "jobTitle": "On-Call Courier : San Francisco, CA", "companyRating": "3.8", "companyInfo": {"Website": "www.logistics.dhl", "Headquarters": "Bonn, Germany", "Size": "10000+ employees", "Founded": " 1969", "Type": " Subsidiary or Business Segment", "Industry": " Transportation & Logistics", "Revenue": " $10+ billion (USD) per year", "Competitors": " FedEx, UPS"}, "estimatedSalary": "97000", "jobDescription": " 60417What makes DHL great? Our People! Enjoy the flexibility, innovation and fun we encourage and promote in our work environment. Our corporate culture is about personal commitment to our business, to each other and to our communities. DHL is dedicated to being a great place to work. In addition to competitive salaries, our employees enjoy a range of programs, services and benefits that bring the best to their personal lives. Start YOUR career with DHL today  DHL currently has opportunities available for On Call/Casual Couriers for our San Francisco, CA Service Station location. The Courier will be responsible for following standard company procedures and safety requirements while picking up and delivering time sensitive materials in a timely and efficient manner. Key Responsibilities: Under tight deadlines, drives vehicle to customer sites, climbs in and out of vehicle, and walks up and down stairs as required to pick up and deliver documents and packages to and from customers according to established procedures, in all weather conditions  Picks up, handles and delivers time sensitive documents and packages in a safe and punctual manner considering traffic patterns, alternative routes, traffic regulations, and driving conditions in order to meet customer and DHL time requirements  Ensures all delivery material received is safely delivered to correct consignee  Operates a scanner to record shipping and package information for all documents/packages picked up or delivered  Reports any suspected breach of security or unusual happenings to supervisor immediately  Maintains good work habits, including reporting to work on time and adhering to standard work and safety procedures  May assist supervisor in orienting, training, assigning and checking the work of lower level courier guards  May assist in training new courier guards and performing check rides with them to review performance and the proper use of routes and practices. Key Skills & Requirements: High School Diploma or Equivalent (GED) required  Prior delivery driving experience required  Strong customer service skills are required  Valid drivers license and good driving record is required  Class B CDL license preferred  Hazmat endorsement preferred  Must pass pre-employment and TSA background and drug screening.  Must also pass medical physical. Physical Requirements: Must be able to lift up to seventy (70) lbs. occasionally  Must be able to lift forty (40) lbs. frequently  Must be able to walk, climb stairs, reach overhead, squat, bend, kneel, stoop and crouch repeatedly  Please note a resume is required to apply for all DHL positions.  If you do not have a resume readily available, please visit: http://dhl-resumebuilder.com  This program will work on both Windows and Mac operating systems.  DHL is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, and other protected characteristics."}