{"jobID": "2817704669", "jobLocation": "Irving_TX", "jobTitle": "Data Analyst Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "104000", "jobDescription": "Job Description What you'll be doing...  Your role is to deliver value to Verizon and its customers through business intelligence reporting and analytics. You will be part of the Workforce Planning and Analysis team to drive strategic insights and develop operational efficiencies. You'll be part of team that leads the advancement of analytics in understanding the past to predicting the future. You will be responsible for processing and performing statistical analysis of data to discover how data can be used to draw conclusions, drive decisions, solve business problems and achieve outcomes. Develop strong understanding of Verizon Consumer Markets organization and the key performance indicators and metric.Work closely with client teams to help translate raw enterprise data into meaningful analyses and insights for consultation with clients and company leaders.Use of various visualization techniques for presenting data and analysis.Collaborate with internal IT Teams on developing an approach to design, create and maintain reporting dashboard that are used throughout the company.Provide suggestions to improve reporting best practices and work as part of team responsible for ongoing process improvement efforts. What we're looking for...  You are good with numbers and you love to dig into data to find the story. Designing reports and dashboards is a fun afternoon for you. You are detail-oriented and know how to focus on what really matters. You understand the importance of accuracy in data analytics and reporting. You are a self-starter and a multi-tasker who can work independently under tight timelines. You want to make an impact by providing the data that will help improve the experience of our customers. You enjoy aligning various works streams to ensure the same vision and goal is achieved. You'll need to have:Bachelor's degree in a related field or four or more years of work experience.Six or more years of relevant work experience.Experience writing SQL and reviewing code stored procedures.Experience with data; mining, infrastructure, visualization and analysis.Even better if you have:Master's degree.Ability to compute, analyze and interpret complex and disparate data to produce relevant and consumable reports and dashboards.Experience with data governance, quality and security.Experience Hadoop, Hive, Spark, Python, Kyvos, Cognos, Tableau and PowerBI.Implementation and support using SQL Server and SQL Server Analysis Services (SSAS).SQL Server Integration Services (SSIS); historical data conversion to new systems of record; system reporting using SQL Server Reporting Services (SSRS). When you join Verizon...  You'll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America's fastest and most reliable network, we're leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we're about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon.  Equal Employment Opportunity  We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}