{"jobID": "2815790079", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist - Genomic Medicine", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " The primary purpose of the Research Scientist position is to apply analytical and computational biology expertise to plan, coordinate, design and carry out research project(s) as they pertain to the analyses related to genomic and epigenomic characterization of cancer patient samples.  The mission of The University of Texas M. D. Anderson Cancer Center is to eliminate cancer in Texas, the nation, and the world through outstanding programs that integrate patient care, research and prevention, and through education for undergraduate and graduate students, trainees, professionals, employees and the public.  Key Functions Compiles, writes, and submits reports to superior as directed and assigned. Investigations focusing on but not limited to determination of chromatin states, DNA methylation patters, higher-order chromatin structure and genomic alterations and their impact on patient outcomes. Works closely with and instruct students, technicians and staff members with scientific protocols and equipment currently used to perform these protocols.Participates in various scientific research projects to transform the approaches to improving cancer patient outcomes through research, integrating genomic and epigenomic information with clinical data. This may include supplying the following: a) specific information as part of a layer project; b) answer questions in a limited field; or, c) develop improved analytical approaches.Assists the principal investigator with scientific business on a daily basis to include: write and edit manuscripts, abstracts, protocols (animal and laboratory), and grants; compile, write, and submit reports to the principal, analyze and manipulate research data; prepare and present data for publication or scientific meetings; maintain current and accurate records of research data; and, obtain and distribute pertinent research materials/data.Contributes to project team.Employ safe laboratory practices.Maintain research records and laboratory notes.Ability to analyze, interpret and present data at laboratory and departmental meetings.Interacts closely with other research staff across institutional functional teams. Working Conditions This position requires : Yes  No  Working in Office Environment X Working in Patient Care Unit (e.g. Nursing unit; outpatient clinic) X Exposure to human/animal blood, body fluids, or tissues X Exposure to harmful chemicals X Exposure to radiation X Physical Demands  Indicate the time required to do each of the following physical demands:  Time Spent  Never 0% Occasionally 1-33% Frequently 34-66% Continuously 67-100% Standing X Walking X Sitting X Reaching X Lifting/Carrying  Up to 10 lbs. X 10lbs to 50 lbs. X More than 50 lbs. X Pushing/Pulling  Up to 10 lbs. X 10lbs to 50 lbs. X More than 50 lbs. X Use computer/keyboard XEducation Required: PhD in one of the natural sciences or related field or Medical degree. Preferred: PhD in computational biology with expertise in machine learning approaches and biostatistics.  Experience: With PhD, no experience required. With Medical degree, two years of experience in experimental or scientific work.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.htmlSDL2017"}