{"jobID": "2647088522", "jobLocation": "San_Francisco_CA", "jobTitle": "Director of Engineering", "companyRating": "4.9", "companyInfo": {"Website": "www.patreon.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "193000", "jobDescription": "We believe that people who make great things should get paid for the value they give to the world. Patreon is a membership platform that makes it easy for artists and creators to get paid for their work. We strive to provide creators with insight, education and tools that make it fast and easy to run their creative business, so that creators can focus on making art. And it’s working. Last year, we paid over $150 million directly to creators.Patreon aspires to be among the tech industry’s most inclusive work environments. To learn how we're working towards this, please click here!We make it easy to make Patreon better. We build fast and emphasize shipping. We continuously deploy to production. We support each other while fostering ownership. We work on projects we’re passionate about, fix problems as we see them, and collaborate with the rest of the company to ship amazing things.We work hard to maintain a bottom-up decision-making culture. We believe that hiring smart, ambitious people, and giving them strong ownership of their work, with a clear vision and great tools, leads to the best results.What you will do:Help our employees be happy, productive, and growing.Create and maintain an effective and enjoyable engineering culture.Recruit, hire, and retain top tier talent.Help engineers and engineering managers advance their skills and careers.Constantly improve our team practices and effectiveness.Work with people from all walks of life.Focus on problems that will foster your career growth and get feedback and support from the rest of the company.What skills we ask for:You have experience managing technical people and managing engineering managers.You know what makes engineers and managers happy and love building teams.You know how to recruit from all backgrounds and interview consistently and without bias.You've helped your reports learn new skills, either directly or by getting them mentors.You have opinions on what makes effective programming and testing practices.You have experience building inclusive team cultures.You are smart about scheduling and planning.You dislike dogmatism.You care about building great products that matter.What you will be able to accomplish:You will build a team that builds a product that helps creators pay rent and enables higher levels of creativity.You will help us build a great engineering culture and a great company.You will help us participate in technical communities and build a strong engineering brand.Who you’ll work with:An energetic team full of passion for our product.Teammates who excel not only at their job but often have artistic or other talents.People who genuinely care about and support each other. Our team has a multidimensional org structure so that managers, engineers, and product thinkers can each excel at their own specialty, have impact, and be recognized accordingly. Our stack includes Python, Flask, MySQL, AWS, React, Redux, and much more. If you think you’re capable of excelling at these tasks and would like to join our team in San Francisco, please apply below."}