{"jobID": "2797459596", "jobLocation": "Chicago_IL", "jobTitle": "Call Center Data Analyst", "companyRating": "2.1", "companyInfo": {"Website": "www.chicagolighthouse.org", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 1910", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "42000", "jobDescription": "Title: Call Center Data Analyst Reports to: Assistant Director, Call Center Planning and Analytics Department: Call Center Operations Statement of Purpose: The Call Center Data Analyst will be responsible for aggregating metrics from multiple data sources into comprehensive, cohesive reports that will be distributed to internal Chicago Lighthouse leadership and external clients. The analyst will also work closely with internal IT and Telephony support to maximize system uptime for all call center systems. Key Responsibilities:Generate daily, weekly, and monthly production reports for multiple call center accountsCollaborate with IT support staff to minimize operational impact of technical issuesProduce internal departmental efficiency reporting and provide timely, accurate reports to all levels of Chicago Lighthouse leadershipMonitor and report on the current state of departmental work queuesMaintain up-to-date listings of call center staffing rosters, queue assignments, and client contacts necessary to meet all reporting requirementsGenerate monthly invoicing, reports from Contact Center databases.Qualifications:2+ years of call center operations experienceOutstanding detail-oriented data entry skillsStrong understanding of database concepts (data types, file formats, etc.)Proficiency with Microsoft Office Suite software, especially MS ExcelDemonstrated understanding of call center analytics, including Service Level, Abandonment Rate, and Average Handle TimeStrong written and verbal communication skillsExperienced in creative problem-solving in a fast-paced business environmentAbility to work well in teams and independently with guidance from leadershipEducation:Associates Degree or equivalent experience preferredThe Chicago Lighthouse for People Who Are Blind or Visually Impaired is an Equal Opportunity Employer in full compliance with local, state, and federal Civil Rights & Affirmative Action laws. The Chicago Lighthouse maintains a strong policy of accommodation and a consistent practice of employing qualified individuals with disabilities."}