{"jobID": "2787989660", "jobLocation": "San_Francisco_CA", "jobTitle": "SDET", "companyRating": null, "companyInfo": {"Website": "www.ujet.co", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who We AreUJET makes it simple for any company to provide intuitive modern-day support. We eliminate the frustration of customer service and help companies retain customers, make their call center operate more efficiently, and save them money all at the same time.OpportunityAre you full of positive energy, curious, creative and ready to roll up your sleeves for a role in an early-stage, fast-paced start-up poised for explosive growth? UJET is looking to hire a Software Development Engineer in Test (SDET). As an SDET, youll take on the opportunity to build or enhance one or more test frameworks that ensure our application and SDK are accurate, robust, scalable, performant, and deployable. The ideal candidate for this role has extensive software development experience in Ruby and a strong interest in working with test frameworks. We are located in a fun, high-energy creative space, and steps away from Powell BART station in San Francisco and offer competitive salaries and benefits.Responsibilities Architect, design, build and maintain clear and reliable automation frameworks/scripts for complex mobile and web based applications from scratch to make testing processes effective and efficient to deliver high quality software fasterDefine road maps and detailed implementation plans in collaboration with SDET, QA engineer, SRE, and developer for QA automation strategy and implementationResearch and contribute ideas for continually improving code quality and automation test performanceWork closely with both technical and nontechnical membersCreate accurate and detailed bug reports when issues are identifiedIntegrate automation tests with CI pipelineInteract with various levels of individual contributors and management to educate and influence automation test strategyQualificationsProficient in Ruby, RspecBachelor's Degree in Computer Science, Engineering, or related field7+ years hands on software engineering background with solid understanding with algorithms and data structure and is capable of developing, maintaining, and shipping reliable automation tool with minimum guidanceSolid experience in server-oriented/backend developmentSolid understanding of CI processExperience with SQL and Relational DatabasesExperience with tools such as web monitoring, code coverage, and memory toolsExperience with REST APIExcellent written and verbal communication skills with both technical and non technical audiencesUnderstanding of Internet technologies and protocolsExperience with Objective-C, Swift, Java, Javascript, Rails, or Go is a plusExperience with cloud and virtualization technologies such as AWS is a plusExperience with docker is a plus"}