{"jobID": "2798642667", "jobLocation": "Dearborn_MI", "jobTitle": "Data Analyst", "companyRating": "4.6", "companyInfo": {"Website": "www.marketingassociates.com", "Headquarters": "Detroit, MI", "Size": "201 to 500 employees", "Founded": " 1967", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " MRM//McCann, Urban Science"}, "estimatedSalary": "70000", "jobDescription": "Job Description:SUMMARYThis role supports the business and IT integration for Intelligent Customer Interactions (ICI)ESSENTIAL DUTIES AND RESPONSIBILITIESProvides analytical and technical expertise in data integration, campaign execution, and reporting of customer data.Works with Data Operations, ICI Development, IT, and vendor teams to determine how data integration and reporting will be operationalized.Develop a deep knowledge of customer interaction data available for reporting. Council the business and IT on reporting and metrics development.Develop data flow designs and build ETLs using Alteryx data tool to support reporting needs.Create production reports using BusinessObjects and Qlikview reporting tools. Create ad hoc reports upon request.Create end-user reporting documentation.Provide training. Required Experience:QUALIFICATIONSDetail-oriented, with excellent multi-tasking and written communication skillStrong communication and people skillsSolid understanding of relational data models and data warehouse conceptsExcellent analytic and problem solving skills.Ability to recommend measures/metrics that can evaluate program/process effectiveness and value.Proficiency in Word, Excel and PowerPointEDUCATION AND/OR EXPERIENCEThree or more years of experience as business/data analyst in database marketing, reporting, and customer analytics areas.Preferred: Experience with consumer and or VIN oriented databases.Experience with running database queries against Teradata, SQL Server, DB2, and/or Hadoop.Preferred: Experience with using BusinessObjects, Qlikview, and/or Alteryx tools.ProactiveTeam PlayerGood ListenerInfluencerPreferred: MA / MS in Business Systems or work equivalent.Required: BA / BSOneMagnify is an equal opportunity employer. Keyword: ICI Data Analyst  From: OneMagnify"}