{"jobID": "2790160618", "jobLocation": "Grand_Rapids_MI", "jobTitle": "HRIS Analyst II", "companyRating": "3.9", "companyInfo": {"Website": "www.bissell.com", "Headquarters": "Grand Rapids, MI", "Size": "501 to 1000 employees", "Founded": " 1876", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " SHARK, TTI, Dyson"}, "estimatedSalary": "61000", "jobDescription": "Job Title: HRIS Analyst II Job Number:1800102Job Description:POSITION SUMMARY: (Summary description of the primary duties and objectives)  The HRIS Business Analyst II will be a second level, technical support for all functional areas of the Human Resources team. Provide system knowledge and recommendations to the team. Working cross-functionally, this role work with both Information Technology and Human Resources. The role supports key processes and accountabilities within BISSELL's HR systems, primarily in the areas of Human Resources (Manager and Employee Self Service), Compensation, Security, Talent Management, Benefits and Time and Attendance Management. Assist in the development of HR systems strategy and roadmap as well as standard operating procedures. Help manage the integrity of the data, security rights, configuration, integration, business processes & reporting requirements. POSITION PROFILE (Major duties, accountabilities, and responsibilities)  Analyze HR processes and make recommendations for improvements via the use of technology; oversees the specifications, development and implementation of new or redesigned systems, reports, and procedures for HR module users to ensure efficient business processes. Configure or modify business processes, setup rules, manager security, setup condition rules and notifications, interfaces and reports.  Work with the HR business owners and ITS technical staff to scope the technical work required to design, implement and document new processes or enhance existing. Responsible for change management of all system changes.  Responsible for proper administration of all of the Human Resources systems, including Oracle HCM, Halogen (performance, goals and compensation), learning systems, eTime Time and Attendance and ADP payroll.  Ensures quality, timeliness and proper use of HR information retrieved from systems, managing requests for reporting, ensuring security of HR information through established security protocols, and participating in issue tracking and resolution formulating for all HR systems.  Responsible for properly administering/maintaining the Global HRIS and the processes within the system, such as the associate onboarding, termination, transfer, and promotion processes.  Oversees the HR system's data tables, structures, systems updates and enhancements, files and interface requirements. Ensures seamless integration and integrity of the HR data system.  Scope, create, and validate required Human Resources reports as requested. Participate in creating system compliance reports.  Work with vendors on support related issues, new implementations, managed services, and upgrades.  May be required to perform other duties as assigned.Job Requirements:REQUIRED EXPERIENCE/EDUCATION: (i.e. degree, years of experience, etc.)Degree minimum: Bachelor's DegreeSpecific concentration: Information Systems, Business, or Science/Technical fieldExperience level: At least 5-7 years of progressive experience in Human Resources, Finance, Information Technology, or a related function. Experience with application systems and transactional processes in the corporate environment is required.PREFERRED EXPERIENCE/EDUCATION: (i.e. MBA, certifications, etc.)Experience with Human Resources Information Systems including performance management, time and attendance, and payroll preferred.Experience Oracle HCM highly desired.Experience with SQL or report building preferred.SPECIALIZED TRAINING OR SKILLS REQUIRED:Effective collaboration and influencing skills.Versatility with systems, interfaces, and processes.Ability to take initiative on assignments and opportunities to deliver results.Ability to lead cross-functional teams through influence.Technical knowledge and attention to detail are key to the success of an HR Systems Analyst.Excellent communication skills are also essential.Analytical, detail oriented, and understands the downstream impact of configuration and business process changes is a must.Ability to solve problems and apply creative solutions to potential problems.Project management skillsMust have excellent time management skills in meeting deadlines"}