{"jobID": "2829291212", "jobLocation": "Plainsboro_NJ", "jobTitle": "Customer Service Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.adecco.co.uk", "Headquarters": "GLATTBRUGG, Switzerland", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (ADEN) ", "Industry": " Business Services", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Adecco is currently assisting a local client in their search to fill a Customer Service Data Analyst role inPlainsboro, NJ. Apply now if you meet the qualifications listed below! Location: Plainsboro, NJHours: 8am-4:30pm OR 10am-6:30pm M-F Pay Rate: $17.50/hr Duration: 3-6 months with opportunity to end up long term/permDescription:Manage and Maintain customer RX Licenses daily.Perform research to determine adequate Rx licensure.Efficient, accurate and timely recording of data in designated ERP applications.Ensure all Audit and SOX rules are followed and adhered to.Maintain/update process documentation and work instructions.Provide feedback to department leadership as needed.Perform other related duties as assigned by management.The ability to act as an essential employee within the Customer Service Department.Requirements:High School Diploma/ Associates preferredMinimum 3 years of experience in Customer Service related roleRegulatory/Licensing experience preferredData Entry and Work Instruction creation experiencePrevious experience in a manufacturing company and/or in the medical device and/or pharma industry preferred. How to Apply: Click on \"\"Apply Now\"\" to be considered for this position or any other opportunities with Adecco.  IMPORTANT: This position is being recruited for by Adecco's National Recruitment Center, not your local Adecco Branch Office. To be considered for this position, you must use the \"\"apply now\"\" button to submit your resume. If you have questions about the position, you may contact the recruiter recruiting for this position listed above. For other opportunities available at Adecco go to company website.  If you have any questions surrounding the application process, please feel free to reach out to: Amanda Shoemaker at company website.  The Adecco Group is a global leader in HR services. Our group connects over 700,000 associates with our business clients each day through our 6,600 offices in over 70 countries and territories around the world. We offer employment opportunities at any stage in your professional career. Contact us today to discuss available contract and direct hire positions. Adecco Group provides one of the most comprehensive benefits packages in the industry to contract workers to include Holiday, 401(k), and Insurance Benefit Plans.  Equal Opportunity Employer Minorities/Women/Veterans/Disabled  More Information  Company Description:Adecco is the world’s largest provider of staffing solutions. But it’s not our size that makes us different, it’s our unwavering commitment to the businesses, job seekers and communities we serve.  Every day, we propel job seekers forward in their career and help America’s top employers attract, develop and manage the very best talent. Job seekers rely on us for exciting temporary, temp-to-perm and permanent opportunities, as well as career resources and advice. Businesses throughout the country and across all industries count on us for access to more than 9 million qualified candidates and an ability to deliver proactive and actionable insight into the economy and the job market. We also sponsor community and nationwide community service events to ensure opportunities for all.  We are proud of the fact that we connect more people with more jobs than anyone else, and know how important what we do is - not only to the economy and job market, but also to the lives and communities we touch"}