{"jobID": "2559739107", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.bigbear.io", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position requires US citizenship and candidate must have the ability of obtaining a DoD Top Secret SCI Security Clearance.BigBear, Inc. is a leading provider of big data computing and analytic solutions. We help people make sense of their data using our cloud-based platform and big data processing algorithms. Each day, we crunch massive volumes of structured and unstructured data into usable and actionable information for our customers. We currently have an immediate position for a talented and passionate Data Scientist to join our top-notch team of forward thinking engineers, data scientists, analysts, and innovators. We are seeking talented and motivated people who are passionate about their work and truly want to make a difference. The successful candidate will be a self-starter that demonstrates excellent communication, critical thinking, and problem solving skills with a strong drive for innovation.Job Requirements Active DoD Top Secret SCI Security Clearance. BS/MS in Computer Science, Mathematics, or related field. 3+ years experience with statistical programming language such as R or Python. Experience with data munging and transforming raw information to usable formats. Experience with machine learning and neural networks. Strong mathematical background and experience with calculus and linear algebra. Experience working in an Agile/Scrum development process.Preferred Experience with Apache Spark. Experience with geospatial and location-based data a plus. Experience with Elasticsearch and Kibana. Experience with Amazon Web Services a plus. If you are interested in this immediate opportunity, please submit your professional resume.BigBear is an Equal Employment Opportunity Employer/Veterans/Disabled"}