{"jobID": "2798397652", "jobLocation": "San_Francisco_CA", "jobTitle": "PRODUCT MANAGER, DATA SCIENCE", "companyRating": "4.6", "companyInfo": {"Website": "www.ultimatesoftware.com", "Headquarters": "Weston, FL", "Size": "1001 to 5000 employees", "Founded": " 1990", "Type": " Company - Public (ULTI) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " ADP, Workday"}, "estimatedSalary": "179000", "jobDescription": " Ultimate Software is looking for an experienced Product Manager to join our San Francisco office. You will work for the Data Science Team as product manager contributing to Xander, our HCM focused AI Platform. You will be responsible for working with our data science team and other product owners to drive the continued growth of the platform and development of new analytical models that enable intelligent HCM features.  Our ideal candidate is just as comfortable interacting with customers as they are designers and engineers. They have experience building and maintaining a roadmap with multiple streams of work as well as running priority negotiations across new feature delivery, enhancement and support needs. This role partners closely with other product managers, engineering and design and reports to Director of Product.  Here at Ultimate Software, we truly put our people first. We strongly believe in teamwork, and we encourage and trust our people to reach higher, learn more, and live up to their potential. Ultimate is ranked #1 on Fortune's“Best Places to Work in Technology” for 2018 and #3 on the“100 Best Companies to Work For” list in 2018. Ultimate is also ranked #1 on the Fortune’s“100 Best Workplaces for Millennials” for 2017 and #3 on its \"Best Workplaces for Diversity” list for 2017. Primary/Essential Duties and Key Responsibilities:Build, maintain visible product roadmapDelivery prioritizationRequirement analysisSome customer escalation interactionManage cross-team deliverables and dependenciesSome analysisRequired Qualifications:2 + years Product Manager/ Senior Product Manager experienceOwnership of a product roadmapExperience working in an Agile delivery model (Experience, Education, Certification, License and Training) Bachelor’s Degree in a business discipline or equivalent work experiencePreferred Qualifications:Experience working with and applying machine learning and analytical models to business problems.Experience working with teams of Data ScientistsPhysical Requirements: No unique physical demands are required for this job.Travel Requirements:10 % travel may be expected This job description has been written to provide an accurate reflection of the current job and to include the general nature of work performed. It is not designed to contain a comprehensive detailed inventory of all duties, responsibilities, and qualifications required of the employees assigned to the job. Management reserves the right to revise the job or require that other or different tasks be performed when circumstances change.  Ultimate Software will reasonably accommodate employees with disabilities as defined by the Rehabilitation Act of 1973, the Americans with Disabilities Act (ADA) and other appropriate statutes."}