{"jobID": "2829179109", "jobLocation": "Irvine_CA", "jobTitle": "Pricing Manager", "companyRating": "2.7", "companyInfo": {"Website": "www.kia.com", "Headquarters": "Irvine, CA", "Size": "501 to 1000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": "SUMMARY Develop pricing structure, concepts, proposals, and recommendations for all current and future products in coordination with Product Planning, Sales, Marketing, Finance departments and KMC that achieves profitability while accounting for profit targets, competitive market actions and sales targets. Develop analysis to identify opportunities to optimize new vehicle, option and PIO pricing, profit and market penetration. Develop and maintain competitive information, analyze competitive actions. Enter and verify pricing in SAP system. Communicate pricing actions and coordinate pricing activities. MAJOR RESPONSIBILITYDevelop and present pricing for current models, packages and options with Product Planner. Analyze product value added, competitive pricing, value trends, volume and residual targets, and develop KMA pricing concepts and strategies for future models that best balance internal strategies with external factors.Support development of short and mid-term profit planning with FOB recommendations to support dealer margins and KMA expenses. Ensure pricing accurately accounts for content FOB and value. Support negotiations with KMC and KMA dept.’s with price structure and profit expertise and recommendations for optimal positioning.Develop recommendations and necessary analysis/reports for PIO and factory option pricing i.e. competitive value, margins, market penetration, breadth of offerings, support programs. Support finance initiative to improve profitability.Verify accuracy of price structure and FOBs and accuracy of inputs into the SAP system and coordinate with KMC and KMMG.Provide analysis of competitive pricing, margins. Develop transaction pricing report and cross check performance against vision 2016 goals on a quarterly basis.Develop and evaluate value analysis – tracking models updated monthly and all models and options semi-annually with annual update of value table (also coordinate values with KMC).JOB REQUIREMENTSEducation:Bachelor’s degree.Overall Related Experience:5+ years’ experience in automotive, product planning, pricing, marketing, finance or related field.Directly Related Experience:Strong analytical skills.Expert spreadsheet analysis.Distillation of detailed data into executive summary reports.Expert negotiation and presentation.Pricing / financial analysis background.Automotive basic background.SKILLSAnalytical/mathematical skills critical.Advanced Excel skills critical.MS Access, PowerPoint skills and knowledge of Mtab, POLK, JATO, beneficial.Creative problem solving.Written and oral presentations.Teamwork. Kia Motors America offers an environment where we place a strong focus on our customer, embrace challenges and work collaboratively. If you’re looking for this type of a dynamic company, then Kia Motors America should be in your consideration for employment opportunities. Based in one of the nation's most desirable communities in Southern California. Our outstanding benefits package includes 100% paid health insurance, 401(k) plan, plus much more. EOE M/F/D/V. For more information about Kia, please visit our website at www.kia.com/ or kiajobs.com."}