{"jobID": "2414396502", "jobLocation": "Washington_DC", "jobTitle": "Senior Environmental Scientist", "companyRating": null, "companyInfo": {"Website": "www.mayvin.com", "Headquarters": "Annandale, VA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Mayvin® is currently seeking experienced applicants for a Senior Environmental Scientist. This position will be located in Washington D.C. This position’s primary function is to serve as an Acquisition Specialist to support a U.S. Customs and Border Protection (CBP) client located in Washington, D.C.. The candidate shall serve on a team performing a range of environmental compliance activities supporting border security efforts. While the candidate will be primarily located on-site in Washington, D.C., the position requires the flexibility to travel to other localities including, but not limited to, seaports, foreign airports, and land ports of entry. In this position the Environmental Scientist will work under the supervision of Program Managers to perform environmental compliance; requirements analysis and development; site surveys; and ancillary activities required to acquire and deploy CBP equipment. Ability to provide guidance, direction, and support to staff in the preparation of environmental documentation for Government actions (e.g., review of National Environmental Policy Act of 1969, as amended documentation in planning proposals and evaluation for environmental aspects of real property acquisitions and disposals).Ability to assess the CBP compliance procedures with environmental laws and policies of the United States and neighboring governments, and proposed changes and/or modifications to those procedures that will assure environmental goals are met. This effort includes environmental assessments and development of the appropriate documentation as required.Ability to coordinate and participate with representatives of all levels of government, as well as citizen groups regarding environmental issues, as well as review of any subsequent contracts. Provide technical assistance in the development and maintenance of relevant environmental programs.Ability to assess the CBP Port of entry areas for the best representative means of monitoring air quality in the environment, and apply approved methods of measuring air quality that complies with government regulations.Ability to research ways to solve the problems endangering the earth and its inhabitants by conducting research, interpreting findings and presenting this information to appropriate agencies.Ability to provide technical and analytical support for technical projects related to identifying, researching, and documenting site characterization and cleanup technologies and approaches for contaminated sites.Provide general support for the preparation of work products.Ability to work both individually and in a team environment.Ability to adapt to changing environments and scenarios with limited supervision.Possesses general knowledge of procurement procedures, operations, and regulations (i.e. FAR).Shall possess excellent oral and written communication skills, and ability to work effectively with people at all levels.Shall possess ability to communicate complex issues, clearly and effectively, both verbally and in writing to a range of stakeholders.Shall possess ability to work both individually and in a team environment.Shall be proficient in the use of commercial software packages such as Microsoft Office (in particular Word, Power Point, Project, Outlook and Excel) and SharePoint.Experience in development of databases in Microsoft Access for technical and programmatic tracking of financial data, key deliverables, and milestones is highly desirable.Expert experience in Microsoft Word and Excel highly desirable.About Mayvin: Mayvin is a dynamic small business created out of a commitment to deliver unparalleled service to our clients. Our team brings expert knowledge of program management services specializing in Streamlined Acquisition and Operations Management to government organizations. We create effective strategies for program design, execution, and sustainment while implementing action plans to provide our clients with maximum visibility, access, and an impact that serves the needs of the United States. Our team has a diverse array of credentials directly related to providing a comprehensive mission support plan for both military and civilian agencies.  A \"Mayvin\" is a trusted expert in a particular field who seeks to pass knowledge on to others - a builder of networks, a communicator of knowledge.  Our compensation package includes a competitive salary and benefits package, along with a dynamic corporate culture and supportive team environment. Mayvin is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status.Mayvin is a current participant in E-Verify and conducts internal I-9 audits at least once per year."}