{"jobID": "2831731551", "jobLocation": "Chicago_IL", "jobTitle": "Junior Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.  + Entry level role in the newly formed Big Data Advanced Analytics group of the organization? This role is responsible for development of data platforms, business solutions, and proof of concept to assist the big data team in realizing its goals  + Demonstrate high degree of analytic agility to meet fluid and dynamic business needs  + Use data engineering techniques to design and build solutions/ products for analyzing large data sets and identify patterns and relationships  + Create, deploy and optimize large scale data  + Assist in rapid development of new data and analytics prototypes  + Explore data sources to better understand the availability and quality of data.  + Document available data sources and how they are being transformed.  + Embrace an environment that supports innovation and process improvement  + Manage data sources, organize data and create data assets using identified open source or proprietary tools  + Work closely with SMEs, functional experts in Commercial, R&D;, finance, etc. for building data pipeline from structure and unstructured data sources  + Work on newest tools and technologies to achieve results - Scala, Scalding, Spark, Hadoop  + Part of the centralized team responsible for building and managing advanced analytics products/ solutions in Abbott  + Works under direction of managers, manages activities according to milestones and completes tasks assigned by more experienced analysts and managers  Bachelor?s degree in any of the following ? Math, Physics, Computer Science, Statistics, Economics, Quantitative Sciences  + 0-2 years of experience  + Strong problem-solving skills  + Ability and desire to learn new languages and technologies  + Attention to detail and organization/ documentation skills  + Ability to prioritize and triage deadline-driven tasks in a high-pressure environment  + Experience manipulating and analyzing complex, high-volume data from varying sources  + Ability to communicate complex quantitative analysis in a clear, precise, actionable manner  + Experience in AWS, Python, R, Spark, hive, HBase, Hadoop, Kafka, YARN etc. will be a plus  An Equal Opportunity Employer  Abbot welcomes and encourages diversity in our workforce.  We provide reasonable accommodation to qualified individuals with disabilities.  To request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}