{"jobID": "2757799997", "jobLocation": "Washington_DC", "jobTitle": "Statistical Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.amyx.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Amyx is seeking to hire 2 Statistical Data Analysts in the Washington DC metro area in support of Immigration and Customs Enforcement. Responsibilities and Daily Tasks: a. Access the initial raw data via DHS computer systems such as, but not limited to the Student and Exchange Visitor Information System (SEVIS), the United States Visitor Immigrant Status Indicator Technology Registration System (US- VISIT), the Central Index System (CIS), the Computer Linked Automated Information Management System (CLAIMS), the Refugee, Asylum & Parole System (RAPS), the Consular Consolidated Database (CCDI), the Arrival Departure Information System (ADIS), the ENFORCE Alien Removal Module (EARM), the Secondary Inspection Tool (SIT), the Treasury Enforcement Communications System (TECS II), the National Crime Information Center (NCIC), the Consolidated Lead Evaluation and Reporting System (CLEAR), the Automatic Targeting System – Passenger (ATS-P), and the Enterprise Document Management System (EDMS) regarding aliens who have been flagged as potential non-immigrant status and overstay violators or to support other CTCEU programs.  b. Conduct searches of designated ICE systems, other government agency computer systems and open source sites in order to identify violations and lead viability.  c. Provide liaison support involving intelligence analysis as related to ICE operational requirements at various locations determined by COR in coordination with the Government Program Manager.  d. Analyze manual leads daily, in coordination with the current CTCEU Information System Contractor, in over 20 separate government and commercial databases. Open Source projects, SEVIS Enforcement Section, National Security Team, Visa/Domestic Mantis Lifecycle leads are excluded and other manual leads shall be excluded by the COR in coordination with the Government Program Manager.  e. Provide open source research to existing cases to extend the investigative opportunities of unresolved subject leads. Efforts will target commercially accessible open source data to include social media.  f. Develop and produce qualitative intelligence reports, referred to as CTCEU reports, utilizing government databases and open source analysis for a comprehensive product.  g. Analyze data integrity and consistency to obtain a quantitative basis for decision making and resource allocation  h. Analyze data integrity and consistency to obtain a quantitative basis for decision making and resource allocation. Supported Technologies:FALCONStudent and Exchange Visitor Information System (SEVIS)United States Visitor Immigrant Status Indicator Technology Registration System (US- VISIT)Central Index System (CIS)Computer Linked Automated Information Management System (CLAIMS)Refugee, Asylum & Parole System (RAPS)Consular Consolidated Database (CCDI)ENFORCE Alien Removal Module (EARM)Treasury Enforcement Communications System (TECS II)National Crime Information Center (NCIC)Consolidated Lead Evaluation and Reporting System (CLEAR)Automatic Targeting System – Passenger (ATS-P)Enterprise Document Management System (EDMS)Open Source Analysis (OS)Standard Operating Procedures for LeadTrac Mod and supporting systems, protocols, and tasks.Bachelor’s Degree or higher in any discipline with four (4) or more years of related experience in analysis of bulk data sets to include entry and extraction of target data, statistical analyses, and reporting.Foundational experience in navigating and writing queries for the Oracle and Microsoft Access environment."}