{"jobID": "2662381321", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist (Machine Learning)", "companyRating": "4.0", "companyInfo": {"Website": "www.saucelabs.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "156000", "jobDescription": " Sauce Labs provides the worlds largest cloud-based platform for the automated testing of web and mobile applications. Our customers are household names like Walmart, Salesforce, Visa, Yelp, and NBC. The Sauce Labs Data Science team has been chartered to solve some really difficult problems that our customers face.  Were looking for a Data Scientist to do Data Science, not dashboards. This is not a typical BI position - were essential to the future direction of our products and our company. We have a unique, challenging dataset, built from several years of running over 1.5 billion tests on our platform.  As a Data Scientist at Sauce Labs, you will be turning that dataset into actionable, customer facing products that help developers test their applications more effectively. Our small team is looking for someone who can come up with and test research ideas quickly and accurately, all while keeping a focus on eventual product implementation. You have the opportunity to have a huge impact and help shape the direction of research at Sauce. Key Responsibilities:Research, propose, build, and test advanced data productsExploratory analysis of large semi-structured datasetsApplying machine learning techniques to test ideas and visualize resultsPartnering with product and engineering teams to build solutions to help customers better understand their app testingBasic Qualifications and Background:2+ years implementing machine learning modelsExtensive experience using common analysis tools like Python or R, or other statistical programming languagesExperience building machine learning models to solve real-world problemsAbility to take initiative and drive implementation of research resultsCultural fit. Humility. Strong sense of ownership, customer service, and integrity. Willing to roll up your sleeves and get your hands dirtyStrong sense of ownership and passion for engineering great products with stellar user experiencesKeen eye for detail and thoughtful investigation of data before relying upon itNice to Have:A minimum of a BS in a quantitative fieldInterest or experience with natural language processing techniquesBackground in unsupervised machine learning and clustering algorithmsFamiliarity with test automation tools like Selenium and AppiumCompensation, Perks & Benefits:Competitive compensationFull Health Benefits - Medical/Dental/VisionGenerous vacation, Flexible work scheduleCatered Lunch. Healthy snacks and refreshmentsFun and relaxed work environment **Must be eligible to work in the United States and start full time by no later than April 30th**"}