{"jobID": "2653555945", "jobLocation": "San_Ramon_CA", "jobTitle": "Senior Data Analytics Analyst— Senior Compliance Statistician", "companyRating": "2.8", "companyInfo": {"Website": "www.bankofthewest.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1874", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Bank of America, Wells Fargo, U.S. Bank"}, "estimatedSalary": "128000", "jobDescription": " What sets Bank of the West apart from other banks is our team members–they embody the optimistic spirit of the West. There is a spirit here that drives us to do more. Our team of more than 10,000 employees is vital to the success of our Bank. They reflect our modern western values—straightforward, entrepreneurial and optimistic. We seek to create a corporate culture that fosters and rewards excellence, encourages creative thinking and respects diversity – an environment where team members are engaged, supportive of one another and enthusiastic about serving our customers. Bank of the West offers the stability of a company that has a 135 year history and is part of BNP Paribas, a European leader in global banking and financial services and one of the 6 strongest banks in the world. We offer opportunities across our diverse business lines – Retail Banking, Commercial Banking, National Finance, and Wealth Management. Position Summary This position reports to the Data Analytics Manager in the CIP Fair Lending Data Analytics Team. We are seeking a qualified, creative, self-motivated candidate with excellent analytical and quantitative skills to contribute to the growth of the CIP Fair Lending Testing Program. Essential Job Functions 1. Perform fair lending statistical analysis for various lending products with minimal or no supervision.  2. Analyze lending policies and processes for various products to design a fair lending test and provide specification.  3. Generate thorough reports with the results of fair lending analyses, and present the report to senior management.  4. Act as a lead analyst for specific projects, this includes managing the various aspect of a fair lending test including: planning, data acquisition, project schedule, and actively engaging with subject matter experts and business leaders to gain insight on policies and processes affecting the decisions on the products being studied.  5. Perform matched pair analyses and produce file samples for manual fair lending review.  6. Planning and execution of complex studies.  7. Perform various complex ad-hoc analyses.  *LI-NR1 Required Experience · A minimum of 7 years prior experience in banking or a financial institution in an analytical role.  · A minimum of 6 performing fair lending statistical analysis.  · A minimum 7 years of experience using SAS in a banking or financial institution. SAS certifications a plus.  · Experience performing statistical data analyses for credit risk, or finance in banking, a financial institution or related organization a plus.  · Experience and broad knowledge of project management  · Experience with spatial analysis a plus  · Experience developing maps with SAS/Graph a plus.  · Requires deep knowledge of job area. Education Bachelor’s Degree in Statistics, Math, Economics, or related field required  MS or PhD degree in Statistics, Math, Economics, or related field required (PhD a plus) Knowledge and SkillsStrong knowledge of applied statistics and SAS programming required.Knowledge of fair and responsible banking is highly desirableDetail oriented with the ability to understand the broad context.Ability and willingness to pursue excellent results.Good inter-personal and partnering skills to facilitate effective working relationships.Ability to problem solve and swiftly escalate issues to senior staff when needed.Good management and control of work flows to produce deliverables within required timeframes and quality standards.Effective verbal and written communication skills.Ability to summarize complex information into simple to understand information.Ability to produce thorough description of analyses and results.Excellent analytic and quantitative skills.Ability to adjust to rapidly changing environment and prioritize deliverablesStrong SAS programing skills Base SAS, SAS/STAT, SAS/Graph and other packages required.Ability to develop maps with SAS/Graph a plus.Knowledge of KML a plus.Excellent ability for creating reports and analyzing data with SAS.Experience with UNIX or Linux is highly desiredGood MS Excel, PowerPoint and Word skills; experience with other data analysis tools is a plusCreativity, curiosity, and the desire to learn and innovateAbility to self-motivate, self-start, and a desire to work independently in a relatively unstructured environmentGood understanding of the banking and financial services industriesEqual Employment Opportunity Policy Bank of the West is an Equal Opportunity employer and proud to provide equal employment opportunity to all job seekers without regard to any status protected by applicable law. Bank of the West is also an Affirmative Action employer - Minority / Female / Disabled / Veteran.  Bank of the West will consider for employment qualified applicants with criminal histories pursuant to the San Francisco Fair Chance Ordinance subject to the requirements of all state and federal laws and regulations."}