{"jobID": "2814638036", "jobLocation": "Dallas_TX", "jobTitle": "Legal Administrative Specialist / Data Analyst supporting the USAO #18-303", "companyRating": null, "companyInfo": {"Website": "www.fsafederal.com", "Headquarters": "Ashburn, VA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Company: Sysco PortlandLocation: US-OR-WilsonvilleZip Code: 97070-0527Minimum Level of Education: Not ApplicableMinimum Years of Experience: 0-1Position Type: Non-ExemptTravel Percentage: 0More information about this job:This position is located at 26250 SW Parkway Center Drive, Wilsonville, OR 97070-0527.Terms and Conditions apply to SIgn-on Bonus.Job Fair:DATE: Saturday, July 14thTIME: 8am - 12pmLOCATION: Sysco Portland26250 SW Parkway Center DrWilsonville, OR 97070OVERVIEW:At Sysco, we offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We are looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why good things really do come from Sysco.POSITION SUMMARYFirst things first. Let us introduce ourselves. Sysco is the #1 foodservice supplier in North America. But we are much more than food. We’re about everything that surrounds it. And with a workforce of over 50,000 associates in more than 180 locations, Sysco has the talent and reach to go beyond our customers’ expectations.On your mark. Sysco has immediate job openings for dependable CDL A Delivery Truck Drivers to safely operate a tractor trailer and unload/deliver various products to an assigned route schedule. Using a positive, friendly attitude, our drivers build relationships with each customer and become familiar with their operations to meet needs and expectations.Get set.It takes a special kind of driver to work for Sysco. Do you have what it takes? · Yes, age is just a number but drivers must be 21+ years of age. · License to drive - requires a valid Class A Commercial Driver License with a \"clean\" driving record (no single DUI in the last 3 years and no multiple DUIs within the last 7 years). · We are a drug-free workplace - must pass pre-employment testing (Drug Screen, Background Check). · Let’s talk - requires ability to read, write and communicate in English. · Do the math - basic math skills are important. · Give your career a lift - our drivers frequently lift, push, or move product weighing up to 100 pounds. · Winning attitude and approachable personality is a necessity. · Flexibility is key - overtime hours, working weekends and holidays, and the ability to start at a variety of times all are required in order to successfully meet customers' needs. Go.Sysco is more than just a place to work. Our passion for food and our customers has made us the industry leader. To remain at the top, we will continue to think bigger, work harder, and never give up. Are you ready to join us?Sysco also leads when it comes to pay and benefits for drivers: · Competitive wages plus productivity incentives · Paid Vacation  · Comprehensive healthcare benefits package, with many coverage options  · Generous retirement benefits · Employee discount programs · Uniforms, and · Discounts on company stock for associates interested in also being a shareholderApplicants must be currently authorized to work in the United States.Sysco is proud to be an Equal Opportunity and Affirmative Action employer, and considers qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law.This opportunity is available through Sysco Corporation, its subsidiaries and affiliates. Employment Type: Full Time"}