{"jobID": "2724761242", "jobLocation": "College_Station_TX", "jobTitle": "Research Scientist - CES", "companyRating": null, "companyInfo": {"Website": "www.lynntech.com", "Headquarters": "College Station, TX", "Size": "51 to 200 employees", "Founded": " 1987", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Lynntech is seeking an experienced and creative Research Scientist to assist in the development of technologies within our collaborative group. A Research Scientist will typically have a PhD degree and 1-6 years postdoctoral experience.  Lynntech develops world-class technology solutions and is actively engaged in various stages of technology development from preliminary concept generation and feasibility demonstration all the way through advanced engineering and manufacturing of products to meet different customer needs by integrating creative talent and business expertise.  The Chemical and Environmental Sciences (CES) Division is comprised of a group of Scientists, Engineers and Researchers that develop advanced and commercially viable technologies for defense, aerospace, energy and medical applications. The application areas that Lynntech's CES unit works on are of broad range that includes fuel cells, batteries, desalination, composites, energetic materials, precious metal recovery and sensors.  The CES unit is seeking a Research Scientist that is a problem solver, and can come up with innovative ideas and concepts to create cutting edge research opportunities in research areas such as but not limited to Sensors, Composites, Additive Manufacturing, Advanced Energetic Materials and Propellants, Thin Films and Coatings, Advanced Non-Invasive Characterization Tools and Methods. This Research Scientist will have the opportunity to be involved in the following functions as part of this job: Responsible for obtaining regular funding as primary author of research proposals submitted to federal agenciesResponsible for executing and designing laboratory experiments and interpretation of the resultsResponsible for the preparation of high quality and well written progress reports required by funding agenciesResponsible for identifying potential intellectual property and writing draft patent applications Why should you work at Lynntech? Your work will have an impact and make a difference in the world: Lynntech employees get to work across various disciplines, and are engaged in all aspects of technology development from idea generation to commercialization.You get the best of both worlds: We offer the infrastructure and stability of an established company as well as the challenge, benefits, and entrepreneurial spirit associated with a small business.Your work will be interesting and varied: You will have the opportunity to be creative and work on a myriad of projects across various industries (defense, energy, aerospace and medical).You get to work with the best, the brightest, and the most creative: People are Lynntech's biggest asset. We employ personnel across a broad range of disciplines including physicists, chemists, biologists, engineers, program managers, and business development. This applicant is anticipated to have the following qualifications: D. in Physics, Chemistry, Materials Science, Engineering or related disciplinesRecord of publications and presentationsTechnical writing abilityExcellent verbal and written communication skills Preferred qualifications for this position are Postdoctoral or relevant industry experienceExperience in one or more of following research areas: Sensors, Composites, Additive Manufacturing, Advanced Energetic Materials and Propellants, Thin Films and Coatings, Advanced Non-Invasive Characterization Tools and Methods.Experience working in or with government laboratories (e.g. DOE or DOD labs)Experience in managing projectsExperience in writing proposals to federal agencies Candidate must be a US Person (Citizen or Permanent resident) due to contract requirements.  Interested candidates are encouraged to apply online at www.lynntech.com. Feel free to include a cover letter or expanded resume to outline how you fit this position.  Lynntech is an Equal Opportunity Employer/M/F/Vet/Disabled.0 Job Posted by ApplicantPro"}