{"jobID": "2806190439", "jobLocation": "McLean_VA", "jobTitle": "Luxury Sales Associate", "companyRating": "3.3", "companyInfo": {"Website": "www.omegawatches.com", "Headquarters": "Weehawken, NJ", "Size": "201 to 500 employees", "Founded": " 1848", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Rolex, Cartier, Breitling"}, "estimatedSalary": "16", "jobDescription": "Omega Luxury Sales Associate - Tysons We are seeking talented and motivated individuals for an exciting opportunity to support our OMEGA Boutique. Job Description: Ideal candidates will have luxury retail sales experience, outstanding customer service skills, proven retail selling and clientelling skills, able to learn about our timepieces, and looking to be become a part of our team. Required Skills: 2-5 years of luxury retail experience  Excellent selling and customer service skills.  Great communicator: spoken and written skills.  Quick learner: able to learn the technical aspects of watches and watch collections.  Passion for sales and timepieces. Company Overview The Swatch Group Ltd. was founded in 1983, by Nicolas G. Hayek. Originally known as SMH, it was created out of the merger of two Swiss watch companies. The Swatch Group Ltd. in Biel (Switzerland) is today the largest manufacture of finished watches in the world.  Many people know the Swatch Group above all as the world’s top producer of finished watches. What is less well known is that the Swatch Group is a vertical enterprise in the watch production business, with the capability to manufacture all the necessary components for the production of mechanical and quartz watches. An enterprise that enables us to design, produce and distribute our brands’ products completely independently. Movements, hands, crowns, cases, screws, pallets, escapements, electronic circuits, batteries, ceramics and sapphire, to give just a few examples, there is nothing that cannot be produced in-house by our employees in our factories, our workshops, and our laboratories. In fact the whole of the Swiss watchmaking industry, and part of the global watchmaking industry, are in one way or another dependent on the Swatch Group.  The Swatch Group has a very special emotional culture. We produce beauty, sensuality, emotionally in watches- and we also produce high-tech on your wrists. Both, emotionally or poetry and high-tech are part of what we feel towards our customers. Discover our brands… Breguet, Blancpain, Glashütte Original, Jaquet Droz, Léon Hatot, Omega, Longines, Rado, Tissot, cK watch & jewelry, Balmain, Certina, Mido, Hamilton, Swatch, Flik Flak, Endura and Tourbillon."}