{"jobID": "2837325322", "jobLocation": "Secaucus_NJ", "jobTitle": "Sr. Data Scientist Manager", "companyRating": null, "companyInfo": {"Website": "www.judge.com", "Headquarters": "Wayne, PA", "Size": "1001 to 5000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Adecco, Kforce"}, "estimatedSalary": null, "jobDescription": " Our client is currently seeking a Sr. Data Scientist Manager As a Senior Data Scientist Manager you will work for the world leader in the industry, with a career where you will have the opportunity to collaborate and affect change while expanding your leadership skills and technical knowledge. You can make a real impact in a market that is growing and developing.  In this role, you will be responsible for building and deepening a holistic view of the Consumers through data and analytics and applying those insights to inform the development and growth of incredible digital services, content and experiences for our consumers.  We are looking for a data scientist to serve at the intersection of data science and key business partners. This role will focus on deep diving into a broad variety of initiatives around consumer analytics, segmentation, and targeting. It will require a multidisciplinary blend of statistics, technology, and business strategy, all applied in tandem to discover key insights in the data.  The role will involve everything from investigative analysis to scope out new projects, developing algorithmic frameworks and executing on projects, and interacting with key stakeholders to understand needs; develop segmentation and communicates the characteristics of each segment to the broader team for the purposes of segment specific targeting and messaging. Collaborating with our marketing partners, you will track and analyze campaign performance against KPIs and provide evaluation and optimization recommendations accordingly. Job responsibilities: As a successful data scientist on the Consumer Technologies and Digital Solutions team, you will need to understand the meanings of data in the context of education, customer acquisition and conversion. You will expose and measure current user behavior. You will identify specific and actionable opportunities to solve existing business problems by collaborating with engineering and business teams for future innovation. You need to be a sophisticated user of advanced data extraction and transformation tools (e.g. Spark, Python, SQL), but will need to understand the source data and be able to synthesize it down to a form suitable for answering specific business questions, machine learning and econometric modeling. You will also need to be an expert at communicating insights and recommendations to audiences of varying levels of technical sophistication. Specific responsibilities:Develop models that help us understand and describe our customers, e.g. learning how to extract deep interests and tendencies from event streams.Serve as a partner to key business partner teams to understand needs and conduct analyses that will help determine strategy.Create integrated views and segments based on data from multiple sources to influence business designs.Understand and apply machine learning and statistical models to generate deep insight and discover effective solutions to challenging problems. Deliver presentations to business stakeholders that tell cohesive, logistical stories using data. Judge Group Job Order ID: 575118 Salary: Open  Company Description:Working at the crossroads of people and transformative technologies, The Judge Group delivers innovative business solutions – powered by top talent – to help organizations reach their strategic goals and realize opportunities now and in the future.  The Judge Group is a leading professional services firm specializing in technology, talent, and learning solutions. Our services are successfully delivered through a network of more than 35 offices in the United States, Canada, China, and India. The Judge Group serves more than 40 Fortune 100 companies and is responsible for the placement of more than 4,500 professionals annually across a wide range of industries. To learn more, visit www.judge.com."}