{"jobID": "2831600675", "jobLocation": "Universal_City_CA", "jobTitle": "Data Engineer/Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.nttdata.com/joinus", "Headquarters": "Tokyo, Japan", "Size": "10000+ employees", "Founded": " 1965", "Type": " Company - Public (9613) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Capgemini, Accenture, Deloitte"}, "estimatedSalary": "111000", "jobDescription": " Our client builds data pipelines to land, profile, clean, join disparate datasets together to support our business partners' strategic decision making. We use various technologies including Python, Bash, AWS S3, SQLite, Postgres, as well as several visualization applications such as Tableau and Domo. They work in a very agile environment, where product specifications are sometimes very loosely given, and often change rapidly over time, so we are seeking persons who are comfortable with ambiguity, and figuring out an execution plan in the face of uncertainty. While the main focus is on backend engineering, engineers who have full stack expertise, and can also write the front-end code will be especially considered. Data Engineer/AnalystContributor to the overall Data Product roadmap by working closely with our business partners to understand their challenges and develop analytical tools to help drive business decisionsFull stack developer who can single handily build working prototypes and work with business clients to further iterate on new features by taking an agile approach to gain early feedbackLeverage prototyping methodologies to propose and design creative business solutions that exploit our broad toolset of technologies (Big Data, Tableau, Python, etc)Deep understanding for linear and digital media datasets (Nielsen, comScore, Rentrack, Omniture, etc)Educate and inform business partners on architecture, capabilities, best practices and solutions to build out future enhancementsAssist in gathering and analyzing business requirements, source systems, understand underlying data sources, transformation requirements, data mapping, data model and metadata for reporting solutionsWriting code and documentationBachelor's degree in Engineering, Computer Science, Information Systems or related field with 7+ years of industry experience.Strong Computer Science/Engineering/Information Systems background5+ years of experience in Data Modeling, Data architecture, Data Quality, Metadata, ETL and Data Warehouse methodologies and technologies.Experience in reading external API documentation and write pipelines to extract data from our partners' systemsExperience in Python and SQL as well as any combination of the following: Big Data (HIVE), Linux, Tableau, Domo, Angular.js, React.js, SparkStrong oral and written communication, with the ability to communicate new concepts and drive change in processes and behaviors and also to communicate complex technical topics to management and non-technical audiences.NTT DATA Services is a leading IT services provider and global innovation partner with 130,000 professionals based in over 50 countries. NTT DATA recently acquired Dell Services. NTT DATA Services emphasizes long-term commitment and combines global reach and local intimacy to provide premier professional services, including consulting, application services, business process, IT outsourcing, and cloud-based solutions. We are a part of NTT Group, one of the world's largest technology services companies, generating more than $100 billion in annual revenues and partner to 80% of the Fortune 100. Visit www.nttdataservices.com to learn how our consultants, projects, managed services, and outsourcing engagements deliver value for a wide range of businesses and government agencies. The Company is an equal opportunity employer and makes employment decisions on the basis of merit and business needs. The Company will consider all qualified applicants for employment without regard to race, color, religious creed, citizenship, national origin, ancestry, age, sex, sexual orientation, genetic information, physical or mental disability, veteran or marital status, or any other class protected by law. To comply with applicable laws ensuring equal employment opportunities to qualified individuals with a disability, the Company will make reasonable accommodations for the known physical or mental limitations of an otherwise qualified individual with a disability who is an applicant or an employee unless undue hardship to the Company would result. "}