{"jobID": "2828216234", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.paloaltonetworks.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 2005", "Type": " Company - Public (PANW) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Check Point Software Technologies, Fortinet"}, "estimatedSalary": "178000", "jobDescription": "Palo Alto Networks is the fastest-growing security company in history and a six-time Gartner Magic Quadrant leader for our innovation and ability to execute. Named best place to work by the Silicon Valley Business Journal, we offer the chance to be part of an important mission: ending breaches and protecting our way of digital life. If you are a motivated, intelligent, creative, and hardworking individual, then this job may be for you! Summary: To stay ahead of the curve, its critical to know where the curve is and when its coming up. For the fastest growing security company, the curve is the latest cyber-attacks, computer viruses, making the right business decisions at the right time, etc. and keeping ahead of it all requires the ability to predict.  As a predictive enterprise environment, we analyze the petabytes of data that pass through our walls on a daily basis and we hire the finest minds in data science to build innovative predictive analytics and data science solutions for a myriad of business problems. The Job:Identify/develop appropriate machine learning/data mining/text mining techniques to enable better business outcomes.Understand and analyze data sources including sampling biases, accuracy, and coverage.Ask questions and break apart problems scientifically. Form hypotheses and validate.Use analytical rigor and statistical methods, machine learning, programming, data modeling, simulation and advanced mathematics to analyze large amounts of data, recognizing patterns, identifying opportunities, posing business questions and making valuable discoveries.Research new ways for modeling and predictive behavior for large scale projects.Generate and test hypotheses, designing experiments to answer targeted questions of advanced complexity.Collaborate with data engineers to identify data preparation/cleansing/ETL pipelinesDefine data needs, evaluate data quality, and extract/manipulate data in a \"Big Data\" environment.Documents projects including business objective, data gathering and processes, leading approaches, final algorithm, detailed set of results and analytical metrics.Interprets and communicates insights and findings.Coach and mentor less experienced team members.Validate score performance.Conduct ROI and benefit analysis.Document and present model process and performance.The Skills:Advanced degree in Machine Learning, Computer Science, Electrical Engineering, Physics, Statistics, Applied Math or other quantitative fields from a reputed university (Ph.D. a plus).0-3 years of working experience in machine learning.Demonstrated ability to lead and execute projects from start to finish.Ability to independently support existing products.Proven track record in modifying and applying advanced algorithms to address practical problems.Excellent knowledge of machine learning/data science approaches.Comfortable interacting with business peers to understand and identify use cases. Be able to articulate solutions & present them to business.Familiarity with data visualization tools like Tableau.3+ years analyzing and interpreting data.Exceptional coding skills in Python, R, PySpark.Hands-on experience in one or more deep learning frameworks.Ability to adapt to scrum & agile methodology, comfortable with development tools like Jira/Confluence.Experienced in applying data science to business problems (sales, IT, etc.) preferred.Experience with Hadoop and NoSQL related technologies.Knowledge of NLP/Text mining techniques and related open source tools. Learn more about Palo Alto Networks here and check out our fast facts #LI-MT1"}