{"jobID": "2746967421", "jobLocation": "Novato_CA", "jobTitle": "Associate Recruiter (Temporary)", "companyRating": "3.7", "companyInfo": {"Website": "www.toysforbob.com", "Headquarters": "Novato, CA", "Size": "51 to 200 employees", "Founded": " 1989", "Type": " Company - Public", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": "Toys for Bob is seeking a Temporary Recruiter based in Novato, CA to provide full lifecycle recruitment. You will use your specialized knowledge of the Games industry to develop recruitment strategies with hiring teams by anticipating and understanding our competitive landscape and executing on creative and effective sourcing and recruitment campaigns. You will bring experience with creative/gaming/entertainment roles, and know what it takes to bring on top talent in partnership with our hiring teams. Our Recruiters bring professionalism and integrity to the role. Your Mission:Research current entertainment competitors and advise hiring teams on competitive landscapes and report out on findingsPartner with hiring managers to develop comprehensive, needs analysis for their open roles based on industry knowledge and market researchAs part of your strategy, deliver a cohesive presence at Network/Sourcing/Recruiting Events; (Understand the nuances of each event and execute accordingly)Craft proactive recruiting and sourcing strategies based on competitive intelligenceBuild partnerships with hiring managersDevelop networks in social media (LinkedIn, etc.)Lead candidate interviewing (panel & 1:1), selection, and negotiationNegotiate job offers to selected candidates, partnering with hiring managers, Human Resources and studio leadershipPlayer Profile:At least 2 years’ experience as an in-house, full-cycle recruiterProven ability to research and gather competitive intel into actionable reportsComfort with sourcing candidates using advanced Boolean searches, in-depth market research and influential message developmentProficient at evaluating studio video game roles such as Gameplay Programmers, Designers and Producers, and proven experience learning new rolesExcellent interpersonal skillsProven influence, negotiation, and closing skills Toys for Bob is a band of inventors, makers, and magicians who have been developing whimsical AAA console games for over 25 years. We play in a former military hangar that’s been converted into a colorful, tiki-themed, dog-friendly paradise just 20 minutes north of the San Francisco Golden Gate bridge. Best known for inventing the “Toys to Life” genre with Skylanders, we are a team of out-of-the-box thinkers who are driven to create memorable new experiences that inspire joy through levity and play. If you love games, are great at what you do, and don’t take yourself too seriously, we’d love for you to be part of the family!"}