{"jobID": "2732166293", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.onekreate.com", "Headquarters": "Hollywood, FL", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " CreativeDrive is an independent global creative and content production company comprised of creators, makers and doers spanning across 100 content creation studios from all over the world. We reimagined the entire content creation cycle – from creative to creation to execution, to provide clients with innovative content at unparalleled speed and scale.  Our family of boutique brands who came together to build the largest global independent content creation company include; Sandbox, OneKreate, Dune Studios, Hudson Studios, PIA, Totem and DoubleDigit. Together, we serve client brands including; Michael Kors, Clinique, HP, Gatorade, Walmart, The Home Depot and more.  We strive to continuously fuel creative drive through experiences and collaboration. Our motto is: Make Amazing Happen. It is an expression of the people, knowledge, and experiences that are CreativeDrive. Let’s make amazing happen together. Data Analyst The Data Analyst will be a key contributor to the Creative Drive Software Solutions team while collaborating with our engineering team to provide actionable insights for internal and external stakeholders. The Data Analyst will be responsible for assessing information from a range of data stored in disparate systems, integrating data, providing data mining to answer specific business questions as well as identifying unknown trends and relationships in data.  This role is perfect for a team player with strong hands-on analytics experience, drive, and curiosity, with the ability to rise above the numbers and explain the essential insights to business users, while instinctively minimizing complexity to focus on results. Work with stakeholders to collect, analyze, define, and document requirements for reports, dashboards, scorecards, and analyticsBuild and maintain effective dashboards, visualizations, reports, and analytics using Looker and Google BigQueryWork with the internal and external stakeholders to define new data sets and identify changes to existing data setsProvide end-user support/guidance to the Creative Drive Team on best practices and approaches to design/implement effective, standardized dashboards and analyticsAcquire and analyze new data sources to inform new analytics developmentProvide timely execution of assigned tasks in an agile development environmentBachelor or Master's Degree in Computer Science/Engineering, or equivalent5+ years of prior experience successfully building and maintaining dashboards, analyses, reportsMust have a passion for data and have spent your career developing strong data analysis and measurement skills and honing your analytical instinctsMust be a quantitative, data-minded person who loves tackling intricate problems and telling stories with numbersStrong SQL programming skills, including the use of SQL analytic functionsSignificant experience working with key stakeholders across several departmentsExcellent communication skills both verbally and writtenWillingness to learn and use different Analytics tools and technologies"}