{"jobID": "2754842723", "jobLocation": "Chicago_IL", "jobTitle": "Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "97000", "jobDescription": "Basic QualificationsMinimum 2 plus years of hands-on technical experience implementing  or supporting Big Data solutions utilizing Hadoop and Python.Experience developing solutions utilizing at least two  of the following:Kafka based streaming servicesR StudioCassandra , MongoDBMapReduce, Pig, HiveScala, Sparkknowledge on Jenkins, Chef, PuppetPreferred QualificationsFull life cycle development experienceExperience with delivering Big Data Solutions in the  cloud with AWS or AzureAbility to configure and support API and OpenSource  integrationsExperience administering Hadoop or other Data Science  and Analytics platforms using the technologies aboveExperience with DevOps supportDesigning ingestion, low latency, visualization clusters  to sustain data loads and meet business and IT expectationsTravel 100%Professional Skill Requirements ·  Proven success in contributing to a  team-oriented environment  ·  Proven ability to work creatively and  analytically in a problem-solving environment  ·  Desire to work in an information systems  environment  ·  Excellent communication (written and oral) and  interpersonal skills  ·  Ability to work with senior client executives  All of our consulting professionals receive comprehensive training covering  business acumen, technical and professional skills development. You'll also  have opportunities to hone your functional skills and expertise in an area of  specialization. We offer a variety of formal and informal training programs at  every level to help you acquire and build specialized skills faster. Learning  takes place both on the job and through formal training conducted online, in  the classroom, or in collaboration with teammates. The sheer variety of work we  do, and the experience it offers, provide an unbeatable platform from which to  build a career.  Applicants for employment in the US must have work authorization that does  not now or in the future require sponsorship of a visa for employment  authorization in the United States and with Accenture (i.e., H1-B visa, F-1  visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated  Accenture business may not be eligible for consideration.  Accenture is an EEO and Affirmative Action Employer of  Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment Opportunity  All employment decisions shall be made without regard to age, race, creed,  color, religion, sex, national origin, ancestry, disability status, veteran  status, sexual orientation, gender identity or expression, genetic information,  marital status, citizenship status or any other basis as protected by federal,  state, or local law.  Job candidates will not be obligated to disclose sealed or expunged records of  conviction or arrest as part of the hiring process.  Accenture is committed to providing veteran employment opportunities to our  service men and women."}