{"jobID": "2659384674", "jobLocation": "Chicago_IL", "jobTitle": "Technical Product Manager, Data Science", "companyRating": null, "companyInfo": {"Website": "www.fourkites.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you interested in working in the hottest startup in Chicago? FourKites is looking for a Technical Product Manager, Data Science who will be responsible for the vision, strategy and evolution of the data pipelines and platforms at FourKites and will report directly to the Chief Product Officer.  The Data Science Product Management role is a multidisciplinary role focused on partnering with internal business teams, data scientists, core engineering and external customers to define a platform strategy, and innovative ways to leverage data science and deep learning algos within the FourKites product portfolio. We're looking for a leader that can combine business acumen and technical skills with a deep knowledge of data science to deliver capabilities across the FourKites platform. You will serve as a domain expert, combining industry expertise and end-user feedback to manage the overall product lifecycle for a portfolio. You will be empowered to lead, design, test, refine, and deploy new data science capabilities across products. Your ResponsibilitiesDevelop, communicate and execute the vision, strategy and product roadmap for data science pipelines and platformsCollaborate with cross-functional stakeholders to think boldly and creatively to create concrete product ideas and business cases for new data science capabilities that optimize the FourKites MarketplaceDrive actionable results across product lines based on data scienceParticipate in cross-functional stakeholder teams to intake new ideas, manage urgent technical issues, manage release schedules to deliver high quality solutionsYour Qualifications5+ years of experience leveraging large scale data science in B2B enterprise-class productsExperience in working closely with a team of data scientistsExperience working with Python, Spark, SQL, R etc.Excellent interpersonal skills and experience in building strong relationships with engineering, product, customers, partners and the executive teamPassion to work in a fast paced startup environmentGraduate degree in Engineering/Computer Science or a related technical discipline, or an undergrad in computer science with an MBA. FourKites, Inc. is a logistics technology startup providing a next-generation software platform that streamlines operations for freight brokers and shippers. Our connected devices platform is the most advanced in the industry and has been deployed by several freight brokerage houses in the country. Our customers include Fortune 100 shippers and Transport Topics Top 25 Freight Brokers. We love what we do, and we love the impact we have already driven for the clients we work with. We believe in empowering our employees to be the absolute best they can be, and we arent afraid to have a little fun in the process. Were funded by a great group of investors who care about our company and our teams success.  **If you cannot successfully complete the application process through the FourKites website because of the education field, please send your resume and a brief message to careers@fourkites.com"}