{"jobID": "2812107138", "jobLocation": "San_Francisco_CA", "jobTitle": "Account Executive", "companyRating": null, "companyInfo": {"Website": "www.asg.com", "Headquarters": "Naples, FL", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Account Executive (4495) - San Francisco, CA With proven solutions for information access, management and control, ASG Technologies enables greater insight to drive intelligent decisions from legacy to leading edge environments. As a company, ASG Technologies is dedicated to delighting every enterprise who partners with us.  We've seen over and over how companies with a smarter IT footprint have improved not only IT efficiency, but also business productivity and cost savings. Over the last 31 years, we have been fortunate enough to work with some of the world's most successful companies, in fact, more than 70 percent of global Fortune 500 companies trust us to optimize their existing IT investments. Our flexible solutions offer speed, scalability and the best price for performance in platform-agnostic packaging. We are driven by three key operating principles, Customers Matter, People Matter, Results Matter; if we do a good job by our customers and people, the results take care of themselves.  ASG Technologies is currently searching for an Account Executive in the San Francisco, CA area. The Account Executive is needed to generate new business/license revenue while building long-term client relationships in an effort to produce repeat business. Maintain post-sale contact with clients in order to facilitate a positive and productive long-term relationship. Communicate with customers with regard to any account related matter. Listen to customers' concerns and suggestions focusing on how ASG products can meet their needs. Focus efforts on product feedback, enhancement, upgrades, and development. Analyze present and past sales, as well as market trends and competitors. Develop sales techniques to stay ahead of competitors by forecasting future market trends to create future sales opportunities and assist in the recommendation of development of new products and services to attract future clients. Responsibilities:"}