{"jobID": "2789402512", "jobLocation": "Washington_DC", "jobTitle": "Care Coordination Services Consultant", "companyRating": "3.4", "companyInfo": {"Website": "www.boystown.org", "Headquarters": "Omaha, NE", "Size": "1001 to 5000 employees", "Founded": " 1917", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable", "Competitors": " Boys & Girls Clubs, AdoptUSKids, Foster Care to Success"}, "estimatedSalary": "46000", "jobDescription": " Title: Care Coordination Services Consultant Closing Date: May 29, 2018 or until filled OVERVIEW OF BOYS TOWN Do you want a career with a company that makes a difference every day? Boys Town is nationally recognized for its research-proven child, health and family care programs. As one of the countrys largest nonprofit funded child-care organizations, Boys Town touches the lives of more than 2 million children and families nationwide each year. OVERVIEW OF JOB The Care Coordination Services Consultant provides intensive and professional case management services to youth utilizing a strength based and comprehensive model. This position also links children and families to resources and supports, monitors the services, actively advocates for children and families, and assists them in navigating through various systems of care. REQUIRED EDUCATION, TRAINING, EXPERIENCE, OR SKILLS Bachelor's degree in Behavioral Sciences or Human Services required. NOTE: Education and experience requirements may be higher based on Affiliate Site location, Local contracts, or Federal/State contract requirements. 1 to 2 years of experience including working with children and families; experience working with children and families in community-based programs or Boys Town programs is preferred. Must possess a valid driver's license with a good driving record, plus the ability to provide own transportation to complete travel requirements of the job. Must meet auto insurance requirements established by Boys Town policy and/or State and Local laws and pass an annual Motor Vehicle Registration (MVR) check. This position is available rotationally to provide crisis response and must be available to work non-traditional business hours including early mornings, nights, weekends, and holidays. Knowledge of regulatory requirements pertaining to youth care and the ability to learn, apply, and explain complex regulations and policies governing child welfare processes and services. Knowledgeable of community resources and service providers available in the geographical area. Ability to communicate with individuals at all levels in the organization and with external business contacts in an articulate, professional manner while maintaining necessary degree of confidentiality. Ability to quickly make decisions in sensitive and sometimes critical areas to adapt responses to situations while maintaining procedural and regulatory integrity. Computer skills in Microsoft Office. CERTIFICATIONS, LICENSURE, AND LANGUAGE SKILLS: Bilingual English/Spanish speaking preferred. Certification or licensure may be required based on Affiliate Site location, Local contracts, or Federal/State contract requirements. This advertisement describes the general nature of work to be performed and does not include an exhaustive list of all duties, skills, or abilities required. Boys Town is an equal employment opportunity employer and participates in the E-Verify program. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. To request a disability-related accommodation in the application process, contact us at 1-877-639-6 003."}