{"jobID": "2787070433", "jobLocation": "Dearborn_MI", "jobTitle": "Automotive Statistical Modeling Engineer", "companyRating": null, "companyInfo": {"Website": "www.gogtech.com", "Headquarters": "Dearborn, MI", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Contract", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Strategic Staffing Solutions, Aerotek, KellyMitchell Group"}, "estimatedSalary": null, "jobDescription": "We are looking for a product development engineer to develop modelling solutions to improve our power supply system design process.This is a dynamic position that involves working closely with electrical engineers across the organization to develop accurate modelling solutions.Develop modelling solutions of system level vehicle interactionsUse statistical modelling (e.g. Monte Carlo) to predict system performanceWork with electrical feature owners to ensure model inputs are accurate and thoroughLeverage real world statistical data to validate modelsMatlab/Simulink modelling Minitab Excel Power Point Data analysis1+ years of experience using Matlab/Simulink1+ years of experience using statistical methods and statistical software program (e.g. Minitab)Familiarity with systems engineering fundamentalsPreferred QualificationsMonte Carlo analysis2+ years of experience Strong Teamwork mindsetStrong written and oral communicationFamiliarity with Connected Vehicle technologyEducationBachelor of Science in Electrical Engineering G-TECH Services, Inc. is a leading certified recruitment and placement firm that specializes in providing highly skilled staff in technical fields such as engineering, IT, procurement, finance and accounting. We have well-established relationships with some of the most respected companies in the country and know our clients’ job requirements and corporate cultures. Once we understand your experience and career aspirations, we aim to connect you with the right opportunity.  At G-TECH, we embrace a personalized approach to professional staffing, recognizing the important link between employee and employer satisfaction. We work tirelessly to connect qualified job seekers with positions that align with their career goals, skillsets and personalities. Upon placement, we support our employees throughout the duration of their assignments, providing them with a direct point of contact who serves as a dedicated advocate and sounding board. As our employees can attest, this approach is consistently effective in bettering the contract employment experience.  At G-TECH, our mission is simple: we are dedicated to connecting great people with great places to work."}