{"jobID": "2585462492", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Engineer", "companyRating": "4.9", "companyInfo": {"Website": "www.entelo.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": "Entelo is transforming the way companies hire. We leverage big data and predictive analytics to make recruiting better for candidates and recruiters alike. In 2017, we were thrilled to be named one of Glassdoors Best Places to Work!  You will be responsible for helping to design, build, operationalize, and scale terabytes of data every day. Our stack includes Kafka, Elasticsearch, Spark, PostgreSQL, and Go microservices. We use Redshift for data warehousing and analytics. From improving our data pipeline capabilities to pushing our data science initiatives to the next level, Entelo is scaling aggressively. You'll implement algorithms around entity resolution and predictive models, text classifiers, and statistical models for personalized talent search and recommendation. Thats just the beginning! What youll be doing:Power product reporting, metric tracking, and online and offline data analysis through development of reliable and accurate data tracking systemsAbility to understand business processes, applications and how data is gathered and to tie application telemetry to a transactional data model.Develop and manage data pipelines at enterprise scaleInterface with internal data consumers to understand data needsCollaborate with multiple teams in high visibility roles and own the solution end-to-endYour background:Bachelor's degree in Computer Science or equivalent, Graduate degree preferredExperience designing, integrating and optimizing distributed data processing pipelinesWriting high-quality data processing code in Go, Java, Python, or other high-performance languagesBuilding and administering alerting and monitoring systems around data processing pipelinesGood Linux/UNIX systems knowledgeStrong systems-level debuggingBonus Points:Experience with cluster and configuration management systems such as Docker and KubernetesFamiliarity with Redshift, GlueWriting and optimizing advanced SQL queriesExperience administering PostgreSQL and MySQL databases At Entelo, perks mean so much more than free lunches and unlimited PTO (although we provide both!). Were committed to helping Entelopes grow; we offer opportunities for professional development and a generous learning and development stipend. Entelo is also committed to the community; we partner with impactful non-profits, volunteer regularly, and provide a charitable match. We perform at a high level while respecting our teammates' lives outside of work.  We celebrate diversity and welcome all qualified applicants regardless of race, religion, sex, age, national origin, sexual orientation, disability, veteran status, genetic information or criminal history. Weve taken the White House Equal Pay Pledge and are committed to maintaining a welcoming and equitable environment."}