{"jobID": "2786535819", "jobLocation": "Mount_Pleasant_MI", "jobTitle": "Crisis Stabilization Specialist", "companyRating": null, "companyInfo": {"Website": "www.cmhcm.org", "Headquarters": "Mount Pleasant, MI", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " OverviewCMHCM is a six county agency that provides the highest quality, cost-effective behavioral health solutions in collaboration with consumers and community partners. Our team members combine compassion with extraordinary specialty services and supports for our consumers every day. We'll provide you with the compensation and benefits package you'd expect; outstanding benefits that are tailored to meet your individual needs.  Why work for CMHCM? Challenging and rewarding work environmentProfessional development opportunitiesCompetitive vacation timeWork-life balance through flexible schedulesOpportunity for internal growth General Summary of DutiesServes as a member of the Crisis Mobilization and Intervention Team (CMIT), provides crisis intervention and stabilization services to those individuals who are in a mental health or family crisis. Evaluates requests for services on an emergency basis and provides on-site evaluations in the community. Completes preadmission screenings using approved screening tools and techniques for consumers requesting crisis services to determine eligibility for program services and/or to recommend the most appropriate level of care. Provides backup for Access and other Emergency Services during periods of excess demand for crisis intervention and preadmission screening services. Must be able to work and communicate well with a variety of individuals and agencies. CMHCM is an approved site for the National Health Services Corp Loan Repayment Program. Hired candidates may be eligible for student loan repayment.Education/Experience RequirementsMasters Degree in Social Work, Counseling, or Clinical/Counseling Psychology with sufficient experience to perform the position at a satisfactory level. Michigan LMSW licensure preferred; will consider LLMSW, LLP, LPC or LLPC. One-year experience working with children and families required. Valid driver's license while operating vehicle on agency business."}