{"jobID": "2339579272", "jobLocation": "Franklin_Lakes_NJ", "jobTitle": "Scientist / Chemist", "companyRating": null, "companyInfo": {"Website": "www.millenniumsoft.com", "Headquarters": "Fairfax, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Scientist / ChemistFranklin Lakes, NJ1 Year Contract8 AM to 5 PMWeekly 40 hours [Mon-Fri]Qualifications:GENERAL FUNCTION:Reporting to the Leader of the Biological Sciences group, Research & Development, the Scientist in this role will be supporting the development, verification and evidence generation efforts pertaining to the clinical application of novel diagnostic specimen preservation devices.This associate will be responsible for driving technical excellence in the areas of coagulation, clinical biochemistry, hematology, molecular diagnostics and blood gases.Activities include experimentation towards the demonstration of target device performance outputs and putative value propositions for new technologies . RESPONSIBILITIES: 1. Defining and executing experiments including functional performance analysis to support application development for the clinical diagnostic market.  2. Assay development to support internal product performance evaluations as well as technical support for customer application development.  3. Participation in evidence generation efforts for verification of existing and future value propositions associated with novel specimen preservation technologies.  4. Actively participates in technology sensing activities, including trade associations or professional societies.  5. Performs research in areas of coagulation, clinical biochemistry, hematology, molecular diagnostics and blood gases.  6. Candidate will be expected to apply existing knowledge in the area of biorheology and systems biology for the purpose of developing new specimen collection and preservation devices.  7. Submits patent applications and Invention Disclosure Records (IDRs).  8. Performs technology feasibility assessments for new technology concepts when applicable.  9. Provides general laboratory support including SOP development and maintenance for laboratory instrumentation.  10. Prepare verbal and written technical reports, summaries and quantitative analyses of assigned projects.  11. Tabulate and analyze data using statistical and other software programs, including but not limited to Microsoft Excel.  12. Prepare protocols for complex experiments to investigate new and existing technologies using a variety of experimental approaches including novel application of automated clinical assays and newly developed assays.  13. Works under minimal direction toward established long-range goals and objectives.   POSITION REQUIREMENTS (AS APPLICABLE): EDUCATION:A Ph.D. in biomedical engineering, cell biology, molecular biology, or related field with a minimum of 5 years of laboratory experience is required.A focus in the areas of biorheology, hemodynamics, hemorheology and applied systems biology is critical for this role.Previous Post-Doc experience is not required.LICENSES OR CERTIFICATIONS: None required EXPERIENCE: Laboratory: >5+ years’ experienceSPECIAL SKILLS:Strong experience in the area of biorheology, hemodynamics, and/or hemorheology is mandatory for this position.Candidate will be expected to become proficient in the areas of coagulation, clinical biochemistry, hematology, molecular diagnostics, and blood gases.Experience with handling biological specimens, particularly human clinical samples is desirable.Experience with blood cell separation/isolation and culture is strongly preferred; experience with cell separation/isolation from blood is mandatory.General molecular biology and laboratory skills such as ELISA, immunoblotting, UV-VIS spectrophotometry, and basic chemistry (i.e. buffer preparation and pH adjustment) will be required.Knowledge of procedures for blood borne pathogen safety is necessary and will be provided.Must be technically proficient with MS OFFICE and knowledge of statistical analysis is desired.Excellent written and verbal communication skills and interpersonal skills.Comfortable with complex team matrixes and cross-functional environments.Demonstrated successful learning agility.Self-motivated with a strong sense of urgency and willing to take hands on work. ."}