{"jobID": "2759390210", "jobLocation": "Chatham_NJ", "jobTitle": "Environmental Engineer/Geologist/Scientist – Intern – AK", "companyRating": "2.3", "companyInfo": {"Website": "www.bemsys.com", "Headquarters": "Chatham, NJ", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "47000", "jobDescription": "About UsBEM Systems, Inc. (BEM) is a small environmental consulting firm, which provides comprehensive environmental services to federal, state, and local government agencies. Our areas of technical practice are focused on environmental planning and compliance, remediation, water resources, and environmental data management and software development. Our firm enjoys a distinguished reputation for client responsiveness and creative problem solving. As an employee-owned small business, we look for team players who demonstrate individual initiative and embrace new challenges.Job Description, Abilities, and SkillsOur growing backlog of challenging projects in the State of Alaska has created an exciting new opportunity for a student intern interested in the fields of environmental science and site remediation. These projects consist primarily of long-term monitoring (e.g., multimedia sampling, landfill inspections, and habitat assessments) and environmental restoration at remote areas throughout Alaska. We are seeking a temporary (field season) environmental intern currently enrolled in an environmental-related science or engineering university program. Successful candidate must possess good communication skills and enthusiasm to perform tasks as assigned.  Although previous experience collecting data in the field is not a requirement, a basic knowledge of environmental policies such as RCRA, CERCLA, CWA, CAA, ESA, and State of Alaska regulations is beneficial. Under supervision, student will be required to accurately and safely use field sampling and testing equipment such as organic vapor analyzers, GPS units, field screening test kits for pollutants in soil and water, air sampling canisters, pH/EH field kits, and passive diffusion bags. Ability to accurately document field measurements and transcribe them into various reporting media and formats is required. Strong analytical skills to synthesize field and laboratory data for purposes of interpretation, distilling trends, comparison against regulatory standards, and drawing conclusions are preferred.  It is anticipated that the weekly minimum hours will be 24 hours and capped at a payment of 50 per week, which does not include travel time. Payment of all travel costs and meals while on the job will be included. BEM Systems, Inc. will pay for the 40-Hour OSHA HAZWOPER, first aid, and CPR courses; however, the individual is responsible for their time to attend the courses.RequirementsEnrolled in an environmental-related science or engineering university program.Proficient with MSWord, Excel, PowerPoint, and Outlook software.Good verbal and written communication skills.Self-motivated and work well with limited supervision.Ability to travel to complete field investigations in adverse weather conditions carrying objects up to 50 pounds.Ability to travel to remote field locations in small aircraft including helicopters.Possess a valid driver’s license, clean driving record, and ability to provide documentation.Ability to access United States Department of Defense facilities (access coordination provided through BEM Systems, Inc.). HR Manager  BEM Systems, Inc., Corporate Office  100 Passaic Avenue  Chatham, NJ 07928  E-Mail: dbushey@bemsys.com  Fax: 908.598.2622  Equal Opportunity Employer  M/F/D/ "}