{"jobID": "2824421488", "jobLocation": "Newark_NJ", "jobTitle": "Research Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.smithsdetection.com", "Headquarters": "HEMEL HEMPSTEAD, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Rapiscan Systems"}, "estimatedSalary": "74000", "jobDescription": "Job Description As a Research Scientist in the Imaging group, you will work within a team of scientists and software developers on algorithm development and system characterization for computed tomography (CT) explosives detection systems. Research areas within our group include CT image formation, image quality, image analysis, and machine learning. Team members in the imaging group work on a wide range of projects aimed at supporting our current day products and also at investigating next generation technologies for the EDS market.  Duties and Responsibilities Using existing tools & software to devise and perform experiments pertaining to CT system design & analysis.Enhance existing software modules according to project requirements.Design, prototype, and test new algorithms in C++, Python, & Matlab.Complete project deliverables, shifting priorities as needed.Report results to multidisciplinary audiences, both technical and non-technical.Adapt and grow into new responsibilities over time. Required Skills and Experience Qualifications/Requirements:Masters or greater in Applied Mathematics, Electrical Engineering, Physics or related field.Minimum 2 years experience in software development using C or C++.Demonstrated ability in analysis, testing, and problem solving, preferably using software or modeling tools.Strong written and verbal communication skills. Able to present ideas and material clearly and concisely, to both technical and non-technical audiences.Technically flexible. Able to work on multiple simultaneous projects and learn new material quickly.Must be eligible and willing to apply for US Security Clearance. Typically this requires United States Citizenship.Eligibility Requirements:Must submit your application for employment through the Smiths Detection website to be considered.Must be 18 years or older.Must be willing to take a drug test as part of the selection process.Must be willing to submit to a background investigation as part of the selection process.Must be willing to submit to a government background investigation as part of the selection process.Must have unrestricted authorization to work in the United StatesMust be willing to work out of an office in Newark, CA For U.S. employment opportunities, Smiths Detection hires U.S. citizens, permanent residents, asylumees, refugees, and temporary residents. Temporary residence does not include those with non-immigrant work authorization (F, J, H or L visas), such as students in practical training status. This position has the additional requirement of eligibility to apply for a US Security Clearance. Exceptions to these requirements will be determined based on shortage of qualified candidates with a particular skill. Smiths Detection will require proof of work authorization. Any offer of employment is conditioned upon the successful completion of a background investigation and drug screen. Desired Characteristics:Experience with CUDA & GPU programming.Expertise with Matlab or similar prototyping language.Experience with Monte Carlo particle tracking software e.g. GEANT4, MCNP, Penelope, etc.Familiarity with common image processing toolkits and libraries e.g. Matlab, VTK, ITK, etc.Understanding of x-ray physics, CT image generation, fourier analysis, signal processing, stochastic processes, & image quality.Experience working with 3D data sets and 3D image processing.Scripting in Python, Perl, or other scripting language.Experience with Linux development tool chains.Experience working in/with governmental agencies.Proven experience working both with a team and independently. About Us  At Smiths Detection we are dedicated to making the world a safer place.  Smiths Detection, a division of Smiths Group, is a global authority on the application, management and manufacture of world class detection and screening technology.  We deliver solutions needed to protect society from the threat and illegal passage of explosives, prohibited weapons, contraband, toxic chemicals, and narcotics. Delivering an unrivalled range of detection technologies, we support customer from markets across air transportation, ports and borders, the armed forces, and critical iSDL2017"}