{"jobID": "1996635327", "jobLocation": "Dearborn_MI", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.asg.com", "Headquarters": "Naples, FL", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " Position Description: The company's Global Data, Insights and Analytic (GDI&A;) Team is a new and rapidly expanding group. The GDI&A; Data Operations is responsible for the discovery and curation of new and existing data sources (First party data, external data providers, public data, social media, digital exhaust, transactional data etc.) for use in building incremental value and insight for the business. The Data Acquisition Specialist is responsible for the global research, documentation, testing and acquisition of external data assets, aligned to internal customer needs. This position is responsible for the evaluation and profiling of external data sources, including: -Analyze new and existing external data sources to suggest fit for use cases. -Collaborate with Analytics and IT teams to profile the data for eventual use in modeling and visualizations -Able to identify relationships in data to assist in providing insights -Enhancements to the external data & vendor knowledge system -Establish relationships with vendor technical points of contact and internal customers -Work cross-functionally to manage data and analytic projects Improve department results through innovation -Evaluation of data accuracy, completeness, timeliness and stability and establishing repeatable, sustainable processes to maintain data -Develop business controls to comply with legal and regulatory requirements and corporate policies Skills Preferred: -Demonstrated SQL and Alteryx skills. (SAS or Tableau accepted as alternatives) -Strong experience in profiling data. -An understanding of creatively visually depicting data. -Strong collaboration and presentation skills -A passion for embracing innovation, discovery & constant learning. -Demonstrated problem formulation and problem solving skills Experience Required: -Bachelors Degree -2 or more years of experience with using at least one of the following data analysis tools: SAS, Hive, Alteryx, Hadoop, SQL or QlikView -3 or more years of PowerPoint and Excel experience -3 or more years of analysis, computational complexity and critical problem solving Education Required: -Bachelors degree from accredited university Education Preferred: -Masters"}