{"jobID": "2587155544", "jobLocation": "Cypress_CA", "jobTitle": "Senior Scientist", "companyRating": null, "companyInfo": {"Website": "www.sara.com", "Headquarters": "Cypress, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job DescriptionSenior ScientistJob Description We are seeking an exceptional engineer or scientist with a strong background in any combination of the following areas:  • Acoustics/Aeroacoustics  • Compressible Fluid Dynamics  • Aerosol Mechanics  Both individuals of strong analytic/computational backgrounds and strong experimental backgrounds will be considered. Demonstrated leadership skills will be valued highly. Requirements • A PhD in mechanical/chemical/aerospace engineering, physics or equivalent levels of exceptional professional experience. Post doctoral work or professional experience in addition to an advanced degree will be a benefit.  • We also may consider strong candidates with an MS degree and especially relevant research experience.  • Demonstrable skill in math, science and engineering.  • Demonstrated experience working in project and team environments.  • Excellent oral presentation skills  • Demonstrated written communication skills  • US CITIZENSHIP required for security clearance purposes About SARA, Inc. Scientific Applications & Research Associates, Inc. (SARA) is a world-class Defense Research and Development enterprise, with a charter to create technology innovations in support of America’s providers and defenders. We have expertise in electromagnetic and acoustic sensors and detection systems; directed energy technologies; automated test data management signal processing; small robotics; and renewable and alternative energy generation.  As innovators in our industry, we operate in small creative teams and provide opportunities for independent research in new fields and technology. Salaries at SARA are competitive and are commensurate with the experience and qualifications of the individual. Additionally, SARA’s compensation package includes a comprehensive benefits package, tuition reimbursement, flexible work hours, and employee stock ownership. SARA is headquartered in Cypress, CA (near Los Angeles), with engineering offices and labs in Irvine, CA, Colorado Springs, CO, Waterbury, CT, and Tyler, TX.  SARA, Inc. is an EEOC/Title VII/ADA compliant federally contracted employer. All qualified applicants are considered for employment without regard to their race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Also, as a federal contractor, SARA must abide by the Drug-Free Workplace Act of 1988 and maintains a drug-free workplace regardless of local and state allowance.  U.S. citizenship is required for most positions."}