{"jobID": "2827413269", "jobLocation": "Chicago_IL", "jobTitle": "Clinical Research Scientist - Center for Rehabilitation Outcomes Research, Full-time", "companyRating": "3.3", "companyInfo": {"Website": "www.sralab.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1953", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " TIRR Memorial Hermann, Kessler Institute for Rehabilitation"}, "estimatedSalary": "87000", "jobDescription": " General Summary  The Clinical Research Scientist will direct, manage, and administer various aspects of clinical or translational research in the creation and operation of a program of research focusing on evidence in the rehabilitation clinical realm. Teaches and advises therapists, nurses, and researchers in areas of clinical research. Provides specialized consultation to RIC investigators, clinical fellows and clinicians in the areas of evidence-based clinical research in area of specialty.  The Clinical Research Scientist will consistently demonstrate support of the Shirley Ryan AbilityLab statement of Vision, Mission and Core Values by striving for excellence, contributing to the team efforts and showing respect and compassion for patients and their families, fellow employees, and all others with whom there is contact at or in the interest of the institute.  The Clinical Research Scientist will demonstrate Shirley Ryan AbilityLab Core Attributes: Communication, Accountability, Flexibility/Adaptability, Judgment/Problem Solving, Customer Service and Core Values (Hope, Compassion, Discovery, Collaboration, & Commitment to Excellence) while fulfilling job duties.  Principal Responsibilities The Clinical Research Scientist will:Develops goals and objectives for area of responsibility to ensure continued growth and development of unit and its activities and to assist the Institute in achieving its goals and objectives.Defines, develops and modifies aspects of the program of research as it is expressed in specific projects.Develops research proposals for submission to funding agencies and prepares grant applications in order to secure funding for research.Participates in research activities for funded and non-funded projects.Creates and implements short-and long-term plans for various aspects of the RSEU program of research necessary to assist in achieving research funding.Consults with investigators, residents, clinicians and clinical fellows regarding research design, measurement issues and statistical analyses.Writes research reports, develops presentation proposals, and speaks at professional meetings.Prepares and submits research articles for publication in professional journalsProvides formal lectures and participates in and conducts departmental in-service programs.Serves as faculty on clinical specialty topics in the Northwestern Medical School's Department of Physical Medicine and Rehabilitation Resident Research Program and lecturer at the Institute's Education and Training Center.Manages segments of the unit's human resources, which includes supervision, direction, and development of professional and nonprofessional staff.Keeps informed of developments in measurement, translational research, evidence-based methodology, and clinical specialty and statistics to maintain and enhance professional expertise. Acquires and maintains knowledge of current trends and developments in rehabilitation research.Perform all other duties that may be assigned in the best interest of the Shirley Ryan AbilityLab. Reporting Relationships Reports directly to the assigned manager of research program Knowledge, Skills & Abilities Required Minimum 5 years clinical experience in physical rehabilitation as licensed professional.Knowledge of clinical research principles normally acquired through a post-professional doctorate from an accredited school.Requires a high level of proficiency and knowledge in evidence-based research or translational research at a level generally acquired through at least two years of research experience in medical rehabilitation.Requires a high level of analytical ability to design and conduct research projects.Requires a high level of proficiency in writing to prepare grant proposals, research reports and other publications, and explain complex results to a lay audience.Requires knowledge and skills for successful compliance with IRB submission proposals and reports.Interpersonal skills needed in order to supervise subordinates and communicate effectively with other staff members, fellow researchers, and the like. Working Conditions Normal office environment with little or no exposure to dust or extreme temperature. The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified.  SRAlab is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.SDL2017"}