{"jobID": "2828859798", "jobLocation": "Chicago_IL", "jobTitle": "Visiting Biomedical Informatics Research Specialist (Research Data Modeler)", "companyRating": "4.0", "companyInfo": {"Website": "www.uic.edu", "Headquarters": "Chicago, IL", "Size": "Unknown", "Founded": " 1982", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "40000", "jobDescription": "SEARCH EXTENDED The Center for Clinical and Translational Science (CCTS) at the University of Illinois at Chicago (UIC) is seeking a Biomedical Informatics Research Specialist (Research Data Modeler) who will contribute to the conceptualization, design, development and delivery of biomedical informatics research projects, addressing all areas of clinical and translational science for the Center for the CCTS. This position conducts and manages advanced biomedical informatics research projects, analyzes results, processes and develops innovative approaches to refine project design and outcomes based on the research project needs. This position also works collaboratively with research projects along the scientific pipeline, from discovery through the study of patients and populations to improve public health to advance the deployment of information and computation in healthcare; interpret critical biological findings; and translate biological discoveries into clinical utility. Duties:Designs and develops biomedical informatics research platforms and tools for evidence based, data driven clinical research projects including the design of systems for processing of extremely large volumes of primary and derived data, data mining, statistical analysis and reporting the results/findings.Proposes new research agendas and programs based on independent analysis and in-depth understanding of the field of clinical&translational; research.Contributes to the conceptualization, design, development and delivery of biomedical informatics research projects, addressing all areas of clinical and translational science for CCTS.Conducts and manages advanced biomedical informatics research projects, analyzing results, processes, and develops innovative approached to refine project design and outcomes based on the research project needs.Writes and publishes scientific manuscripts and grants based n primary research topics.Researches core literature in the biomedical informatics field to identify appropriate advances and new trends.Works collaboratively with research projects along the scientific pipeline, from discovery through the study of patients and populations to improve public health to advance the deployment of information and computation in healthcare.Interprets critical biological findings and translates biological discoveries into clinical utility. Outcomes from projects provide resources and technologies that facilitate clinical and translational science research at the University, partner institutions and the national CTSACreates new theories, typologies, representations, methods and processes to address biomedical and informatics problems. Identifies, modifies and applies existing bioinformatics and computational tools for clinical and translational research projects, keeping aligned with changing trends and requirements.Serves as collaborator and primary consultant with research and clinical faculty on design, optimization of research aims, suggesting alternative approaches for identifying elements from data and consulting on approaches for data retrieval, aggregation and interpretation.Perform other related duties and participate in special projects as assigned.Qualifications: Master's degree in Biomedical Informatics, Clinical Informatics, sciences or related field.  3-5 years of experience with relational data modeling, scripting language skills (javascript, perl), programming skills (python), SQL, Unix, Windows, exposure to biomedical terminology, exposure to popular biomedical data models (i2b2 or OMOP)  Requires excellent communication, organization, presentation, analytical and computer/pc skills, to include Microsoft Office and other related software.  Advanced skills in data analytics and data mining. Excellent problem solving skills.  Additional pluses: Experience in a large academic medical center; Exposure to electronic dental record systems; Medical image processing and analysis, software and methods"}