{"jobID": "2826769029", "jobLocation": "Jersey_City_NJ", "jobTitle": "Corporate Finance: Data Science & Artificial Intelligence Solutions PMO - Vice President", "companyRating": null, "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " JPMorgan Chase & Co. (NYSE: JPM) is a  leading global financial services firm with assets of $2.4 trillion and  operations worldwide. The firm is a leader in investment banking,  financial services for consumers and small business, commercial banking,  financial transaction processing, and asset management. A component of  the Dow Jones Industrial Average, JPMorgan Chase & Co. serves  millions of consumers in the United States and many of the world's most  prominent corporate, institutional and government clients under its J.P.  Morgan and Chase brands. Information about JPMorgan Chase & Co. is  available at www.jpmorganchase.com.From managing the firm’s capital and reporting quarterly  earnings to responding to and complying with regulatory requirements, more than  15,000 colleagues around the world work together every day to manage the firm's  Global Finance function. Our job is to ensure the company is capable of  navigating all types of market environments while maintaining a fortress  balance sheet. The Finance function is a dynamic organization that plays a  critical role, particularly as increasing regulatory and capital requirements  change the way we do business. Planning & Analysis (P&A;), in addition  to CFO teams, Controllers, Business Managers and Project management, make up  the majority of the Global Finance team.  The Robotics & Dashboards Center of Excellence (CoE) is  leading initiatives across GF&BM; focused on automating manual processes  using robotics and enhanced automation techniques such as AI and Machine  Learning and creating dynamic and flexible visual dashboards using Tableau. Sitting  in the center, this CoE interfaces with internal clients (LOB P&A;, CFO and  Controller Groups) to source ideas around robotics, enhanced automation and  dashboard opportunities, run functional and technical feasibility analyses,  translate the ideas into use cases and partner with Technology to deliver  tangible solutions against those use cases. Key Responsibilities:Partner  with data scientists and artificial intelligence (AI) engineers and deliver on  a portfolio of projectsProactively  manage progress, delivery and overall execution of multiple projects at  different stages of development; report on status, risks / issues, and  recommend corrective actions to ensure successful completionMeasure  project performance using appropriate systems, tools and techniques such as  project plans and trackers.Create  executive level readouts and status reporting for key client counterparts.Use  Agile techniques to drive delivery efficiency with the engineering teams.Use  appropriate verification techniques to manage changes in project scope,  schedule and costsReport  and escalate to management as needed.Review  project pipeline and schedules with senior management and team membersProvide  thought leadership on implementation strategy and change managementDetermine  the scope of any new efforts, directing the strategic thinking, and developing  an approach and structure required to achieve key deliverables within  initiativesFacilitating  working group meetings with key stakeholdersMust be a highly  energetic self-starter with a relentless focus on execution and exhibit the ability to:"}