{"jobID": "2831072180", "jobLocation": "Washington_DC", "jobTitle": "Area Community Manager", "companyRating": "4.5", "companyInfo": {"Website": "www.equityapartments.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Public (EQR) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " UDR, AvalonBay Communities"}, "estimatedSalary": "67000", "jobDescription": " This is a floating position supporting our Metro DC portfolio of 47 communities.  Working for Equity Residential  means being part of a community employees and residents striving to provide  the best in apartment living, speaking boldly about new ideas for innovation,  and inspiring creativity in the ways we live and work together. Thats what our  Be.Think.Play.Live. culture is all about.  Our Community Managers are  smart, savvy team leaders with a passion for customer service and a strong  business acumen. They are accountable for all aspects of their propertys  operations, including financial performance, resident satisfaction and  retention, and developing an engaged and productive team. They monitor a wide  array of performance metrics, implement strategies to meet operational and  leasing goals, analyze and respond to changing market conditions, and identify  areas for improvement.  As a Floating Community Manager,  you will utilize your proven leadership abilities to readily adapt to the  unique challenges that accompany supporting a diverse portfolio of communities.  You will frequently rotate between assets of varying sizes, types, ages, and  conditions, adapting to nuances in the team structure, clientele, and submarket  at each individual community. You will demonstrate adaptability and  intellectual curiosity as you support the changing business needs of the  portfolio and travel throughout the region to cover vacations, leaves of  absence, and open positions, as well as to support and train newly hired or  promoted Community Managers. This position requires a high degree of  independence, accountability, and an ability to work with varying levels of  supervision. Each day will be unique, requiring an ability to prioritize, multitask,  think creatively, take initiative, and employ a diverse set of skills. At each  community you support, you will direct sales activities, leasing  administration, and maintenance initiatives, exemplifying Equity Residentials  brand each and every day by thinking like an owner and ensuring that your team  members have the resources they need to be successful while enjoying the ride. WHO  YOU AREA Leader. You will provide  leadership and mentoring to your teams, promoting a positive work environment  that encourages collaboration and teamwork.A Strong Communicator. Your writing and  speaking skills are clear and effective, helping you connect well with others.A Team Player. You are united with  teammates in delivering the best experience to current and prospective  residents living at your assigned community.Organized and  Accountable. You  have exceptional time management abilities and are able to juggle the needs of  changing priorities within your portfolio while accomplishing objectives  through training and motivating high-performing teams.Creative. You are an idea person  and like coming up with smart solutions to new challenges.Levelheaded. You keep your cool  during stressful situations and quickly find solutions.Flexible and Adaptable. You understand that the  world does not exist through black and white lenses and embrace the opportunity  to live in the gray.Confident and Decisive. You take initiative,  trust your gut, and are not afraid to make a decision or deliver a difficult  message.Motivated. You invest extra energy  to reach your goals and help your teams reach theirs.Solution-Oriented. You follow through on  commitments, letting residents know that they matter.WHAT  YOULL DOSupport your entire  assigned portfolio (typically 20+ properties) by providing leadership  coverage for vacations, leaves of absence, and open positions.Coach, train, support,  and develop newly hired or promoted Community Managers and/or sales team members in your  region.Lead special projects  and assignments for your region including but not limited to competitor analysis,  due diligence, sister site audits, and other company or portfolio initiatives.Build community and  industry knowledge by identifying trends to prepare for future occupancy  needs and offering recommendations and training for your assigned  property.Connect people to  community through  effective leasing administration and training of your teams.Show off our communities by prioritizing curb  appeal and maintaining accurate and in-depth knowledge of all aspects of the  properties and markets you are assigned.Manage the leasing  process by guiding the teams through effective sales strategies and follow-through.Support maintenance  operations by partnering with each communitys Maintenance Manager to provide a sparkling  product through preventive maintenance, timely and efficient repairs, and a  highly organized make-ready process.Partner with Regional  Managers to prepare and follow operating budgets and to plan community capital  improvements, repairs, contract developments, and negotiations.Orchestrate all  accounting functions associated with your assigned property, including  processing invoices, paying bills, and assisting the Central Business Group  (CBG) with collections, evictions, and managing resident accounts and charges.Train and collaborate  with talented teammates to identify and solve any issues that arise.Drive the portfolio to  continued operational success by proposing income-producing opportunities such as  competitive pricing and value-add community enhancements.Focus on performance  metrics ranging  from your communitys Customer Loyalty Scores to sales conversion rates to  apartment turnover efficiency - and everything in between.REQUIREMENTSMinimum of 1  year in a Community Manager role or equivalentWorking  knowledge of tenant and eviction lawsExperience leading a high-performing teamFamiliarity and comfort with performance metrics,  sales quotas, and financial conceptsDemonstrated  proficiency in working with computers including word processing, calendar  management, software/database, and social mediaExcellent communication, interpersonal, and  organizational skillsHigh school diploma or equivalentAvailable to work a flexible schedule, including  weekendsFlexibility for frequent local travel throughout your  assigned portfolio; in markets where not all properties are able to be  accessed by public transportation, a drivers license and reliable vehicle will  be requiredPREFERRED  EXPERIENCECollege degree or related coursework in business,  accounting, hospitality, or property managementDemonstrated ability to secure leases and to exceed  sales goalsREWARDSWe recognize  everyone has different needs outside of work. Thats why, in addition to a  competitive benefits package (medical, dental, vision and paid time off), we  offer many unique options to employees, like adoption benefits and paid time  off for community service projects. To learn more, view our Total Wellbeing  page here."}