{"jobID": "2807771183", "jobLocation": "Basking_Ridge_NJ", "jobTitle": "Predictive Analytics Manager", "companyRating": "3.6", "companyInfo": {"Website": "www.verizonwireless.com", "Headquarters": "New York, NY", "Size": "5001 to 10000 employees", "Founded": " 2000", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "What you’ll be doing... The Predictive Analytics Manager will be part of the newly formed Business Analytics COE to delivers world-class insights in driving business impacts through a data driven approach. They will be an analytics business partner to Marketing Strategy and Consumer & Business segment teams in delivering the “Get Them, Grow Them and Delight Them” objectives for the wireless business. The incumbent will be involved in pricing decisions, promotion and offer optimization, device economics, product & customer profitability, omni-channel strategy and new initiatives to improve business efficiency through analytics driven decision management.  This role requires an individual to drive predictive and prescriptive analytics to: Guide & support strategic insights on Value Based Marketing.Identify new opportunities to drive the business growth.Deliver in scale and agility to allow quick responses to changing market conditions. This position requires deep understanding of customer behaviors, strategic thinking, strong financial acumen, and x-functional aptitude in order to design analytical solutions to make the best informed decisions possible. The successful candidate will interact with all HQ & Market departments including Marketing, Digital, Media, Credit Risk, UX/CX, IT Finance and Network. Some of the high level focus areas for the role include:  Analytical Work Management: Partner with internal business partners in gathering business requirements and developing advanced analytical solutions to complex problems.Hands on active participation in analytical projects delivering improvements in decision-making and business strategies via advanced analytics.Participate in the design, implementation and interpretation of experiments/trials for continuous refinement of on-going strategies.Translate predictive insights from complex analytical framework to marketing investment optimization.Prepare presentation materials and formal business case documents for use with senior management to promote findings and drive science based decision support recommendations. Modeling & Infrastructure: Develop and deploy both traditional statistical models and machine learning techniques and algorithms: Regression, clustering, neural networks, random forest etc. to guide marketing investments and strategy.Partner with in-house data strategy experts to design analytically ready datasets by stitching customer data across multiple platforms and incorporating business rules. Leadership Develop strong relationships with business partners to transform the role of analytics to decision guidance (analytics as partner not as support function).Partner with functional groups (Marketing, IT, Commercial Finance, Operations, Network, etc.) to embed analytics and science driven approach in all business decisions.Be recognized as a subject matter expert and participate in knowledge/best practice sharing opportunities.Continually broaden and strengthen knowledge of analytical methods, vendors and tools.What we’re looking for... You'll need to have: Bachelor's degree or four or more years of work experience.Six or more years of relevant work experience.Five or more years of experience in developing and implementing analytical solutions.Five or more years of experience in Data management, analysis and visualization.Experience with any of SAS/R/Python and experience programming in SQL, VBA, SPSS, MATLAB, JAVA, Tableau or other related tools. Even better if you have: A Master's degree in a quantitative discipline such as Mathematics, Statistics, Financial Economics/Econometrics, Engineering, Computer Science, or Operations Research.Five or more years of experience in developing and implementing analytical solutions to complex business problems/opportunities.Five or more years of active experience in Data management, analysis and visualization to realize absolute and incremental commercial gains.Experience working in the Consumer/Retail space within the Financial Services, Telecommunications, Technology or other related mass market industries or related work in the Public Policy, Bio-statistics and Scientific Research industries.A passion for educating and communicating analytic findings and insights with integrity to all levels: from going over raw output with colleagues to creating PowerPoint presentations and storyboards that captivate and succinctly convey complex ideas to our strategic business partners.An appetite for improvement of our analytical products and processes built on a solid foundation of a lifelong love of learning.High level of curiosity and investigative mind-set with an attention to detail, a tenacity of thought, the flexibility to adapt to new challenges and the resiliency to overcome short-term hurdles by staying focused on the team's deliverables.When you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}