{"jobID": "2827675774", "jobLocation": "Torrance_CA", "jobTitle": "Data Analyst Coordinator", "companyRating": "3.5", "companyInfo": {"Website": "www.24seventalent.com", "Headquarters": "New York, NY", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aquent, The Creative Group, JBCStyle"}, "estimatedSalary": "65000", "jobDescription": "Client Overview: Our client is a well-known company specializing in licensing and branding for top athletic accessory brands. Their innovative, on-trend, and dynamic approach distinguishes them at the forefront of the industry. Position Overview: In this role, you would be responsible for leading, investigating, and maintaining core product information through various systems. You would also be responsible for evaluating data for accuracy, timeliness, and completeness to support the product development process. Responsibilities: • Support the Product Operations Manager with all aspects of reporting, analysis, auditing of product information  • Lead, investigate, and maintain core product information through various systems and evaluate data for accuracy, timeliness, and completeness to support the product development process Drive key calendar dates for seasonal product operations projects and manage the creation and maintenance of color codes for all product styles  • Oversee confirmed and non-confirmed seasonal items, generate reports, and communicate updates to necessary partners  • Ensure accurate and timely transfer of data with external and internal partners and present solutions for escalated issues Key Qualifications: • Bachelor's degree in business or related field1-3 years’ data management or reporting experience  \"24 Seven and its clients will consider qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring Ordinance.\""}