{"jobID": "2825691394", "jobLocation": "Jackson_MI", "jobTitle": "Work Management System Owner", "companyRating": null, "companyInfo": {"Website": "www.alro.com", "Headquarters": "Jackson, MI", "Size": "1001 to 5000 employees", "Founded": " 1948", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Alro Steel is searching for a Work Management System Owner with an enthusiastic attitude and a strong work ethic. Responsible for the development and implementation of a newly rewritten work management system within the company. This includes continual defining and facilitating communication with stake-holders and the internal Information Technology Department. The Warehouse Management System Manager will be responsible for monitoring, analyzing and solving issues that arise as well as implementing continuous improvements. They will also develop, coordinate and manage a small team to aid in achieving the Work Management Systems success. Alro Steel Corporation supplies raw materials (carbon, stainless steel, aluminum, red metals, plastics and industrial supplies) to a variety of manufacturing and other industries. Our customer base, ranging in size from small to very large users of metals, has come to depend on Alro's commitment to excellent delivery service. Alro Steel, established in 1948, is a privately held corporation with over 60 facilities strategically located throughout the Midwest and Southeast. Please visit our website at www.alro.com for more information.  Essential duties and responsibilities would include the following: Establish, coordinate and manage the development and implementation of a newly rewritten Warehouse Management System to be utilized by warehouse operations;;Establish, coordinate and manage the integration of new systems and/or software with existing technology;Analyze and identify needs of the warehouse and processing operations from a corporate level;Resolve daily work management system issues and continually implement improvement ideas;Converge daily with the Information Technology Department, to track and monitor IT related projects;Connect and interact regularly with other corporate departments and stakeholders;Ensure compliance with corporate work management policy;Develop, coordinate and manage the Warehouse Management Specialist Team. The ideal candidate will possess the following qualifications and skills: Minimum of two years of college coursework preferred;Knowledge of ERP Operating Systems and work-flow required;Previous operations management experience in the Metals Service Center industry;Interpersonal communication skills coupled with knowledge to effectively support the Information Technologies Team;Knowledge of AS400 Systems and work management processes;Exemplary communication and presentation skills in both formal and informal settings;Superior organizational, planning and multi-tasking capabilities;Effective communicator, motivator and leader;Computer skills; including MS Word, Excel and PowerPoint. Additional qualifications and skills preferred: Two years of IT-related project management experience;Self-motivated to engage in continued learning, including after hours;Software programming experience;Experience in computer related discipline.Alro offers a competitive salary, and a robust and complete benefits package. Salary for this position will be commensurate with experience. Alro offers a drug-free work environment in a team-oriented atmosphere with opportunities for growth. EOE"}