{"jobID": "2837702334", "jobLocation": "Houston_TX", "jobTitle": "Global Data Integrity Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.virtusllc.com", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "62000", "jobDescription": " Job Description  Monitors and manages thorough research of large volumes of transactions and updates data in systems. Assists with various tasks related to asset and liability quality control including best practice communications with internal and external parties regarding integrity of global data. Build, manage, mentor and assist with career development of a team of 3 to 5 researchersAct as a point of contact for escalated data issuesResearch and provide resolution for complex data issues which are preventing the release of accurate report dataProcesses and maintains accurate global data for securities and issuers transactionsAssist in developing queries for quality review of dataManages thorough research of large volumes of transactions and monitors activity reports including cash status aging reports, Loan X id reports, Maturity Date reportsActively monitors metrics for researchers of global discrepancies with various paying agents and internal clientsImplement team process of checks and balances for accuracy of data reportingAssist in determining attainable team metricsLiaisons with counterparts to ensure accuracy and quality control of transaction flow and follows up on outstanding issues ensuring timelines of client reports are metProactively and effectively communicates with paying agents, clients, team members and within the firm as neededWorks closely with others to resolve issues effectively and timely with technology to design efficient quality control metrics and provide feedback for future system enhancementsRuns and analyzes various internal reports needed and handles global level issuesAssists in identifying and resolving monthly reporting data issuesAssists with projects as neededFacilitate departmental knowledge base training by sharing best practices and procedure documentationAssists in training and development of Asset AdministratorsAssists with system development and testing as neededLead global data cleanup initiative. [As measured by] Aged cash report, Loan X id reports, missing cross reference reportsManage team to maintain a low amount of research items, a low amount of discrepancies emailed from the client services team and a low amount of outstanding items on the CDO Suite DDA report and Expected Transactions Report. [As measured by] Research in Laserfiche per alpha assigned, volume of responsible party JIRA tickets and review of the aged items in the CDO Suite DDA and Expected Transaction reportsMaintain overall client satisfaction. [As measured by] Feedback gathered from internal and external clients throughout the yearAssisting with the labeling of notices in Laserfiche and assisting with projects as needed. [As measured by] Monitoring of time slots in Laserfiche and completion and accuracy of projectsActive management coaching timeline maintenance. [As measured by] director meeting matrixOther duties as assigned by Management Required Skills Technical or Administrative Knowledge:Highly proficient with Microsoft softwareAdvanced Excel skills requiredBloomberg knowledge requiredSpecial Skills and/or Abilities:Experience with daily and complicated security transactionsExperience with an asset tracking system a mustExcellent analytical and problem-solving skillsExtensive knowledge of all security accruals and payment rulesAbility to read and interpret offering memorandums and note and synthetic documentsExtensive knowledge of securitiesStrong verbal and written communication skillsExcellent attention to detailExercises independent judgment and is multi-task orientedTakes initiatives and ownership of job responsibilitiesMust be able to work well with others in a team environmentPerform job duties accurately and timelyMust be able to adhere to deadlines and targets given Required Experience Education/Training (or equivalent):Bachelor’s Degree preferred or 10 years related work experienceExperience (Type of work experience, minimum number of years):Minimum of 7-10 years in banking/finance industry Technical or Administrative Knowledge:Highly proficient with Microsoft softwareAdvanced Excel skills requiredBloomberg knowledge required Job Location  Houston, Texas, United States  Position Type  Full-Time/Regular"}