{"jobID": "2630898906", "jobLocation": "Playa_Vista_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.fullscreenmedia.co", "Headquarters": "Playa Vista, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Media", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Fullscreen Direct (FSD) is looking for a seasoned Data Analyst who will be responsible for leading the data analysis efforts for the organization. FSD is in the business of creating direct relationships between affinity brands (celebrities, musicians, athletes, social media stars, etc.) and their fans. This person will be pivotal in driving the FSD business forward through sophisticated analyses and insight development. This role is tasked with assisting in making sure that every client is optimizing their respective business on the FSD platform, and empirically proving that we are driving incremental revenue for our clients.ResponsibilitiesOwn the design, development, validation, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. to drive key business decisionsConduct hands-on modeling/analytics retrieving, compiling, and analyzing large volumes of data from disparate databases into distilled, actionable information and insightsExecute quantitative analyses that translate into actionable insights for Fullscreen Direct and its roster of client accountsDeep understanding of e-commerce and the associated transaction funnel analyticsDevelop new insights that inform decisions and drive the collective business forwardDevelop standardized dashboards and reports with an emphasis on automation and scalabilityIdentify data requirements and data visualization/reporting needsEffectively present data and analysis to both internal stakeholders and external clients and 3rd parties Design and analyze A/B multivariate tests to drive KPI improvementQualifications3+ years of experience as a Data Analyst, preferably with an e-commerce or entertainment / digital media companyExceptional analytical and quantitative skills with ability to interpret and summarize complex data that drive actionable plans that add value to the businessStrong skills in MS Excel and SQL to query normalized relational data and dimensional warehouse data.Experience with Mixpanel a plusFamiliarity with reporting tools such as Tableau and QuickSightDetail-oriented and exceptional organizational skillsExcellent verbal and written communication skills with the ability to interact at all levels of the organizationAbility to work independently, be self-motivated and results-oriented but still be an excellent team player with a strong level of serviceAbility to thrive in a fast paced, entrepreneurial, high-energy environment that requires the ability to multi-task and implement high priority initiativesBachelors degree with a major in Math, Statistics, Finance, Economics, etc. is strongly preferred (MBA a plus) Perks & Benefits Use What You Need paid time offFlexible dress codeKitchen stocked with snacksPet InsuranceCatered meal on FridaysHealth, dental and vision benefits401(k) with a company matchBoth paid maternity time and paid paternity timeDog-friendly FridaysABOUT FULLSCREEN DIRECT:Fullscreen Direct (a Fullscreen Media company) is a powerful, integrated Direct to Fan tech platform for artists and creators to run their digital businesses and engage directly with their fans using tools for marketing, commerce and content distribution.ABOUT FULLSCREEN MEDIAFullscreen Media is a global leader in social-first entertainment experiences serving creators, brands and consumers. Fullscreen Media is comprised of three key businesses: Fullscreen Creator Network is the biggest network empowering creators through a variety of services, from audience development and programming support to management, content production and merchandising. Fullscreen Entertainment reaches consumers through creator-driven experiences from Fullscreen Live, original content from Fullscreen Productions and the pioneering Rooster Teeth studio, and subscription video on demand services Fullscreen and Rooster Teeths FIRST. Fullscreen Brandworks partners with major brands to tap into the power of social media with original entertainment, influencer marketing, multi-platform social content and targeted media through the Fullscreen Media Network.Fullscreen, Inc. is committed to employing a diverse workforce. You will receive consideration without regard to race, color, religion, sex, national origin, age, sexual orientation, gender identity, gender expression, protected veteran status, or disability."}