{"jobID": "2831397159", "jobLocation": "Kingsville_TX", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.tamuct.edu", "Headquarters": "Killeen, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Research ScientistA&M; System Member : Texas A&M; University - KingsvilleDepartment : Kleberg Wildlife Research InstituteJob Category : Other or Not SpecifiedJob Type : StaffLocation : KingsvilleProposed Minimum Salary : CommensurateJob Requisition Number : R-008577Security Sensitive? : YesJob TitleResearch ScientistAgencyTexas A&M; University - KingsvilleDepartmentKleberg Wildlife Research InstituteProposed Minimum SalaryCommensurateJob LocationKingsville, TexasJob TypeStaffJob DescriptionResponsibilities:Designs, performs, and analyzes experiments consistent with project objectives. Conducts independent research aligned with the TAMUS member’s mission. Keeps detailed records of procedures and data.Mentors students on analyzing and preparing data results.Validates strategic decision-aid models.Develops procedures to improve efficiency and accuracy of data collection and analyses.Identifies, assimilates, and synthesizes data needed for computer models and manages databases relating to statistical and related software.Maintains expertise with the latest hardware and software technologies for statistical and numerical data analyses. Keeps up-to-date on scientific research via reading of literature, etc. Attends scientific meetings and seminars for research enhancement.Prepares data for publication and presentation. Writes grants and proposals to acquire external funding.Coordinates laboratory activities. Maintains laboratory instrumentation and follows applicable safety standards.Work on data analyses using programs, statistics, GIS, and other tools.Write reports for funding sources, federal endangered species and SUP reports, IACUC reports, etc.Collaborate with other colleagues, graduate students, reviewing and mentoring undergraduate students.Wears all safety equipment and clothing as appropriate for the tasks and as required by P.I.Education and Experience:Ph.D. in wildlife science, natural resources, biology or related field or equivalent combination of education and experience.Four years of related experience.Knowledge of appropriate laboratory and technical equipment. Knowledge of statistical analyses and statistical analyses software. Knowledge of research in practical and/or basic sciences and scientific publications.Ability to multitask and work cooperatively with others. Ability to present information clearly and concisely. Excellent organizational and interpersonal skills. Strong verbal and written communication skills. Ability to work independently once given project. All positions are security-sensitive. Applicants are subject to a criminal history investigation, and employment is contingent upon the institution’s verification of credentials and/or other information required by the institution’s procedures, including the completion of the criminal history check.  Equal Opportunity/Affirmative Action/Veterans/Disability Employer committed to diversity."}