{"jobID": "2783048249", "jobLocation": "Glendale_CA", "jobTitle": "Recruitment Systems & Analytics Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.publicstorage.com", "Headquarters": "Glendale, CA", "Size": "5001 to 10000 employees", "Founded": " 1972", "Type": " Company - Public (PSA) ", "Industry": " Real Estate", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "50000", "jobDescription": " We are actively looking for a Recruitment Systems & Analytics Manager to join our team in Glendale, CA.  The Recruitment Systems & Analytics Manager will play an integral part in supporting the TalentDepartment by providing effective data and analytics to drive business decisionsand supporting a wide range of system administration -. You will focus onmaximizing reporting, analytical tools and ensuring data integrity to influencebusiness decisions.  You will drive our current andfuture Applicant Tracking System (ATS) optimization, implementation and theintegration with other systems. You will act as a liaison between the HRSystems and Talent Selection teams as well as collaborate with other HRfunctions and the Information Technology team.  Reporting to the Vice President ofTalent Acquisition and Development, located in Glendale, CA, you willmanage the Applicant Tracking System for a 2 billion dollar company with over2,200 locations self-storage locations and more than 5,000 staff members. Responsibilities:Provide root-cause analysis to drive process improvements and business decisions based on dataDrive efficient reporting metrics & analytics and analyze impacts to downstream reporting and systems.Create routine and customized reports using relational database reporting tools such as Oracle Business Intelligence or other vendor specific tools.Continually review and analyze the effectiveness and efficiency of existing reports and dashboard and develop strategies for enhancement.Configuration of system to meet the business needs (e.g. processes, user interfaces, correspondences, etc.)Maintain the integrity of the ATS by conducting regular audits, streamlining processes, increasing data integrity and providing valuable guidance to end users.Provide subject matter expertise around optimizing and streamlining the ATS and associated Talent systems and serve as the ATS administrator.Work closely with system vendors to resolve any systems related issues, implement required updates, and design/maintain interfaces. You'll thrive in this position ifyou are: A communicator: you skillfully analyze and have a genuine passion for talent data and reporting; you're capable of translating business requirements into functional requirements that are clear and concise, even to a non-technical audience.A gold medal analyst: you enjoy breaking down numerical data and all other sources of information.Naturally curious: you systematically probe for additional information to gain a greater understanding of the problem.A technical optimizer: you've earned your ATS stripes and have a broad range of HR systems knowledge that allows you to be the master of business process automations and efficiencies.An expert in the field: you seek to maintain a deep, strategic knowledge of the HR systems landscape, particularly trends and contemporary developments in Talent.Service oriented: you're a people person who is systematic and trustworthy, so you'll keep our talent team informed and keep sensitive information confidential.Passion for fast-paced environment: you thrive on challenges and have a proven track record of multi-tasking and meeting deadlines without sacrificing quality.QualificationsAbility to analyze, interpret, synthesize and communicate complex information to non-technical audiences in a logical and concise manner.5+ years of Talent data analytics experience2+ years of experience working with an ATS within a multi-location company preferred.Advanced proficiency in MS Office (Word, Excel and Outlook), plus Oracle Business Intelligence (OBI). Experience with Tableau preferredExperience working with relational databases (SQL, Oracle, MS Access, etc.) and knowledge of related concepts (joins inner/outer, grouping, sorting, ranking, etc.).Demonstrated knowledge with ATS', specifically Oracle TaleoDemonstrated knowledge in Talent related systems (e.g. job aggregators, assessments, CRM, etc.).Excellent written and verbal communication skills are required.Proven ability to meet deadlines and effectively manage a heavy workload.Bachelor's Degree (BS/BA) in Information Technology, Business Administration, Human Resources or quantitative discipline (engineering, math, statistics, economics, industrial/organizational psychology); or, 10+ years of applicable work experience is preferred.SDL2017"}