{"jobID": "2818465899", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.sc3.com", "Headquarters": "Alexandria, VA", "Size": "501 to 1000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, Booz Allen Hamilton, General Dynamics Information Technology"}, "estimatedSalary": "77000", "jobDescription": " SC3 is a leading provider of high-end mission support, consulting and technology solutions to the federal government in defense, intelligence, and civil markets, and to major corporations and nonprofit organizations. SC3s national security efforts reach across the intelligence community and Department of Defense, providing full life-cycle operational and cyber support and differentiated capabilities to meet our customers challenging mission. In addition to our government services area, SC3 provides cutting-edge competitive intelligence and strategic management consulting to commercial clients. Private industry leaders from the financial, health care, manufacturing and other sectors turn to SC3 to ensure that they have access to the most relevant, current, and strategically important information not only to grow their businesses, but also to protect them.  The Data Analyst works with the client's management and government personnel within a federal government agency to fill requests for data, prepare canned and ad hoc reports, perform data quality checks and provide other statistical analysis. The primary areas of responsibility for the Data Analyst include: report production including the development of professional-level graphs and charts and strong customer service skills including effective verbal, written communication. Responsibilities:Respond in a timely manner to data requests to ensure daily, weekly and monthly deadlines and goals are met.Extract data from databases and perform ad-hoc queries.Analyze data and create detailed reports utilizing proprietary tools and third party technologies to identify and resolve data quality issues to ensure quality assurance and drive data quality initiatives as instituted by management.Perform analysis on existing data and identify root causes for data inaccuracies.Prepare system metrics and develop performance metrics as requested by the agency.Monitor the implementation of engineering change requests and test each one to ensure it works as designed.Perform data extrapolation and interpretation, including trending and forecasting.Prepare hard copy reports, graphical presentation, detailed statistical summaries, ad-hoc reports, briefing papers, fact sheets, brochures and other similar material as directed by the COTR.Requirements:Advanced knowledge of Microsoft Access, Excel, PowerPoint, SQL, and TOAD.Quality Assurance skills.Knowledge of reporting tools.Knowledge of Sharepoint portalBachelor's degree.3-5 years of experience in data analysis.Strong customer service skills including effective verbal, written and graphical communications.Ability to multi-task and meet established deadlines.Clearance: Public TrustMinimum Years of Experience: 3 YearsRequired Education:Experience Equivalent to Bachelor’s Degree Our values are simple and straightforward. We know that competitive salaries and generous benefits are essential in our industry and SC3 strives to offer the best in both areas. We are proud to offer: Medical/Dental/Vision Insurance 401(k) Plan Supplemental Life & AD&D; Short & Long-Term Disability Insurance Flexible Spending Plan Paid Time Off Paid Holidays Professional Development Employee Referral Bonus Identity Protection Services We are proud to be an EEO/AA employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing as required by the customer."}