{"jobID": "2729362019", "jobLocation": "Sunnyvale_CA", "jobTitle": "Clinical Trial Manager", "companyRating": "2.4", "companyInfo": {"Website": "www.pharmacyclics.com", "Headquarters": "Sunnyvale, CA", "Size": "501 to 1000 employees", "Founded": " 1991", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Acerta Pharma, Kite Pharma, Genentech"}, "estimatedSalary": "131000", "jobDescription": "Pharmacyclics is committed to the development and commercialization of novel therapies intended to improve the quality and duration of life and to resolve serious unmet medical needs for cancer patients. Pharmacyclics is a wholly-owned subsidiary of AbbVie (NYSE:ABBV), a global, research-based biopharmaceutical company. Oncology is a key therapeutic area for AbbVie, with a portfolio consisting of three marketed products and a pipeline containing multiple promising new molecules that are being studied in more than 200 clinical trials for over 20 different types of cancer.  More than 1,200 Pharmacyclics and AbbVie research scientists, clinicians, marketing, operations and corporate professionals work in the San Francisco Bay Area. They combine their expertise in immuno-oncology, stem cells, and cell-signaling with their knowledge of bispecific antibodies, antibody-drug conjugates (ADCs), and covalent-inhibitor technologies to discover and develop novel cancer treatments. Together, we are striving to outsmart cancer.  General Position Overview:  The Clinical Trial Manager (CTM) is the primary operational contact for the study and leads the cross-functional team for execution of the study. The CTM provides strategic and operational leadership to the clinical operations team to ensure project milestones delivery on time, within budget, high quality, and in compliance with the ICH/GCP, Regulatory Authorities' regulations/guidelines, and applicable SOPs/Work Instructions (WIs). The CTM should have critical thinking skills for problem solving and have the lateral and strategic thinking capacity to drive the study (ies) with effective communication across organization. This position may include line management responsibilities. Key Accountabilities/Core Job Responsibilities:Study Planning and Conduct:Responsible for all operational aspects and progress of clinical trial from a study planning activities to study execution including ongoing tracking all applicable performance metrics and quality indicatorsServes as an escalation point and resource for internal/external teams and investigational sites; partners with cross functional groups to achieve deliverablesOversees/facilitates country and site feasibility/selection processesDevelops/oversees subject recruitment/retention strategy and related initiativesProvides operational and strategic input and/or approves study documents such as synopsis, protocol, ICF, CRFs, CRF Completion Guidelines, Study Plans, Laboratory Manual, Patient Diary, Study Reference binders, Pharmacy Manual, Clinical Data Review Plan, Clinical Database specifications development, Clinical Study Report (CSR) development, etc.Responsible for management of data management and clinical operations teams in review of clinical data; provides guidance on issues/queries as needed and implements risk management concepts as appropriateResponsible for and participates in clinical service provider (vendor) selection process as a part of outsourcing activities. Provides oversight for all vendor operational activities (e.g., study management, monitoring, specifications development, UATs, issues escalations)Responsible for the selection and study specific training of CRO study staff, monitors, investigational sites, and vendorsOversees/responsible for the TMF set-up, ongoing quality review and final reconciliation of study documents including review of site regulatory documents/packagesEnsures that all aspects of GCP compliance and audit readiness are maintained throughout trial conductConducts Sponsor quality monitoring/oversight visits to sites and/or CRAs performance assessment in adherence to GCP, corporate SOPs and protocol as neededProject Management:Creates, manages, measures, and reports timelines for milestone deliverablesProactively manages/identifies potential study issues/risks and recommends/implements solutions with key internal/external stakeholdersPrepares metrics and updates for managementOversees internal team meetings, investigator meetings, and other trial­ specific meetingsParticipates in the development, review, and implementation of departmental SOPs, WIs, initiatives and processesMay manage/mentor direct reports and team members, and perform performance appraisals as assignedFinancial Planning and Management:Strong understanding of the cost drivers and are accountable for the development, management, reconciliation of overall study budget(s) and resource allocationCollaborates in the development/management of vendor scope of work (SOW) per contract, quality, budget, and detailed timelinesReviews/approves vendor invoices and manages accruals and payment process for all clinical trial vendors including investigative sitesMaintains completion of required corporate training on standards, policies, work instructions by due datePerform other work related duties as assignedQualifications:Knowledgeable of clinical research operations, including interpretation and implementation of FDA regulations/ICH/GCP guidelines, is requiredAbility to work on complex or multiple projects and exercise independent judgment within generally defined practices and policies lead to obtaining resultsStrong attention to detail and excellent organization skillsStrong interpersonal skills and communication skills (both written and oral)Ability to work effectively (interpersonal, relationship management) with the study team, cross functional team members and external partners/vendorsDemonstrates effective time management, multitasking and handles time sensitive demands, incomplete information or unexpected eventsAbility to problem solve, delegate appropriate tasks and/or develop junior team members as part of succession planningExcellent sense of urgency to deliver at/surpass study conduct targetsStrong leadership skills, self-motivated, adaptable to a dynamic environmentSupervision or other similar experience in a leadership or team management positionComputer skills including proficiency in the use of Microsoft Word, Excel, Powerpoint, and organization toolsProficient in Sharepoint with filing systems is desirableEducation and Experience Requirements:BA/BS or equivalent degree in scientific discipline. Advance degree preferred (MA/MS, PharmD, PhD)Minimum 7-8 years of clinical trial research management experience in a pharmaceutical, biotechnology, CRO and/or healthcare setting with at least 1+ year at a Sponsor companyExperience in interactions with outside vendors, e.g., CROs and other vendorsFamiliar with advanced concepts of clinical research and able to work effectively in a team/matrix environmentDemonstrates core understanding of medical terminology and clinical trial activities in relation to execution of a Clinical Development PlanExperience in oncology preferredExperience in global trials preferredEqual Opportunity Employer Minorities/Women/Veterans/Disabled"}