{"jobID": "2822478107", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data AnalystPosition Number: 288814Location: Menlo Park, CADesired Skill Set: JavaScript, PHP, PythonPosition Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Title: Linguist \"Phonetics\"  Duration: 07/03/2018 - 07/03/2020  Location: Menlo Park,CA Description: We are looking for linguists to help develop the data infrastructure for ASR and TTS systems. Our team is responsible for collecting speech data, evaluating and implementing labeling and transcription systems, preparing and editing scripts for recording sessions, and writing the software tools to process, display, distribute, and ensure the quality of the data.  We need linguists who understand language as data, who think analytically and systematically, who are familiar with waveforms and spectrograms, and who can develop and evaluate ways of mapping between spoken and written forms. Candidates should understand the basics of computer programming, have at a minimum written code for processing text files, and be willing and able to learn new programming languages and techniques.  We value expertise in any sub-field of linguistics (knowledge of phonetics is required), expect a passion for the scientific study of language, and require research experience that includes an understanding of the scientific method and experimental design. We are seeking new colleagues who work well on teams, are open to different viewpoints, and can quickly agree on the most optimal solutions to speech data problems.  If you know that speech and language data is the underpinning of all current language technologies, if you love practical language analysis as well as theoretical, and if you are ready to adapt your unique skill set to a diverse range of products and problems, then this may be the job for you!  The successful candidate will be engaged in general responsibilities and at least one specialized role.  General Responsibilities  o Evaluate speech data for dialectal variation  o Phonetically transcribe speech data  o Determine quality standards for annotation  o Collect phonetically balanced data sets  o Build and/or pilot software tools for data evaluation and management Skills: Specialized Roles  o A Phonetics Lead to manage projects with varying team members, coordinate project requirements across customer needs, organize work to meet deadlines, thoroughly evaluate design choices, integrate projects with the client codebase, and disseminate results to improve team visibility  o An ASR Phonetician to create and perfect both text normalization and inverse text normalization processes from start to finish, including data cleaning, mapping, and ensuring appropriate casing and punctuation  o A TTS Phonetician to ensure high-quality label alignments, oversee POS tagger results, manage quantitative user research studies, acquire and evaluate corpora for TTS modeling  o A Voice Designer to prepare dialect-targeted scripts for data elicitation, coach and record voice talent, review speech files for quality, accuracy, and consistency  o A Tools Developer to create tools for data annotation, data storage, and quality evaluation with an eye towards the long-term  Education: Qualifications  o Academic degree in Linguistics, Computational Linguistics, Speech Science, or related field  o Interest and experience in various areas of linguistics, especially phonology, phonetics, sociolinguistics, dialectology, computational linguistics, and field work  o Proficiency in transcription and annotation systems such as SAMPA, IPA, and ToBi  o Ability to analyze waveforms and spectrograms for phonetic features  o Collaborative and solution-oriented attitude  o Eagerness to learn new skills and adapt to a changing environment  o Strong problem-solving and analytical skills  o Enthusiasm for detail work and ability to focus for significant portions of the work day  o Experience with basic programming techniques and familiarity with languages and platforms such as Praat, Python, SQL, PHP, Hack, JavaScript, and React  o Ability to speak and write in English fluently and idiomatically  Preferred Qualifications  o Advanced degree and/or industry experience  o Fluency in two or more natural languages  o Familiarity with version control, unit tests, and other programming best practices Languages: English Read Write Speak Certifications & Licenses: Computational Linguistics #CBRose# Send me a reminder to complete this applicationRose International is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender (expression or identity), national origin, arrest and conviction records, disability, veteran status or any other characteristic protected by law. Positions located in San Francisco and Los Angeles, California will be administered in accordance with their respective Fair Chance Ordinances.  Rose International has an official agreement (ID #132522), effective June 30, 2008, with the U.S. Department of Homeland Security, U.S. Citizenship and Immigration Services, Employment Verification Program (E-Verify).  (Posting required by OCGA 13/10-91.)"}