{"jobID": "2789216588", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.nuts.com", "Headquarters": "Cranford, NJ", "Size": "51 to 200 employees", "Founded": " 1929", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "118000", "jobDescription": "Hi, we’re Nuts.com!We’re changing the landscape of snacking on nuts, dried fruit, chocolate and more! We planted our roots in Newark, New Jersey during the Great Depression, selling premium nuts on Mulberry Street’s open-air market. We’ve come quite a long way since then, taking our multi-generational family business online in 1999. Even after 90 years, we continue to pride ourselves in expertly sourcing the highest quality foods and treating our customers like family.What’s our team like? We’re driven, collaborative, and entrepreneurial. Energy and passion power our business and we look for candidates who share in that excitement to help us continue to build something special.The roleAt Nuts.com, we love our customers, and we love data. And while we’re happy to say that we have a lot of both, we need help bringing it together, managing it, and making it useful -- to us and to our customers. This is where you come in: we’re building our business on this foundation of data, and you’ll make sure it’s a stable one.In partnership with an awesome Analyst, you’ll run everything from heavy, cross-channel analysis of media interaction logs to optimize Paid Media to distilling purchase data down to understand our customer better. You will help us think of innovative ways to make it even more enjoyable and valuable to shop with us.  We have thousands of items, a data-driven warehouse, a robust order management system, an exhaustive tagging footprint, a growing number of media outlets, and happy, engaged customers. If you’re already imagining all the cool stuff we’ll be able to build with that, then we should talk.What you'll doCollaborate with analysts, marketers, and department heads to define use cases, solutions, cross-functional projects and prioritiesMaintain a holistic vision of the organization, its data, and its customers enough to recognize and even anticipate their data needsDefine, build, and launch the solutions that make it all a realityGather, transform, clean, and secure data from many sophisticated, state-of-the-art sources and destinationsBuild pipelines that move the data to, through, and from all of the sources and also identifying how they should be connected in the first placeIdentify how the data will be used once it’s all builtRespectfully and energetically express your thoughts and data philosophy to non-technical SMEs, backing up clear reasoning behind all tool & infrastructure decisions/proposalsArchitect, create and build systematic solutions to tough problems, such as the continuous data flow from networked sensors, and the ETL pipelines for all systems, transactional and otherwiseWhat you'll bringBachelor’s degree in Computer Science, Software Engineering, Mathematics or related field2+ years of experience architecting traditional and big data solutions in SQL and NoSQL databases, ideally for e-Commerce applications1+ years experience manipulating, processing and extracting value from large disconnected data sets1+ years experience in dimensional data modeling and implementing these models in Customer Data Platforms / CRM systemsProgramming capabilities in common languages (SQL, Python, Java, etc.)Curiosity and creativity, with sound judgment and high degree of both integrity and empathyEffective written and verbal communication of data-driven solutions across all levels of the organizationBonus points if you're..Experienced in:Mathematical Modeling/Statistical ModelingMachine LearningData Structure and Algorithm, OptimizationKnowledgeable or have direct experience using business intelligence reporting tools. (e.g., OBIEE, Business Objects, Cognos, Tableau, MicroStrategy, SSAS Cubes, Datanet, etc.)"}