{"jobID": "2662747754", "jobLocation": "Los_Angeles_CA", "jobTitle": "Research Scientist (Education)", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " The Center for Economic and Social Research (CESR) at the University of Southern California has openings for Research Scientists in the field of Education at ranks equivalent to Associate Professor and Full Professor levels. CESR provides an excellent opportunity for scholars to pursue their own new and exciting areas of research within a vibrant multi-disciplinary community of social scientists.  Successful candidates for these positions will have demonstrated research excellence, as evidenced through their grant and publication record. The positions require a Ph.D. in education or applicable disciplinary field, in addition to 8+ years of post-PhD experience. The positions require excellent analytical skills, strong written and oral communication skills, considerable education expertise, experience and willingness to attract external funding, the ability to lead projects and proposals, and work as a member of multi-disciplinary teams, and a commitment to effecting change through empirical research.  CESR is a new interdisciplinary institute in the USC Dornsife College of Letters, Arts and Sciences (cesr.usc.edu/). Research areas at CESR include work on education, children & families, development economics, aging, behavioral economics, financial decision-making, genoeconomics, health and health disparities, inequality, mobile health, self-report science, subjective well-being, and work disability. We welcome applicants who will either help us build depth in one of these areas, or who are working in a new, complementary area of research. CESR is a research-funded center, therefore positions are not part of the tenure system and Research Scientists are eventually expected to fund their research agenda. Qualifications: • PhD in Education or related field.  • Demonstrated success initiating and leading research projects and grant proposals.  • Demonstrated research skills, preferably in the form of peer reviewed publications.  Keywords: Education, Education Research Scientist, Education Research Methods, Education Policy, Economics of Education, Education Statistics Application Instructions: Interested candidates must attach/upload a cover letter and a CV.  Reference letters and writing samples will be requested after a preliminary review. Review of applications will begin immediately.  USC strongly values diversity and is committed to equal opportunity in employment. Women and men, and members of all racial and ethnic groups are encouraged to apply.  CESR has offices in Los Angeles, CA (on the USC campus) and Washington, D.C.  Job Profile Summary  Minimum Education: Ph.D. or equivalent doctorate  Minimum Experience: 5 years  Minimum Field of Expertise: Directly related education and experience in research specialization with highly advanced knowledge of equipment, procedures, analysis methods, principles, theories and concepts. Demonstrated leadership in developing new ideas and ability to publish in appropriate academic and practitioner outlets. Demonstrated independent thinking and leadership in scholarly writing according to such criteria as: first authored publications, conceptual leadership in the development of publications generated alone or with others, writing of first drafts of publications and/or single authored publications."}