{"jobID": "2805473909", "jobLocation": "Washington_DC", "jobTitle": "Public Affairs Internship", "companyRating": "3.8", "companyInfo": {"Website": "www.agu.org", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 1919", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "39000", "jobDescription": " Requisition Number 18-0022 Post Date 6/7/2018 Title Public Affairs Internship City Washington State DC Description Title: Public Affairs Intern  Position Type: Paid Full-time Internship (3 months assignment – expected start date 4 Sep 2018)  Location: Washington, DC  What we do and offer our team  We are home to more than 60,000 scientists from 139 countries. As the Public Affairs Intern, you will be part of a dynamic association for Earth and space scientists who advance research, collaborate across disciplines, and communicate the importance and impact  of science to society. AGU offers our members exciting opportunities through top-ranked scientific journals, scientific meetings and conferences, and other educational and scientific programs, to present and publish research, gain leadership experience, mentor,  and freely exchange knowledge.  AGU’s Workplace Values  We believe in accountability and ownership of work, by taking responsibility for decisions and results. We believe in member and customer service, and that they come first through providing high quality service.  We believe in excellence and giving it our all, through striving to be outstanding. We believe in integrity by doing the right thing, we achieve this by being honest and fair.  Our teams believe that with teamwork together we achieve more, we achieve this through collaboration. We believe in respect, that you earn it and give it, by open communication and collaboration.  What the Public Affairs Intern does  The Intern will help the Public Affairs team during the busy fall season that includes major PA-led events and congressional authorizations and appropriations work. The position also offers a service to AGU membership by hiring recent Geoscience graduates to  learn about science policy and see that it is a viable career path for them, as well as allowing AGU to be more engaged in critical science policy work on Capitol Hill.  The intern will focus on attending congressional hearings and briefings and writing summaries for Public Affairs and AGU members, running the Public Affairs social media presence (Twitter, Facebook, Instagram, videos, etc.), writing blog posts for The Bridge,  writing Eos articles, helping to organize our Geoscience Congressional Visits Day event, and helping us prepare for Hill and Fall Meeting events.  What the Public Affairs Intern brings to the team At least two years of coursework towards a Bachelor’s degree in Earth or space sciences and a willingness to relocate to the Washington D.C. area for the internship at your own expense are required.A Bachelor’s, Master’s, or Ph.D. in Earth or space science is a plus.Ability to prioritize assignments, use standard procedures and processes to make decisions, apply effective verbal, non-verbal, and written communication methods, operate standard office equipment, and work independently on various projects and/or with limited  supervision is needed. It’s a plus to have experience with social media, science policy, and science communication, but not necessary.To Apply: For consideration, please submit your cover letter and resume to  https://rew12.ultipro.com/AME1056/jobboard/NewCandidateExt.aspx?__JobID=323  The successful candidate for this position will be subject to a pre-employment background check.  AGU proudly offers a casual work environment, excellent compensation, generous work-life opportunities, and an outstanding benefits package.  AGU is an Equal Opportunity/Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities.Please view Equal Employment Opportunity Posters provided by OFCCP  here.The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access  to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure  is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41  CFR 60-1.35(c)"}