{"jobID": "2802378442", "jobLocation": "McLean_VA", "jobTitle": "Data Hunter/Targeting Specialist", "companyRating": null, "companyInfo": {"Website": "www.radiantsolutions.com", "Headquarters": "Herndon, VA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Aerospace & Defense", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ResponsibilitiesRadiant Solutions has an immediate opening in our McLean, VA location for a Geospatial Data Hunter/Targeting Specialist!  This is a full-time customer-site position providing support to a US Government agency.  This position will support the querying and structuring of data for use in complex and advanced analysis methods. The successful candidate will operate in a fast-paced dynamic environment. To be qualified, candidate MUST be a US Citizen and have an ACTIVE TS/SCI Clearance with Polygraph.Qualifications Knowledge of available government furnished information sources as well as available sources from industry, academia, the Intelligence Community (IC), the Military, and the scientific community.Ability to incorporate targeting best practices into a geospatial workflowStrong communication skills and the ability to forge relationships with data providersProactively seek out new data sourcesExperience discovering, requesting, downloading, and reformatting IC and external geospatial dataExperience organizing and formatting data into Esri file geodatabases, raster catalogs, and database formats specified by the customerExperience geocoding structured and unstructured dataExperience using ArcGISKnowledge of best practices for data standards, data management, data qualityDesired Skills:Experience with Postgres/PostGIS, or willingness to learnAbility to query data via APIs through SQL or PythonFamiliarity with open source geospatial toolsKnowledge of collection capabilities and tasking mechanismsExperience providing operational support for HUMINT and TECHINTUnderstanding of SIGINT systems and how to use within a GIS #cjpostOverviewJoin our company whose purpose is to help national security and commercial organizations understand and navigate our changing planet. Radiant Solutions provides multi-source data collection, enrichment, and analytic capabilities that reveal unique geospatial information and insights where and when it matters most.  We are a new organization but no company has such strong roots in geospatial with our level of scale and a strong commercial mindset. Our heritage companies, MDA Information Systems, RadiantBlue, DigitalGlobe Intelligence Solutions, and HumanGeo are well known for delivering innovative capabilities across the entire geospatial intelligence value chain. Our combined team of over 1,000 aerospace engineers, geospatial analysts, weather and ocean experts, software developers, data scientists, and DevOps engineers apply disruptive technology and our unique intellectual property to both national security and commercial problems.  We offer an excellent comprehensive benefits package including medical, dental, life, and short/long-term disability insurance, vacation and sick leave, 401(k) retirement plan, flexible spending account, and tuition assistance. Radiant Solutions values diversity in the work place and is an Equal Opportunity Employer."}