{"jobID": "2676362277", "jobLocation": "Reston_VA", "jobTitle": "Software Engineer/Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": "Description:Job Summary  In this mission we are seeking a Software Engineer/Data Scientist to develop analytical models and algorithms in order to process different datasets to extract patterns and knowledge. The Data Scientist will leverage latest technologies to perform automated DevOps Continuous Integration and Continuous Delivery of software. This person will support operations, maintenance, and enhancements to existing tools to help correlate data analysis and the generation of business intelligence  Interested candidates must have more than intermittent exposure to mandatory skills and will support efforts that span the entire software development lifecycle. Strong candidates will have a commanding knowledge of mandatory skills, be able to articulate depth and breadth of each skill, and perform these skills unaided.Qualifications:Basic Qualifications: Typically requires BS degree and 8 - 12 years of prior relevant experience or Masters with 6 - 10 years of prior relevant experience. May possess a Doctorate in technical domain.Demonstrated experience designing, programming, testing, and delivering custom applications in an object-oriented language such as Java.Demonstrated experience with analytical modeling using Python, Scala, or SparkDemonstrated experience developing, testing, deploying, and maintaining complex APIs.Demonstrated experience designing, implementing, deploying, and maintaining software Configuration Management for an automation/continuous build process (e.g., ClearCase, Cruise Control, MKS, Jenkins, GitHub).Demonstrated experience using Java with Spring and/or REST web services.Demonstrated experience designing, configuring, performing, and evaluating the results of back-end, service-based automated testing (i.e. not front-end testing with tools such as Selenium).Demonstrated experience troubleshooting issues encountered by users.Demonstrated experience writing, testing, deploying, and maintaining multiple, complex LINUX shell scripts in a cloud-based, DevOps style environment.Current and active TS/SCI with specific polygraph required for the position.Preferred Qualifications:Demonstrated experience developing within an Agile team environment.Demonstrated experience deploying applications on Amazon Web Services (AWS) infrastructures.Demonstrated experience with deployments in the Sponsors environment.Demonstrated experience developing RESTful web services with JSON.Demonstrated experience delivering enterprise level Identity and Access Management services.Demonstrated experience performing development and integration with COTS applications in a virtual environment.Demonstrated experience identifying, recommending, and implementing continuous improvement approaches within teams, processes, or technology.Unique qualifications: DevOps, Java, SPLUNK, Ruby, Rails, Puppet, Jenkins, Git, Artifactory, Nexus, foreman, Rundeck, open source: node.js, angular JS, Express, SpringBoot, PKILeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}