{"jobID": "2837609044", "jobLocation": "Chicago_IL", "jobTitle": "Manager, Big Data Engineering", "companyRating": "3.6", "companyInfo": {"Website": "www.cccis.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Mitchell International, Solera Holdings"}, "estimatedSalary": "120000", "jobDescription": " Job Description SummaryThe Enterprise Analytics team at CCC has an open position for a Big Data Engineering Manager. The team builds analytical solutions to provide insights to internal and external clients of CCC businesses in auto property damage and repair, medical claims and telematics data. Our solutions include analytical applications to identify the right claim cost to pay, claim cycle time processing, workflow productivity, financial performance, client and consumer satisfaction, and industry benchmarks.  Our data engineers use big data technology to create best-in-industry analytics capability. This position is an opportunity to use AWS cloud services with HDFS, Spark and Kafka technology for batch and streaming analytics. Data processes in the environment include ingestion, standardization, metadata management, business rule curation, data enhancement, and statistical computation against data sources that include relational, XML, JSON, streaming, REST API, and unstructured data. Pentaho has provided a metadata injection layer for data ingestion across six SQLServer sources that will be leveraged for additional source ingestion.  Job Duties  The role has responsibility to lead the team that prepares, processes and analyzes data to drive operational, analytical and strategic business decisions. The Big Data Engineer Manager will work closely with product owners, information engineers, data scientists, data modelers, infrastructure support and data governance positions. This role requires mentoring skills for big data engineers in the appropriate solution architecture, big data best development practices, and code reviews. While you do not have to be a data engineer manager, we are seeking someone who has demonstrated leadership skills in their current role and has accountability for delivering projects/products. QualificationsGrow engineering disciplines such as automated testingCoach and grow data engineering team skillsAssess story planning and programming time for improvement opportunitiesPerformance and development managementTeam with scrum master on coaching scrum skillsLead developing common frameworks and programming methods across product teamsLead design and tech problems solving sessionsDevelop timelines based on project requirementsBachelor's Degree or Two Year Technical Program with a Programming SpecializationB.S. preferred in Computer Science, Information Systems, or related fieldThe position requires experience as a manager, tech lead, or other leadership rolePrior experience in Hadoop or SparkExperience in agile environments such as scrum and KanbanExperience in Hadoop fundamentals and architecture: HDFS, map-reduce, parquetExperience in developing programming practices Why Choose CCC  We promote a healthy work-life balance and offer generous benefit plans and resources designed with employee satisfaction in mind.  What we value is simple - customers, employee commitment, collaboration and clear communication.  We hire people who will embrace the company's goals and productively contribute in ways that help us serve the customer, innovate, and stay strong.  We make it a priority to keep employees healthy, happy and enriched. Healthy - Wellness programs and Perkspot/employee discount programHappy - Recognition programs, a confidential employee assistance program, and flexible work arrangements such as staggered start timesEnriched - Tuition reimbursement, training and learning programs, and leadership development opportunities Our corporate headquarters is located in downtown Chicago within the historic Merchandise Mart-a certified LEED (Leadership in Energy and Environmental Design) building.  CCC Information Services was ranked #17 in the Top 100 Digital Companies in Chicago in 2017 by Built In Chicago, an online community for digital technology entrepreneurs in Chicago. CCC is a great place to work. Join us!"}