{"jobID": "2807792977", "jobLocation": "Chicago_IL", "jobTitle": "Accenture Strategy Capability Network Finance & Performance Analytics Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.accenture.com", "Headquarters": "Dublin, Ireland", "Size": "10000+ employees", "Founded": " 1989", "Type": " Company - Public (ACN) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Cognizant Technology Solutions, EY, McKinsey & Company"}, "estimatedSalary": "107000", "jobDescription": " Basic Qualifications Minimum of 2 years of combined finance consulting or corporate experience. Experience must include a solid understanding of the finance function. Minimum 2 years working knowledge and expertise in the finance function. This may include, but not limited to, data, planning, analytics, and technologies. Minimum of 2 years of experience in Microsoft Office product suite Bachelor's degree Preferred Qualifications MBA Finance and Performance Analytics Technologies (Hyperion, Cognos, SAP, Anaplan, Adaptive, Host Analytics, One Stream) •,Other Finance technologies (ERP, RPA, BI, etc)* Proven success in contributing to a team-oriented environment Proven ability to work creatively and analytically in a problem-solving environment Desire to work in an information systems environment Excellent leadership, communication (written and oral) and interpersonal skills Ability to effectively engage with senior-level client executives Proven track record in driving business outcomes for large clients/stakeholders Ability to effectively mentor, advise, and coach teamsProfessional Skill Requirements Proven success in contributing to a team-oriented environment Proven ability to work creatively and analytically in a problem-solving environment Desire to work in an information systems environment Excellent leadership, communication (written and oral) and interpersonal skills  Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture (i.e., H1-B visa, F-1 visa (OPT), TN visa or any other non-immigrant status).  Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  Accenture is a Federal Contractor and an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities.  Equal Employment Opportunity  All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.  Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.  Accenture is committed to providing veteran employment opportunities to our service men and women."}