{"jobID": "2835918599", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst - Contracts", "companyRating": "3.7", "companyInfo": {"Website": "www.elevateservices.com", "Headquarters": "Los Angeles, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " Elevates Customer, a Leading Global Payments Company, is looking for a Contracts Management System Data Analyst/Paralegal to work full-time at its offices for eight weeks to assist with data cleanup efforts as they prepare the Company's contracts to migrate from one system to another.  The right applicant will assist with preparing the Salesforce/Apttus environment with regard to contract data clean-up, rationalization, mapping, file preparation, validation, etc. (accounts, parent/child agreements, amendments, etc.). This individual will also participate in the data mapping during our planning and construction phase of implementation to ensure our new Apttus environment will be successful. You might be the right person if you:Have experience working as a contracts analyst/administrator.Pay attention to detail find and correct record data matching specified criteria.Have a solid understanding of database concepts & data structures (data types, object references, primary key, etc.).Have stamina and the ability to examine tens of thousands of rows in Excel spreadsheets.Have the ability to work with current technical and process/legal experts to classify and correct/prep data for migration.Work well independently as well as with teams.Have the ability to juggle multiple projects and demands, and the ability to learn quickly.Are able to work independently while exercising great judgment and attention to detail.Are looking to be a part of the next generation of legal services and influence the way these services are delivered, consumed, and measured.Specifically you will:Help create a valid list of vendor codes.Help ensure a current and accurate of vendors.Help ensure all contracts will have the correct association mapping for Parent and child agreements (e.g. MSAs and SoWs).Help resolve orphaned amendments & addendums by locating the correct parent contract prior to content migration.Help identify the latest executed contract document when multiple exist.Help identify unneeded/expired agreements.Help identify existing/copies of agreements to prevent duplication of content during the contract migration phase.Help research/prepare contracts from network drives--removing duplicates between subfolders to avoid duplication.Help in renaming contract files on network drives to match standard convention (i.e., Party Name_Agreement Type_Effective Date.*)Help in preparing import files and mapping files for import into new system.Help in validating and correcting import files test loaded into new system.Experience:Intermediate+ level in Excel V-lookups, formulas, data validation, filtering working with large volumes of data.Basic understanding of contract lifecycle management process & data.Tech savvy ability to quickly learn to navigate SAP CLM and Salesforce, run reports, open/evaluate record data & associated files.Detailed contract analysis, ability to review contract language to ensure SAP CLM documents are being mapped correctly into the new system.Qualifications:Bachelor's degree. Elevate is the law company. We provide consulting, technology and services to law departments and law firms. Our global team of lawyers, engineers, consultants and business experts improve efficiency, quality and outcomes for customers worldwide. Elevates achievements and distinctions include: Ranked on the Inc. 5000 list of Fastest-Growing Private Companies two years in a row.Ranked as a top Global Services Provider by Chambers & Partners three years in a row.Lead Partner of the FT Innovative Lawyers Awards.Learn more at https://elevateservices.comSee more jobs at https://elevateservices.jobs.net/Follow us on social media at https://www.linkedin.com/company/elevate-services or https://twitter.com/ElevateServices"}