{"jobID": "2837640309", "jobLocation": "Southlake_TX", "jobTitle": "Senior Data Scientist", "companyRating": "3.0", "companyInfo": {"Website": "www.sabre.com", "Headquarters": "Southlake, TX", "Size": "5001 to 10000 employees", "Founded": " 1960", "Type": " Company - Public (SABR) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Amadeus, Travelport"}, "estimatedSalary": "104000", "jobDescription": "Req ID: 40882 Job Family: Information Technology/Software Development  Sabre is the global leader in innovative technology that leads the travel industry. We are always looking for bright and driven people who have a penchant for technology and want to hone their skills. If you are interested in challenging work, being part of a global team, and solving complex problems through technology, business intelligence and analytics, and Agile practices - then Sabre is right for you! It is our people who develop and deliver powerful solutions that meet the current and future needs for our airline, hotel, and travel agency customers.Job Description The travel industry is one of the top 10 transaction processors among banks and social networks. A typical traveler generates at least twice as much data as a savvy internet user.  With travel industry being highly complex and data-driven, this role identifies and solves interesting puzzles which leads to innovative products or directly benefits the financials of the company.  Under minimal or no direction this role is responsible for innovation in the travel space. The successful candidate will be able to identify and prioritize potential ideas, communicate them effectively, gather input from industry experts, and look at the ideas from the point of view of different types of travel industry players (i.e. travel suppliers, travel agents, travel management companies, corporations and travelers alike). This role is also responsible for helping immediate team or internal customers in various business decisions for products and services by using the available data.  JOB CHARACTERISTICS:  The candidate will possess the following characteristics: A strong passion to identify and solve real business problems using dataAbility to work independently and with minimal or no directionEntrepreneurial mindset to identify and promote innovative travel products, and solve the internal puzzles and prototype the end productAbility to move seamlessly between business problems and codingGood presentation skills to explain complicated analytical solutions to a non-technical group of people, internal or externalCreativity in using available tools and out-of-the-box thinking to provide the best solution to problemsAbility to rapidly prototype and evaluate innovative travel products and applicationsPersistence and willingness to learn and apply new techniques/new tools constantlyExperience working with very large datasets which happen to be residing in different data stores in different formatsResponsibilities:Understand business problems and design and build ML/AI and Advanced Analytics models to solve them.Design and build working data pipelines to move data between different source systems to be self-sufficient in Data engineeringOwn the prototype solution end-to-endCollaborate with other teams using analytics platform to perform advanced analytics.Job RequirementsKey technical qualifications:Experience with analytical tools such as R, SAS or other statistical packages,Experience with data visualization tools such as Tableau, Business Intelligence, Reporting and other advanced analytics tools and how they access data on different data storesGood programming skills, such as Python, Scala or Java.Experience in Hadoop-related technologies, MapReduce, Spark, Kafka, Hive, Impala, etc.Experience with open source Machine Learning and Artificial Intelligence libraries such as Spark MLlib, H2o.ai, TensorFlow, etc.Working knowledge in scaling Machine learning solutions.Good knowledge on Data Warehouses, RDBMS and MPP database skills, including query optimization, and performance tuningWorking knowledge in large-scale/distributed SQL, Hadoop, NoSQL, HBase, Columnar databasesOther qualifications:Strong ability to drive a project from the beginning to the endStrong process and technical documentation skillsStrong communications skills with different levels in the organization as well as a business acumen to understand various types of business problemsExperience working with teams who have highly analytical skillsStrong desire to learn new technologies and try implementing them Qualifications  Undergraduate (Graduate preferred) degree in a technical field, such as Computer Science, Computer Engineering, Electrical Engineering or Mathematics  #LI-LT1 a img { outline:none; padding:0; margin:0;}img { outline:none;}Reasonable Accommodation Sabre is committed to working with and providing reasonable accommodation to applicants with disabilities. Applicants applying for a Sabre position with a disability who require a reasonable accommodation for any part of the application or hiring process may contact Sabre's Employee Relations Department at (e-mail removed) Affirmative Action Sabre is an equal employment opportunity/affirmative action employer and is committed to providing equal employment opportunities to minorities, females, veterans, and disabled individuals.  Read moreSee All"}