{"jobID": "2729430597", "jobLocation": "South_Plainfield_NJ", "jobTitle": "Bioinformatics Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.genewiz.com", "Headquarters": "South Plainfield, NJ", "Size": "501 to 1000 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " Want to be part of a company whose goal is to be the best in the world and the best for the world?  Apply today!  We are seeking a Bioinformatics Scientist to join our Next Generation Sequencing department.  Title: Bioinformatics Scientist  Location: South Plainfield, NJ Responsibilities:Work collaboratively with bench scientists, comprehend project objectives, evaluate and provide informatics solutionsDevelop and implement bioinformatics analyses, applications, and workflowsIntegrate statistical analysis to project design and data interpretationsWork closely with IT specialists to build robust infrastructureSupport company intellectual property managementSupport NGS with data analysis and delivery, pipeline development and automationProvide customer support for NGS data analysis resultsSupport Sales and Marketing departments and related business development effortsQualifications:M.S. in Bioinformatics with 1-3 years of experience requiredPh.D. in Bioinformatics with 0-2 years of experience preferredEssential knowledge of key biological processes and NGS technology desiredConcrete bioinformatics skills in analysis of data from various omic platformsExperience in NGS data analysisFamiliarity in applying statistical approaches to NGS data interpretationStrong background in software development on Linux systemSimple programming experience writing scripts Perl or R programming languagesStrong communication skills, both written and verbalDemonstrate initiative in experimenting with new technologies GENEWIZ is a leading global genomics service company and trusted provider for DNA sequencing, gene synthesis, molecular biology, next generation sequencing, bioinformatics, and GLP regulatory services.  From the company’s founding, GENEWIZ has maintained its unwavering commitment to providing customers with the best value. Excelling in both science and customer support, GENEWIZ is dedicated to accelerating scientific discovery, as well as to developing and delivering innovative solutions for translational medicine and healthcare. Easily accessible around the world, GENEWIZ is the preferred partner at leading academic, pharmaceutical, biotechnology, agricultural, government, and clinical institutions.  GENEWIZ employees have a winning attitude and champion innovation, teamwork and accountability through a results-oriented, customer-centric, and fun culture. We offer various health and financial benefits, learning opportunities, competitive compensation, rewarding bonus programs, and a wide range of work/life benefits designed to make your life easier.  Visit our Careers page at www.genewiz.com/careers to view our open positions and apply.  Connect with us on LinkedIn and Twitter @GENEWIZ"}