{"jobID": "2835967034", "jobLocation": "Los_Angeles_CA", "jobTitle": "thinkThin - Marketing Analytics Manager", "companyRating": "2.9", "companyInfo": {"Website": "www.glanbiaperformance.com", "Headquarters": "Downers Grove, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (GLB) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Nestlé, Procter & Gamble, Muscle Milk"}, "estimatedSalary": "108000", "jobDescription": "Essential Functions: Develop a deep understanding of the market and competitive landscape  Pull and consolidate syndicated consumption data (SPINS, IRI) on a monthly basis, providing an analysis of key findings and commentary on causality  Based on competitive landscape understanding, observation of trends, and data analysis, develop hypotheses and / or recommendations around how sales and marketing teams can modify and / or adjust pricing, promotion, and product development strategies to drive growth.  Successful candidate should be a student of how our category is merchandised in different retail channels and partner with the marketing team in identifying new category entrants and evaluating their market success.  Similarly, he / she will develop new item trackers to keep internal teams informed of the progress of new item launches.  Communicate key market and consumption trends and recommendations to management via reports and presentation materials including monthly summary to inform Sales & Operations Planning process  Lead ad hoc projects as needed and partner with marketing team to develop situational analysis for marketing planning process  Develop solid post-promotional analyses on key promotions or in-store programs to identify results and implications for future programs  Additional duties, responsibilities and qualifications, beyond those listed herein, may be required or assigned as necessary Knowledge, Skills and Abilities:  Results oriented with high level of initiative and assertiveness  Excellent analytical and problem solving skills, supported by Excel fluency  Strong written and verbal communication skills  Team player in a collaborative environment  Detail-oriented. Comfortable working with numerical data and information  Deadline oriented. Ability to anticipate and address conflicts, skillfully negotiate, and deliver great outcomes  Proficient in Outlook, Powerpoint and Access in addition to having excellent Excel skills Education/Experience:  Bachelors degree required  5+ years' experience in a role analyzing IRI, SPINS, or Nielsen data  Proven success and analytical abilities Equal Opportunity Employer: Disability/Veteran. We are an equal opportunity and affirmative action employer that does not discriminate and considers all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status"}