{"jobID": "2618029696", "jobLocation": "Washington_DC", "jobTitle": "Manager, Math Test Development", "companyRating": "3.3", "companyInfo": {"Website": "www.air.org/page/careers", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mathematica Policy Research, Abt Associates, Impaq International"}, "estimatedSalary": "86000", "jobDescription": " The Assessment Program at AIR is a well regarded organization that is growing rapidly. We focus on providing our clients with customized assessments that not only measure student achievement against state standards, but also provide meaningful score reports that can help students, parents, and educators address any areas of student weakness. Our environment is fast-paced and requires people at all levels who are willing to roll up their sleeves to get the work done on time while maintaining high quality. We are seeking a Manager, Math Test Development for our Washington, D.C. (Georgetown) office.  The Manager, Math Test Development will work with the Math content team to develop and manage products for online and paper-pencil assessment programs. You will be the primary representative to the client on matters specific to content item and test form development. Duties include:Managing internal and external item writing and reviewing to meet internal and external deadlines;Leading client committee meetings in which stakeholders review the content and grade-appropriateness of test items;Leading constructed-response scoring activities to identify exemplar student responses, monitor scorer training, and audit scoring sessions;Writing, revising, and reviewing test items (questions) based on scientific content correctness and appropriateness, fairness, and project specifications;Helping develop new machine-scored item types;Developing ways to use the new item types to assess aspects of math content not amenable to paper-pencil assessment;Resolving client feedback on test items and test forms;Assembling and reviewing field test and operational test forms, working with technical staff to meet content and statistical specifications;Designing, and resolving client feedback on test specification documents, style guides, test blueprints, and specific student aids;Supporting technical staff at client committee meetings in which stakeholders review statistical data of administered test forms;Managing test item pools.Masters degree in mathematics or math education with at least 8 years of experience in the development of standardized assessments or a Ph.D. in a math related field and at least 6 years of experience in the development of standardized assessmentsAbility to identify problems and conceptualize solutions, prioritize tasks and meet deadlinesAbility to work collaboratively and manage staff and the test development processesKnowledge of the detection and correction of flaws in multiple choice and constructed response itemsExperience in the activities of blueprint and item specification development, pool development, item review, fairness review, constructed response scoring, and form developmentExperience in the use of either classical and IRT statistical models to the interpret item level data and construct of test formsMust be comfortable with and interested in learning new technologies Required travel for this position ranges from 4 to 10 weeks per year. Candidates should be able to travel as required for 2-3 days at a time, mostly in the June/July timeframe. LI-DG1"}