{"jobID": "2658910111", "jobLocation": "Washington_DC", "jobTitle": "Sr. Configuration/Data Management Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.alionscience.com", "Headquarters": "Mc Lean, VA", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "Responsibilities/Qualification Responsible for configuration management and data management of documents, hardware and software baselines, and data. Analyzes proposed product design changes to determine the effect on the overall system.  Responsible for configuration control during product development phase.  Ensures configuration identification by reviewing design release documents for completeness, proper authorizations and system updates.  Develops complex configuration analysis plans to encompass contractual requirements.  Develops and maintains configuration management database.  Coordinates with customers and manufacturers to determine a process for change reporting.  Prepares deviations and waivers for government approval when specifications cannot be met.  Compiles audit information. May audit subcontractors¿ inspection or technical document preparation procedure to verify compliance with contract requirements.  Prepares written or electronic records of part design change documents.  Provides project-level technical support to other staff.  Prepares or provides input to engineering analyses, status reports, letters, technical memoranda, briefings, and contract reports.  Authorizes the release of drawings and changes specified by Program Management and other functional groups.  Provides advice and guidance on methods, procedures and requirements to individuals responsible for the creation of documentation.  Participates in special studies.  Provides guidance to less experienced Configuration Analysts.  Performs additional duties and responsibilities as assigned.  Excellent analytical skills  Excellent communication, presentation and interpersonal skills.  A security clearance of an appropriate level may be required after employment.  Bachelor's Degree and 5 years. Diversity Statement Women, minorities, individuals with disabilities and veterans are encouraged to apply. Alion will provide a reasonable accommodation to individuals with disabilities and disabled veterans who need assistance to apply. Please visit the Alion Careers site for more information  U.S. Citizenship Required."}