{"jobID": "2812109593", "jobLocation": "San_Antonio_TX", "jobTitle": "Clinical Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "75000", "jobDescription": "Job Number: R0030452 Clinical Data ScientistThe Challenge: Are you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors from fraud detection, to cancer research, to national intelligence you know the answers are in the data.  We have an opportunity for you to use your analytical skills to improve the Military Health System (MHS). Youll work closely with your customer to understand their questions and needs, then dig into their data-rich environment to find the pieces of their information puzzle. Youll leverage your understanding of mathematical and statistical concepts or domain expertise to design queries, gather data, and use the right combination of tools and frameworks to turn disparate data points into objective answers to help senior executive health care management officials make informed decisions. Youll provide your customer with a deep understanding of their data, what it all means, and how they can use it. Join us as we use data science for good in the MHS.  Empower change with us. Build Your Career: At Booz Allen, we know the power of analytics and were dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect: access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunka chance to change the world with the Data Science Bowlthe worlds premier data science for social good competitionparticipation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government Youll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. Well help you develop the career you want as you chart your own course for success. You Have: -4+ years of experience with public health, epidemiology, or population health  -5+ years of experience with basic SQL for data manipulation or SAS  -2+ years of experience with healthcare quality improvement  -2+ years of experience with developing and deploying clinical performance metrics in a population health setting  -1+ years of experience with software management and data retrieval  -Ability to obtain a security clearance  -MA or MS degree in Public Health, Epidemiology, CS, or Mathematics or 5+ years of experience with public or population health or data analytics or informatics Nice If You Have: -Experience in a military medical role as either active duty or civil service employee preferred  -Experience with MHS personnel data, financial execution data, medical workload data, customer satisfaction survey results data, or HEDIS or clinical outcomes data reporting a plus  -Knowledge of MHS business or financial processes a plus  -Secret clearance Clearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}