{"jobID": "2824419775", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Software Engineer, Security", "companyRating": "3.8", "companyInfo": {"Website": "www.synopsys.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1986", "Type": " Company - Public (SNPS) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Cadence Design Systems, Mentor Graphics, ANSYS"}, "estimatedSalary": "136000", "jobDescription": "Business TitleSr. Software Engineer, Security25-May-2018Requisition Number15538BRJob Description and RequirementsPosition Name: Sr. Software Engineer, SecurityPosition Location: Seattle/Calgary/San Francisco Position Type: Full Time The Static Analysis team is looking for an exceptional C/C++ developer, preferably with additional experience or interest in WebApp/Mobile security, to join the Coverity core analysis team. The job involves creation of new checkers, evolving Coverity's state of the art analysis infrastructure, and generally pushing the envelope of static analysis.The perfect candidate will have a strong passion for improving software quality and security and preferably have a background in programming languages and static analysis, and foremost a strong desire to learn. If you have experience with any other static analysis and developer testing tools like Fortify, Parasoft, Klocwork, or Checkmarx, CodeSonar, we'd love to talk to you!General Responsibilities• Design, experiment with, and implement new checkers• Make improvements to general analysis infrastructureQualifications and Experience• Experience in C/C++ development (5+ years)• Experience or Interest with WebApp Security or Mobile Security• Experience with Object Oriented programming and design• Experience with development on UNIXNice to Have• Experience with one or more of Java, C#, Swift, JavaScript, PHP, Python, Ruby, Scala, and Groovy• Experience with compiler technology• Research, degree or background in programming languages and static analysis• Experience with C++ templates• Experience with development on WindowsEducation and CertificationsBA or BS Computer Science, or MS or equivalent• Strong problem solving skills• Good written and verbal skills• Team player• Strong interest in learning and growing• Driven personality/self-starterAbout the Synopsys Software Integrity GroupSynopsys Software Integrity Group helps organizations build secure, high-quality software, minimizing risks while maximizing speed and productivity. Synopsys, a recognized leader in application security, provides static analysis, software composition analysis, and dynamic analysis solutions that enable teams to quickly find and fix vulnerabilities and defects in proprietary code, open source components, and application behavior. With a combination of industry-leading tools, services, and expertise, only Synopsys helps organizations maximize security and quality in DevSecOps and throughout the software development life cycle.For more information, go to www.synopsys.com/software.Synopsys considers all applicants for employment without regard to race, color, religion, sex, gender preference, national origin, age, disability, or status as a Covered Veteran in accordance with federal law. In addition, Synopsys complies with applicable state and local laws prohibiting discrimination in employment in every jurisdiction in which it maintains facilities. Synopsys Inc. also provides reasonable accommodation to individuals with a disability in accordance with applicable laws.Hiring LocationCANADA - Alberta - Calgary, Canada - Ontario - Kanata, USA - California - San Francisco, USA - Washington - SeattleHire TypeEmployeeJob CategoryEngineering CountryUnited States "}