{"jobID": "2514358303", "jobLocation": "Azusa_CA", "jobTitle": "Data Scientist - IMT", "companyRating": "3.9", "companyInfo": {"Website": "www.apu.edu", "Headquarters": "Azusa, CA", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " APU is seeking employees who desire to engage in our thriving culture by cultivating community through professional interactions, demonstrating a posture of lifelong learning, and modeling Christ-like character. Working together, employees at APU commit to establishing a university atmosphere that is pleasing to God and edifying to one another.  This founding position is responsible for the utilization of data systems to model complex Institutional data, discover insights and identify opportunities through the use of trend analysis, specifically as it relates to undergraduate student success initiatives. This data expert is able to analyze big data and engage in predictive modeling and other analytics needed to facilitate successful enrollment and retention efforts, as well as other institutional effectiveness initiatives at the University. Required EducationMaster’s degree required. Doctorate degree preferred.Required ExperienceExperience configuring and managing one or more of the following:Student Records including financial aid and recruitment systemsData warehouse or data martData modeling, preferably for a higher education institutionExperience as a statistician, researcher, or professional in aligned fieldsExperience in database management and advanced data analysis (specifically predictive analytics and equation modeling)Primary Duties/Essential FunctionsCollect, prepare, analyze, and report university-wide data on student life, retention, academic programs, and co-curricular activities used for University initiatives including assessment, planning, marketing, budgeting, and project development.Assist with meeting internal needs for institutional data mining, research, analysis, and interpretation.Assist with the selection and use of appropriate statistical methods for quantitative analyses and predictive modeling, including descriptive and inferential statistics, multivariate statistics, regression, logistic regression, factor analysis, and longitudinal studies.Create and run queries, analyze data, and produce reports to support enrollment and retention efforts.Create dashboards and other reporting mechanisms to support enrollment and retention initiatives.Research and propose improvements to existing processes.Develop a data collection framework to enhance enrollment, retention, and graduation.Disseminate research findings to key institutional constituents.Collaborate with University Enrollment Management Council to identify outcomes that result in improved enrollment, retention, and graduation.Research and propose improvements to existing processes.Develop a data collection framework to enhance enrollment, retention, and graduation.Disseminate research findings to key institutional constituents.Collaborate with University Enrollment Management Council to identify outcomes that result in improved enrollment, retention, and graduation.SkillsComputer and word-processing skills.Ability to manage multiple projects and meet deadlinesExcellent organizational skills and attention to detailAbility to foster cooperation and work collaboratively with othersAbility to prioritize tasks and work independently without significant supervisionStrong interpersonal, collaborative, organizational and problem-solving skills.Advanced data analysis skillsScripting and programming skillsExcellent oral and written communication skillsProficient in one or more of the following data and BI tools: PeopleSoft Query, XML Publisher, SQL, Tableau and OBIEEProficient in all Google programs, including Google docs, sheets, sites, Hangouts, and GmailProficient in SPSS (or other statistical package) and Microsoft OfficeMental DemandsAbility to work under pressure, exuding a mature demeanor while multi-tasking in a deadline oriented environment with accuracy and consistency.Ability to manage staff members.Ability to work independently and meet deadlines.Ability to work collaboratively with a team, as well as an independent contributor.Ability to exercise good judgment and discretionary skills in determining when to act independently and when to consult management prior to taking action.Self-starter with a positive attitude.In agreement with the purpose and goals of Azusa Pacific University in providing a Christian-based higher education for its students.Physical DemandsRequires repetitive motions and sitting at computer keyboard.Hearing and speaking on the telephone.Able to conduct business at other offices on campus.Able to lift, bend, grasp, reach, lift up to 20 lbs. occasionally.Visual DemandsReading, writing notes, and computer monitor.EnvironmentPleasant office suite, personal workspace, comfortable temperature.TechnologiesProficient in one or more of the following data and BI tools: PeopleSoft Query, XML Publisher, SQL, Tableau and OBIEE.Proficient in all Google programs, including Google docs, sheets, sites, Hangouts, and Gmail.Proficient in SPSS (or other statistical package) and Microsoft Office. Azusa Pacific University is a Christ-centered, multicultural community that values and seeks faculty and staff who are committed to diversity, work effectively with diverse populations, and engage others in ways that honor our rich cultural mosaic and biblical foundation.  Click below to discover some of the many benefits APU employees enjoy including competitive health care options, an 8% retirement match, and a generous tuition discount.  http://www.apu.edu/humanresources/benefits/  You can learn more about APU by watching the stories of faculty, staff, and alumni as they carry out our mission here: http://www.apu.edu/stories/  Azusa Pacific University will conduct a background check on all final candidates.  Review of applications will begin immediately, and the position will remain open until filled unless otherwise stated. Azusa Pacific University does not discriminate on the basis of race, color, national origin, sex, age, disability, or status as a veteran in any of its policies, practices, or procedures. Women and minorities are encouraged to apply.Required Skills Required Experience Job Location  Azusa, US-CA "}