{"jobID": "2596888844", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Backend Software Developer", "companyRating": null, "companyInfo": {"Website": "www.nyansa.com", "Headquarters": "Palo Alto, CA", "Size": "1 to 50 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Nyansa is looking for an enthusiastic cloud backend developer focused on scalability and performance to help build a new, vendor-agnostic IT network analytics service purpose built for CIOs, network operations and helpdesk personnel managing heterogeneous enterprise environments. Our product, Voyance, is focused on the end user experience by helping IT staff gain new insights into client access conditions, network service behavior and enterprise applications issues that impact user performance.  Nyansa, Inc. is well funded and provides a competitive compensation package, stock options, benefits, catered lunch, and a fun work environment.  We’re located within a 1 min walk from the Palo Alto Caltrain station in a nice area of downtown Palo Alto. Team Nyansa is made of an awesome group of intellectual individuals who value hard work, but don't take themselves too seriously.  Responsibilities: Design and develop a highly scalable and available cloud back using Cassandra, Elastic Search, and Spark analytics platformsOptimization and performance tuning to process large volume of data streams for analysis and persistenceDesign and develop APIs and data models to support analytics and front-end UI Requirements: 3+ years experience in OOD/OOP and Java/Scala and distributed systemsWorking experience with nosql and relational databasesExperience in using profilers (e.g. JProfiler, Yourkit) and debuggers to identify bottlenecks and tune performanceBS in CS or related field Pluses: Experience with AWS or other IaaSStrong in Python and/or shell scriptingExperience with Kafka, Elastic Search, Cassandra, Spark"}