{"jobID": "2828597458", "jobLocation": "Dallas_TX", "jobTitle": "Sr. Data Scientist Full-Time | RM Dayton Analytics, Ltd. Co.", "companyRating": null, "companyInfo": {"Website": "www.rmdayton.com", "Headquarters": "Plano, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Description RM Dayton Analytics has an elite client with an  immediate opening for a Sr. Data Scientistin  their Dallas, Texas headquarters. Key is ability to create and execute Python code to get results! You should be an expert on the popular ML models of today. You must know the statistical algorithms to apply the model. If, for example, an optimization problem, you must know optimization. It's part of marketing, so you should have a solid understanding of such concepts as pricing, capacity, utilization and advertisement ROI. In summary, his position performs data science functions in providing insights into customer behavior to enable decision making relating to promotions, events and marketing programs for all brands both in stores and online. Job DutiesLead data science projects independently while  collaborating with team members and multi-organizational stakeholders.Perform hands-on advanced analysis in marketing science  and business analytics on big data to promote growth and business  developmentLeverage state-of-the-art data processing tools and/or  analytical methodologies to drive improved decisionsSupport the team in development and/or implement  various types of predictive models, natural language processing, segmentation  strategies, optimization algorithms, and data mining analyses with a  targeted result of increasing revenueJob RequirementsExperience in processing and performing multi-faceted  analysis with customer/consumer behavior dataExperience in developing or enhancing models applying machine  learning and artificial intelligence algorithms, statistical analysis, and  natural language processingStrong coding skills in SQL; and Python, R, Julia, or Scala.Experience in working with distributed computing i.e.  Hive, Apache SparkExperience in working with Unix/Linux environmentKnowledge of descriptive analytics and data  visualizationExceptional standards for quality and strong attention  to detailExperience with full lifecycle agile application  development in supporting analytic requirementAbility to manage multiple projects and on-demand  business requests simultaneouslyRM Dayton Analytics,  Ltd. Co. - Aligning Tomorrow’s Knowledge Worker ™Must be legally  authorized to work in country of employment without sponsorship for employment  visa status now or in the future. Equal Opportunity Employer. All qualified  applicants will receive consideration for employment and will not be  discriminated against based on race. color, religion, sex, sexual orientation,  gender identity, national origin, protected veteran status, disability, age,  pregnancy, genetic information or any other consideration prohibited by law or  contract."}