{"jobID": "2818577140", "jobLocation": "Alhambra_CA", "jobTitle": "Affordable Housing Data Analyst Intern", "companyRating": null, "companyInfo": {"Website": "www.lacdc.org", "Headquarters": "Alhambra, CA", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Government", "Industry": " Government", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Affordable Housing Data Analyst Intern ECONOMIC AND HOUSING DEVELOPMENT DIVISION$15.00 HOUR Position located in Alhambra  The Community Development Commission/Housing Authority of the County of Los Angeles (CDC/HACoLA) is a dynamic and innovative local government agency created in 1982 by the Los Angeles County Board of Supervisors. The agency is an industry leader in four core service areas: affordable housing, and community, economic, and housing development. Funded primarily with federal grants, the CDC/HACoLA prides itself on sponsoring new solutions to local issues, and forming partnerships with private and public agencies. To learn more about the agency's work in support of its mission to Build Better Lives and Better Neighborhoods, please visit www.lacdc.org.  The Economic and Housing Development Division (EHD) administers a variety of affordable housing programs on behalf of the Los Angeles County Board of Supervisors. One of EHD's core functions is to administer federal and local funding made available to help finance the development of affordable and special needs housing in the county. The Capital Finance and Asset Management Unit (CF/AM) within EHD monitors compliance of all affordable housing projects funded by CDC/HACoLA. In addition, CF/AM has oversight or administrative duties related to multifamily bond financing, monitoring of land use and planning requirements for affordable housing, Housing Successor Agency, and the Accessory Dwelling Unit (ADU) Pilot Project. The CF/AM unit works closely with the Los Angeles County Department of Regional Planning (DRP) to track housing data needed for compliance with the County's Housing Element as well as participation in the County's Homeless Initiative.  The CF/AM Unit is seeking a part-time Housing Data Analyst Intern to assist with management and analysis of affordable housing program data associated with the full range of housing data and compliance tracking efforts. This intern position will assist the CF/AM in checking the accuracy and improving systems and protocols to manage a wide range of housing data fields, while also exploring ways to map and display information. CF/AM tracks data related to unit sizes, amenities, population type, affordability levels, accessibility, rents, development costs, and funding types, among other fields. Additionally, CF/AM will be developing new data systems to track housing stock with expiring affordability commitments, and to share this preservation data with other state and local governments and research organizations. The work to be done by the Affordable Housing Data Analyst Intern will help CF/AM in the development of recommendations for improved data systems that are coordinated across multiple programs.  Duration of the internship would run for 6 months, with possible extensions. The position has flexible hours for up to 12 hours per week, or less. The CDC's work hours are Monday through Friday between 8 AM to 6 PM.  Essential Job Duties  Under direct supervision, performs assignments requiring the use of EXCEL and ACCESS databases, network file structures, network email, and Laserfiche record searches to compile, verify, input, sort and map past and present housing project data. The three key parts of this assignment are 1) searching past electronic records to capture, verify and input data, 2) work with Development Specialists and Analysts to add and map data from new projects, and 3) maintain and improve the master Excel spreadsheet and produce data sets and reports upon request. This work may also include some contact with developers, property management companies, and EHD Project Managers in order to verify older housing data, as well as interaction and some coordination with CDC GIS mapping efforts. The employee will work with management on tasks related to specific assignments. The successful candidate will perform a wide range of duties requiring initiative, focus, time-management, and good communication skills in addition to a wide variety of skills needed to organize and sort electronic data, with a strong focus on accuracy and timely performance of assigned tasks. Qualifications Must be currently enrolled in a graduate degree program in Urban and/or Regional Planning or a closely-related field from an accredited college/university. Highly Desirable Qualifications:High degree of proficiency with MS Excel with the ability to do data links, graphs, and Macros.Experience with MS ACCESS and the ability to transfer data to and from Excel.Experience with GIS and other mapping systems.Experience or knowledge of database software systems.Experience managing a database.Experience with or knowledge of affordable housing finance and development terminology and practices.Experience creating or using Infographics.Experience with Adobe InDesign or related graphic design programs.Additional Information Possession of a valid California Driver's License and an acceptable driving record are required.  Human Resources staff will notify all applicants of their application status via email. You are responsible for monitoring correspondence from this office by checking your e-mail account in a timely manner.  Successful candidates must complete a thorough background investigation, including a fingerprint search and physical evaluation prior to appointment.  A resume cannot be substituted for any section of the online application and/or supplemental application. If your application is incomplete, it may be rejected at any stage of the examination process. Work experience must be supported by the experience in your application. \"See resume\" is not an acceptable answer.  Those applicants whose qualifications most closely meet the needs of the Division, will be invited for the examination process. DEADLINE: OPEN UNTIL FILLED. APPLY IMMEDIATELY, POSITION MAY CLOSE WITHOUT PRIOR NOTICE.RECRUITMENT NUMBER: 18043"}