{"jobID": "2824286388", "jobLocation": "Montvale_NJ", "jobTitle": "R&D; Senior Associate / Senior Product Development Scientist Dettol", "companyRating": "3.3", "companyInfo": {"Website": "www.rb.com", "Headquarters": "Slough, United Kingdom", "Size": "10000+ employees", "Founded": " 1823", "Type": " Company - Public (RB) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "103000", "jobDescription": ". A fantastic opportunity is available for an R&D; Senior Associate / Senior Product Development Scientist Dettol to join our Research&Development; team.  The Senior Associate / Senior Product Development Scientist will lead technical product development on key projects and manage a team for the Dettol Surface Care (Aerosols, Sprays/Triggers - Cleaners&Cleansers;) and Personal Care (hand sanitizers/sprays) Category R&D; Team.  Key Responsibilities  Pipeline&Project; Delivery Take technical and project management leadership to deliver projects for Dettol to launch on time, within budget and to the appropriate performance standards, quality and cost.Utilize formulation skills and technical expertise to develop new products, technologies and benefits to address relevant consumer needs in support of brand initiatives.Manage complex and multifunctional projects in ways the optimize cost, quality, and speed of delivery. Lead and advance multiple projects through the product development process.Anticipate contingencies and build team response and readiness in advance.Identify new innovation opportunities and develop creative claims which are consumer and business relevant.Work in a cross-functional environment. Liaise with appropriate development, supply chain and marketing team members to ensure appropriate planning and completion of all activities to for the assigned projects. Lead project teams to achieve key milestones and objectives.Help execute clinical and product testing in support of new product and claims development.Collaborate with Marketing to develop, prioritize and execute project portfolio.Develop technical product strategies to support short-term and long-term innovation.Build detailed technical knowledge of respective areas of the product portfolio/ technologies and leverage this within day-to-day activities.Educate key stakeholders (marketing, supply, etc.) on technology and product.Work with outside suppliers/teams to help deliver pipeline needs. Liaise with the Hygiene Home Business Unit to adapt and roll out Surface Care pipeline projects into Health Business Unit Markets. Team Management Supervise direct reports with responsibility for ensuring their development.Lead a team, coaching them on their technical skills, personal development and career progression.Foster personal development growth with continuous coaching and feedback on career development as per RB Core Values.Effectively develop and supervise assigned talent and prioritize resources to effectively advance assigned Dettol activities and projects.Set objectives, conduct performance reviews and advise on the development of his/her team members to enable them to achieve their full potential.Build high performance among individuals and teams by channeling the motivation of others and guiding them to do so in ways that actively contribute to global RB Business and reflect Corporate Core Values. Is this You? BS/BA degree in a related scientific discipline and up to 8 years' relevant R&D; experience, or MS degree in a related scientific discipline and up to 5 years' experience, or PhD in a related science and up to 3 years' experience.A proven track record of successful end-to-end delivery of technical projects in a FMCG company, from concept to launch through proper planning, prioritization, and implementation activities. Experience with aerosols, triggers, surface cleaners, surface antibacterial cleansers/disinfectants, hand sanitizers/sprays, and/or high alcohol formulations is desired.Experience/expertise in technology development and desire to execute the same to a finished product as needed.Strong formulation expertise and understanding of raw material chemical interactions.Strong understanding of the product development process from concept ideation to launch.Very strong Project Management skills with a proven track record of results and ability to manage multiple projects within established timelines, coordinate/manage key stakeholders, and develop/manage timelines.Excellent communication, problem solving, organizational, technical and influencing skills.Strong interpersonal skills to nurture teamwork and foster an environment of achievement.Self -motivated with a bias for action, results, and ownership. Extremely focused to ensure that experimental programs meet objectives. The ability to overcome obstacles by seeking support from others to accomplish objectives and strong problem-solving skills.Experience in leading a team and managing direct reports.Ability to display a degree of flexibility and adapt effectively to change in a fast-paced environment.Excellent networking and communication skills.Understanding of strategy and planning issues and priority setting.Proven people management and people development skills.Good communicator coupled with excellent analytical and interpersonal skills, and ability to analyze data and solve complex technical issues.Technical expertise and curiosity with the ability to develop technologies across categories. Ability to become the RB 'expert' in product implementation and launch areas as needed.Understanding of regulated products under regulatory bodies (BPR).Interpersonal and negotiating skills with the ability to influence and work in a team oriented environment, including cross-functional Project Teams involving R&D; functions and non-R&D; functions such as Marketing, Supply, Manufacturing.Ability to manage key stakeholders and sell through innovation ideas.Ability to rapidly understand requirements during practical implementation of innovation at a manufacturing set up is essential.Exceptional skills in experimental design and interpretation of results. Experienced in the practical applications of laboratory based technology development.Ability to work independently within a multi-disciplinary project team.Proven track record of working successfully with outside suppliers.Openness to change and ability to think out of the box.Proactive mindset fitting with RB Core Values and able to exhibit entrepreneurial attributes.Proficient with common software, including MSOffice. The position is based in Montvale, NJ  Why RB? Fast paced. Tired of having to jump through endless hoops to get things done? Not here. We move fast and deliver.Growth. Frustrated by the lack of growth opportunities in your current company? Not here! RB takes pride in the development and continued growth of our employees through steady rotations and promotions.Autonomy. RB empowers you to OWN what you do.Iconic Global Brands. http://bit.ly/RBNABrands Take a look. You'll be surprised at how many you already have in your home.Feel good about the company you work for! RB is committed to making the world a better place through betterbusiness. http://bit.ly/rbsustainabilityPassport Stamps. Does working Internationally interest you? Perform well and Global doors can open for you at RB.Work with smart people. We have a talented workforce that believes in sharing ideas to help each other, and the company succeed.Vacation. We offer 4 weeks' vacation, 9 core Holidays and 4 floating days.16 weeks paid Maternity leave.Competitive base salaries and bonuses.Tuition reimbursement. In Return RB offer very competitive salaries with excellent benefits and the chance to progress your career within a truly Global organisation.  Apply Now for a chance to really change the game!  RB is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law."}