{"jobID": "2699361070", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Product Marketing Manager - CX", "companyRating": "4.4", "companyInfo": {"Website": "www.zendesk.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Public (ZEN) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Freshdesk, RightNow Technologies"}, "estimatedSalary": "152000", "jobDescription": "Zendesk is looking for a Senior Product Marketing Manager, based in San Francisco. Your role will be to help position and market one of our new product offerings, Zendesk CX, to prospects in SMB and midmarket/Enterprise segments. Zendesk CX is Zendesks own internal Customer Experience team that provides customers with the ability to be successful using Zendesks products. Zendesk CX includings Zendesk Services, Education and Training and Customer Support and Success. Reporting to the Director of Product Marketing, this role will develop product messaging, lead product launches, and work with our sales, CX and marketing teams to activate our brand and promote the CX product offerings across multiple channels.Responsibilities: Develop product positioning that differentiates Zendesk CX by understanding customer needs, product roadmap, market trends, and competitive forcesProactively identify opportunities for Zendesk CX to more successfully reach, and win, prospects within existing and new target segments.Design goal-driven marketing plans for particular audience segments across owned, paid, and earned media channels - supported by a rationale for why, when, and how each channel should be usedCreate messaging that fits the audience mindset/needs and maximizes the strengths of each channel or communication experience (e.g. website, in-product messaging, on-boarding, blog, emails, field, etc.)Plan and execute product/feature launches across cross-functional teams (spanning Product, Marketing, Support, Service, Sales) and related sales enablementWork with Product Management and CX team to establish a continuous feedback loop (encompassing market trends, customer needs, and competitive factors) to influence the product development roadmap and mitigate product gapsCollaborate with Sales to understand & support ongoing enablement, and maximize impact of messaging for the midmarket and enterprise audienceRequirements:Enthusiasm and empathy for genuinely improving how businesses serve and engage peopleArticulate and very skilled at telling a written or visual story in a simple straightforward wayCan quickly synthesize data, trends and customer insights into a position and craft messaging that connects with both internal stakeholders and customersDecisive, Agile, and Iterative; easily able to shift gears between thinking and doing.Has demonstrated an ability to dive into a product and become a championCan effectively balance quantitative evidence and qualitative factors to quickly test and learn (avoiding analysis paralysis)Can start multiple initiatives at the same time and energetically pursue them to show continued iterative progressThe best customer experiences are built with Zendesk. Zendesks powerful and flexible customer service and engagement platform scales to meet the needs of any business, from startups and small businesses to growth companies and enterprises. Zendesk serves businesses across a multitude of industries, with more than 125,000 paid customer accounts offering service and support in more than 30 languages. Headquartered in San Francisco, Zendesk operates worldwide with 15 offices in North America, Europe, Asia, Australia, and South America. Learn more at www.zendesk.com.Interested in knowing what we do in the community? Check out the Zendesk Neighbor Foundation to learn more about how we engage with, and provide support to, our local communities.Individuals seeking employment at Zendesk are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation.By submitting your application, you agree that Zendesk may collect your personal data for recruiting, global organization planning, and related purposes. Zendesk's Candidate Privacy Notice explains what personal information Zendesk may process, where Zendesk may process your personal information, its purposes for processing your personal information, and the rights you can exercise over Zendesks use of your personal information."}