{"jobID": "2677943265", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.maplecroft.com", "Headquarters": "Bath, United Kingdom", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job ID: 20171024-10245-CK  Company Name: Verisk MaplecroftDescription:Job Title: Data EngineerReports to: Chief Technology OfficerLocation: Jersey CityCompany Verisk Maplecroft’s data-driven solutions enable multinational companies to identify and manage the key political, human rights, economic and environmental risks impacting their operations, supply chains and investments.  As part of the Verisk Analytics family, we are aligned with the world’s leading data analytics organisation. Together, we aim give our clients the insight they need to make better, data-driven decisions through unrivalled analysis and advice. Team Profile The Technology team at Maplecroft is responsible for designing, developing, and running the infrastructure and products that drive the company. Maplecroft is a data-driven company, and the Technology team sits at the heart of what we do. We're a small but capable team that values independent thought, critical thinking, and pragmatism. Role Purpose This will be the first hire in a new Data Science team reporting into the CTO. We need someone to work with people (and data sources) across the business to consolidate, aggregate, and make sense of various types of data, ranging from website analytics to structured API feeds from vendors to web crawls. A few example projects that the successful candidate would work on are:  1. Customer engagement reports & dashboards to support the Sales & Marketing team, pulling data from Google Analytics and our CMS & entitlement databases to show who is (or isn’t!) accessing what content  2. Usage metrics for the Research teams to better understand how customers are consuming their content (using similar data to 1.)  3. Using web scraping tools to assist Research analysts with their work by aggregating and annotating a variety of news sources  4. Working with Data Scientists in our Analytics team to help them gather and process structured and unstructured data sets in support of their work  5. Working with the Software Engineering and Infrastructure teams to turn pilot projects from around the business into production applications Knowledge & Experience Key skills are Python programming and a working knowledge of range of databases. We aren’t looking for a web developer, though someone with that background would be well suited to the role. Specific technologies you will be expected to work with include:  · Python  · MySQL  · PostgreSQL  · ElasticSearch  · Apache Airflow  · Various HTTP APIs Key CompetenciesIssue identification, problem solving & analysisCommunicationPlanning, implementation and controlBuilding and maintaining relationshipsCollaborationContinuous improvementMaplecroft Core Values Maplecroft is a place where we are committed to supporting our people to grow and thrive. We value different perspectives and aspire to create an inclusive environment which encourages diversity and fosters a sense of belonging.  Maplecroft values the contributions of each individual and helps them reach their full potential while sustaining an organisational culture of health and wellbeing.  Our core values are:  · Respect for the Individual  · Integrity  · Passion  · Persistence  · Confidence with humility  · Excellence  · Teamwork  We understand the importance of achieving balance between work, family and other life commitments. We are open to considering flexible working arrangements to enable the greatest spectrum of talent to contribute to our success. EEO Statement Unsolicited resumes submitted to Wood Mackenzie by any external recruitment agency via Internet, e-mail, fax, or U.S. mail become the property of Wood Mackenzie and we are not responsible for any fees associated with those resumes.  In compliance with the Civil Rights Act of 1964 and 1991, the Age Discrimination in Employment Act of 1967, Section 504 of the Rehabilitation Act of 1973, the Americans with Disabilities act of 1990 and all other relevant federal and state laws, the policy of this company prohibits discrimination in employment because of race, color, religion, national origin, sex, gender identity and/or expression, age, veteran’s status, disability, genetic information or any other group protected by law. Applicants are considered for all positions without regard to race, color, religion, national origin, sex, gender identity and/or expression, age, veteran’s status, disability, genetic information or any other group protected by law.  If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access WoodMac.com/careers on-line as a result of your disability. You can request reasonable accommodations sending an email to hrenquiries@woodmac.com.  Wood Mackenzie is an Equal Opportunity Employer M/F/V/D, and a member of E-Verify.  http://www.eeoc.gov/Requirements: Expertise Information Technology Education Bachelors (or equivalent work experience) Job Type Full Time Location NJ-Jersey City Years of Experience 3-5 Years"}