{"jobID": "2758936814", "jobLocation": "San_Antonio_TX", "jobTitle": "Sr Data Analyst, Commercial Analytics", "companyRating": "3.1", "companyInfo": {"Website": "www.acelity.com", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Smith & Nephew, Medtronic, Coloplast"}, "estimatedSalary": "76000", "jobDescription": "Job DescriptionThe ideal candidate will be able to apply healthcare knowledge of sales and customer data, as well as plan performance, across multiple lines of business and selling roles to develop insights and key factors driving business performance. As creation of sales and product reports and ad-hoc analytics is a key activity for this role, the candidate should possess intermediate to advanced expertise in Business Intelligence, data modelling and preparation, SQL programming, and visualization tools (specifically, Tableau and PowerBI). In addition to the technical skills laid out above, the candidate must be able to effectively communicate (via verbal, written and data visualization means) unique and decision-supporting insights to Sales and Executive leadership, so the ability to connect data findings to business strategy is essential.  Reports to Director, Commercial Analytics & Communication Primary Duties / ResponsibilitiesActs as an internal consulting resource for business partners and broader analyst community for applying leading techniques, interpreting data, understanding implications for business function strategy, tactics and ongoing operationsApplies leading-edge analysis tools and techniques to determine and/or predict trends, correlations and causal relationships between variablesCreates and manages complex ad-hoc reports, using insights from data exploration to build comprehensive reports with advanced and effective visualizations (using Tableau and PowerBI) and insightsImplements leading and lagging metrics ensuring timely deliverables and performance tracking on a daily, weekly, and monthly basisDemonstrate forward thinking by anticipating and remediating potential roadblocks, comprehending the bigger picture of the business strategyConsult with sales leadership on growth opportunities, motivational models, and regional and territory recommendations and investment strategiesCommunicate and collaborate effectively with sales leadership to influence field executionExplain data to business partners and prepare them to present data and answer complex/unique questionsDevelop a close collaboration with technology partners to strengthen alignment between business data applications, implications and technical architectureMinimum QualificationsBachelor’s Degree in Business Analytics, Data Analytics, Data Science, Computer Science, Finance, or related major; Master’s Degree preferred5+ years’ experience working with end-users and key stakeholders in reporting and analytics rolesExperience with Customer Relationship Management (CRM) business processes/systems (specifically Salesforce), Data Warehousing and Visualization tools (Tableau required, but may also include Salesforce Lightning/Einstein and PowerBI)Advanced analytical and quantitative skills with the ability to navigate large and complex data sets making insightful observations and identifying relevant patterns, as well as the ability to adapt to changing priorities and deadlinesIntermediate to advanced SQL programmingExcellent communication skills with executives and other internal stakeholders, catering to various levels of analytical proficiencyAbility to work independently and collaboratively, as required, in a fast-paced, matrixed, team environment consisting of internal and external team membersExcellent planning, organization and time management skills including the ability to support and prioritize multiple projectsResults oriented: Attention to detail, organized, and able to multi-task on multiple initiativesIntense curiosity and passion for data, analytics and researchPrior experience with R, Python, or other related programming languages is preferredTravel RequirementsOffice-based position10-20% within US (field visits and meetings)RelocationRelocation assistance provided The information listed above is not a comprehensive list of all duties/responsibilities performed. This job description is not an employment agreement or contract. Management has the exclusive right to alter this job description at any time without notice. Any physical and mental requirements described in this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  EOE AA M/F/Vet/Disability: Acelity L.P. Inc. and its subsidiaries are an equal opportunity and affirmative action employer and give consideration for employment to qualified applicants without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, pregnancy, national origin, age, disability, veteran status, or genetic information or any other legally protected characteristic. If you'd like more information about your EEO rights as an applicant under the law, please click here: http://www1.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf VEVRAA Federal Contractor "}