{"jobID": "2829533779", "jobLocation": "Washington_DC", "jobTitle": "Workforce Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "75000", "jobDescription": "Job Number: R0030981 Workforce Data AnalystKey Role:  Apply technical and analytical expertise to exploring, examining, and modeling workforce data from multiple disparate sources with the goal of discovering patterns and previously hidden insights, providing a competitive advantage, or addressing a pressing business problem. Use expertise in data science, software development, and the latest technologies to analyze and implement analysis infrastructure and tools, analytic workflow processes, complex data visualizations, and database creation and management. Leverage comprehension of mathematical and statistical concepts, computer science, or software development to bridge the gap between technologists and organizational leadership, including ensuring software solutions meet analytic requirements.  Basic Qualifications:  -Knowledge of data analytics or engineering  -Knowledge of data visualization  -Knowledge of Microsoft Excel VBA, Python, R, SSRS, or SQL/T-SQL  -Ability to obtain a security clearance  -BA or BS degree  Additional Qualifications:  -3+ years of experience with data analytics or engineering  -1+ years of experience with data or knowledge management  -Experience with human capital data and processes  -Experience with SharePoint  -Experience with Tableau  -MA or MS degree  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change.JHT "}