{"jobID": "2822841096", "jobLocation": "Oakbrook_Terrace_IL", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.roberthalftechnology.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": " Robert Half Technology is hiring a Data Analyst to deliver complete, accurate and timely data to the project team for use as the foundation for in-depth, customized client reporting. This requires ongoing monitoring, review and assignment of media content, regular process and quality checks, and communication with internal and external teams to ensure efficient workflow.  Ongoing monitoring, review and assignment of media content, regular process and quality checks, and communication with internal and external teams to ensure efficient workflow.  Database management  Data preparation and generation  Data quality assurance  Report writing  Other tasks as directed and assigned Qualifications Background in research (media, marketing, demographic, social science, etc.) desirable but not essential  Bachelor's degree or comparable education/experience  Demonstrated analytical ability  Aptitude for learning computer systems and databases  Experience using Microsoft Office suite, especially Excel and PowerPoint  Excellent communication skills  Superior organizational skills, with the ability to easily identify changing priorities  Ability to take and give constructive direction and feedback  Ability to work independently with general direction, or as part of a team  While working as a contract employee through Robert Half Technology, you will have access to benefits, be eligible for holiday pay and bonus pay, have access to complimentary online tutorials and can participate in our 401K program.  For immediate consideration, please send your resume as a Word Document to Neha Potdar at neha.potdar@rht.com"}