{"jobID": "2732246864", "jobLocation": "Oakland_CA", "jobTitle": "Well Being CleanAire Territory Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.rochestermidland.com", "Headquarters": "Rochester, NY", "Size": "201 to 500 employees", "Founded": " 1888", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Well Being CleanAire Territory Sales Representative Location: Oakland, CA Position: Full Time Type: Outside Sales Other: Field Based Position Summary of Responsibilities Feel good about the work you do and the programs you sell! Picture yourself working for a reputable company where you represent some of the best programs and services in the industry. Rochester Midland Corporation has developed a strong brand presence in our market space, having served our customers since 1888, with very effective programs, coupled with excellent service. Now is the right time to explore a career with Rochester Midland.  Rochester Midland Corporation is searching for a Territory Sales Representative for CleanAire division in the Oakland, CA area. In this position, you will have the opportunity to grow a large and profitable sales territory. You will be responsible for new account prospecting while successfully moving them along our proven sales process to new business development. In addition to this, you will be responsible for account retention and expansion, while driving more value to our large base of loyal customers. Our professionally serviced programs are critical to the health, safety and wellbeing of our customers, their employees, guests and other end users, thereby contributing to our customers overall profitability. Without the proper use of these services, facilities risk losing revenues, increased costs and unhappy employees. You will become a proponent of health and safety and truly make a difference. This combined with fair market value, you will gain customers for life.  As part of our vision, RMC seeks a Territory Sales Representative for our WellBeing Hygiene Division. Your responsibility will be to grow our business in the Oakland, CA and surrounding areas. You are highly motivated, creative, hardworking and enthusiastic. You will collaborate with the Service team and be responsible for profitable growth through new business development and account retention. You are focused on identifying and serving the needs of new prospects as well as current customers and creating lasting business value through our dedicated and focused account retention program. You thrive on new business development and expect to be equally rewarded in return. This is a career position for an individual that would like to grow with our organization that will provide opportunity for professional and personal growth.  Rochester Midland Corporation has been owned by the same family for over 125 years, gaining a reputation for stability, growth, and continual improvement. The company is proud to be LEED and ISO 9001 certified. It’s time to join a company with unbeatable benefits, opportunities for advancement, and where your growth will set yourself up for a lifetime of success.  As a member of the team, you can expect: Competitive compensation + commission + bonus opportunitiesIncredible benefits, company provided cell phone and laptop computerAward winning wellness programVehicle stipend and mileage expenses coveredGreat reputation – LEED and ISO 9001 certified companyCompany stability – been in business since 1888 Required Qualifications:  Post-Secondary education is a plus. A minimum of 1-2 years outside Sales & Business Development experience, preferably in the Services business, Restroom Hygiene Care or Facility Services market place would be preferred. The ability to cold call and follow through with appointments to deliver effective presentations while engaging various levels of decision makers is a must  If you have experience in route sales and service to end-users, key accounts, distributors or related experience, and excellent communication, organizational and planning skills, then they want to hear from you! Bachelor’s degree is a plus!  You owe it to yourself to check out this better career opportunity – apply now!  About the company: Rochester Midland Corporation has been a leader in the specialty chemical manufacturing industry since 1888 and has a pioneering position in the development of sustainable programs. They partner with their customers to provide integrated solutions to solve problems and help them reach their strategic business objectives and environmental goals.  All qualified applicants will receive consideration for employment without regard to the individual's race, color, sex, national origin, religion, age, disability, and genetic information, status as a military veteran or any other characteristic protected by applicable law.  We are an Equal Opportunity Employer, EOE /IWD/PVProduct LinesRestroom ServicesIf Interested Email your resume or fax to(585) 266-8919or mail to Human Resources  155 Paragon Drive  Rochester, NY 14624 "}