{"jobID": "2827780809", "jobLocation": "Austin_TX", "jobTitle": "Sr. Business Analyst with Data Governance experience", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " We are seeking a 12 year + Sr. Business Analyst with Data Governance experience for a long-term contract position with our Austin, Texas based client. The Business Analyst will need to be an enterprise data warehouse along with longer-term data governance strategies, plans and processes. Looking for solid experience in business process mapping, business process development and developing data governance and data quality plans. The Worker will interface with IT management, project sponsors, project teams and technical resources, to document, analyze and communicate system changes and downstream impacts of these changes. Will be expected to work with both business and technical staff to assist in developing a comprehensive data governance strategy, and master data management (MDM) and data quality initiatives within the enterpriseThis position must be on-site in Austin, Texas Minimum Requirements:12 Experience reviewing, analyzing, and evaluating business systems and user and stakeholder needs.10 Experience serving as a Business Analyst with projects that have successfully implemented information technology solutions.10 Experience facilitating and documenting business process mapping and business process re-engineering.8 Experience documenting detailed requirements for information technology solutions especially business intelligence systems.8 Experience interfacing with multiple program areas or organizations that are geographically dispersed and that have varying business needs.8 Assisting organizations with creating and implementing data governance processes and plans.8 Experience with master data management, data quality assessments and data quality improvement.7 Facilitating discussions across groups, identifying, defining, and communicating MDM, and Data Governance success factors to technical teams, and stakeholdersStrong Communication skills, both written and verbal.Strong Skills interfacing with agency management, IT management, project sponsors as well as technical teams.Strong Understanding of database technologies, data integrations technologies and data modeling.Strong Experience presenting to program and IT management, project sponsors, and executive leadership.Preferences: Years Skills/Experience 3 Experience working as a data steward or enterprise data steward."}