{"jobID": "2783617266", "jobLocation": "Washington_DC", "jobTitle": "Shared Services Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "110000", "jobDescription": "Responsibilities:Maintain and administer computer networks and related computing environments, including computer hardware, systems software, applications software, and all configurations for local, co-location and cloud environmentsManage our server environmentManage Amazon Web Service Cloud environment such as EC2 Environments (linux- RHEL), EC2 Container Services, S3 Buckets, RDS, I&A; Management, Route 53 and VPC Management & ConfigurationPerform data backups and disaster recovery operations.Support environments in accordance with HIPAA and FEDRAMP compliancePlan, coordinate, and implement network security measures in order to protect data, software, and hardware.Operate master consoles in order to monitor the performance of computer systems and networks, and to coordinate computer network access and use.Perform routine network startup and shutdown procedures, and maintain control records.Required Skills:12+ years of Cloud or Linux Administration (RHEL preferred)Bachelor's degreeCurrent Top Secret clearanceStrong experience and knowledge of AWS ecosystem and environmentsConfiguration management tools with Chef, Puppet, Ansible, or DockerSystem monitoring tools. Nagios preferred.Relational Database (MySQL Preferred)ManagementShell Scripting with Python, Ruby, Java, PHP, Objective C, Perl and/or BashExperienced with Public Cloud PlatformsVMware and Virtualization This position requires that the candidate possess a Top Secret/SCI security clearance  KeyW is an EEO employer. We are committed to providing fair and equal employment consideration, regardless of race, color, religion, national origin, gender, sexual orientation, age, marital status or disability.  How to Apply?  Please click apply on the right  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.  KeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve.  Top secret.Apply!"}