{"jobID": "2689155515", "jobLocation": "Downers_Grove_IL", "jobTitle": "Senior Data Analyst, Regulatory Affairs", "companyRating": "3.0", "companyInfo": {"Website": "www.adtalem.com", "Headquarters": "Downers Grove, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (ATGE) ", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " As the Senior Data Analyst with Regulatory Affairs, you are responsible for ensuring that all institutions and business units operate in compliance with federal, state, accreditor, and organizational regulations - as well as the policies regarding external reporting of student outcomes and other institutional data. You help coordinate team efforts and serve as a liaison to operations, campuses, and appropriate regulatory entities for the implementation, update and communication of all program changes. Work with colleagues in all institutions and functional areas to ensure processes, procedures, internal and external reporting, materials and communications are developed in compliance with federal, state and internal standards and regulations.Represent the organization to professional organizations and government entities.Represent Regulatory Affairs in institutional meetings, providing regulatory guidance and recommendations for organizational programs and initiatives.Write and test reports and queries utilizing data warehouse tables, student information system records, and “big data” platforms.Provide information and guidance to colleagues on regulatory requirements and internal policies.Coordinate with other functional units to continuously improve the service that is provided to all institutions.Actively monitor and execute large projects to completion.Assist the Regulatory Affairs Manager with escalated questions and projects as assigned. Act as a delegate for the manager in their absence.Analyze new and amended state and federal regulations - as well as accreditor requirements - to determine the organizational impact.Develop, implement, and maintain the organization's written compliance policies and procedures, ensuring requirements remain observant to all current regulations and internal standards.Ensure that non-compliance corrections are made timely and accurately, and escalates unresolved items as needed.Work on specialized tasks, which can include ad hoc data requests, research assignments, report development, data analysis, regulation monitoring and analysis, and marketing material review and approval.Work with all functional areas as needed to develop new reporting capabilities and improve existing processes.Completes other duties as assigned. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Below are the minimum requirements of the education, experience, knowledge, and skills required to competently perform in this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Bachelor’s degree required; Master’s degree preferredPrior experience in the following areas (or similar) is strongly desired: data analytics, data science, statistics, market research, big data, report writing, programming, auditing, or quality assuranceA minimum of 4 years of experience in a federal/state regulated environmentExperience in higher education regulatory compliance is strongly preferredPossess excellent organizational, interpersonal, critical thinking, analytical, verbal and written communication skillsMust be a detail-oriented problem-solver and capable of independent workProficiency with Microsoft Excel requiredWorking knowledge with one or more of the following is preferred: SQL, SPSS, SAS, R, Microsoft Access, or data analytics/data wrangling platforms. We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing. Thank you for applying for this outstanding opportunity today.  The purpose of Adtalem Global Education is to empower students to achieve their goals, find success, and make inspiring contributions to our global community. Adtalem Global Education Inc. (NYSE: ATGE; member S&P; MidCap 400 Index) is a leading global education provider and the parent organization of Adtalem Educacional do Brasil, American University of the Caribbean School of Medicine, Becker Professional Education, Carrington College, Chamberlain University, DeVry University and its Keller Graduate School of Management, Ross University School of Medicine and Ross University School of Veterinary Medicine. For more information, please visit adtalem.com."}