{"jobID": "2791443655", "jobLocation": "Fort_Worth_TX", "jobTitle": "Data Scientist I", "companyRating": "2.9", "companyInfo": {"Website": "www.morsco.com", "Headquarters": "Fort Worth, TX", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Data Scientist I (Open)Are you passionate about data? Do you know how to turn insights into products or programs that can drive incremental revenue? If so, here at MORSCO we are not only one of the leading U.S. distributors of commercial and residential plumbing, waterworks and HVAC products, but we are also striving to become the distribution leader in advanced analytics. In this role, the Data Scientist I will leverage advanced analytics and machine learning concepts to develop and analyze predictive models to assist the business in gaining efficiencies and reducing costs. A successful candidate will:Search for patterns in data that can provide solutions to business problems or create new business opportunitiesResearch, design, implement and validate cutting-edge models to analyze diverse sources of data to achieve targeted outcomesEnhance data collection procedures to include information that is relevant for building analytic systemsWhen applicable, extend the company’s data with third party sources of informationProcess, cleanse, and verify the integrity of data used for analysisPerform ad-hoc & exploratory data analysis and present results in a clear mannerDevelop clear and concise visuals of analytical outcomesMentor and guide team members Required Technical Skills Understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, Logistic Regression, XGBoost, etc.Familiarity with developing SQL scriptsExcellent analytical and problem-solving skills Preferred Technical Skills Experience using Microsoft PowerBI or other visualization solutionExperience using Microsoft Azure, HDInsight or other cloud based data storage technologyExperience with Microsoft SQL Server or other RDBMS Education Requirements Bachelor’s or Master’s degree in Data Science, Advanced Analytics or a related disciplineJob Expectations Role Description –Consults with functional leaders to understand business objectives in order to design and develop optimized data solutionsLeverages general business experience with Eclipse data model knowledge to convert high level business objectives into functional/technical specsDesigns, develops and implements solutions to provide optimized delivery of data between enterprise databases, applications, systems and customers meeting defined requirementsParticipates in defining development standards and quality assurance measures for the teamParticipates in technical reviews to ensure that all database, ETL and reporting solutions meet technical and quality standards prior to deployment Time TypeFull timeAt MORSCO, our commitment to excellent customer service is just part of our story. We’re also dedicated to supporting our most valuable asset, our associates! One of the ways we do this is by offering a variety of high-quality benefits for our associates and their families. All full-time associates are eligible for the following benefits:Medical and Dental InsuranceFlexible Spending AccountsCompany-paid Life InsuranceShort Term Disability401(k) PlanPaid Time Off (PTO) - plus paid holidaysVoluntary benefits:Additional Life InsuranceLong Term DisabilityCancer/Accident/Heart/Stroke InsuranceVision Insurance"}