{"jobID": "2822731937", "jobLocation": "Detroit_MI", "jobTitle": "Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.populusgroup.com", "Headquarters": "Troy, MI", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "71000", "jobDescription": " Data Analyst  Populus Group seeks a Data Analyst in Detroit, MI to solve complex business and data issues for information technology projects. Gather and analyze business and operational requirements to understand system needs and functionalities. Coordinate with subject matter experts to understand functionality of backend systems. Create technical and functional architecture diagrams for implementing data governance for the future. Create user stories, sprint backlog, and burndown charts for various sprints in an Agile framework. Write SQL Scripts and utilize SQL to analyze data. Utilize SQL queries to analyze various databases and tables and assess data anomalies. Ensure systems are interacting and functioning correctly. Ensure end to end system performance. Retrieve data from databases and create report tables in Tableau. Create adhoc reports and standard data reports for business users to assist in project determinations. Utilize the following technologies and tools MS Project, Waterfall, Rally, SQL Server, SSRS, SSIS, Hadoop, Hive, Sqoop, Impala, and HP Quality Center. Must have a Master's Degree in Computer Science, Computer Engineering, or a foreign equivalent, and at least 2 years of experience in the job offered or a substantially similar position. Qualified applicants apply online at: http://populusgroup.com/jobs/contract-direct-hire/job-detail?jobid=243853 or send resumes to, ATTN: Sarah Larson, Populus Group, 3001 W. Big Beaver Rd, Ste 400, Troy, MI 48084. Interested candidates please send resume and reference job code 243853 when responding to this ad. No phone calls please.  Interested candidates please send resume in Word format Please reference job code 243853 when responding to this ad.The company is an equal opportunity employer and will consider all applications without regard to race, sex, age, color, religion, national origin, veteran status, disability, genetic information or any other characteristic protected by law.  Must have a Master's Degree in Computer Science, Computer Engineering, or a foreign equivalent, and at least 2 years of experience in the job offered or a substantially similar position."}