{"jobID": "2374356974", "jobLocation": "San_Francisco_CA", "jobTitle": "Reception Desk Associate", "companyRating": null, "companyInfo": {"Website": "www.bayclubs.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 1977", "Type": " Company - Private", "Industry": " Arts, Entertainment & Recreation", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Who We Are: We believe life is made up of moments: playing bocce with friends, going for a dip on a hot summer day, and saluting the sun just because its up. Somewhere along the way, someone told us that those moments are for Saturdays, not Mondays. That we should work fifty weeks each year just to save up for two weeks of happiness. At the Bay Club, we believe these moments are for every daybecause we believe in living life happy. And that means focusing on what really matters like family, good health, and finding the time to have fun. What We Do: Founded in 1977, the Bay Club enjoyed many industry firsts, eventually moving beyond strictly fitness to forge a unique niche in the hospitality realm by incorporating resort level programs and services into our clubsand by grouping complementary properties into amenity-rich campuses. Bolstered by a pioneering spirit, a forward-thinking company culture, and a belief in helping members to live life happy, the Bay Club has created a modernized country club experience through innovations such as the 77 Social Club and Connect Workplace Suites, along with thoughtful amenities, including an in-club Starbucks café and outdoor lounges with shuffleboard courts and fire pits.  The Bay Club Company is headquartered in San Francisco, with clubs from Marin to San Diego and a team of more 3,000 associates who are guided by integrity, innovation, growth, and community. Sparked by imagination and a progressive culture, the Company has entered a growth plan that has taken it from 12 clubs to more than 20 properties in an 18-month period, with continued accelerated growth anticipated over the next five years. And were looking for talented and motivated individualswho also believe in living life happyto join our quickly growing team! What We Can Offer You:Competitive compensationMedical, dental, and vision plansAdvancement opportunitiesComplimentary full use of Bay Club facilitiesDiscounts on services, lessons, amenities, and F&B; products.About the Position The Bay Club is currently seeking a motivated and ambitious Reception Desk Associate who is passionate about creating personable experiences and life-long memories. This position is responsible for checking in members and guests upon their arrival to the Club, creating a positive first impression, and maintaining a clean and inviting reception area. Associates are responsible for providing exceptional customer service, creating an environment of hospitality and luxury, and consistently demonstrate a positive and professional attitude. ResponsibilitiesCustomer ServiceGreet members and guests upon arrival to the ClubCheck members in by swiping their membership cardEnsure all guests to the Club fully complete a Guest Registration Waiver and pay any applicable Guest FeesBook appointments, program and class reservations for membersProvide information regarding Club programming and facilitiesDeliver exceptional service experience to members, guests, and Associates with a goal of retaining guests for repeat businessReception Desk OversightOperate cash registerProcess paymentsManage/handle cash and balance cash drawer each shift.Perform opening and/or closing duties, as requiredAnswer and transfer phone callsCleanlinessAssist in maintaining the cleanliness and stock levels of Sports Desk, Lobby area and lobby retail and/or marketing campaign displaysCommunication and RelationshipsCommunicate timely and follow up, as appropriateProvide membership sales team with guest/prospect lead contact informationActive participation in required events, required programs, required meetings and required trainingsOTHER JOB FUNCTIONSFlexibility in work schedule, as job may require day and evening shifts, weekends and holidaysQualificationsAt least one year experience in the hospitality industry or related service position preferred.Physical RequirementsThis position deals with outside personnel such as members and guests on a regular basis with contact in various forms such as in person, phone and email.It is sometimes necessary to deal with unpleasant or angry people with the need to problem solve difficult situations.Standing is as needed.Contact Please submit resume, cover letter, and details regarding your availability on the application form here This is not necessarily an exhaustive list of all responsibilities, skills, duties, requirements, efforts or working conditions associated with this job. An Equal Opportunity Employer  The Bay Club Company (TBCC) provides equal employment opportunities without regard to race, color, religion, national origin, age, ancestry, disability, marital or family status, medical condition, AIDS or AIDS related condition, sex or sexual orientation, gender identity or expression, veteran status, genetic information or any other consideration made unlawful by federal, state, or local laws."}