{"jobID": "2824019283", "jobLocation": "Hoboken_NJ", "jobTitle": "Data Modeler", "companyRating": null, "companyInfo": {"Website": "www.reqroute.com", "Headquarters": "Milpitas, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We currently have openings for Data Modeler in Hoboken, NJ.The data modeler will be part of the FIS BI team, working on primarily revenue and billing projects but contributing to other reporting projects as needed. The candidate must have prior knowledge of billing systems and models within a data warehousing environment. The position requires working with business analysts, ETL developers, and OBIEE developers to document and update data models for enhancements of existing subject areas, as well as design and development of new subject areas and models. The candidate must be able to quickly pick up existing technical and business domain knowledge. The position will require working with project teams to analyze requirements, design, and development data models, and review with data architect to ensure conformance to internal standards. Required Experience8 years of relevant data modeling experience8 years of experience with Oracle 11g, 12c. MS SQL Server experience is a plus.8 years of experience in data warehouse environment on financial services projects5 years of experience with Erwin Data Modeler (Release 9.X) and Oracle SQL Developer Data Modeler5 years of experience with Oracle EBS R12Bachelor's degree in Computer Science, Information Systems, or related fieldExperience with conversion of legacy models to enterprise modelsDevelopment of, documentation, and adherence to modeling standardsWorking directly with end users, business analysts, and development to team to provide modeling solutions for new and existing projectsIn depth knowledge of Kimball Design methodologyStrong working knowledge of PL/SQLFunctional knowledge of revenue and billing systems"}