{"jobID": "2688153222", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientist (w NLP exp)", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Title: Data Scientist – Decision Science Support Description: STG is a SEI CMMi Level 5 company with several Fortune 500 and State Government clients. STG has openings for Data Analytics Scientist. This position is based in Dearborn, MI for a Fortune 500 Automotive Manufacturer. This position is expected to be long term. STG will provide immigration and permanent residency sponsorship assistance, if needed. **No 3rd Party vendors – this client does not allow sub-contracting.Skills Required:3+ years of experience with mathematical programming, optimization techniques, data mining, or statistical analysis. Skills Preferred:Experience applying operations research, mathematics, and/or statistics approaches to supply chain or manufacturing problems.Comfortable working in an environment where problems are not always well-defined Inquisitive, proactive, and interested in learning new tools and techniques.Strong oral, written and interpersonal communication skills.Well-organized, independent and ready to work with minimal supervision.Have a desire to excel and work with talented people Experience Required:Proficiency in analytic languages and frameworks such as Python, MATLAB, SAS, R, CPLEX or Java.Proficiency in database query and management tools (SQL, Alteryx, etc.) Experience Preferred:Past experience and knowledge in automotive industry highly desired.Project management experience and strong leadership skills such as business acumen and strategic vision a big plus Resume Submittal: please email a word formatted resume to Shweta Huria at shuria@stgit.com or contact at: 248.918.4720. In the subject line of the email please include: First and Last Name – Data Analytics Scientist (Dearborn, MI). Corporate Information: Established in 1985, Systems Technology Group (STG) is a fast growing IT consulting and systems integration services firm. STG is a SEI CMMi Level 5 company with expertise in Application Development, Application Management, Web Services (SOA), Data Warehouse, Business Intelligence / Analytics, Wireless Solutions, Legacy migrations and Project Management. STG is proud that clients like Ford Motor Company, Sears Corporation, Chrysler, LLC, Mercedes Benz, United Health, General Motors, State of Texas, State of Michigan, State of Minnesota, State of Georgia, and others trust their IT services needs to STG. STG has offices in North America, Europe and India to service our clients global IT needs. STG offers a competitive compensation and benefits package including health coverage, vision, dental, life insurance, disability insurance, 401K, paid vacations and paid holidays. For more information about STG, please visit us at www.stgit.com.provided by Dice NLP, mathematical programming, optimization techniques, data mining or statistical analysis, Python, MATLAB, SAS, R, CPLEX or JAVA"}