{"jobID": "2796541013", "jobLocation": "Long_Beach_CA", "jobTitle": "Sr. Analyst, Data", "companyRating": null, "companyInfo": {"Website": "www.molinahealthcare.com", "Headquarters": "Long Beach, CA", "Size": "10000+ employees", "Founded": " 1980", "Type": " Company - Public (MOH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job DescriptionJob Summary The Sr. Analyst, Data design and implement processes and solutions associated with a wide variety of data sets used for data/text mining, analysis, modeling, and predicting to enable informed business decisions. Gains insight into key business problems and deliverables by applying statistical analysis techniques to examine structured and unstructured data from multiple disparate sources. Collaborates across departments and with customers to define requirements and understand business problems. Uses advanced mathematical, statistical, querying, and reporting methods to develop solutions. Develops information tools, algorithms, dashboards, and queries to monitor and improve business performance. Creates solutions from initial concept to fully tested production, and communicates results to a broad range of audiences. Effectively uses current and emerging technologies. Knowledge/Skills/AbilitiesWith limited supervision, the Sr. Analyst, Data is responsible for data compilation, data management, data analysis, and reportingExtracts and compiles various sources of information and large data sets from various systems or applicationsSet up process for monitoring, tracking and trending information and data using various systems or applicationsPrepares well-organized, easily understood reports, analysis, and summary of findings for use by managementAssists in preparation of regularly produced reports to support executive decision-makingResearches and analyze report results identifying opportunities and trendsWorks with internal, external and enterprise individuals as needed to research, develop and document new standard reports or processesConsolidates data from multiple sources, using industry based tools or manually; able to process data effectively using Microsoft ExcelSupports management and other team members as requested on all things data relatedJob QualificationsRequired Education Associate's Degree or equivalent combination of education and experienceRequired Experience 3-5 years Business Intelligence experience Preferred Education Bachelor's Degree or equivalent combination of education and experience Preferred Experience 5-7 years Business Intelligence experience  To all current Molina employees: If you are interested in applying for this position, please apply through the intranet job listing.  Molina Healthcare offers a competitive benefits and compensation package. Molina Healthcare is an Equal Opportunity Employer (EOE) M/F/D/V."}