{"jobID": "2688978386", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.4", "companyInfo": {"Website": "www.gusto.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "165000", "jobDescription": " Gusto is looking for an experienced data scientist skilled at building and deploying enterprise-grade predictive models to support and accelerate customer growth.  In this role you will develop and own the core predictive models used by our Marketing, Sales and Growth Product teams to support our growth objectives. As a core member of a small and impactful Data Science team, you will also be a core contributor to developing our data science tools and practices from the ground up!  The Data Science team leverages Gustos data to deliver data-informed insights for our customers and guide product direction and decision-making. We operate full-stack, conducting analyses, prototyping and deploying predictive models and statistical tools both for internal use and for our customers. Heres what youll do day-to-day:Build and deploy models that can be used for forecasting, optimization and targeting, in areas such as:Predicting lead and customer value (conversion, churn, lifetime, etc.)Targeting upsell of additional products and product tiers both in-app and through marketing and sales effortsHelping our product fulfillment teams onboard new customers faster and more efficientlyEnhance and contribute to the teams core analysis and modeling systems and librariesPresent and communicate results to stakeholders across the companyIdentify new opportunities to leverage data to improve Gustos products and help our businessHeres what we're looking for:At least 5 years experience conducting statistical analyses on large datasets, ideally in a business context (can supplement with academic experience where appropriate)Experience applying a variety of statistical and modeling techniques using Python, R or another statistical modeling language, as indicated by familiarity with many of the following techniques - generalized linear modeling, regularization, ensemble models (e.g., random forest, gradient boosting), Bayesian analysis methodsStrong programming skills - comfortable with all phases of the data science development process, from initial analysis and model development all the way through to deploymentExcellent communication skills - able to effectively deliver findings and recommendations to non-technical stakeholders in a clear and compelling fashionPhD or Masters plus equivalent experience in a quantitative fieldExperience applying predictive modeling to growth problems is a plusAbout Gusto Our customers come from all walks of life and so do we. We hire people from a wide variety of backgrounds, not just because its the right thing to do, but because it makes our company stronger. If you share our values and our enthusiasm for small businesses, you will find a home at Gusto.  Gustos mission is to create a world where work empowers a better life. By making complicated, impersonal business tasks simple and personal, Gusto is reimagining HR, payroll, and benefits for over 60,000 companies nationwide. Gusto has offices in San Francisco and Denver and the companys investors include Google Capital, General Catalyst, Kleiner Perkins Caufield & Byers, as well as the founders of Instagram, Stripe, Nest, PayPal, Yelp, Dropbox, and Eventbrite, among others."}