{"jobID": "2766867243", "jobLocation": "Monroe_MI", "jobTitle": "Global Commodity Manager", "companyRating": "3.1", "companyInfo": {"Website": "www.tenneco.com", "Headquarters": "Lake Forest, IL", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (TEN) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": " The Global Commodity Manager is responsible for managing supplier relationships and developing global strategies across specific commodities to achieve the best value for Tenneco. This person will lead global cross-functional commodity teams to implement strategies, and will provide guidance to a global group (4-6) of commodity buyers, located in different locations and regions, working in related commodities. Duties and Responsibilities:Develop in-depth commodity expertise; implement global commodity strategies for area of responsibility.Manage commodity savings and strategies for areas of responsibility.Scope is global and across business unitsDrive activity to identify and source low cost country suppliers.Prepare, present and negotiate proposals and long term commercial agreements in collaboration with exec. /commodity director.Drive improvement in BOS metrics (quality, delivery, service and cost) for specific commodities.Champion cross-functional VA/VE and TVM activity between Tenneco and suppliers.Ensure team and suppliers comply with Global Purchasing policies and procedures.Negotiate regional and global contracts.Leads by example in terms of focus on detail, execution of tasks and professional interaction with both internal and external contacts.Can analyze and define need for action and drive accountability with regard to supplier launch.Aggressively pursues objectives and tasks.Responsible to ensure buyers achieve commercial and timing objectivesResponsible to ensure team is aligned with department and corporate goals, objectives and values.Explore and exploit opportunities within the supply base to support Tenneco business objectives.Ability to assess issues and develop action plans to bring quick and effective resolution.Special projects as assigned by Global Purchasing leadership.Willingness to travel as required; approximately 25 %.Required SkillsRequired ExperienceMinimum 5 years of related work experience required, in a Purchasing environment in the industry.Preferred Qualifications and Competencies:Master degree in business technical disciplineAutomotive preferred.Solid negotiation skills & experience.Leadership capabilities over cross-functional teams, strong managerial skills.Corporate SCM experience with international business desired (LCC preferred.)Good coaching skills and able to make decisions.Strong verbal and written communication skillsExcellent negotiation skills and proven success working under pressure driving projects to closure.Strong ability to analyze financial and technical data.Excellent presentation skills.Familiarity with drawings, specifications, materials and manufacturing processes.Language skills: English: oral and written. Dutch is an asset.Self-directed with the ability to work with all levels of the organization within multiple cross-functional areas.Solid computer, communication and organizational skills.Strong communication skills; ability to drive results while maintaining smooth, constructive interactions on all levels. Job Location  Monroe, US-MI "}