{"jobID": "2759581613", "jobLocation": "Livonia_MI", "jobTitle": "Teller I or II", "companyRating": null, "companyInfo": {"Website": "www.lmcu.org", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1933", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Fifth Third, Consumers Credit Union (Michigan), Macatawa Bank"}, "estimatedSalary": null, "jobDescription": " Lake Michigan Credit Union is one of the largest financial institutions in Michigan and was established in 1933. We are seeking customer-oriented individuals to join our team and help ensure our 5 Star Promise is carried out.  As an employee, you'll enjoy a stimulating, professional atmosphere, supported by the latest technology and training. You will be encouraged to refine your existing skills in an environment of empowerment, gain new experiences, and progress to the limits of your own motivation.  Lake Michigan Credit Union is looking for a dedicated individual to join one of our branches as a Teller I or II. Demonstrating efficiency with financial transactions for checking, savings and borrowing members; receives funds, posts transactions and pays out funds as requested. Verbally confirming intended transactions with members to assure needs are met and minimizing redoing.Balancing cash drawer daily to assure accuracy in transactions and notifies supervisor regarding any outages.Receiving payments and savings deposits from members, addressing inquiries on accounts, recording amounts and dates of payments and other significant information, checks member calculations and validates check and/or counts cash payments.Researching, troubleshooting and resolving member and internal inquiries regarding policies, practices and products.Issuing money orders, receiving currency for coin and verifies amounts, processes the redemption of bonds, cashes checks according to written procedures.Complying with all company policies and procedures, applicable laws and regulations, including but not limited to, the Bank Secrecy Act, the Patriot Act, and the Office of Foreign Assets Control.Teller candidates should be able to work 3 full days (open to close) during the week with Friday being required.Additionally, candidates should be available to work Saturday rotations.Cash handling and customer service experience is strongly preferred.Detail Oriented.Excellent written and verbal communication skills."}