{"jobID": "2737338365", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Analytics - Monetization: Ads Quality and Delivery", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.  There are over 170 million businesses on Facebook ranging from large global organizations to small local businesses. As Facebook continues to grow and connect people, having a platform that allows businesses to connect meaningfully to their customers matters more now than ever. The Core App Monetization (CAM) team builds the world's best, innovative monetization experiences that people, creators and advertisers love. Our team lives at the intersection of people and businesses. Our team determines how to blend the budgets of advertisers with the eyeballs of our users in a way that ensures the long-term value of Facebook. It is critical that we make decisions about how many ads to show, which ads to show, where and when to show them; all while optimizing for the experience of users and delivering high quality ads. Join us to lead the data science efforts on ads quality and delivery, learning and building upon Facebook's rich data, and having a significant impact on Facebooks business. An ideal fit for this role is a Data Scientist with extensive domain knowledge of auction theory and/or its implementation, a basic knowledge of machine learning/modeling experience, and a strong what is under the hood? thinking and craving for opening black boxes. Responsibilities:"}