{"jobID": "2764156921", "jobLocation": "Bethesda_MD", "jobTitle": "Senior Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.hjf.org", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 1983", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "66000", "jobDescription": "Updated: TodayJob ID: 213904Status: Full-TimeRegular/Temporary: RegularLocation: Bethesda, MD, United StatesJoin the HJF Team! HJF is seeking a Senior Data Analyst to support the Preventive Medicine and Biometrics (PMB) Department located at the Uniformed Services University (USU) in Bethesda, Maryland. Provides routine and non-routine statistical/analytical support for the department/division to enhance operating efficiency; exercises independent judgment in the resolution of analytical problems.  Responsibilities:  Designs and manages numerous research projects simultaneously. Maintains research databases, ensuring accuracy and completeness. Links and merges datasets to create larger datasets for projects. Performs data manipulations and statistical analyses using SAS, STATA, r, Python, or a similar statistical software tool. Writes reports and scientific manuscripts for peer-reviewed professional journals. Reviews and remains current with technical and scientific literature in military-relevant areas of epidemiology and biostatistics. Conducts complex analytical and statistical work using appropriate statistical techniques, including multivariate logistic and linear modeling as well as Cox proportional hazard modeling. Understands and performs cost modeling. Reviews and summarizes scientific literature and uses this knowledge to write reports. Collaborates and communicates with team members and external collaborators. May direct work assignments. May assist in training and/or mentoring of lower level staff/students. Prepares and presents informal and formal briefings at various international, national, and military activities. Reviews and assesses the work of other professionals in own field. Contributes to the team effort by accomplishing related duties as needed.Required Knowledge, Skills, and Abilities: Intermediate knowledge of epidemiology. Knowledge of basic disease etiologies and preventive strategies. Intermediate knowledge of survey methods and basic statistics used to collect and interpret data. Advanced skill in use of word processing, spreadsheet, graphic, email, database, and statistical software. Advanced skill in writing memorandums, correspondence, abstracts, articles, and proposals. Ability to plan and prioritize work. May require the ability to supervise and direct work assignments. Ability to make presentation to groups. Ability to be a self-starter and work independently. Ability to interface with investigators, vendors, research staff, and study participants. Ability to communicate effectively and professionally with team members and external collaborators.Minimum Education/Training Requirements: This position requires an advanced college degree in Statistics, Economics (focus in econometrics), Public Health or related field Minimum Experience: 4-6 years related experience. A PhD is one of the above fields can be used as a substitute for experience, determined by the supervisor. Physical Capabilities: Walking, standing, must be able to read reports, labels and use computer, must be able to hear well enough to communicate with coworkers, must be able to write, type, and use phone system. Clearance: If a security clearance is not active upon hire, the candidate must be able to obtain a security clearance of secret for this position. Candidates will access DoD databases that have classified information. U.S. Citizenship is required. Work Environment: Normal office working conditions. HJF is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer."}