{"jobID": "2791365638", "jobLocation": "Sunnyvale_CA", "jobTitle": "Data Engineer/Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "123000", "jobDescription": " The Yahoo Gemini marketplace empowers advertisers with insightful data, brand-safe premium content and advanced technologies to deliver engaging search and native advertising campaigns that drive results.A Lot About YouYou get people. You have a unique blend of skills in developing deep consumer insights and competitive intelligence through data that drives product innovation to create the right experiences for people's daily lives that achieve our goals to acquire, engage, and retain them.You get data. You have a thirst for knowledge and insight. You thrive and strive to present data in ways that product, design, engineering, marketing, and executive teams understand and act upon. Your data is 100% accurate and credible. Your reports are always clear and actionable.You get growth. You are a consumer-focused, data-driven, and growth-enabling analyst who has supported Growth strategies, roadmaps, scrums, and final product rollouts, across the analytics/insights, acquisition/referrals, activation/onboarding, and adoption/retention loop.You get mobile/digital. You have significant industry experience - and a strong understanding of the mobile/digital ecosystem - from apps to advertising and analytics. You have successfully applied the latest mobile/digital tools to help drive reach, retention, and revenue growth.You get it done. You have successfully worked with product, design, engineering, marketing, and executive teams to understand requirements, translate business needs into data requests, develop methodologies/plans, analyze data, and present findings that are embraced/enacted.Your DayUnderstand the marketplace trends and help answer revenue trendsAnalyze supply as well as demand patterns and find revenue opportunities, explain model behaviors, suggest improvements etc.Gain insights on what drives performance in terms of reach and revenue growthCreate dashboards and reports that provide analysis and commentary, explaining product, sales, and business trends for Executive reportingWork closely with product and inform and update stakeholders on product performance, plans, and progress towards metricsDefine data testing plans and create methodologies that help teams to iterate fast and release new features for testing and, if successful, rollout to all users globallyGenerate and go deep on consumer insights and competitive intelligence to help teams drive product innovation and iterationBuild strong partnerships with product, sales, engineering, and marketing teams and enable them to launch new Growth initiatives for testing/iterationProvide feedback to product, sales and engineering teams on impact of product launches: target launch metrics, A|B testing, post-launch metricsInvestigate data and monitor data quality - partner closely with and provide requirements to the Data Engineering teams that can be clearly acted uponFrame business problems into questions that can be answered through data analysis, and translate business needs into requirementsYou Must HaveBS/MS in highly-quantitative field (Analytics, Computer Science, Mathematics) is preferredData analysis, generating insights for consumer-focused productsB2B or advertising experience is a mustExperience with big data technologies such as Hive, Hadoop, MapReduce, Spark, PIG etc.Experience with scripting programming languages such as Perl/Python is good to haveFamiliarity with Unix/Linux environment highly recommendedSignificant experience, proficiency in, and passion for Mobile and/or Web productsTrack record of proactively establishing and following through on commitmentsDemonstrated use of analytics, metrics, and benchmarking to drive decisionsExcellent interpersonal, organizational, creative, and communications skillsTeam player in driving growth results combined with a positive attitudeStrong work ethic and strong core values (honesty, integrity, creativity)Problem solver who never stops thinking about ways to improve Oath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process.  Currently work for Oath? Please apply on our internal career site."}