{"jobID": "2811794020", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.caymanchem.com", "Headquarters": "Ann Arbor, MI", "Size": "201 to 500 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": " Cayman Chemical Company is a biomedical research company based in Ann Arbor, Michigan. Cayman helps make research possible by supplying scientists worldwide with biochemical tools used to understand cancer, neurochemistry, oxidative injury, endocrinology, atherosclerosis, and other human health challenges. We specialize in assay kits for the measurement of hormones and bio-markers. In addition, Cayman offers a broad range of specialty biochemicals used as research reagents and qualified standards. Cayman performs generic drug development and production in both Ann Arbor, Michigan and Neratovice, Czech Republic.  We are currently seeking candidates for a Scientist with the key duties and skills listed below: Duties and Responsibilities:Consistently comply with and promote all Cayman values, policies, SOPs, and regulations.Independently carry out complex organic syntheses, purifications, and characterizations of new and existing compounds in Cayman’s signature product lines with a focus on polar lipids.Suggest improvements to existing procedures/techniques as needed.Research the literature.Keep current with topics relevant to the projects of the Department. Keyword articles as needed.Prepare weekly reports and/or presentations.Assist in general upkeep of the labs and maintenance of laboratory equipment.Work on several concurrent projects.May prepare scientific papers for publication and/or presentation.May attend and report on scientific conferences.May supervise interns.BS in Chemistry/relevant field + 8 years relevant experience, or MS in Chemistry/relevant field + 5 years, or PhD in Chemistry/relevant fieldDemonstrable understanding of organic reaction mechanisms & retrosynthetic analysisGood organizational skills/able to multtaskStrong attention to detailEffective writing and oral communication skillsSkill, precision, and independence in planning & performing diverse organic reactions.High proficiency with thin layer chromatographyHigh proficiency with column chromatography, recrystallization, and other purification methodsHigh proficiency with relevant, advanced 1H- and 13C-NMR methodsWillingness to learn and assist in common lab job dutiesFunctional knowledge of ChemDraw and Microsoft OfficeAble to think critically, analyze complex data, perform under pressure to meet deadlinesDemonstrable leadership qualities necessary for effective mentorship of Assistant Scientist-level colleagues"}