{"jobID": "2707885633", "jobLocation": "Chicago_IL", "jobTitle": "Optimization Scientist", "companyRating": null, "companyInfo": {"Website": "www.8451.com", "Headquarters": "Cincinnati, OH", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Research Scientist will employ skills and experience to improve, create and innovate using data and complex analytics to solve current complex business problems while anticipating and charting future research needs. The role has strong research, project collaboration, and computational components. This research scientist will create new methods of solution through a combination of foundational research and collaboration with ongoing initiatives within 84.51.General DescriptionThe Research Scientist will employ skills and experience to improve, create and innovate for our price and promotion optimization solutions, while anticipating and charting future research needs. The role has both strong research and computational components.SpecificsThe Research Scientist will create solutions in areas of importance to 8451, including, but not limited to: Optimization, both continuous and discretePrice, promotion, and assortment optimizationOptimization under uncertaintyPrice games, as applied to fuel, revenue management, and markdownAllocation and logistical optimizationDemand forecastingModel parameterization, training, and validation Project responsibilities run from requirement formulation, literature exploration, selection of method of solution, creation and prototype of solution, and working closely with other Scientific Researchers, Scientific Developers, and Software Engineers to productionize the solution.Qualifying Experience & SkillsTypical Research Skills and Experience IncludeExpertise in continuous and discrete optimization techniques.Experience with pricing, pricing games, and prediction as applied to consumer goods, fuel, revenue management, and markdown.Experience in demand modeling and demand model parameterization and tuning.Appreciation of computational/efficiency considerations in designing methods of solution.Expertise in formulating and solving discrete, continuous, and stochastic optimization problems.Experience in supply chain optimization.Experience designing and conducting statistical measurements.Solid background researching statistical machine learning methods, especially forecasting, supervised learning, classification and classification trees, Bayesian methods.Application of machine learning techniques to regression, classification, prediction, and clustering.to problems that arise in retail, manufacturing, and market science.Desired Computation Skills IncludeC++ development or prototyping expertise.Experience with a Unix/Linux and .NET environments.Experience with R.Experience with multi-threaded and parallel algorithm design.Ability to create computationally efficient solutions, applying techniques from statistics, machine learning, and optimization (continuous or discrete).Experience with Big Data concepts, tools and architecture.Experience with methods on transaction data and near real-time solutionsEducationThe successful candidate will have a PhD in computer science, computer engineering, mathematics and statistics, operations research, or related subject; and/or extensive work or other experience demonstrating expertise utilizing these skills. Alternative education with extensive experience demonstrating track record with R&D; projects will be considered.  84.51° is an Equal Opportunity Employer."}