{"jobID": "2706261897", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Analyst", "companyRating": "5.0", "companyInfo": {"Website": "www.updater.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Public", "Industry": " Real Estate", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "92000", "jobDescription": "Does uncovering hidden insights in data give you life? Do you often find yourself saying but was the difference statistically significant?, even to your friends? Isr/dataisbeautiful one of your favorite subreddits? Then we want to meet you. Updaters Data team is a new function made up of Analytics and Data Engineering, working together with a mandate to use data to improve business outcomes and to make Updater a data-driven company. Partnering with teams across the organization, Data enriches customer experience and helps develop new products, drives strategy and discovers insights, evangelizes data-driven decision-making, and facilitates data access and education, all to achieve Updaters vision of being the leading platform for the relocation industry.  As the Senior Data Analyst, youll be on the front lines working with stakeholders across the organization to perform analysis, make business recommendations, build reports, provide data education, and build data-based logic into our products. If you love getting up to your ears in data and arent satisfied until a project is driven to meaningful impact, we want to work with you! Example ProjectsPartner with our Product team to define in-product recommendation engine logic.Collaborate with our SVP of Strategy & BizDev to demonstrate the value of our mover information to potential business partners and drive significant revenue.Work with other Data team members to choose and build-out the model for a BI tool, facilitating data access for team members across Updater.Partner with our Success and Engineering teams to build a data quality anomaly detection system to help keep our data clean and maximize one of Updaters company-wide KPIs.What You Have3+ years experience as an analyst in a fast-paced work environment; proven ability to drive material business impact through analytics.Empathy: you strive to see the world from your customers point of view in order to anticipate their needs.Humility: you have an opinion, but arent afraid to be proven wrong, and are open to suggestions on what tool or technique is best to most efficiently solve a problem.Strong communication: youre as comfortable talking with our SVP of Strategy & BizDev as you are with our Director of API Engineering.Comfortable with ambiguity: youre used to being asked open-ended questions and whittling them down to questions that can be answered by hard data.Expert SQL & Python skills.Practical knowledge of statistics.Experience with modern BI tools (Looker, Periscope, Mode, etc).Bonus Points ForExperience setting up and administering a BI tool.Experience implementing a data education program.Experience building and selling a data product.A month at Updater might include:Rotating office DJ dutiesCatered Monday breakfasts, Friday lunches, and rip-roaring happy hoursAwesome off-site activities, like zombie laser tag and Escape the Room (just to name a few!)Cross-functional collaboration with the entire teamGroup outings to NYC Meetup eventsCompensation & Benefits: We're looking for top-tier talent, and we offer compensation packages that include competitive base salary & stock options. Our comprehensive benefits programs include health care, dental, transportation subsidies, and Flexible Paid Time Off (PTO). About Updater: Updater makes moving easier for the 17 million households that relocate every year in the US. With Updater, users seamlessly transfer utilities, update accounts and records, forward mail, and much more. Hundreds of the most prominent real estate companies in the US (from real estate brokerages to multifamily and relocation companies) rely on Updaters real estate products to save clients hours with a branded and personalized Updater moving experience.  Headquartered in New York City, Updater has raised nearly $100 million from leading investors, including SoftBank Capital, IA Ventures, Commerce Ventures, Second Century Ventures (the strategic investment arm of the National Association of Realtors®), and more. Updater ranked #3 on Crain's 2016 Best Places to Work in NYC, ranking as the highest rated tech company on the list. For more information, please visit www.updater.com.  Updater is proud to be an equal opportunity employer and will consider all qualified applicants regardless of color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or family status, disability, gender identity or expression, veteran status, actual or presumed belonging to an ethnic group, or any other legally protected status. If you have a disability or special need that requires accommodation, please let us know."}