{"jobID": "2816423125", "jobLocation": "Glendale_CA", "jobTitle": "DataFlux Data Quality & Governance Analyst (Los Angeles)", "companyRating": null, "companyInfo": {"Website": "www.genuent.net", "Headquarters": "Houston, TX", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " DataFlux Data Quality & Governance Analyst (Los Angeles)  NO C2C - We are unable to sponsor or work C2C  US Citizens or those authorized to work in the US ONLY  Financial Services  Support data governance and play a role in all necessary aspects of project initiatives within the Data Management Department. This position requires technical, business, and analytical skills to assist in data quality monitoring & measuring, root cause analysis, logical design, testing, reporting, and requirement gathering. For the build-out of the Data Governance Program, the incumbent will be required to help promote data accountability, write technical data quality rules, monitor data quality results through an executive Data Quality Scorecard, coordinate and perform data remediation across the Americas, and coordinate and define data definitions (Metadata) starting with Key Data Elements across Business Lines.  5+ years of programming experience • 5+ years of experience in a financial services organization, Data Warehousing, Reporting, Data Governance, or Programming • Strong technical proficiency in Informatica IDQ, Excel VBA • Advanced SQL skills required: querying, tuning, designing • Experience with JIRA is a plus • Hands-on support with semi-technical tools, i.e. Access, Advanced Excel • Able to coordinate with both business and technology, ability to understand the details and suggest best practice solutions • Knowledge of banking products • Experience in Risk Management or understanding the concept • Familiar with Data Governance and Data Quality control process • Data analysis and Root Cause Analysis • Familiarity with key regulatory requirements that affect how data is generated, manipulated, recorded and reported (SOX, BIS II etc.) is a plus • Understanding of operations, technology, and SDLC • Self-starter and independent learner • Articulate, good verbal and written communication skills, experience preparing and leading presentations • Detail-oriented with superior time management abilities • Experience in project work, analysis, and planning. They will need to have some project experience, developers/testers for these projects, and may need to work with Shareholders. Therefore, they will need to be able to communicate well. The projects are for our compliance team, so background with compliance stakeholders would be helpful.  Qualified candidates please send your updated resume to kjoy@genuent.com for further review."}