{"jobID": "2375538803", "jobLocation": "San_Francisco_CA", "jobTitle": "Staff Software Engineer, Analytics (Front End)", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "144000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation. Staff Software Engineer, Analytics (Front End)San Francisco, CA PlayStation has an immediate opening for a world-class software engineer to join our User Experience Analytics team and help deliver the next generation of analytics infrastructure that will monitor metrics from millions of users around the world. We are fun, diverse group of people passionate about creating the best place to play. We are looking for people who are passionate about visualization of telemetry data, modern software tools/paradigms and are focused on continual improvement in the delivery of high quality web applications for PlayStation customers. This is an opportunity to be part of one of the worlds most recognizable brands and see your work impact millions. We are located in San Francisco's vibrant SOMA district, within walking distance to great restaurants, museums and nightlife. Responsibilities:Architect and develop core analytics infrastructure for SIE client applications running on PlayStation consoles, web browsers, mobile devices, streaming media players and future flagship Sony devicesEnable SIE teams to gain greater insight into PlayStation user experience by measuring behavior, quality and performance in an efficient manner.Build tools and dashboards for SIE teams to visualize and investigate the data we collectAs a part of client architecture and infrastructure team apply software architecture best practices through active development of common service libraries consumed by all web application clients within SIEPartner and support a variety of teams within SIE from application development scrum teams, to product and business teams to BI and analytics teamsDefine and evangelize best practices to capture, visualize and report analytics dataWrite documentation and guides for SIE teams to learn how to leverage the analytics stackRequired qualifications:Bachelors degree in Computer Science or equivalent, 4+ years of relevant work experience in lieu of a degreeAt least 4 years of Software Development experienceExpert JavaScript, HTML/CSS skillsExperience working with medium to large scale code basesExperience with visualization frameworks such as D3Experience building shared libraries for web applicationsPreferred qualifications:Experience measuring analytics in web applicationsExperience in performance tuning network connected applicationsExperience using Python/R for data analysis Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.  We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.  We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.  #LI-LF1"}