{"jobID": "2827045593", "jobLocation": "Chicago_IL", "jobTitle": "Clinical Data Analyst - Hospital Inpatient Coder - Registry", "companyRating": "3.7", "companyInfo": {"Website": "www.uchospitals.edu", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": "Clinical Data Analyst – Hospital Inpatient Coder Job, the Health Information Management department, Registry - PRN, Days, University of Chicago Medicine in Hyde Park, Chicago, IL We're hiring a Clinical Data Analyst - Coderfor the Health Information Management department for a Registry - PRN, Days shift for the University of Chicago Medicine in Hyde Park, Chicago, IL. Note: Our Registry staff are expected to work 10 hours per week.  Join one of the nation’s most comprehensive academic medical centers, University of Chicago Medicine, in a detail-driven and influential role as the Clinical Data Analyst - Coder. Our employees deliver world-class care in an environment where opinions are respected, decision-making is rewarded and teamwork is the order of the day. Our staff is encouraged to achieve their career goals, which in turn benefits all of our patients and the University of Chicago Medicine as a whole.  In this role, under the general direction of management, the Clinical Data Analyst is responsible for coding and abstracting diagnoses and procedures from inpatient and outpatient medical records for optimal and timely reimbursement and quality reporting. Clinical Data Analyst - Hospital Inpatient Coder Education and Experience Requirements:Associate's or Bachelor's degree from an accredited academic body is required.Must have skill in prioritizing and performing a variety of duties within a system that has frequently changing assignments, priorities and deadlines.Good verbal and written communication skills are required.The ability to impart knowledge of procedures and techniques is required.Must have a thorough working knowledge of ICD-10CM/PCS and CPT coding systems, DRG systems and federal/state regulations regarding reimbursement.Must have a thorough working knowledge of the hospital information system, electronic medical record systems and encoder.Must have a working knowledge of JCAHO standards for chart completion.Must have a working knowledge of medical-legal rules and regulations that govern the confidentiality and release of medical information with the ability to interpret and implement the standards.Must maintain total confidentiality of all patient records.Computer experience is required.We’ve been at the forefront of medicine since 1899. We provide superior healthcare with compassion, always mindful that each patient is a person, an individual. To accomplish this, we need employees with passion, talent and commitment… with patients and with each other. We’re in this together: working to advance medical innovation, serve the health needs of the community, and move our collective knowledge forward. If you’d like to add enriching human life to your profile, The University of Chicago Medicine is for you. Here at the forefront, we’re doing work that really matters. Join us. Bring your passion.________Bring your career to the next level at a hospital that is thriving; from patient satisfaction to employee engagement, we are at the Forefront of Medicine. Take advantage of all we have to offer and #BringYourPassiontotheForefront,University of Chicago Medicine is growing; discover how you can be a part of this pursuit of excellence at: www.uchospitals.edu/jobsThe University of Chicago Medical Center is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, ethnicity, ancestry, sex, sexual orientation, gender identity, marital status, civil union status, parental status, religion, national origin, age, disability, veteran status and other legally protected characteristics."}