{"jobID": "2822687623", "jobLocation": "Newark_NJ", "jobTitle": "Principal Scientist, Algorithms & Analytics (Edgewood or", "companyRating": null, "companyInfo": {"Website": "www.smithsdetection.com", "Headquarters": "HEMEL HEMPSTEAD, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Rapiscan Systems"}, "estimatedSalary": null, "jobDescription": "Job Description Senior expert who will own advanced analytical SW and algorithm development for all SDI systems; leads early stage, feasibility studies (pre-Technology Readiness Level 6); leader in communicating S&T; vision to stakeholders. Responsible for advancing the detection algorithm capabilities of Smiths Detection. Works to develop advanced software algorithms for detection systems to meet requirements of key customers.  Duties & Responsibilities Manage the development of threat and anomaly detection algorithms for various imaging-based detection systems.Collect sample images, library data, and technical information to support algorithm development projectsLead U.S.-based testing and development of detection systems including executing test plans and experimentsEnsure successful test and development efforts including hands-on installation, diagnosis, and test support of demonstration systems in support of laboratory and field testing activities coordinating with R&D; and service personnelLeads technical interchanges with internal and customer R&D; personnel, and understanding and advancing the detection algorithm capabilities of Smiths Detection.Contribute to multiple efforts or programs providing leadership of on-site or external colleagues as requiredCoordinate and interface with the Digital Forge enterpriseComply with and ensure department compliance with Company health, safety and environmental policies.Other duties as required. The Individual Education/Training:Advanced Degree or Equivalent Experience in an appropriate technical field (Engineering, Physics, Mathematics, Medical Imaging, or Computer Science)Experience:Five or more years experience in developing computer algorithms, mathematics, physics, or related discipline. Experience with security imaging or detection products desired. Experience in related field (e.g. medical imaging) will be considered.Able to prepare reports, briefings, technical proposals, cost proposals, project plans, and financial tracking for various effortsKnowledge/Skills:Proficiency in Microsoft Word, Excel, PowerPoint, and Project. Experience with Linux/Unix OS, Matlab, Mathematica, C/C++ or similar programs desired. Project management / leadership experience a plus.Supervisory Responsibilities:Demonstrated ability to lead small, interdisciplinary project teamsSecurity:The candidate must possess or be able to successfully obtain a US Security Clearance at the SECRET levelPhysical/mental requirements:Ability to solve complex practical problemsAbility to conceive and drive \"fast fail\" projects with emerging technologiesAbility to interpret a variety of instructions furnished in written, oral, diagram, or schedule formAbility to work effectively under pressure to meet deadlinesAbility to represent the company in a range of venues, including technical conferences, national laboratories, and test venuesAbility to compose and edit high-quality technical documentation, correspondence, and literatureAbility to elicit and manage contributions from various technical colleagues at different sites and locations including overseas travel when necessaryAbility to work independently with a minimal amount of supervision including strategic decision making to ensure successWork environment: The individual will spend much of their time in the office area, where the noise level is low. The ability to tSDL2017"}