{"jobID": "2757596814", "jobLocation": "N_o_n_e", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.murphyoilcorp.com", "Headquarters": "El Dorado, AR", "Size": "1001 to 5000 employees", "Founded": " 1907", "Type": " Company - Public (MUR) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Marathon Oil, Anadarko Petroleum, TOTAL"}, "estimatedSalary": null, "jobDescription": " At Murphy Oil Corporation, we believe the rich experiences and backgrounds of our employees strengthen our Company, create a productive workforce, and drive our success. We encourage you to apply for the positions for which you meet the qualifications. Work Schedule: USA - 9 hrs / day - 4 hrs on Fri Company: Murphy Expl & Prod Co - USA Division: Onshore Operations Worksite: Houston - 0329 Location: Houston, Texas  Murphy US Onshore Operations is looking for a Data Scientist to support various teams like drilling, completions, production and so on to gain insights from analyzing data from external and internal datasets. The ideal candidate would be a problem solver who can analyze data, identify problems, develop and improve workflows, automate processes and lead the business units to make data driven decisions. The right candidate would be passionate about finding solutions hidden in large datasets and working with stakeholders to improve business results. Responsibilities Perform data mining, cleansing, and manipulation; identify necessary data elements and their sources, leverage appropriate tools to acquire and consolidate large volumes of data from different sources, and identify and resolve any irrelevant, corrupt, missing, or incongruent dataIdentify and use appropriate technologies and platform to execute analytics against business requirements, including the ability to scale, deploy and distribute models across enterprise as neededSupport the development of business cases for new solutions, with in-depth analysis of the challenge being addressed, the cost of the solution and projected business impactSupport the development of performance management scorecards and dashboards to monitor adoption, implementation and impact of price and cost strategiesCollaborate with cross-functional teams to frame requirements within an analytics context to tackle business goalsResearch and develop statistical learning models for data analysisCollaborate with product management and engineering departments to understand company needs and devise possible solutionsImplement new statistical or other mathematical methodologies as needed for specific models or analysisOptimize joint development efforts through appropriate database use and project design Minimum Requirements Master’s Degree in a quantitative field such as Computer Science, Statistics, Mathematics or another quantitative field with at least 3 years of professional industry experience as Data Scientist OR PHD in in a quantitative field such as Computer Science, Statistics, Mathematics or another quantitative field Skills Proficiency with several programming languages such as C, C++, Java, JavaScript, Perl.Experience querying databases and using statistical computer languages: R, Python, SQL, MapR, HadoopData visualization experience in Matplotlib, Spotfire, ggplot2 or a similar tool.Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.Experience with machine-learning algorithms including decision trees, probability networks, association rules, clustering, regression, and neural networksExperience with distributed data/computing tools: Map/Reduce, Hadoop, Hive, Spark, Gurobi, MySQL, etc Murphy Oil Corporation participates in the Department of Homeland Security U.S. Citizenship and Immigration Services' E-Verify program. Please read the E-Verify Notice-English / E-Verify Notice-Spanish and Right to Work Notice before proceeding with your job application.  For additional information, you may also visit the USCIS website.  Murphy Oil Corporation is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, genetic information, age, national origin, sexual orientation, disability, protected veteran status or any other category protected by federal, state or local law.  EEO is the Law Poster  EEO is the Law Supplement"}