{"jobID": "2632013738", "jobLocation": "Azusa_CA", "jobTitle": "Data Analyst - Undergraduate Student Financial Services", "companyRating": "3.9", "companyInfo": {"Website": "www.apu.edu", "Headquarters": "Azusa, CA", "Size": "1001 to 5000 employees", "Founded": " 1899", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": " APU is seeking employees who desire to engage in our thriving culture by cultivating community through professional interactions, demonstrating a posture of lifelong learning, and modeling Christ-like character. Working together, employees at APU commit to establishing a university atmosphere that is pleasing to God and edifying to one another.  The person in this position is responsible for the configuration and day-to-day management of the Financial Aid module within the PeopleSoft data system. This data expert understands the configuration, regular use, and data of the PeopleSoft module and interfaces between business, data, and technical resources. The Data Analyst writes departmental queries, letters, and reports as appropriate with the escalated assistance of EDM or Associate Director. In addition, this position sets standards for use of software in the unit and serves as the liaison between the department and the EDM Enterprise Applications Engineer when technical issues need escalation. This position is tier one technical and systems support for Undergraduate Financial Aid, and troubleshoots, researches, and proposes solutions for any systems issues that are reported before escalating to the EDM Enterprise Applications Engineer if necessary. It will also require working alongside the project manager or providing project management for new initiatives and projects. Required EducationBachelor’s degree or equivalent work experience required.Required Experience1-3 years experience configuring, working in, or managing a Data System.Experience putting together intermediate to complex spreadsheets with formulas and macros.Proven experience in critical thinking and problem solving skillsThe following are preferred but not required – Training will be providedExperience with Financial AidExperience with PeopleSoft Campus SolutionsExperience working in higher educationBasic understanding of SQLPrimary DutiesTechnical liaison and support for Financial Aid department. Works with the Enterprise Applications Engineer in EDM to coordinate all technical issues.Responsible for configuration of Financial Aid data module. Coordinates configuration updates and changes for each academic year.Creates and runs queries, develops letter merge processes, analyzes data, and audits business processes as needed by staff.Participates in process to fix a break when it occurs in the module.Oversees file processing between departments and outside agencies.Works with EDM to coordinate and test periodic patches and bundles to the PeopleSoft system.Trains staff within Financial Aid module to use functionality of specific module software and researches improving software processes.Maintains training and procedure manuals.Other duties as assigned.SkillsExcellent problem solving and critical thinking skillsAdvanced Excel spreadsheet skills.Understanding of Relational DatabasesComputer and word-processing skills.Ability to communicate effectively with internal and external professionals at all levels.Able to handle multiple tasks and responsibilities with minimal supervision.Strong interpersonal, collaborative, and organizational skills.Detail oriented.Ability to understand complex databases with a large number of tables.Ability to use data reporting software.Mental DemandsAbility to use sound analytical judgment when troubleshooting and solving financial aid system issue.Ability to work under pressure with a high degree of initiative, good judgment, priority setting and decision-making.Be in agreement with the purpose and goals of Azusa Pacific University in providing a Christian-based higher education for its students.Able to analyze, calculate and interpret complex statistical reports.Ability to define problems, collect data, establish facts, and draw valid conclusions.Ability to counsel and provide customer service to employees.Able to strategize, develop and manage projects and programs.Able to work under pressure and meet deadlines.Physical DemandsTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily.Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to sit and talk or hear.The employee is occasionally required to walk, and use hands to finger, handle, or feel objects, and computer keyboard.Visual DemandsComputer monitor and reading.EnvironmentPleasant office setting, comfortable temperature.OpportunitiesMake a difference in the lives of college studentsGrow in your professional data skillsPossibility of advancement for outstanding hiresCompensation Grade 9: $23.58 - $30.65 hourly  Azusa Pacific University is a Christ-centered, multicultural community that values and seeks faculty and staff who are committed to diversity, work effectively with diverse populations, and engage others in ways that honor our rich cultural mosaic and biblical foundation.  Click below to discover some of the many benefits APU employees enjoy including competitive health care options, an 8% retirement match, and a generous tuition discount.  http://www.apu.edu/humanresources/benefits/  You can learn more about APU by watching the stories of faculty, staff, and alumni as they carry out our mission here: http://www.apu.edu/stories/  Azusa Pacific University will conduct a background check on all final candidates.  Review of applications will begin immediately, and the position will remain open until filled unless otherwise stated. Azusa Pacific University does not discriminate on the basis of race, color, national origin, sex, age, disability, or status as a veteran in any of its policies, practices, or procedures. Women and minorities are encouraged to apply.Required Skills Required Experience Job Location  Azusa, US-CA "}