{"jobID": "2783190850", "jobLocation": "Menlo_Park_CA", "jobTitle": "Staff Scientist- Associate", "companyRating": null, "companyInfo": {"Website": "www.slac.stanford.edu", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1962", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Back to Search ResultsSLAC National Accelerator Laboratory is one of 17 Department of Energy (DOE) National Laboratories, and operated by Stanford University on behalf of the DOE. SLAC develops and operates some of the world’s premier science facilities, including the first hard X-ray free-electron laser. Research at SLAC explores the structure and function of matter and the properties of energy, space and time, at the smallest and largest scales, all with the goal of solving problems facing society and advancing human knowledge. Staff Scientist- Associate Job Requisition #: 3215 Classification Title: Staff Scientist- Associate Grade: NA Location: Menlo Park, CA (HQ) # of openings: 1 DescriptionPOSITION OVERVIEW: The Grid Integration Systems, and Mobility Group at SLAC is currently seeking an associate staff scientist to lead research efforts in vehicle-to-grid and mobility studies. The candidate is expected to bring strong expertise in computer science, machine learning, software development and programming.  The candidate will lead engineering and scientific research, and is expected to support the development of data-driven methods to facilitate integration of renewable energy sources, increase energy efficiency, and enable active participation of electric vehicles in the smart grid. JOB PURPOSE: Apply knowledge and understanding of computer science, software development and programming in laboratories engaged in research in the physical sciences. CORE DUTIES*:Consider, select and broadly apply principles, theories and concepts in multiple fields of specialization, with particular emphasis on two or more of the following: electric vehicles, electric power systems, renewable energy systems, transportation and/or control theory.Lead the design and setup of data-driven models and data analytics platforms.Lead analysis and interpretation of research data to recognize irregularities and invalid results, organize data, and develop models allowing for integration and display of data.Lead preparation of papers for publication and scientific and program reporting.Support collaborations with SLAC scientists, post-docs, and Stanford faculty.Work with other academic institutions, industry, and other DOE laboratories on interdisciplinary research.* - Other duties may also be assignedNote: The Associate Staff Scientist position is the entry level in the Staff Scientist career path. The Associate Staff Scientist is a 3 to 5 year fixed term research staff position. The second level of this career path, Staff Scientist is a regular continuing position. The Associate position is scheduled to be assessed after the 3 to 5 year period with the possibility of appointment to the Staff Scientist level. Appointment to the Staff Scientist level requires a review and evaluation of documented scientific achievement. MINIMUM REQUIREMENTS:Education & Experience:PhD in computer science or related technical fieldsKnowledge, Skills and Abilities:Expertise in renewable energy integration, control systems, and/or machine learning.Fully competent in one or more of the following areas: electric vehicles, electric power systems, electric power systems integration, renewable energy systems, transportation and/or control theoryPossess strong analytical and communications skills, both oral and written, and able to communicate clearly the goals, parameters, objectives and outcomes of research.Adept at working in a multidisciplinary team environment and keeping activities in scope, on schedule, and within budget.Demonstrated ability to organize data and develop models allowing for integration and display of data.Ability to coordinate and work with scientific or research staff and assist with technical procedures.Ability to communicate effectively, both verbally and in writing, and to provide information to scientific and research staffPreferred Qualifications:Familiarity with transportation demand planning, data-driven methods to extract human mobility patterns is a plus.Experience contributing to multiple projects and leading tasks on major projects and applying and interpreting the latest theories, principles, methods, tools and technologies.Demonstrated experience applying scientific principles and practices to perform and assist with experimental design.Demonstrated experience with analysis and interpretation of research data, and ability to recognize irregularities and invalid results.Basic experience with scientific software applications, systems, or programs relevant for the job.SLAC Competencies:Effective Decisions: Uses job knowledge and solid judgment to make quality decisions in a timely manner.Self-Development: Pursues a variety of venues and opportunities to continue learning and developing.Dependability: Can be counted on to deliver results with a sense of personal responsibility for expected outcomes.Initiative: Pursues work and interactions proactively with optimism, positive energy, and motivation to move things forward.Adaptability: Flexes as needed when change occurs, maintains an open outlook while adjusting and accommodating changes.Communication: Ensures effective information flow to various audiences and creates and delivers clear, appropriate written, spoken, presented messages.Relationships: Builds relationships to foster trust, collaboration, and a positive climate to achieve common goals.PHYSICAL REQUIREMENTS*:Frequently stand, walk, twist, bend, stoop, squat, grasp lightly, use fine manipulation, grasp forcefully, perform desk-based computer tasks, use telephone, write by hand, lift, carry, push and pull objects weighing over 40 pounds.Occasionally sit, kneel, crawl, reach and work above shoulders, sort and file paperwork or parts.Rarely climb, scrub, sweep, mop, chop and mix or operate hand and foot controls.Must have correctible vision to perform duties of the job.Ability to bend, squat, kneel, stand, reach above shoulder level, and move on hard surfaces for up to eight hours.Ability to lift heavy objects weighing up to 50 pounds.Ability to work in a dusty, dirty, and odorous environment.* - Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.WORKING CONDITIONS:May be exposed to high voltage electricity, radiation or electromagnetic fields, lasers, noise>80dB TWA, chemicals, asbestos and heavy metals. May work in confined spaces; work at heights and temperature extremes.May work extended or unusual work hours based on research and project requirements.WORK STANDARDS:Interpersonal Skills: Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.Promote Culture of Safety: Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.Subject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University's Administrative Guide, http://adminguide.stanford.edu.SLAC National Accelerator Laboratory is an Affirmative Action / Equal Opportunity Employer and supports diversity in the workplace. All employment decisions are made without regard to race, color, religion, sex, national origin, age, disability, veteran status, marital or family status, sexual orientation, gender identity, or genetic information. All staff at SLAC National Accelerator Laboratory must be able to demonstrate the legal right to work in the United States. SLAC is an E-Verify employer. Final candidates are subject to background checks prior to commencement of employment at the SLAC National Accelerator Laboratory.Internal candidates, who are selected for hire, may require degree verification and/or credit checks based on requirements of the new position.For Clery Act Information click here: http://www.stanford.edu/group/SUDPS/safety-report/security-authorities.shtml Are you a returning applicant?Previous Applicants:Email:Password: If you do not remember your password click here. New Search"}