{"jobID": "2807735382", "jobLocation": "Detroit_MI", "jobTitle": "Sales and Leadership Coach - Remote Position", "companyRating": null, "companyInfo": {"Website": "www.southwesternconsulting.com", "Headquarters": "Nashville, TN", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " What We Are Looking for in a Southwestern Consulting Professional Sales and Leadership Coach  At Southwestern Consulting, we help people achieve their goals in life.  To be certified as a Southwestern Consulting Coach, you must be a top producer and leader.  Our coaches are top producers first and coaches second. What makes SWC’s coaching program different from any other coaching program in the world is that to be a coach at SWC, first and foremost, you have to be a practitioner in the art of business and sales. For more than 160 years, Southwestern has trained, motivated, and coached salespeople and leaders to sell using fundamental principles that elevate the practice and perception of sales.  As a part of that mission, we are looking for someone who has the following skill sets and qualities: A top-producing salesperson and loves the art of selling,Self-motivated and able to self-manage out of a home office, andLooking for a dynamic team that is building the highest quality sales-performance and sales-leadership coaching program in the world. Not an Ordinary Job  This is not an 8–5pm kind of career. This is a do-whatever-it -takes kind of career in which you have a passion for building your business with and within SWC. We want people who take the bull by the horns and who will work on figuring it out as they go. We will give you proven scripts, the systems to use, and the schedule to run with, but you have to execute. This is not a place where you will just be a coach, speaker, or trainer without selling and practicing what you preach. To be a practitioner is to embody the principles of our company. SWC partners with entrepreneurs who want to create, build, and grow a company that allows people to create their own schedule and build their own unique income streams through their passion for helping others through coaching.  DESIRED SKILLS AND EXPERIENCE  Skills/Requirements Must have 10+ years of proven sales excellenceStrong presentation skillsStrong 1-on-1 communication skills in order to deliver customized and individual coaching.Ability to self-generate leads as well as build local relationships with our SWC national account companiesWork independently on a day-to-day basis while also communicating with your partner coaches in different markets on a weekly, if not daily, basis by phone, email, or through our CRMOrganized and detail-oriented individual who values open and constant communication with their teammatesGets stuff DONE!Sets a goal and then takes action to conquer itBelieves in having funIs always learning and growingDesires to be a part of something larger than themselves Must Understand New technology and how to use it in your business, including but not limited to social media, business tools, and mobile appsPowerPoint, Word, Excel, and Microsoft OutlookAdvanced skills with LinkedIn and how to teach others to use this platform in their businessLearn and implement all necessary skills in using our Client Relationship Management (CRM) software.Greater Nashville Area, TN Seniority Level  Associate  Industry  Professional Training & Coaching  Employment TypeFull-timeJob Functions SalesTraining"}