{"jobID": "2809482318", "jobLocation": "El_Segundo_CA", "jobTitle": "Data Warehouse Analyst W/Health Care exp", "companyRating": "3.8", "companyInfo": {"Website": "www.ispace.com", "Headquarters": "El Segundo, CA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Cyient"}, "estimatedSalary": "57000", "jobDescription": "Title: SENIOR DATA WAREHOUSE ANALYSTLocation: El Segundo, CADuration: 10 Months ContractLocals to Southern CA or Orange CountyOVERVIEW OF POSITION: Responsible for the Data Warehouse and Informatics functions for the client. Works with business users to define and develop solutions for the company through the use of our data assets. Designs, develops and implements various reporting and analysis solutions. Ensures improved data-based decision-making capability across organization. ESSENTIAL FUNCTIONS:Designs and writes SQL scripts, stored procedures, and user defined functions.Responsible for entire ETL process of transforming, cleaning, and standardizing data and metadata so it can be loaded into a data warehouse or data mart.Consistently exhibits behavior and communication skills that demonstrate Client’s commitment to superior customer service, including quality, care and concern with each and every internal and external customer.Builds data warehouse infrastructure including complex data models and strategic data sets and databases.Specifies the creation of content in support of internal and external customers for data and information.Interacts with company leadership as required to facilitate the development of strategic data sets for the organization.Ensures the reliability and timeliness of the data warehouse systems and underlying technologies.Develops solutions to streamline business processes to achieve departmental and company-wide goals more effectively and efficiently.Communicates status, problems, resolutions, etc. on projects and assignments.Contributes skills and knowledge to other database and reporting projects as determined by management.Directs the work of other staff and serves as a mentor to junior staff.Uses, protects, and discloses Client patients’ protected health information (PHI) only in accordance with Health Insurance Portability and Accountability Act (HIPAA) standards.Performs additional duties as assigned.EDUCATION:Bachelor’s degree from a four-year college and/or a professional certification requiring formal education beyond a two-year college.EXPERIENCE:Minimum:A minimum of three years of experience with Microsoft SQL Server or ORACLE including database design and writing SQL scripts.Hands on experience with integration tools such as SSIS or InformaticaStrong background in Business Analysis including supporting the design of new Production systems or system enhancements to existing systems.Preferred:5 years of analytical/planning experience in healthcare.KNOWLEDGE, SKILLS, ABILITIES:Specialization with related databases, architecture and implementation of data models and database designs, data access and table maintenance codes.Understanding of data warehouse methodology.Demonstrated achievement in building a research and analysis function.Excellent presentation skills.Excellent written and verbal communications skills.If interested, respond with your updated resume to Jaya.pulukuri@ispace,com or can reach me @ Direct: 310 929 2696 Phone: 310 929 2025 Ext - 161- provided by Dice  Data Warehouse, ETL, Informatica, Oracle, PL/SQL, SQL, Health Care, SSIS, Informatica, SQL Scripts"}