{"jobID": "2827639176", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Registered Nurse Supervisor - RN SIGN ON BONUS AVAILABLE", "companyRating": "2.9", "companyInfo": {"Website": "www.hcr-manorcare.com", "Headquarters": "Toledo, OH", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kindred Healthcare, Genesis HealthCare, Sava Senior Care"}, "estimatedSalary": "26", "jobDescription": " HCR ManorCare provides a range of services, including skilled nursing care, assisted living, post-acute medical and rehabilitation care, hospice care, home health care and rehabilitation therapy.  The RN - Nurse Supervisor is responsible for supervising nursing personnel to deliver nursing care and within scope of practice coordinates care delivery, which will ensure that patient's needs are met in accordance with professional standards of practice through physician orders, center policies and procedures, and federal, state and local guidelines. This RN position is a staff position that has direct care responsibilities as well as supervisor responsibility for nursing assistants. We are looking for clinicians who would like to combine their love for people and strong work ethic with the opportunities to advance your career.  In return for your expertise, you'll enjoy excellent training, industry-leading benefits and unlimited opportunities to learn and grow. Be a part of the team leading the nation in healthcare.4202 - Heartland Health Care Center - Greenview, Grand Rapids, MichiganOne year prior nursing experience preferred.Job Specific Details:Position: Registered Nurse (RN) ~ $5,000 sign on Bonus AvailableLocation: Heartland Health Care Center Greenview 1700 Leonard Street NE Grand Rapids, MI 49505 Employment Type: Full-time and Part-Time AvailableShift: 1st Shift, 2nd Shift, and 3rd Shift opportunitiesShift differentials: YesDescription: Job Summary Provides basic nursing care to residents within the scope of all Registered Nurses responsibilities. Provide the Care and Services in accordance with the resident's care plan, policies, procedures and as directed by the Director of Nursing. Requirements: RN State LicenseExperience:Physical Demands:Lifting 50 pounds maximum with frequent lifting, moving, and/or carrying of objects weighing up to 50 pounds;Be a part of our Heartland Health Care TeamBecome a Angel of Caring!!"}