{"jobID": "2553807303", "jobLocation": "Santa_Clara_CA", "jobTitle": "Deep Learning Data Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.nvidia.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Public (NVDA) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "161000", "jobDescription": "We are looking to fill a key role in our Advanced Analytics team, which is the analytic hub of NVIDIA's business data organization. Be at the forefront of the fourth industrial revolution to learn and apply groundbreaking data science techniques to the development of product solutions and business strategies. If you are highly motivated, love gaming, and relish working on big-data scale problems to make a significant impact on business, we want you!What you’ll be doing:Mine massive amounts of data and perform large-scale data analysis to derive useful business insights into product, customer, and market behaviorUnderstand business problems, translate them into quantitative models, and choose the best applicable statistical and analytical tools to drive a solutionDevelop descriptive, predictive, and prescriptive models using deep learning/machine learning algorithms.Identify actionable insights, suggest recommendations, and influence the direction by effectively communicating results to many crucial groups within the companyWhat we need to see:PhD in a quantitative discipline such as Machine Learning/AI, Statistics, Applied Mathematics, Operations Research, Computer Science, etc. (Would consider Masters for extraordinary applicants)5+ years of experience in using statistical, analytical, and ML techniques to solve business problemsStrong applied experience with Deep Learning frameworks like TensorFlow, Theano, Keras, Caffe preferably on large consumer datasets.Strong understanding of Deep Learning methodology and math.Strong intuition for applying Deep Learning to practical problems.Vast knowledge and experience with machine learning algorithms and statistical tools like Python scikit, R, MLLib, etc.Knowledge of Hadoop and SQL are required, Spark is a plusExperience with algorithmic work on NLP datasets would be greatStrength in collaboration with an ability to take the initiative and lead when neededA practical mindset If you have a passion for problem-solving, developing creative solutions, and continuous learning, a willingness to work with whichever machine learning algorithm is the most practical and effective for solving a specific business problem, and an understanding of the importance of data preparation, you'll be a great fit for this important team.  Common sense is required in order to develop mathematical models that match the reality of the business process and business data. Does the following sentence apply to you? You are governed by curiosity, motivation, and a desire to work hard and to develop production-ready models within the target timeframe. If so, you're our ideal team member.  NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people on the planet working for us, as well as vast amounts of computing power for our Data Scientists to utilize in developing your models. If you're creative and autonomous, we want to hear from you!  #Deeplearning  NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law."}