{"jobID": "2795463793", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist - DHS CBP Clearance", "companyRating": "3.9", "companyInfo": {"Website": "www.altaits.com", "Headquarters": "Rockville, MD", "Size": "201 to 500 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "107000", "jobDescription": " DATA SCIENTIST – Remote OK! ALTA IT Services has an immediate ,direct hire opening for a Data Scientist to support a respected data analytics organization based in McLean, VA. This position may be worked 100% remotely. This position requires US Citizenship, a current or former Client Client CBP clearance is very highly desired. The selected candidate must pass a pre-employment security investigation which will take several weeks to adjudicate.  The Data Scientist will be responsible for text mining, developing predictive systems, risk scoring, creating efficient algorithms and improving data quality. This individual will work closely with the corporate analysts to identify, evaluate, design and implement statistical analyses of gathered open source, proprietary, and customer data to create analytic metrics and tools to support analysts as well as the platform. This individual will have the opportunity to contribute directly to the features and capabilities deployed in our applications. The ideal candidate will work with customers to assist in gathering requirements and contributing to Statements of Work (SOWs) for new sales or POCs and executing design post sale while getting deeply involved into the delivery of the proposed solutions. The role will interface with the customer and provide continuity of technical and data-exploration expertise to ensure we are delivering a workable solution that meets the customer requirements and technical capabilities. The position requires a mission oriented person who strives to produce the best possible work for the customer. KEY RESPONSIBILITIES AND DUTIES:Work with engineering and research teams on designing, building and deploying data analysis systems for large data sets.Work closely with customers to apply data science to their mission specific content.Create algorithms to extract information from large data sets.Establish scalable, efficient, automated processes for model development, model validation, model implementation and large scale data analysis.Develop metrics and prototypes that can be used to drive business decisions.Provide thought-leadership and dependable execution on diverse projects.Identify emergent trends and opportunities for future client growth and development.Researches and identifies Machine Learning (Client) and Natural Language Processing (NLP) methodsIdentifies new applications of Client and NLP in the context of client and content setsExplores existing data for insights and recommends additional sources of data for improvementQUALIFICATIONSMust have, or be able to acquire and maintain a US Government Security Clearance – current Client-CBP BI investigations highly preferred.Excellent programming skills (Java/Python/R/Scala)Must be creative, intellectually curious, and willing to experiment and work in dynamic organizations and situations, sometimes with little oversight or well-defined requirements.Must take ownership for defined areas of accountability, most critically the integrity of the technical and data design in terms of meeting customer needs, design delivery and supportabilityA good understanding of distributed computing conceptsExperience with Kafka preferredBig Data analytics experience preferredStrong background in engineering, process data management, or service management in a medium size complex technology environment.Previous experience with data modeling for graphs.Apache NiFi experience a plus.Experience in complex analysis of processes and toolsExperience facilitating gathering input from subject matter experts.Excellent understanding of Client, NLP and statistical methodologiesAbility to test ideas and adapt methods quickly end to end from data extraction to implementation and validationExperience with search engines, classification algorithms, recommendation systems and relevance evaluation methodologies a plusExperience leading project work focused on a specific process area.Strong planning, time management and organizational skillsGood team player / self starter with the ability to work using own initiative.SALARY RANGE: $130,000 to $150,000 annually, plus excellent benefits and paid time off.  For consideration please contact Melissa McNally via mmcnally@altaits.com  ALTA IT Services, LLC. is an equal opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, disability, veteran status, sexual orientation, or any other factor."}