{"jobID": "2766315584", "jobLocation": "Dallas_TX", "jobTitle": "Advisory Data Science Manager - Consumer Markets", "companyRating": "3.8", "companyInfo": {"Website": "www.pwc.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " PwC/LOS Overview  PwC is a network of firms committed to delivering quality in assurance, tax and advisory services.  We help resolve complex issues for our clients and identify opportunities. Learn more about us at www.pwc.com/us.  At PwC, we develop leaders at all levels. The distinctive leadership framework we call the PwC Professional (http://pwc.to/pwcpro) provides our people with a road map to grow their skills and build their careers. Our approach to ongoing development shapes employees into leaders, no matter the role or job title.  Are you ready to build a career in a rapidly changing world? Developing as a PwC Professional means that you will be ready to create and capture opportunities to advance your career and fulfill your potential. To learn more, visit us at www.pwc.com/careers. PwC Advisory helps our clients with their most challenging imperatives from strategy through execution. We combine the breadth of knowledge of over 48,000 global professionals with deep industry knowledge to deliver custom solutions for our clients. We work with the world's largest and most complex companies and understand the unique business issues and opportunities our clients face. Job Description Our Information Management consultants help clients maximize the value of their data.  This high performing team helps clients define their  information strategy, architecture and governance, get the most value from business intelligence and analytics, and implement enterprise content and data management solutions to reduce cost and complexity, increase trust and integrity, and improve operational effectiveness.  Position/Program Requirements  Minimum Years of Experience: 8  Minimum Degree Required: Master's degree in Statistics or similar quantitative discipline Knowledge Preferred: Demonstrates proven intimate knowledge and success of managing analytic and BI efforts in several of the following areas: Creating and applying analytic frameworks to solve difficult business problems and strengthen decision making capabilities at senior levels;Leading and directing analytic teams that have influenced business models and influenced strategic direction within the Healthcare, Insurance, Financial Services, Consumer and Industrial Products and Services, Manufacturing, or Telecom Industries;Identifying, obtaining and processing critical data (e.g. internal client data, external public data, and new sources of data) to challenge the status quo through innovative thought leadership in the application of quantitative methodologies to improve decision-making in marketing, operations, and risk management. Demonstrates proven intimate knowledge and success of functional knowledge of advanced analytic methods and visualization techniques, applying quantitative methodologies to complex business problems across multiple industry issues or functional domains. Skills Preferred: Demonstrates proven intimate abilities and success with leading and managing business development opportunities and/or engagements from pre-sale and initial scoping through final delivery and signoff.  Demonstrates proven intimate abilities and success to develop strategy; as well as write, communicate, facilitate, and present cogently; to and/or for all levels of industry audiences, clients and internal staff and management within applicable analytic domains.  Demonstrates proven intimate abilities and success to engage with and support executives in a decision process that is strengthened by analytics, leading teams or stakeholders through the analytic process in a business-setting and translating analytic insight into business value and ongoing management capabilities.  Demonstrates proven intimate abilities and success leading teams to generate a vision, establish direction and motivate members, create an atmosphere of trust, leverage diverse views, coach staff, and encourage improvement and innovation. "}