{"jobID": "2829188828", "jobLocation": "San_Jose_CA", "jobTitle": "Scientist I/II", "companyRating": null, "companyInfo": {"Website": "www.baysidesolutions.com", "Headquarters": "Pleasanton, CA", "Size": "1 to 50 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Bayside Solutions is seeking a Scientist I/II to be part of our client’ s team in the Branchburg, New Jersey. This is an opportunity to work with the largest privately held pharmaceutical corporation in the world and ranks among the world' s 20 leading pharmaceutical corporations.  Our Client’ s culture is highly collaborative, offers an environment that encourages employees to expand their knowledge in order to make a profound impact on patients’ lives. This could explain why their company has been recognized as one of the “ Top Twenty Employers” in biotechnology and pharmaceuticals by Science Careers. Our Company Bio: Bayside Solutions was founded in 2001, Bayside was recognized as one of the fastest growing professional staffing companies in Northern California. The numbers tell the story: We have close to a 100% client retention rate, 700% growth in four plus years and over 95% repeat business. Our dedication to building partnership relationships with both our clients and our recruits is the key to our phenomenal success.  You can find additional information on our company website at www.baysidesolutions.com. Scientist I/IIJob Benefits:An opportunity to join a patient-focused organization that is driven to develop, manufacture and commercialize medicines to treat life threatening conditions.Work for a company that is local to the bay area and recognized as a leader of innovation.Competitive compensation commensurate with experience.This position is eligible for medical, vision, dental benefits, paid sick time, and 401K.Summary of Responsibilities:Works under general supervision, to conduct and monitor laboratory experiments utilizing established and published procedures, and technical and theoretical understanding.Makes recommendations to resolve problems encountered during experimental procedures.Assumes responsibility for the accuracy, quality, and timeliness of experimental results.Plans and executes own work.Summarizes experimental results, and reviews conclusions with supervisor/project leader.Communicates results of experiments in the form of reports and presentations. Keeps supervisor/project leader informed of project status, particularly of significant findings and results in critical problem areas.Analyzes experimental data using various data analysis software and/or applying quantitative methods.Forms conclusions, and provides/documents process improvements.Uses technical writing skills to produce reports and documents. May present findings at internal meeting.Performs work according to established internal safety guidelines and procedures, and as specified by appropriate external regulatory agencies (e.g., OSHA).Assumes accountability for own electronic notebook documentation, ensuring experimental methods and results are recorded timely, accurately and consistently, and according to established formats.Participates in routine lab maintenance, lab safety, ISO, and QSR implementation.Organize and manage reagent and material stocks and inventories for project at hand.May troubleshoot issues related to instrumentation.With guidance, analyzes and brainstorms alternative approaches to solve problems and finds solutions. Uses discretion and independent judgment to recommend solutions to basic problems that their individual or team projects.Summary of Qualifications:Must have a B.S. in Molecular Biology, biochemistry or equivalent field.1-3 years of relevant experience. Experience in device industry is a plus.Experience in extraction and handling DNA, RNA, and clinical specimen is essential.Hands on experience with qPCR, RTqPCR, molecular biology and analytical methods are required.Ability to work independently, organize and resolve basic problems, and critical thinking skills."}