{"jobID": "2628414722", "jobLocation": "Palo_Alto_CA", "jobTitle": "Research Scientist in Data Systems", "companyRating": "3.8", "companyInfo": {"Website": "www.tableau.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Company - Public (DATA) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Cognos"}, "estimatedSalary": "109000", "jobDescription": " **What youll be doing**As a member of Tableau Research (research.tableau.com), you will be applyingyour research skills to problems in data systems. We are looking for peoplewith skills in data system disciplines such as databases, big-data, federatedsystems, data modeling, data preparation, query processing, queryoptimization, data profiling, noSQL, scale-up, scale-out, approximate queryprocessing and data sketching. We are interested in candidates at all levelsof experience.Some of the things youll be doing include  * Manage a research portfolio of projects relevant to Tableaus business and customers. * Design and implement high-quality prototypes to validate research innovations and communicate those innovations to the rest of Tableau. * Provide input to product teams, both technically and strategically. * Monitor and report on external research and innovation in areas relevant to Tableau. * Be an eager evangelist, whether presenting academic papers or giving talks inside and outside Tableau, including at conferences and to customers.**Who you are ** * **True Team Player: **We value collaboration, both within Tableau Research, the Hyper team, and across the development organization.  * **Customer Focused:** Build significant knowledge of Tableaus customers and business goals to further innovation and help create new products and services. * **Education/Experience:** PhD or equivalent in data management or related systems technology.  * **You are a Recruiter!** Tableau hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring onboard to help us continue to build one of the best companies in the world.Tableau Software is a company on a mission. We help people see and understand their data. After a highly successful IPO in 2013, Tableau has become a market-defining company in the business intelligence industry. Our culture is casual and high-energy. We are passionate about our product and our mission and we are loyal to each other and our company. We value work/life balance, efficiency, simplicity, freakishly friendly customer service, and making a difference in the world!Tableau Software is an Equal Opportunity Employer."}