{"jobID": "2768440933", "jobLocation": "Franklin_Lakes_NJ", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.roberthalftechnology.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": "Summary of Position: Will be responsible for the oversight and management of data quality, data analysis, data cleansing, data consolidation and relationship data management available from external and internal sources for Service Management Systems, ERP, and Contract Management system data. The analyst will analyze, evaluate, cleanse, test, and verify the data and data deficiencies. The Analyst will leverage business knowledge and recommend methods and solutions to improve data quality; new data attributes that would improve business analysis; and support the importing of data into target system. The position will collaborate with team members and Bard division contacts to address data concerns originating from internal processes. General Responsibilities: Review Data reporting, profiling, validation, cleansing, analysis, and corrections  Scrub and Cleanse data, per the business requirements  Work with data source systems and target systems to identify data issues, data gaps, identify and recommend solutions.  Responsible for data integrity checks, report anomalies, and coordinates with development teams for resolution.  Develops metrics and reports supporting Data Management compliance related initiatives  Collect, identify, correct and report data related issues and recommend appropriate steps to rectify issues within source systems.  Importing cleansed data into the target system through system GUI  Coordinate with divisions and project team for non-centralized customer data requirements  Assist with authoring and modifications to Data Testing and Validation Plan as required for Customer"}