{"jobID": "2775933040", "jobLocation": "Princeton_NJ", "jobTitle": "In Vivo/Ex Vivo Pharmacology - Senior Research Scientist (D06):", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "106000", "jobDescription": " Responsibilities for this Senior Research Scientist position include designing and conducting a wide range of preclinical in vivo and ex vivo studies of the immunological mechanisms of novel pharmacological agents in the areas of autoimmunity and immuno-oncology drug discovery. The ideal candidate will have extensive hands-on experience with various models of autoimmunity and immunological mechanisms. The ability to develop new mouse models and experience with ex vivo functional assays and techniques interrogating the immune system are required. The qualified candidate will possess the ability to work across a highly matrixed environment to advance preclinical drug discovery programs from target identification/validation through IND enabling activities. Qualifications and Job Requirements:B.Sc. in the Biological Sciences or closely related field with a minimum of 13 years' experience or M.Sc. with 10 years' experience, preferably within the Pharmaceutical/Biotechnology sector.Extensive and diverse hands-on experience with various preclinical in vivo models of rheumatoid arthritis, inflammatory bowel disease, lupus and immunological pharmacodynamic responses, with excellent skills in animal dosing and tissue collection.Diverse expertise in a wide range of ex vivo analyses such as primary cell and tissue explant cultures, flow cytometry- or CyTOF-based immunophenotyping, ELISA, phospho-protein analysis (immunoblots) and target engagement assays.Proven ability to independently design, coordinate, and execute in vivo and ex vivo studies with timely production of quality data and accurate record keeping. Must be able to apply knowledge gained from literature and working experience to novel model development.Expert in the use of software to support analysis such as GraphPad Prism. Ability to perform basic statistical analysis.Dedication to working in a team-oriented environment to contribute to shared project and organizational goals. Proven ability to train, coach and mentor other scientists.Ability to multi-task in a fast-paced drug discovery environment.Excellent communication skills with ability to effectively communicate both oral and written scientific results and conclusions to peers, supervisor and department teams.SDL2017"}