{"jobID": "2779314706", "jobLocation": "Houston_TX", "jobTitle": "Sr Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.lonza.com", "Headquarters": "Basel, Switzerland", "Size": "5001 to 10000 employees", "Founded": " 1897", "Type": " Company - Public (LONN) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Perrigo, Covance, DSM"}, "estimatedSalary": "67000", "jobDescription": " At Lonza, we invest in great people. We encourage our employees to challenge themselves and we offer an environment that fosters creativity and success. Headquartered in Basel, Switzerland, we operate production, R&D;, and business sites around the world, including Europe, North America, and Asia.Our vision:We strive to be the leading supplier using science and technology to improve the quality of life.Our mission:We work with passion, using advanced technologies, to transform life science into new possibilities for our customers.Do you want to help us as we shape the future of this great organization?Job Description SummaryThe candidate will participate in a high performing, cross-functional team in the development, optimization, qualification /validation and technology transfer of various analytical methods (Cell counting and Viability, ELISA, Flow Cytometry, Cell based potency assay, qPCR etc.). She/he should be able to assist both technical lead scientists and management in the design and execution of new or unique cell-based projects. Design, develop, optimize and qualify/ validate and Tech Transfer various analytical method but not limited to cell-based assays, morphological assessment, cell proliferation, functional differentiation, cytotoxicity, detection of marker expression (ICC), Flow Cytometry, q-PCR and ELISAs.Develop analytical project plans and timelinesProvide technical and scientific leadership in various analytical activities to other team members.Interact with new clients to document and transfer assays to Lonza .Train research associate and technicians in assay execution .Performs statistical analysis of data and prepare reports based on the results of the assays performed. Interprets results and evaluates next steps in experimental design.Draft and revise technical documents including lab SOPs, testing protocols and reports.Establish and maintain a good working relationship with Bioassay Services and other departments such as QC, QA and Cell Therapy Operations.Develop and improve new skills and knowledge necessary to successfully support assigned projects.Other duties, as assigned by supervisorMaintain Lonza quality systems and cGMP compliance for the business by ensuring that all team members comply with processes, procedures and instructions for all activities in which the team participates.Comply with all pertinent safety policies, rules and regulations. Ensure that all team members comply with safety rules and regulations.Provide scientific support to solve process design problems where analysis of situations or data requires a broad knowledge of related technology and consideration of many options.Exercise judgment on current state-of-the-art procedures and practices to determine appropriate action.Rely on guidelines related to cGMP manufacturing and the associated and appropriate regulatory requirements in designing new processes and developing new assays. Lonza is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a qualified individual with disability, protected veteran status, or any other characteristic protected by law.Lonza. The place to Go, Stay and Grow."}