{"jobID": "2837765673", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Non-Technical Recruiter", "companyRating": null, "companyInfo": {"Website": "www.searchwizards.com", "Headquarters": "Sarasota, FL", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Non-TechnicalRecruiter –Ann Arbor, MIAre you passionate about the Talent Acquisition Profession and the impact you can make on the organizations you support? Do you enjoy being challenged and solving problems? Are you an energetic, results-oriented Professional with a competitive nature? If so, we want to talk to you.Search Wizards is a global provider of Talent Solutions. We have excelled at matching our clients’ staffing needs to the BEST Talent Acquisition Professionals in the market since 2000.If you are in the Talent Acquisition Profession make us your first call. This is all that we do and it’s all about YOU.Excited yet? Us too!We currently have a very exciting opportunity available for a Non-TechnicalRecruiter inAnn Arbor, MI. This position will start as a 12 monthcontract with the potential to extend.As a member of our client’s world-class Staffing Programs recruiting team, you'll be charged with finding unique entry-level candidates who bring an entrepreneurial spirit, a sense of scrappiness and diversity of thought to all they do. You will be responsible for guiding with the company. Similarly, you will ensure Hiring Manager and team preparedness during the interview process and that interviews are conducted efficiently and professionally. You are driven, eager and able to develop lasting relationships with both candidates and Hiring Managers and can leverage your knowledge of client’s needs to match candidates with roles where they will be successful. You're also comfortable with numbers and can draw insights from analytics to make our hiring process smarter, friendlier and more efficient.Responsibilities:Work effectively with large volume of candidates and achieve quarterly hiring goalsEvaluate skill level and keep candidates continually informed throughout the hiring and offer processKeep clients and partners apprised of and involved in work by communicating information and status to project leads and team membersSolve problems and produce solutions by collecting and analyzing data, identifying alternatives when circumstances change and seeking out additional responsibilitiesPartner with University Programs Specialists who conduct university and student outreach that builds the company’s short and long-term candidate pipelinesBasic Qualifications:BA/BS degree or equivalent practical experience2 years of work experience in recruiting, sales or client service roleExcellent communication and interpersonal skills, with ability to take initiative and build strong, productive relationshipsPreferred Qualifications:Strong passion for campus recruiting and working with candidates from diverse backgrounds who are starting their careersExposure to HR processes, such as interviewing and candidate evaluationPassion for improving the customer experience with customers broadly defined as candidates, new hires, Hiring Managers, and RecruitersAbility to consistently contribute in a high-paced work environment as well as the ability to prioritize multiple functions and tasks and manage work time efficientlyProcess and detail oriented with ability to think creatively and strategicallySolid history of solving complex problems and delivering significant impactSearch Wizards is an equal opportunity employer.Search Wizards is known for its pioneering efforts and niche focus on Talent Solutions. We offer competitive rates, an excellent benefits package (healthcare and 401k), ongoing education, and more.StayConnected:WebsiteFacebookTwitterGlassdoorJOB ID: SE58004573"}