{"jobID": "2465555287", "jobLocation": "Kenilworth_NJ", "jobTitle": "Scientist 1", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Qualifications:• BS or MS in biology-related discipline with at least one years related laboratory experience . • Capable of working independently under moderate supervision and possess good communication skills (written and verbal). • Experiences with ligand binding and cell based assay development and validation/qualification • Working knowledge of ELISA, ELISPOT or flow cytometry assay preferable • Working experience with MSD, Gyros, cell counter or FACS a plus • Working experience with LIMS (e.g., Watson) for quantitation, data handling and archival. • Experience in bioanalysis in GLP compliance environment Responsibilities: Merck & Co. Biologics and Vaccines Bioanalytics (BVB) supports PK, immunogenicity and biomarker assay development, validation and testing for development stages (preclinical and clinical) and life-cycle management of Biologics and Vaccines programs. We are seeking a highly motivated candidate with technical background in ligand binding or cell based assay from a regulated lab to perform method validation and execute validated method to support PK, target engagement and immunogenicity assessments for pre-clinical and clinical studies of biotherapeutics and vaccines. As a member of bioanalytical group of BVB, the incumbent will be responsible to: • Validate ligand binding or cell based assays for the bioanalysis of biopharmaceuticals, biomarkers and vaccines. • Carry out projects with minima daily coaching, is able to prepare validation protocol, method validation report, and standard operating procedures. Conduct validation and sample analysis as well as data review in a GLP compliant laboratory."}