{"jobID": "2782887041", "jobLocation": "Houston_TX", "jobTitle": "Sr Scientist Cell Therapy", "companyRating": null, "companyInfo": {"Website": "www.lonza.com", "Headquarters": "Basel, Switzerland", "Size": "5001 to 10000 employees", "Founded": " 1897", "Type": " Company - Public (LONN) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Perrigo, Covance, DSM"}, "estimatedSalary": null, "jobDescription": " At Lonza, we invest in great people. We encourage our employees to challenge themselves and we offer an environment that fosters creativity and success. Headquartered in Basel, Switzerland, we operate production, R&D;, and business sites around the world, including Europe, North America, and Asia.Our vision:We strive to be the leading supplier using science and technology to improve the quality of life.Our mission:We work with passion, using advanced technologies, to transform life science into new possibilities for our customers.Do you want to help us as we shape the future of this great organization?Job Description SummaryExperienced in development and optimization of cell culture processes or analytical methods for the production of cell and gene therapy products. The successful candidate should have experience with primary cell and tissue isolation techniques, maintenance, expansion, and differentiation of stem cells including pluripotent stem cells, in vitro culture of T cells and/or primary cells derived from human tissue, in vitro culture of adherent and suspension cell lines, gene modification and transfection / transduction techniques, downstream and fill/finish processing, and analytical methods and testing. She/he should be able to assist both technical scientists and management in the design and execution of new or unique cell-based projects; be able to assist with tech transfer of processes to manufacturing or Quality Control (QC) and design of investigation studies for MSAT and manufacturing team; be able to train and mentor other technical scientists and manufacturing personnel in the development and / or execution of developed process plans; analyze bioprocessing or analytical methods data to monitor, optimize and determine limits of process or assay performance. She/he should be able to present data and clearly communicate the results of process development or assay development studies with the clients. Primary Role ResponsibilitiesResponsible for successful development and execution of state-of-the-art manufacturing processes for cGMP manufacturing within the Cell Therapy Development matrix. Sr. Scientist working on assay development would be responsible for successful development and execution of assay development, assay qualification or validation and tech transfer to QC.Understand cell-based assays including, but not limited to, morphological assessment, cell proliferation, functional differentiation, cytotoxicity, detection of marker expression (ICC), Flow Cytometry, qPCR and ELISAsInteract with new or existing Cell and Gene Therapy clients to document and transfer new processes to Lonza sites and communicate and present the work in internal and client meetingsLead and support scientific or engineering expertise toward the design and development of new process ideas that support client product conceptsDesign and review of experiments of process optimization or assay optimization, scale up and cryopreservation, trouble shoot the problems.Provide technical and scientific leadership to other team members. This includes providing assistance to management in the design of new, unique or existing protocolsOversee the initial technical training of specific Process protocols to the Manufacturing TeamsEstablish and maintain a good working relationship within the operations department and other departments such as Research and Development (R&D;), Quality Control (QC), Quality Assurance (QA) and Project Management (PM)Lead, review and/or train/assist in writing and revising technical documents including laboratory SOPs, protocols, reports and batch recordsSupport Research and Development (R&D;) projects by providing constructive technical feedback and improving new processes as they are being transferred into Cell and Gene Therapy Development prior to offering to clientsJob Scope Establishes the manufacturing process based on standard process development guidelines and works on process design problems where analysis of situations or data requires a broad knowledge of related technology and consideration of analytical methods and in process controls. Exercises judgment on current state-of-the-art procedures and practices to determine appropriate action. Relies on guidelines related to cGMP manufacturing and the associated and appropriate regulatory requirements in designing new processes and developing new assays. Skills/Education Requirements • PhD in Life Sciences with focus on biology or Bioengineering with at least 4-6 years of related manufacturing, process OR assay development experience in biotech industry experience; MS degree in Life Sciences field with at least 6-8 years of related manufacturing, process or assay development experience in biotech industry.  • Experience with a variety of cell culture systems and optimization of cell expansion and differentiation process.  • Experience with the development and transferring of 2D cell culture systems and /or 3D bioreactor processes to cGMP manufacturing  • Experience or knowledge of analytical methods and in process controls commonly used in manufacturing processes such as cell count viability, flow cytometry, and molecular biology techniques  • Experience with development of bioreactor protocols and scale up studies for mammalian cells or stem cells is highly desirable  • Self-directed and self-motivated; demonstrated ability to work both independently and also as a team member in a matrix environment; maintains a positive approach to setbacks and challenges; champions new ideas and initiatives; brings out and utilizes others' creativity to improve team performance  • Client oriented: establishes effective and responsive relationships with all clients; able to translate client projects into a feasible process design; known to ensure value is always delivered to the client  • Exceptional oral and written English communication skills  • Excellent computer software skills related to Microsoft office and data analysis; capable of keeping professional, accurate and timely records of all essential activities; able to manage multiple projects; excellent time management skillsLonza is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a qualified individual with disability, protected veteran status, or any other characteristic protected by law.Lonza. The place to Go, Stay and Grow."}