{"jobID": "2662375392", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Engineer", "companyRating": "3.9", "companyInfo": {"Website": "www.thoughtworks.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Accenture"}, "estimatedSalary": "111000", "jobDescription": "ThoughtWorks is a global software consultancy, made up of around 4,500 passionate technologists across 15 countries. We specialize in strategy, portfolio management and product design, combined with digital engineering excellence.As a Senior Data Engineer, here's what we'll be looking for you to bring:Hands-on Engineering LeadershipProven track record of Innovation and expertise in Data EngineeringTenure in coding, architecting and delivering complex projectsDeep understanding and application of modern data processing technology stacks. For example Spark, Kafka, Hadoop, ecosystem technologies, and othersDeep understanding of NoSQL technologies including column family, graph, document, and key-value data storage technologiesDeep understanding of relational database technologies and database development techniquesUnderstanding of how to architect solutions for data science and analyticsData management for reporting and BI experience is a plusUnderstanding of Agility, including core values, guiding principles, and key agile practicesUnderstanding of the theory and application of Continuous Integration/DeliveryPassion for software craftmanshipA rich breadth of industry experience and background working across different organizations, ranging in size, from start-ups to large corporations..Strong stakeholder management and interaction experience at different levelsAny experience building and leading an offshore/outsourcing function would be highly beneficial.There's no typical day or engagement for our Senior Engineers. Heres what youll do:Be the SME. Develop Big Data architectural approach to meet key business objectives and provide end to end development solutionYou might spend a few weeks with a new client on a deep technical review or a complete organizational review, helping them to understand the potential that Big Data has to solve their most pressing problems.On other projects, you might be acting as the architect, leading the design of technical solutions, or perhaps overseeing a program inception to build a new product.It could be much more about getting stuck into a delivery project where you're equally happy coding and tech leading the team to implement the solution.Whatever your role, the team always look to draw on your experience when things get tough and you often handle the difficult client conversations allowing the team to continue delivering without undue pressure.You have great relationships with our new business team and work collaboratively to support pre-sales, meet prospective clients and ultimately influence and shape our portfolio of work.You recognize that building your network with a client is absolutely key to enable you to perform in your role. You'll be drawing on all of your passion for technology, hands-on experience and knowledge of latest Big Data and Engineering best practices to help you gain the respect and credibility of those around you.Regardless of what you do at ThoughtWorks, youll always have the opportunity to:Think through hard problems, and work with a team to make them reality.Learn something new every day.Work in a dynamic, collaborative, transparent, non-hierarchal, and ego-free culture where your talent is valued over a role titleTravel the world.Speak at conferences.Write blogs and books.Develop your career outside of the confinements of a traditional career path by focusing on what youre passionate about rather than a predetermined one-size-fits-all planBe part of a company with Social and Economic Justice at the heart of its mission. #LI-NA"}