{"jobID": "2830571923", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst - Public Education Data Analysis", "companyRating": "4.3", "companyInfo": {"Website": "www.lbb.state.tx.us", "Headquarters": "Austin, TX", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " General Information**Minimum salary is listed. Actual salary will be determined based on qualifications and experience.** The Data Analyst will coordinate analyses of fiscal notes pertaining to public education, prepare fiscal notes, and perform other fiscal, policy, and data analyses to support the work of the Legislature. The position will also perform SAS programming in support of the primary analyst responsible for simulations of the state's public school finance system.   The position reports to the Public Education Data Analysis Manager and works under general supervision, with moderate latitude for the use of initiative and independent judgment.Essential Responsibilities Communicate effectively by adequately simplifying and translating complex data and providing high level summaries and options for a variety of audiences. Use language appropriate for audience. Assist with the maintenance and deployment of the data and technical systems that comprise the school finance SAS model. Assist with the development and implementation of Public Education Policy reports. Communicate effectively with a variety of audiences including, but not limited to LBB staff and management, legislators, legislative staff, agency personnel, and the general public. Make presentations of analyses and recommendations to agencies, legislators and their staff, and others. Coordinate and collaborate with other LBB analysts on budget, performance, and revenue issues, as appropriate. Work collaboratively with other teams to effectively support legislative deliberations and agency success. Produce sound qualitative and quantitative analysis and make effective recommendations. Conduct quality assurance procedures to produce accurate and complete work products. Demonstrate sufficient knowledge of all major team issues and alternatives under consideration. Contribute to or complete additional assignments that meet agency or legislative needs. Essential Attributes and Skills Excellent oral and written communication skills and editing skills. Knowledge of Legislative function, procedures, and public administration practices. Skill in using logic and reasoning to identify strengths, weaknesses and solutions. Skill in using existing technology for research and presentation. Skill in developing and maintaining data and technical systems for the purpose of modeling current and proposed public school finance structures. Ability to establish goals and objectives and devise solutions to administrative problems. Ability to effectively manage and engage team members and encourage interpersonal relationships. Ability to work on computers for extended periods of time. Ability to review and edit effectively. Ability to plan, think ahead, and anticipate problems. Ability to research and develop expertise in team-specific topics. Ability to maintain objectivity and express ideas without bias. Skill in maintaining confidentiality and objectivity, using sound reasoning to determine course of action. Skill in listening and responding appropriately in a variety of settings.Attributes Required of Every LBB EmployeeEmbrace agency mission/core values and follow policies, procedures, and processes. Work effectively with LBB management and staff, as well as all external customers. Coordinate, collaborate and employ good interpersonal skills; demonstrate positive outlook. Balance concurrent projects, work under pressure, and adapt to changing priorities/deadlines. Act with motivation, organization, and attention to details; complete tasks with an appropriate level of independence. Be punctual and have regular attendance. Work overtime on nights, weekends, and holidays, as necessary to meet agency deadlinesExperience and EducationGraduation from an accredited four-year college or university. A graduate degree preferred but not required. SAS programming experience preferred. Experience in the field of public education, especially with the Texas public school finance system, strongly preferred. Supplemental InformationTo apply for this position, you must initially set up an account and select a Username and Password through Governmentjobs.com. You may apply directly through the posting list on our website or on the Governmentjobs.com website. To set up an account go to https://www.governmentjobs.com/js_login.cfm. Please be sure to write down your Username and Password. Human Resources will not be able to retrieve this information. Only on-line applications will be accepted.    Examples of an applicant's work product and/or copies of transcripts may be required as condition of interview. Finalist may be given a work-related exercise. The person hired may be required to submit official transcripts. Credentials earned at foreign colleges and/or universities must have been evaluated by an acceptable entity and must be equivalent to credentials awarded by U.S. regionally accredited institutions of higher education.  The person hired may not simultaneously be employed by the Legislative Budget Board and another state agency or Texas public institution of public/higher education. Any job offer from the Legislative Budget Board is contingent upon: proof of eligibility/authorization to work in the United States on a full-time basis; and proof of compliance with the Selective Service Law for males between the ages of 18 and 25.  The Legislative Budget Board is an equal opportunity employer and does not discriminate in employment or in the provision of services on the basis of race, color, religion, sex, national origin, age, or disability. Applicants should communicate requests for disability-related accommodations during the application process to LBB Human Resources at email address HR@LBB.state.tx.us."}