{"jobID": "2828273783", "jobLocation": "Austin_TX", "jobTitle": "Natural Resources Specialist V (Fisheries Research Senior Scientist)", "companyRating": "2.9", "companyInfo": {"Website": "tpwd.state.tx.us", "Headquarters": "Austin, TX", "Size": "501 to 1000 employees", "Founded": " 1987", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " General Description  Under the direction of the Research Program Director, his position is responsible for identifying, developing, and conducting collaborative fisheries research that informs and advances science-based conservation and management of aquatic resources throughout Texas. Research responsibilities include the study design, data collection in field and laboratory settings, statistical data analyses and evaluation, interpreting study results and making recommendations, and disseminating findings through presentations, reports, and scientific publications. Provides scientific technical expertise and serves as a science expert in a particular field or type of work important to achieving the mission of the agency. Facilitates a collaborative research environment, cultivates relationships with other Branch and Division staff. Works under minimal supervision, with extensive latitude for the use of initiative and independent judgment. Performs additional duties as assigned. Complies with all Agency, Division and Branch rules, regulations and procedures.  POSTING NUMBER: 18-00820 Qualification Guidelines MINIMUM QUALIFICATIONS:Education:Graduation from an accredited college or university with a Bachelor's degree in Biology, Ecology, Wildlife, Fisheries Science or closely related Natural Science.Experience:Three years of applied research experience in fisheries or related biological science.Licensure:If driving is required, applicant must possess a valid State driver's license.ACCEPTABLE SUBSTITUTIONS:Experience:Graduation from an accredited college or university with a Master's degree in Biology, Ecology, Wildlife, Fisheries Science or closely related Natural Science may substitute for one year of the required experience;Graduation from an accredited college or university with a Ph.D. in Biology, Ecology, Wildlife, Fisheries Science or closely related Natural Science may substitute for two years of the required experience.PREFERRED QUALIFICATIONS:Education:Graduation from an accredited college or university with a Master's degree or Ph.D. in Fisheries Science or closely related biological science. Knowledge, Skills and Abilities Knowledge of applicable laws, regulations, and policies dealing with conservation of fish and wildlife resources and their habitats;Knowledge of biological, ecological, and environmental sciences;Knowledge of statistical data analysis;Knowledge of flora and fauna of Texas and their ecosystems;Knowledge of ecosystem management and restoration;Skill in using MS Word, Excel and Outlook;Skill in effective verbal and written communication;Skill in using standard office equipment;Skill in effective interaction with staff at all levels of the department and other state agencies and organizations;Skill in interpreting, reviewing, summarizing and commenting on technical documents and development proposals;Skill in analysis of natural resource data, and preparation of technical reports;Ability to work independently with little or no supervision;Ability to analyze data and prepare, review and edit technical reports and publications;Ability to review, interpret, summarize and comment on technical documents in a professional manner;Ability to prepare and make written and oral presentations to a variety of technical and non-technical audiences;Ability to work well with TPWD staff, the public, elected officials, universities, government agencies, and non-government organizations in a tactful, diplomatic and professional manner; Ability to prioritize workloads and meet deadlines;Ability to conduct professional meetings;Ability to perform manual labor including, lifting supplies and materials up to 20 lbs.;Ability to conduct work activities in accordance with TPWD safety program.Additional InformationWORKING CONDITIONS:Required to work from 8:00 a.m. to 5:00 p.m. Monday through Friday;Required to work overtime as necessary;Required to perform manual labor including, lifting supplies and materials up to 20 lbs.; May be required to operate a State vehicle;Required to travel 20% with possible overnight stays;Non-smoking environment in State buildings and vehicles.ADDITIONAL REQUIREMENTS: In order to be considered for this position, the following information is required: Submittal of a completed online application;Work history experience MUST be completed in the online application;A scanned copy of official college transcript(s) issued from the registrar must be attached to the online application (if applicable);Applicants must attach a DD214 or other supporting documentation to the online application to claim Veterans Preference. NOTE: Resume and professional references may be attached to the online application, but not in place of the completed application. A skills test may be conducted at time of interview.  Army 72, 92  NavyMeteorology and Oceanography, Restricted Line (Information Dominance)  Coast GuardMST, 790, 72  Marine Corps68, 88  Air Force1W, 8E, 9S, 15  http://www.hr.sao.state.tx.us/Compensation/MilitaryCrosswalk/MOSC_NaturalResources.pdf"}