{"jobID": "2596382430", "jobLocation": "Mountain_View_CA", "jobTitle": "Business System Analyst Samsung Pay Data Analytics Team", "companyRating": "2.6", "companyInfo": {"Website": "www.sra.samsung.com", "Headquarters": "Mountain View, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Sony, LG Electronics, Nokia"}, "estimatedSalary": "104000", "jobDescription": " This is a great opportunity for a talented and hard-working business/system analyst to join and build data solutions for millions of users of the worlds best-selling mobile devices. The Data Analytics Team focuses on the rapid development of data platform, algorithms, and frameworks for Samsung Pay, the worlds most widely accepted mobile payment service. This is an exciting opportunity for anyone who are interested in envisioning, prototyping and implementing cutting-edge products with a growing team.  Come join the Samsung Pay Data Analytics team and help us define and develop the future role of mobile payments! Responsibilities may include, but are not limited to:Elicit, analyze and document requirements for technical solutionsAssist the product management team in refining business requirementsDesign and perform complex analyses to determine resolutions that clarify and address operational and business concernsTranslate business requirements into technical/project deliverablesConsider multiple scenarios and potential outcomes for recommending actions based on analysisGenerate, analyze and review reports for and communicate with key stakeholdersPrepare and process data upon requestConduct data-driven analysis for business processesGenerate and deliver technical presentations for both technical and non-technical audiencesIdentify business opportunities and recommend creative solutions to complex problemsMinimum qualifications:BA/BS degree in Computer Science, Engineering or related technical field or equivalent practical experienceExcellent professional, organizational, and interpersonal skillsStrong communication and presentation skills, comfortable with engaging with technical and business stakeholders at all levelsExcellent conceptual, problem solving, and analytical skillsProficient in SQL and database systems (e.g., PostgreSQL, MySQL, Redshift)Experience of analyzing data and creating reports with spreadsheets and PowerPoint or other technologiesExperience of using data analytics to drive business outcomesBasic programming skills with Python/JavaPreferred qualifications:MS or PhD degree in Engineering, MBA or related technical field3 years of experience in sales operations, strategy or marketingBasic knowledge of data visualization tools (e.g., Qlik, Tableau) Samsung is an EEO/Veterans/Disabled/LGBT employer. We welcome and encourage diversity as we strive to create an inclusive workplace."}