{"jobID": "2820378025", "jobLocation": "Titusville_NJ", "jobTitle": "Signal Management Scientist", "companyRating": null, "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": null, "jobDescription": " Janssen Pharmaceutical  Research & Development, L.L.C., a member of the Johnson & Johnson  Family of Companies, is recruiting for a Signal Management Scientist. This  position will be based in Horsham, PA, Raritan, NJ, or Titusville, NJ.  At the Janssen Pharmaceutical  Companies of Johnson & Johnson, what matters most is helping people live  full and healthy lives. We focus on treating, curing and preventing some of the  most devastating and complex diseases of our time. And we pursue the most  promising science, wherever it might be found. Janssen Research &  Development, LLC discovers and develops innovative medical solutions to address  important unmet medical needs in oncology, immunology, neuroscience, infectious  diseases and vaccines, and cardiovascular and metabolic diseases. Please  visit http://www.JanssenRnD.com for more information.  We are Janssen. Our  mission drives us. Our patients inspire us. We collaborate with the world for  the health of everyone in it.  Thriving on a diverse  company culture, celebrating the uniqueness of our employees and committed to  inclusion. Proud to be an equal opportunity employer.  The objective of Signal Management Scientist is to implement  Signal Management Group (SMG) surveillance strategies for proactive and  systematic detection and evaluation of new safety signals and emerging trends  from pre and post marketing safety data. These activities include the  evaluation (and piloting) as well as use of novel, computer-assisted tools and  methodologies for analysis of internal company safety data, international  regulatory safety databases, and other data sources, e.g. claims and electronic  medical records and social media.  This position, in partnership with other SMG physicians and  scientists, develops and implements product-specific surveillance plans,  performs signal detection activities, including signal validation, and  participates in communication of emerging signals in forums, such as the  Product Team Meeting, Signal Management Teams, and monthly Product Quality  Meetings. This position will also participate in the development of strategies  for signal evaluation, and may include performing activities supporting signal  evaluation, such as case definition development (including database query  criteria), review of the signal tracking system, ad hoc data mining FAERS,  Vigibase, and SCEPTRE, and text mining.Responsibilities:Identify and assess (validate) new  safety signals and trends by conducting systematic reviews of aggregate data  with a focus on spontaneous adverse event reports. This includes signal  detection activities in safety platforms, including SMART, routine and ad hoc  data mining in Empirica Signal, and signal entry to Empirica Topics.Prepare reviews of topics and summary  analysis reports of safety data, in consultation with the SMG physicians.  Provide recommendations for further evaluation.Work with key customers and business partners (MSOs, PVERs, and  SSPs) in developing and implementing product specific pharmacovigilance plans.Participate as member of the matrix  teams to address product specific safety issues, assist in the development of  signal evaluation strategies, and participate in signal evaluation, including  literature reviews. Communicate findings from routine and ad hoc signal  detection and assessment activities.Assist in the development and  implementation of programmatic surveillance of adverse event reports for  potential safety and product quality issues.Assist in the evaluation of novel,  computer-assisted tools and methodologies for analysis of safety data,  including piloting new data source and methodologies.QualificationsA minimum of an advanced degree in a health-care discipline (RN, MSc,  M.P.H., etc) is required. A doctoral  degree in the above is preferred but not required (e.g.Pharm.D. PhD).A minimum of 3 years of experience in post-marketing safety data  analysis is requiredFamiliarity with safety analysis, including case definition  development, case series analysis, and literature review is requiredAn understanding of global health authority regulations and  guidances surrounding the processing, reporting and evaluation of adverse  events is preferredGood understanding in single case processing, aggregate data  review and evaluation of drug safety issues, knowledge of adverse event  dictionaries, core labeling, preparation and review of Periodic Safety Review  are requiredAbility to present complex data in a concise and understandable  scientific manner is essential.Ability to manipulate data in platforms such as Excel and SAS JMP  is required.Primary Location United States-Pennsylvania-Horsham Other Locations North America-United States-New Jersey-Raritan, North America-United States-New Jersey-Titusville Organization Janssen Research & Development, LLC. (6084) Job Function Drug & Product Safety Science Requisition ID3552180607"}