{"jobID": "2737338865", "jobLocation": "Menlo_Park_CA", "jobTitle": "Data Scientist, Analytics-Growth Infrastructure", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "155000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.  Serving billions of people depends on advanced tools and systems to power products and enable analysis at scale. This role would help develop those central systems and services that power products, research and development across Facebook's largest products. These are data-intensive problems that deal with complex back-end systems, applied machine learning problems and analysis platforms used by data scientists, engineers and product teams across the company.  One important initiative in this area is driving quality and rigor across all of the company's external-facing metrics. This includes developing the central metrics infrastructure, and partnering with teams across the company to improve quality of metrics to the highest standard. This area is especially suited for somebody who enjoys diving deep into new areas and systems, driving best practices across product and analytics teams. This position is based in our Menlo Park offices. Responsibilities:"}