{"jobID": "2645553163", "jobLocation": "Mountain_View_CA", "jobTitle": "Business Data Analyst - Ads", "companyRating": "4.5", "companyInfo": {"Website": "www.quora.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "108000", "jobDescription": "Quora's mission is to share and grow the world's knowledge, and monetization plays an important role in empowering us achieve this mission. You will be a key member of an early stage team working to grow the success of our monetization efforts. We recently launched our first advertising products and are seeking to build out our core team. The business data analyst on ads is responsible for driving the business analytics that surface opportunities in sales, marketing, campaign delivery and measurement. You will draw on your product and business knowledge, available metrics, insights from teammates, and your industry experience to know where to best focus quantitative efforts for maximum impact. You're capable of executing independently and are energized by ambiguity. You stay on top of the digital media industry in order to be aware of important trends that impact your product and business. We are a highly cross-functional team and recognize we have the most success in working together, and as a result you will build strong cross-functional partnerships across Product, Sales, Marketing, and Engineering. You're curious, driven, and excited to make a significant impact in helping achieve the company's mission.Responsibilities: Work on a early stage team focused on generating ad revenue for the success of the company and missionIndependently drive business analytics projects that will grow revenueArchitect and build new data models that enable high-efficiency analysis in a complex social productConduct and lead analysis investigations into market segmentations, case studies, sales pipelines, vertical prioritization, ad inventories, and campaign effectivenessBuild effective cross-functional relationships across sales, marketing, product management, and engineering to jointly grow Quora's monetization potentialUnderstand digital media industry trends, and develop proof points highlighting the effectiveness of advertising on QuoraUse Python, JavaScript, and/or other scripting languages to design and develop new user-facing tools and dashboarding systems to empower monetization teamsRequirements:"}