{"jobID": "2805350217", "jobLocation": "Washington_DC", "jobTitle": "eDiscovery Sales Manager", "companyRating": null, "companyInfo": {"Website": "www.consilio.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Overview: The Regional Sales Manager is central to Consilio’s continued growth strategy. The Manager will work with a team comprised of outside sales resources and will draw from our history of innovation and dominance in the space of providing services to the most recognized corporate and law firm names in the country. Our proven performance is consistently supported by continuous investment in solutions that anticipate or outpace industry trends; by attracting and retaining the best talent in the industry; and by supporting our clients and employees with best-in-class facilities and infrastructure.  The Manager will be accountable for sales, revenue and profitability goals of their team.  Consilio is a highly collaborative environment. Success will require the Manager to work with multiple internally with multiple functions/levels including Managing Directors across practice lines, Delivery, Marketing, Finance, Operations, Legal, Technology, Human Resources, and the Executive Leadership Team up to the C-level. Externally, the Manager will be brilliant and will seamlessly adapt communication, approach, sales strategy and style to maximize impact at all organizational levels up to Managing Partner, General Counsel and C-levels.  While exceeding individual and team sales targets is critical, success will also be determined by his/her results in creating long-term client partnerships and the extent to which he/she creates and fosters a consistent approach to integrating sales across all business areas to create a single, clear and powerful client experience. Responsibilities:Operate in a management capacity leveraging personal track-record of originating and closing large engagements within corporations and national/global law firms. Work with the Eastern Managing Director of Sales to develop, deploy and deliver a One Consilio approach within a set of marquis clients and specific industry verticals. This will require the Manager to utilize well-developed operations skills and organizational IQ to coordinate sales activities across multiple solution offerings and multiple internal and external stakeholders. Team development, business planning, forecasting, and pipeline management.Requirements:BA/BS degree with minimum 3 years’ experience managing a team at an eDiscovery service provider.A demonstrable and documented track record of predictability, consistency, and the overachievement of revenue targets.Strong sales operations experience; proven discipline with regard to developing and effectively executing detailed account plans, penetration strategies and pipeline management strategies.Proven skills to set and deliver against revenue and profitability commitments.Demonstrated ability to actively lead, manage and strategize through multiple concurrent selling cycles of varied lengths.Strong decision-making skills; comfort making decisions when only few facts are known.A flexible approach to communication; able to adapt message quickly to the appropriate level or function with poise, polish, and relevance.A highly intelligent and energetic executive who quickly assesses business situations and acts in an informed and decisive manner to drive required results.Excellent written and verbal skills; ability to articulate complex subject matter to non-technical audiences in a concise and compelling manner.Entrepreneurial spirit; the drive to build and grow a dynamic and vibrant business."}