{"jobID": "2682276836", "jobLocation": "Livonia_MI", "jobTitle": "Vice President, Data Sciences", "companyRating": null, "companyInfo": {"Website": "www.marketstrategies.com", "Headquarters": "Livonia, MI", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " GfK, Ipsos"}, "estimatedSalary": null, "jobDescription": "Vice President, Data Sciences Market Strategies International is seeking a VP, Data Sciences to lead our data sciences initiatives and set the standards for our practice. You will consult directly with our clients which include well-known brands you would recognize. You should have at least 7 years of relevant work experience to qualify.  As a Vice President of Data Sciences, you would be expected to provide thought leadership and consultation to internal clients regarding research design, methodology, and analysis as they respond to client RFPs and projects. You would also be responsible for identifying and developing new Data Science solutions which either supplement or complement existing advanced analytical solutions. Initially, this will be an independent contributor role now working with existing Marketing Sciences team members but has the potential to grow into a leadership position. Ability and/or willingness to support traditional marketing science engagements related to choice modeling, segmentation, customer experience or brand/ad tracking desired but not essential.  Based on your experience, you would be matrixed into a few of our industry sectors, supporting them primarily. You would also be leveraged across all seven industries we serve depending on where the richest opportunities for data sciences projects reside.  For clarification, here’s how we anticipate your time being spent:  70% project work and RFP support activities  20% R&D; for enhancements or new approaches / analytical products  10% Mentoring staff (outside of guidance you provide during project work) Important – 45% of this job is active project work - and you may need to “roll up your sleeves” to actively run the analysis and tactically execute the analytical plans you designed in 70% of those projects. We have 1 position open for any of the following locations: Metro Detroit area (Livonia);AtlantaGreater Boston (Cambridge)Portland, Oregon; orLittle Rock, ArkansasKey things you get to do in this job:Be the authority on data sciences at Market StrategiesMentor members of our advanced analytics team in data science approaches to support your workPartner with internal clients to uncover new opportunities for Market Strategies to win more data sciences work, leading to revenue growth for the business.Develop new approaches or analytical products to differentiate or enhance Market Strategies’ solutionsExamples of projects our data sciences team has worked on this past year:Leveraging of client CRM data to establish KPI thresholds to drive client businessDevelopment of predictive models to help clients understand the value of incremental improvement in NPS or SatisfactionDevelopment of segmentation frameworks based on secondary or third-party data to supplement, replace or predict survey-based dataLinking of models based on behavioral data with those based on survey responses to help clients understand the linkages between behavioral patterns and attitudesTagging clients’ behavioral databases with indicators of likelihood of product adoption likelihood to drive direct marketing efforts based on models developed by linking behavioral and survey dataResponsibilities:Serve as the thought leader on Market Strategies’ data sciences products and offerings, as well as trends, practices and applications of data sciences solutionsConsult with industry group leaders on their strategy for growth of data sciences projects among their clients or prospective clients and support resulting customer-facing sales activities.Assess and cultivate long-term strategic goals for business intelligence (BI) development in conjunction with client managers and other stakeholders.Advise project teams regarding analytic techniques and requirements to help them choose the appropriate methodology for the clients’ business questions.Analyze, develop, and interpret data models and protocols for mining client databases and make recommendations concerning improvements as needed.Independently create or oversee execution of data mining architectures, coding standards, statistical reporting and data analysis methodologies in a timely fashion with a high degree of quality.Design and implement statistical data quality procedures around data sources.Adeptly present analysis results to internal and external clients.Conduct R&D; to identify new data sources or new uses for existing data sources as well as new analytical solutions.Qualifications:Must have an advanced degree in data sciences, marketing analytics, applied mathematics or statistics, behavioral or social sciences, or other relevant field.A minimum of 7 years of experience working with data and advanced analytics CRM/Database Marketing/Analytics ConsultingApplied Operations ResearchStatistical Model DevelopmentData MiningMust demonstrate proficiency in data mining models, structures, or methods.Strong familiarity with data preparation, processing, classification and forecastingPrior technical experience with relational databases.Direct experience with data management techniques and algorithm development.Technical SkillsExpertise in one or more data analysis packages such as SPSS, SAS, STATA, or R required. Must have ability to manipulate large data sets including tuning and troubleshooting experience.Experienced with SQL desirableAdvanced-level Excel skills, including the use of macros, pivot tables, and other advanced functions are required.Proficiency in MS Word, PowerPoint, and Access.SkillsStrong logic and critical thinking skillsStrong verbal, written, and presentational communication skillsAble to build rapport and effective relationships with internal and external clientsAble to give appropriate feedback to senior-level staff cross functionallyAble to prioritize, multitask, and work under pressureAble to make decisions under pressureAble to handle high-tension situations comfortably with diplomacy and tactStrong attention to detailAn ability to work across a variety of industry sectors and to integrate cross-industry learningsEffective planning skills, both short and long term, and ability to effectively manage multiple projects simultaneously.Must exhibit high ethical standards.Able to work effectively within a team-oriented, highly collaborative environmentOur environment offers you:A team of 12 marketing and data scientists plus 100’s of internal client or industry analysts with whom to collaborate.Exposure to a rich variety of clients and industriesPeace of mind working for a company with a commitment to conducting research ethicallyFun colleagues and a familial culture that values each personOpportunities to travel or relocate to one of our regional offices EEO/AA EMPLOYER M/F/V/D  #CB"}