{"jobID": "2837669123", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist/Architect with Polygraph", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Description:Description: The Data Scientist/Architect will be expected to build statistical models, test hypotheses, interpret, summarize, visualize, and succinctly report on data holdings. The Data Scientist/Architect will analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses. The Data Scientist/Architect may build risk scoring models, recommendation engines, spam classifiers, sentiment analyzers and classifiers for unstructured and semi-structured data and perform machine learning, natural language, and statistical analysis methods, such as classification, collaborative filtering, association rules, sentiment analysis, topic modeling, time-series analysis, regression, statistical inference, and validation methods. The position may require the Data Scientist to cluster large amounts of user generated content and process data in large-scale environments. The Data Scientist/Architect may evaluate and implement massive, scalable data stores, and optimize support for ad-hoc analysis across various data sources.  Additional Requirements/Skills:  1) Write scripts (coding) to do look ups and data pulls  2) Provide development, coding and engineering support to system alerts and sensors to monitor user activity  3) Extract and transform audit log data  4) Maintain Adobe Insight servers  5) Design, test & implement auditing and reporting processes; document all processes described  6) Design, test & implement compliance processes and regimes; document all processes described  7) Conduct technical investigations of data handling incidents  8) Coordinate with team members, including lawyers and management that are non-technical  9) Conduct technical investigations using Adobe Insight and Workbench  \"External Referral Eligible\"Qualifications:EDUCATION AND EXPERIENCE: Bachelor's degree in related discipline and 8+ years experience, or masters degree in fields such as mathematics, engineering, social sciences and 5+ years experience.Leidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}