{"jobID": "2474495468", "jobLocation": "Palo_Alto_CA", "jobTitle": "Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.tableau.com", "Headquarters": "Seattle, WA", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Company - Public (DATA) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Cognos"}, "estimatedSalary": "109000", "jobDescription": " **What youll be doing**We are looking for creative computer scientists to join our research team inPalo Alto, CA and Seattle, WA. We hire people who enjoy doing appliedindustry-style research on Tableaus mission to help people see and understanddata. In particular, we are looking for people who can rapidly innovate indisciplines such as information visualization, human-computer interaction,databases, distributed systems and cloud computing, machine learning, naturallanguage processing, information retrieval, web analytics and mobile to name afew. As a research scientist, you will have the flexibility to choose your ownprojects, working on real-world problems that result in impact to Tableausbusiness and customers. We have found that collaborations between passionateindividuals lead to great things. We are actively seeking candidates whobring this infectious enthusiasm and value curiosity, imagination andperseverance in creating and productizing new technologies. You love to shareyour excitement with customers, research scientists, developers, productmanagers and executives through excellent communication, presentation, andinterpersonal skills. Some of the things youll be doing include * Manage a research portfolio that results in impact to Tableaus business and customers. * Design and implement high-quality prototypes to validate research innovations and communicate those innovations to the rest of Tableau. * Work directly with developers and feature teams to ensure designs are implemented as useful user experiences. * Work with strategic area leadership to provide input on strategy and planning. * Monitor and report on external research and innovation in areas relevant to Tableau. * Be an eager evangelist, whether presenting academic papers or giving talks inside and outside Tableau including at conferences and to customers.**Who you are ** * **True Team Player: **Visit and engage with teams in Seattle both in-person and remotely. * **Customer Focused:** Build significant knowledge of Tableaus customers and business goals to further innovation and help create new products and services. * **Education/Experience:** PhD or equivalent in one or more areas relevant to Tableaus mission. * **You are a Recruiter! **Tableau hires company builders and, in this role, you will be asked to be on the constant lookout for the best talent to bring onboard to help us continue to build one of the best companies in the world!Tableau Software is a company on a mission. We help people see and understand their data. After a highly successful IPO in 2013, Tableau has become a market-defining company in the business intelligence industry. Our culture is casual and high-energy. We are passionate about our product and our mission and we are loyal to each other and our company. We value work/life balance, efficiency, simplicity, freakishly friendly customer service, and making a difference in the world!Tableau Software is an Equal Opportunity Employer."}