{"jobID": "2836748918", "jobLocation": "Morristown_NJ", "jobTitle": "Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.atlantichealth.org", "Headquarters": "Florham Park, NJ", "Size": "201 to 500 employees", "Founded": " 1998", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Newark Beth Israel Medical Center, Trinitas Regional Medical Center, East Orange General Hospital"}, "estimatedSalary": "70000", "jobDescription": " Morristown Medical Center is seeking a part time Data Analyst position our Quality & Outcomes department. Assists with the coordination and facilitation of Quality, Patient Safety, Infection Prevention and other data mining and collating functions.Serves as a liaison of Quality reporting and participation requirements for external agencies such as Joint Commission, CMS, NHSN, NJDOH, etc.Performs audits and medical record reviews.Provides the organization with Quality, Patient Safety, Infection Prevention comparative and benchmarking data through expert utilization of large clinical database and AHS reporting tools.Education:Bachelor’s degree in health care related fieldRequirements:3-5 years clinical or analytical backgroundExperience with performance improvement techniquesExperience with data collection and analysisProficient in all applications of Microsoft OfficeExcellent organizational and workflow skillsStrong interpersonal skillsAtlantic Health System has created a Trusted Network of Caring™, delivering the right care, at the right quality, at the right time, at the right place and at the right cost. We aim to deliver the highest quality, safety and care combined the best experience for our patients and their families. We are confident that you will find success within Atlantic Health System, which has been named for the 10th year in a row to Fortune’s “Top 100 Best U.S. Companies to Work For” list. We believe you’ll find that our culture of collaboration and care exemplifies the value we place on our patients, their families and our employees.All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status."}