{"jobID": "2831783166", "jobLocation": "San_Antonio_TX", "jobTitle": "PRINCIPAL ENGINEER - PRINCIPAL SCIENTIST - SR. RESEARCH ENGINEER - AUTOMOTIVE", "companyRating": "3.9", "companyInfo": {"Website": "www.swri.org", "Headquarters": "San Antonio, TX", "Size": "1001 to 5000 employees", "Founded": " 1947", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Los Alamos National Laboratory, Battelle, SRI International"}, "estimatedSalary": "90000", "jobDescription": " PRINCIPAL ENGINEER - PRINCIPAL SCIENTIST - SR. RESEARCH ENGINEER - AUTOMOTIVEJob code: 03-01168Email a friend  Printer friendly  Job Summary:The candidate will be expected to support the Powertrain Engineering Division by leading the development of new and innovative concepts to utilize catalysts and emission control systems to enable improved fuel efficiency and/or reduced criteria pollutant emissions from internal combustion engines; managing and executing projects in the area of catalyst and emissions control system research and development; developing test plans to evaluate new hardware or identify fundamental interactions of feed gas stream and catalytic devices; conducting laboratory testing involving engine dynamometer investigations as well as bench test facilities, comprehensive data analysis and provide clear and concise summaries to clients and/or technical management, and troubleshooting/resolving test stand problems.Education/Experience:Requires a MS or a PhD degree in Mechanical Engineering, Chemical Engineering, or Chemistry with 5-15 years experience; must have at least a 3.0 GPA. Must have experience in emission control system design, development, integration and calibration; managing large scale research programs; managing catalyst laboratory operations. Must have experience using tools such as Microsoft Project and statistical tools; such as Minitab. Must have experience leading research related to fundamental catalyst performance, lab based evaluation of catalytic devices and emission control devices (three-way catalysts, oxidation catalysts, wall flow particulate filters, selective catalysts). Experience with LabVIEW and MATLAB/Simulink are preferred. Experience with Controls System Development is preferred. Experience with GT Power or AVL Boost is preferred. Experience with design, development and installation of new catalyst testing facilities is preferred. A valid/clear driver's license is required.Special Considerations:  Job Locations: San Antonio, TexasFor more information about this division, visit the Powertrain Engineering home page.  An Equal Employment Opportunity/Affirmative Action Employer  Race/Color/Religion/Sex/Sexual Orientation/Gender Identity/National Origin/Disabled/Veteran  Committed to Diversity in the Workplace"}