{"jobID": "2819481898", "jobLocation": "Mountain_View_CA", "jobTitle": "Head of Data Science, Chronicle", "companyRating": null, "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": null, "jobDescription": " As Lead Data Scientist for Chronicle, you?ll lead a team of data scientists and machine learning experts working to solve our customers? most pressing cyber-security challenges. As the team lead, you will not only define our machine learning and data science strategy and roadmap, but also actively prototype and productionize analytics, visualizations and machine learning models at massive scale. Last but certainly not least, you will build and manage a growing team of data science and machine learning practitioners. You are excited to do hands-on work as well as setting our broader machine learning agenda and leading the team.  Born from X, the moonshot factory, Chronicle is the newest independent company within Alphabet. We are dedicated to helping companies find and stop cyber attacks before they cause harm. We work with the entire security industry to give good the advantage in the fight against cybercrime. Joining experts in large-scale cloud computing, big data, machine learning, and cybersecurity, you'll help build out the next generation of security intelligence solutions.  ## Responsibilities Define and execute Chronicle?s data science and machine learning strategy and roadmap.Investigate and prototype new machine learning approaches, and build production pipelines operating on massive amounts of cyber-security data.Build and mentor a great team of machine learning experts and data scientists.Manage your team?s project priorities, deadlines, and deliverables.Represent Chronicle at professional conferences; publish your work in journals. ## Qualifications Minimum qualifications:Master?s degree in Machine Learning, related technical field, or equivalent practical experience.8 years of relevant work experience.Experience building prototype and production machine learning pipelines (supervised and unsupervised models, etc.) for data sets.Experience managing a team of machine learning practitioners and data scientists.Preferred qualifications:PhD in Machine Learning, related technical field or equivalent practical experience.10 years of relevant work experience.Experience in analyzing/processing cyber-security-related big-data and strong familiarity with cyber-security (attacks, defenses).* * At Google, we don?t just accept difference - we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know. *To all recruitment agencies:** Google does not accept agency resumes. Please do not forward resumes to our jobs alias, Google employees or any other company location. Google is not responsible for any fees related to unsolicited resumes."}