{"jobID": "2817714558", "jobLocation": "Chicago_IL", "jobTitle": "Polymer Process Improvement Scientist", "companyRating": null, "companyInfo": {"Website": "www.cameroncraig.com", "Headquarters": "Mooresville, NC", "Size": "1 to 50 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Career Brokers, Job Juncture, Apple & Associates"}, "estimatedSalary": null, "jobDescription": "Minimum Requirements: B.S. in Chemical Engineering, Chemistry or Polymer Science with 10 years of experience or five years’ experience with an M.S. or Ph.D. out any process that uses profile-sheet extrusion, extrusion coating, injection molding or reaction injection molding (RIM ). This person must have the ability to demonstrate strong technical credentials and have experience with process optimization, scale-up, developing new products/processes, data analysis, rheology, and customer interface. Pluses would be experience within both a research and plant environment. Job Description: Our client is a state-of-the-art company within the electronic materials industry that produces extruded materials, molded materials and clean room specialty chemicals for major electronic device manufacturers. This new facility in the Chicago suburbs houses research & development, pilot plants, manufacturing, tech service and sales departments. The main focus for this role will be on the extruded material/molded business, the optimization of existing processes in the US, developing custom-made materials for customers and developing brand new processes and products. Responsibilities will also include the following: scale-up from bench to full scale production, working with material scientists, data analysis, and working directly with clients. This company is an international firm with manufacturing facilities located here in the U.S., as well as in East Asia (China, Korea, and Japan). Travel is limited and will be primarily within the US. This company offers a generous bonus and relocation package. "}