{"jobID": "2828424620", "jobLocation": "San_Francisco_CA", "jobTitle": "Clinical Lab Scientist (CLS/MLT/MT) 13-week Travel", "companyRating": null, "companyInfo": {"Website": "www.soliant.com", "Headquarters": "Tucker, GA", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Clinical Lab Scientist (CLS/MLT/MT) 13-week Travel Job  We have an immediate interim full-time position available for a Clinical Lab Scientist with 2+ years’ experience and a readiness to tackle the night shift with the freedom of the tourist life-style during the day if you wish. Let me take you to a place of happiness and peace. Sit in on a yoga session in Dolores Park while admiring the Dutch Windmill across from Ocean Beach in beautiful San Francisco, California. If this is an ideal opportunity for you I would love to be the best resource possible in connecting you with your next fun-filled summer assignment with the ease and understanding you will be well taken care of. If you meet the following requirements and look forward to this exciting experience, shoot me an e-mail or give me a buzz with my contact information listed below and the rest will be history. Qualifications:2+ years recent experienceBLS CertifiedActive CertificationsEmployment Type & Industry:Hospital Setting13-week contractNight ShiftResponsibilities:Preparing cultures of tissue samplesEstablishing and monitoring programs that ensure data accuracyCross-matching blood for transfusionsAnalyzing lab reports for accuracyOperating and calibrating equipmentDelivering test results to physicians, researchers or patientsCollecting and studying blood samples to determine morphologyBenefits:Competitive Compensation PackageContact Information: Susanna Garner  E-mail: Susanna.Garner@Soliant.com  Direct phone number: (281) 668-0648  www.Soliant.com"}