{"jobID": "2832839730", "jobLocation": "Princeton_NJ", "jobTitle": "US Medical, Promotional Review Scientist", "companyRating": null, "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. And driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives. Responsibilities As a member of the US Medical Promotional Review (PReP) team, is responsible for providing input and advice to conduct the review of promotional materials for scientific/medical validity across BMS' Portfolio.  Critically review and recommend changes to promotional materials/activities to ensure balance of the messages, medical accuracy and appropriateness of the content of the materials/activities in accordance with relevant guidance.  Proactively align and build strong relationships with champions and other advisors/stakeholders on issues or concerns to provide medical advice to ensure balance of messages in accordance with relevant guidelines.  Participate in internal and external meetings (training, educational and others, including medical congresses) to remain current on ever changing regulations, relevant new medical/scientific information and commercial strategy  Determine acceptability of data/references used to support promotional claims and provide expert guidance as well as effective negotiation leading to resolution for approval of pieces Qualifications PharmD, MD, PhD preferred with minimum of 3 years' experience in clinical practice or the pharmaceutical industry.  Demonstrates thorough understanding of medical writing and medical review of promotional materials in the pharmaceutical industry  Demonstrated ability to manage various projects, solve problems, deliver on commitments, and work with multidisciplinary teams.  Strong scientific/medical written and verbal communication skills required.  Knowledge of the pharmaceutical industry as well as the external compliance, transparency&conflict-of-interest; environments  Experience in delivering a customer-focused service  Developed business acumen and ability to impact and influence senior internal stakeholders  Strong leadership and organizational skills with demonstrated success in driving optimal business results in a complex matrix organization required  Prior experience in therapy area preferred"}