{"jobID": "2834364798", "jobLocation": "San_Diego_CA", "jobTitle": "Experienced Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.baesystems.com/us", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Aerospace & Defense", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Northrop Grumman, Lockheed Martin, Raytheon"}, "estimatedSalary": "134000", "jobDescription": "Job Description Leverage technical and analytical expertise to explore and examine data from multiple disparate sources with the goal of discovering patterns and previously hidden insights, which in turn can provide a competitive advantage or address a pressing business problem. Leverage knowledge of advanced mathematical and statistical concepts and computer science expertise to bridge the gap between technologists and mathematicians and ensure that software solutions meet analytic requirements. Contribute as part of the software product development team with responsibility across the entire life cycle, including requirements gathering and analysis, process and systems definition, data analysis, presentation of analysis to peers, leadership, and customers in a format that is understandable and supports decision making.Typical Education & Experience Typically a Bachelor's Degree and 8 years work experience or equivalent experienceRequired Skills and Education - Strong statistical data analysis background and a good understanding of a variety of algorithms and techniques Experience in designing and implementing optimized strategies for data acquisition, ingest (batch and streaming), storage, and processing of structured and unstructured dataExperience with designing and implementing machine learning, data mining, statistics, or graph algorithmsExperience with at least one statistical programming language such as Matlab, R and PythonExperience with Big Data, Cloud computing technologies, NoSQL systems, or Lambda architecturesExperience with general purpose object - oriented programming, including Java, Python, Scala, or JavaScript and ability to build working prototype solutionsExcellent verbal and written communication skillsExperience with source control and dependency management software, including Git or MavenExperience in developing solutions with and integrating and extending free and open - source software (FOSS) or COTS productsAbility to obtain a security clearanceBS degree required Preferred Skills and Education -Experience with Department of Defense (Army/Navy/Air force/etc.) and Intelligence Agencies Experience with Amazon Web Services (AWS) or Microsoft Azure Cloud servicesExperience with the Big Data ecosystem, including HDFS, Hive, HBase, Accumulo, or SparkExperience with Storm, Kafka, NiFi, or similar ETL frameworksExperience with writing analytics using MapReduce, Pig, SQL, or SparkSQLMS degree in CS or Software Engineering About BAE Systems Electronic Systems BAE Systems is a premier global defense and security company with approximately 90,000 employees delivering a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support and services.  The Electronic Systems (ES) sector spans the commercial and defense electronics markets with a broad portfolio of mission-critical electronic systems, including flight and engine controls; electronic warfare and night vision systems; surveillance and reconnaissance sensors; secure networked communications equipment; geospatial imagery intelligence products and systems; mission management; and power-and energy-management systems. Headquartered in Nashua, New Hampshire, ES employs approximately 13,000 people globally, with engineering and manufacturing functions primarily in the United States, United Kingdom, and Israel. Equal Opportunity Employer/Females/Minorities/Veterans/Disabled/Sexual Orientation/Gender Identity/Gender Expression  Apply on Company Website  Job ID: 39366BR  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  BAE Systems  BAE Systems is a global defence, aerospace and security company employing around 83,400 people worldwide. Our wide-ranging products and services cover air, land and naval forces, as well as advanced electronics, security, information technology, and support services. We provide some of the world's most advanced, technology-led defence, aerospace and security solutions and employ a skilled workforce of some 83,400 people in over 40 countries. Working with customers and local partners, we develop, engineer, manufacture and support products and systems to deliver military capability, protect national security and people and keep critical information and infrastructure secure. Contact Info San Diego, CA 92127"}