{"jobID": "2678141884", "jobLocation": "Falls_Church_VA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.capefox-gs.com", "Headquarters": "Manassas, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title:Data AnalystJob Summary:Data Analyst would be responsible for conducting full lifecycle analysis to include requirements, activities and design. Data analysts will develop analysis and reporting capabilities. They will also monitor performance and quality control plans to identify improvements.ResponsibilitiesInterprets data, analyze results using statistical techniques and provide ongoing reports for upper management.Develops and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and quality. Acquires data from primary or secondary data sources and maintain databases/data systems. Identifies, analyze, and interpret trends or patterns in complex data sets.Other duties as assigned. Preferences and RequirementsMust be able to lift up to 25 pounds.Sit or Stand throughout a regular work day.Ability to work on computer for long periods.Strong written and oral communication skills, organizational skills, and attention to detail.Self-motivated with minimal oversight.Computer skills including Microsoft Word, Excel, PowerPoint, and Outlook.Some travel may be required.Must have authorization to work in the United States as defined by the Immigration Reform Act of 1986. Special Job FactsMonday through FridayAbility to work under deadline pressure, handle stress and deliver professional results.Long hours and weekends may be required to meet deliverables.  Travel  Shift Type  Job Type  Full-time  Date Needed By  Salary Grade  Job Requirements Education/ExperienceBachelor’s Degree in Mathematics, Economics, Computer Science, Information Management or Statistics or related field.Minimum of three or more years of experience in related field.Technical expertise regarding data models, database design development, data mining and segmentation techniques.Strong knowledge of and experience with reporting packages (Business Objects etc.), databases (SQL etc.), programming (XML, JavaScript, or ETL frameworks).Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.Cape Fox Corporation, its subsidiaries and affiliates provide equal employment opportunities to all persons and prohibit employment decisions on the basis of race, religion, color, creed, national origin, sex, age, disability, political affiliation, protected veteran status, or sexual orientation. Cape Fox Corporation, its subsidiaries and affiliates offer preference to Cape Fox Corporation shareholders, descendants and other Native Americans pursuant to Public Law 100-241.  Category  Other  Career Level  Experienced (Non-Manager)  Hiring Manager  Location  Bureau of Medicine and Surgery - Falls Church, VA 22042 US (Primary) Exemption Type  Education  Bachelor's Degree  # of Hires Needed  1 "}