{"jobID": "2767719160", "jobLocation": "Princeton_NJ", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.otsuka-us.com", "Headquarters": "Princeton, NJ", "Size": "1001 to 5000 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " Post-doctoral scientist/Research Fellow will support translational research and/or technology development for drug discovery and clinical development, clinical trial operational efficiencies, digital assessments and health products, and other intelligent scientific/innovation information management tools. This is a short-term position for approximately 1 year and can be extended for an additional term upon satisfactory progress. Additional Responsibilities:Support translational research in the CNS and oncology disease areas on the identification of prognostic and predictive digital/molecular/imaging biomarkers, characterization of disease and its progression, and identifying/development of new assays towards diagnostics/algorithms that enable personalized/precision medicine by guiding targeted, individualized use of therapies to the patients that will benefit the most.Develop innovative AI/machine learning/NLP/Signal Processing/Logic/statistics and mathematical modeling methods to provide therapeutic insights by leveraging internal, external and real world data sources. Experienced in graphical modeling (Bayesian networks, Hidden Markov modeling) and/or deep learning.Guide evidence based product development by extracting market intelligence from such real-world data sources through knowledge representation and pattern recognition. Required:  Must have been awarded or working towards an advanced degree (PhD/Masters students) in life sciences, computational sciences or engineering. The candidate must have demonstrated application of advanced computational techniques to life sciences or healthcare problems or must have built technology solutions/platforms which have potential applications in healthcare settings. Demonstrated knowledge and experience of application of AI/Machine learning/Robotics/Signal Processing/Scientific Computation/Human Computer Interface/Logic tools, Graph and Network algorithms and Semi-/Non-Parametric Statistical methods and software tools to real world data problems that are multi-scale, longitudinal and heterogeneous in natureMust be agile to grow in new directions, work with a team of scientists and practitioners from different functional areas to solve problems in pharmaceuticals. Must be able to bring insights to stakeholders with ability to extract therapeutic intelligence by leveraging internal, external and real world data sources.Demonstrated ability to use knowledge of most recent techniques, and develop new methodologiesExcellent software development skills, esp. in rapid prototypingEstablished publication record in peer reviewed journals/conference proceedings.Good programming skills in R/Python/MATLAB/Julia and C++/Java/Scala/Clojure/GO, etc.Knowledge of and experienced in working with public databases and real world databasesProficient in cloud technologies AWS/Google cloud/Azure or Openstack - Hadoop, Pig/Hive, Spark distributed computing platforms/analyticsProficient in Visualization tools like D3 and othersStrong knowledge of SQL and NoSQL databases is helpfulExperienced in version control systems (SVN, GIT, Mercurial)Experienced in Unix/Linux operating systemsExcellent communication skills Plus (good to have skills) Healthcare and Life Sciences experience is not mandatory. In fact, experience in gaming, human-computer interaction, AI/Machine Learning applied to various industries is highly desirable.Strong knowledge of CNS and Oncology disease areas is highly desirableExcellent knowledge of programming patterns and different types of programming languages like functional, declarative, rule, event, real-time, reactive etc., is highly desirable. Otsuka Pharmaceutical Company is a global healthcare company with the corporate philosophy: “Otsuka-people creating new products for better health worldwide.” Otsuka researches, develops, manufactures and markets innovative products, with a focus on pharmaceutical products to meet unmet medical needs and nutraceutical products for the maintenance of everyday health.  In pharmaceuticals, Otsuka is a leader in the challenging area of mental health and also has research programs on several under-addressed diseases including tuberculosis, a significant global public health issue. These commitments illustrate how Otsuka is a “big venture” company at heart, applying a youthful spirit of creativity in everything it does.  Otsuka Pharmaceutical Company is a subsidiary of Otsuka Holdings Co., Ltd. headquartered in Tokyo, Japan. The Otsuka group of companies employed 45,000 people worldwide and had consolidated sales of approximately USD 11 billion (€ 9.9 billion) in 2016.  All Otsuka stories start by taking the road less travelled. Learn more about Otsuka Pharmaceutical Company on its global website at www.otsuka.co.jp/en. Learn more about Otsuka in the U.S. at www.otsuka-us.com."}