{"jobID": "2542429531", "jobLocation": "Chicago_IL", "jobTitle": "F&O; Operations Static Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "F&O; Operations Static Data AnalystGrab the opportunity to achieve your full potential! Eclaro is looking for a F&O; Operations Static Data Analyst for our client in Chicago, IL.Eclaro’s client is one of the world's largest financial institutions, committed to providing the tools and services that bridge the gap between customers and their goals. If you’re up to the challenge, then take a chance at this rewarding opportunity!The role of a F&O; Operations Static Data Analyst will be supporting operations in the trading of global derivatives by maintaining various static data elements such as exchange related fees, regulatory fees, product attributes, and execution fees. These data elements are critical in ensuring regulatory compliance, client satisfaction and other key business factors. He/She will investigate and analyze data to ensure the static is set up correctly along with communicating internally with various departments regarding static issues. Strong analytical skills are needed in order to determine the correct actions to take. Efficient yet accurate data entry skills are critical. RESPONSIBILITIES:Maintenance of static data elements within various internal and 3rd party applications including data related to fees and product setupAnalyze and update fee static within MMFEE (GMI)Add and maintain exchange traded products within FUTM (GMI)Participate in operational improvement initiativesAssist in the implementation of new systems that drive automation and increase accuracy of data managementAssist with checking the accuracy of other team members workInvestigate fee breaks to ensure static data accuracyEffectively communicate internally; including front office and client services personnel regarding various operational issuesFind opportunities for increased efficiency and accuracy within the day to day workParticipate in various projects and initiativesEnsure all procedures are accurate and up to dateVarious ad-hoc requestsAdhere to all policies, procedures and regulationsQUALIFICATIONS:GMI application knowledgeAbility to thrive in a fast paced, changing environmentExcellent Microsoft Excel Skills (Microsoft Access knowledge a plus)Detail orientedExcellent communication skillsUnderstanding of front to back trade flowsStrong analytical ability, must be able to identify and resolve complex issuesAbility to work both independently and within a team settingProficient with Word, PowerPoint, Visio & OutlookInterested in applying?  Contact Charly Vie at charly@eclaro.com now.Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status."}