{"jobID": "2548755067", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr Data Engineer", "companyRating": "4.5", "companyInfo": {"Website": "www.appdynamics.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "170000", "jobDescription": "About Us AppDynamics is the Application Intelligence company. With AppDynamics, enterprises have real-time insights into application performance, user performance and business performance so they can move faster in an increasingly sophisticated, software-driven world. Our integrated suite of products is built on our innovative, enterprise-grade App iQ Platform that enables our customers to make faster decisions that enhance customer engagement and improve operational and business performance. AppDynamics is uniquely positioned to enable enterprises to accelerate their digital transformations by actively monitoring, analyzing, and optimizing complex application environments at scale which has led to proven success and trust with the Global 2000.  About You First and foremost, S./M.S. Degree in CS / EE (or related) from a top schoolSubstantial hands-on experience with data systems Spark, Hadoop, Elastic Search, SQL.Demonstrated experience productizing complex data systems (including tuning, administration, security, deployment, and transition to operations)Expert knowledge of Python, Java, multi-threaded developmentKnowledge of cloud computing infrastructure (e.g. EC2, S3, ELB, EMR) and their use in practiceAbout the Team At AppDynamics, our goal is to make it simple to manage modern, distributed, and extremely complex applications residing in both the cloud and the data center. Our customers run some of the largest web sites on the planet, and use our products to monitor and troubleshoot applications distributed across thousands of servers.  It is our teams responsibility to automate many of the monitoring and troubleshooting tasks using intelligent models and algorithms. We achieve this by developing and operationalizing algorithms and models that extracts actionable insights from the massive amount of data our product collects. We help our customers to spot problems earlier, identify root causes faster, and resolve them sooner all with less efforts. We use machine learning and many statistics tools to mine patterns and anomalies.  If you have a passion for searching solution for big data problems, building it out, and then tuning and productizing it to make it operationally rock solid, we want to talk to you! Core ResponsibilitiesAcquire, clean and structure data from multiple sources and maintain databases/data systemsWorking closely with data scientists to develop and operationalize models and algorithms Support our operations team to ensure that the data science services well in practice.Perks We know that the award-winning culture at AppDynamics is something to brag about, but here are more reasons that make you excited to get out of bed to come in the morning, like: Medical, dental, vision coverage401k match (4.5%)Wellness perks (gym, hobbies, education, store discounts, personal finance)4 weeks PTO, 5 days VTO, 14 holidays (including 1 birthday PTO and 1 floating holiday)Mandatory company shut down between Christmas and New YearsWeekly catered breakfast and lunch, and all the snacks, fruits and drinks your heart desires, monthly happy hour events, and weekly massagesBrand new state of the art office in downtown San Francisco, centrally located near BART, Caltrain, Muni, the ferry, and a bike share stationFree shuttle service and pre-tax commuter benefitsJust a note Note to Recruiters and Placement Agencies: AppDynamics does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website or to any AppDynamics employee. AppDynamics will not pay fees to any third party agency or firm and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of AppDynamics.  AppDynamics is an equal opportunity employer and considers all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or any other unlawful factor. AppDynamics complies with all applicable laws, including those regarding consideration of qualified applicants with criminal histories (such as the San Francisco Fair Chance Ordinance). If your disability makes it difficult for you to use this site, please contact talent@appdynamics.com. AppDynamics participates in E-Verify."}