{"jobID": "2818046370", "jobLocation": "Lansing_MI", "jobTitle": "Data Warehouse Business Analyst - Lansing, MI", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "64000", "jobDescription": " Here's the thing about challenges. They provide limitless opportunities for greatness. And what we have in mind for you is definitely big. At UnitedHealth Group, we're changing the future of health care and we have the expertise, advanced technology and global resources to make it happen. As a Senior Business Analyst, you'll work with the brightest minds in the business and find yourself digging deep to find the solutions to help people live healthier lives. You'll be responsible for analyzing, reviewing and forecasting data for operational and business planning to impact the health care system. What could be more satisfying than that? Join us!  Primary Responsibilities: The Data Warehouse BA will be working with the customers (Michigan - State Court Administration Office) gathering requirements for various projects Meet with users for clarification and elaboration as may be necessary to clearly define a problem and conceptualize a development plan Responsible for creating high level design specifications Will following the project through implementation Create testing documents and matrixes and will be responsible for assisting the customer with user testing Responsible for assisting the technical and business teams with project-related formal documentation Oversee the daily functions of the help desk where users seek clarification about the data as well as ask for assistance with their account credentials and access Work with the customer, users and other state agencies to pull data from the warehouse and create specialized reports upon request Required Qualifications: 2 - 3 years of professional experience in the following areas are required:  Technical Business Analyst (BA) experience, preferably in a Data Warehouse project environment Facilitating customer requirements gathering sessions or business process discussions Developing requirements and problem solving Coordinating with technical developers to ensure solutions meet business requirements Experience in a role requiring the ability to recognize, gather, correlate, and analyze facts, draw conclusions, define problems, and devise solutions and alternatives and make appropriate recommendations Preferred Qualifications: Technical Writing experience Ability to run reports using BI software (i.e., BI Query) and/or SQL Assistant or a strong willingness to learn Experience with Requirements Traceability Development of user test data and test scenarios Experience with State of Michigan Courts and/or Department of Health and Human Services business areas Experience with Help Desks Needs to be able to work independently and not rely on the State or other team members Communicate effectively, verbally and in writing, with programmers, analysts, immediate supervisor, management, system users, operations, other State agencies and the private sector. Meet with users for clarification and elaboration as may be necessary to clearly define a problem and conceptualize a development plan Ability to design applications taking into consideration data reconciliation, (to the source system) query/reporting performance, and analytical business value Analyze project requirements and develop detailed specifications for reporting requirementsCareers with Optum. Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world's large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do your life's best work.(sm) Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.  Job Keywords: Data Analyst, Business Analyst, Data Warehouse, BI Query, SQL, Requirements, Michigan State Court, project requirements  ${description2}  Requisition #: 772457"}