{"jobID": "2776749822", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Scientist I", "companyRating": "3.9", "companyInfo": {"Website": "www.ea.com", "Headquarters": "Redwood City, CA", "Size": "5001 to 10000 employees", "Founded": " 1982", "Type": " Company - Public (EA) ", "Industry": " Media", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Riot Games, Google, Activision Blizzard"}, "estimatedSalary": "133000", "jobDescription": "We are EA And we make games how cool is that? In fact, we entertain millions of people across the globe with the most amazing and immersive interactive software in the industry. But making games is hard work. Thats why we employ the most creative, passionate people in the industry. The Challenge Ahead The EA Digital Platform team designs and operates an industry leading service platform that provides hundreds of millions of gamers with personalized experiences registration, login, account security, offer catalog, checkout, fraud prevention, billing & payments, entitlement & DRM services, subscription management, and transactional messaging.  Our games are played everywhere in the world and on any kind of gaming device (PC, web, console, mobile, smart TVs) and support a wide range of business models (digital downloads, premium content, free to play, subscriptions).  We are looking for a Data Scientist to work in the Business Operations team that manages fraud operations and payment operations for the platform. Your primary focus will be to analyze our user account and customer behavior, extract key trends, opportunities and identify risks using statistical data. You will also partner with Product Management, Engineering and Fraud Operations to produce reports, analyze KPI-s and identify and clarify product requirements. Responsibilities: Analyze large data sets to identify behavior trends among users using quantitative, statistical and machine learning techniques.Drive analysis and insight to help build predictive models, tools and processes to address fraudulent account creation, account compromise and other account related activities.Collaborate with Product Management, Engineering and Fraud Operations on operational performance analysis, product requirements, monitoring and launch support.Build dashboards, reports and KPI-s on EA user accounts and their activity.Manage and own platform user data and act as subject matter expert on relevant KPI-s.Respond to operational needs by providing analytical support.Job Requirements:Ability to thrive in a dynamic, fast-paced environment with ability to multi-task.Strong problem solving aptitude.Results-driven and highly quantitative.True passion for understanding customer behavior on-platform and in-game.Strong interpersonal and communication skills.Skills and Experience:2+ years in business or data analysis with experience from identity, e-commerce, online payments, fraud/risk management or gaming industry.Masters degree required in a quantitative discipline such as Mathematics, Statistics, Economics, Engineering, Operations Research, Computer Science.Strong analytical skills including the ability to interpret and manipulate large structured data, develop recommendations and analysis.Proficiency with SQL, tools such as Tableau, and other statistical/reporting packages.Proficiency with one of coding language, such as Python or Java.Spark experience is a plus.Self-motivated, work well both independently and as part of an agile team.Whats in it for you? Glad you asked! We love to brag about our great perks like comprehensive health and benefit packages, tuition reimbursement, 401k with company match and, of course, free video games. And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives off of creativity and individuality. At EA, we live the work hard/play hard credo every day.  EA is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, pregnancy, age, sexual orientation, marital status, protected veteran status, medical condition or disability, or any other characteristic protected by law."}