{"jobID": "2667900531", "jobLocation": "Detroit_MI", "jobTitle": "Hadoop Big Data Admin", "companyRating": null, "companyInfo": {"Website": "www.quickenloans.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1985", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Citi, Bank of America, Wells Fargo"}, "estimatedSalary": null, "jobDescription": " Who We Are We’re America’s largest mortgage lender, closing loans in all 50 states. J.D Power ranked Quicken Loans “Highest in Customer Satisfaction in Primary Mortgage Origination” for the past eight consecutive years, 2010 – 2017. The company was also ranked highest in the nation for client satisfaction among mortgage servicers by J.D. Power for four consecutive years, 2014 through 2017, each year the company was eligible. There’s a simple reason we’ve been so successful: We care about the people we work with. If you’re tired of stuffy, bureaucratic workplaces, then you’ll be delighted to find something different here. We strive to make a creative, fun and collaborative environment you simply won’t find anywhere else. Quicken Loans was named #1 in ESSENCE Magazine’s first ever list of “Best Places to Work for African Americans” in 2015. We've been on Computerworld's \"Best Places to Work in IT\" list for 13 years running, hitting #1 the last five years. We were also ranked #14 in FORTUNE Magazine’s list of \"100 Best Companies to Work For\" in 2018, remaining in the top-30 for the past 15 years. What You'll Do/Need The Hadoop Administrator is responsible for the overall Hadoop clusters security, availability, capacity and performance. This team member monitors resources and ensures proper utilization of them while overseeing the future vision for the health and stability of the platform.ResponsibilitiesInstall and configure Hortonworks clustersApply proper architecture guidelines to ensure highly available servicesPlan and execute major platform software and operating system upgrades and maintenance across physical environmentsDevelop and automate processes for maintenance of the environmentImplement security measures for all aspects of the cluster (SSL, disk encryption, role-based access via Apache Ranger policies)Ensure proper resource utilization between the different development teams and processesDesign and implement a toolset that simplifies provisioning and support of a large cluster environmentReview performance stats and query execution/explain plans; recommend changes for tuning Apache Hive queriesCreate and maintain detailed, up-to-date technical documentationRequirementsMaster’s degree in computer science or computer information systemsTwo years of experience working with Apache HadoopIn-depth knowledge of Apache Hadoop and MapReduceExperience with Apache HBase and HiveExperience with LinuxAbility to shell script with LinuxAbility to troubleshoot problems and quickly resolve issuesStrong communication, analytical and research skillsKnowledge of cloud infrastructure What You'll Get Excellent benefits package that includes a 401(k) match, medical/dental/vision insurance and much moreOpportunities to participate in professional and personal development programs, including personal empowerment coaching, leadership training and ongoing personal growth trainingOther incentives, contests and rewards, including trips, event tickets, cash prizes and moreWhy We're DifferentCorporate politics not your strong suit? The anti-corporate culture of Quicken Loans gives our team members the initiative to build solutions together and grow both personally and professionally. At Quicken Loans, we’re in the business of putting roofs over our clients’ heads, but we certainly aren’t putting ceilings on our team members’ careers. If you’re interested in working in a place with a philosophy that’s truly different, apply today.Quicken Loans is an equal opportunity employer.Disclaimer: Quicken Loans received the highest numerical score in the proprietary J.D. Power 2010 – 2016 Primary Mortgage Origination studies and the 2014 – 2017 Primary Mortgage Servicer studies. 2016 Origination (or Sales) based on 5,182 total responses and measures the opinions of customers who originated a new mortgage or refinanced within the past 12 months, surveyed in July – August 2016. 2017 Servicing based on 7,374 total responses and measures the opinions of homeowners on their mortgage servicing company, surveyed in March – April 2017. Your experiences may vary. Visit JDPower.com. ​Quicken Loans is the #1 online lender based on the ranking of Quicken Loans in comparison to online residential mortgage lenders included in the Inside Mortgage Finance \"Top 50 Mortgage Lenders\" report from Q2 2017.Apply"}