{"jobID": "2837707936", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Scientist", "companyRating": "3.7", "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  We are looking for an experienced Scientist to support our organizations biologics discovery efforts and therapeutic antibody programs. The successful candidate will be involved in construct design and production of recombinant proteins, monoclonal antibodies, and multi-specific molecules to enable all aspects of Early Discovery Research within the Protein Sciences department at our organization’s Discovery Biologics site in Palo Alto, California.  Candidates must have solid, proven hands-on experience optimizing and executing protein expression of antibodies and recombinant proteins in multiple systems including transient transfection, stable cell line generation, and cell culture process optimization. Furthermore the candidate must have strong expertise in construct design and molecular biology relevant to the generation of expression constructs of medium to high complexity. Additionally, experience in high-throughput processes and automation, cell culture scale-up, production of multi-specific and other complex biologics molecules, protein purification, and antibody structure/function is highly desirable.  This individual will independently plan and execute experiments of medium to high complexity with specified timelines and will exercise sound technical judgment to solve a wide range of complex scientific problems and interpret scientific findings.  Ability to analyze, interpret and effectively present data at group and departmental meetings is required. Ability to write internal and external reports and presentations on technical and scientific findings is required.  The candidate will be expected to remain current with the latest technologies particularly in the area of protein production and actively apply new concepts as appropriate to continuously improve functional area capabilities and methods in place.  Qualifications  Education Minimum Requirement:  BS/BA degree with a minimum 7 years of industry or academia experience; or an MS degree with 4 years industry or academia experience; or PhD with 0+ years of experience.  Required Experience and Skills:  Broad knowledge and hands-on experience in protein expression in transient and stable mammalian systems  Strong capabilities in construct design for recombinant proteins and antibodies.  Robust molecular biology/cloning expertise.  Deep understanding of protein production processes.  Ability to troubleshoot difficult-to-express proteins  Preferred Experience and Skills:  Prior experience in high throughput and/or automated protein production platforms  Knowledge of protein expression in Ecoli and/or insect expression systems  Protein purification expertise"}