{"jobID": "2795057338", "jobLocation": "Irving_TX", "jobTitle": "Data Modeling Analyst", "companyRating": null, "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": null, "jobDescription": "Where good people build rewarding careers. Think that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.Job Description  The Information Analyst provides enterprise and project-level information analysis support that produces consistent, accurate, and complete information requirements that enhances the analytic and reporting lifecycle throughout the enterprise. In support of the analytic and reporting lifecycle, this position will create data definitions that follow established standards and guidelines, develop and manage the logical and physical model, and provide consulting on new developments within the data analytical space.  The Information Analyst provides a high level of expertise in a focused area of the business. They will work independently on products of all degrees of complexity, supporting multiple business units on their use of data and analytics. Through independent analysis and design, the role defines, develops and implements data and business intelligence solutions for Allstate agents and other business areas.  Job Description  Responsibilities Analyzes and translates business, data, functional, and user requirements and/or business rules into analytic and reporting requirements, data models and metadata deliverables by leading and guiding discussions internally with the project team and externally with business and technology partnersPlans, develops and leads information gathering sessionsConstructs and executes complex SQL queries and review data profiling results to discover semantics, patterns and value domains of data under analysisPerforms complex data analysis utilizing multiple techniques to determine, document and communicate existing and potential future data relationships, profiles and quality levels; uncover anomalies and variances in data content from expected resultsUpdates and maintains all logical (conceptual, relational, subject-level and dimensional) and physical data models and other design deliverables at multiple levels of detail and functionality  • Plans, develops and facilitates inspection sessions to validate that modeled data and related metadata deliverables match and satisfy business data requirementsConducts reviews of physical data model and related technical detail with database administrators and technical developers as part of development life cycleLeads the initiation of new products through estimation and planningCreates complex technical requirements through analyzing business and functional requirements  Job Qualifications  Essential Criteriaexpert experience in modeling relational databasesexpert experience in Oracle dimensional modeling and data warehousingMust have a strong capability to deal with highly ambiguous problems. This is demonstrated through step-by-step and methodical approach to scoping, understanding & exploration to the right solution(s)Expert experience in SQL and PL/SQL and oracle data warehouseExperience with ErWin or other data modeling toolsStrong ability to visualize complexity as a method of collaboration & sharing with team members. This skill is used as a collaboration mechanism to collect more points-of-view in the problem solving process.Excellent verbal and written communication skills. Desirable Criteria Experience with NoSQL databases like MongoDBExperience in Hadoop/HIVE/SparkWorking experience with Agile Scrum delivery methodologyPrevious experience as Information AnalystThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen. Good Work. Good Life. Good Hands®. As a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video. Allstate generally does not sponsor individuals for employment-based visas for thisposition. Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component."}