{"jobID": "2825225924", "jobLocation": "San_Jose_CA", "jobTitle": "Sr/Staff Data Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.nio.io", "Headquarters": "San Jose, CA", "Size": "501 to 1000 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "178000", "jobDescription": " Overview  Part of the Vehicle Cloud Engineering team, this position will be responsible to build & deliver Microservices based Data Platform to support Autonomous Connected Vehicles. This position will be hands-on technical position to build the data services and will help advance how we design for data in our product and analytic solutions, as well lead product and internal business solutions that leverage big data and analytic technologies. This position is also responsible for leveraging strategic technology direction to develop and maintain the architecture for data domain and driving the adoption of new technologies considering present and envisioned business environment, technology strategy and objectives by researching technical trends and developments.  In this role, you will work with Nio's unique, proprietary data sets; and have the opportunity to analyze large amounts of data and help derive insights and value from them. Responsibilities Build and manage Nio's Data Services for the big data platformBuild large-scale batch and real-time data pipelines with data processing frameworksPartner with data scientists to build an infrastructure/pipeline to collect and analyze all necessary dataBuild tools for data scientists to access and use the platformLead designs for application solutions to solve both product and analytic needsLeverage best practices in continuous integration and deliveryHelp drive optimization, testing and tooling to improve data qualityCollaborate with other engineers, ML experts and stakeholders, taking learning and leadership opportunities that will arise every single dayWork in cross-functional agile teams to continuously experiment, iterate and deliver on new product objectivesInfluence and advocate for the data ecosystemhow data should be optimized and leverage through the application and analytic platforms.Lead solutions that leverage big data / Hadoop stacks, evaluate and advocate for fit-for-purpose usage of big data architecture for product and analytic solutions.Stay current with big data architecture / product advances and advocate where appropriate. Requirements 5 - 10 years of hands on software development experience, preferably in an enterprise application development environment shipping products to the market.Solid understanding of Linux or Unix operating systems with expertise in programming languages preferably in Python, Scala, Java or R3+ years of experience designing, building and operating in-production big data/stream processing and/or enterprise data warehouse is requiredExperience developing Restful web applications preferred3+ years of experience using data management tools, including SQL/DBMS and NoSQL is requiredExperience handling data with relational databases is preferredProficiency with HDFS and MapReduce is preferredOne+ year of experience with Apache Spark/Storm and NoSQL storage is preferredExperience with big data platforms is preferredKnowledge of machine learning/distributed systems is preferredDemonstrated experience leading teams that analyze complex data related issues and/or logical data models in support of corporate and customer information systems requirements.Solid understanding of methodologies and technologies that depict the flow of data within and between technology systems and business functions/operations.Solid background in data integration, staging, quality and distribution.Knowledgeable in various Data Integration and RDMS technologies.Working knowledge using Cassandra, Hadoop, MySQL, MS SQL, PostgreSQL, MongoDB, Elastic Search and graph Databases. Qualifications Bachelor's degree in Computer Science or mathematics, statistics, data sciences or engineering with at least 5+ years of progressive experience in the industry  About NIO  Our mission is to shape a joyful lifestyle for our users by offering smart, premium electric vehicles and providing the best user experience. We are a global company with world-class research and development, design and manufacturing centers in Shanghai, Beijing, San Jose, Munich, London and nine other locations. NIO U.S. is our Global Advanced Technology Center and North American headquarters.  Our global company has achieved many great milestones such as: Securing the inaugural Formula E Drivers' Championship title in 2015Unveiling the fastest electric car in the world, the EP9, and setting a lap record for an electric vehicle at the Nürburgring Nordschleife in 2016Unveiling its vision car, EVE, in 2017Setting a new world speed record for an autonomous vehicle with the EP9 at the Circuit of the Americas in 2017Launching the ES8, a seven-seat high performance electric SUV, on December 16 with deliveries slated to begin in 2018. Want to be a part of this? Join us!  NIO is committed to a policy of equal employment opportunity. We recruit, employ, train, compensate, and promote without regard to race, color, age, sex, ancestry, marital status, religion, national origin, disability, sexual orientation, veteran status, present or past history of mental disability, genetic information or any other classification protected by state or federal law.  NIO US is an E-Verify employer.SDL2017"}