{"jobID": "2832382275", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher", "companyRating": "4.5", "companyInfo": {"Website": "www.imc.com", "Headquarters": "Amsterdam, Netherlands", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Optiver, Susquehanna International Group, Citadel"}, "estimatedSalary": "169000", "jobDescription": " Do you enjoy the process of problem solving, a process where you recognize areas of improvement and iterate and innovate to improve? Does your curiosity and desire to learn drive you?  At IMC we are committed to staying at the cutting edge of quantitative research and are looking for a talented quantitative analyst to join at the core of this effort.  You will be given resources and opportunities to effectively impact our global trading strategies.  Key responsibilities of the role include: Collaborate with traders to evaluate existing models and suggest improvementsBuild custom analysis tools to explore new research ideasDesign mathematical models based upon trading ideasApply rigorous analytical and quantitative techniques to solve complex problemsImplement these new models and launch them into productionConduct best practice to keep our eco-system logical and consistent WHO YOU ARE: MS or PhD in a highly quantitative field of studyAt least 2 years of professional experience in financial services or a quantitative environmentProven success in quantitative modelling and algorithm developmentExperience using scientific pythonDesire to work in a collaborative team environment OUR CULTURE:  We are at the core a trading firm, however we value trading and technology equally and we believe that cooperation between traders and technologists is one of our great strengths. We believe in fostering a truly flat environment in which great ideas can be recognized as well as put into practice from anybody within our organization.  WHO WE ARE:  IMC is among the world’s leading proprietary trading firms, and a market maker in securities listed on exchanges across the globe. Our cutting-edge technology drives everything we do. High performance algorithms, smart strategies and collaborative teams are the core of our business.  Today, IMC is 500+ people working together to build software and trade financial products in our offices in Amsterdam, Chicago, and Sydney. What does this mean for you? The chance to join a multi-national, multi-cultural team of exceptional individuals, focused on making IMC the world’s best trading firm."}