{"jobID": "2617005425", "jobLocation": "Chantilly_VA", "jobTitle": "Senior Data Analyst – TS/SCI w/Poly Required", "companyRating": "3.4", "companyInfo": {"Website": "www.gdit.com", "Headquarters": "Fairfax, VA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " SAIC"}, "estimatedSalary": "115000", "jobDescription": " Job Description Performs data analysis, interpretation and management duties. Develops rules and methodologies for data collection and analysis. Performs data collection, analysis, interpretation and management duties.Develops rules and methodologies for data collection and analysis.Ensures the integrity of project data, including data extraction, storage, manipulation, processing and analysis.Consults with the external clients and internal staff to determine data management needs and objectives.May be responsible for database design, administration, security, and maintenance.Prepares presentations that reflect the results of the data analysis.Develops and delivers data-related training programs.Coordinates with scientists and other technical experts to design and develop statistical analyses methodologies.May provide guidance and work leadership to less-experienced Data Analysts.Maintains current knowledge of relevant technologies as assigned.Participates in special projects as required. Education Bachelors Degree in a Computer Science, Statistics or a related technical discipline, or the equivalent combination of education, technical certifications or training, or work experience. Qualifications 5-8 years of related statistics/data analysis experience.IAT Level I cert required (Network+, A+, SSCP)IAT Level II preferred (CCNA-Security. Security+CE)Responsible for performing data analysis for Mission Service Providers (MSP) services and provide situational awareness to the Mission Director for important issues.Resolve recurring problems and identify corrections actions for significant problem tickets. Assess, document, and provide recommendations to Government to resolve incidents, service gaps, and problems. Prepare input for periodic reports regarding trend analysis and system performance. Conduct trend analysis and metrics, identify significant event timelines, and identify process chokepoints. Due to the sensitive nature of the work being done for this government client; all candidates must hold a TS/SCI with Polygraph. Shift work is on a rotating Panama Schedule.Schedule 1 Schedule 2Work - Mon, Tues Off - Mon, TueOff - Wed, Thur Work - Wed, ThuWork - Fri, Sat, Sun Off - Fri, Sat, SunOff - Mon, Tue Work - Mon, TuesWork - Wed, Thu Off - Wed, ThurOff - Fri, Sat, Sun Work - Fri, Sat, SunShifts are...Days -- 6am to 6pmMids -- 6pm to 6am (Shift differential) Why Work at General Dynamics IT?Work with top talent and some of the brightest minds in your fieldSupport missions that make a difference to our NationBecome part of an organization that that is committed to the highest ethical standards in all that we doThrive in the stability of a large organization, with the ability to move onto new opportunities, supporting different missions, building your career within General Dynamics ITWant to move, or find a job close to home? We have positions in several locations in the Washington D.C. Metro area, the United States and the worldEnjoy a culture that supports work-life balanceBenefits IncludeProfessional Development Assistance, Covering the Cost of Obtaining Professional & Technical CertificationsEducational Reimbursement toward degree programs and individual coursework401K Match – with 100% vesting on day oneHealth, Dental and Vision Coverage to keep you healthy, starting your first dayHealthy Rewards Program, where you can earn gift cards for practicing healthy habitsWe know work-life balance is important, General Dynamics IT offers Paid Time Off, Plus 10 Paid HolidaysEmployee Discount Program – Save up to 60% on hundreds of entertainment productsSome locations offer casual dress#Q1CAMPAIGN #ISDCJAs a trusted systems integrator for more than 50 years, General Dynamics Information Technology provides information technology (IT), systems engineering, professional services and simulation and training to customers in the defense, federal civilian government, health, homeland security, intelligence, state and local government and commercial sectors.With approximately 32,000 professionals worldwide, the company delivers IT enterprise solutions, manages large-scale, mission-critical IT programs and provides mission support services.GDIT is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status, or any other protected class."}