{"jobID": "2837981414", "jobLocation": "New_Brunswick_NJ", "jobTitle": "Faculty Position- Population Scientist", "companyRating": null, "companyInfo": {"Website": "www.rutgers.edu", "Headquarters": "Piscataway, NJ", "Size": "5001 to 10000 employees", "Founded": " 1766", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Rutgers Cancer Institute of New Jersey invites candidates to apply for a tenure-track faculty position in behavioral science, oncology care delivery, cancer outcomes, cancer disparities, or cancer epidemiology research with demonstrated academic track record of publications and currently active federal R01 level grant funding. Academic rank will be commensurate with qualifications and experience. A joint appointment in another academic department/School will be supported.  The successful candidate will be joining the Population Science Section, Cancer Prevention and Control Program, atthe Cancer Institute. This group includes resident behavioral scientists, cancer health disparities researchers, and cancer epidemiologists, with additional epidemiologists, tobacco control scientists, and behavioral researchers at the Rutgers School of Public Health. There are excellent opportunities for collaborations with the Rutgers School of Public Health, the Institute for Health, Robert Wood Johnson Medical School, RWJBarnabas Health System, Rutgers Cancer Institute at Newark University Hospital, and Princeton University. Program members also have strong ties to the very large South Asian community, minority populations, and the evolving cancer screening network in New Jersey. The Cancer Institute houses the SEER New Jersey State Cancer Registry, which facilitates research through rapid case ascertainment of new cancer cases. There are also opportunities to be involved in several ongoing studies, including a cohort of African American breast cancer survivors and to participate in research consortia. In addition, the Cancer Institute has four (4) shared resources available to faculty; 1) biostatistics, 2) data management services via DatStat, 3) a bio-specimen repository, and; 4) access to ORIEN (Oncology Research Information Exchange Network), a shared resource for precision oncology data for epidemiology studies.  Rutgers Cancer Institute is the only NCI-designated comprehensive cancer center in the state and is easily accessible to Manhattan, Newark Airport, and Philadelphia by public transportation.  Please address letter of research interests to:  Dr. Sharon Manne, Associate Director,  Cancer Prevention, Control, and Population Science  Rutgers Cancer Institute of New Jersey"}