{"jobID": "2830900702", "jobLocation": "Indiana_Harbor_IN", "jobTitle": "Data/RF Scientist/Engineer", "companyRating": null, "companyInfo": {"Website": "www.aquilent.com", "Headquarters": "Laurel, MD", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Employee Type: Full-Time Location: Crane, IN Job Type: Engineering Experience: Not Specified Date Posted:6/26/2018 About Us  At Booz Allen, we harness our collective ingenuity to solve our clients' toughest management and technology problems. We work with governments, Fortune 500 corporations, and not-for-profits around the globe, in industries ranging from defense to health, energy to international development. We believe there is no product, code, or strategy that can create progress-only people can. That's why for more than 100 years we've empowered our team: over 24,000 dreamers, drivers, and doers who work together to change the world. Job Description Job Number: R*******  Data/RF Scientist/Engineer The Challenge: Are you excited at the prospect of unlocking the secrets held by a data set? Are you fascinated by the possibilities presented by the IoT, machine learning, and artificial intelligence advances? In an increasingly connected world, massive amounts of structured and unstructured data open up new opportunities. As a data scientist, you can turn these complex data sets into useful information to solve global challenges. Across private and public sectors - from fraud detection, to cancer research, to national intelligence - you know the answers are in the data.  We have an opportunity for you to use your leadership and analytical skills to improve the defense and intelligence industry. You'll work closely with your customer to understand their questions and needs, and then dig into their data-rich environment to find the pieces of their information puzzle. You'll mentor teammates, develop algorithms, write scripts, build predictive analytics, use automation, apply machine learning, and use the right combination of tools and frameworks to turn that set of disparate data points into objective answers to help military leaders make informed decisions. You'll provide your customer with a deep understanding of their data, what it all means, and how they can use it. As a technical leader, you'll identify new opportunities to use data science solutions to help your customers meet their toughest challenges. Join us as we use data science for good in the defense and intelligence space.  Empower change with us. Build Your Career: At Booz Allen, we know the power of analytics and we're dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you can expect:  access to online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk  a chance to change the world with the Data Science Bowl - the world's premier data science for social good competition  participation in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government  You'll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications? Take advantage of our tuition assistance, on-site boot camps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We'll help you develop the career you want, as you chart your own course for success. You Have:Experience with deep learning frameworks, algorithm development, system modeling, statistical analysis, and MLExperience with machine learning tools, algorithms, and techniques for RF signal data collection and other related dataExperience with creating data collection, simulations, and models for machine learning data setsExperience with developing data visualization, demonstrations, and presentations for team members and stakeholdersAbility to perform research and conduct tests covering theoretical applications of ML in EW productsAbility to complete system integration lab integration through field test events and customer demonstrationsAbility to collaborate with systems engineers, RF engineers, computer engineers, and test engineers to define system capabilities, data collection needs, and functionality for future EW systemsSecret clearanceBA or BS degreeNice If You Have:Experience with electronic warfare, radar, signal processing algorithms, cellular technologies, and related technologiesKnowledge of computational electromagnetics solution methods, including MoM, PO or GO, UTD or GTD, and FDTDAbility to program in and use C++, Python, R-Sequel, MATLAB, TensorFlowetc, Theano, DIGITS, Cuda, NVIDIA, or Amazon AnalyticAbility to apply high speed CPU- or GPU-based data acquisition systems to collect and analyze specialized engineering and technical dataPossession of excellent oral and written communication skillsPossession of excellent presentation skillsClearance: Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.  We're an EOE that empowers our people - no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran status - to fearlessly drive change."}