{"jobID": "2817160075", "jobLocation": "Washington_DC", "jobTitle": "Data Analyst (Req. 061418.01-N15)", "companyRating": null, "companyInfo": {"Website": "www.sehlkeconsulting.com", "Headquarters": "Arlington, VA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "CLEARANCE: DoD Secret ***Must hold an active DoD Secret, or above, clearance upon initial consideration.*** REQUISITION NUMBER: 061418.01-N15 FUNCTIONAL / LABOR CATEGORY: Data Analyst/Programmer POSITION TITLE: Senior Consultant / Subject Matter Expert I LOCATION: Arlington, Virginia DESCRIPTION: Sehlke Consulting is supporting Navy Medicines upcoming General Ledger system transformation. We are currently seeking a qualified Data Analyst to assist in the assessment of these systems and in the preparation for development of future implementation activities. EDUCATION: Bachelors Degree in Analytics, Statistics, Database Management, Computer Science, Programming, or other analytical or programming field. EXPERIENCE:Two (2) years of experience applying analytical methods to define and develop solutions to consultative and/or acquisition problems and issues. LABOR CATEGORY DUTIES / RESPONSIBILITIES:Assists in determining technical project objectives and selecting or performing conceptual and methodological design for the project.Assists in the design, development, and technical execution of projects in conjunction with the Project Manager.Conduct analysis of electronic data captured for the hospital or other data systems.Analysis will be used to define current state of operations, impacts of future state improvements, and representation of information for decision makers.Develop dashboard metrics and interfaces that meet the needs of the stakeholders. DESIRED:Experience with healthcare analytics preferred.SharePoint knowledge.  Founded in 2011, Sehlke Consulting is a rapidly-growing Service-Disabled Veteran-Owned Small Business (SDVOSB) and Historically Underutilized Business Zone (HUBZone) headquartered in Arlington, VA an Equal Opportunity Employer that values the strength diversity brings into the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply."}