{"jobID": "2776115518", "jobLocation": "Chicago_IL", "jobTitle": "Sr. Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.echo.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Public (ECHO) ", "Industry": " Transportation & Logistics", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " C.H. Robinson, Total Quality Logistics, Coyote Logistics"}, "estimatedSalary": "86000", "jobDescription": "Position Purpose As a Data Engineer on the Echo Global Logistics team, you will contribute to database management of large scale web-based applications through the use of SQL, C#, and .NET tools. These technologies enable Echos business while supporting architectural vision of quality, scalability, performance and function. Our proprietary software is created with the goal to simplify transportation for our customers and carriers, and is one of our largest competitive advantages in an ever growing market.  Echo Global Logistics has recently been ranked the third largest digital company by employee size in Chicago and we are continuing to see increased growth in virtually all of our technical teams. Additionally, we have been ranked as the #1 Inbound Logistics 3PL for 2017 and look forward to speaking with you further about our team! Essential Position FunctionsYou...See technology as a passion, not something you just do between 9-5Possess the ability to create new solutions; we operate on a web based platform and constantly facing unchartered watersPossess strong fundamentals within coding technologies and a willingness to wear several hats when called uponDo not wait for something to break; find a problem before it becomes one and constantly aiming to improveHaving a willingness to vocalize these ideas and pick yourself up if you get knocked downWeValue passionate technologists, go-getters, and people who never stop seeking ways to improve existing technologyHave a high focus on career development and the runway to get you thereWork hard, periodOffer competitive compensation, benefits, 401k, challenging projects, company wide events, coworkers and leaders who will push you to get better, a sense of community not found anywhere elseResponsibilities: Data Engineers work in conjunction with Software Engineers, DBAs, Business Analysts, Quality Assurance and business owners Serve as a member of a data team that solves complex challenges and builds working database solutions using SQL Server, T-SQL, SSIS, stored procedures, views, user-defined functions, and table functionsDevelop solutions and contributing to development, leveraging Object-Oriented programming techniques (.Net), Software Development Lifecycles, Unit Test Techniques, and Debugging/Analytical Techniques.Collaborate with the team to develop database structures that fit into the overall architecture of the systems under development.Code, install, optimize, and debug database queries and stored procedures using appropriate tools and editors.Perform code reviews and provide feedback in a timely manner.Promote collective code ownership for everyone to have visibility into the feature codebase.Present technical ideas and concepts in business-friendly language.Provide recommendations, analysis, and evaluation of systems improvements, optimization, development, and maintenance efforts, including capacity planning.Identify and correct performance bottlenecks related to SQL code.Support timely production releases and adherence to release activities.Contribute to data retention strategy.Position Requirements1-3 years in commercial-grade business applications environment leveraging the following: SQL Server, T-SQL, SSIS, stored procedures, user-defined functions and table functionsManaging design risk1-3 years leveraging OO programming techniques Software development lifecycles, Unit test techniques, debugging/analytical techniquesWhat's in it for you?Help career growth by joining industry leader and continuing to advance Echo web based technologiesWorking with an organization with defined market goals, products, customers, revenue, and development teamsExperienced mentors to learn and adopt new practicesAbility to introduce your own views and takes on our product offeringsWork in wide variety of data managementAbility to constantly enhance and improve applicationsHave a clearly defined career growth track with enough flexibility to pave your own wayAll qualified applicants will receive consideration for employment without regard to age, race, color, religion, sex, sexual orientation, gender identity, national origin, status as a qualified individual with a disability, or Vietnam era or other protected veteran."}