{"jobID": "2829480482", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.symbilitysolutions.com", "Headquarters": "Toronto, Canada", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "DATA ANALYST Symbility Solutions Inc., (TSX.v: SY) is a global software company focused on creating world class experiences that simplify business and improve lives.  Symbility believes that innovation in business is both possible and necessary. So we help modernise industries around the world with smart, flexible and secure cloud-based, mobile-enabled software. Symbility Property™ is committed to bringing smarter thinking to the business of property insurance with cost-effective claims workflow and customer-engagement software solutions.  www.symbilitysolutions.com What are we looking for? Symbility is looking for a Data Analyst to join our Analytics team for Symbility Property™. The Data Analyst will work remotely from their home office and will ideally be located in the Houston, TX area.  Symbility is always looking for curious, agile, enthusiastic, and driven people to add to our team! If you thrive in a dynamic, open and team-oriented environment with a passion for solving problems, we want to hear from you! As the Data Analyst, what will I be responsible for?Extracting and mining data sets for analysis of property claims data in existing and new markets.Data mining large amounts of claims data for anomalies and trends including Predictive Model creation and/or optimization.Learn and analyze data flow processes for the purpose of QC/QA, standardization, and documentation via MS Visio.Diagnose query and analysis problems and implementing corrective actions.Creating data visualizations including charts, graphs, and reports that Account Managers will use to present to clients.Support, create and troubleshoot MSSQL queries.Quantifying and forecasting the financial impact of potential changes within claims practices.Conducting Industry claims data reviews for internal product improvements.Investigate new methods through which the Insurance Industry can operate more effectively.Create documentation of the processes used to complete new areas of analysis.Attend and participate meetings as needed.What does the Data Analyst need to have?Bachelor’s degree in Computer Science or related field required.2-5 years progressive experience in an analytical environment.Advanced knowledge of database tools, MSSQL Server 2000/2005/2008 and TSQL is requiredAbility to create, automate and maintain Stored Procedures and MSSQL queries.Experience working with very large & complex databases (500+ GB).Working knowledge or RDBMS, including table structure and metadata.Expert knowledge of MS Office Access, Excel, Word, and PowerPoint.Experience working with Open Source Tools, Python, R and Data Visualization libraries.What else are you looking for in your Data Analyst?Ability to generate and maintain predictive models and familiarity with data modeling considered an asset.Excellent oral and written communication skills with the ability to explain technical issues to non-technical or business oriented team members.Strong quantitative skills (mathematics and statistical)Possesses high attention to detail and is a quick learnerValues efficiency, precision, and accuracy.Be able to work independently and as part of a team.How To Apply Our online application will give you the option to apply to this role as a complete person – not just a resume. The application will assess your qualifications, personality traits and workplace preferences, and should take 10 to 15 minutes to complete. After submitting, you’ll receive an email inviting you to log in and view your assessment results.  We value diversity and inclusion and encourage all qualified people to apply. If we can make this easier through accommodation in the recruitment process, please contact us with the “Help” button in the application.  We will review applications as they are received and look forward to hearing from you."}