{"jobID": "2693921571", "jobLocation": "Reston_VA", "jobTitle": "Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.comscore.com", "Headquarters": "Reston, VA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Public (SCOR) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Nielsen, Hitwise, Coremetrics"}, "estimatedSalary": null, "jobDescription": " Job Description Please Note: comScore is only accepting candidates that can start in March or April.comScore is a leading big data technology company that measures what matters to make cross-platform audiences and advertising more valuable. We are seeking a seeking a Data Analyst in our Reston VA location to mine our large-scale data sets (2 Trillion + records/month) and provide insights to help inform our clients strategy for launching and analyzing marketing campaigns around the world. This Data Analyst will be responsible for data analysis, design, and development of Cross Platform audience measurement products. Their work will have a direct impact on driving business strategies for prominent industry leaders. Self-motivation and strong communication skills are both must haves. What, where, and when do people watch video content? Which sites and platforms are changing the behavior of consumer video consumption? How and where is traditional TV viewing shifting towards internet connected devices? What is the total audience for publishers with fragmented content across TV, OTT devices, computers, and mobile? Duties and responsibilities:Drive analytical projects that span across multiple teams and functions. Test new features and concepts and evaluate production processes. Exercise your experience in the development life cycle through analysis, design, development, testing and deployment of this system. Collaborate with teams in Software Engineering, Operations, and Product Management to deliver timely and quality data. You will be the knowledge expert, delivering quality data to our clientsTackle initiatives that improve process robustness and improve data qualityUse your storytelling and data visualization skills to convey insights derived from client dataQualifications:Bachelors degree in a quantitative subject such as Statistics, Engineering, Economics, Computer Science or Information Systems. 2-4 years relevant work experience in analytics Experience in data analysis and problem solving with big data Experience with SQL, Hive, Spark, R or Python and deep knowledge of relational databases and methods for efficiently retrieving data Ability to think creatively and solve complex problems Ability to autonomously manage simultaneous projects in a fast paced business environment Excellent verbal, written and computer communication skills with strong analytical and troubleshooting skills Ability to consistently meet data expectations; holds team and self-accountable. Ability to manage change, course correct, and respond decisively. Ability to engage with Senior Leaders across all functional departments. Ability to take on new responsibilities; adapts to change and executes. About comScore: comScore is a leading cross-platform measurement company that measures audiences, brands and consumer behavior everywhere. comScore completed its merger with Rentrak Corporation in January 2016, to create the new model for a dynamic, cross-platform world. Built on precision and innovation, comScore’s data footprint combines proprietary digital, TV and movie intelligence with vast demographic details to quantify consumers’ multiscreen behavior at massive scale. This approach helps media companies monetize their complete audiences and allows marketers to reach these audiences more effectively. With more than 3,200 clients and a global footprint in more than 70 countries, comScore is delivering the future of measurement. Shares of comScore stock are currently traded on the OTC Market (OTC:SCOR). For more information on comScore, please visit comscore.com.EEO Statement: We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, disability status, sexual orientation, gender identity, age, protected veteran status or any other characteristic protected by law. *LI-EB1*MSEB"}