{"jobID": "2800274461", "jobLocation": "Chicago_IL", "jobTitle": "Research Scientist II", "companyRating": "3.2", "companyInfo": {"Website": "www.beamsuntory.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "Beam Suntory is Crafting the Spirits that Stir the World. Rooted in two centuries of family heritage, Beam Suntory has evolved into the world's third largest leading premium spirits company ... where each employee is treated like family and trusted with legacy. With our greatest assets - our premium spirits and our people - we're driving growth through impactful marketing, innovation and an entrepreneurial spirit. Beam Suntory is a place where you can come Unleash your Spirit by making an impact each and every day. Beam Suntory currently has the following position open in Kentucky, United States.Research Scientist IIMission Support the creation of innovative consumer and customer driven new products/platforms, quality improvements and cost savings, to drive Beam Suntory profitable growth and business success. Primary focus areas include innovation and renovation of products, taking formula/spec development from ideation through commercialization. This is a great opportunity because...Beam Suntory is Crafting the Spirits that Stir the World. Rooted in two centuries of family heritage, Beam Suntory has evolved into the world's third largest leading premium spirits company ... where each employee is treated like family and trusted with legacy. With our greatest assets - our premium spirits and our people - we're driving growth through impactful marketing, innovation and an entrepreneurial spirit. Beam Suntory is a place where you can come Unleash your Spirit by making an impact each and every day. This position provides broad exposure to operations, marketing/business teams, finance, sourcing and other internal and external partners, providing R&D; support on cross functional teams.Desired QualificationsM.S Food Science or related preferred with two years experience, or B.S. degree with 4+ years experience.Minimum 2 years work experience in food and/or beverage industry. Experience in research initiatives and in ready to drink alcoholic beverages or carbonated soft drinks a plus.Ability to work independently with minimal supervision in creating and working a plan for assigned projects.Ability to develop strong cross functional relationships within R&D; as well as with Marketing, Operations, Sourcing, Engineering, etc. to drive strong collaboration and results.Proficient skills in Excel, Word and related programs for organizing data and summarizing test resultsSolid analytical and problem solving skills. Ability to develop strong working knowledge of lab operating proceduresStrong verbal and written communication skills, including timely follow-up and commitment to deliverables, and openness to give and receive feedback.Must be able to consume limited quantities of alcoholic beverage samples in accordance with evaluation/research needs.Self starter, flexible, comfortable working in unstructured face-paced environment, able to manage multiple priorities effortlesslyTeam player with collaborative style and good listening and partnering skills. Culturally sensitive, with ability to work in a global multicultural cross functional organization, requiring ability to work effectively across cultures, time zones to accommodate global responsibilities.Ability to travel globally to partner in project work with internal and external clients, as well as support implementation at Beam facilities – travel approx. 10-30% with half local Kentucky operations and Chicago corporate office, and balance other Beam Suntory locations.Physically fit for work primarily in a lab, pilot plant and manufacturing environments, which includes long periods of standing, moving, and carrying or lifting up to 50 pounds. [Not translated in selected language]Beam Suntory is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, national origin, genetics, disability, age, sexual orientation or veteran status. We will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable federal, state and local laws."}