{"jobID": "2731531862", "jobLocation": "Cerritos_CA", "jobTitle": "Data Interface Application Analyst / Developer", "companyRating": null, "companyInfo": {"Website": "www.illuminousinc.com", "Headquarters": "Hacienda Heights, CA", "Size": "1 to 50 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "** Position is W-2 Contract (Competitive Hourly Rate, about 6-months assignment).** Full time, on-site position for a Los Angeles County Department in Cerritos, CA.** LOCAL CANDIDATES ONLY please. The Consultant shall build a data network that will bridge associated systems of several criminal justice agencies to form a new restitution collection system. The core duties of the Consultant shall focus on the development and implementation of data exchange interfaces among those agencies following the defined integration points set from the requirements gathered for the new Restitution Model. DESCRIPTION OF DUTIES/TASKS The Consultant shall perform all of the duties listed below: Evaluate target business processes and workflows of the new integrated restitution collection system.Implement the information exchange platform and implementation patterns for qualified integration points.Perform interviews of SMEs and technical experts belonging to each stakeholder agencies: District Attorney (DA), Treasurer Tax Collector (TTC), Probation Department, and Sheriff’s Department (LASD).Coordinate with the Project Manager and Project Coordinator in implementing the identified solutions to facilitate the data sharing among stakeholder agencies in the new Restitution model.Analysis of each of the associated local system’s local processes, system framework and backend data structure: PIMS; JIMS; APS and CARS.Participate in periodic project and technical status meetings.Serve as a technical resource for other members of the development team.Derive data standards from system and business process analyses.Provide consulting services to participating agencies to improve system-related local procedures and activities related to the new restitution collection model.Identify the appropriate messaging protocol for each of the local systems to emit or receive data.Identify all the Service Oriented methods and routine processes needed for the data exchanges.Coordinate with the CARS software vendor to implement customization requirements on the new CARS COTS software/platform.Formulate the data elements and standard meta-data formats for messaging correlated to the identified Service Oriented exchange patterns.Assume an advisory role for solutions on the individual system levels as to how they are going to be customized to fit the proposed restitution collection model.Design, develop and implement end-to-end integration application solutions that are required in the full Restitution model using a blend of legacy and conventional set of technologies.Implement essential data translation rules for each integration point.Derive and implement security models required for specific integration points.Identify test scenarios and underlying test cases to create test plans for each component of the restitution collection model.Assist in the provisioning of development, test and production environments.Identify additional hardware/software requirements for each of the participating agencies.Resolve network connectivity requirements and issues related to the messaging models.Assist in provisioning additional hardware/software elements for each of the participating agencies.Create a plan for appropriate application package development/test/production promotion procedures.Coordinate/plan with participating agencies to organize and facilitate training sessions if they become necessary.Conduct prototyping sessions with stakeholders to identify possible gaps in the new integration model.Create detailed production implementation plan and rollback procedures for the different components of the integration model to be used in any production go-live event.Establish system performance benchmarks of the individual integration framework modules for evaluating systems’ health levels.Participate in the post-production monitoring to ensure proper execution of built information exchange modules for the new restitution model.Establish bug-reporting and tracking methods accessible to the restitution community for proper production/maintenance handling.DESIRED EXPERIENCE / QUALIFICATIONS 1. Two (2) years’ experience within the last five (5) years designing, developing and implementing Application Programming Interfaces for data integration using conventional programming languages and frameworks, such as ASP.Net.  2. Two (2) years’ experience working with a multi-disciplinary team of individuals belonging to different functional domains for gathering and implementing data integration requirements.  3. Valid Class “C” California Driver’s License with no travel restrictions.  4. Must be an efficient learner and able to absorb new technologies, environments, and functional requirements quickly and effectively.  5. Knowledge of Cloverleaf integration software a plus."}