{"jobID": "2835014428", "jobLocation": "Washington_DC", "jobTitle": "ESL for Families Instructor- PT Morning - Offsite/Harvard Campus", "companyRating": null, "companyInfo": {"Website": "www.carlosrosario.org", "Headquarters": "Washington, DC", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " School / School District", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Are you passionate about using technology while teaching English to language learners? Do you find yourself helping others learn how to properly read, write and speak English? If so, then Carlos Rosario International Public Charter School (CRIPCS) has the perfect opportunity for you. Carlos Rosario International Public Charter School (CRIPCS) is an adult charter school that educates and prepares the diverse adult immigrant population of Washington, DC to become productive citizens and members of American society who give back to their family and community. When you join the team at CRIPCS you become part of a unique, performance-driven organization that’s been ranked one of the top places to work in DC by the Washington Post for the last 3 years. ESL for Families Instructor The ESL for Families instructor supports the school’s mission by providing excellent contextualized instruction. The ESL for Families instructor teaches in a way that is appropriate for students’ diverse educational backgrounds, learning styles, and English language abilities. Responsibilities:Instruct a multi-level group of students in life skills with appropriate English grammar embedded for each levelAble to use a tablet, which is a wireless portable computer with touch screen interface, as a teaching methodCreate clear lesson plans and objectives that are available on request and account for all students in a multi-level class (literacy to beginner), based on the ESL for Families curriculumExplore topics centering on the DC educational system to help demystify its internal processes to help parents advocate for their studentsExplore topics centering on the DC educational system to help demystify its internal processes to help parents advocate for their studentsImplement Harvard Street Campus policies and procedures as relates to student tracking and assessmentMotivate students to participate actively and attend class regularlyKeep accurate records of student attendance, test scores and tracking forms and submits them in accordance to policies set at the main campusMeet regularly at the Harvard Street Campus with other ESL for Families teachers and administratorsRequirements:Must have at least two of the following:Teaching CertificationMaster’s degree in Adult Education, Linguistics, TESOL, language studies or related fieldAt least three years of teaching experienceExcellent communication and organizational skillsProficient in Microsoft Suite: Word, PowerPoint, and basic website navigationExperience in ESL and Adult Education preferredDemonstrate knowledge and competence in both ESL preparation and Adult EducationMust be flexible and able to make adaptations to meet the academic needs of students with different learning skills and challengesWork comfortably with people from diverse backgroundsExcellent communication skills, be able to explain concepts to others effectivelyExcellent organizational skills and timely completion of tasksKnowledge and experience using Windows, Internet Explorer and Microsoft Applications including Word, PowerPoint, and Microsoft Outlook Schedule:Monday – Thursday, 9:00 AM – 12:00 PM*Please note this position teaches offsite at a partner charter school in the northwestern quadrant of Washington, DC. ESL for Families faculty meetings are held at our Harvard Street campus.* This position will be posted until July 15, 2018.  "}