{"jobID": "2831958324", "jobLocation": "Princeton_NJ", "jobTitle": "Research Scientist - Deep Learning, Computer Vision, Perception", "companyRating": "3.8", "companyInfo": {"Website": "www.siemens.com", "Headquarters": "Munich, Germany", "Size": "10000+ employees", "Founded": " 1843", "Type": " Company - Public (SIE) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " GE, ABB, Philips"}, "estimatedSalary": "102000", "jobDescription": "*Research Scientist - Deep Learning, Computer Vision, Perception** Locations:Princeton, New Jersey  Job Family: Research & Development  New Search  Apply  English (US) *Job Description***Division:** Corporate Technology*Business Unit:** Corporate Technology*Requisition Number:** *******Primary Location:** United States-New Jersey-Princeton*Assignment Category:** Full-time regular*Experience Level:** Entry level*Education Required Level:** Doctorate Degree*Travel Required:** 5%*Division Description:** Siemens is a global technology powerhouse that has stood for engineering excellence, innovation, quality, reliability and internationally for more than 165 years. As a global technology company, Siemens is rigorously leveraging the advantages that this setup provides. To tap business opportunities in both new and established markets, the Company is organized in nine Divisions: Power and Gas, Wind Power and Renewables, Energy Management, Building Technologies, Mobility, Digital Factory, Process Industries and Drives, Healthineers and Financial Services. Our support functions are split into two organizations, Corporate Core and Corporate Services. These organizations provide essential services to better enable responsible and profitable growth. For more information, please visit: **************************************** *Job Description:** For nearly 170 years, pioneering technologies and the business models developed from them have been the foundation of Siemens success. Our central research and development unit, Corporate Technology (CT) plays an important role in this. Together with its global network of experts, CT is a strategic partner to Siemens operative units. It provides important services along the entire value chain from research and development to production and quality assurance, as well as optimized business processes. The support provided to the businesses in their research and development activities is ideally balanced with CTs own future-oriented research.  Siemens central research and development arm sees itself as a strategic partner to the companys businesses. It plays a key role in achieving and maintaining leading competitive positions in the fields of electrification and automation while at the same time helping Siemens fully tap into the growth field of digitalization.  The people who work at Corporate Technology are more than employees. They are actively helping to make peoples lives a little better every day. Would you like to be a part of that? Then join us. We offer you a high level of practical relevance as well as an opportunity to individually contribute your knowledge and your visions around the world. Whether youre helping to develop products for the operating units or working in interdisciplinary projects for the business areas: At Corporate Technology youll be working in the heart of Siemens technological research.  The Vision Technology and Solutions group within Siemens Corporate Technology has an immediate opening in Princeton, NJ for a research scientist with a focus on Deep Learning for Computer Vision and Image Analytics. This role is an exciting opportunity to join a newly formed team and contribute to its future growth.  Our Princeton facility is recognized for providing a stimulating environment for highly talented and self-motivated researchers. You will have the opportunity to test your knowledge in a challenging problem-solving environment. You will be encouraged to think out-of-the-box, innovate and find solutions to real-life problems. Our team has a strong publication record in leading journals and conferences.  What are my responsibilities?  + Research, design, and implement algorithms in Deep Learning for Computer Vision and Image Analytics.  + Contribute to research projects that develop a variety of algorithms and systems in computer vision, image and video analysis.  + Advance the state-of-the-art in the field, including generating patents and publications in top journals and conferences.  + Apply image and video analysis techniques such as deep learning to large-scale, real-world problems.  + Fast prototyping, feasibility studies, specification and implementation of image and video analysis product components.  + Working with customers to understand algorithm requirements and deliver high-quality solutions.  What do I need to qualify for this job?  + Ph.D. in Computer Science, Electrical Engineering, or related discipline required. Strong background in Deep Learning.  + Min of 3 years of Graduate research and internship experience in Computer Vision, Machine Learning and Image Understanding preferred.  + Proven ability to develop new research ideas as demonstrated by a strong publication record and early developments to the level of a working system prototype.  + Strong theoretical and practical background in computer vision, image and video analysis, specifically object detection, tracking and recognition, statistical modeling, statistical pattern recognition, machine learning, sparse methods, applied mathematics, optimization.  + Hands-on coding skills and ability to quickly prototype in C++ is a must. Further experience in Scripting languages such as Python is a plus.  + Outstanding written and verbal communication skills in English are required.  + Successful candidate must be able to work with controlled technology in accordance with US Export Control Law. US Export Control laws and applicable regulations govern the distribution of strategically important technology, services and information to foreign nationals and foreign countries. Siemens may require candidates under consideration for employment opportunities to submit information regarding citizenship status to allow the organization to comply with specific US Export Control laws and regulations. Additional information on the US Export Control laws & regulations can be found on ************************************************************************************************* & id=33 \\# \\#LI-MD1*Equal Employment Opportunity Statement** Siemens is an Equal Opportunity and Affirmative Action Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to their race, color, creed, religion, national origin, citizenship status, ancestry, sex, age, physical or mental disability, marital status, family responsibilities, pregnancy, genetic information, sexual orientation, gender expression, gender identity, transgender, sex stereotyping, protected veteran or military status, and other categories protected by federal, state or local law. *EEO is the Law** Applicants and employees are protected under Federal law from discrimination. To learn more, Click here at ************************************************************** . *Pay Transparency Non-Discrimination Provision** Siemens follows Executive Order 11246, including the Pay Transparency Nondiscrimination Provision. To learn more, Click here at ************************************************************** . Categories Financial ServicesEngineering"}