{"jobID": "2836191394", "jobLocation": "San_Antonio_TX", "jobTitle": "Data Analyst 2", "companyRating": null, "companyInfo": {"Website": "www.kforce.com", "Headquarters": "Tampa, FL", "Size": "10000+ employees", "Founded": " 1966", "Type": " Company - Public (KFRC) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "RESPONSIBILITIES:Kforce's client, a prestigious oil and gas company in the San Antonio, Texas (TX) area, is looking for an experienced Data Analyst for a long-term project. This position will support the controller division and IT.  Data Analyst 2 Responsibilities:  Gathering and analyzing data to support business processes and decisions Weekly SAP queries, weekly cadence reporting Pulls data from SAP and gathers it for analysis Turns raw information into insights, recommendations, dashboards and reports to provide ad-hoc reporting and analytics services; Proactively supports business decisions and processes Collaborates with end users and other members of the team to collect and coordinate business requirements for the use of analytics and reporting Responsible for the prioritization of ad-hoc data requests Works with team members to meet data needs of department in various areas Understands data flow of systems and works with team members to improve data integrations Participates as a team member in various projects and contributes to the overall goal/objective for the team Data Gathering from SAP Putting reports in analysis formatREQUIREMENTS: Bachelor's degree in Computer Science, Software Engineering, or relevant field required 10+ years or most advanced level of experience in specified technology required Knowledge and experience working with Microsoft Office Tools Knowledge of SAP ECC Knowledge and ability to collect data from different information sources and distribute them to users Microsoft Excel (Pivots, VLOOKUP) Ability to use information to simplify information systems and make sound business decisions Ability to identify issues, prioritize and problem-solving resolution Preferred Skills:  Familiarity with SAP data gathering Working understanding of large data sets Collaborate and positive attitude with team members Additional Knowledge / Kforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status."}