{"jobID": "2746937179", "jobLocation": "Chicago_IL", "jobTitle": "Senior Quantitative Researcher - Equities Market Making", "companyRating": null, "companyInfo": {"Website": "www.njfsearch.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Our client is one of the world’s most active proprietary trading firms and a key market maker in various products listed on exchanges throughout the world. The firm, made up of two different divisions with trading operations that operate independently of one another including a securities trading division and an asset management department. The Group is a market maker active in over 100 trading venues throughout the world and offers liquidity to over 200,000 through their securities division. The securities department makes markets in the major exchange traded instruments including equities, bonds, commodities and currencies. Key ResponsibilitiesAs a senior quantitative researcher, you will work in collaboration with traders, quants, software developers in a highly focused team, which is responsible for researching, implementing, testing, deploying proprietary trading strategies across US cash equity markets.Your role within the team will be to bring your quantitative researcher expertise to bear on all aspects of the trade pipeline.You must have the ability to build models for high-frequency asset price prediction, to analyze the resulting trades, and to build models for better understanding of latency implications.The Candidate8+ years of experience developing high frequency trading strategies for a key player in equities automated market making domain.MS/PhD in computer science, engineering, statistics or similar If you would like to be considered for the position of Senior Quantitative Researcher, or wish to discuss the role further then please leave your details below. Your resume will be held in confidence until you connect with a member of our team."}