{"jobID": "2735675474", "jobLocation": "San_Jose_CA", "jobTitle": "Product Owner (Business Analyst ,SQL, Data Modeling and Product Development)", "companyRating": "3.7", "companyInfo": {"Website": "www.irginc.net", "Headquarters": "Jefferson City, MO", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "114000", "jobDescription": " IRG is seeking Product Owner ( Business Analyst ,SQL, Data Modeling and Product Development) for its client at San Jose, CA .  ROLE: Product Owner  San Jose CA  Duration: 6 months right to hire  W2 only !! no Corp to Corp  RESPONSIBILITIES AND REQUIRED SKILLS:  A Product Owner is responsible for maximizing the value of the product and the work of the Development Team. The Product Owner is the sole person responsible for managing the Product Development, Testing, and Deployment.  Product Owner Role includes:  Perform analysis of business requirements and able to convert those into technical specifications  Clearly expressing Product Development requirements.  Ordering the items in the Product Requirement charter to best achieve goals and missions.  Ensuring that the Product Development requirements are visible, transparent, and clear to all, and shows what the Development Team will work on next.  The Product Owner may do the above work, or have the Development Team do it. However, the Product Owner remains accountable.  At Least 3- 6 Years of experience and knowledge of: SQL Database Development Analytics Understanding of Quality Assurance Product Development Excellent communication skills are a must. Must be a self-starter and able to work in a very collaborative manner with the business stakeholders, business users and others in IT. Apply At: Please send your resume and a cover letter to Susmita Sahu (Susmita at irginc dot net) at susmita@irginc.net or jobs@irginc.net . You may call Susmita # 573-797-9902. About us: Information Resource Group, Inc. (IRG) is a global Information Technology (IT) professional services firm bringing leading edge solutions to enterprise systems. We deliver innovative, high quality, and cost-effective results that make a difference.  We have been providing IT services to private and public sector clients for over 19 years. We are headquartered in Jefferson City, Missouri, and certified by the State of Missouri and Wisconsin as a Minority Business Enterprise (MBE). We are proud to be one of ten companies pre-qualified to provide IT services to Missouri State Agencies through the Statewide IT Contract as well as one of seven vendors selected by the State of Missouri to supply Health Information Technology (HIT) consulting services.  Throughout our experience, we have established presence as an IT solutions provider with significant state government experience and a long history of success in providing computer-consulting services.  In addition, we have a broad portfolio of IT and business solutions and currently provide Information Technology services to 19 States and 6 entities.  IRG is an equal opportunity employer."}