{"jobID": "2801526017", "jobLocation": "Mount_Laurel_NJ", "jobTitle": "Data Analyst / Tableau Developer", "companyRating": null, "companyInfo": {"Website": "www.grayhairsoftware.com", "Headquarters": "Mount Laurel, NJ", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Are you a future GrayHair? We are currently seeking aData Analyst / Tableau DeveloperAbout the RoleWe are looking for a data superstar to join our Analytics Team. This person must be ready to crank out killer Tableau dashboards to please and delight our customers! We are open to various experience levels, but the right person is someone who already knows Tableau and is ready to show their stuff right now.  In addition to Tableau experience, we need people who are highly motivated and capable of digging in and solving complex technical/logical data problems. We need people who learn fast and have a strong desire to learn more. In addition, we are big on big data and cloud technologies. Experience with SQL is necessary. Experience with AWS, Spark, and other big data and analytics tools would add to your awesomeness… but if you don’t have those, you’ll learn them here, so be prepared. The right candidate will also have the ability to build effective and rewarding working relationships with peers and company management.  If you have a strong desire to work as part of a high-performing team, and the ability creatively answer data questions, then this opportunity could be a great fit for you! We are currently re-architecting many of our systems using thoroughly modern technology paradigms, so you will have many opportunities to learn the newest, coolest stuff!  Must be comfortable with a fast-paced environment and a team committed to building a great business, excited about technology and working in a very entrepreneurial, collaborative environment. Must be ready to knock it out of the park.About GrayHairWe are located in South Jersey, Mount Laurel. We are a fast-growing unique software company who offers a fun office environment with competitive salaries, comprehensive benefits packages, a 401(k) plan with company match and safe harbor contributions, flexible schedules, great food and snacks. Did I say bring your dog? And we do Yoga too! Salary ranges based on experience in field & industry.What we DO LIKETrust + freedom > Politics + bureaucracy  Small team; big impact.  Make it great, but make it – don’t be afraid to fail  Do something; tell people about itKey Responsibilities Include Creatively design and build fabulous-looking Tableau dashboards that help our customers win at their business.Build custom data feed logic based on client requests using SQL and eventually other tools.Troubleshoot and fix data process issues and bugs.Participate in meetings and planning sessions as needed and appropriate.Provide insight into technology directions and contribute ideas whenever possible.Continually strive to improve company processes and procedures.Cross train on other technologies and functions (our goal is to build teams that are able to handle many different roles).Monitor data process error reports.Other duties as assigned. ABOUT YOU…Required Experience Bachelor’s degree or equivalent experience in a technology related disciplineDrive to succeed in a technology positionStrong communication skills + a positive, optimistic attitude, and a sense of humor are crucialAbility to work in a fast paced environmentAbility to learn new concepts quicklyAbility to juggle multiple tasks at any given time and meet deadlinesPrevious small company experience is a plus Parting ThoughtsThanks SO MUCH for reading! If you don’t work at GRAYHAIR, well WHAT ARE YOU WAITING FOR! Want to join us? E-mail JHAGBERG@GRAYHAIRSOFTWARE.COM GrayHair Software is proud to be an equal opportunity employer and encourages workplace diversity."}