{"jobID": "2656453174", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Principal Scientist, AI/ML Products", "companyRating": null, "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": null, "jobDescription": "The Challenge Adobe is looking for Data Scientist to build the next generation of Display Advertising Solution. Finding the right advertisement for the right browser on the right website at the right time and right price forms the core of our algorithms. The challenge involves finding these parameters among billions of available opportunities in real-time, such that, we maximize our clients’ revenues. As part of the algorithms team, you would be responsible for analyzing large volume of data to build models that will push the frontiers of our Display Advertising Solution. Algorithms team is part of Adobe Media Optimizer that is responsible for serving billions of ad-impressions on behalf of our clients. What you will doAnalyze data from billions of ad-serving opportunities, browsers and impressions, across hundreds of dimensions to identify patterns.Visualize data to get a feel for which models would work well.Build models that best capture the underlying phenomenon.Implement production code at scale.Test and productize new models in live environment.Collaborate with a team of Data Scientists, Engineers and Product Managers.Required QualificationsPhD in Computer Science / Mathematics / Statistics3+ years of relevant experience.Coding expertise in Python.Understanding of probability, statistics and Machine Learning techniques.Experience with big data technologies such as Hadoop, MapReduce, Hive, Hbase, Spark and Scala.Experience with statistical packages such as R.Experience with plotting / charting libraries such as ggplot and matplotlib.Understanding of basic Computer Science Data Structures and algorithms.Excellent problem solving ability and communication skills.Ability to work in teams.Preferred QualificationsExpert in basic Computer Science Data Structures and algorithms.Experience writing and optimizing MapReduce jobs, Hive queries.Experience with relational databases (such as SQL), tuning and query optimization.Understanding of Display Advertising domain and eco-system.Making our technology accessible to all We believe everyone should have equal access to technology and its benefits. To help achieve this, Adobe is focused on making software more accessible for everyone. When we hire for engineering, development and design roles, we look for the following accessibility skills: Base knowledge of the W3C’s Web Content Accessibility Guidelines v2.0Exposure to current tools used by people with disabilities (screen readers and other assistive technologies)Experience with accessibility evaluation and validation softwareUnderstanding of input and output modes used by people with disabilitiesFamiliarity with compliance requirements - state, Federal, international At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}