{"jobID": "2760893165", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Small Business Loan Underwriter", "companyRating": null, "companyInfo": {"Website": "www.levelonebank.com", "Headquarters": "Farmington Hills, MI", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Public (LEVL) ", "Industry": " Finance", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary / Essential Functions:Responsible for the underwriting of small business loans including the analysis of various financial statements and tax returns in order to determine the disposition of the loan.Identify and qualify loan applications utilizing the SBA Guaranty program, including SBA Express, SBA 7a, and 504b loan facilities.Provide loan decisions and/or credit recommendations, based on a review of all underwriting criteria, for business loans originated via the Bank’s Banking Centers. Effectively communicate and negotiate loan terms and conditions to the Business Banker or directly to the customer.Provide coaching to Banking Center staff to enhance their understanding of small business lending and processes. Identify& communicate cross-sell opportunities discovered during the underwriting process.Assist with portfolio management relating to maturities, delinquencies, risk rating assignments, covenant testing and tracking, and additional portfolio functions as presented.Identification of potential loan risks.Job Requirements: Previous Small Business underwriting experience required.Fiserv system knowledge preferred.Viewpoint system reporting knowledge preferred.Financial analytical and detail orientation skills.Accounting acumen.Microsoft Office Suite and Adobe proficiencyExcellent verbal and written communication skillsAbility to manage conflict situations when presenting credit status.Ability to research industry and market information.Excellent time management skills.Customer service skills.Education Requirements:Post high school education or Bachelor’s degree preferred.Environment / Physical Factors: Position performed in an indoor, professional environment.Ability to work on a computer for extended periods."}