{"jobID": "2757437185", "jobLocation": "Troy_MI", "jobTitle": "Program Manager", "companyRating": "2.8", "companyInfo": {"Website": "www.voxxintl.com", "Headquarters": "Orlando, FL", "Size": "1001 to 5000 employees", "Founded": " 1965", "Type": " Company - Public (VOXX) ", "Industry": " Consumer Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Bose, DUAL ELECTRONICS"}, "estimatedSalary": "79000", "jobDescription": "Summary/Objective  The Program Manager (PM) is a Business Manager between VOXX Automotive (VA) and its customers. This position is responsible for coordinating program and customer deliverables with sales, marketing, engineering, purchasing, quality and manufacturing and to ensure on time project development, product delivery, accurate costing, targeted profit and product quality. Essential FunctionsCoordinate all internal departments to maximize potential sales on a monthly basis while maintaining a high level of customer satisfaction.Assist in VA’s growth through the Goal Planning process and individually driven goals. Prepare quote packages in response to customer initiated RFQ’s.Through the use of VA’s internal Product Development Lifecycle system, create and regularly maintain project tracking files with all documentation required to support TS/IATF-16949.Create and release new component part numbers and/or finished good BOM’s.Prepare monthly sales forecast for all responsible finished good part numbers.Gather information and outline items including but not limited to program/project timing, costing, specifications, etc. and provide associated information directly to customer and/or designated commercial employees for final communication to customers.Assure program timing and relevant deliverables are established and obtainable in conjunction with the customer and company requirements.Preparation and/or presentation of current or under development products to OE purchasing/product planning/engineering teams.Assist in management of raw materials planning to allow on-time delivery and eliminate/minimize potential obsolescence risk.Ability to develop and maintain an effective relationship with customers.Report out on program/project status to appropriate VA’s departments and management as necessary.Determine resource requirements necessary to complete projects and solve open issues.Responsible to function as the main business contact between VA and its customers.Assist in the development and continuing improvement efforts to establish VA and the Program Management Department as World Class in the industry.Comply with company and department policies, procedures, guidelines and standards.Preferred Education and ExperienceBachelor's Degree in Engineering or business disciplines Minimum of 3 years’ experience in Project/Program Management. Five (5) years’ experience in OEM Automotive preferredSelf-starter/EntrepreneurAbility to multi-task while overseeing multiple projects and/or multiple OE customers.Ability to read schematics, harness prints, mechanical drawings and bills of materials.Knowledge of TS/IATF - 16949 requirements including but not limited to APQP, PPAP and FMEA processes. Experience with major Tier1/OE customers preferred.Experience with major Tier1/OE customers preferred.Adobe, MS Excel, MS Word, MS Project, AS400 software experience preferred.Basic understanding of electronic principles, vehicle electronics and wiring (Experience in RKE, security, video, head unit, or infotainment product categories preferred)Excellent time management, problem solving, organizational, and verbal and written communication skills.Basic mechanical inclination.Basic understanding of automotive 12-volt electronics.Desired SkillsMust have strong presentation skillsAbility to deal with problems and find solutions quickly This position requires both domestic and international travel.  VOXX Automotive/Code Systems offers all full-time employees’ medical, dental, vision (company fully pays vision), 401(k) with company match, life insurance, short-term disability and long-term disability.  VOXX is an EOE."}