{"jobID": "2796397625", "jobLocation": "Laurel_MD", "jobTitle": "Navigation Systems Scientist", "companyRating": null, "companyInfo": {"Website": "www.jhuapl.edu", "Headquarters": "Laurel, MD", "Size": "5001 to 10000 employees", "Founded": " 1942", "Type": " Nonprofit Organization", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " MIT Lincoln Laboratory, Lockheed Martin, Northrop Grumman"}, "estimatedSalary": null, "jobDescription": "Navigation Systems Scientist-17629Position Description Do you want to help ensure the integrity and resilience of US military position, navigation and timing systems in these challenging times? If so, look no further.APL is seeking a Navigation Systems Scientist to provide leadership and insight for ensuring the integrity and resilience of U.S. Navy afloat navigation systems in response to evolving challenges. Duties:Perform insightful navigation research, engineering analysis and solutions development, and provide results to the sponsors. (30%)Create high-fidelity models and simulations of navigation sensors and systems using sound engineering and physics fundamentals. Design and lead studies to evaluate navigation sensors and architectures and optimize navigation system integration and performance. Produce sound engineering assessments and technical analysis of current and proposed navigation systems designs and provide conclusions to navigation community and U.S. Navy sponsors. (20%)Provide technical expertise and critique in support of sponsor-driven position, navigation, and timing (PNT) initiatives. Impartially evaluate potential navigation solutions based on a wide variety of PNT technologies for suitability in meeting mission requirements. When appropriate, recommend alternatives or enhancements to proposed solutions. (20%)Provide assured navigation strategy and planning to U.S. Navy sponsors. Lead the determination of navigation requirements for safe passage and mission operations, identify future PNT capabilities that meet emerging challenges. (15%)Develop and maintain a significant depth and breadth of understanding of afloat navigation sensors, requirements, challenges, and threats through directed and independent research, conferences, and seminars. Stay up-to-date on technology advancements and evolutions. (10%)Develop test procedures and evaluation plans in support of afloat navigation systems improvement and integration. Will have unique opportunities to conduct navigation system testing at field sites and at sea on U.S. Navy surface ships and submarines. (5%)Note: This job summary and listing of duties is for the purpose of describing the position and its essential functions at time of hire and may change over time.Qualifications: Required Qualifications:PhD in physics, mathematics, engineering, or closely-related field.Experience in sensor integration, data fusion, or optimal estimation.Demonstrated ability to perform systems engineering tasks and analysis on complex systems.Demonstrated ability to work independently and as part of a multidisciplinary team.Excellent organizational and communication (written and spoken) skillsDesired Qualifications:5+ years' experience interfacing with U.S. Navy sponsors.Experience with surface or submarine operations and the U.S. Navy navigation systems.Knowledge of the principles of inertial navigation and timing.Experience with one or more maritime navigation methods, such as acoustic velocity sensing, geophysical navigation, radar navigation, or GNSS.Preference for active SECRET clearance or higher.Special Working Conditions: Some travel, including opportunities to support special tests at test sites and at sea. Security: Top Secret Clearance is required. Applicants selected will be subject to a Government security investigation and must meet the eligibility requirements for access to classified information up to the Top Secret level. Eligibility requirements include US citizenship. Benefits: APL offers a comprehensive benefits package including a liberal vacation plan, a matching retirement program, significant educational assistance, a scholarship tuition program for staff with dependents, and competitive salaries commensurate with skills and experience. For more information about our organization, please visit our web site at www.jhuapl.edu. Equal Employment Opportunity: Johns Hopkins University/Applied Physics Laboratory (APL) is an Equal Opportunity/Affirmative Action employer that complies with Title IX of the Education Amendments Acts of 1972, as well as other applicable laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, disability, or protected Veteran status.The Johns Hopkins University Applied Physics Laboratory (APL), a national leader in scientific research and development, is located midway between Baltimore and Washington, DC.Primary Location *United States-*Maryland-*LaurelSchedule Full-time -"}