{"jobID": "2824335327", "jobLocation": "West_Hollywood_CA", "jobTitle": "Oakley - Business Analytics Manager", "companyRating": "3.0", "companyInfo": {"Website": "www.luxottica.com", "Headquarters": "Milan, Italy", "Size": "10000+ employees", "Founded": " 1961", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Safilo, Marcolin, Marchon Eyewear"}, "estimatedSalary": "118000", "jobDescription": " Requisition ID: 59330  Position:Full-Time  Oakley, Inc. is a sport and lifestyle brand, driven to ignite the imagination through the fusion of art and science. Building on its legacy of innovative, market-leading optical technology, the company manufactures and distributes high performance sunglasses, prescription lenses and frames, goggles, apparel, footwear, and accessories.  The essence of the brand is communicated through hundreds of professional and amateur athletes who depend on Oakley products to provide them with the very best while they redefine what is physically possible.  Oakley is part of Luxottica, a global leader in the design, manufacture and distribution of fashion, luxury and sports eyewear. Our wholesale network covers more than 150 countries and our retail presence consists of over 7,200 retail stores across the globe.  In North America, our wholesale business is the home to other global brands like Ray-Ban and many of the top fashion house brands. Our leading retail brands include; LensCrafters, Sunglass Hut, Pearle Vision, Target Optical and Sears Optical. We are also home to EyeMed, the fastest growing vision care company in the United States. GENERAL FUNCTION The Business Analytics Manager leads and directs the Market Support Team/Demand Planning process for the Optics Categories validation, provides S&OP; interface to other planning processes (e.g. financial forecasting, inventory forecasting, sales planning/budgeting, annual operating plans, etc). The Business Analytics Manager collaborates with operations, manufacturing, sales & marketing, product strategy, finance, and other cross functional teams to drive better inventory management decisions. The Business Analytics Manager validates and consolidates regional sales forecasts, as well as understands supply chain lead times across the Optics Categories. The Manager makes forecast and inventory purchase recommendations at a geographical and product category level that allows the organization to better meet demand, mitigate risk, and maximize profitability. The Business Analytics Manager establishes a clear link between sales plans/budgets and demand plans/inventory purchases. Regular reporting and analysis of forecast metrics, consensus demand, as well as the scheduling and publishing of S&OP; meeting agendas are also completed by the Business Analytics Manager. MAJOR DUTIES AND RESPONSIBILITIESLeads the Market Support Service forum.Develops strong working relationships with sales, product, procurement, and finance teams which support the S&OP; process.Leads Product Life Cycle analysis and facilitates monthly decision meeting.Leads New Product Induction analysis and facilitates monthly decision meeting.Organizes appropriate and accurate data required to support timely and intelligent decisions.Ensures all Strategies of the product life cycle are managed efficiently and accurately.Collaborates with international sales teams in order to achieve agreed upon forecasts by leading regular consensus meetings.Collaborates with Optics Category Managers and Optics Director to understand business unit goals.Works with Sales to develop and monitor monthly/seasonal/yearly forecasts at the \"top-down\" and \"bottom-up\" levels.Performs trend analysis using statistical methods.BASIC QUALIFICATIONSBA/BS in finance/accounting/economics/international business5+ years of business analytics experience2+ years management experienceExpert level knowledge in Excel, PowerPoint, and other MS Office toolsExcellent communication skillsStrong math/analytical skillsEnterprise Resource Planning (ERP) experience (e.g. SAP, Oracle, JD Edwards, etc)Ability to effectively present information and respond to questions from senior managementStrong understanding of demand and supply planning processes and strategy, along with enabling systems and toolsPREFERRED QUALIFICATIONSAdvanced DegreeSupply chain and Sales analysis experience Upon request and consistent with applicable laws, Luxottica will provide reasonable accommodations to individuals with disabilities who need assistance in the application and hiring process. To request a reasonable accommodation, please contact the Luxottica HR Solutions Group at 1-866-431-8484.  We are an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, gender, national origin, religion, age, disability, sexual orientation, gender identity or expression, citizenship, veteran or military status, marital status, pregnancy (including unlawful discrimination on the basis of a legally protected pregnancy or maternity leave), genetic information or any other characteristics protected by law.  Analyst; Finance & Accounting; Strategy/PlanningSDL2017"}