{"jobID": "2814198555", "jobLocation": "Lansing_MI", "jobTitle": "Data Warehouse Business Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "61000", "jobDescription": " Here's the thing about challenges. They provide limitless opportunities for greatness. And what we have in mind for you is definitely big. At UnitedHealth Group, we're changing the future of health care and we have the expertise, advanced technology and global resources to make it happen. As a Senior Business Analyst, you'll work with the brightest minds in the business and find yourself digging deep to find the solutions to help people live healthier lives. You'll be responsible for analyzing, reviewing and forecasting data for operational and business planning to impact the health care system. What could be more satisfying than that? Join us! Primary Responsibilities: The Data Warehouse BA will be working with the customers (Michigan - State Court Administration Office) gathering requirements for various projects  Meet with users for clarification and elaboration as may be necessary to clearly define a problem and conceptualize a development plan  Responsible for creating high level design specifications  Will following the project through implementation  Create testing documents and matrixes and will be responsible for assisting the customer with user testing  Responsible for assisting the technical and business teams with project-related formal documentation  Oversee the daily functions of the help desk where users seek clarification about the data as well as ask for assistance with their account credentials and access  Work with the customer, users and other state agencies to pull data from the warehouse and create specialized reports upon request"}