{"jobID": "2728738369", "jobLocation": "Lanham_MD", "jobTitle": "Data Science Analyst", "companyRating": null, "companyInfo": {"Website": "www.2u.com", "Headquarters": "Lanham, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (TWOU) ", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Summary: The Data Science/Business Intelligence analyst will work to define, develop and implement business intelligence tools and reporting capabilities in support of operational objectives and efficiency improvements. This is a highly quantitative role that requires analytical aptitude, programming skills, management, intellectual curiosity and the ability to communicate results effectively. Key Responsibilities Include:Receive general assignments and decide the best approach and necessary steps to achieve the stated goal.Identify and produce improvements and new enhancements to systems and processes in the business areas you work in, including Post Enrollment Services, Marketing and Admissions.Building and implementing business intelligence products, including reporting dashboards.Manage job workflow optimization and scheduling to support operations.Data exploration to identify drivers & trends within our business.Hypothesis generation, test design, survey research and analysis.Deliver rapid turnaround ad-hoc analysis and troubleshooting issues.Coordination and project management to deliver projects ranging from configuring ETLs to deploying integrations with third party software tools.Things That Must Be in Your Background:Bachelors degree in statistics, mathematics, computer science or operations research required.Knowledge of applied statistics and data mining techniques.Minimum 2 years of experience working with Tableau, R, Python or SQL.Comfort working on multiple projects at once and with dynamic data sets.Attention to detail and the desire to help grow a business unit.Other Attributes That Will Help You in This Role and at 2U:Strong interpersonal & communication skills.Ability to maintain a fun, casual, professional and productive team atmosphere.Excellent communication skills with the ability to communicate in a courteous, tactful, and concise manner.Ability to work with a diverse team in a fast-paced environment.Enthusiasm and the ability to thrive in an atmosphere of constant change.EEO statement: 2U is an equal opportunity employer that does not discriminate against applicants or employees and ensures equal employment opportunity for all persons regardless of their race, creed, color, religion, sex, sexual orientation, pregnancy, national origin, age, marital status, disability, citizenship, military or veterans status, or any other classifications protected by applicable federal, state or local laws. 2Us equal opportunity policy applies to all terms and conditions of employment, including but not limited to recruiting, hiring, training, promotion, job benefits, pay and dismissal. Note: The above statements are intended to describe the general nature and level of work performed by individuals assigned to this position, and are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. About 2U 2U partners with leading colleges and universities to deliver the worlds best online degree programs. Our Platform, a fusion services and technology, enables schools to attract, enroll, educate, support and graduate students around the world. Our company culture is united by our No Back Row® philosophy; the idea that when we each lean in and do our part, we are better individually and collectively. 2U Diversity and Inclusion Statement At 2U, we are committed to creating and sustaining a culture that embodies diverse walks of life, ideas, genders, ages, races, cultures, sexual orientations, abilities and other unique qualities of our employees. We strive to offer a workplace where every employee feels empowered by the ways in which we are different, as well as the ways in which we are the same. Why Its Great toWork at 2U 2U offers a high-energy work environment thats both challenging and fun. We work hard, but our offices are casual and social places. We wear jeans to work and fuel brainstorming sessions with snacks and seltzer. Benefits 2U offers a comprehensive benefits package: Medical, dental, and vision coverageLife insurance, disability and 401(k)Unlimited snacks and drinksGenerous paid leave policies including a PTO allowance for your vacation, personal, or sick daysAdditional time off benefits include:time off to volunteer for non-profit organizationsparental leave after 12 months of employmentholidays that include a winter break from Christmas through New Year and more!Tuition reimbursement program"}