{"jobID": "2723079019", "jobLocation": "Mountain_View_CA", "jobTitle": "Data Scientist Technical Lead, Engineering", "companyRating": "4.4", "companyInfo": {"Website": "www.google.com", "Headquarters": "Mountain View, CA", "Size": "10000+ employees", "Founded": " 1998", "Type": " Company - Public (GOOG) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Apple, Facebook"}, "estimatedSalary": "215000", "jobDescription": "Note: By applying to this position your application is automatically submitted to the following locations: San Bruno, CA, USA; Mountain View, CA, USAAt Google, data drives all of our decision-making. Data Scientist Technical Leads work all across the organization to help shape Google's business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical rigor and statistical methods, you mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As an analyst, you do more than just crunch the numbers. You work with Engineers, Product Managers, Sales Associates and Marketing teams to adjust Google's practices according to your findings. Identifying the problem is only half the job; you also figure out the solution.  With your leadership and professional expertise, you manage a team of analysts, plan project goals and lead the overall strategy for your group. You are a recognized authority in your functional area and develop, organize and launch projects that span engineering and analysis.  As a Data Scientist Technical Lead for YouTube or Search, the scope of your role will impact the entire Product.  For the YouTube Creators platform, the role will be focused on defining and understanding the core metrics (top-level and granular) that drive the supply-side of our business. YouTube viewers have nothing to watch and advertisers have no audiences to market to without the content that our “creators” produce. Creators range from you/me making silly videos to share with our friends - often referred to as casual to professional content (music videos, etc.), and of course in between is our homegrown stars and musicians.  You have previous analytical work to understand the varying types of our creators and the inequality dynamics of viewership (we are a “hits” driven platform, just like any media company). We have the basics down, but we need a great leader and communicator to talk to senior leadership across the organization about this, especially given the nuance. This is where you come in!  Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another. Responsibilities Work with large, complex YouTube data sets; solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Conduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables and presentations.Build and prototype analysis pipelines iteratively to provide insights at scale. Develop comprehensive understanding of Google data structures and metrics, advocating for changes where needed for both products development and sales activity.Directly manage a data science team. Interact cross-functionally with a wide variety of people and teams; work closely with engineers to identify opportunities for, design, and assess improvements to google products.Make business recommendations (e.g. cost-benefit, forecasting, experiment analysis) with effective presentations of findings at multiple levels of stakeholders through visual displays of quantitative information.Research and develop analysis, forecasting and optimization methods to improve the quality of Google's user facing products; example application areas include ads quality, search quality, end-user behavioral modeling, and live experiments. Qualifications Minimum qualifications:"}