{"jobID": "2696210752", "jobLocation": "Whippany_NJ", "jobTitle": "Senior Data Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.karriere.bayer.de/de", "Headquarters": "Leverkusen, Germany", "Size": "10000+ employees", "Founded": " 1863", "Type": " Company - Public (BAYN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": "Bayer is a global enterprise with core competencies in the Life Science fields of health care and agriculture. Its products and services are designed to benefit people and improve their quality of life. At Bayer you have the opportunity to be part of a culture where we value the passion of our employees to innovate and give them the power to change.Senior Data ScientistYOUR TASKS AND RESPONSIBILITIES Looking to be a driver in a digital transformation? If so, this is an opportunity you will want to be a part of!  Data & Analytics is a key capability required to enable Bayer's digital transformation and become a data-driven company. In this role, you will be well-positioned within the Advanced Analytics team to ensure Bayer leverages data as an asset. The position will be responsible for developing analytic models and scalable analytical solutions (information products) that generate insights to drive a competitive advantage within the Life Sciences commercial space. This position will be a part of our growing Advanced Analytics team with ability to mature our capabilities and provide predictive insights across each of our divisions and functions with focus on solving key business questions.  The Data Scientist is responsible for performing statistical analysis on data and delivering insights to business stakeholders across functional / process content area supporting all Bayer Businesses in the U.S. Need to have in-depth knowledge about statistical and mathematical analytical techniques, work with the organization to explore and gather the right data, and produce scientifically sound and impactful presentation of the results to facilitate data driven decisions making.  Got your interest? Here are just a few responsibilities you would have:  The primary responsibilities of this role, Data Scientist, are to: Use, own and leverage others deep business domain knowledge to design data-analytics approach and determine the appropriate data sets and variables to solve them;Curate large sets of structured and unstructured data from disparate sources, cleanse and validate the data to ensure accuracy, completeness, and uniformity; with extending company's data to third party sources of information when needed;Select features, build and optimize classifiers using machine learning techniques;Perform data mining using state of the art methods;Develop stories and visualization to effectively communicate complex qualitative analysis in clear, precise and actionable manner;Contribute to ongoing data science efforts; utilize available data sets and data science best practices to identify business risks and opportunities.Domestic Relocation Assistance is Available as well as sponsorship.WHO YOU ARE Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following:  Required Qualifications: Bachelor’s degree in statistics, applied mathematics, data science, computer science, or related areas with 10 or more years of experience OR Master's degree with eight years of experience OR Doctorate with three or more years OR an equivalent combination of education and experience can be substituted;Experience in Pharmaceutical or consumer related industry, with at least three to five years of experience in data analytics domain;Experience with statistical research techniques, including modeling, data mining, clustering, and segmentation;Demonstrable experience in developing, validating, publishing, maintaining logical data models with exposure to or experience in developing, validating, publishing, maintaining physical data models;Ability to evaluate existing data models and physical databases for variances and discrepancies;Experience with managing mega data for data models;Experience with developing, publishing and maintaining all documentation for models;Passionate about data and analytics applications in the commercial space;Experience with techniques such as Machine Learning, NLP, Graph Theory, AI;Experience with one or more programming languages such as Python, Java, R or Scala;Experience with SQL or other querying language;Ability to effectively communicate data insights through the right medium (dashboard, graph, etc.);Strong integrated consultancy skillset;Demonstrates ability to learn quickly and problem solve;Exceptional organizational and interpersonal skills and a broad external network;Fluent in spoken and written English language. Preferred Qualifications: Prior experience in Commercial analytics space;Knowledge of retail/consumer panels syndicated market measurements.YOUR APPLICATIONBayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and you have the \"Passion to Innovate\" and the \"Power to Change\", we encourage you to apply now. To all recruitment agencies: Bayer does not accept unsolicited third party resumes.Bayer is an Equal Opportunity Employer/Disabled/Veterans Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.Location: United States : New Jersey : WhippanyDivision: Business ServicesReference Code: 18028Contact Us + 1 888-473-1001, option #5"}