{"jobID": "2832895864", "jobLocation": "Cypress_CA", "jobTitle": "Sr Business Data Analyst ( Remediation ) - Cypress, CA or Telecommute", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "66000", "jobDescription": " We'll put you in the driver's seat on vital projects that have strategic importance to our mission of helping people lead healthier lives. Yes, we share a mission that inspires. We need your organizational talents and business discipline to help fuel ours. It's the opportunity to do your life's best work.(sm)  Use your sharp analytical skills to help us support, compile and report key information! Make solid recommendations based on the analysis and provide explanations for reporting results for both internal client management and our E&I; book of business.  As a Senior Business Data Analyst at OptumRx, you will grow and develop as you conduct and calculate outcomes of various research and analytic requests. You will be challenged to analyze, research, and interpret data for clients and business planning. As a key resource, you must maintain a high degree of accuracy along with attention to detail, excellent oral and written communication skills, strong personal work ethic and the ability to manage time to meet deadlines. Success in this role will require ability to prioritize and multitask, as well as being flexible, resourceful, and self-driven!  You'll enjoy the flexibility to telecommute* from anywhere within the U.S. as you take on some tough challenges. Primary Responsibilities:Support client issue remediation by reviewing and analyzing pharmacy claims (calculating before and after scenarios)Review external auditor findings, for either agreement or disagreementResearch, analyze, and evaluate claims data to identify patterns and validate accuracyWork closely with the client account team and other functional departmentsProvide explanations, interpretations, and recommendations for reporting results as neededSupport various projects with financial impacts as neededRequired Qualifications:Bachelor's Degree or 4 years Report Analyst or Business Analyst experience1 years experience using analytical or critical thinking skills in a professional roleAdvanced Microsoft ExcelExperience with large data sets, data manipulation and scrubbing to create meaningful conclusions and summariesPreferred Qualifications:Master's Degree in Business, Finance, Health Administration.Knowledge of PBM and pharmacy benefit structureExperience in Microsoft Access: create tables, queries, joins, data manipulation UnitedHealth Group is working to create the health care system of tomorrow.  Already Fortune 6, we are totally focused on innovation and change. We work a little harder. We aim a little higher. We expect more from ourselves and each other. And at the end of the day, we're doing a lot of good.  Through our family of businesses and a lot of inspired individuals, we're building a high-performance health care system that works better for more people in more ways than ever. Now we're looking to reinforce our team with people who are decisive, brilliant - and built for speed.  Come to UnitedHealth Group, and share your ideas and your passion for doing more. We have roles that will fit your skills and knowledge. We have diverse opportunities that will fit your dreams. All Telecommuters will be required to adhere to UnitedHealth Group's Telecommuter Policy. Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.  Job Keywords: Senior Business Data Analyst, Remediation, data analyst, business analyst, business data analyst, Cypress, CA, California, telecommute, work from home, travel, wfh, telecommuting, telecommuter"}