{"jobID": "2832429107", "jobLocation": "Houston_TX", "jobTitle": "Institute Research Scientist - Program Biology - ECLIPSE", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": " ECLIPSE (Evolution of Cancer, Leukemia and Immunity Project) is a novel organization within the MD Anderson Cancer Center, Houston, Texas, with the mission of making MDACC and its partners recognized leaders in the identification and development of innovative immunooncology therapies that will cure all hematologic malignancies.  The primary requirement for an individual in this position is an experienced and highly motivated individual with hands-on experience in identification and validation of potential therapeutic targets for patients with advanced hematological malignancies. Such data generated from the team is expected to influence a broad array of decisions around target prioritization and generation of therapeutic modalities against those particular targets. The successful candidate will participate in cross-functional research to design and develop novel assays that will support an understanding of target biology. The selected candidate will be expected to work at the bench and contribute to development and implementation of potential biomarker strategies to support clinical development. Previous experience in biotech/pharma is highly preferred.  Salary range: Min $98,000 - Mid $122,500 - Max $147,000  The mission of The University of Texas M. D. Anderson Cancer Center is to eliminate cancer in Texas, the nation, and the world through outstanding programs that integrate patient care, research and prevention, and through education for undergraduate and graduate students, trainees, professionals, employees and the public.  Key Functions Design and develop key experiments contributing to the conception, execution, and championing of novel targets, technology platforms, and strategies related to the development of biologics-based clinical candidate programs.Provide expert technical guidance to others on project/task groups. Determine priorities and communicate to the team. Redirect operations as necessary to achieve objectives.Collaborate with team members on a discovery platform using high throughput multi-omic technologies and apply scientific expertise in immunology and cancer biology to drive these programs in a multidisciplinary and exciting research team environment.Interface with scientific staff both within the institution and outside, including industry collaborators, external consultants and stakeholders.Commitment to keep abreast of current and emerging technological and scientific advancements in the field.Education Required: Bachelor's degree in Biology, Biochemistry, molecular biology, cell biology, enzymology, pharmacology, chemistry or related field.  Preferred: PhD in Biochemistry, Molecular Biology or a related discipline.  Experience  Required: Ten years of relevant research laboratory experience. With Master's degree, eight years of required experience and with PhD, two years of required experience. Experience with genetic (ie RNAi and CRISPR) and pharmacological (i.e. small molecule inhibitors or antibodies) approaches to study target biology utilizing state of the art molecular biology and biochemistry methods and assays.Hands-on experience in standard in vitro and in vivo cell biology and immunology assays including, but not limited to, expansion of CTLs, tetramer assays, cytotoxicity assay, functional assays like ADCC, ADCP etc. is highly desirable.Broad knowledge of cell culture techniques is required and knowledge of in vivo oncology models is desirable.Extensive knowledge and experience in key areas of tumor biology such as oncogenic signaling, tumor microenvironment, tumor immunology, metabolism, epigenetic deregulation or anti-apoptosis as evidenced by publication in peer-reviewed journals.Strong data analysis skills, ability to interpret results and contribute to the design of follow-up experiments, troubleshoot issues with assay performance.Ability to effectively present results and conclusions to co-workers, collaborators and senior leadership.Ability to approach problems with curiosity and open mindedness; offer new ideas, solutions and/or options. Notice current processes/products needing improvement and generate new options using own technical expertise and by utilizing multiple resources.Ability to effectively challenge others in a group to identify creative approaches.Ability to ensure scientific excellence, quality and completeness of programs.Strong knowledge of translational immunology such as identification of targets for immunotherapy in solid tumors and/or leukemia.Excellent computer skills with working knowledge of commonly used research software programs. It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. http://www.mdanderson.org/about-us/legal-and-policy/legal-statements/eeo-affirmative-action.html"}