{"jobID": "2745466694", "jobLocation": "Fullerton_CA", "jobTitle": "Sr Data Management Configuration Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.raytheon.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1922", "Type": " Company - Public (RTN) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "72000", "jobDescription": " Would you like to work in a collaborative environment at a state of the art facility in Fullerton, California? Then join our Raytheon team of smart people solving problems that make the world a safer place and help to secure our great nation! Come support those who provide us with all the freedoms we enjoy.  The Raytheon Intelligence, Information and Services (IIS) Configuration and Data Management (CMDM) team is seeking a highly motivated Data Management Configuration Analyst. This position will provide data management (DM) support to engineering programs in Fullerton, California and will be responsible for determining DM requirements and administering DM activities to ensure compliance with contract requirements. The Data Manager works closely with Program Management, Contracts, Engineering, Configuration Management, and functional personnel assigned to the program to accomplish this task. The candidate must be a flexible team player with the ability to prioritize and juggle multiple concurrent tasks in a diverse environment. A current DoD SECRET clearance (or higher) is required. Key Responsibilities:Developing and implementing Data Management principles, processes and training, configuration control, library/repository facilitation, and product release and delivery.Ensures that all required deliverable and non-deliverable contract data are properly identified, scheduled, marked, approved, inspected, submitted, and accepted.Ensures that all program-related information is effectively stored and controlled during execution, and when the contract closeout activity is completed.Ability to guide individuals to accomplish change management steps in a timely manner.Collaborates across the Program Management Office (PMO) to proactively manage DM risks, opportunities, and overall deliverables.Manages digital files and work products.Provides support for proposals, quotations and budget/cost reviews.Required Experience, Knowledge, Skills, or Abilities:Bachelor and at least 4 years of experience working in CM or related engineering disciplineMust have a current secret clearanceExperience working in a technical environment interfacing with all engineering disciplines and able to work well in a team environment and actively assist or provide direction as needed.Experience with Microsoft office tools advanced features: Excel, Word, PowerPoint, Access or other database experience requiring schema definition and data manipulation.Experience with Sharepoint, WebDM or other automated tools that enable tracking and forecasting of data requirements required for delivery to the CustomerExperience with Configuration Management Systems CMSTat and Windchill PTCHighly organized, detail oriented and able to implement strict process for change control.Records management awareness.General understanding of how to perform Peer Reviews.EXIM awareness and marking.Desired Experience, Knowledge, Skills, or Abilities:Certifications from either NDIA or CMII in Configuration ManagementExperience working with CMMI and ISO 9000 CM requirements.Must be organized and able to prioritize task efforts.Experience working within a team environment as well as working independently with minimal supervision.Excellent written and oral communication skills.Education: Bachelor of Science or Bachelor of Arts degree in related field 113588Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender identity, national origin, disability, or protected Veteran status."}