{"jobID": "2776986129", "jobLocation": "San_Francisco_CA", "jobTitle": "Software Engineer - Adobe Stock", "companyRating": null, "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": null, "jobDescription": " The Challenge:  We are looking for someone who loves building services for the creative professional and implementing features across the full Web Solution Stack – ours is Linux, Nginx, Node 8, Postgres using Docker.  What you'll do:  You’ll be working as part of a team, creating innovative new features and maintaining existing ones for Adobe Stock (stock.adobe.com) and underlying micro services. The perfect candidate will need a keen eye for details and high standards for code quality and efficiency. Knowledge of best practices in building scalable applications is highly desirable. Candidates who enjoy tackling complex technical challenges, have a passion for delighting customers and who are self-motivated to push themselves in a team oriented culture will thrive in our environment.  What you’ll need to succeed: Experience developing consumer facing web sites built with micro services using Node and/or Java, JavaScript, HTML, and CSSExperience with test-driven and behavior-driven development and tools (e.g. Mocha, Sinon, cypress, Jasmine, Junit)Knowledge of best practices and SOLID design principles in object oriented programmingKnowledge of security best practices (e.g. SQL injection, XSS and other exploits)Solid knowledge of JavaScript and related libraries or tools (Webpack, ES6, Express, Redux)Excellent trouble shooting skills across layered systems/servicesFront End Engineers should have a good knowledge of CSS (SCSS, bootstrap3, OOCSS, BEM) and HTML5BS in Computer Science or a related fieldPassion for Software Engineering At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}