{"jobID": "2770186395", "jobLocation": "Newark_NJ", "jobTitle": "Market Data Analyst- (Newark, NJ)", "companyRating": "3.5", "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": "54000", "jobDescription": "PGIM, the global investment management businesses of Prudential Financial Inc., is one of the world’s leading money managers. With offices in 16 countries and over $1 trillion in assets under management, clients rely on our risk management expertise, intellectual capital and creative solutions to realize their investment objectives. Our distinct multi-manager model delivers a broad suite of actively-managed solutions in the areas of public and private fixed income, equities and real estate to serve our clients’ needs. We are passionate about delivering investment returns for our clients and dedicated to our greatest asset – our people. Do you want to be part of a multi-manager model that enables each business to maintain its own investment culture? Learn more about who we are and how we can work together, please visit: www.pgim.com PGIM Operations & Systems PGIM Operations & Systems provides the operations and technology support that contributes to PGIM being a world-class investment manager. PGIM Market Data Services PGIM Market Data Services is the centralized resources within Prudential responsible for procuring and coordinating all market data and research services globally. Centralizing the function allows for more clarity on costs and provides added benefits when leveraging services, negotiating fees, reviewing contracts and performing the vendor due diligence that spans across multiple Prudential businesses.PGIM Market Data Services seeks a highly motivated individual as Market Data Business Management Analyst. This position covers all market data business management functions. You will be responsible for coordinating move, adds, or changes for the various market data services, submitting and reconciling invoices, updating the current inventory and databases, soliciting feedback from end users for service renewals, coordinating due diligence meetings, updating the vendor due diligence database, and working with other team members to implement the onboarding of new vendors and continual review of existing vendors. You will have direct interaction with internal investment professionals as well third-party market data vendors. Primary Responsibilities: Responsible for maintaining the inventory of the various market data vendor services.You will utilize and update the Archer database with any changes to existing, terminated, or new vendor engagements.Process moves, adds, changes for market data applications and services.Submit and reconcile invoices against market data inventory.Communicate and work with various supported internal business partners and users as well as external third-party vendors.Solicit internal feedback from end users for upcoming service renewals.Prepare inventory reports using an industry standard market data inventory management database like FITS.You will be performing data reconciliations by analyzing and comparing multiple sources of data.You will be the primary point person to assist with the collection and distribution of due diligence data audit reporting from our third-party market data vendors. (e.g. vendor business continuation plans, SOC2/SSAE-16s, software compatibility matrixes, SIGs, other due diligence questionnaires, etc.)Coordinate and schedule due diligence meetings and conference calls with internal business partners as well as external third-party vendors. Does this sound like you? Bachelor's degree in a business discipline preferred with a solid GPAOne to two years’ experience working within the market data business management, vendor governance, or third-party risk management fields.Do you possess a working knowledge or some experience with market data vendors, (e.g., Bloomberg, Thomson Reuters, S&P; Global, FactSet, Moody’s, Markit, ICE Data Services, etc.)?Are you highly detail oriented, possess strong oral, written communications and data entry skills?Are you enthusiastic with a desire to perform well?Are you able to breakdown or identify information or undefined problems into specific and workable components?Can you make logical conclusions, anticipate obstacles or consider different approaches in making decisions?Do you excel at working relationships with colleagues to meet mutual goals as well as working independently?Have the ability to multi-task/juggle multiple assignments and meet deadlines in a demanding environmentProficient computer and software capabilities, with knowledge of Excel, Pivot tables, SharePoint or Business Intelligence software.Working knowledge of the Market Data Inventory System, FITS is a plus.Working knowledge of the vendor due diligence Archer database or a like database is a plus."}