{"jobID": "2803941241", "jobLocation": "Springfield_MI", "jobTitle": "Dean of Instruction at Endeavor Charter Academy", "companyRating": null, "companyInfo": {"Website": "www.nhaschools.com", "Headquarters": "Grand Rapids, MI", "Size": "5001 to 10000 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Charter Schools USA, Imagine Schools, Success Academy Charter Schools"}, "estimatedSalary": null, "jobDescription": "Bring your passion for influencing and supporting our youth to National Heritage Academies (NHA) as a dean to one of our NHA partner schools. About UsNHA is a charter school management company that operates 80 schools in 9 states. We are committed to our mission of “challenging each child to achieve…” and we pride ourselves on our students’ ability to achieve high results in later education based on the foundations gained in grades K-8 at NHA.  In our schools you will find bright colors, smiling faces, and opportunity. While working at an NHA partner school you will make a difference in the lives of our over 500 students. You will gain invaluable experience and have fun along the way. Here are a few ways we grow and celebrate together; NHA professional development opportunities, a company-wide March Madness tournament, and spirit contests amongst staff during designated appreciation weeks.  In this position, the school principal and director of school quality will be there to support you every step of the way. Along with our result-driven curriculum and commitment to educating the whole child – academically, morally, and socially – you and your students will be set up for success.Your Role Lead and coach a team of educators through weekly classroom observations and one-on-one meetingsSupport academic growth by providing feedback and evaluating educatorsSupervise student disciplineDevelop a strong instructional team committed to success and NHA’s mission and purposeManage parent and community relationships and maintain high levels of parent satisfactionPromote strong student achievement resultsRequirementsBachelor’s degree and a minimum of 3 years’ experience in teaching, as well as one year experience as Instructional Coach and/or Assistant PrincipalMust hold a valid administrator license for the state in which you are applying, if requiredCandidates with experience working with at-risk students – preferred, if applicable to the school To learn more about our core values, please click here.  National Heritage Academies is an equal opportunity employer."}