{"jobID": "2838006386", "jobLocation": "Chicago_IL", "jobTitle": "Research Data Analyst", "companyRating": "4.3", "companyInfo": {"Website": "www.northwestern.edu", "Headquarters": "Evanston, IL", "Size": "5001 to 10000 employees", "Founded": " 1851", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Princeton University, Stanford University, Yale University"}, "estimatedSalary": "56000", "jobDescription": "Job Summary: This role provides expertise in data management, quality assurance, analysis and reporting. Establishes data accuracy and validity derived from a variety of systems. Performs data analysis using statistical techniques. Develops queries to obtain research data sets from complex databases. Researches and analyzes information using multiple databases and creates reports of data and results. Assists in the preparation and delivery of decision support reports to both internal and external customers.  The mission of the Center for Health Information Partnerships (CHiP) is to bring people, communities, and data together to enable everyone to live their healthiest lives. Utilizing new ways of thinking, innovative methods, and interdisciplinary partnerships, we aggregate and analyze health information across institutions and disciplines to positively affect individual and population health. CHiP has a vision for \"information-driven health for all.\" Specific Responsibilities: Strategic Planning  Partners with clients to define requirements based on business objectives.  Administration  Develop standardized templates, policies, and procedures for internal and external reporting.  Designs and prepares documentation for qualitative and quantitative data analysis.  Discuss findings with senior management.  Development  Develop queries and quality metrics.  Interprets results using a variety of techniques, ranging from simple data aggregation to more complex statistical analysis.  Manages complex databases.  Performance  Completes data cleaning and organizes data files for analysis.  Reviews data and identifies quality issues.  Presents findings in an appropriate manner.  Supervises  Provides work direction and/or supervises staff such as team members, subordinates, contractors, vendors, students, etc.  Performs other duties as assigned. Minimum Qualifications: Successful completion of a full 4-year course of study in an accredited college or university leading to a bachelor's or higher degree; OR appropriate combination of education and experience.  2 years data analysis/report writing or similar experience required  Microsoft Office  SQL/MySQL/Postgres  Any statistical program (SAS, STATA, or R)  Minimum Competencies: (Skills, knowledge, and abilities.)  Strong SQL skills; must be able to pass the EDW PowerUser test Preferred Qualifications: Experience working with the NM EDW or Lurie EDW or other similarly complex data repositories  Previous work or volunteer experience in a health care setting  Previous work or volunteer or student experience in a health care data analysis setting  Preferred Competencies: (Skills, knowledge, and abilities)  Strong SAS skills  Strong Stata skills  Geographic information systems experience  As per Northwestern University policy, this position requires a criminal background check. Successful applicants will need to submit to a criminal background check prior to employment.  Northwestern University is an Equal Opportunity, Affirmative Action Employer of all protected classes, including veterans and individuals with disabilities. Women, racial and ethnic minorities, individuals with disabilities, and veterans are encouraged to apply. Hiring is contingent upon eligibility to work in the United States."}