{"jobID": "2669525279", "jobLocation": "Mountain_View_CA", "jobTitle": "Scientist: Computer Vision & Machine Learning Engineer", "companyRating": null, "companyInfo": {"Website": "www.osiengineering.com", "Headquarters": "Campbell, CA", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "JOB DESCRIPTION: Scientist: Computer Vision & Machine Learning Engineer for Automotive Research Team in Mountain View, CA  You will focus on research and development of computer vision and machine learning algorithms toward analysis, segmentation, recognition, reconstruction, and interpretation of scenes captured by multi-modal data streams including video cameras and range sensors. Responsibilities:Research and development of computer vision, machine learning, and optimization algorithms for feature selection, semantic segmentation, odometry, motion analysis, and recognition/tracking/forecasting of objects and persons.Design, development, and integration of the software systems and architectures necessary to realize research prototypes.Develop and evaluate metrics to verify reliability of the proposed algorithms.Participate in data collection, sensor calibration, and data processing.Participate in ideation, creation, and evaluation of related technologies in various domains including traffic scenes and indoor robotics.Contribute to a portfolio of patents, academic publications, and prototypes to demonstrate research value.Must Have Skillsets:Strong familiarity with machine learning techniques pertaining to visual recognition and/or video analytics.Highly proficient in software engineering using C++ and Python.Strong written and oral communication skills including development and delivery of presentations, proposals, and technical documents.Strong publication record in one or more of the following areas: computer vision, machine learning.M.S. or PhD in computer science, electrical engineering, or related field.Desired Skillsets:Experience in open-source Deep Learning frameworks such as TensorFlow or Caffe.Hands-on experience in handling multi-modal sensor data. Location: Mountain View, CA  Type: Fulltime CONTACT INFORMATION: Alan Bui  alan@OSIengineering.com  (408) 550-2800 x106 OSIJOBS"}