{"jobID": "2783006455", "jobLocation": "Hopewell_NJ", "jobTitle": "Research Scientist - ADME Bioanalysis", "companyRating": "3.6", "companyInfo": {"Website": "www.bms.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1858", "Type": " Company - Public (BMY) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": " Bristol-Myers Squibb is a global biopharmaceutical company whose mission is to discover, develop and deliver innovative medicines that help patients prevail over serious diseases.  One shared journey is moving us forward at Bristol-Myers Squibb. Around the world, we are passionate about making an impact on the lives of patients with serious disease. Empowered to apply our individual talents and ideas so that we can learn and grow together. Driven to make a difference, from innovative research to hands-on community support. Bristol-Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees the resources to pursue their goals, both at work and in their personal lives.  The chosen individual will be a highly motivated bioanalytical scientist who will provide quantitative bioanalytical support, using quantitative LC-MS/MS, for a variety of high throughput ADME profiling assays in drug discovery. In this hands-on role, the chosen individual will use state-of-the-art analytical technologies to evaluate in-vitro ADME properties of synthetic discovery compounds. Self-motivation, scientific curiosity, attention to details, and strong communication and problem-solving skills are required. Develop LC-MS/MS methods, perform sample analyses, and review, interpret and report results.Operate and troubleshoot HPLC and MS instrumentation.Actively participate in continuous improvement efforts in new assay design, technology evaluation and implementation, as well as process optimization.Work closely with others in cross-function teams to ensure timely delivery of high quality data.Create presentations and reports to summarize scientific findings. The candidate will have a B.S. or M.S. in Chemistry, with specialization in analytical chemistry, along with at least three years of relevant biopharmaceutical experience. The following qualifications are required or preferred. Strong background in both mass spectrometry and separation science is required, and hands-on operating experience in quantitative LC-MS/MS analysis is preferred.Proficiency in general computer software, as well as vendor-specific LC-MS instrument control and data analysis tools from major vendors such as Sciex, Thermo, and Waters is required.Proficiency in troubleshooting analytical LC-MS instrumentation is preferred.Excellent written and verbal communication and interpersonal skills to effectively interface with others working in a matrix team environment are required.A working knowledge of allied disciplines such as synthetic chemistry, drug metabolism & pharmacokinetics, lab automation and computer programming is helpful.SDL2017"}