{"jobID": "2804209349", "jobLocation": "Galesburg_MI", "jobTitle": "Product Development Engineer - Eaton Cummins Automated Transmission Technologies", "companyRating": null, "companyInfo": {"Website": "www.cummins.com", "Headquarters": "Columbus, IN", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (CMI) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Eaton Cummins Automated Transmission Technologies is a place big enough to coach and develop a global workforce and create automated transmission products. We’re also small enough for you to find your fit and personal passion with a team of dependable, innovative thinkers who are developing their careers within a diverse, inclusive, empowering environment. Learn more about this role and how you can begin Working Right.Eaton Cummins Automated Transmission Technologies is a joint venture between Eaton and Cummins, Inc. producing industry-leading medium- and heavy-duty automated transmission products to OEM customers around the globe. Our business thrives with talent from diverse skillsets and backgrounds. Grow your career by joining this exceptional collaboration opportunity that embraces innovative thinking, compelling creativity, and customer-focus. This is an exciting opportunity in Galesburg, Michigan for a Systems Engineer.Eaton Cummins Automated Transmission Technologies is where you can work on industry leading engineering projects.Your impact will happen in these and other ways:Applies specialized knowledge of engineering principles and practices across various areas and projects in one or more of the following areas: development and maintenance of subsystem or component level requirements; development of subsystem or component verification and validation plans; architecture and generation of concept designs and functional allocation of subsystem requirements to components; and/or development of subsystem interface agreements, installation / application guidelines and quality assurance procedures. Applies technical expertise on complex components or projects and works under minimal supervision.Leads small projects or portions of large projects.Provides technical direction for a project or a project team.Participates as a key contributor and is accountable for project success.Influences at department or program management level.Provides input on program-related decisions.Proposes innovative initiatives and projects.Demonstrates depth of knowledge of engineering discipline(s) and leverages expertise on other projects.Troubleshoots complex problems and recommends appropriate actions.Assists with the transfer of knowledge; coaches and mentors less experienced engineers.Skills and Experience Required:Product Integration, Verification & Validation - Understands the basics of integration, verification, and validation concepts including component testing, integration testing, system testing, performance testing, test planning and documentation, and test environment. Has led the creation or mapping of tests to requirements and needs for several projects. Has led the creation of system test plans balanced with budget and appropriate risk mitigations.Product Risk Management - Understands the basics of risk management concepts including risk identification, risk management planning, and risk monitoring. Should be able to produce lists of the product-specific risk items likely to compromise a project's success, and develop strategies to mitigate or control the risks.Requirements Engineering - Understands the basic terminology used in requirements engineering. Has leadership experience in the development and maintenance of requirements for a component, sub-system, or process. Has had accountability for the overall development and maintenance of requirements on their project and for the capability of all Requirements Engineering processes, people, and tools within their extended project team.Systems Definition And Design - Understands the basics of the system design process including requirements allocation and architecture definition, capability determination through system modeling and testing. Has applied these skills in a past system design project.Concept Design/Architecture - Performs concept design/architecture at an advanced level. Proficient in the application of concept design/architecture in a wide range of work situations. Able to lead the application of concept design/architecture. Able to train and coach others in the development of concept design/architecture skills and knowledge.Experience: 3-7 years relevant work experience Validation experience Automotive background Required Education, Licenses or CertificationsCollege, university, or equivalent degree in Engineering required.CDL License or ability to obtain within first 3 weeks Compensation and BenefitsBase salary commensurate with experience. Additional benefits vary between locations and include options such as our 401(k) Retirement Savings Plan, Medical/Dental/Life Insurance, Health Savings Account, Domestic Partners Coverage and a full complement of personal and professional benefits.Eaton Cummins and E-verifyAt Eaton Cummins Automated Transmission Technologies, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law. Eaton Cummins validates right to work using E-Verify. Eaton Cummins Automated Transmission Technologies will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee’s Form I-9 to confirm work authorization.Ready to think beyond your desk? Apply for this opportunity to start your career with Eaton Cummins Automated Transmission Technologies today. "}