{"jobID": "2811774755", "jobLocation": "Sacramento_CA", "jobTitle": "Senior Data Analyst - Optum State Government", "companyRating": "3.3", "companyInfo": {"Website": "www.unitedhealthgroup.com", "Headquarters": "Minnetonka, MN", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (UNH) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Aetna, Humana, WellPoint"}, "estimatedSalary": "71000", "jobDescription": " Is it time to build on your skills and knowledge in a setting that makes the most of both? We can challenge you in ways that require you to bring it all, every day. Optum, part of the UnitedHealth Group family of businesses, has more technology, greater data resources and far broader expertise than any competitor anywhere. Were creating hundreds of custom applications and manage thousands of hardware components. And that complexity is where you come in. In this role, youll be involved in architecting and designing data warehouse solutions. You will be a primary contributor in developing, testing and deploying key data warehouses, data marts and will be working with cutting edge technology. Youll find yourself stretching, learning and expanding your impact. Primary Responsibilities:Gather and analyze business requirementsArchitect/Design Data Warehouse infrastructure and solutionsDevelop technical specifications and design documentsDevelop, enhance, integrate, test and deploy Data Warehouses/Data Marts and Business Intelligence SolutionsSupport the user community with issues and enhancements to the existing solutions Know that this opportunity comes with big potential and big challenges. It takes an ability to solve technical and strategic challenges using innovative approaches. Youll be using complex data to support business decisions and youll need to demonstrate collaborative, creative and conceptual thinking. Required Qualifications:Undergraduate degree or equivalent work experience5+ years of hands-on experience with architecting solutions, design, development and data analysis in a large, enterprise environmentGood analytical, communication and work relationship skillsPreferred Qualifications:Health care industry experienceHealth Care Claim 835 and 837 transactions knowledgeSAS Enterprise Guide knowledgeCareers with Optum. Here's the idea. We built an entire organization around one giant objective; make health care work better for everyone. So when it comes to how we use the world?s large accumulation of health-related information, or guide health and lifestyle choices or manage pharmacy benefits for millions, our first goal is to leap beyond the status quo and uncover new ways to serve. Optum, part of the UnitedHealth Group family of businesses, brings together some of the greatest minds and most advanced ideas on where health care has to go in order to reach its fullest potential. For you, that means working on high performance teams against sophisticated challenges that matter. Optum, incredible ideas in one incredible company and a singular opportunity to do your life's best work.(sm)Diversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.  UnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment. Keywords: data warehouse, data marts, database, data analysis, data analytics, Data Analyst, Information Technology, IT, technology, Optum, health care claim 835 and 837 transactions, SAS Enterprise guide, Sacramento, CA, California"}