{"jobID": "2652409136", "jobLocation": "Chicago_IL", "jobTitle": "Quantitative Researcher – Intern", "companyRating": null, "companyInfo": {"Website": "www.citadelsecurities.com", "Headquarters": "Chicago, IL", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Virtu Financial"}, "estimatedSalary": null, "jobDescription": " Job Description Quantitative Researchers play a key role on the Quantitative Research (“QR”) team, which is responsible for developing and testing automated quant trading strategies using sophisticated statistical techniques. You’ll get to apply and hone your quantitative skills in a structured program that allows you to work side-by-side with, and learn from, those who are thriving in this exciting and growing field.Your ObjectivesConceptualize valuation strategies, develop and continuously improve upon mathematical models, and help translate algorithms into codeBack test and implement trading models and signals in a live trading environmentUse unconventional data sources to drive innovationConduct research and statistical analysis to build and refine monetization systems for trading signalsYour Skills & TalentsAdvanced training in Mathematics, Statistics, Physics, Computer Science, or another highly quantitative field (Bachelors, Masters, PhD degree)Strong knowledge of probability and statistics(e.g.,machine learning,time-series analysis,pattern recognition,NLP)Prior experience working in a data driven research environmentExperience with NoSQL databases (e.g.,MongoDB)Experience with distributed computing using MapReduceExperience with analytical packages (e.g., R,Matlab)Independent research experienceAbility to manage multiple tasks and thrive in a fast-paced team environmentExcellent analytical skills, with strong attention to detailStrong written and verbal communications skillsOpportunities available in Chicago, London, Hong Kong and New York About Citadel SecuritiesCitadel Securities is a leading global market maker across a broad array of fixed income and equity securities. Our world-class capabilities position us to meet the liquidity demands of our diverse group of institutional clients in all market conditions. In partnering with us, our clients, including asset managers, banks, broker-dealers, hedge funds, government agencies and public pension programs are able to gain a powerful trading advantage and are better positioned to meet their investment goals.  The team makes its mark every day from our offices around the world: Chicago, New York, London, Hong Kong, Toronto, Shanghai, Sydney, Dublin. Apply NowApply"}