{"jobID": "2805962881", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.shutterflyinc.com", "Headquarters": "Redwood City, CA", "Size": "1001 to 5000 employees", "Founded": " 1999", "Type": " Company - Public (SFLY) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Snapfish, Vistaprint, Minted"}, "estimatedSalary": "133000", "jobDescription": " The Data Scientist will be responsible for designing and directing experiments and observational studies to optimize our marketing efforts. This role requires an individual with a strong ability to communicate and collaborate across functional teams, in addition to outstanding analytical and critical thinking skills. The role will have a strong focus on experimental design.  Responsibilities:  - Directly impact resource allocation decisions by designing and directing experiments and observational studies  - Partner with the marketing and business strategy teams to define and test hypotheses that answer critical business questions  - Perform deep-dive statistical analysis on large, complex, multi-dimensional datasets.  - Develop and contribute to a base of understanding that allows us to make optimal resource allocation decisions  Qualifications:  - Advanced degree (MS, Ph.D.) in quantitative fields, and 2-3 years of experience with a range of techniques, tools, and methods related to data mining and statistical analysis  - Strong ability with a statistical language such as R or SAS, and hands-on experience using a variety of analytical methods  - Experience with or strong working knowledge of experimental design concepts, regardless of industry/discipline  - Hands-on experience with SQL, working knowledge of database design  - Familiarity with internet marketing data collection methods and marketing technology, including search marketing, social marketing, and ad serving platforms  - Creative mind with strong communication and interpersonal skills; talented with simplifying abstract business issues and large amounts of data into actionable analyses; must be able to interact with diverse groups of technical and non-technical people  -Track record of contributing to successful end-to-end analytic solutions (clarifying business objectives and hypotheses, communicating project deliverables and timelines, and informing action based on findings)  - Strong desire to articulate business recommendations based on analytical workThis position is full-time and based in Redwood City, CA or Eden Prairie, Minnesota."}