{"jobID": "2755949715", "jobLocation": "N_o_n_e", "jobTitle": "Data Engineering Internship/Co-Op", "companyRating": null, "companyInfo": {"Website": "www.tesla.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 2003", "Type": " Company - Public (TSLA) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Audi, BMW, Mercedes-Benz International"}, "estimatedSalary": null, "jobDescription": "Data Engineering Internship/Co-OpThe Role Data is deeply embedded in the product and engineering culture at Tesla. We rely on data and lots of it to improve Autopilot, to optimize hardware designs, to proactively detect faults, and to optimize load on the electrical grid. We collect data from each of our cars, superchargers, and stationary batteries and use it to make these products better and our customers safer.  Your application to the Data Engineering Internship will be considered for all opportunities across Autopilot, Connected Systems, and Service Engineering. Required SkillsStrong programming experience in at least one of the following languages: Java, Golang, or Python.Experience with message queues like Apache, Kafka.Experience with big data frameworks such as Hadoop/Spark.Experience with front end development in areas such as HTML, Javascript, CSS, and/or UI.Experience building hybrid infrastructures and working with electromechanical systems.Experience with driving the adoption of data platforms.High standards for code quality, maintainability, testing and performance.Work with a cross-functional team of hardware engineers, application/UI software engineers, QA/Validation and designers.QualificationsCurrently working towards a BS, MS, or advanced degree in a relevant engineering program.You must be self-managed and committed to working in a fast-paced environment.Hands-on experience is a must.Professional and positive communication skills.Previous internship and/or project experience is a plus.Ability to relocate for the duration of your internship.This role is available across various Tesla locations, including headquarters in Palo Alto, CA, the factory in Fremont, CA, and Gigafactory 1 in Sparks, NV – must be able to relocate for the duration of your internship.Apply"}