{"jobID": "2747353350", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Governance Analyst - DC and Supply Chain Data", "companyRating": "3.0", "companyInfo": {"Website": "www.hdsupply.com", "Headquarters": "Atlanta, GA", "Size": "10000+ employees", "Founded": " 2007", "Type": " Company - Public (HDS) ", "Industry": " Construction, Repair & Maintenance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " HD Supply (NASDAQ:HDS) (www.hdsupply.com) is one of the largest industrial distributors in North America. The company provides a broad range of products and value-add services to approximately 500,000 customers with leadership positions in maintenance, repair and operations and specialty construction sectors. Through approximately 260 locations across 36 states and six Canadian provinces, the company's approximately 11,000 associates provide localized, customer-driven services including jobsite delivery, will call or direct-ship options, diversified logistics and innovative solutions that contribute to its customers' success. With an active commitment to the communities in which we operate, HD Supply associates are part of a thriving organization that supports the virtues of wellness, diversity and inclusion – all of which are top priorities for the company. Equally as important is empowering our associates to grow professionally while providing competitive benefits and compensation. If you’re ready to find a rewarding career and achieve your full potential with a growing industry leader, HD Supply is ready for you! Job Summary Responsible for implementing the day-to-day needs of the data governance and data quality program. Participate in recommending and implementing policies and procedures for data governance approved by the Data Governance council and Data Governance team. Identify data quality opportunities and drive compliance with data governance and quality initiatives. Ensure data governance opportunities are identified and addressed throughout the project life cycle. Major Tasks, Responsibilities and Key AccountabilitiesParticipates in the execution and implementation of approved data definitions, policies, standards, process data access, and dashboard statistics.Supports requests to change configurations, use, or design of data elements for specific area of influence. Conducts testing and user acceptance of new system functionality.Analyzes and identifies data sources, data, redundancy, and implements processes to remediate data issues and /or data clean-up efforts.Supports governance principles, policies, and stewardship within the business.Assists in the development and distribution of data quality dashboard.Scopes, resources, and manages data quality initiatives.Participates in the review of all system enhancements and new technologies for data needs, use, and redundancies.Nature and ScopeDemonstrates skill in data analysis techniques by resolving missing/incomplete information, inconsistencies/anomalies in more complex research/data.Nature of work requires increasing independence; receives guidance only on unusual complex problems or issues. Work review typically involves periodic review of output by supervisor and/or direct \"customers\" of the process.May provide general guidance/direction to or train junior level support personnel or professional personnel.Work EnvironmentFrequent periods are spent standing or sitting in the same location with some opportunity to move about. Occasionally there may be a requirement to stoop or lift light material or equipment (typically less than 8 pounds).Located in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable.Typically requires overnight travel less than 10% of the time.Education and ExperienceTypically requires BS/BA in related discipline. Generally 2-5 years of experience in related field; certification is required in some areas OR MS/MA and generally 2-4 years of experience in related field. Certification is required in some areas.Preferred Qualifications Join our Data Governance Team of experts! In this role, you will spent most of your time in one of the largest distribution centers in the LA, City of Industry, CA location. You will spend your time working with Master Data, assessing and recommending process improvement, and collaborating and supporting various internal customers with reports. This is a new position within our team. You will build out and document processes that help us to continue to deliver First Choice Customer Service! Bachelor's degree in Business or similar field.Experience with distribution, manufacturing processes is required.Previous work interfacing with Data Management teams on data accuracy, data correction, issue identification, corrective actions.In-depth data analysis, reporting to various utilizing MS Excel and MS Access.Experience capturing requirements, recommending, planning for and monitoring data cleansing activities.Solid written and verbal communication skills.This position will be based in a multi-shift distribution environment.This position will require overnight travel approximately 10% of the time.PRID108"}