{"jobID": "2825811340", "jobLocation": "Chicago_IL", "jobTitle": "Data Product Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.hyatt.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1957", "Type": " Company - Public (H) ", "Industry": " Travel & Tourism", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Marriott International, Hilton, Starwood Hotels & Resorts"}, "estimatedSalary": "84000", "jobDescription": " **Description:**  *Summary*The Data Product Manager will join a team that is on an upward trajectory to enhance Hyatt's competitive advantage through analytics. This position will contribute to our strategic vision of developing advanced analytics capabilities in support of developing and executing business strategy.  As an ideal candidate ?you are obsessed with data. You have natural curiosity and desire to build data products that can improve guest experience and revenue at our hotels. You are focused on execution and getting things done even in situations with high level of ambiguity. You are an excellent communicator and collaborator and are able to work with a diverse group, get consensus, and drive the product forward. You have an entrepreneurial mind and thrive in a agile environment. You have a passion for using technology to solve problems in a user-centric way. You should have experience taking at least one product from conception to launch. This position reports to the Director, Analytics and Business Intelligence  *Responsibilities*  * Proactively work with business units and teams to understand and translate data-driven initiatives and potential ideas into fully developed data products and services  * Create, manage, communicate & present data analytics strategy, vision and roadmap  * Synthesize ideas and suggestions from stakeholders and users to determine what to build based on business priorities, strategy and vision  * Advise business units on how to leverage our existing enterprise wide analytics technologies, platforms and data assets in the most effective and efficient manner  * Work alongside Data Scientists, analysts and data engineers to develop data products and services  * Demonstrate a commitment to Hyatt core values.  * The position responsibilities outlined above are in no way to be construed as all encompassing. Other duties, responsibilities, and qualifications may be required and/or assigned as necessary **Qualifications:**  *Experience*  * 6-10 years of experience in a large organization with responsibility and demonstrated success for developing Data and Analytics products or services  * Excellent communication skills and can confidently communicate to all levels of the business from operational to executive  * Experience in working with cross-functional teams to develop data products and services. Proven ability to build cross functional relationships  * Experience with all things data ? exploration, analysis, blending and identification/mitigation of data quality issues  * Ability to dig into the fine details of projects but also articulate product strategy and vision at higher level  * Experience in working with mobile , web and transactional systems  * Experience with user-centric research and design programs.  * Experience with Scrum and working in an agile environment.  * Familiarity with hospitality or travel industry is a plus.  * Technology start-up experience, where the need to innovate and execute fast was imperative for success, is a plus.  *Education*  * BS degree, preferably in Computer Science, Information Systems or a related discipline or equivalent combination of education and experience. MS degree is plus  *Computer Skills Needed to Perform this Job*  * One or more years programming in SQL, R and/or Python.  * Experience with R and/or Python is strongly desired  * Experience with Alteryx or similar analytics tool is preferred  * Experience with Tableau, D3 or other data visualization tools is desired  * Familiarity with various database technologies?Graph, OLAP, Relational, etc.  * Experience with Microsoft Office suite, especially Word, Excel and Powerpoint.**Primary Location:** US-IL-Chicago **Organization:** Hyatt Corporate Office **Pay Basis:** Yearly **Job Level:** Full-time **Job:** Technology **Req ID:** CHI009035"}