{"jobID": "2813478586", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst III", "companyRating": "3.8", "companyInfo": {"Website": "www.team.co.in", "Headquarters": "Chennai, India", "Size": "201 to 500 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " This Business Analyst position will work in the Defense Health Medical Systems (DHMS) sector of Department of Defense. This is a five year contract that requires an active government security clearance.  Data Analyst III  Position Description: Provide consulting support to an Acquisition Category (ACAT) I Major Automated Information System (MAIS) program for a Department of Defense (DoD) operational medicine Electronic Health Record (EHR) system. This position will work on a government client site in Arlington, Virginia. Interprets results using a variety of techniques, ranging from simple data aggregation via statistical analysis to complex data mining independently on DoD systems. Designs, develops, implements and maintains business solutions. Works with DoD client and project leaders to identify analytical requirements. Skilled at using Microsoft Access and Microsoft Excel. Requires a bachelor's degree or equivalent in area of specialty and at least 5 years of experience in the field or in a related area. Familiar with a variety of the field's concepts, practices, and procedures. Relies on extensive experience and judgment to plan and accomplish goals. Performs a variety of tasks. May lead and direct the work of others. A wide degree of creativity and latitude is expected. Typically reports to a manager or head of a unit/department. Additional roles and responsibilities: Serve as the offices Sharepoint SME, administrator and Knowledge Champion (KC) for the JOMIS PMO, Business Operations and Acquisition Knowledge Manager. Deep administrative access over the JOMIS page, including manipulation of local metadata and page views, and user permissions management.  Sets up SharePoint Virtual Collaboration System (VCS) document management plan for functional teams within the office based on Government preferences/needs. Coordinate new requirements, approve through program KC, and communicate to VCS team, PEO Tools Team, and PEO Configuration Change Board as needed.  Responsible for site/workspace governance and permissions management, working with Government KC to obtain VCS access/rights approval for new hires and/or reassigned team members.  Monitor VCS site to ensure team members are using the tool and in compliance with the agreed upon implementation plan. Work with team members to troubleshoot and resolve VCS issues.  The Program is growing in metrics and analytics capability. We are looking for people with familiarity and ideally experience with analytics tools such as Tableau and Power Builder. Required Qualifications: Citizenship- US Citizen with the ability to obtain a DoD Public Trust or Secret clearance  Education Bachelors degree  Experience 5 + years"}