{"jobID": "2804619895", "jobLocation": "Lubbock_TX", "jobTitle": "GIS Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ci.lubbock.tx.us", "Headquarters": "Lubbock, TX", "Size": "1001 to 5000 employees", "Founded": " 1909", "Type": " Government", "Industry": " Government", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " SummaryCollects or receives geographic data and transfers data into GIS databases. Under supervision, perform updates and maintenance on GIS databases. Use other business computer software applications as needed to maintain and compile data and to prepare reports.Essential Functions Creates and maintains geospatial and tabular datasets. These may include: parcels, addresses, electric utility, street centerline, zoning, public works engineering, pavement management, emergency operations, public safety, stormwater billing, traffic, or other department data as assigned; Oversees the quality of work performed and submitted by the draftsmen for engineered plans, and mark corrections as needed. Assigns projects to the draftsmen according to priority and work load; Imports GIS data from other sources, converts GIS data from one coordinate system to another, creates other data formats from existing data, and scans, rectifies, and utilizes images to validate datasets; Organizes individual workflow and processes, project tracking, printing maps, and general administrative duties; Creates maps for different departments as requested; Perform related duties as required. QualificationsCompletion of two years college coursework in engineering, GIS, planning, architecture, computer aided drafting, computer applications or a related field with an additional two years of related GIS, planning, architecture, computer applications or related experience; or any combination of relevant education and experience, such as completion of a bachelor's degree in geography or related field, that provides the following knowledge and abilities:  Training in Esri ArcGIS is required.Knowledge and Abilities Knowledge of:The fundamental principles of geographic information systems, mapping, and database software, including spatial and attribute data; Advanced knowledge of Esri ArcGIS, Word, Access, Excel, PowerPoint, and photo manipulation software.Ability to:Perform spatial analysis and representation of data in maps; Independently create databases for new data including assigning attributes and determining geometry type; Determine data attributes for new incoming data and determine data lay-out; Import GIS data from other sources; Edit and maintain existing GIS data; Create other data formats (shape files, etc.) from existing data; Identify and execute specific queries in response to analysis of a problem; Create Access databases; Develop quality control activities; Design major map projects of sets for analysis.Physical RequirementsContinuously lift and carry up to 10 pounds; Occasionally lift and carry up to 25 pounds; Frequently stand and walk during the shift; Occasionally climb stairs and other inclined surfaces; Occasionally bend and kneel during the shift; Push and pull objects; Frequently flex upper trunk forward at the waist and partially at the knees; Occasionally rotate upper trunk to the left or right while sitting or standing; Place arm above, at or below shoulder height; Coordinate eye, hand and foot movement in order to operate a vehicle."}