{"jobID": "2812827924", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Engineer", "companyRating": "3.6", "companyInfo": {"Website": "www.chase.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": "The MIS Data Engineering team is responsible for designing and developing the enterprise database architecture, data warehouse, and reports on the WMIS space in AM. Our primary focus includes data lakes, automated data analysis, DevOps, and continuous integration of data visualization as well as reporting software. Individuals on this team are self-driven, excited to learn new technologies, and interested in solving challenging problems. The main role will be to use different types of data gathered from our existing financial technologies to generate reports and test existing/PoC software to diagnose different failures in addition to measuring success. We work with cross-functional teams of software engineers, QA/Validation, designers, and infrastructure technicians. With the recent adoption of a data lake, this composition may change to be dominated by Hive (SQL on Hadoop), Shell/ Python scripts, and a Scala programs. On this team we act as responsible engineers for assigned products. Maintain highest standards of excellence, never settling for the status quo and dive deep into clients' issues and find efficient solutions. Skills: •High degree of accuracy along with attention to detail, excellent oral and written communication skills, strong interpersonal skills. •Partner with non-technical stakeholders to understand their analytical needs, help frame the problem by asking the right questions, document and prioritize requirements. Clearly communicate results of complex technical work. High standards for code quality, maintainability, testing, and performance. •Knowledge of SQL/ NoSQL (Hive) •Experience with UNIX Shell Scripting •Experience with Git version control •Proficiency in one (or more) of the following: ◦C/C ◦Java ◦Scala ◦Python •Experience with all aspects of the software development life cycle (SDLC) in a professional team environment including requirements collection, solution design, implementation, code reviews, testing and operational support •Large data analysis and visualization experience Preferred Background: •Strong understanding of/ experience with distributed, horizontally scalable systems such as Hadoop or Spark •Message queues such as Kafka •Experience with Qlik "}