{"jobID": "2831892137", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientist Data Visualization", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "102000", "jobDescription": "Job DescriptionPosition Overview/Description: The Visual Data Scientist & Data Analyst positions discover and curate new and existing data sources to create solutions for the business. These key positions help bring data to life to solve business problems. At times, the problem is identified by a business unit, frequently wishing to optimize cost, revenue, or improve quality, and at times problems are formulated by the Data Scientists. Solutions are then envisioned that harness internal and external data and (in the case of the Visualization side) through advanced visualizations, provide the ability for users to answer their key questions.  Responsibilities: Supports all enterprise units including Business Units and Skill TeamsResponsible for creating new data visualizations, including:Problem formulation and design of solutionHarvesting of data from multiple systems globallyCollaborating with Analytics and IT teams to transforming the data for use in modeling and visualizationsDesigning visual interface for users to interact with the data; Building visualizationsIdentify relationships in data to assist in providing insightsEvaluation of data accuracy, completeness, timeliness and stability to establish repeatable, sustainable processes to maintainData visualization team will train and deployment of the new tools. Basic Qualifications: Bachelors degree1+ years of experience with one or more of the following tools: Data Gathering skills/tools (e.g. SQL, Hadoop, Teradata, SAS, Business Objects, etc.) OR Visualization skills/tools (e.g. QlikView, Tableau, WebFocus, etc.) Preferred Qualifications: Masters degree with a strong background in data scienceStrong collaboration and communications skillsStrong problem formulation and problem solving skillsExperience communicating findings to make data analysis actionable and understandable by business partnersAbility to take complex problems and break them down to create an implement an action planStrong understanding of analysis and computational complexity and ability to programmatically solve problemsStrong capabilities at designing visual interface for data interaction The distance between imagination and creation. It can be measured in years of innovation, or in moments of brilliance. When you join the Ford team discover all the benefits, rewards and development opportunities youd expect from a diverse global leader. Youll become part of a team that is already leading the way, with ingenious solutions and attainable products and it is always to go further.  Visa sponsorship may be available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status."}