{"jobID": "2276040442", "jobLocation": "Venice_CA", "jobTitle": "Data Engineer", "companyRating": "4.1", "companyInfo": {"Website": "www.system1.com", "Headquarters": "Venice, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "System1 is an organization centered around data and data products. We firmly believe data should inform and guide every quantitative decision process.We are building exciting new data products and a state-of-the-art data platform aimed at large scale data collection. At the same time, we are building novel approaches to analyze such data and extract knowledge from it in the form of machine learning algorithms. This enables our platform to optimize our users experience through product recommendations highly customized to individual preferences and interests.Our Data Platform team is pragmatic and focused on applying the best tools and development practices. Knowledge essential for this role includes RESTful APIs, relational database technologies like Postgres and MySQL, as well as Amazon AWS technologies like SQS, SNS, Lambda, Kinesis, and Redshift. Of great value is also interest in NoSQL frameworks like Dynamo, MapReduce, and Spark, as tools to address some of the scalability requirements of our platform.The engineering team as a whole, and the Data Platform team in particular, have an open culture and work in an agile style. The ideal candidate for this role will manifest a passion for distributed data platforms and scalable data architectures. In this role, you will be entrusted with the entire end-to-end engineering processes to manage rich datasets from tens of millions of visitors per month. We are looking for self-motivated, creative thinkers, and for people who are flexible and enjoy working as a team.The Role You Will Have Create, build, and maintain a coherent and performant data architecturePrototype, develop, deploy, and debug data ingestions and data management servicesParticipate in peer code reviews and produce high quality documentationConstruct queries and reports to guide architectural design, business decisions, and optimization algorithmsTake projects through the full engineering lifecycle: designing, ticketing, building, testing, deploying, and debugging tools and productsHelp grow a team and work with a tight knit group of engineers and data stakeholders What You Will Bring Bachelors in Computer Science or equivalent4-5+ years of experience with Python developmentWorking with large SQL datastores to answer business intelligence questions using PostgreSQL & RedshiftExperience with Linux, the bash shell, Docker, and AWS infrastructureWorking knowledge of web browsers, cookies, fingerprinting, and how these technologies fit in online advertisingExperience with SparkUnderstanding of NoSQL datastores like DynamoDB and RedisKnowledge of queueing systems like SQS and Kinesis FirehoseUnderstanding of how to build RESTful APIs What We Have to Offer Free Uber/Lyft to and from work every day!Collegial and collaborative team with highly intelligent and motivated coworkersCross-team lunches and demos to foster learningUnlimited Paid Sick Time, Competitive PTO and Benefits packageCatered meals and fully stocked kitchenWeekly happy hour at various bars, restaurants, and venues across Los AngelesWeekly fitness class with private trainer: high intensity training, yoga, beach volleyball, beach soccer, ultimate frisbeeCompetitive Relocation PackageCompany parties and outings: Skyzone indoor skydiving, Medieval Times, Karaoke, etc."}