{"jobID": "2799820530", "jobLocation": "Chicago_IL", "jobTitle": "Senior Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.exeloncorp.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (EXC) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ameren, PPL, Southern Company"}, "estimatedSalary": "86000", "jobDescription": "Description At Exelon, we've got a place for you Join the nation's leading competitive energy provider, with one of the largest electricity generation portfolios and retail customer bases in the country. You will be part of a family of companies that strives for the highest standards of power generation, competitive energy sales, and energy delivery. Our team of outstanding professionals is focused on performance, thought leadership, innovation, and the power of ideas that come from a diverse and inclusive workforce. Exelon will provide you the tools and resources you need to design, build and enhance a successful career. We are also dedicated to motivating the success of our employees through competitive base salary, incentives, and health and retirement benefits. Join Exelon and share your passion at a forward-thinking Fortune 150 company. Establish yourself in a place where you can truly shine and create a brighter, more sustainable tomorrow.  Join our Exelon Business Services Company (BSC) to be part of a diverse and inclusive team that provides best-in-class professional services and adds exceptional value to Exelon’s family of companies. We provide financial, human resource, legal, information technology, supply management, communications, and corporate governance services.  Energize your career at Exelon! Qualifications PRIMARY PURPOSE OF POSITION  Works closely with the Manager of Data Analytics and Automation to design and execute innovative analytic solutions to support the Exelon Audit Services (EAS) organizations’ industry leading analytics program. In this role, the individual will collaborate, lead projects and execute analytics projects with EAS, Exelon business and IT teams. Analytics projects are designed so that EAS teams deliver increased risk assurance through data-driven insights. This includes not only leveraging, but training, supporting, and leading others in the use of data analysis, data visualization, and statistical modeling technologies. Senior Data Analyst will use technologies such as SQL, SSIS, Power BI to provide ongoing assurance around key risks and processes. This position will also have responsibility for ad-hoc analytics to support Fraud Risk Assessments and management of EAS data analytics platform infrastructure.  PRIMARY DUTIES AND ACCOUNTABILITIES  Lead the planning and execution of analytics projects to support EAS engagements following the DARE Framework (i.e. Define, Assess, Report and Enable). Define - Gain an understanding of data profiles by collaborating with stakeholder(s) to identify potential data and analytics opportunities, collect and examine data, and leverage data and analytics to inform scope, objective, level of risk, and approach.Assess - Leverage data and analytics for an effective and efficient work plan while identifying potential data and analytics continuous monitoring opportunities for stakeholder(s)Report – Develop data visualization, audit insights and recommendations based on data analytics results.Enable – Identify opportunities to leverage and implement analytics solution and to empower the stakeholder(s) with data and analytics capabilities to increase efficiencies, and improve internal controls.Enable and continue building-up EAS team capabilities with analytics concepts and toolsTrain, support, and lead Analytics and Automation team in the use of data analysis, visualization, and statistical modeling technologies such as SQL, SSIS, Power BI.Manage, administer and maintain the EAS data analytics platform, in conjunction with BSC-IT InfrastructureOversight over tools and solutions leveraged by EAS and assisting in solving technology issues where appropriate. POSITION SPECIFICATIONS  Minimum:  LEVEL OF EDUCATION/CERTIFICATION/YEARS EXPERIENCE Bachelor’s degree required in Computer Science, Statistics, Mathematics (or with a similar technical or computational emphasis) or equivalent business experience5-8 years in compiling, analyzing and visualizing data TECHNICAL COMPETENCIES Strong analytical and problem-solving skillsStrong technical skills, including, strong proficiency in relational database query languages such as SQLProven ability to manage and conduct data analysis, extrapolate and integrate the data, draw conclusions, and provide clear, concise, actionable information.Proven ability to apply findings to both strategic and tactical business objectives and resilient in changing or uncertain situationsProven highly analytical and blends the application of business, strategic and design thinking with mathematics and technology to enable better decision making. ENABLING COMPETENCIES Strong oral and written communication skillsStrong project management and administration skillsHighly collaborativeAbility to translate data analysis and findings into coherent conclusions and actionable recommendations to executives. Ability to translate executive vision and guidance into methods and analytics.Ability and willingness to travel (20-25%) Preferred:  LEVEL OF EDUCATION/CERTIFICATION/ YEARS OF EXPERIENCE 2-3 years Internal or External audit experienceMaster’s Degree in Computer Science, Statistics, Mathematics or with a similar technical or computational emphasis TECHNICAL COMPETENCIES Proficient in analytic tools including but not limited to SQL, Database Design, ETL (SSIS), Power BI, Reporting Tools (Hyperion, OBIEE, Business Objects)Ability to demonstrate or bring portfolio of analytics performed by leveraging analytic tools during the interview POSITION SCOPE This individual will report directly to the Manager of Data Analytics and Automation. In addition to being a self-starter, this individual will work independently and with the management team to accomplish objectives. This individual will periodically interface with all levels of Exelon management and external auditors.This function provides valuable insight to determine data analytic strategies and direction for Exelon Integration of business and technical knowledge to address complex problems and non-standard situationsLevel and depth of supervisory duties - SomeBudget accountability, impact on asset management, and organization revenue - SomeNumber of direct reports (Span of Control) - NonLevel of independence, decision-making authority or strategic planning accountability - SomeInternal and external contact relationships - Extensive"}