{"jobID": "2817636388", "jobLocation": "Indio_CA", "jobTitle": "Medical Technologist - Clinical Laboratory Scientist - (Med Tech - MT - CLS)", "companyRating": null, "companyInfo": {"Website": "www.clubstaffing.com", "Headquarters": "Boca Raton, FL", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Subsidiary or Business Segment", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description & Requirements Medical Technologist - Clinical Laboratory Scientist - (Med Tech - MT - CLS)  StartDate: 07/16/2018Available Shifts: 8/10/12 D/E/N Pay Rate: $31.00 - 36.00 SHIFT: ROTATING Required Qualifications  HEP C Vaccination required. Completed a baccalaureate degree in a related science. Current and valid license for Clinical Laboratory Science issued by the State of California Department of Health2+ years of experience and 50 mile radius rule. Clinical Laboratory Scientists (CLS), perform with minimum supervision routine procedures and the most advanced procedures in at least one laboratory section or all of the routine and difficult procedures in all laboratory sections. CLS perform clinical analysis on human blood, various body fluids, and selected other specimens. The Clinical Lab Values obtained are used by physicians for diagnosis, therapeutic monitoring, and treatment of their patients. The testing is performed utilizing automated a semi-automated instruments as well as many manual tests requiring significant judgment and skill. The CLS must be able to calibrate instruments, perform required control procedures and ensure that patient results are only reported when systems are within prescribed control guidelines. In addition, CLS must possess the ability to troubleshoot instrumentation and to repair minor problems. A working knowledge of the Laboratory Information System, data entry, and verification procedures, is a necessity. Clinical Lab Scientists must be able to prioritize the workload and ensure that STAT test turnaround times are minimized and that critical values reach the physicians or nursing station, in a timely manner.  Preferred Qualifications  START DATE: 07/16/2018 for 8 weeks Facility Location Ideally situated within the Los Angeles metropolitan area, this region is home to world-class shopping, top-rate entertainment and easy access to the nearby mountains, lakes, desert and beach areas. With tree-lined boulevards, beautiful parklands and gardens, and a year-round mild climate, this region of Southern California is filled with an abundance of opportunities. Job Benefits Allied travel assignments are typically for 13 weeks and offer generous packages that include:  Competitive pay rates Medical, Dental, Vision 401(k) and Flex Spending Life Insurance Accident and Short-term Disability Coverage Free Continuing Education Free Private Housing Refer a friend and earn extra cash!About the Company Club Staffing, an AMN Healthcare company, is the leader in allied healthcare staffing, with thousands of travel positions available throughout the United States. We are dedicated to meeting the unique needs of each allied healthcare professional; whether it's travel, per diem, temp-to-perm, or permanent. We also offer more therapist, laboratory and medical imaging jobs in more places than other travel companies. AMN Healthcare is an EEO/AA/Disability/Protected Veteran Employer. We encourage minority and female applicants to apply.  medical technologist, clinical laboratory scientist, medical tech, clinical laboratory technologist, medical laboratory technologist, laboratory, clinical laboratory tech, allied, allied health"}