{"jobID": "2760422310", "jobLocation": "Oak_Park_MI", "jobTitle": "Leasing Sales Consultant", "companyRating": null, "companyInfo": {"Website": "www.villagegreen.com", "Headquarters": "Southfield, MI", "Size": "1001 to 5000 employees", "Founded": " 1919", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Greystar, Gables Residential, Bozzuto"}, "estimatedSalary": null, "jobDescription": " Village Green is searching for enthusiastic individuals to join our Sales Consultant team and be the first point of contact at our award-winning apartment communities. If you have persuasive sales and marketing skills, excellent communication and negotiating abilities, and are customer service oriented, this may be the perfect role for you! Responsibilities:In this sales role, you will quickly identify the needs of our prospective residents to help them find the perfect apartment home.You will be rewarded for your sales performance and have the opportunity to participate in an attractive commission program.You will develop long lasting relationships with our current residents and provide them with exceptional customer service.Required Skills Required ExperienceQualifications: This is a fast-paced professional environment where each day will be different. If you are comfortable working in a sales driven environment and are willing to go above and beyond to exceed our customer's expectations, this could be the perfect role for you!  Our ideal Sales Associate has 1-2 years of sales experience in a retail, hospitality, or multi-family environment. Proficient in Microsoft Office is ideal. Strong verbal and written communications skills is a must. Ability to work weekends is necessary. Undergraduate degree is strongly preferred. Join our team today!  We are an equal opportunity employer with a commitment to diversity. All individuals, regardless of personal characteristics, are encouraged to apply. Our locations are drug-free and pre-employment drug tests are required. Background checks are also required before employment begins.Job Location  Oak Park, US-MI "}