{"jobID": "2818600551", "jobLocation": "Sylmar_CA", "jobTitle": "Sr Scientist - Analytical Chemist (Sylmar, CA or Minnetoka, MN)", "companyRating": null, "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Abbott Park, IL", "Size": "10000+ employees", "Founded": " 1888", "Type": " Company - Public (ABT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. JOB DESCRIPTION: Description  This individual will support the development, validation and transfer of analytical test methods to commercial manufacturing sites, contribute to regulatory submissions and submission responses for new products or product changes and provide troubleshooting/continuous improvement support to commercial testing laboratories. Key Responsibilities Include:Develop, validate, transfer and troubleshoot analytical methods, including API, raw materials, in-process and finished drug product; author, review and verify validation and transfer protocols and reports (Must have in-depth knowledge and extensive hands-on experience with method development for HPLC, GC and LC-MS)Support process development team with high-throughput analytical testing.Interpret analytical data, recommend specifications and methods for process or product characterizationAnticipate, recognize and resolve complex technical issues through job knowledge, use of technical resources including technical literature and experts and well formulated, logical experimentation.Advance the technical capabilities of the department by evaluating, recommending and implementing new technologies to meet business needs.Serve as the analytical representative and/or lead cross functional project teams; actively participate in team efforts and contribute to technical evaluations and solutions.Author quality and regulatory test method documentsWrite/co-author Regulatory Submissions sections of the CMC for IDEs and PMAs),memos and scientific reports in support of Regulatory Submissions and support quality control and manufacturing documentsManage analytical projects.Establish schedules, define dependencies and project plans, perform technical and quality risk assessments and direct activities of other scientists as well as provide training and development for others.Present project results and recommendations to senior managementProvide guidance (scientific and administrative) for junior analytical scientists.Serve as a liaison between functional groups and external customers for analytical development, transfer, troubleshooting and improvement efforts.Proactively and cooperatively communicate with peers and management to ensure awareness of progress and issues; recommend solutions when issues ariseMaintain and meet the highest standards in quality and regulatory compliance.Follow, understand and comply with AV SOP's and policies on cGMP's and safety.Essential Functions:. Must have in-depth knowledge and extensive hands-on experience with method development for HPLC, GC and LC-MS. Must have extensive experience with method validation and transfers for analytical methods according to current regulatory guidelines.. Internal/external authority for technical issues.Evaluates and defines function activities for projects and determines appropriate timeline; coordinates activities with functional resources; keeps functional activities on scheduleDemonstrates expertise in different analytical techniques, theory, application, troubleshooting, etc. Advanced knowledge of area of analytical chemistry is required. Applies advanced principles, theories, and concepts in area of specialty. May contribute to the development of new concepts, practices and standards.. Directly or indirectly supervises/mentors others; delegates activities appropriately.Demonstrates excellent verbal and written communication skills.Develops alternatives and solutions for a range of complex problems. Solutions require creativity, critical thinking, and collaboration, considering a broad range of potential impacts, including those that are downstream..Extensive experience in preparing regulatory submissions.QualificationsBasic:B.S., M.S., PhD in Analytical Chemistry and experience in Analytical R&D;, technical support or QC operations.B.S. in science or related field with 6+ years relevant experience ORM.S. in Science or related Field with 4+ years relevant experience preferred ORPh.D. in science ore related field; 2+ years post-graduate and/or industrial experience preferred.Preferred:Proficiency in standard office software and wide analytical experience in test method development, validation, transfer and troubleshooting, including gas and liquid chromatography, wet chemistry, spectroscopy and physical property testing.A working knowledge of Empower and Electronic Laboratory Notebook (ELN) is highly desirable.Is knowledgeable of cGLP requirements and ICH guidelinesHas exceptional problem solving and organizational skillsExcellent communication (oral and written) and interpersonal skills; ability to work well with a wide range of functional groups including R&D;, QC, QA, Regulatory Affairs, and Commercial OperationsCan function both independently and as a team playerMust be adaptable and able to operate effectively in a highly dynamic environmentNO RELOCATION ASSISTANCE IS AVAILABLE FOR THIS POSITION. JOB FAMILY:Product Development  DIVISION:CAHF Cardiac Arrhythmias&Heart; Failure  LOCATION:United States>Sylmar : 15900 Valley View Court  ADDITIONAL LOCATIONS:United States>Minnesota : 14901 Minnetonka Industrial Road  WORK SHIFT:Standard  TRAVEL:Yes, 10 % of the Time  MEDICAL SURVEILLANCE:Yes  SIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Continuous standing for prolonged periods (more than 2 consecutive hours in an 8 hour day)  Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.  EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf  EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}