{"jobID": "2619433386", "jobLocation": "Granada_Hills_CA", "jobTitle": "Direct Care Staff", "companyRating": "3.7", "companyInfo": {"Website": "www.sailsgroup.com", "Headquarters": "Vista, CA", "Size": "Unknown", "Founded": " 1996", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "11", "jobDescription": "SAILS Los Angeles Inc. (Supported And Independent Living Services) Founded in 1996, provides a continuum of behavioral support services to children and adults with specials needs/developmental disabilities. SAILS Los Angeles administrates Behavioral Day Programs and Community-based Residential Care Facilities throughout Los Angeles and Ventura Counties. Job Description and Duties: Every person benefits from the support of others, and we look for very special people to support individuals with disabilities. Care for essential needs of residents, including meal preparation, recreational programming, community access, and activity participation.Implementation of all Behavior Support and Skill Program Plans as written, maintain client records, data tracking and documentation as required.Provide physical assistance to clients as needed to follow through on Behavioral Intervention and Care Plans, including emergency interventions as instructed in Crisis Prevention Intervention.Supervise and participate in program activities with individuals and groups.Attend staff meetings and clinical trainings.Drive clients to and from programs, schools and appointments as needed (mileage reimbursed).Support therapeutic and behavioral plans in partnership with clinical staff to enhance the quality of life for those we support.Job Qualifications : Must be at least 18 years of age.Possess High School Diploma or equivalentHold a valid California Driver's License in good standing; with insuranceApplicant must be certified in First Aid and CPR before first day of employmentMust pass DOJ fingerprint clearance and background checkBi-Lingual is a plusShifts Available: Afternoons and Evenings, Overnights, and Weekends Schedule: Part-time or Full-time Locations: Woodland Hills, Granada Hills, West Hills, Simi Valley, Thousand Oaks, Ventura  Job Type: Full-time  Salary: $12.00 to $14.50 /year"}