{"jobID": "2837758748", "jobLocation": "Chicago_IL", "jobTitle": "Software Engineer - Virtual Assistant Data Analyst", "companyRating": "3.7", "companyInfo": {"Website": "www.jpmorgan.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 1799", "Type": " Company - Public (JPM) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": "As a member of our Software Engineering Group you will dive head-first into creating innovative solutions that advance businesses and careers. Youll join an inspiring and curious team of technologists dedicated to improving the design, analytics, development, coding, testing and application programming that goes into creating high quality software and new products. Youll be tasked with keeping the team and other key stakeholders up to speed on the progress of whats being developed. Coming in with an understanding of the importance of end-to-end software development-such as Agile frameworks-is key. And best of all, youll be working with and sharing ideas, information and innovation with our global team of technologists from all over the world. This role requires a wide variety of strengths and capabilities, including: BS/BA degree or equivalent experienceAdvanced knowledge of application, data and infrastructure architecture disciplinesUnderstanding of architecture and design across all systemsWorking proficiency in developmental toolsetsAbility to collaborate with high-performing teams and individuals throughout the firm to accomplish common goalsProficiency in one or more general purpose programming languages: Java, SPSS, SASUnderstanding of software skills such as business analysis, development, maintenance and software improvementInterpret data, analyze results using statistical techniques and provide ongoing reportsDevelop and implement databases, data collection systems, data analytics and other strategies that optimize statistical efficiency and qualityAcquire data from primary or secondary data sources and maintain databases/data systemsIdentify, analyze, and interpret trends or patterns in complex data setsFilter and clean data by reviewing computer reports, printouts, and performance indicators to locate and correct code problemsWork with management to prioritize business and information needsLocate and define new process improvement opportunitiesWorking experience as a data analyst or business data analystTechnical experience regarding data models, database design development, data mining and segmentation techniquesKnowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, Javascript, or ETL frameworks)Knowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsOur Corporate & Investment Bank relies on innovators like you to build and maintain the technology that helps us safely service the worlds important corporations, governments and institutions. Youll develop solutions for a bank entrusted with holding $18 trillion of assets and $393 billion in deposits. CIB provides strategic advice, raises capital, manages risk, and extends liquidity in markets spanning over 100 countries around the world. When you work at JPMorgan Chase & Co., youre not just working at a global financial institution. Youre an integral part of one of the worlds biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world. At JPMorgan Chase & Co. we value the unique skills of every employee, and were building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If youre looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you. "}