{"jobID": "2778633384", "jobLocation": "Hollywood_CA", "jobTitle": "Data Intern", "companyRating": null, "companyInfo": {"Website": "www.livenationentertainment.com", "Headquarters": "Beverly Hills, CA", "Size": "10000+ employees", "Founded": " 2005", "Type": " Company - Public (LYV) ", "Industry": " Media", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " AEG, StubHub"}, "estimatedSalary": null, "jobDescription": "Job Summary:The Role:House of Blues Entertainment is looking for an intern to join our Touring Department for LNDNA (Live Nation’s Artist Development team) and One’s to Watch (Live Nation’s music discovery platform). Responsibilities:Research and develop data driven insights to inform artist recommendationsSupport team with ad hoc research and insights projects Track and regularly update venue and LNDNA artist trackersStay up to date with emerging artists, pop culture news, and trends in media/technologyQualifications:Proficiency with Excel and comfortable managing data setsHigh proficiency in written and verbal communicationsHigh proficiency in MS OfficeBusiness, Math, Economics or Statistics majors are preferredStudent (Undergraduate/Graduate) *must provide proof of academic credit for the duration of the internshipPassionate about Music and Artists!If the above description sounds like you and fits your background, apply online athttp://www.livenation.com/careers/index.html to join the Live Nation Entertainment team today! Applicants for employment in the U.S. must possess work authorization which does not require sponsorship by the employer for a visa. EQUAL EMPLOYMENT OPPORTUNITYLive Nation Entertainment strongly supports equal employment opportunity for all applicants regardless of race, color, religion, sex, gender identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, sexual orientation, genetic information, or any other characteristic protected by state or federal law. HIRING PRACTICESThe preceding job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities, and qualifications required of employees assigned to this job. Live Nation Entertainment recruitment policies are designed to place the most highly qualified persons available in a timely and efficient manner. Live Nation Entertainment may pursue all avenues available, including promotion from within, employee referrals, outside advertising, employment agencies, Internet recruiting, job fairs, college recruiting and search firms."}