{"jobID": "2796045299", "jobLocation": "Delano_CA", "jobTitle": "Data Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.wonderful.com", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " At the Wonderful Company, we believe in investing in California's South San Joaquin Valley communities where 4,000 of our employees and their families live. In California's Central Valley, where rates of chronic disease are disproportionately high and educational outcomes are consistently poor, we are developing extensive and innovative wellness and education programs.  Wonderful Education strives to provide the youth in the South San Joaquin Valley communities with experiences and opportunities -- from preschool through college graduation -- that lead to a promising future. Wonderful Health & Wellness is creating a sustainable culture of physical and emotional well-being through an enhanced primary care model that integrates medical, behavioral health and social services; our goal is to ensure that healthy choices are an integral part of our employees' everyday lives at home, at work, and within the communities in which they live.  The Wonderful Company is seeking a Data Analyst to provide leadership in analytics, reporting, and business intelligence capabilities to enable \"data-driven\" decision making for furthering Wonderful Education's mission: to build strong pathways to prosperity for the children and young adults in the Central Valley, where we farm and process our consumer products. This position requires a hungry and driven, early-career leader looking for the next step in their career.  The ideal qualified candidate will lead development, implementation, and oversight of collection of data as well as analysis and reporting of metrics, key indicators, and results across our various Wonderful Education programs, to drive performance, accelerate positive student outcomes, and maximize impact. This role will also assist the Director of Strategy in developing dashboards, insights, presentations, and strategic initiatives. This position is located in Central Valley, California and will require occasional travel throughout the Central Valley and to our Los Angeles company headquarters on our corporate jet. Here's what you'll do:Manage, gather, report and analyze all student participation and performance data related to Wonderful Education's programs to increase operational efficiency and accelerate student outcomesGatekeep student data to ensure accuracy, completeness, and database integrityResearch comparative statistics and data as neededProvide data, analysis, and insights for speeches, presentations, collateral, marketing, and leadership initiativesDevelop and implement program dashboards to present data through charts, graphs, maps, and infographics to facilitate decision making and achievement tracking for Wonderful Education programsWork with the Wonderful Education programs team on executing company and group initiatives, assisting with change management, tracking key performance indicatorsAssume and execute additional responsibilities as assignedCentral Valley, CA based and open to 20-30% regional travel per weekReports to Director of Strategy, Wonderful EducationA little bit about your work-style:Adheres to a culture of professionalism, operational excellence and drive for resultsDemonstrates independence by driving projects with limited oversight, anticipating next steps, and leverages strong business judgementPrioritizes changing demands, multi-tasks, and meets deadlines in a dynamic environmentCommunicates effectively and has strong attention to detail Here's what you'll bring to the table: Bachelor's degree required with preferred concentration in business, information technology, data science, analytics, or engineeringMinimum two years of experience with data analysis, reporting, and/or project managementExperience in education and academic student data a plusMBA desirableOutstanding Microsoft Excel skills and experience with business intelligence toolsAbility to work under pressure in a dynamic environment with little directionStrong project management skills, having managed and successfully completed diverse projectsSuperior cross-functional collaborator with the ability to build relationships within an organizationStrong analytical and quantitative skills as well as attention to detailDemonstrated experience working with geographically dispersed teamsExcellent communication, analytic and problem-solving skills; sound business acumen and strategic thinking The Wonderful Company gives approximately $10-$15 million annually to educational programs throughout California's Central Valley. We invest in preschools, a K-12 charter school, Agriculture Career Prep programs, college scholarships, school grants, arts education, summer camps, and parent training. We have a track record of organic and acquisition growth resulting in phenomenal performance.  Here's what we'll bring to the table: Competitive benefits package including Medical (including 24/7 online access to a physician), Vision, Dental, and 401k with match eligibilitySubsidized gym membershipWonderful Giving (www.wonderfulgiving.com) -- allowing you to donate company money to a cause of your choice Headquartered in Los Angeles, The Wonderful Company is a privately held $4 billion global company dedicated to harvesting health and happiness around the world through its iconic consumer brands. The company's 9,000 employees worldwide are dedicated to bringing consumers everywhere the freshest, most wholesome pistachios, almonds, citrus and pomegranates; bottling the finest water and wines; and creating colorful bouquets that are sure to touch the heart. This commitment is reflected in the company's market share: Wonderful Pistachios is America's No. 1 tree nut brand and one of the top-selling salty snacks; Wonderful Halos is the No. 1 mandarin orange in America; POM Wonderful is the No. 1 100% pomegranate brand in America; FIJI Water is America's No. 1 premium bottled water brand; Teleflora is the No. 1 floral delivery service through local florists; and JUSTIN Wine has the No. 1  Cabernet Sauvignon in California. A 2016 Nielsen study evaluating the familiarity, quality, and momentum of more than 2,500 leading brands revealed that Wonderful Company products dominated the top 10 lists of consumers across all generations, more than any other consumer goods company.  The Wonderful Company's connection to consumers has health at its heart and giving back in its DNA. The company has a long-standing commitment to corporate social responsibility, including more than $120 million invested in environmental technologies and sustainability research, $45 million in charitable giving and education initiatives every year, $30 million toward the construction of a new charter school campus in California's Central Valley, and innovative health and wellness programs, including two new, free primary care clinics for employees and their dependents.  To learn more about The Wonderful Company, its products and core values, visit www.wonderful.com, or follow us on Facebook, Twitter and Instagram.  The Wonderful Company is an Equal Opportunity Employer and with opportunities for advancement. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories.  Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}