{"jobID": "2661384726", "jobLocation": "Washington_DC", "jobTitle": "Computer Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.af.mil", "Headquarters": "Washington, DC", "Size": "10000+ employees", "Founded": " 1947", "Type": " Government", "Industry": " Government", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Duties Help  Duties  Summary The mission of the United States Air Force is to fly, fight and win...in air, space and cyberspace. To achieve that mission, the Air Force has a vision of Global Vigilance, Reach and Power. That vision orbits around three core competencies: Developing Airmen, Technology-to-Warfighting and Integrating Operations. Core competencies and distinctive capabilities are based on a shared commitment to three core values -- integrity first, service before self, and excellence in all we do.  These positions are being filled under Expedited Hiring Authority (EHA) for Defense Acquisition Workforce Positions and Health Care Occupations. The Secretary of the Air Force has delegated authority by the Office Of the Secretary of Defense to directly appoint individuals to select defense acquisition workforce positions, or 'EHA Acquisition,' pursuant to the Defense Acquisition Workforce Improvement Act (DAWIA) and certain health care occupations, or 'EHA Medical.' Positions are located Air Force-Wide. Positions may be filled as permanent or term with a full-time or part-time work schedule. Pay will vary by geographic location. This is a Direct Hire Public Notice, under this recruitment procedure applications will be accepted for each location/ installation identified in this Public Notice and selections are made for vacancies as they occur. There may or may not be actual/projected vacancies at the time you submit your application. This Public Notice is to gather applications which may or may not result in a referral or selection.This Public Notice may be used to fill positions in other equivalent pay systems (i.e., NH, NJ, NK).Please read this Public Notice in its entirety prior to submitting your application for consideration.Learn more about this agencyResponsibilities Serve as a computer scientist and technical consultant for work involving both application and development of mathematical, statistical and computer-simulated models and applications Applies mathematical and software engineering principles and disciples to the building of software systems.Perform various duties concerned with the application of, or research into, computer science methods and techniques to store, manipulate, transform or present information. This work requires professional competence in the application of the theoretical foundations of computer science, including computer system architecture, system software organization and the modeling of the representation and transformation of information structure. You must also possess specialized knowledge of the design characteristics, limitations, and potential applications of information systems, and of broad areas of applications of computing which have common structures, processes, and techniques.Performs significant software engineering program management duties related to the System Engineering Process (SEP) which supports complex, often highly specialized, state-of-the-art software systems.Attends meetings, conferences, briefing, and seminars related to project planning, advanced technologies, and supporting system concepts. Accomplishes professional development and maintains technical proficiency through interaction with technical and professional societies, associations, academia, symposia, contractors, and research & development (R&D;) organizations, by reading/reviewing technical journals and current literature, and participation in formal training programs. Travel RequiredOccasional travel - You may be expected to travel for this position. Supervisory statusNo Promotion Potential15 Who May Apply  This job is open to…  This public notice is to gather applications that may or may not result in a referral or selection.Questions? This job is open to 1 group. Job family (Series)1550 Computer Science Similar jobs  Computer And Information Research Scientists Computer Research Scientists Information Research Scientists Scientists, Computer Research Scientists, Information Research Requirements Help  Requirements  Conditions of Employment U.S. Citizenship is requiredMales must be registered for Selective Service, see www.sss.govTotal salary varies depending on location of positionPCS expenses if authorized will be paid IAW JTR and Air Force RegulationsRecruitment incentives may be authorizedThis posn is subject to provisions of the DoD Priority Placement ProgramADDITIONAL CONDITIONS OF EMPLOYMENT:Employee may be required to work other than normal duty hours, to include evenings, weekends and/or holidaysShift work and emergency overtime may be requiredEmployee must maintain current certificationsPosition may require an appropriate security clearance Position may be subject to random drug testing QualificationsBASIC REQUIREMENTS: Bachelor's degree in computer science or bachelor's degree with 30 semester hours in a combination of mathematics, statistics, and computer science. At least 15 of the 30 semester hours must have included any combination of statistics and mathematics that included differential and integral calculus. All academic degrees and course work must be from accredited or pre-accredited institutions. Meeting the basic requirements qualifies for GS-05 position. SPECIALIZED EXPERIENCE:"}