{"jobID": "2696083104", "jobLocation": "Folsom_CA", "jobTitle": "Applied Research Scientist Deep Learning Algorithm", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "97000", "jobDescription": "Job ID: JR0059092Job Category: EngineeringPrimary Location: Folsom, CA USOther Locations: US, California, Santa ClaraJob Type: Experienced HireApplied Research Scientist Deep Learning Algorithm Job Description We are looking for deep learning experts that will work closely with HW architects to design the next generation of highly efficient deep learning architectures. We need your expertise, curiosity and creativity to build new learning algorithms and network architectures that have state of the art classification accuracy. This is an opportunity to conduct applied research that will be combined with Intel's leading fab capabilities to create products that provide unprecedented leaps in performance and that will ship to billions of customers. You will also be collaborating with researchers across academia, top industrial research labs and Intel to stay abreast of the latest deep learning techniques and ensure that future Intel HW architecture is focused on accelerating the right algorithms. Ensures platform and its components have the best performance and power balance specifically focusing on graphics hardware components. Research and development of next generation platform designs to continually improve the performance. Conducts system analysis on proprietary and competition platforms, develops advanced hardware tuning and overclocking.Qualifications Required Skills and Experience:MS or PhD in CS, Artificial Intelligence or related field. 5+ years of experience in Machine Learning with at least 2 years focused on Deep Learning. A track record of improving upon state of the art deep learning techniques. Good understanding of CNNs, RNNs, reinforcement learning, supervised and unsupervised learning. Strong math background particularly in optimization theory and stochastic algorithms. Hands on experience with at least one of the following tools: Caffe, Torch, TensorFlow, Theano, or similar. Excellent written and verbal communication skills. Strong programming skills. Additional Preferred Skills and Experience: GPU architecture. Some HW design background. GPGPU programming and optimization. Power and Performance modelling knowledge is a plus. Knowledge of application areas such computer vision or language processing.Inside this Business GroupThe Platform Engineering Group (PEG) is responsible for the design, development, and production of system-on-a-chip (SoC) products that go into Intel’s next generation client and mobile platforms. PEG strives to lead the industry moving forward through product innovation and world class engineering. Other Locations US, California, Santa Clara Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status. Position of Trust. This role is a Position of Trust. Should you accept this position, you must consent to and pass an extended Background Investigation, which includes (subject to country law), extended education, SEC sanctions, and additional criminal and civil checks. For internals, this investigation may or may not be completed prior to starting the position. For additional questions, please contact your Talent Consultant."}