{"jobID": "2764783665", "jobLocation": "Vienna_VA", "jobTitle": "Senior Manager, Software Engineer (Data Science & Analyst Solutions)", "companyRating": "3.9", "companyInfo": {"Website": "www.capitalonecareers.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public (COF) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Wells Fargo, McKinsey & Company"}, "estimatedSalary": "131000", "jobDescription": " Towers Crescent (12066), United States of America, Vienna, Virginia  At Capital One, were building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.  Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.  Senior Manager, Software Engineer (Data Science & Analyst Solutions)  We are looking for a passionate technologist with a knack for delivery to lead, inspire and manage a team of talented engineers to build intuitive, cloud-based platforms to support our enterprise Data Scientist and Analyst community. This particular team will be focusing on how we deliver distributed computing capabilities (both CPU & GPU) for our users, leveraging technologies which include, but are not limited to, Spark, EMR, Java, Python, TensorFlow, and Docker On any given day, you will:Architect, Design and code full stack data products within our AWS environmentsWork directly with the Product Owner and end-users to constantly deliver products in a highly collaborative and agile environmentEnsure your team adheres to best practices for delivering high quality production code via unit test coverage, peer reviews, coding style standards, and documentationLead, inspire and grow your team of engineers to help them reach new heights in performanceBe an exemplar for what it means to have an inclusive, supportive and empowering team cultureWho You Are:Curious. You ask why, you explore, you're not afraid of challenging the status quoPassionate. You care about growing others and bringing them together around whats possible. Youve started Meetup groups or taught courses because you love enabling others.Communicator. You can communicate complex ideas clearly to both technical and non-technical audiences, your team knows their priorities and so does your manager.Do-er. You have a bias toward action, you try things, and you wear your failures as a badge of honorFearless. Big, undefined problems don't frighten you.Improver. You take pride in your work and have a high bar. You improve every piece of code you touchBasic Qualifications:Bachelors Degree or military experienceAt least 6 years of experience delivering custom software systems/platformsAt least 4 years of experience with either Java or PythonAt least 2 years of experience with SparkAt least 2 years of experience working with Amazon Web Services (AWS)Preferred Qualifications:8+ years experience delivering custom software systems/platforms3+ years experience managing and developing an engineering team3+ years experience with Unix/Linux systems & Unix Shell scripting2+ years experience working with Docker2+ years experience working with a container management solution (i.e. ECS, Kubernetes)2+ years experience with micro services architecture, design and implementation2+ years experience with RESTful web service framework2+ years experience working with automated DevOps systems At this time, Capital One will not sponsor a new applicant for employment authorization for this position."}