{"jobID": "2693060195", "jobLocation": "Whitehouse_TX", "jobTitle": "Scientist", "companyRating": "2.6", "companyInfo": {"Website": "www.intertek.com", "Headquarters": "London, United Kingdom", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public (ITRK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " UL"}, "estimatedSalary": "59000", "jobDescription": "Title Scientist  21-Mar-2018 Job DescriptionIntertek, a leading provide of ATIC (Assurance, Testing, Inspection and Certification) Services, is looking for a Scientist to join our Chemical & Pharmaceutical team in Whitehouse, NJ. CHEM/PHARMA This team serves the chemical and pharmaceutical industries with a diverse range of services, from chemical testing and consultancy to inspection, contract laboratory services, regulatory guidance and supply chain assurance. Essential Duties and Responsibilities · Excellent method development skills, can resolve complex problems, bring new information into the business, participates in or leads writing/publishing/presenting results at meetings, and demonstrates clear leadership in the laboratory/business  · Plans, performs and completes multiple projects simultaneously using ICP/OES and ICP/MS  · Can perform as well as oversee the development and validation of analytical methods  · Independently communicates problems with management and clients  · Assist with the evaluation and selection of instrumentation, equipment or software  · Assists with the design and execution of instrument and equipment  · validation/qualification requirements (IQ/OQ/PQ)  · Assists with project cost estimates  · Reviews analyses and documentation on completed projects  · Writes technical reports  · Troubleshoots problems and performs investigations when necessary  · Communicates with clients to address questions and provide project updates.  · Performs other duties or special projects as required or as assigned  · Demonstrates expertise with variety concepts, practices, procedures and regulations  · Primary job functions require a wide degree of creativity and judgement  · Relies on extensive experience and judgement to plan and accomplish goals  · Typically reports to a manager  · Leads and directs the work of others  · Responsible for completing performance reviews of staff  · Performs other duties or special projects as required or as assigned Knowledge, Skills and Abilities · Knowledge of analytical chemistry, demonstrated through  · BA/BS and/or MS Chemistry, Biology or related scientific degree  · 8-10 years of related industry experience in an analytical laboratory  · Knowledge of laboratory safety precautions and protocols for safe handling and the disposal of hazardous agents/reagents, chemicals and materials  · Organization, communication and analytical skills  · Ability to understand and effectively communicate technical and business information, both oral and written to others, including co-workers, supervisors, subordinates, clients, and vendors  · Intermediate mathematical skills, including: algebraic functions, statistics (mean, median, standard deviation, variance, probability), basic geometry (area, volume calculations), and scientific calculators  · Ability to define problems, collect data, establish facts, and draw valid conclusions  · Ability to work varied and extended hours/days, as business dictates About Intertek A career with Intertek means joining a global network of professionals dedicated to bringing quality and safety to life. Our vision is to become the world’s most trusted partner for Quality Assurance and we offer our employees the chance to make an impact with attractive growth opportunities in this industry on a global scale.  We offer a salary and benefit package competitively placed within the local market, including medical, dental, vision, life, disability, 401(k) with company match, tuition reimbursement and more.  We are an Equal Opportunity Employer and do not discriminate against applicants due to veterans status or on the basis of disability. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex or national origin.  Intertek is a drug-free workplace. As a condition of employment, all hires are required to pass a pre-employment drug test. Auto req ID14451BRCountry United States State or Province New Jersey City Whitehouse "}