{"jobID": "2820393788", "jobLocation": "Washington_DC", "jobTitle": "Scientist, Enterprise Data and Analytics", "companyRating": "3.5", "companyInfo": {"Website": "www.comcastcareers.com", "Headquarters": "Philadelphia, PA", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CMCSA) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " AT&T, Time Warner Cable, Verizon"}, "estimatedSalary": "52000", "jobDescription": " We are looking for both junior and senior engineers, and the ideal candidate will have experience working as a technical lead or junior team members in a start-up, industrial, government, or academic lab setting on computer vision, nlpand/or machine learning projects.  Applicants should have strong programming and software development skills, and be comfortable working in an interdisciplinary, team-oriented, applied research and engineering environment.Familiarity with Python, C++, Docker, GPU computing and knowledge of computer vision and machine learning frameworks such as OpenCV, TensorFlow, PyTorch, etc. and how to deploy them is highly desired. Experience with broadcast and process automation technologies would be a positive. Core Responsibilities:Develop, implements, refines and validates machine learning algorithms for products and applications.Designs and develops data pipelines consisting of data ingest, data validation, data cleaning, and data monitoring.Trains machine learning models, validates the accuracy of the machine learning models once trained, and deploys them into production.Researches, writes and edits documentation and technical requirements, including evaluation plans, confluence pages, white papers, presentations, test results, technical manuals, formal recommendations and reports. Contributes to the company by creating patents, APIs and other intellectual property.Tests and evaluates solutions presented to the Company by various internal and external partners and vendors. Completes case studies, testing and reporting.Designs proof of concept solutions and contributes to studies to support future product or application development.Collaborates with teams outside of immediate work group. Represents the work team in providing solutions to technical issues associated with assigned projects.Provides guidance and leadership to more junior engineers.Job Specification: Education Level: Master or PhD.  Field of Study: Computer Science, Electrical Engineering, Data Science with experience in one or more of the following areas: Multi-modal media Analysis, Computer Vision, Image/Audio Signal Processing, Deep Learning, Reinforcement Learning, or Data Science.  Years of Experience: Generally, requires 3-5 years related experience after Masters or recent PhD."}