{"jobID": "2766933853", "jobLocation": "Dearborn_MI", "jobTitle": "Technology Manager", "companyRating": "2.7", "companyInfo": {"Website": "www.aksteel.com", "Headquarters": "West Chester, OH", "Size": "5001 to 10000 employees", "Founded": " 1989", "Type": " Company - Public (AKS) ", "Industry": " Manufacturing", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " United States Steel, Nucor, ArcelorMittal USA"}, "estimatedSalary": "108000", "jobDescription": " Our Dearborn Works facility is seeking a Technology Manager. The Dearborn Works is located on a more than 350-acre site in southeast Michigan. Its carbon steel melting, casting, hot and cold rolling, and finishing operations are capable of producing 3.6 million net tons of hot rolled, 2.1 million net tons of cold rolled, 1.1 million net tons of galvanized and galvannealed sheet each year. Primary Responsibilities:Provide quality feedback to process through daily reports, periodic meetings, samples and verbal communication resulting in continuous improvement in product quality.Provide quality assurance by containment and dispositioning non-conforming material to insure product quality meets internal and external customer product and TS16949 requirements.Responsible for quality and productivity trends and integration of new systems.Identify and prioritize area in department which require improvement and see that assistance is enlisted from all necessary personnel.Perform any data analysis, process observation, inspection, problem solving, issuing of work instructions, or any other activities required to see that objective is reached.Monitor/audit processes to assure compliance to proper conditions and procedures.Assist with quality and environmental system activitiesCollaborate with Research to test/expand process capabilitiesWeekly contact with shift managers, section managers and department managers to resolve product quality issues.Daily contact with supplier representatives and support group engineers to coordinate process improvement and project completion.Interfaces with personnel from Quality Control, Engineering, other operating departments, customers, scheduling and upper management to discuss problem issues, check product quality, set standards, projects, audits, cost, quality and production issues and make presentations as the need arises.Qualifications:Bachelors degree in a technical field requiredFive years of steel industry experience required, must have a strong operations and/or technical background and maintenance abilitiesComputer proficiency including spreadsheets and knowledge of computer programmingStrong problem solving abilitiesStatistical knowledge/training preferred AK Steel is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity, genetic information, disability, military or protected veteran status. "}