{"jobID": "2792295293", "jobLocation": "Washington_DC", "jobTitle": "Postdoctoral Scientist - Glyco Science", "companyRating": null, "companyInfo": {"Website": "www.business.gwu.edu", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 1821", "Type": " College / University", "Industry": " Education", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The Department of Biochemistry and Molecular Medicine (BMM) strives to deliver the highest quality of professional education and training, and conduct cutting edge research in the areas of biochemistry, molecular genetics and genomics with a goal to better understand human disease. Additionally, the department continues to have a long and successful record in training undergraduate, master and graduate students at the George Washington University School of Medicine and Health Sciences.Our Research Programs span from cancer biology, hepatobiology, autism, vascular biology, and computational genomics. Unlocking the mysteries of biologic processes at the molecular and genomic level is the common thread connecting all research programs. The overall research in the department continues to connect modern biochemistry and genomic discoveries to translational medicine, leading to a unique multidisciplinary research program in biochemistry and molecular medicine. Find out more here: https://smhs.gwu.edu/biochemistry/A Post-Doctoral Scientist is needed to work under the direct supervision of Dr. Raja Mazumder on NIH project. Duties include:-Planning, performing and documenting creation of Knowledge bases-Collection, analysis, and critical interpretation of database/knowledgebase data.-Preparation of periodic progress reports and publications.-Submission of publications related to research-Creating project reports, presentation slides, and posters along with drafting publications with Dr. Mazumder and other key collaborators.-Coordination of the project with other team members and cooperation partners.-Maintenance and update of the datasets-Attending and sometimes planning weekly, bi-weekly, monthly and annual project meetings with collaborators and stakeholders. -Other duties as assigned. The omission of specific duties does not preclude the supervisor from assigning duties that are logically related to the position."}