{"jobID": "2799572691", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.dosh.cash", "Headquarters": "Austin, TX", "Size": "51 to 200 employees", "Founded": " 2016", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Dosh: The App That Pays As the fastest growing app that finds cash for consumers and helps businesses acquire and retain customers, Dosh is revolutionizing the way the world does cash back. Dosh users get cash back for booking hotels (on top of ultra-competitive rates), shopping, and dining out at more than 100,000 businesses, restaurants, and hotels nationwide. Using breakthrough technology to eliminate wasted advertising spend, Dosh puts that money back into the pockets of consumers and businesses. No cutting coupons. No scanning receipts. No hassle. Just cold, hard cash. Doshers can then transfer the cash directly into a bank account or PayPal, or donate to a charity.What you will do: The Data Analysts at Dosh live and breathe Dosh data. You will be knowledgeable about designing and developing insightful analysis to answer business questions. You will directly interface with the analytics/data science team to discover visualization methods to present advanced analytics data. You will build dashboards, reports, visualizations, algorithms, and tools to solve interesting business problems. You want this job if: 1) you are a highly analytical thinker who enjoys solving complex problems using expert programming and visualization skills, and 2) can identify problems in complex data, and 3) love working with people.Responsibilities: SQL Coding for reports, dashboards, and visualizations. Using your insights for stakeholders to improve their performance, and sometimes designing algorithms to decipher deeper why and how questions. Understanding your business stakeholders objectives, the metrics that are the most important to them, and how they measure their performance. Turning business requirements into technical requirements. Finding and understanding the correct data sources for a given analysis. Learning from, and sharing knowledge and skills with your teammates to grow Business Intelligences total impact to the organization.What you will bring: Requirements 3+ Years of SQL. Must have the ability to write complex, highly-optimized queries across large volumes of data 1+ years of solid Python or R programming skills to cleanse, manipulate, and present data, particularly using Pandas and Numpy for Python and the Tidyverse for R Experience with Tableau or equivalent to create impactful reports, visualizations, and interactive dashboards 3+ years of Industry experience in a report development, data analysis, and/or business analytics Excellent oral and written communication skills, and comfort presenting to everyone from entry-level employees to senior vice presidents Knowledge of ETL and data warehouse concepts and processes Ability to explain complicated or technical information in a simple way to non-technical audiences Sensitivity to clients' needs and able to develop warm client relationships Curiosity and passion about data, visualization, and solving problems Creativity to determine the best solution for a real-world problem with quantitative data Experience with reporting, descriptive statistics, probability, and cleaning big datasets Willingness to question the validity, accuracy of data and assumptions Enjoyment from collaborating with others in a team environment Eagerness to learn in a fast-paced environment Drive and self-reliance B.S. degree in math, statistics, computer science, or equivalent technical fieldDosh Employee Perks: The opportunity to join us on our mission to positively impact millions of people's lives financially A ground floor opportunity with the Dosh team The chance to work in a fast-paced start-up environment with experienced industry leaders Fun, driven, innovative and supportive co-workers who will push you to be your best Competitive compensation and benefits At Dosh, we celebrate and support all differences. Dosh is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex national origin, sexual orientation, age, citizenship, marital, disability & veteran status."}