{"jobID": "2827920847", "jobLocation": "Washington_DC", "jobTitle": "Principal Cyber Security Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.netcentrics.com", "Headquarters": "Herndon, VA", "Size": "201 to 500 employees", "Founded": " 1995", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "Job Description NetCentrics provides the Department of Defense, Department of Homeland Security and other federal agencies with leading IT services including IT Strategy, mission applications, infrastructure and platform services, cloud solutions, service delivery and cybersecurity.  NetCentrics is looking for an experienced Principal Cyber Security Data Analyst to support our team in Washington, DC. This position is open only to candidates with an active Secret security clearance and the ability to obtain a Top Secret Clearance. Specific duties include:Contribute extensively to the maturation of company cyber and data science capabilities aligned to market and corporate experienceAuthor and lead white papers as needed to address customer and/or industry issuesSupport the delivery teams in addressing customer data science issuesParticipate in the creation of technical demos, briefings, and oral presentations materialsDeliver technical thought leadership and SME data science value in customer interactionsIdentify areas with on-site staff, and consultants to author content for proposals that address the requirements, instructions and evaluation criteria set forth by government solicitations as neededParticipate in or Lead strategy meetings to aideCollaborate with subject matter experts to research and document technical proposal details and to create winning responses while learning first-hand how work is performedRequirements:Experience developing business in the Government market in the fields of information technology and cyber securityAbility to both work independently under minimal direction and function effectively as a member of a teamProven ability to communicate and implement new concepts quickly and write about complex subject matterExcellent communications skills both written and oral, with ability to construct systems architectures and technical solutions with internal key stakeholders as well as senior government officialsSuperior time management and organization skills, handling multiple simultaneous projects with stringent deadlinesAbility to work effectively with a diverse range of people with a variety of skills, experience, and personalitiesClearance: A current DoD Secret security clearance with the ability to pass / adjudicate at the Top Secret investigation levelEducation: Master's degree in Computer Science or similar discipline with an emphasis on Data Science; PhD is preferredCertifications: You must possess current DoD 8570 IAT Level III Certification or obtain within 6 Months of EmploymentYears of Experience: 15+ years of combined business and government contracting experience in the areas of Cyber solutions architecture, big-data analytics, deep learning initiatives, and implementing new approaches to data security and integrity.As a contingency to employment at NetCentrics, all candidates who are given offers must successfully pass a full background investigation including criminal history, education and employment verifications. In order to be considered for this position, you must apply directly through our careers site  NetCentrics is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law."}