{"jobID": "2469845472", "jobLocation": "Huntington_Beach_CA", "jobTitle": "Esthetician", "companyRating": null, "companyInfo": {"Website": "www.waxcenter.com", "Headquarters": "Hallandale Beach, FL", "Size": "1 to 50 employees", "Founded": " 2004", "Type": " Franchise", "Industry": " Consumer Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " LunchboxWax, Waxing the City, Hand and Stone Spa"}, "estimatedSalary": null, "jobDescription": "Wax Associate Job Description Description: As a Wax Associate you are responsible to uphold the Ultimate Wax Experience at all times. Your performance greatly affects a guest’s entire experience, so it’s important to always provide the highest-quality wax service while maintaining a cheerful and positive attitude. Job Duties:Following the EWC process with all guestsGreets guests in a professional and friendly manner upon check inProviding all waxing services to all EWC’s guestsMemorize and use the scripts and standard responses that pertain to the WSA positionFollow and adhere to all pager policies and travel ticketEnsure that client consent form is completed and reviewed with guest before beginning serviceEstablishing and maintaining professional relationships with guestsPromotes the benefits of waxing specific to each guest and recommends frequencyConfirming all guest’s services, and upselling services in the room before starting service; Must maintain an average 1.40 services per ticketRetaining guests through pre-bookingSafeguards guest information and confidentialityEducating guests on EWC’s exclusive product line; Must maintain a 14% retail conversionMaintains a professional clean appearance of self by following EWC WSA dress code:‘Hot Tamale’ Barco Scrubs. • White athletic sneakers. • Long-sleeved white shirt underneath scrub top (if needed). • Long to medium length hair should be pulled back • Name tag (worn on the top left side of their scrub, directly above the EWC logo.)Maintains a clean and stocked wax room; filling out any necessary forms when neededCleaning and restocking center and wax binApproach and educate guests when not in session or on break about EWC retail products and the benefits of waxingAll associates are required to use the correct Intranet Form as a part of their daily procedures and when certain situations arise within the centerAttend staff meetings and trainingsFollow European Wax Center protocols, policies and proceduresAccurately clock in and outAdhering to the Reservation Book managed by the GS AssociateVarious duties as assigned by Center Management.Job Requirements:Must adhere to local and state licensing laws and regulations.Adhere to Board of Barbering and Cosmetology Requirements for self, center and rooms.Understand and believe in the benefits of waxing.Customer service oriented and able to communicate effectively with guests, center management, fellow WSA and GS staff.Able to work flexible days and hours."}