{"jobID": "2419472634", "jobLocation": "Austin_TX", "jobTitle": "Senior Machine Learning Research Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.arm.com", "Headquarters": "Cambridge, United Kingdom", "Size": "5001 to 10000 employees", "Founded": " 1990", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Intel Corporation, Imagination Technologies, NXP Semiconductors"}, "estimatedSalary": "104000", "jobDescription": "We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. Job Description About the role Arm-Research’s Machine Learning Group investigates emerging ML technologies and applications and how best to deploy them wherever computing happens; from always-on sensors, to mobile phones, and to the cloud. This role is an opportunity not only to work in the rapidly-growing field of ML, but to research creative applications deployed to Arm – the center of the world’s most ubiquitous compute platforms.  ML research at Arm adds extra dimensions to the already challenging problems of tomorrow – not only do we care regarding model accuracy but also about optimizing energy consumption on deeply embedded devices, maintaining QoS across a wide variety of mobile hardware, and scaling ML to billions of connected devices in the internet of things. WhatwillIbeaccountablefor?Identify and investigate key machine learning technologies and algorithms, and determine how they’ll impact Arm products and partnersCollaborate with product teams to develop new IP and micro-architecturesReport and present experimental results and research findings to key partners around the companyPublish the results of your research to provide to the overall progress of our field #LI-JS1  Job Requirements What skills, experience, and qualifications do I need?MS or PhD in computer science, mathematics, physics, electrical engineering, machine learning or equivalent.Proven knowledge of machine learning/deep learning.Some understanding of CPU and GPU micro-architecture preferredStrong GPU/CPU programming skillsScientific, data-driven, objective mindsetWhat are the desired behaviors for this role? At ARM, we are proud to have a set of behaviors that reflect our rare culture and guide our decisions, defining how we work together to defy ordinary and craft extraordinary. These behaviors are assessed as part of the recruitment process:  Delivery of results – You demonstrate a can-do attitude and you work towards overcome obstacles, acting with a sense of urgency because you’re passionate about what you do. Partner / customer focus – Your tendency to put your partners and customers first in all that you do by understanding their needs and striving to achieve win-win solutions.Creativity / innovation – Possessing curiosity and a passion for driving continuous improvement through spotting opportunities and seeking the views of others.Collaboration / communication – Your ability to forge reciprocal relationships which are built upon mutual trust, open communication and sharing of information and success.Personal impact / influence – You listen to variety of perspectives, evaluate, persuade and carefully shape your work to deliver truly impactful results.Team / personal development – You take time to drive your own development, while also encouraging team members and partners to do the same. #LI-JS1 BenefitsYour particular benefits package will depend on position and type of employment and may be subject to change. Your package will be confirmed on offer of employment. Arm’s benefits program provides permanent employees with the opportunity to stay innovative and healthy, ensure the wellness of their families, and create a positive working environment. Annual Bonus PlanDiscretionary Cash Awards401(k), 100% matching on first 6% eligible earningsMedical, Dental & Vision, 100% coverage for employee only, shared cost for dependentsBasic Life and Accidental Death and Dismemberment Insurance (AD&D;)Short Term (STD) and Long Term (LTD) Disability InsuranceVacation, 20 days per year with option to buy 5 more.Holidays, 13 days per yearSabbatical, 20 paid days every four-years of serviceSick Leave, 7 days per yearVolunteering, four hours per month (TeamARM)Office location dependent: café on site, fitness facilities, team and social eventsAdditional benefits include: Flexible Spending Accounts for health and dependent care, EAP, Health Advocate, Business Travel Accident Program & Commuter programs.  ARM, Inc. (USA) participates in E-Verify. For more information, please refer to www.dhs.gov/E-Verify About ArmArm® technology is at the heart of a computing and connectivity revolution that is transforming the way people live and businesses operate. From the unmissable to the invisible; our advanced, energy-efficient processor designs are enabling the intelligence in 86 billion silicon chips and securely powering products from the sensor to the smartphone to the supercomputer. With more than 1,000 technology partners including the world’s most famous business and consumer brands, we are driving Arm innovation into all areas compute is happening inside the chip, the network and the cloud.  With offices around the world, Arm is a diverse community of dedicated, innovative and highly talented professionals. By enabling an inclusive, meritocratic and open workplace where all our people can grow and succeed, we encourage our people to share their unique contributions to Arm's success in the global marketplace.  About the officeThe Arm Austin office employs staff from across all divisions of ARM and is considered the engineering hub for North America. Austin has the nickname of “Silicon Hills” thanks to the high number of tech companies in the area, and is also known as the “Live Music Capital of the World\". Events such as South by Southwest, Austin City Limits Music Festival and the F1 Grand Prix are but a few of the many activities that make Austin a top destination for both residents and travelers. Austin, TX USA Arm Inc.  Encino Trace  5707 Southwest Pkwy  Bldg 1 Suite 100  Austin, TX. 78735  See on Google maps"}