{"jobID": "2822305617", "jobLocation": "Lemont_IL", "jobTitle": "Computational Biologist", "companyRating": "4.0", "companyInfo": {"Website": "www.uchicagoargonnellc.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "140000", "jobDescription": " Position Description  Applies advanced machine learning principles, theories, and concepts to unusually complex problems in biology and contributes to the development of new approaches. Builds R and D team to perform basic research in computational biology, systems biology and/or cancer biology with the goal of applying computational techniques to improve understanding of living systems at multiple scales. Develops a network of collaborations to participate in complex multi-disciplinary projects that typically span multiple institutions. Participates in the conception and implementation of research programs in computational biology as part of an integrated, multi-institution research team. Executes research with potential to build and direct a research group that applies computational approaches to improve understanding of living systems at the molecular and population levels. Develops new methods in computational biology; applies machine-learning techniques to problems in genomics to understand and predict how living systems respond to treatments and changing environments. Interacts with experimental researchers to discover new ways to integrate and analyze experimental data. Reports on results of research including publishing scholarly papers in scientific journals and giving presentations at symposia, conferences, meetings, and seminars. Reports on research progress and new initiatives to division management, review committees, and funding agencies. Collaborates with scientists within the division, lab-wide, as well as with other laboratories, universities, and industry on basic research, computational biology, metabolic modeling, genome analysis, and systems biology issues. Participates in the formulation and implementation of interdisciplinary research activities, identifying sources of funding, and proposal writing. Participates in professional activities for professional development including serving on committees, participating actively in professional societies, reviewing proposals, refereeing manuscripts, and serving on editorial boards and review committees. Safety, Security, and Environmental Protection: All activities, as they apply to work performed by self or by personnel under supervision, will be executed in compliance with ES and H and security responsibilities established by Argonne National Laboratory's ES and H policies, Safeguards and Security policies, work rules, and safe practices.  Position Requirements Bachelor's Degree and 8+ years’ work experience, or Master's Degree and 5+ years’ work experience, or Doctorate and 4+ years or their equivalents.Comprehensive knowledge of machine learning, with emphasis on deep learning techniques applied to biological data.Comprehensive knowledge of modeling complex biological systems.Considerable experience and skills in interdisciplinary research involving computational biologists, computer scientists, and experimental biologists.Considerable collaborative skills, including the ability to work well with scientists at other laboratories, universities, and in industry.Considerable independent judgment, the ability to abstract from specific problems to generate solutions.Good ability to provide project leadership and generate outside funds.Good growth potential. This position description documents the general nature and level of work but is not intended to be a comprehensive list of all activities, duties and responsibilities required of job incumbent. Consequently, job incumbent may be required to perform other duties as assigned.  As an equal employment opportunity and affirmative action employer, Argonne National Laboratory is committed to a diverse and inclusive workplace that fosters collaborative scientific discovery and innovation. In support of this commitment, Argonne encourages minorities, women, veterans and individuals with disabilities to apply for employment. Argonne considers all qualified applicants for employment without regard to age, ancestry, citizenship status, color, disability, gender, gender identity, genetic information, marital status, national origin, pregnancy, race, religion, sexual orientation, veteran status or any other characteristic protected by law. Back to top"}