{"jobID": "2815774545", "jobLocation": "Irving_TX", "jobTitle": "Data/Sys Lead Business Analyst", "companyRating": null, "companyInfo": {"Website": "www.aviztech.com", "Headquarters": "Dallas, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Business Centric Technology, a technical staffing company with the single focus of pairing the right candidate with the right employment opportunity is currently searching for a Data/Systems Lead Business Analyst for a contract opportunity in the DFW area.  The Data/Systems Lead Business Analyst functions as the liaison between the Developer and the client reviewing, analyzing, evaluating and documenting the technical component of data or systems business requirements for data/systems enhancements or new client implementations. Instructs, directs and communicates with the team to ensure deadlines are met. Assists manager with staff development and quality assurance standards as needed. Typically, leads projects with moderate to large budgets or of a moderate to long duration. Executes implementations of diverse scope and complexity. Manages projects from concept to implementation. Responsibilities:Reviews, analyzes, and evaluates data/system business requirements for existing and new development.Writes detailed technical and business specifications, program functions, and steps required to develop or modify data files or systemsCreates project plans, leads project meetings and coordinates other project activities to ensures deadlines are met.Leads the data analysis and profile efforts for new client implementations and system enhancements.Leads technical meetings with IT and business project team.Provides data mappings, user interface specifications, processing logic as per business requirements to the Developer.Communicates with users, developers and other team members.Tests development efforts and assists the client in user acceptance testing.Provides regular status reports clients, developers, and management as needed.Prepares weekly status report to management, monitors attendance records, contributes to the performance appraisals, prioritizes the project focus and monitors testing progress/results.Mentors and coaches more junior Analysts on the team.Subject matter source within the department fostering staff knowledge expansion and development.Requirements:Ability to develop relationships both in person and over the phone.Ability to be careful and thorough about detail.Ability to analyze information and use logic to address work-related issues and problems.Ability to work proficiently in Microsoft Word, Excel. Required experience in Access, Outlook, PowerPoint, Project, SQL, and Visio. Familiarity with TSA, File-Aid, and reviewing Flat files.Ability to understand relational database concepts and client-server concepts.Ability to drive project timelines to completion with a cross-functional team.Ability to work on complex projects with general direction and minimal guidance.Ability to work independently as a member of various teams and committees.Ability to multi-task and work under pressure.Knowledge and/or certifications in software development methodologies such as Scrum is desired, but not requiredBachelor’s degree or equivalent work experience required6+ years related work experienceExpert SQL knowledgeExpert relational database systems knowledgeExperience with various IT platforms and languages such as Informatica Power center, Java, DB2"}