{"jobID": "2692475975", "jobLocation": "Coronado_CA", "jobTitle": "Senior Data Analyst", "companyRating": "3.8", "companyInfo": {"Website": "www.milvets.com", "Headquarters": "Orlando, FL", "Size": "51 to 200 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "POSITION DESCRIPTION:JOB TITLE:  Senior Data Analyst NSW ODSJOB TYPE:Full-TimeCOMPENSATION:Commensurate with experience, scope of work and locationLOCATION: Coronado, CA 92134REPORTS TO:  Program ManagerMANDATORY:Considering local candidates with US Citizenship, to support this government contract.Employer will not sponsor applicants for work visas for this position.Position requires an active DoD Secret ClearancePOSITION SUMMARY:Performs advanced business analysis using various techniques, e.g. statistical analysis, explanatory and predictive modeling, and data mining.Determines best practices and develops actionable insights and recommendations for organizational operations or issues.Will handle special and sensitive analytical projects as needed.Will assist in implementing or developing systems to capture organizational operations information.EXPERIENCE AND CREDENTIALS: The Senior Data Analyst will have 5 or more years of related data analytics and business intelligence (BI) experience.Has both the ability to work independently and as a team with data scientists, data engineers, data architects and other stakeholders to identify and document analytical and BI requirements.Experience required in data cleansing, online analytical processing (OLAP), business activity monitoring, digital dashboards, logical information systems, data mining, and analysis work with operational data stores, data lakes, data marts, and data warehouses.Experience required in Microsoft Power BI, SharePoint, Visio, Excel, Access, and with BI tools such as Tableau, SAP, and IBM Cognos and Watson.Requires a bachelor's or masters degree in a related information technology field.Prior experience working in the NSW community is highly desired.Must be motivated, self-driven team player who can interact well with others and advise/consult with other team members on related issuesMust have excellent written and verbal English communication skills.Good organizational skills and attention to detail.Will be required to undergo and pass applicable background checks.MILVETS offers an excellent benefits package including Health Insurance, Dental Insurance, Life Insurance, Disability Insurance, Vision, 401(k), Paid Time Off.Applicants for U.S. based positions with MILVETS Systems Technology, Inc. must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.www.dhs.gov/E-Verify E-Verify is a registered trademark of the U.S. Department of Homeland Security. This business uses E-Verify in its hiring practices to achieve a lawful workforce.Equal Employment OpportunityAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.MILVETS Systems Technology, Inc. is an Equal Employment Opportunity/Affirmative Action Employer and maintains a Drug-Free Workplace."}