{"jobID": "2802520415", "jobLocation": "Southlake_TX", "jobTitle": "Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.roseit.com", "Headquarters": "Chesterfield, MO", "Size": "1001 to 5000 employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Position Title: Data EngineerPosition Number: 286402Location: Southlake, TXDesired Skill Set:UNIX, Routers, Microsoft Exchange, Cisco, C, C++Position Description: **C2C and STEM-OPT are not available** *Only U.S. Citizens and those authorized to work in the U.S. can be considered as W2 candidates.** Position Title: Data Communications Engineer  Location: Southlake, Texas 76092  Duration: 6 months+ Job Description: Responsible for day to day administration, disaster recovery, network design and project management Responsibilities associated with this position include application support, integration, network administration, desktop troubleshooting, hardware/software procurement and installation, and asset/license managementAuthor functional specification or work with other engineers to provide guidance in creating functional specificationsParticipate and lead brainstorming discussions to arrive at optimal designsWork with architects and leads in other functional areas of the engineering team to cooperate on the complete system design and influence design decisions BS in CS, EE, Physics, Math is requiredExperience in providing server/desktop support both in Microsoft and Unix environmentsDevelopment experience in C/C++ on UNIX (Linux or BSD) or embedded operation systemsExperience in networking systems with recent emphasis on security and gateway appliances or software products Windows NT/2000/2003/SBS/Unix servers, Microsoft Exchange 5.5/2000/2003, Windows 98/NT/2000/XP/Linux, and Microsoft Office 2000/2003 Experience with Cisco routers, and firewalls, is preferred Candidate must have strong problem solving and interpersonal skills. 10+ years of experience."}