{"jobID": "2696318718", "jobLocation": "Chicago_IL", "jobTitle": "Practice Lead, Data Engineering", "companyRating": "3.5", "companyInfo": {"Website": "www.fractalanalytics.com", "Headquarters": "San Mateo, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Opera Solutions, Mu Sigma, LatentView Analytics"}, "estimatedSalary": "89000", "jobDescription": " The Data Engineering Practice Lead is a professional with experience in managing and scaling big data engagements, extensive knowledge of big data tools, techniques, and methodology, and building/managing a team. It involves designing, developing and implementing big data and analytics solutions to solve industry-specific business problems. He/she leads multiple client projects and is responsible for examining and implementing the latest advancements in big data analytics tools, practices and techniques to deliver greater results. The ideal person is a thought leader in the Data engineering, ideally in Insurance (both P&C; and Healthcare), Technology, Media, and/or Telecommunications domain and has proven track record of consulting and delivering multiple complex initiatives related to data strategy while building a managing a team.  Principal Responsibilities: Work across multiple client projects that require developing and implementing big data analytics solutionsProvide thought leadership across multiple projects, accounts, and industriesWork closely with Industry Practice leaders (Insurance, Healthcare, Technology, Media, Telecom) and sales personnel, identify opportunities and drive conversationsCreate consulting sales stories, project plans and showcase Fractal capabilities in potential client discussionsWork closely with clients to understand analysis needs and jointly evaluate and institutionalize new big data and analytical methods and techniquesWork with onsite Engagement Managers and offshore delivery teams to ensure successful service delivery and client satisfactionReview project deliverables and guide team members from big data consulting and analytics methodology perspectiveSolve problems of large dimensionality in a computationally efficient and statistically effective mannerOversee testing of various descriptive and predictive analytics, and text mining solutions / models on Big data platforms, and operationalize the develop models for ongoing scoring and predictionCollaborate with client teams to effectively integrate and communicate analysis and findingsAdvise Fractal analysts on use of appropriate big data and analytics tools, techniques and frameworksEvaluate emerging technologies that may contribute to Fractals analytical platformsBuilding marketing collaterals for Insurance specific solutions and share learnings across practicesBuild a team and provide mentoring to the team members The Person  Desired Skills and Experience: 12+ years of demonstrable experience in data management roles, including designing, developing and testing modular, efficient and scalable code implemented in Big data and analytics environment as well as in enterprise data management platformsExpert level proficiency in at least one of Python (preferred), Scala, Java (preferred) or C++Minimum 3-5 years of working experience in distributed computing frameworks, particularly Apache Hadoop 2.0+ (YARN; MR & HDFS) and associated technologies -- one or more of Sqoop, Avro, Flume, Oozie, Zookeeper, etc..Hands-on experience with Apache Hive, Apache Spark and its components (Streaming, SQL, MLLib)Operating knowledge of cloud computing platforms (AWS, especially EMR, EC2, S3, SWF services and the AWS CLI)Experience working within a Linux computing environment, and use of command line tools including knowledge of shell/Python scripting for automating common tasksAbility to work in a team in an agile setting, familiarity with JIRA and clear understanding of GIT repositoryManage client deliverables, communicate effectively with internal and external teamsExcellent communication skills to be able to effectively translate and articulate the findings to technology, analytics and business stakeholdersB.E / B.Tech. / B.S. in Computer Science or advanced degree in related technical domain. Advanced degrees preferred but not required."}