{"jobID": "2805371349", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.akraya.com", "Headquarters": "Santa Clara, CA", "Size": "201 to 500 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Palo Alto Staffing, Artech Information Systems, TEKsystems"}, "estimatedSalary": null, "jobDescription": " Data Analyst : 18-02064  Ref No.: 18-02064  Location: Austin, Texas  Akraya is looking for a  Data Analyst for one of our clients. If the job description below is a fit, please apply directly or call  Swapnil: ************.  If this position is not quite what you're looking for, visit ********** and submit a copy of your resume. Our recruiters will get to work finding you a job that is a better match at one of our many clients.  Primary Skills: Administrative Assistant, Calendar Meetings, Travel, PeopleSoft, CRM  Duration: 6+ months  Contract Type: W2 Only Responsibilities:Work with peer teams and across multiple systems to generate accurate inventory reportingReconcile various forms of reports into one excel workbook, then update inventory database accordinglyEnsure audit and control regulations are met, including asset reconciliation and disposal certificationsPreparing accurate ad-hoc, monthly and quarterly progress reports as requiredAdherence to Standard Operating ProceduresQualificationsExperience with inventory management systemsProficient in Excel; functions and pivot tables are a must, knowledge of macros is preferred but not requiredAbility to execute at the detail level while maintaining a strategic alignment with the practiceConsistently approaches work with energy and a positive, constructive attitude Please apply directly with your updated resume or call Swapnil at 408 - 512 - 2354  About Akraya  Akraya, Inc. is an award-winning staffing firm that works with many of the leading, technology-based companies around the world. We have been ranked as one of the Best Staffing Firms to Temp for by Staffing Industry Analysts on multiple occasions and are a preferred staffing vendor within numerous staffing programs. Please visit ********** to search through all of our current openings or to submit your resume to our recruiting team."}