{"jobID": "2832775551", "jobLocation": "Spring_TX", "jobTitle": "Data Scientist&Analytics; Manager", "companyRating": "2.4", "companyInfo": {"Website": "www.conns.com", "Headquarters": "The Woodlands, TX", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Company - Public (CONN) ", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Best Buy, Walmart"}, "estimatedSalary": "111000", "jobDescription": " Data Scientist&Analytics; Manager Conn's History: Conn's is a 128-year old consumer goods retailer with over $1 billion in revenue and over 4,000 employees. The company, headquartered in The Woodlands, TX, is publicly-traded (NASDAQ:CONN) and operates more than 115 retail locations in fourteen states and expanding into new markets. The Company's products and services offered through its retail sales outlets, distribution and service facilities include furniture and mattresses, home appliances, consumer electronics, home office equipment, repair service agreements, credit insurance, home delivery, product repair service and consumer credit. We offer a comprehensive benefits program including: Medical, Dental&Vision; Benefits, Flexible Spending Accounts, Paid Vacation, Basic Life Insurance, 401(k) Retirement Savings Plan, Employee Stock Purchase Plan, Tuition Reimbursement and Employee Discounts. Position Summary: The Data Scientist and Analytics Manager's responsibilities include, but are not limited to, designing, developing, implementing, and maintaining business solutions for the support of Conn's Credit division. This position will model institutional problems, discover institutional insights and identify opportunities through the use of statistical, algorithmic and visualization techniques. In addition to advanced analytic skills, this role is also proficient at integrating and preparing large datasets, ensuring data is congruent and reliable, turning data into information and communicating results. As a key player in the Credit Analytics team, the Data Scientist and Analytics Manager needs to be a creative thinker who utilizes innovative approaches to solve business problems. The ideal candidate will have designed, executed and deployed statistical-based underwriting rules in their current role or past role. This role would also lead the planning and implementation of change programs that impact critical functions/processes. Partner with other resource managers/change agents to identify opportunities for significant process enhancements. Recommend changes that impact strategic business direction. Evaluate progress and involve peers and team members in analyzing strengths and weaknesses in performance. Improves efficiency by spearheading pilots and planned functional change initiatives. Responsibilities: The Data Scientist and Analytics Manager's responsibilities include, but are not limited to: Identifies and acts upon opportunities for continuous improvement. Encourages prudent risk-taking, exploration of alternative approaches, and organizational learning. Demonstrates personal commitment to change through actions and words. Mobilizes others to support change through times of stress and uncertainty.Expresses technical and business concepts, ideas, feelings, opinions, and conclusions orally and in writing.Synthesizes facts, theories, trends, inferences, and key issues and/or themes in complex and variable situations. Recognizes abstract patterns and relationships between apparently unrelated entities or situations. Applies appropriate concepts and theories in the development of principles, practices, techniques, tools and solutions.Gathers and analyzes information or data on current and future trends of best practice.Improves organizational performance though the application of original thinking to existing and emerging methods, processes, products and services. Employs sound judgment in determining how innovations will be deployed to produce return on investment.Anticipates, identifies and defines problems. Seeks root causes. Develops and implements practical and timely solutions.Collaborates with other members of formal and informal groups in the pursuit of common missions, vision, values and mutual goals. Places team needs and priorities above personal needs. Involves others in making decisions that affect them. Draws on the strengths of colleagues and gives credit to others' contributions and achievements.Other duties as assignedQualifications:Master Degree in a relevant field, including Statistics, Data Science, Analytics, and Applied Mathematics preferred.Minimum of 10 years in a similar role.Experience in SAS programming (SAS Enterprise Guide)Knowing R or Python is a plusKnowledge of relational database, knowledge using SQL Server or SAS SQL procedure to extract, clean, manipulate, transfer data, create variables and explore patterns and relationshipsKnowledge/experience in statistics, data mining and predictive modelingAbility to handle multiple tasks simultaneously and prioritize accordinglyAbility to communicate effectively at all levelsAdvanced proficiency in ExcelAbility to work effectively as a member of a team and independently Conn's is PROUD to be an equal opportunity employer."}