{"jobID": "2807381531", "jobLocation": "Washington_DC", "jobTitle": "Engagement Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.censeoconsulting.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "141000", "jobDescription": " Censeo Consulting Group is a top management consulting firm with an award-winning culture. We strengthen the management practices of mission-driven organizations in the government, nonprofit, and education sectors so they can better serve the social good. We have a unique, data-driven approach that delivers real change and sustainable results to our clients. Position Description: Engagement Managers are project managers and emerging firm leaders. They own the client problem and are responsible for managing the day-to-day activities of the project team. In addition, they are also responsible for mentoring business analysts and associates on their teams. Some responsibilities include: Takes ownership of small project(s) or large portion of bigger project(s) defined within a specific accountStructures analyses and identifies key insights; responsible for all analyses of assigned team / workstream; sanity checks all outputSeen as expert on small project(s) or large portion of bigger project(s) and other related projects/associated clientsOwns and maintains hypothesis development process and guides team through required analysesUnderstands industry context, client and team issues and how they relate to the problemConsistently derives sound business insights from analysis of complex issuesRecommends actionable solutions for work stream(s) and provides input to the recommendations of the entire case, or significant subsetShows mastery of the full Censeo toolkit. Identifies and proficiently applies the relevant analytical tools for the case; guides case-team in applicationInterprets output into meaningful insight, across case and toolkitAble to leverage own as well as existing Censeo expertiseResponsible for the majority of client communicationsLeads client meetings, asking insightful questions to help facilitate project progressDelivers clear, professional, and confident presentations to clientStructures significant and comprehensive presentations; uses tight storylines and compelling displaysDefines and allocates work within and across workstreams; understands and develops leadership styles that will work for the teamSets team deadlines based on overall workstream scope / timelineInitiates business development actions in coordination with account managers; takes lead on sections of new business proposalsCoaches others on project teams on opportunities for improvement; provides regular project-based feedback to team membersUses feedback mechanisms to drive optimal performance for self and workstream; writes compelling, factual and actionable performance reviewsLeads portions of internal firm building activities, including but not limited to: proposal development, training, mentoring and recruiting Qualifications and Experience: >= 5 years of experience in operations improvement, corporate strategy, or similar3-5 years of experience at a consulting firm preferredMasters degree in related field or MBA preferredSuperior creative problem-solving, analytical and quantitative skillsAbility to manage multiple, simultaneous projects with demanding deadlinesProvides a positive example and is seen as a role model and mentor for staffExperience in writing consulting-ready communicationsEffective communication skills with an ability to synthesize and share knowledgeAbility to work with senior-level leadershipExperience leading portions of proposals development processPosition Particulars: Travel minimum of 0-10%; can increase based on business needsThis is an exempt, full-time positionWork Requirements: Essential Mental FunctionsComprehensionAbility to understand and appreciate opposing points of view on highly complex issues and to negotiate and integrate different viewpointsOrganizationAbility to organize thoughts and ideas into understandable terminologyAbility to organize and prioritize own work schedule on short-term and long-term basisAbility to organize and prioritize work schedules of others on short-term and long-term basisReasoning and Decision MakingAbility to make decisions which have significant impact on Censeos and the clients credibility, operations, and servicesCommunicationAbility to compose letters, outlines, memoranda, and basic reports and/or to orally communicate technical informationAbility to communicate with individuals utilizing a telephone; requires ability to hear and speak effectively on phoneAbility to express or exchange ideas by means of the spoken word, communicating orally with others accurately, loudly, and quicklyAbility to make informal presentations, inside and/or outside the organization. Speaking before groupsAbility to compose materials such as detailed reports, work-related manuals, publications of limited scope or impact, etc., and/or to make presentations outside the immediate work areaAbility to formulate complex and comprehensive materials such as legal documents, authoritative reports, official publications of major scope and impact, etc., and/or to make formal presentationsMathematicsAbility to compute, analyze, and interpret numerical data for reporting purposesAbility to compute, analyze, and interpret complex statistical data and/or to develop forecasts and computer modelsEssential Physical FunctionsSitting: Particularly for sustained periods of timeLight Carrying: Physically transporting items weighing less than 15 pounds from one location to another Censeo is an equal opportunity employer. We are committed to providing equal opportunity to all applicants and employees in full compliance with all applicable state and federal laws prohibiting discrimination on the basis of race, color, age, gender, religion, national origin, disability, protected veteran status, or any other class protected by applicable state or federal law."}