{"jobID": "2823714334", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "THIS IS NOT A REMOTE OPPORTUNITY/ NO THIRD-PARTY VENDORSWho is Taos? Taos is an IT consulting and services company that offers expertise across the strategic, management and tactical layers of IT and engineering organizations. As part of the nation's IT landscape since 1989, we offer opportunities that will allow you to achieve your career goals and objectives.  We're changing the face of some of the most innovative companies with our diverse solution offerings, exceptional talent and thought leadership. Our clients look to us first for advice, insight, and support, driving us to relentlessly focus on customer success.  Taos is immediately hiring a Data Scientist for a cutting-edge tech company in San Francisco, CA! Who you are: You are an experienced Data Scientist with a passion for advanced data analysis. You appreciate a stable but fun start-up like environment. You are a hard worker and more importantly, a contributor to the continuously changing business and technological environments around you. You are detail-oriented, thrive on creating structure from chaos, and you have excellent written and verbal communication. You have the knowledge and experience necessary to act as the go-to person on your team for all things data analysis and data science. What youll be doing:Working with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutionsMining and analyzing data from company databases to drive optimization and improvement of product development, marketing techniques, and business strategiesAssessing the effectiveness and accuracy of new data sources and data gathering techniquesDeveloping custom data models and algorithms to apply to data setsUsing predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting, and other business outcomesDeveloping company A/B testing framework and test model qualityCoordinating with different functional teams to implement models and monitor outcomesDeveloping processes and tools to monitor and analyze model performance and data accuracyWhat youll bring with you:5 to 7 years of experience manipulating data sets and building statistical modelsMasters or PHD in Statistics, Mathematics, Computer Science or another quantitative fieldFamiliarity with the following: Coding with several languages (C, C++, Java, JavaScript, etc.)Statistical and data mining techniques (GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc.)Querying databases and using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data setsCloud technology from Oracle, AWS, AzureCreating and using advanced machine learning algorithms and statistics (regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc.)Distributed data/computing tools (Map/Reduce, Hadoop, Hive, Spark etc.)Strong problem-solving skills with an emphasis on product developmentExperience working with and creating data architecturesKnowledge of a variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacksKnowledge of advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applicationsExcellent written and verbal communication skills for coordinating across teamsA drive to learn and master new technologies and techniquesLets talk about us: Some IT professionals watch their careers shoot straight up. Others spend years at one company after another struggling to get noticed and stay on top of developing technologies. If you are looking for a place that puts employees first while staying on the cutting edge of technology, come to Taos. Well immerse you in multiple environments and operating technologies, give you access to the collaboration of a strong technical community, and expose you to IT innovation as it happens in real-time. With unparalleled adaptability, you have the opportunity to leverage Taos as an employer to be successful. Referrals: We love referrals so much that we pay for them! If you know someone that you would recommend, click HERE or go to our website at http://www.taos.com/it-talent/opportunities/and we will do the rest! We'll make sure that you receive the $1000 referral bonus after they are employed with us. Compensation: Our compensation package includes a competitive salary, medical and dental insurance, 401k, paid vacation, sick time and holiday pay, plus loads of free training (Puppet, Chef, Nagios, LAMP Stack, PMP, ITIL, Python, etc.)! How to apply: If youre interested in this position or know someone who is, please email your resume (Word or PDF format) and contact information to opportunities@taos.com .  Taos Mountain, LLC is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color national origin, sex, age, status as a protected veteran, or status as a qualified individual with disability.  Veterans are encouraged to apply!  E-Verify Participant: This employer will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employees Form I-9 to confirm work authorization. Please go to http://www.taos.com/it-talent/opportunities/ and review the E-Verify Participant and Right to Work links for more information. #LI-POST"}