{"jobID": "2688998630", "jobLocation": "Newark_NJ", "jobTitle": "PGIM Fixed Income - Principal, Quantitative Research", "companyRating": "3.5", "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": "119000", "jobDescription": "PGIM Fixed Income is a global asset manager offering active solutions across all fixed income markets. The company has offices in Newark, New Jersey, London, Tokyo and Singapore. As of December 31, 2017, the firm has $709 billion of assets under management including $291 billion in institutional assets, $122 billion in retail assets, and $296 billion in proprietary assets. More than 500 institutional asset owners have entrusted PGIM Fixed Income with their assets. PGIM Fixed Income is a United States business operating as a unit within PGIM, Inc. (formerly known as Prudential Investment Management, Inc.) (“PGIM”). PGIM is the largest investment adviser within Prudential Financial, Inc. (“PFI”). As of September 30, 2017, PGIM had $1.1 trillion in assets under management across their real estate, equity, public fixed income, and private fixed income businesses and is ranked 9th among IPE’s top 400 asset managers The Quantitative Research and Modeling (QRM) Group in PGIM Fixed Income is looking to add a team member on the Principal level to work on research and development of relative value models and trading strategies with a focus on global interest rate, credit and FX markets. The group covers all major global public fixed income markets, and we model credit, interest rate and foreign exchange risk. We work closely with portfolio managers and traders as well as with colleagues in risk management, structured finance research, and application development. Responsibilities include: Design analytical solutions to business needs in an asset management environment Engage portfolio/risk managers to understand business requirementsProgramming as part of a quantitative development team and contribute to a core library of models Opportunity to lead and mentor one or more junior quantitative analysts A successful candidate should possess: An advanced degree (PhD preferred) in a quantitative field (science, math, finance or engineering). 10 years of experience in fixed income quantitative research (buy-side preferred)Understanding of term structure models and their use in pricing derivativesStrong programming skills and experience in Python, C and/or Java Demonstrated ability to carry out independent research projects as well as to make contributions in a team setting Strong communication and presentation skills Not required but highly desirable: exposure to structured finance and credit models, as well as Monte Carlo simulation "}