{"jobID": "2802531297", "jobLocation": "Edison_NJ", "jobTitle": "4337 Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.reqroute.com", "Headquarters": "Milpitas, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our client is one of the world's leading information technology companies. Through its Global Network Delivery Model, Innovation Network, and Solution Accelerators, client focuses on helping global organizations address their business challenges effectively. A part of India's largest industrial conglomerate, with over 130,000 of the world's best trained IT consultants in 50 countries. The company is listed on the National Stock Exchange and Bombay Stock Exchange in India. Our client delivers a level of certainty that no other firm can matchto their clients and employees. Role - Data Scientist  Term - Fulltime  Job Description5+ years of machine learning/ Data Science experience in developing and implementing large scale algorithms impacting business revenues and customer experienceDegree (MS or PhD) in either Maths / Statistics / Computer science / Other quantitative fieldPreferred Certification: Certified Analytics ProfessionalStrong problem solving skills with an emphasis on product development.Experience working with and creating data architecturesGreat communication skills for storytelling, data visualization and presentation across stakeholders and functional teams.Strong experience in the data mining / data analysis methods Predictive modeling and running simulations to increase and optimize business outcomes.Analysis and processing of large complex data sets for product and process optimization.Advance statistical techniques and conceptsMachine learning algorithms like Decision trees, Regression, Support vector Machines, Kernel methods, Neural networks, K-Means Clustering Experience in working with following Software / tools Statistical Languages: R, Python, SAS, Matlab, SQLFrameworks/ Libraries: Keras, Caffe, TheanoVisualizing tools : Periscope, Business Objects, D3, ggplot, etcDistributed data/computing tools: Haddop, Map/Reduce, Hive, Spark, MySQL, etc.NoSQL databases-: MongoDB, Cassandra, HBase If you bring willingness, flexibility and a desire to impress please apply now.  Technical Recruiter: Sajita Sreerangam  Email: sajita@reqroute.com  Phone: 4087574337 "}