{"jobID": "2817059345", "jobLocation": "Milpitas_CA", "jobTitle": "Principle Clinical Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.proclinical.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Clinical Professionals, Real Staffing, NonStop Recruitment"}, "estimatedSalary": null, "jobDescription": " We are seeking an innovative and dedicated individual to fill the newly-opened position of Principle Clinical Research Scientist, based in Milpitas, CA. This individual will have strong scientific expertise to provide insights and strategic direction to develop innovative evidence generation and dissemination strategies for New Product Development and Life-Cycle Management projects.  Responsibilities Develop and deliver appropriate Global EGS / EDS to support NPD and LCM within the assigned platforms, with collaborative relationships with all relevant CR&D; partners and cross-functional partners.Deliver assigned clinical projects, through effective partnership with the Clinical Operations and BSDM teams, to enable optimized engagement leading to delivery of clinical project commitments.Lead in study design to develop appropriate clinical trials to meet the NPD/LCM needs.Lead in appropriate interpretation and dissemination of all evidence generated, based on EDS, including Clinical Study Reports, abstracts, manuscripts, CERs.Contribute in clinical scientific discussions with regulatory agencies/notified bodies to drive support of the clinical and regulatory strategy, including proposed clinical investigations; review process of clinical evidence.Foster strong relationships with external stakeholders to shape and influence relevant policies.Partner with internal stakeholders to ensure accurate dissemination of clinical data/evidence in value briefs and technical summaries for market access and reimbursement.Proven track record in delivering clinical programs within clinical / surgical research setting, on time, within budget and in compliance to SOPs and regulations.Comprehensive understanding of clinical trial regulations across multiple regions. Skills And Qualifications BA in Biological Science or related; advanced degree preferred, and 8+ years of related experience.Thorough understanding of clinical research science, and a broad and extensive understanding of product development processes, team dynamics, related healthcare market environment, clinical trends, and global clinical trial regulations.Continually develop expertise to provide strategic and scientific clinical research capability.Know and follow all laws and policies that apply to one's job, and maintain the highest levels of professionalism, ethics and compliance.Diligently participate in our compliance program-related activities as denoted by supervisor or Chief Compliance Officer. To Apply:  Please click on the Apply button. Please include a short note outlining why you are interested in the role and why you think you are suitable.  In case you have difficulty in applying or if you have any questions, please call Eleni Farrell at (+1) 2679830134 or upload your resume on our website - www.proclinical.com.  A full job description is available on request.  ProClinical is a specialist employment agency and recruitment business, providing job opportunities within major pharmaceutical, biopharmaceutical, biotechnology and medical device companies."}