{"jobID": "2780596851", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Cobalt builds autonomous security robots that keep buildings safe by combining the reliability of machines and the friendly face of human-in-the-loop Robot Specialists. Security costs US companies $33B / year, and is a very difficult task for humans to perform because of long monotonous hours.We have robots deployed to customers throughout San Francisco and are an incredibly fast moving team - we went from nothing to shipping our first robots in 12 months! We are now 24 people working from Palo Alto (soon to be San Mateo), and just raised our Series A from Sequoia and Founders Fund! We're looking for folks who are scrappy, collaborative, excited, and eager to share their knowledge and expertise with the rest of our team.Our robots generate a mountain of data each day, containing valuable insights on robot performance, understanding of the environment around the robot, and possible security anomalies. We are seeking a data scientist to help our robots and Specialists make the most of this data!Responsibilities Uncover patterns in the world around the robot - when we detect a person in a certain time / place, can we guess who they are from past records?Use machine learning models and custom solutions to detect people, motion, and other security anomaliesUse images and 3D sensors to help the robot see more obstacles and stay safeCollaborate with other engineers to productize and deploy these algorithms onto our robots and cloud infrastructureRequirements1+ years of industry experience working on machine learning or data scienceExperience with PythonExperience with Numpy or SciKit LearnKnowledge of statistical machine learning and CNNsBA/BS in CS, Statistics, or a related field Bonus Points Experience with person or object detection using neural networksExperience with 3D data, i.e. LIDAR, laser scanners, or depth camerasExperience with high performance Python or C++Experience with roboticsHave worked in a startup environmentWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status."}