{"jobID": "2824938013", "jobLocation": "Austin_TX", "jobTitle": "Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.atlassian.com", "Headquarters": "Sydney, Australia", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Public (TEAM) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " GitHub"}, "estimatedSalary": "106000", "jobDescription": " Atlassian is looking for a Data Engineer to join our Marketing Data Engineering team and build world-class data solutions and applications that powers crucial business decisions throughout the organization. We are looking for an open minded, structured thinker who is passionate about building systems at scale. You'll be the genius who understands data at Atlassian, knows where to find it, and manages the process to make that data useful for Analytics. You love thinking about the ways the business can consume this data and then figuring out how to build it.  On a typical day you will be building the data models and ETL processes to provide this data for business use. You've got industry experience working with large datasets. You are interested in reporting platforms and data visualization. As the data domain expert, you will be partnering with our technology teams, analytical teams, and data scientists across various initiatives.  You'll own a problem end-to-end, so those skills will come in handy not just to collect, extract, and clean the data, but also to understand the systems that generated it, and automate your analyses and reporting. On an on-going basis, you'll be responsible for improving the data by adding new sources, coding business rules, and producing new metrics that support the business. Requirements will be vague. Iterations will be rapid. You will need to be nimble and take smart risks.  More about you  As a data engineer, you may have experience spanning traditional DW and ETL architectures. But for this role it is important to have industry experience working with big data ecosystems like Spark/Hadoop and Redshift. You've probably been in the industry as an engineer for 2+ years and have developed a passion for the data that drives businesses.  On your first day, we'll expect you to have: Deep understanding of big data challenges and eco-systemExperience with solution building and architecting with public cloud offerings such as Amazon Web Services, Redshift, S3, EMR/Spark, Presto/AthenaExperience with Spark and HiveExpertise in SQL, SQL tuning, schema design, Python and ETL processesExpertise in data pipeline with such workflow tools as Airflow, Oozie or LuigiSolid understanding experience in building RESTful APIs and microservices, e.g. with FlaskExperience in test automation and ensuring data quality across multiple datasets used for analytical purposesExperience with Lambda Architecture or other Big Data architectural best practicesA graduate degree in Computer Science or similar disciplineCommit code to open source projectsExperience with test automation and continuous delivery It's great, but not required, if you have: Experience with TableauExperience with Machine LearningHave worked in a Marketing Org or advertising technologiesHave worked with Data Scientists More about our team  Atlassian is over a decade old, but our team is much younger. We'll have to blaze new trails to enable important growth decisions, so we're constantly growing, learning, and trying to do things differently. You'll be joining a team that is crazy smart and very direct. We ask hard questions and challenge each other to constantly improve our work. We are self-driven but team oriented. We're all about enabling growth by delivering the right data and insights in the right way to partners across the company.  More about our benefits  Our offices are open, highly collaborative and yes, fun! To support you at work (and play) we offer some fantastic perks: ample time off to relax and recharge, five paid volunteer days a year for your favorite cause, plenty of food and beverages, ergonomic workstations with sit/stand desks, unique ShipIt days, a company paid trip after five years, generous employer-paid insurance coverage (medical, dental, and vision) for you and your family, 401k matching and more.  More about Atlassian  Software is changing the world, and we're at the center of it all. With a customer list that reads like a who's who in tech and a highly disruptive business model, we're advancing the art of team collaboration with products like Jira, Confluence, Bitbucket, Trello, and now Stride. Driven by honest values, an amazing culture, and consistent revenue growth, we're out to unleash the potential of every team. From Amsterdam and Austin to Sydney and San Francisco, we're looking for people who are powered by passion and eager to do the best work of their lives in a highly autonomous yet collaborative, no B.S. environment.  We believe that the unique contributions of all Atlassians is the driver of our success. To make sure that our products and culture continue to incorporate everyone's perspectives and experience we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.  All your information will be kept confidential according to EEO guidelines."}