{"jobID": "2832138456", "jobLocation": "Oakland_CA", "jobTitle": "1:1 School aide- experience with autism required", "companyRating": null, "companyInfo": {"Website": "www.juvobh.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " STE CONSULTANTS, Trumpet Behavioral Health, Autism Spectrum Therapies"}, "estimatedSalary": null, "jobDescription": " JUVO. Achieve your potential. Juvo is Latin for help, support, and serve perfect words to describe who we are and what we do. About the Behavior Technician Position: At Juvo, our Behavior Technicians are the backbone of our success in providing superior care and service through the implementation of Applied Behavior Analysis. Were seeking BTs whose qualities match our core values of Integrity, Commitment to Community, Dedication to Quality Services, People First, Compassionate Care and Fun! Behavioral Skills Therapist and Registered Behavioral Technician Job Duties: In addition to providing direct care to our clients, our Behavior Technician and Registered Behavior Technicians will be expected to perform: Client Training:Implement individualized programs for children and young adults based on ABA principles that increase communication, self-help, social and play skills.Utilize positive reinforcement and antecedent modification to increase appropriate behaviors over time.Manage inappropriate behaviors that occur. Through the implementation of Behavior Intervention Plans (BIPs) and consultation with our Board-Certified Behavior Analysts (BCBAs)Facilitate interactions with peers, coworkers, and families.Keep the children motivated to learn through preference assessments.Have fun with our clients while teaching them the skills that they need!Client Progress Communication:Accurately record information on the child's progress throughout the session.Be courteous & professional with families, organizations, and children.Communicate confidentially and professionally with behavior analysts, teachers, parents, and principals.Whats in it for you:Opportunity to earn your Registered Behavioral Technician (RBT) Certification40+ hours of paid training prior to working with clients. Training online and in person.Paid drive time and mileage reimbursement.Future growth opportunity into supervisory roles within our company.The opportunity to gain supervised independent fieldwork hours for those in need practicum/internship hours.A chance to make a meaningful impact on the life of the children served and their families.Qualifications:H.S. DiplomaHave experience working with children and/or managing challenging behaviors with children (preferred).Excellent interpersonal and communication skills: spoken and writtenAvailable in the PM (3:00 and after) at least 4 days a week.Possess a driver's license with reliable transportation and auto insurance for driving to and from clients.Have access to a working cell phone. We are guided by a people first mentality, where whats best for each individual is our number one priority. We believe that every person has unique and individual abilities, and we all thrive when we are provided with the right support. Juvo is here to provide you with that support.  We have spent over a decade empowering individuals with autism and other special needs to lead independent lives and achieve their full potential. Every day, our values guide us to provide high quality, evidence-based, individualized support at home, in schools, and in other community settings. We accomplish this by attracting an exceptional team that is dedicated to delivering skilled, consistent, and compassionate care.  Check us out at www.juvobh.com to learn more about us!"}