{"jobID": "2826562123", "jobLocation": "El_Segundo_CA", "jobTitle": "Sr. QC Scientist", "companyRating": null, "companyInfo": {"Website": "www.apexlifesciences.com", "Headquarters": "Glen Allen, VA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " A well-regarded company focusing on patient therapies is seeking a Sr. QC Scientist to join their team. This is a great opportunity to work for an industry leader! RESPONSIBILITIES:Support lifecycle management of commercial release methods by evaluating and proposing enhancements to the test methodsSupport activities related to the transfer and validation of analytical methods from Clinical to Commercial QC, and commercial QC to external testing sitesAssist with deviation, investigation, CAPA and change control activities at company and contract labs, as neededSupport inspection readiness activitiesDevelop, revise and review SOPs, protocols and technical reportsParticipate in generating training module and instruction led training materialResponsible for generating trending charts for monitoring method performance, product quality, invalid rate and/or stabilityREQUIREMENTSPh.D with 5+ years or Master with 8+ years of experience in a GMP environmentExperience in a number of analytical techniques, including but not limited to, Flow Cytometry, Real Time PCR, ELISA, Cell Viability measurement, etc. Familiarity with ddPCR will be a plus.Experience in performing analytical method validation and supporting method transfer activitiesFamiliarity with FDA, ICH and GMP guidelinesAbility to think critically and demonstrate troubleshooting/problem solving skillsExperience in conducting lab investigations, writing deviations, implementing CAPAs and initiating change controlsExcellent skills in Microsoft Office, data analysis software, and other related applicationsExcellent interpersonal, verbal and written communication skills are essential in this collaborative work environmentComfortable in a fast-paced small company environment with minimal direction and able to adjust workload based upon changing priorities EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resum] or ************.  Job ID: ******  Help us improve CareerBuilder by providing feedback about this job: . CAREERBUILDER TIP For your privacy and protection, when applying to a job online, never give your social security number to a prospective employer, provide credit card or bank account information, or perform any sort of monetary transaction. Learn more.  By applying to a job using CareerBuilder you are agreeing to comply with and be subject to the CareerBuilder Terms and Conditions for use of our website. To use our website, you must agree with the Terms and Conditions and both meet and comply with their provisions.  Apex Life Sciences  On Assignment's U.S. life sciences businesses, Lab Support and Valesta Clinical Research Solutions, have been re-branded as Apex Life Sciences. The U.S. divisions of Lab Support and Valesta are leaders in the scientific, engineering, and clinical research staffing and services industry. The new name was chosen to leverage the national brand of On Assignment's Apex Systems, a leader in the technology staffing and services industry. For over 30 years, Lab Support and Valesta have provided top talent for contract, contract-to-hire, and direct hire positions in the life sciences industries. With hundreds of thousands of successful matches over three decades, the divisions have built reputations as the best in the business. Contact Info El Segundo, CA 90245"}