{"jobID": "2734947127", "jobLocation": "Arlington_VA", "jobTitle": "Financial Data Migration Analyst", "companyRating": null, "companyInfo": {"Website": "www.avercg.com", "Headquarters": "Washington, DC", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " AVER is looking for a motivated, proactive, and experienced candidate to join our team. Our organization is rapidly growing, with lots of room for career growth and professional development. This role will be responsible for providing support leading up to, and following, the transition to a new Federal financial solution. Qualified individuals will have prior experience supporting large (agency-wide) financial system data migrations. Specific data migration experience in more than one of the following is highly preferred: Finance and Procurement Desktop (FPD), Contract Information Management System (CIMS), Oracle Federal Financials R11, Oracle Federal Financials R12, Sunflower Asset Management System (SAMS), Concur, and Oracle Contract Lifecycle Management (CLM) module. Responsibilities:Review, recommend modifications, and maintain an up-to-date Data Migration Strategy and Data Migration Test Plan documents.Perform data extraction, validation, and transformation tasks and coordinate with the appropriate authorities on required changes to the environment to execute the data migration strategy.Review existing reconciliation tools and procedures and recommend modifications and enhancements to ensure successful migration of data between the legacy financial system and the proposed financial system.Support performing full mock/test conversions and document data cleansing requirements, lessons learned, and related action items.Manage approved manual and/or automated data transformation updates to ensure that an audit trail is maintained.Facilitate quick resolutions of data issues to support data migration efforts.Maintain version control of data migration artifacts/tool (e.g. scripts, templates, validation modules) and changes closely.Provide full reconciliation of records between the legacy system and provided data migration templates for each mock migration and final cutover.Review existing data extraction, transformation, and validation scripts and incorporate recommended changes for the proposed financial system.Review existing data mapping structures, provide improvement recommendations, and implement updates to existing structures (or create new structures where required).Develop presentations, meeting agendas, and meeting minutes for data migration related meetings.Minimum Qualifications:At least 5 years of relevant experience.At least 2+ years of professional development skills, such as PL/SQL, SQL, UNIX/Linux, Oracle Application framework, or PRISMAbility to obtain, and maintain, a Government Public Trust clearance.About AVER LLC: AVER is a verified Service Disabled Veteran Owned Small Business (SDVOSB) Technology and Management Consulting firm specializing in supporting Federal, State, and local government customers. We provide to all our clients the best customer experience by employing people that have a passion for consulting and who deliver real business value every day. We pride ourselves on anticipating our client's needs and delivering solutions with diligent execution. Our multi-disciplined staff are capable of doing more than just the primary duties, allowing our clients to spend less and avoiding inefficient single-track teams."}