{"jobID": "2837220217", "jobLocation": "Los_Altos_CA", "jobTitle": "Lead Analyst, Data Analytics", "companyRating": null, "companyInfo": {"Website": "www.contrastsecurity.com", "Headquarters": "Los Altos, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Veracode, WhiteHat Security"}, "estimatedSalary": null, "jobDescription": "In this critical role, you will turn complex data into tangible insights to help drive the success and growth of our products and our company. You will have tremendous cross-functional exposure as you will be partnering closely with our product, business and engineering teams to work on a wide-variety of projects; everything from understanding and visualizing real-world vulnerability data and attack trends related to the thousands of critical applications we protect, to measuring feature usage and identifying opportunities to better showcase the value of our solution to our customers and market. And though you will be expected to build tools and reports, this role is about so much more than creating dashboards its about telling the story of our business and mission in the most compelling and creative way, using data!To be successful in this role you must have a strong combination of both technical data skills and excellent communication skills. You must be able to tackle unstructured problems in structured ways, be passionate about generating hypotheses for business problems, and be brilliant at delivering actionable insights accompanied with a compelling narrative.Responsibilities Design and build new analytical models and/or enhance existing models, while exploring and researching data relating to key product and business metricsConceptualize, build and maintain dashboards and reports focusing on key metrics and experiments. Build simple and elegant data visualizations for use in internal and external contextsWork closely with product, business and engineering teams; collaborate with both technical and non-technical colleagues to complete data projects and ensure all parties can leverage data-driven insights, e.g. to improve our understanding of patterns/trends related to product usage and identify new growth opportunitiesDevelop insights for Contrasts client base using historical data with methods, such as time series analysis, regression, segmentation and clusteringAuthor customer/market facing, data-driven content (reports, whitepapers etc.)Foster a data culture through peer collaboration, training, coaching and more About You BA/BS or MS degree, preferably in Economics, Math, Statistics, Computer Science or related field3+ years of data analytics experience (business intelligence, data visualization, product analytics etc.) with proven track record of using quantitative analysis to impact key business or product decisionsA passion for data analysis and problem solving; statistics knowledge and hypothesis testing experienceComfortable with SQL, Excel and visualization tools (Periscope, Tableau etc.)Demonstrated ability to gather and process data at scaleStrong interpersonal and communication skills (verbal and written). Must be able to explain technical concepts and analysis clearly to a wide variety of audiences. Experience authoring content (whitepapers, reports, blog posts etc.) Bonus Points For Technical background and programming experience. Experience with R and/or Python is a strong plusApplication security background What We Offer Competitive compensationMedical, dental, and vision benefits401(k)Flexible paid time offWe are changing the world of software security. Do it with us.We believe in what we do and are passionate about helping our customers secure their business. We work hard, and we have fun doing it.Solve the impossible.Easy = boring. If youre looking for a fun work environment and like a challenge, youll love Contrast Security.By submitting your application, you are providing Personally Identifiable Information about yourself (cover letter, resume, references, or other employment-related information) and hereby give your consent for Contrast Security, and/ or our HR-related Service Providers, to use this information for the purpose of processing, evaluating and responding to your application for current and future career opportunities. Contrast Security is an equal opportunity employer and our team is comprised of individuals from many diverse backgrounds, lifestyles and locations."}