{"jobID": "2695496441", "jobLocation": "Romulus_MI", "jobTitle": "Analytical Scientist", "companyRating": null, "companyInfo": {"Website": "www.a123systems.com", "Headquarters": "Livonia, MI", "Size": "1001 to 5000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Johnson Controls, Valence Technology, Ener1"}, "estimatedSalary": null, "jobDescription": "Analytical ScientistPosition OverviewThe Analytical Scientists primary responsibility is to support fundamental R&Ds; material research programs that are associated with internal technology development. These programs are key to ensuring that A123 remains the clear leader in low voltage systems while simultaneously advancing high energy density material technologies. The desired candidate will have experience and expertise in the operation and management of several analytical resources. Primary Responsibilities will involve operation and management of analytical resources including but not limited to thermogravimetric analysis / Mass Spectroscopy (TGA/MS), surface area (BET), particle size (PSA), morphology, elemental mapping, and structural analysis techniques (SEM/EDS, XRD). Activities include experimental testing in a controlled environment such as dry room and glove box and collaborating with other research scientist in the team is needed to ensure overall success among R&D; team. Additional responsibilities include data collection, test procedure modification, data analysis and presentation, updating SOPs, and maintaining shared laboratory space.Primary responsibilitiesMaximize analytical capabilities of microscopy and spectroscopy characterization techniques.Perform daily testing, process output data and construct a report of results.Create and maintain internal standard operating procedures (SOPs) for relevant instrumentation.Assist in teardown analysis by performing morphological imaging and analysis using SEM/EDS and XRD; analyzing chemical makeup of materials and contributing to root-cause assessment of failure mechanisms.Trouble shoot and perform optimization of existing processes and devices.Implement new procedures and protocolsPerform other functions as required to support the R&D; operation.Specific Skills/AbilitiesThe position requires:Experienced in the operation and application of SEM/EDS, TGA-MS, PSA, BET, C-analyzer as well as the other spectroscopic and microscopic analysis techniques such as XPS and TEM. The candidate should be able to deeply analyze output data and communicate relevant learnings to stakeholdersThinks analytically - The ability to break down problems, gain understanding, and make effective decisions.Demonstrates an aptitude for independent and creative thinking as well as complex problem solving using innovative approaches.Knowledge of lithium-ion battery manufacture, characterization, and failure analysis is highly desired.Proficiency in data analysis and experimental design utilizing statistical software is preferred.Education/ExperienceM.S. with at least 4 years of experience or PhD with minimum 1 year experience. Degree concentration in analytical chemistry, chemical engineering or a related field with experience in the hands-on use and management of a variety of analytical methods and instruments2+ years of experience in an industrial setting focused on analytical materials characterization.Experience with Li-ion battery manufacturing processes preferred.Experience with material synthesis and the operation of the different processes is a plus"}