{"jobID": "2209435751", "jobLocation": "Los_Angeles_CA", "jobTitle": "SUPERVISING CLINICAL LABORATORY SCIENTIST II", "companyRating": "3.7", "companyInfo": {"Website": "www.lacounty.gov", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1850", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "46", "jobDescription": " Position/Program Information DEPARTMENT OF HEALTH SERVICESFILING DATES: 11/29/2016Until the needs of the service are met and is subject to closure without prior notice.EXAM NUMBER: Y4904MTYPE OF RECRUITMENTOpen Competitive Job OpportunityDEFINITION:Exercises technical and administrative supervision over a single clinical laboratory unit operating three shifts a day or two or more clinical laboratory operating on a single shift. Essential Job Functions Establishes the training objectives with approval of supervisors, and directs the overall planning, coordination, implementation and evaluation of licensed clinical laboratory scientist trainee training in the laboratory units supervised.Designs, develops, and coordinates implementation of a job rotational plan to familiarize laboratory scientists and auxiliary personnel with laboratory operations on all shifts or within individual units.Investigates complaints received from attending physicians directly or through supervisor about specific test results or the overall quality of laboratory service; recommends disposition of complaint to supervisor based on findings and determines what corrective action may be necessary to prevent recurrence of similar complaints in the future.Assists supervisor in the preparation of the annual budget for a multi-unit or a multi-shift laboratory, recommending new or additional personnel and equipment, gathering statistical data and writing justifications to support all requests.Assists supervisor in the development of modification and implementation of policies and procedures for a multi-unit or multi-shift laboratory organization to enhance overall operational effectiveness.Inspects laboratory operations and analyzes workload on all shifts in all units to assure equitable distribution of personnel and continuing conformity to established quality and safety standards.Establishes and maintains sound working relationships with other health services disciplines and staff service departments, and confers with representatives from such disciplines or departments to resolve problems of mutual concern.Coordinates the establishment and modification of employee work schedules to assure that all laboratory shifts and units are adequately staffed for performance of the anticipated workload. Requirements SELECTION REQUIREMENTS:Option I - Two (2) years of experience as a Clinical Laboratory Scientist II** in an approved laboratory*Option II - One (1) year of experience at the level of a Supervising Clinical Laboratory Scientist I*** functioning as a first line supervisor providing technical and administrative supervision in a clinical laboratory unit of an in-hospital or ambulatory care facility performing standardized tests within a specialty or across specialty lines in an approved laboratory.*SPECIALTY REQUIREMENTS:*Specialized requirements may include:Specialty / SubstituteBiochemistry: In an approved biochemistry laboratory.Hematology: In an approved hematology laboratory.Immunology: In an approved immunology laboratory.Blood Bank: In an approved blood banking laboratory.Microbiology: In an approved microbiology laboratory.Toxicology: In an approved toxicology laboratory.LICENSE:Clinical Laboratory Scientist's license issued by the California State Department of Health Services.PHYSICAL CLASS II:Light: Light physical effort may include occasional light lifting to a 10 pound limit, and some bending, stooping or squatting. Considerable walking may be involved.SPECIAL REQUIREMENT INFORMATION:**Clinical Laboratory Scientist II in the County of Los Angeles is defined as: Assists a supervising laboratory scientist in the operation of a clinical laboratory unit by resolving technical problems and developing recommendations on new or alternative equipment, methods, or materials in addition to performing regular clinical laboratory scientist duties -OR- Assigns, trains, reviews, and participates in the work of a group of clinical laboratory scientists engaged in the performance of a variety of standardized clinical laboratory tests.***Supervising Clinical Laboratory Scientist I in the County of Los Angeles is defined as: Provides technical and administrative supervision for a single shift or an in-hospital or ambulatory care facility clinical laboratory unit performing standardized tests with a specialty or across specialty lines.Applicant must attach a legible photocopy of their Clinical Laboratory Scientist license issued by the California Department of Health Services at the time of filing or within 15 calendar days of filing online.The required license and/or certificate must be current and unrestricted; conditional, provisional, probationary license and/or certificate will not be accepted. Additional Information EXAMINATION CONTENT:This examination will consist of an evaluation of experience based upon application information weighted 100%.Candidates must achieve a passing score of 70% or higher on the examination in order to be added on the eligible register.ELIGIBILITY INFORMATION:Applications will be processed on an \"as-received\" basis and those receiving a passing score will be promulgated to the eligible register accordingly.The names of candidates receiving a passing grade on the examination will be added on the eligible register in the order of their score group for a period of twelve (12) months following the date of promulgation.No person may compete in this examination more than once every twelve (12) months.VACANCY INFORMATION:The eligible register resulting from this examination will be used to fill a vacancies throughout the Department of Health Services as they occur. SPECIAL INFORMATION:Appointees may be required to work any shift including evenings, nights, weekends and holidays.AVAILABLE SHIFT: AnyAPPLICATION AND FILING INFORMATION:APPLICATIONS MUST BE FILED ONLINE ONLY. APPLICATION SUBMITTED BY U.S. MAIL, FAX OR IN PERSON WILL NOT BE ACCEPTED.Apply online by clicking on the \"Apply\" tab for this posting. You can also track the status of your application using the website.All information is subject to verification. We may reject your application at any time during the examination and hiring process, including after appointment has been made. Falsification of any information may result in disqualification or rescission of appointment.Utilizing VERBIAGE from the Class Specification and Selection Requirements serving as your description of duties WILL NOT be sufficient to demonstrate that you meet the requirements. Doing so may result in an INCOMPLETE APPLICATION and you may be DISQUALIFIED. This examination will remain open until the needs of the service are met. Application filing may be suspended at any time with or without advance notice.We must receive your application by 5:00 pm, PST, on the last day of filing.NOTE: If you are unable to attach required documents, you must fax them to (323) 869-0942 or e-mail the documents to the exam analyst within 15 calendar days of filing online. Please include the exam number and the exam title.SOCIAL SECURITY NUMBER:Please include your Social Security Number for record control purposes. Federal law requires that all employed persons have a Social Security Number.COMPUTER AND INTERNET ACCESS AT PUBLIC LIBRARIES:For Candidates who may not have regular access to a computer or the internet, applications can be completed on computers at public libraries throughout Los Angeles County.NO SHARING OF USER ID AND PASSWORD:All applicants must file their applications online using their own user ID and password. Using a family member's or friend's user ID and password may erase a candidate's original application record. DEPARTMENT CONTACTAni Shaboyan, Exam Analyst(323) 914-8251AShaboyan@dhs.lacounty.govADA COORDINATOR PHONE:(323) 869-7124CALIFORNIA RELAY SERVICES PHONE:(800) 735-2922"}