{"jobID": "2754112368", "jobLocation": "Plano_TX", "jobTitle": "Staff Technical Data Analyst - Lead Database Architect", "companyRating": null, "companyInfo": {"Website": "www.intuit.com", "Headquarters": "Mountain View, CA", "Size": "5001 to 10000 employees", "Founded": " 1983", "Type": " Company - Public (INTU) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Square, PayPal, H&R Block"}, "estimatedSalary": null, "jobDescription": " DescriptionCome join Intuit as a Lead Data Architect for our ProConnect Group (PCG) analytics team. We are looking for a strong communicator and a problem solver, who has deep experience in various Big Data Technologies to build out target state of PCG’s data warehouse. Our vision is two-fold: First, to organize and operationalize all of PCG’s data sets in an intuitive analyst friendly way. Second, is to simplify data access to analysts, data scientists and API’s to consume our data.  Can you unleash our analyst horse power? If so, this is the perfect opportunity, to join a talented group in a start-up like environment, working with cutting-edge technologies. Understanding business needs and translating data requirements will be critical to this role. This is a very hands-on player/coach role, and you must be willing to dig in and code at least 50% of the time. PCG is seeking to make a step change with not just organizing data for analysts but also opening up data for all products/systems and API’s.Responsibilities:Lead the migration of Intuit’s consumer data platform to AWSBuild a central data warehouse that connects various touch points from Sales, Marketing, Product, Care and Finance.Strong conflict resolution skills to be able to drive clarify in requirements and move the project forward.Partner with business analysts and engineering to enable decision supportDevelop ETL processes to enable data experts to analyze user behaviors and KPI performanceEnsure data collection is optimized to provide crystal-clear visibility into the impact and value of new initiatives and product releasesBe accountable for developing a comprehensive enterprise data architecture including data lake, data appliance, data warehouse, data movement, decision science platform, etc. componentsStrong understanding data lake approaches, industry standards and industry best practices.  Perform hands on development, coaching and leadership through all project phasesAnalyse requirements & business problems in order to provide data solutions / structures to deliver solutions that address themProviding guidance on suitable options, designing, and creating data pipeline for the analytical solutions data lake/data warehouses to specific micro servicesDesign ETL jobs based on jointly defined requirements along the data pipelineDesign and build efficient pipeline using open source tools, packages, Unix Shell ScriptsQualifications10+ years of experience in enterprise data architecture8+ years of experience in Conceptual/Logical/Physical data modelingExperience in modeling solutions in AWS – Redshift (Hive knowledge preferred)10+ years of proven expertise in Relational and Dimensional Data Modeling5+ years of experience with Erwin Data modeling toolStrong understanding of cloud architecture, specifically AWS, as it relates to data processing (i.e., EC2, S3, Redshift, etc.)Able to define & maintain BI/Data Warehouse methodologies, standards, and industry best practicesExperience leading and architecting BU wide initiatives, specifically system integration, data warehouse build, data mart build, data lakes, etc. for a large enterpriseAble to confidently express the benefits and constraints of technology solutions to technology partners, stakeholders, team members, and senior levels of managementProactive and inquisitive learner... seeks out and capitalizes on opportunities for change that enhance the business, rather than reacting to circumstancesDemonstrated ability to think end-to-end, manage long-term projects and manage multiple tasks simultaneously, and deliver on outcomes / achieve resultsBias for action. High energy, “can do” style that thrives in a fast-paced environmentKey Supporting Competencies:Creates Collaborative RelationshipsCommand skills / Decision QualityDealing with AmbiguityTechnical leadership and strategic direction for data and analytics teams.Ability to accomplish results through others, particularly by establishing relationships, and being an effective team member or business partner.Key Technology Skills:Enterprise Data ArchitectureAWSRedshiftDimensional ModelingSQL TuningETL ArchitectureData MigrationPerformance Tuning Imagine a career where your creative inspiration can fuel BIG innovation. Year-over-year, Intuit has been recognized as a best employer and is consistently ranked on Fortune's \"100 Best Companies To Work For\" and Fortune World's \"Most Admired Software Companies\" lists. Immerse yourself in our award winning culture while creating breakthrough solutions that simplify the lives of consumers and small businesses and their customers worldwide.  Intuit is expanding its social, mobile, and global footprint with a full suite of products and services that are revolutionizing the industry. Utilizing design for delight and lean startup methodologies, our entrepreneurial employees have brought more than 250 innovations to market – from QuickBooks® and TurboTax®, to GoPayment, Mint.com, big data, cloud (SaaS, PaaS) and mobile apps. The breadth and depth of these customer-driven innovations mean limitless opportunities for you to turn your ingenious ideas into reality at Intuit.  Discover what it's like to be part of a team that rewards taking risks and trying new things. It's time to love what you do! Check out all of our career opportunities at: careers.intuit.com. EOE AA M/F/Vet/Disability  Intuit will consider for employment qualified applicants with criminal histories in a manner consistent with requirements of local law."}