{"jobID": "2819102109", "jobLocation": "San_Jose_CA", "jobTitle": "Senior Laser Scientist (Research Scientist, Principal)", "companyRating": "3.0", "companyInfo": {"Website": "www.lumentum.com", "Headquarters": "Milpitas, CA", "Size": "1001 to 5000 employees", "Founded": " 2015", "Type": " Company - Public (LITE) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "89000", "jobDescription": " Lumentum (NASDAQ: LITE)is a market-leading manufacturer of innovative optical and photonic productsenabling optical networking and commercial laser customers worldwide. Lumentum's optical components and subsystems are part of virtually every typeof telecom, enterprise, and data center network. Lumentum's commerciallasers enable advanced manufacturing techniques and diverse applicationsincluding next-generation 3D sensing capabilities. Lumentum isheadquartered in Milpitas, California with R&D;, manufacturing, and salesoffices worldwide. For more information, visit www.lumentum.com.  Lumentum is anEqual Opportunity Employer, EOE/Minorities/Females/Veterans/Individuals withDisability  Lumentum's Commercial Lasers R&DOrganization; is seeking a creative, highly motivated optical engineer orscientist to work on the development of novel kW or ultrafast lasertechnologies. The position entails a range of responsibilities includingconception, fabrication and test of new laser designs and components, projectmanagement of small teams, and generation of new IP. The successful candidatewill be able to work both independently and in a team in a structured,fast-paced R&D; environment. S/he will report to the Director ofAdvanced Technologies.  Duties and responsibilities Analysis of new laser conceptsthrough theoretical and/or computational models.Fabrication and detailedcharacterization of prototype lasers and/or frequency-conversion stages.Development and/or characterizationof critical laser components.Evaluation and improvement ofcurrent processes and components.Preparation of documentation bothfor internal R&D; use and for transfer of products to manufacturing.Generation and documentation ofnew IP.Participation in project planning,data reviews, design reviews, and strategic planning.Work with cross-functional projector problem-solving teams, including optical, electronics, mechanicalengineering, project management, and operations staff. Required Qualifications Ph.D. with specialization inphysics or optics, and relevant work experience.Hands-on experience with lasersystems, preferably including fiber lasers and frequency-conversion stages.Understanding of and experiencewith basic optical elements, including lenses, mirrors, polarizers, apertures,and optical filters, as well as basic optical design and system alignmenttechniques.Experience with opticaldiagnostics and test equipment for characterizing the spatial, spectral, and temporalcharacteristics of laser systems (power meters, optical spectrum analyzers,imaging equipment, beam quality test equipment, etc.).Experience with standardlaboratory test equipment (oscilloscopes, function generators, power supplies,etc.).Excellent communication skills.U.S. Citizenship or PermanentResident Status.Track record showing initiativeand creativity in executing assignments. Desired qualifications Basic understanding of opticalfibers and fiber-processing equipment, such as splicers and cleavers.Experience with high-power lasers.Experience with data acquisition,preferably using LabView.Experience with programming ordata analysis, including commercial software packages.Familiarity with optical softwarepackages (e.g. Zemax).Familiarity with basicelectronics. '74200SDL2017"}