{"jobID": "2837254706", "jobLocation": "Houston_TX", "jobTitle": "Senior Business Systems Analyst – Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.houstonisd.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1923", "Type": " School / School District", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": " Senior Business Systems Analyst – Data Analyst JobID: 52818 Position Type:Closing Date: 08/28/2018  Technology Professionals/Business Systems Analyst Date Posted: 6/28/2018  Department: Information Assessment & Analytics Date Available: 06/28/2018 Location:Area:Job Category: Hattie Mae White Bldg. Northwest Technology Professionals Job Code:Contract Type:Months: 30003572 None 12 Salary Minimum:Salary Maximum: $66,752 $88,447 Attachment(s): Senior Business Systems Analyst – Data Analyst (IA)- IT0145Position Title: Senior Business Systems Analyst – Data Analyst (IA)Contract Length: 12 MonthsDate: 09/18/12Date of Last Revision: 08/11/17Job Code: IT0145Pay Grade: T12FLSA Status: ExemptJob Family – Information TechnologyJOB SUMMARY: The team’s primary products include: An Enterprise Data Warehouse; business intelligence dashboards and reports used by thousands of teachers, principals and administrators; a ‘Power User’ Reporting Environment; and integrations to/from internal and external systems.Responsible for facilitating business process, function and organization design, working collaboratively with business strategists, process owners and subject matter experts. The role focuses primarily on business requirements, workflow and leveraging technology to enable or alter business processes or practices. Provide strategic consultation to assigned line-of-business (LOB) customers in defining or designing business processes, functions and organizational structures, as well as in researching, identifying and internally marketing enabling technologies based on customer requirements. Analyzes complex business problems to be solved with automated systems. Provides technical expertise in identifying, evaluating and developing systems and procedures that are cost effective and meet user requirements. Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions.Expected to know the business better than a normal business person since this position will be working across the business and have specialized analytical skills. Using business process engineering skills. expected to develop business requirements; do business analysis; understand and analyze the competitive situation; understand business practices and approaches; recommend business process changes; understand how to integrate systems and business possesses; drive their work into systems initiatives; lead system selection processes; understand business organization, politics and culture; manage change in the business resulting from IT applications; help users develop processes, procedures, and training; exercise any required project management. Develops and recommends solutions and strategies, based on the analysis of customer business goals, objectives, needs, and existing systems infrastructure. Analyzes complex business problems to be solved with automated systems. Provides technical expertise in identifying, evaluating and developing systems and procedures that are cost effective and meet user requirements.Use of this job family outside of centralized IT requires approval from the Chief Technology Information Officer.MAJOR DUTIES & RESPONSIBILITIES: List most important duties first1. Works with key stakeholders to develop and document business requirements/specifications.. 2. Conducts business analysis; reviews design documents, tests strategies, and tests cases to ensure alignment with requirements; understands educational business practices.3. Translates high-level business requirements into technical specifications.4. Evaluates information gathered from multiple sources and works with stakeholders to reconcile conflicting information.5. Plans/executes unit, integration and acceptance testing.6. Identifies/evaluates potential risks and translates abstract or high-level information into actionable documentation.7. Conducts project management activities including business case development and organizational change management.8. Multi-tasks; productively and accurately contributes to multiple concurrent projects of varying scope and complexity with minimal supervision.9. Performs other job-related duties as assigned.EDUCATION: Bachelor&apos;s Degree or equivalent, relevant work experience of 4 years in addition to the minimum experience requirement of 7 years; Master’s Degree preferredWORK EXPERIENCE: 7+ years as an IT, research or evaluation professional with at least 7 years’ experience in data management or process improvement, K - 12 education experience highly preferred, Experience analyzing and documenting business requirements, Information management and educational data analysis experience in identifying key performance indicators, Experience with various SDLC techniques including Agile/Scrum, Experience with BI tools such as IBM Cognos, Experience working with internal and external customers (vendors, users, SMEs), Experience working with end-users to develop business requirements; conducts business analysis including analyzing the complete situation, understanding business practices and approaches and recommending business process changesTYPE OF SKILL AND/OR REQUIRED LICENSING/CERTIFICATION: Information management and educational data analysis experience in identifying key performance indicators, Knowledge of leading practices in promoting effective data usage, Strong organizational, problem-solving and relationship management skills, Understanding of enterprise data warehouse and BI principles, Strong technical skills including SQL querying using MS SQL Server, Team player with strong verbal and written communication skills from both functional and technical perspectives, Completion of IT certifications in related areas preferredLEADERSHIP/SUPERVISORY RESPONSIBILITIES: No supervisory or direct people management responsibilities. Senior level positions are expected to provide work guidance, technical advice, training, and mentoring to other employees. These positions are expected to share information with less senior positions as they help them develop their skills.WORK COMPLEXITY/INDEPENDENT JUDGMENT: Work is substantially complex, varied and regularly requires the selection and application of technical and detailed guidelines. Independent judgment is required to identify, select, and apply the most appropriate methods as well as interpret precedent. Position regularly makes recommendations to management on areas of significance to the department. Supervision received typically consists of providing direction on the more complex projects and new job duties and priorities.BUDGET AUTHORITY: Compiles and organizes data and figures.PROBLEM SOLVING: Decisions are made with greater freedom and discretion, including recommendations that are subject to approval on matters that may affect multiple departments across HISD. Job is frequently expected to recommend new solutions to problems, to improve existing methods/procedures/services and generate new ideas. May also review decisions made by other individuals on more routine matters.IMPACT OF DECISIONS: Decisions have significant impact to the facility/department or division, causing increased satisfaction or dissatisfaction; producing efficiencies or delays; promoting or inhibiting personal intellectual or professional development; and/or contributing to financial gain or expense. Errors may be serious, usually not subject to direct verification or check, causing losses such as improper cost calculations, overpayment or improper utilization of labor, materials or equipment.COMMUNICATION/INTERACTIONS: Negotiate and influence – interprets department strategies and services, resolves conflicts, influences outcomes on matters of significance for the division, conducts final negotiations and coordinates approvals/decision making below the executive level. Interactions are typically with customers and Top Management.CUSTOMER RELATIONSHIPS: Regularly assesses and diffuses complex, and escalated customer issues. Takes personal responsibility and accountability for solving systemic customer service problems. Regularly explores alternative and creative solutions to meeting the needs of the customer within HISD&apos;s policies and guidelines.WORKING/ENVIRONMENTAL CONDITIONS: Work is normally performed in a typical interior work environment which does not subject the employee to any hazardous or unpleasant elements. Repetitive motion: Substantial movements of the wrists, hands, fingers, and/or upper body for sustained periods of time, including using extremities to drag, push, pull or grasp. Sitting: Particularly for sustained periods of time. Work is normally set to specified shifts. This position is expected to be goal and customer service focused. During times of emergencies, outages and project planned work; employees are expected to be on call and available until the event is addressed. During system conversions, extra effort may be required in order to ensure the roll out of the system is successful."}