{"jobID": "2794767570", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.lendup.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "136000", "jobDescription": " LendUp is a financial-technology company which offers credit products, financial education and a path to financial well-being for the 56% of the U.S. population who are currently shut out of mainstream banking because of poor credit or volatile income. Thats a lot of deserving, hardworking people.  Our mission is to provide anyone with a path to better financial health. Being a socially responsible lender is a big job, but were more than up to the challenge. Now in our fifth year, were growing rapidly as we continue to bring our mission to life. Join our exciting team and help us turn our mission into a movement.  LendUp is headquartered in downtown San Francisco, CA with an office in Richmond, VA. Were backed by prominent Silicon Valley investors including Y-Combinator, Google Ventures, Susa Ventures, Data Collective, Kleiner Perkins, Andreessen Horowitz Seed Fund, Kapor Capital, QED, Eagle Cliff Investors, Yuri Milner, Thomvest Ventures, and many others. About the role: Youll be responsible for the models and analyses that power decisions at the core of LendUps offering of financial services: Marketing, Credit Risk, Customer Value, Customer Management, Operations and more. We want you to develop and apply the best modeling and analytical techniques and help us find a way to help the tens of millions of Americans banks wont lend to. You will:Apply advanced machine learning modelling and statistical techniques and extend them to our unique real-world circumstancesWork on every aspect of the modeling problem: data wrangling, feature engineering, target definition, model -specification, -estimation and -comparison, performance evaluation, policy development, implementation and monitoringWork collaboratively with our credit and growth teams as well as our engineers to drive end-to-end implementation and business outcomesLearn from some of the smartest and most experienced data scientists and engineers in the worldYou have:A deep understanding of statistical and machine learning methodsSolid programming skills in Python (scikit-learn, Pandas, NumPY), R or similar data science languageKnowledge of how to maximize the use of modeling and production infrastructureFamiliarity with GIT, SQL and working with both structured and unstructured dataPrevious experience of applying statistical and machine learning methods to data science problems of significant size in a data science roleThe ability to apply your understanding of financial, market, regulatory and process drivers to develop appropriate solutionsThe ability for analytical thinking, are driven to learn fast, be creative, and win as a teamWe have: LendUp has all the things youd expect from a mission-driven company, like a competitive salary; early stage equity; 100% company paid medical, dental and vision insurance; generous vacation/sick leave policy; catered, free lunch; kitchens fully stocked with healthy snacks; 401(k). But heres what we really love about LendUpLife:Our dog-friendly SF officeOur commitment to a diverse and inclusive culture that spurs innovation and creates a meaningful and impactful work environmentThat we have fun together at our weekly happy hours, quarterly team building events, company-sponsored volunteerism, hackathons, and sports teamsThat we live our value of different backgrounds, same mission. We are passionate participants in our employee resource groups (LeanIn, LGBTQ & Allies, and Black Ladders...) and have slack channels dedicated to everything from philosophy to sports to hip hopLendUp is an Equal Opportunity Employer We extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition, or any other reason protected by law."}