{"jobID": "2814498653", "jobLocation": "Troy_MI", "jobTitle": "Valuation & Business Analytics Manager", "companyRating": "3.5", "companyInfo": {"Website": "www.bdo.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1910", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": "Auto req ID 12676BR Posting Title Valuation & Business Analytics Manager Address 1 2600 W. Big Beaver Road Address 2 Suite 600 City Troy State Michigan Zip Code 48084 Job Summary BDO’s Core Purpose is Helping People Thrive Every Day. Our Core Values reflect how we manage our work, our relationships and ourselves. As an employee of the firm, you will live true to our Core Values of people first, being exceptional every day in every way, embracing change, feeling empowered through knowledge and choosing accountability. Our Core Values are the standards by which we conduct ourselves day in and day out, both internally and externally.  The Valuation and Business Analytics Manager is responsible for leading, executing and delivery of challenging valuation engagements by participating in all aspects of projects, from the initial proposal preparation, through project completion. In this role, the Valuation and Analytics Manager is actively engaged in the management of business valuation assignments and managing staff in the development of such assignments. In addition, the Valuation and Business Analytics Manager will be charged with assisting with business development activities and appraisal reviews. Qualifications Education: Bachelors degree in Accounting, Finance, Economics or other relevant field requiredMasters in Business Administration preferredExperience:Five (5) to seven (7) years of business valuation experience in a Big 4 or national basis requiredSignificant experience in business valuation and intangible assets requiredPrior experience in financial reporting valuation and appraisal reviewLicense/Certifications:CPA, CFA, AM, ASA or other valuation industry credentials preferredSoftware:Proficient in the use of Microsoft Office Suite, specifically Excel, PowerPoint and WordPrior experience with Capital IQ and Bloomberg preferredOther Knowledge, Skills & Abilities:Superior oral and written communication skillsSuperior analytical and research skillsSolid organizational skills especially ability to meet project deadlines with a focus on detailsAbility to successfully multi-task while working independently or within a group environmentProven ability to work in a deadline-driven environment and handle multiple projects simultaneouslyCapable of effective managing a team of valuation professionals and delegating work assignments as neededCapacity to build and maintain strong relationships with internal and client personnelAbility to encourage team environment on engagements and contribute to the professional development of assigned personnelExecutive presence and ability to act as primary contact on assigned engagementsAbility to successfully interact with professionals at all levelsAbility for intermittent travel within the US and internationally required"}