{"jobID": "2788067763", "jobLocation": "Pleasanton_CA", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.ascent-sys.com", "Headquarters": "Houston, TX", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "68000", "jobDescription": "Please contact Meera Makam at 925 627 4935 or email mmakam@ascentsg.com for any questions  Day to Day Responsibilities of this Position and Description of Project:  Analyze and document all aspects (process and data flows) of several time consuming manual processes whose function is to obtain and assemble data that is used as input into the calculation of incentives as well as sales/management reporting.  The processes are sourcing information from external systems (including NetX360/Pershing and Salesforce). Utilizing the user interfaces of these systems, transactions are manually inspected and evaluated to determine some key data attributes.  ? Document the current processes, (sources, inputs, outputs, business logic, etc.), for extracting and assembling the data and the creation of outputs.  ? Define and document all the data that is extracted from the various systems, including the relationships between the data.  ? Understand and document all business logic required to use the data.  The analysis will encompass both process and data flows, and will identify opportunities for process improvement and automation.  Experience with financial services and brokerage (business and data) is preferred, but not required.  Please contact Meera Makam at 925 627 4935 or email mmakam@ascentsg.com for any questions  ?Company Description:About Ascent:  Ascent is a leading national technology consulting and professional services firm that focuses on tactical and strategic consulting. Ascent’s fundamental business is providing staffing services to Large Enterprise clients in our core market verticals: Financial Services, Healthcare, and Life Sciences. We focus the majority of our efforts in Staff Augmentation support of Large Enterprise Clients who utilize a Vendor Management System. Ascent works as both a reliable supplier in support of programs, as well as a Strategic Advisor in support of enterprise efforts to establish best in class preferred vendor programs. Ascent was ranked in the 2007 and 2008 Inc. 500 and recognized specifically for its innovative work in staff augmentation support of Large Enterprise preferred vendor accounts.  If you are ready to propel your career to new heights… read on. We are looking for talented and dedicated colleagues to join our phenomenal team. At Ascent, we have created an environment where culture, commitment and opportunity converge to yield a truly unique place to work. We know that every employee has something important to say and that every employee is integral to our success. Where else can you walk over to a founder and talk about your ideas to help build our business and have that idea implemented in 48 hours? More importantly, we do everything we can to make sure our employees not only have great jobs, but great lives."}