{"jobID": "2815614589", "jobLocation": "Detroit_MI", "jobTitle": "Entry Level-Digital Advertising Sales - Relocate to Chicago", "companyRating": null, "companyInfo": {"Website": "www.yelp.com", "Headquarters": "San Francisco, CA", "Size": "5001 to 10000 employees", "Founded": " 2004", "Type": " Company - Public (YELP) ", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Google"}, "estimatedSalary": null, "jobDescription": "Yelp was created to connect people with great local businesses. As an Account Executive, you'll be working directly with these local businesses to help them achieve their goals through Yelp’s advertising programs. You'll provide a consultative approach to every sale and work with each client to determine their business's needs and aspirations, because we succeed when we help our clients grow their businesses.In this role, you will be directly responsible for selling advertising space on Yelp to local businesses across the US and Canada. Success in this role is measured by hitting and exceeding monthly sales goals, consistently staying ahead of daily metrics, and handling rejection in stride, all in a team-focused environment.What You’ll Do Own and manage a pipeline of clients ranging from dentists to florists to restaurant ownersConsult, educate, strategize, and successfully sell Yelp advertising programs through a high volume of sales calls - strong communication and tenacity are key!Become an expert in Yelp’s advertising solutions, and adapt product recommendations quickly to suit client needs - asking probing questions and handling objections will be critical to your successAchieve and consistently exceed monthly sales goalsWhat We’re Looking For in You You have an appetite for learning! You’re keen on turning training and feedback into action and continuous self-improvementYou are committed to a high standard of integrity and work ethicYou’re an excellent listener, assertive, persistent, and persuasive - show us your grit!You are genuinely curious about people, local businesses, and possess the innate ability to inspire passion in othersYou are adaptable and can think on your feet. When faced with new challenges, or tough conversations, failure simply isn't an optionMust-Haves Bachelor’s degree or 3+ successful years in high volume salesExcellent communication skills - no fear of the phoneGeneral computer and email proficiencyPositive attitude and a drive to winAbility to effectively prioritize tasks and manage time within a fast-paced environmentMust be able to work legally in the USTraining and Development Comprehensive initial two month training with ongoing career development support and opportunities through the Yelp Sales Development Program*Learn industry-leading communication and sales techniques that will enable you to find solutions for your clients and close dealsGain extensive knowledge of the industry’s leading CRM tool, SalesforceTrain with current top producers and improve daily with feedback and experienceBecome an expert in internet advertising and the world of SMBThe Yelp Sales Development Program provides a transparent path for professional growth by outlining what you need to be doing every day, month, and quarter to reach the next level in our sales organization. As you progress through YSDP, you will be eligible for increases in compensation, title, and responsibilities, which will keep your career moving in the right direction.Compensation/Benefits Effective your first day: Full medical, vision, and dental (100% paid employee-only coverage)15 days PTO and 11 paid holidays (per year)6 weeks paid parental leave plus up to 6 weeks paid pregnancy disability leaveMonthly wellness subsidyAccess to fully stocked Yelp kitchensFlexible spending account401(k) retirement savings plan with up to $1,000 matching per yearEmployee stock purchase planThink you have what it takes to be an Account Executive at Yelp? Send us your cover letter and resume today. Don’t forget to keep it useful, funny, and cool!LI-RR2"}