{"jobID": "2582424045", "jobLocation": "Washington_DC", "jobTitle": "Sales Director, Department of Defense (DoD)", "companyRating": null, "companyInfo": {"Website": "www.synack.com", "Headquarters": "Redwood City, CA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Synack is redefining how organizations do security. We crowdsource ethical hackers from around the world and empower them with \"smart\" technology to create a solution for today's growing and ever-evolving cybersecurity demands. We are passionate about making the world more secure and our mission is to proactively help organizations defend against cyber attacks before they get breached. How do we do it? By building a team that isn't afraid to think outside the box or take on big challenges. Imagine the possibilities at Synack - a company that CNBC named to their elite Top Disruptor list in 2015, again in 2016, and yet again in 2017. #threepeat.  Our adoption within the government has been explosive and as a result we are currently looking to expand our team. We are seeking a seasoned sales professional to manage and drive sales engagements within the Department of Defense (DoD). This role will require management of existing contracts and focus on territory development of new pipeline and successful deal negotiations with target agencies. In this position, you will own your territory, generating demand while delivering winning proposals, contract bids, statements of work, and RFI/RFP responses. In this role, you will:Win and manage major accounts within your territoryConsistently forecast and attain quarterly and annual goals and quota targetsManage prospect/customer engagements, evaluations, and RFI/RFPsEffectively communicate and demonstrate the value of Synacks offering to the Federal governmentPresent effectively and articulately to C level executives and other key stakeholdersLead sales strategy sessions for named accounts while contributing to and coordinating accurate production of account plans, the execution of account plans, business case preparation, appropriate contract presentation, and the effective delivery of all account plan activitiesCollect and communicate marketing requirements and competitive data, including pricing, feature needs, and value proposition strategies to product stakeholdersConsistently demonstrate strong product knowledge and ability to articulate our value proposition within your territoryMaintain real-time, accurate forecasts within the utilized sales forecasting toolPerform travel within the territory to develop, nurture and manage accountsTo succeed in this role you need:8+ years of proven Department of Defense field sales experienceDirect selling expertise with a 'hunter' mentalityStrong understanding of the government sales processesAbility to clearly articulate field issues and concerns to management and support groups to drive rapid resolutionInstinctive understanding of customer service and satisfaction, with ability to manage bothKnowledge of cyber security requirements for large government environmentsStrong acute listening and sales skillsBS/BA or higher-level degree in relevant fieldExcellent business writing and presentation skillsIts all hands on deck, its hard work, its winning, its Synack. Join us!Synack is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status."}