{"jobID": "2822551797", "jobLocation": "Houston_TX", "jobTitle": "Principal Institute Research Scientist - Drug Discovery, Biology & Translation", "companyRating": "4.0", "companyInfo": {"Website": "www.mdanderson.org", "Headquarters": "Houston, TX", "Size": "10000+ employees", "Founded": " 1941", "Type": " Hospital", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": " The Principal Research Scientist applies extensive biology and drug development expertise to oversee cross-functional research teams that are tasked with identifying and validating novel oncology targets, and then apply deep biology insights to then translate these finding to position novel oncology therapeutic agents in contexts that maximally benefit patients.  The mission of The Center for Co-Clinical Trials (CCCT) is to integrate biological insights with drug discovery expertise to accelerate the development of innovative targeted cancer therapeutics. The CCCT is a ground-breaking translational research team that partners with world-class drug discovery scientists at the IACS along with their industry-modelled in vivo pharmacology unit and state-of-the-art computational biology infrastructure. CCCT’s cross-functionalteams aim to deliver biological insights regarding genetic and functional contributions that influence tumor response to novel therapeutic agents or regimens. As part of the MD Anderson Cancer Center Moon Shots initiative, the capabilities of the CCCT, in concert with IACS, support the institution’s academic and clinical research programs to help us reach our goal of delivering safer, more effective treatments to our patients.  Salary Range Min $129,000 - Mid $161,000 - Max $193,000  KEY FUNCTIONS:  1. Principal Research Scientist applies expert knowledge of tumor biology in areas such as immune oncology, oncogenic signaling, metabolism, epigenetics and/or DNA damage to enable target discovery, validation and drug development.  2. Oversee and/or lead multiple cross-functional research drug discovery and development programs.  3. Lead collaborations with computational biologists utilizing patient-centric –omic databases to identify deregulated contexts that inform on target discovery, target validation and translational biology efforts in defined tumor contexts.  4. Oversee the design, execution, analysis and interpretation of in vitro, ex-vivo and in vivo experiments to validate targets, optimize compound selection and explore therapeutic potential of drug targets.  5. Apply knowledge of pharmacology to enable in vivo assessment of chemical matter and establishment of pharmacodynamics, pharmacokinetic and efficacy relationships.  6. Lead drug discovery biology efforts to enable selection of lead candidate molecules.  7. Apply expertise to lead the discovery, validation and development of cell and molecular assays to define mechanism of action, measure pharmacodynamic changes and select patient responder populations.  8. Lead program biology efforts to enable clinical positioning of developmental candidates.  9. Develop and lead strong collaborative relationships with internal and external groups.  10. Manage activity of direct reports and project teams.  11. Interpret, present and report research findings at internal meetings and external scientific conferences.  12. Evidence of independent thinking and leadership skills are vital. Ability to work well under pressure and drive projects that impact critical timelines is essential  Education  Required: PhD in one of the natural sciences or related field or Medical degree.  Experience  Required: Seven years experience of relevant research experience in lab.  Ideal Candidate will possess the following:  1. MD or PhD with over 7 years of relevant post-degree experience in a pharmaceutical/biotech environment.  2. Evidence of utilization of cancer genomics to inform on target discovery, validation and/or clinical positioning of development drug candidates.  3. Experience with genetic (ie RNAi and cDNAs) and pharmacological (i.e. small molecule inhibitors or antibodies) approaches to study target biology utilizing biochemistry, cellular and molecular biology methods and assays to drive program biology.  4. Experience utilizing mouse models of cancer to enable target discovery, validation, drug development and/or translational biology.  5. Experience working with chemists, in vitro and in vivo pharmacologists to develop and utilize assays in support of the development of small molecules for target validation and as part of lead optimization.  6. Extensive knowledge and experience in areas of tumor biology including, but not limited to immune oncology, oncogenic signaling, cancer metabolism, epigenetic deregulation, apoptosis and/or DNA damage and repair as evidenced by publication in peer-reviewed journals.  7. Strong data analysis skills, ability to interpret results, design of follow-up experiments, troubleshoot issues with assay performance, and effectively present results and conclusions to co-workers, collaborators and senior leadership.  8. Evidence of leading multi-functional teams of scientists to deliver on program objectives.  9. Evidence of independent thinking and leadership skills.  It is the policy of The University of Texas MD Anderson Cancer Center to provide equal employment opportunity without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, disability, protected veteran status, genetic information, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law."}