{"jobID": "2527711229", "jobLocation": "Livonia_MI", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.trinity-health.org", "Headquarters": "Livonia, MI", "Size": "10000+ employees", "Founded": " 1976", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " HCA Healthcare, Vanguard Health Systems"}, "estimatedSalary": "96000", "jobDescription": "Department: IN301_60055 Health Informatics Expected Weekly Hours:40Shift: Day Shift Position Purpose:Job Description Details:POSITION PURPOSE Serves as a business intelligence consultant in analyzing data, particularly large sets of data, in order to assist Trinity Health with Population Health, Value Management and other strategic initiatives. Contributes and participates in projects with Data Governance, Data Warehouse and Advanced Analytics teams. Assists Trinity Health customers with various financial and clinical analyses and research, along with participating in various special projects. Develops an analytical skill set to solve multiple business problems, creating and implementing data driven strategies to support Population Health, Value Management and other key initiatives for Trinity Health. Position incumbents are expected to be comfortable working in the capacity of a software engineer and a quantitative researcher. ESSENTIAL FUNCTIONS AND RESPONSIBILITIES Applies statistical techniques and quantitative methods in reviewing Trinity Health data, to develop scorecards, population health analyses, benchmarking studies, and other clinical and financial analyses. Utilizes regression analysis, decision trees, segmentation, and simulation in support of statistical analysis. Utilizes quantitative techniques and models to identify improvement opportunities and quality measures. Participates in System-wide complex projects and lead small projects as needed. Conducts benchmarking studies and other research and provides value added analyses and summaries. Assists in performing clinical analyses including quality measures, improvement of the care experience, etc. Assists in development of strategic and tactical conclusions from data review and analyses in order to make recommendations to senior leadership in an easy to understand communication format. Assists in the research of existing methods and new approaches for statistical and computational analysis and modeling of clinical and financial data. Participates in leveraging selection procedures to distill through large datasets in order to identify crucial pieces of information. Collaborates with members of various TIS teams, including Advanced Analytics, Data Warehouse Data Governance, and Clinical etc., to provide them with the results of data analyses. Executes recurring data mining and process activities that provide the foundation for key analytic capabilities. Assists in the translation of data mining activities into actionable business information. Participates in the development and implementation of sophisticated financial models. Builds strong relationships internally and collaborate effectively on cross-functional teams. Develops a trusted relationship with customer contacts through effective communication and efficient, quality execution of analyses and projects. Maintains a working knowledge of applicable Federal, State and local laws/regulations; the Trinity Health Integrity and Compliance Program and Code of Conduct; as well as other policies and procedures in order to ensure adherence in a manner that reflects honest, ethical and professional behavior. MINIMUM QUALIFICATIONS Bachelor’s degree in Computer Science, Engineering, Statistics or other technical concentration or an equivalent combination of education and experience. Advanced degree in a relevant technical field preferred. Three (3) to five (5) years of experience in a relevant technical, analytical or statistical role. Some experience solving analytical problems using quantitative approaches. Familiarity manipulating and analyzing high-volume, high-dimensionality data from varying sources. Strong passion for empirical research and for answering hard questions with data. Ability to provide a flexible analytic approach that allows for results at varying levels of precision. Ability to communicate complex quantitative analysis in a clear, precise, and actionable manner, in a way that can be understood by customers. Familiarity with relational databases and SQL. Knowledge of an analysis tool such as R, Matlab, or SAS is desired. Experience working with large data sets, and/or experience working with distributed computing tools a plus (Map/Reduce, Hadoop, Hive, etc.) is desired. Excellent Microsoft Office skills, particularly in Excel, well organized and detail oriented. Strong written and verbal communication skills, ability to respond to all communications effectively and in a timely manner. Strong analytical and integrative skills including ability to formulate conclusions and identify trends from data in a logical and systematic manner. Ability to ask the right questions and seek help where appropriate. Flexibility and ability to diagnose and resolve issues; strong client service orientation. Leadership qualities preferred. Ability to work both independently and on client teams and enjoy a fast-paced environment. Self-starter and interest in continually challenging oneself and willingness to step outside of one’s comfort zone. Interest and ability to think beyond the task at hand and understand how one’s work fits into the broader landscape. PHYSICAL AND MENTAL REQUIREMENTS AND WORKING CONDITIONS Position operates in a typical office environment. The area is well-lit, temperature-controlled and free from hazards. Incumbent communicates frequently, in person and over the telephone, with people in a number of different locations on technical issues. Manual dexterity is needed in order to operate a keyboard. Hearing is needed for extensive telephone and in person communications. The environment in which the incumbent will work requires the ability to concentrate, meet deadlines, work on several projects at the same period and adapt to interruptions. The incumbent must be capable of traveling in the course of completing project assignments. Must be able to set and organize own work priorities, and adapt to them as they change frequently. Must be able to travel to the various Trinity Health sites as needed (may or may not apply). Trinity Health's Commitment to Diversity and Inclusion Trinity Health employs more than 120,000 colleagues at dozens of hospitals and hundreds of health centers in 21 states. Because we serve diverse populations, our colleagues are trained to recognize the cultural beliefs, values, traditions, language preferences, and health practices of the communities that we serve and to apply that knowledge to produce positive health outcomes. We also recognize that each of us has a different way of thinking and perceiving our world and that these differences often lead to innovative solutions.  Trinity Health's dedication to diversity includes a unified workforce (through training and education, recruitment, retention and development), commitment and accountability, communication, community partnerships, and supplier diversity."}