{"jobID": "2826579643", "jobLocation": "Woodland_Hills_CA", "jobTitle": "Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.amerihome.com", "Headquarters": "Woodland Hills, CA", "Size": "201 to 500 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " PennyMac, U.S. Bank"}, "estimatedSalary": "63000", "jobDescription": " AmeriHome Mortgage has grown quickly to become one of the top 10 mortgage lenders in the U.S. We operate in a dynamic and data-driven environment where information drives action. We are seeking an analyst who enjoys data analysis and problem solving to join our Credit Risk Management department. Job Description Analyze raw data to identify trends, data anomalies, and opportunity areas  Perform ad hoc data analysis and data studies for Risk Management utilizing SQL, Excel, and other tools  Develop business requirements for recurring reports including scorecards and monitoring reports  Develop and maintain process controls for Risk Management to mitigate risk and to improve efficiency  Develop ETL solutions to import raw data to multiple databases  Assist in the preparation of effective PowerPoint presentations to share reporting, observations, and recommendations with senior management QualificationsEssential Skills Strong analytical and critical thinking skills with an attention to detail  Proficiency with SQL queries  Strong interpersonal and communication skills, with the ability the translate business terms to technical terms and vice versa  Advanced Excel skills including Pivot Tables, VBA, formulas, lookups, etc.  Demonstrated ability to perform well in a fast-paced environment  Interest in problem solving such as complex puzzles  Proficiency with Microsoft Word, PowerPoint and Visio Desired Experience programming in Java, C#, or Visual Basic  Experience in project management  Training in statistical methods including probability theory and sampling, and the application of these methods through programming Minimum Education/Experience Bachelor’s Degree in a quantitative field including finance, statistics, math, engineering, or physics. Master’s Degree is a plus.  2+ years of reporting or analytics experience. Previous experience in the financial services industry is a plus."}