{"jobID": "2836058055", "jobLocation": "Rahway_NJ", "jobTitle": "Associate Principal Scientist, Computational Chemistry", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Merck is seeking a creative, self-motivated computational chemist with exceptional interpersonal and problem solving skills to join the Modeling and Informatics group in Rahway, NJ. The successful candidate will be primarily supporting programs, in collaboration with Process Research and Development, which relate to crystal structure prediction and solid-state modeling.  Key responsibilities:  Application and development of informatics and modeling tools applied to crystal structure prediction, computational solid-state chemistry, IR, NMR, and formulation  Collaborate with analytical chemistry (materials characterization and formulation groups) on the characterization of chemical entities, and leverage computational modeling to support the prediction and selection of solid form  Advance research in molecular modeling to enhance the drug discovery and development processes  Advance NMR crystallography/solid-state NMR modeling support  Explore formulation modeling of API-polymer interactions and peptide-surfactant systems  Qualifications:  Ph.D. in chemistry, physics, materials science, or a related discipline with a computational emphasis  3 years or more of practical experience (pharmaceutical industry preferred)  Knowledge of crystallography and/or solid-state chemistry and/or solid-state NMR  Strong collaboration and communication skills along and the ability to work well in multidisciplinary teams are essential  Evidence of creative application of computational approaches to problems in solid-state modeling  Strong publication record  Preferred Experience and Skills:  Expertise in the application of quantum mechanics/density functional theory (Gaussian, Jaguar, VASP, etc.) and materials design tools (e.g. Materials Suite from Schrodinger and Materials Studio from Accelrys) for solid-state modeling  Familiar with Cambridge Structural Database and CCDC software applications (Conquest, Mercury, and Mogul), and experience with structural informatics  Proficiency with molecular modeling techniques using modern software packages (Schrodinger, OpenEye, CCG) a plus  Prior experience in the pharmaceutical/biotechnology industry preferred  Experience with scientific programming (Perl, Python, Pipeline Pilot) and data analytics (e.g., Spotfire)  Track record of oral presentations at national or international meetings  Qualifications  Education Minimum Requirement:  Ph.D. in chemistry, physics, materials science, or a related discipline with a computational emphasis  Required Experience and Skills:  3 years or more of practical experience (pharmaceutical industry preferred)  Evidence of creative application of computational approaches to problems in crystal structure prediction or solid-state modeling  Knowledge of crystallography and/or solid-state chemistry  Strong communication skills  Strong collaboration skills  Strong publication record  The ability to work well in multidisciplinary teams"}