{"jobID": "1477713427", "jobLocation": "Buena_NJ", "jobTitle": "Senior Lead Scientist, Product Devleopment", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Summary: The Senior Lead Scientist is responsible for all product development activities for branded and generic sterile products (such as injectable and ophthalmic products manufactured through aseptic processing or terminal sterilization) from feasibility through commercial scale-up. Plan and lead decisions and activities required for the planning and start-up of a new sterile R&D; facility.  Reporting Relationships: 2-4 direct reports  Essential Responsibilities: Represent the product development area in the planning and launch of a new sterile R&D; and commercial manufacturing facility. Lead the design and selection process of laboratory equipment, supplies and other materials required for the new lab build-out, and actively participate in the cross-functional team responsible for validation and initial operation of the facility. Oversee collection of and interpret analytical data from commercial, experimental and Reference Listed Drug (RLD) products. Design, develop and optimize new sterile products, including injectable/ophthalmic products in vials, bottles, ampules and/or syringes, using QbD principles. Identify and select raw materials. Develop and optimize robust manufacturing processes, including aseptic processing and terminal sterilization. Prepare lab-scale formulations and Batch Records. Supervise scale-up and pre-commercial manufacturing. Prepare reports to be incorporated into filings for new products (NDA/PAS/505(b)(2)/ANDA). Prepare and review SOPs, as required. Communicate and oversee the status and project performance of analytical development team (short term) Mentor and lead direct reports, including, in the short term, from the Analytical Development team Coordinate multi-disciplined and inter-departmental activities as a leader in the Product Development Team. Other duties as assigned. Qualifications:Minimum MS in engineering, pharmaceutics or related with at least 5 years industrial experience.Development experience in a sterile environment is required; experience with injectable products is required.Experience in a start-up environment, such as the qualification of a new GMP laboratory, is preferredExperience transitioning development projects from pilot- to commercial-scale is essentialExcellent leadership skills.Ability to communicate with all levels of the organization.Ability to multi-task projects in a dynamic, fast-paced environment with constrained resources.Proven project management skills are required."}