{"jobID": "2820074369", "jobLocation": "San_Francisco_CA", "jobTitle": "Sr. Scientist, Safety Assessment (Immunogenicty Assessment)", "companyRating": null, "companyInfo": {"Website": "www.nektar.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1990", "Type": " Company - Public (NKTR) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Bristol-Myers Squibb, Merck, GlaxoSmithKline"}, "estimatedSalary": null, "jobDescription": "Requirements: Requires a PhD in a relevant scientific discipline (Biology, Immunology, Biochemistry, Chemistry, Cell Biology, etc) with a minimum of 5 years related experience, may include post doctoral experience.  Exceptional non-PhDs with demonstrated capabilities and/or significant experience may also be considered. Understanding of the immune system, antibody assays, and experience with clinical and preclinical studies is required.  Must have in-depth knowledge and hands-on experience in development, execution and troubleshooting of anti-drug antibody assays.  Knowledge of GLP, GCP, Bioanalytical and Immunogenicity Guidance (FDA/EMA) is essential.  Experience working in an FDA regulated environment and knowledge of current GMPs as they apply to laboratory practices are highly desired.  Expert knowledge of methods and immunoassay technologies, such as ELISA (direct and indirect sandwich formats), Luminescence, Colorimetric, Electrochemiluminescence (MSD), etc to support animal and clinical studies. Must be able to compose sound written work. Must possess good oral and written communication skills. Ability to present technical information to both technical and non-technical audiences is required. Must be able to demonstrate sound judgment. Must be goal-oriented, quality-conscientious, and customer-focused. Must be experienced in working in a team-focused environment.  We are an Equal Opportunity Employer and do not discriminate against applicants due to race, ethnicity, gender, veteran status, or on the basis of disability or any other federal, state or local protected class.  Nektar Therapeutics will consider for employment qualified applicants with criminal histories in the manner proscribed by the San Francisco Fair Chance Ordinance."}