{"jobID": "2658080073", "jobLocation": "Charlotte_MI", "jobTitle": "Apparel Sewing Machine Operators", "companyRating": "3.7", "companyInfo": {"Website": "www.peckham.org", "Headquarters": "Lansing, MI", "Size": "1001 to 5000 employees", "Founded": " 1976", "Type": " Company - Private", "Industry": " Non-Profit", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "12", "jobDescription": "Job Description:*These jobs are part of Peckham's vocational rehabilitation efforts. Applicants are eligible to apply for these positions if they have a disability that has created a barrier to employment. Make Clothes That MatterWant to do work that has purpose and meaning? Would you like to take pride in creating American-made quality garments that protect American soldiers? Then a Peckham sewing career is for you!Work independently to meet goals of overall teamStructured and consistent work scheduleProduce clothing and equipment for the militaryMust have a qualified disabilityFull benefits package including health insuranceEarn monthly & quarterly bonuses with opportunities for overtimePaid training to help you advance in your careerWork in clean, open environment with natural lightAt Peckham we offer team members, free English, GED, literacy, citizenship, computer classes, a wellness center & fitness classes, and support services for a wide range of needs and barriers.This entry level Apparel Sewing Machine Operator position is responsible for the accurate alignment of fabric, garments, and materials under needles using marks on machines, clamps, templates, cloth and notches as guides. This position guides garments or garment parts under machine needles and presser foot pedals to sew parts together. This position handles garments; folding, bagging, labeling, using scissors to trim threads, threading and tying hangers, zipper pulls or plastic cord locks.Operate single needle sewing machines to perform basic sewing steps that automatically join, reinforce or decorate material or articles, such as Velcro, webbing, labels or tags. – DailyOperate basic automated and/or bartacking (PLK) machines to perform basic sewing steps that automatically join, reinforce or decorate material or articles, such as Velcro, webbing, cord or labels. – DailyAlign fabric, garments and materials under needles using marks on machines, clamps, templates, jigs, cloth and notches as guides. - DailyAlign material pieces in correct order prior to sewing and verify that dye lots and patterns match. - DailyGuide garments or garment parts under machine needles, clamps, and feet, using presser hand or foot pedals to sew parts together. – DailyPlace cord, spools of thread or other materials on spindles, insert bobbins, thread ends through machine guides and thread needles as necessary. – DailyTrim excess threads from garments after sewing, using scissors, nippers, or automatic trimming machines. – DailySelect supplies such as fasteners and thread to meet job requirements. – DailyPrepare garments for packaging; folding, tagging garments with fastener gun, placing in bags, labelling bags, placing bags in bins. – As NeededInspect garments and check repair tags on garments to locate defects or damage. Repair mistakes or mark quality issues as necessary. – DailyObserve machine operations and identify problems such as defective stitching, breaks in thread or machine malfunctions and report such defects to supervisors or mechanics. – As NeededWork with supervisor towards meeting performance standards. – DailyMaintain a safe and clean work environment. – DailyPractice LEAN principles and 5S concepts – DailySupport ISO-9000 and Peckham, Inc. Quality Management Systems requirements.Support Peckham’s vision, value, culture, and commitment to excellent customer services to all customers and stakeholders. – DailySUPERVISORY RESPONSIBILITIESThis job has no supervisory responsibilities.QUALIFICATIONS To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.LANGUAGE SKILLSAbility to communicate information and ideas so others will understand.MATHEMATICAL SKILLSKnowledge of numbers and the ability to count.REASONING ABILITYAbility to apply common sense and an understanding to carry out instructions provided. PHYSICAL DEMANDS The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this job, the employee is regularly required to sit, use fingers, hands, arms and legs to handle or feel. The employee frequently is required to sit and reach with hands and arms. The employee must frequently lift and/or move up to 10 pounds and occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include color vision.WORK ENVIRONMENT The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The noise level in the work environment is usually moderate.COMMENTS This position will move to other work areas as business requires.Person needs to have the ability to ask questions and voice concerns in relation to work and work environment.Peckham is an equal opportunity/affirmative action employer and is operated in accordance with a policy which does not permit discrimination because of race, color, sex, age, handicap, national origin or any other artificial characteristics.Worker Sub-Type:Team MemberLocation:Charlotte, MIBusiness Line:Apparel and Manufacturing Services TeamsTime Type:Full timeScheduled Weekly Hours:40"}