{"jobID": "2802738803", "jobLocation": "San_Jose_CA", "jobTitle": "Sr. Computer Scientist - JS Front End", "companyRating": "4.2", "companyInfo": {"Website": "www.adobe.com", "Headquarters": "San Jose, CA", "Size": "10000+ employees", "Founded": " 1982", "Type": " Company - Public (ADBE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Apple, Microsoft"}, "estimatedSalary": "165000", "jobDescription": "About the Role: We are seeking a talented senior engineer to join our team at Adobe to work on an exciting, high profile project that improves the user experience across the most popular creative tools. Our goal is to leverage Creative Cloud services and machine learning to enhance and personalize the users' journeys, tailor their workflows, and use machine learning to predict how best to lead new users to early success. We believe in data driven rapid iteration and the intimate familiarity with our users to deliver measurable and long lasting improvements to their success.  You will be joining a high performing agile team that collaborates and works together across all aspects of the product. You must be someone who is highly engaged, motivated and excels at critical thinking and problem solving. You are a JavaScript expert or have the goal to become one. If you are passionate about helping to prototype and implement ground breaking tools and services that will change the way our new users engage with Creative Cloud, Adobe is looking for you! What you’ll do:Help new users fall in love with Adobe toolsInnovate and identify opportunities for personalized experiencesEnhance the onboarding experience of flagship applications as well as define the user journey for next generation productsCollect and interpret analytics to continuously improve the impact of our solutionsParticipate in defining team culture and product visionDevelop efficient solutions that scale for millions of usersWhat you’ll need to be successful:BS degree in Computer Science or equivalent6-12 years experience in front end development using web technologiesExpert knowledge of React.js or similar modern JS frameworkEntrepreneurial spirit and focus on delivering value into customers handsExcellent communication skills and ability to create consensus amongst multiple stakeholdersFocus on data-driven decision making and learning by experimentationAbility to contribute anywhere in the stack and wear multiple hatsIntellectual curiosity with a keen interest in emerging technologiesA commitment to quality with proven record of maintaining your own unit and integration testsPerksThis position is in the SF Bay Area with preference for our beautiful SOMA officeAdobe has a deep commitment to our customers, employees and communityWe foster diverse workplace and inclusive culture At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely.  If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability or veteran status."}