{"jobID": "2804302765", "jobLocation": "San_Francisco_CA", "jobTitle": "Marketing Coordinator", "companyRating": "4.2", "companyInfo": {"Website": "www.webcor.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 1971", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Pankow Builders, Hathaway Dinwiddie Construction"}, "estimatedSalary": "68000", "jobDescription": " Marketing Coordinator Location  CA-San Francisco Department  113-No CA Marketing Employment Duration  Full timeApply NowWho We Are: Webcor employs people of integrity and passion to build diverse, high-profile, and innovative structures for our clients. Webcor was founded in San Francisco in 1971. We are still headquartered in San Francisco and are committed to growing throughout California (and beyond). Through career development and employee-specific rotation plans, we foster collaboration across our construction management divisions (Core & Shell and Special Projects) and self-perform groups (Concrete, Interior Construction Group, and Paramount Drywall). We provide craft professionals, experienced professionals, and new graduates with financial, health, and wellness benefits that encourage and reward individual contribution. Why Join Us?We love to build for both public and private owners. We don’t shy away from what we have never done before.We are deeply connected to continuous improvement. We welcome better ways of doing things.The U.S. GREEN BUILDING COUNCIL has recognized us with multiple LEED PLATINUM awards for our commitment to sustainable design, communities, and construction.Career tracks are clear and we encourage employee mobility and development.We pay an average of over 85% of the cost of medical benefits for employees and their families. We cover the total cost of dental, vision, life, and disability insurance. We offer a generous 401(k) match. And we offer a range of other benefits, from a wellness program to legal assistance. As a Marketing Coordinator in our San Francisco office, you will bring a strong desire to grow as a marketing professional, high standards of work product, the ability to communicate effectively with staff at all organizational levels, and a willingness to assume ownership of tasks. If you are a motivated marketing coordinator who wants to fill a vital support role in a fun, high-functioning creative team, we are interested in hearing from you. What You’ll Do:Coordinate and produce qualifications submittals and forms, in close collaboration with graphic designers, technical staff, and external partnersSupport the Marketing and Business Development teams in the development and production of proposal submittalsLead and manage form-based prequalification submittalsSupport marketing collateral development, including (but not limited to) client presentationsDistribute marketing opportunity information to internal stakeholdersSupport marketing database development, maintenance and administrationAssist with creating graphics for internal departments, including (but not limited to) Internal Communications, Human Resources, Training, and Self-Perform GroupsCoordinate and assist with corporate special events and volunteering eventsAssist the Marketing team with administrative tasks, including (but not limited to) coordinating logistics of career fairs and other recruiting eventsCoordinate with marketing vendorsDevelop and maintain system of archiving internal and external marketing collateral produced by the departmentWhat You Need to Succeed:At least two years of experience in a professional marketing department with marketing submittal coordination experienceBachelor’s Degree preferred. Architecture, engineering and/or construction industry experience preferred.Strong writing and editing skillsGraphic design experience and interest a plusSelf-directed professional with strong collaborative and interpersonal skills, and internal and external client-service mindsetSolid prioritization skills, excellent follow-through, as well as the ability to operate independently while meeting multiple deadlinesHighly detail-oriented with a strong commitment to quality work productAbility to work as part of a collaborative team in a fast-paced environmentProficient in Microsoft Office Suite (specifically PowerPoint, Word and Excel) and Adobe InDesignProficiency in Adobe Illustrator a plusWebcor is an Equal Opportunity Employer"}