{"jobID": "2808773563", "jobLocation": "Riverside_CA", "jobTitle": "Data & Process Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.ucr.edu", "Headquarters": "Riverside, CA", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " College / University", "Industry": " Education", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "55000", "jobDescription": " Data & Process Analyst  Job Number  Full/Part Time  Schedule  Salary 201805210284 Full Time 8AM - 5PM $53,700 - $92,850Position Information  The Data & Process Analyst develops, maintains, and manages data analytics and process improvements to facilitate the delivery of a customer experience that is responsive, engaging and adaptable for all members of the campus community by Facilities Services (FS). Monitors the work order system to drive excellent customer service and propose streamlined work flow activities. Possess extensive knowledge about service offerings and processes such as work intake, reception, follow up, work routing and customer outreach/engagement; facilitates and collaborates to develop improvements and process standards throughout Facilities Services units. Analyzes, designs and proposes Key Performance Indicators (KPIs); monitors, measures and creates reports/presentations on KPIs. Analyzes data and produces reports including operational performance metrics, trends and forecasts to be used for shared services strategic planning. Develops extensive insight across FS processes and consistently applies this end-to-end perspective in conjunction with meeting the service delivery objectives of Customer Relations.  Facilities Services is one of the largest departments at UC Riverside employing nearly 400 career employees. Facilities Services provides exceptional service in maintaining an environment conducive of teaching, learning, living, working and research for the entire campus community. The department maintains buildings, facilities and landscape totaling over 6 million square feet across 1,350 acres of campus. We are a team of service oriented professionals focused on exceptional client engagement, continuous improvement and development opportunities. *UC Riverside career employees who have passed their probationary period will receive priority consideration for this position. If a qualified pool of internal candidates is not identified, qualified external candidates may be considered at the discretion of the hiring department.***Candidates selected for an interview will be required to provide work samples and/or presentations as part of the interview and selection process.**"}