{"jobID": "2614528412", "jobLocation": "Lemont_IL", "jobTitle": "Assistant/Computer Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.uchicagoargonnellc.org", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "100000", "jobDescription": " Position Description  The Argonne Leadership Computing Facility’s (ALCF) mission is to accelerate major scientific discoveriesand engineering breakthroughs for humanity by designing and providing world-leading computingfacilities in partnership with the computational science community. We help researchers solve some of the world’s largest and most complex problems with our unique combination of supercomputing resources and computational science expertise.We invite you to apply for an Assistant Computer Scientist position with the ALCF. You will join the data sciences group and provide technology vision, research, development and support in machine learning to glean insights from large-scale datasets being produced by computational simulations, experiments and observations in domains including material science, genomics, neuroscience, engineering, and high energy physics. You will work in a highly collaborative environment involving science application teams, academia, industry as well as other national labs and agencies.  Position Requirements A PhD or equivalent experience in computer science, applied mathematics, statistics, computational science or in a related field.Demonstrated advanced knowledge of one or more of machine learning, data mining and statistics.Strong background in mathematical optimization or linear algebra.Advanced knowledge and significant experience in one or more programming languages such as Python, C, C++, Java, and Scala.Significant experience with analysis packages such as Matlab and with machine learning toolkits such as Torch, Caffe, Tensorflow or scikit-learn.Significant experience in analysis of data with applications.Good communication skills both verbal and written.Software development practices and techniques for computational science problems.Good experience and skills in interdisciplinary research involving mathematicians, computer scientists, and application scientists.Desirable knowledge and skills: Parallel computing experience is highly desirable.  Good ability to provide project leadership.Collaborative skills including the ability to work well with other laboratories and universities, supercomputer centers, and industry.  RD2 Requirements: Bachelor’s and 5+ years; Master’s and 3+ years; Doctorate and 0 years, or equivalent.  RD3 Requirements: Bachelor’s and 8+ years;Master’s and 5+ years; or Doctorate and 4+ years; or equivalent.As an equal employment opportunity and affirmative action employer, Argonne National Laboratory is committed to a diverse and inclusive workplace that fosters collaborative scientific discovery and innovation. In support of this commitment, Argonne encourages minorities, women, veterans and individuals with disabilities to apply for employment. Argonne considers all qualified applicants for employment without regard to age, ancestry, citizenship status, color, disability, gender, gender identity, genetic information, marital status, national origin, pregnancy, race, religion, sexual orientation, veteran status or any other characteristic protected by law. Back to top"}