{"jobID": "2744878301", "jobLocation": "Foster_City_CA", "jobTitle": "Sr Research Scientist I, Immunology and Inflammation", "companyRating": "3.1", "companyInfo": {"Website": "www.gilead.com", "Headquarters": "Foster City, CA", "Size": "5001 to 10000 employees", "Founded": " 1987", "Type": " Company - Public (GILD) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "168000", "jobDescription": " For Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job.Job DescriptionSpecific Responsibilities: The Immunology & Inflammation department at Gilead Sciences is seeking an experienced and highly motivated scientist to lead ongoing and new efforts in the discovery and development of therapeutic agents in SLE, IBD, and/or RA. As a member of a cross-functional team, the successful candidate will lead discovery and translational research teams aimed at identifying and characterizing novel therapeutics for inflammatory diseases. Drive discovery and translational research aimed at identifying, characterizing, and interpreting results for novel therapeutics for inflammatory diseases.Define and implement critical path studies needed to support hypothesis-based researchWorks on complex problems where analysis of situations or data requires evaluation of multiple variablesInterfaces with cross-functional subject matter experts, project teams, and a variety of external vendors and network of consultants to advance projectsManages Research Scientists and Associates in the initiation and execution of laboratory experimentsStrong experimental skills with demonstrated ability to execute well-designed, decision-making experimentsMakes contributions to scientific literature and conferences through publication and presentation of research resultsMentors scientists within inflammation team to effectively engage with project teams and advance portfolio projectsMust be able to work independently and effectively on multiple programs in a fast-paced environmentExcellent communication and interpersonal skills are required.Strong motivation, attention to detail, and ability to think independently and fully integrate into a high achieving team environmentKnowledge and Skills:Demonstrated expertise in immunology and/or inflammation researchBroad understanding of drug discovery and early and late stage development; familiarity with regulatory filings a plusPrevious project leadership in drug discovery program preferredExperience authoring of technical reports, drug discovery documents, and regulatory submissions desiredProven scientific/leadership expertise (working in teams, managing people, and projects)Proven publication recordStrong verbal and written communication skillsAbility to synthesize complex scientific problems into a strategy and tactics.Experience:PhD with 7+years of directly relevant pharmaceutical industry experience in immunology, inflammation, or related fieldCandidate must be detail-oriented with excellent record keeping and organizational skills.Must be a highly flexible, results oriented, independent self-starter who enjoys working in a fast-paced dynamic environment. #LI-KW1For jobs in the United States:As an equal opportunity employer, Gilead Sciences Inc. is committed to a diverse workforce. Employment decisions regarding recruitment and selection will be made without discrimination based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state and local laws. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Era Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants who require accommodation in the job application process may contact careers@gilead.com for assistance.  For more information about equal employment opportunity protections, please view the ‘EEO is the Law’ poster.  NOTICE: EMPLOYEE POLYGRAPH PROTECTION ACT YOUR RIGHTS UNDER THE FAMILY AND MEDICAL LEAVE ACT PAY TRANSPARENCY NONDISCRIMINATION PROVISION  Our environment respects individual differences and recognizes each employee as an integral member of our company. Our workforce reflects these values and celebrates the individuals who make up our growing team.  Gilead provides a work environment free of harassment and prohibited conduct. We promote and support individual differences and diversity of thoughts and opinion.For jobs in France:Conformément à la Loi « Informatique et Libertés » (06/01/78), nous vous informons du fait que les données personnelles renseignées pourront faire l'objet d'un traitement informatique par Gilead et pourront être transmises aux Organismes Sociaux. Par ailleurs, vous disposez d'un droit d'accès, de rectification et de suppression des données vous concernant. Vous pouvez exercer ce droit en contactant: FranceDataPrivacy@gilead.comFor Current Gilead Employees and Contractors:Please log onto your Internal Career Site to apply for this job."}