{"jobID": "2647560965", "jobLocation": "San_Bruno_CA", "jobTitle": "Principal Data Scientist", "companyRating": "3.2", "companyInfo": {"Website": "www.walmartlabs.com", "Headquarters": "San Bruno, CA", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, eBay, Google"}, "estimatedSalary": "197000", "jobDescription": "Position DescriptionA Principal Data Scientist is responsible for analyzing large data sets, developing custom models and authoring deployable algorithms. Principal Data Scientists typically work within project teams to provide technical and analytical leadership. Principal Data Scientists are often responsible for building large data sets from multiple sources. Principal Data Scientists are also responsible for researching new trends in the industry and utilizing up-to-date technology and analytical methods in their assigned projects. Responsibilities include:Manage and execute entire projects from start to finish including cross-functional project management, data gathering and manipulation, analysis and modeling, and communication of insights and recommendations.Demonstrate a high degree of originality and creativity when developing solutions to improve existing business processes within supply chain utilizing methods such as statistical analysis, regression modeling and optimization.Work independently to manage multiple projects at once while ensuring deadlines are met and data output is accurate and appropriate for the business. Must also be able to deal with ambiguity and make independent decisions about what data and approach is best for the task at hand.Build scalable and complex supply chain models and processes to optimize supply chain strategies with goals to deliver excellent customer experience while balancing operating cost and asset efficiency.Identify areas of opportunity and drive results partnering with cross functional partnersDevelop relationships with Wal-Mart functional areas in San Bruno, CA, as well as in Bentonville, AR, to identify best practices, solicit input/data, coordinate inter-disciplinary initiatives and to gather support for recommendationsPotential projects can include:Create models to analyze the supply chain network need to support future sales growth with scenario modeling capabilities to understand the sensitivity to multiple variables; provide insight to Logistics executives on opening, closing, or repurposing DCs; analyze impact to multiple networks simultaneously; and create scenario analyses extending beyond the five-year modeling horizonDevelop optimization logic and tool to determine truckload lane strategy for outbound transportation balancing cost and SLA requirementsDevelop logic and tool to determine optimal share of volume to process in various customer buying channels in the company balancing inventory availability, capacity, cost, and service level requirements #LI-KA2Minimum Qualifications• PhD in Operations Research, Industrial Engineering, Operations Management or Supply Chain Management 6+ years of post-graduate work experience, including demonstrated success in leading business analysis projects to achieve business-impacting resultsExtensive experience in one or more supply chain domains and related information systems distribution/transportation, sourcing, planning, manufacturing and inventory managementExperience with large data set mining tools and open-source programming tools, (e.g., R, Python, HiveQL, Spark)Experience with network modeling tools and network optimization techniques - long range planning is a plusExperience with statistical analysis, regression modeling, data mining, financial analysis, and optimization.Expert in MS-Excel and SQLCompetent in MS-PowerPoint and comfortable building presentation materials to tell a clear storyAbility to foster successful partnerships within cross-functional teamsEffective communication skills at multiple levels of the organization, including senior management - ability to communicate complex concepts in easy-to-understand terminologyAbility to champion ideas and influence the organization with fact-driven recommendationsStrong follow-through skills and acute attention to detailFoster and maintain Wal-Mart's four core values:Act with IntegrityRespect for the IndividualService to our CustomersStrive for ExcellenceAdditional Preferred Qualifications• Lean Sigma expertisePMP (Project Management) certificationRetail e-commerce industry experienceCompany SummaryWalmart Global eCommerce is comprised of Walmart.com, VUDU, SamsClub.com, and our technical powerhouse @WalmartLabs. Here, innovators incubate next gen e-commerce solutions in real-time. We integrate online, physical, and mobile shopping experiences for billions of customers around the globe. How do we do it? We continuously build and invest in new technology including open source tools and big data innovations. Data scientists, front and back-end engineers, product managers, and web and UX/UI teams collaborate alongside e-commerce experts to envision, prototype, and bring revolutionary ideas to life in a dynamic, flexible and fun work culture.Position SummaryThe Principal Data Scientist, Supply Chain Strategy & Analytics, will lead various projects that deliver future operational strategies across Walmarts e-Commerce Supply Chain. The Principal Data Scientist will be primarily responsible for leading advanced analytical modeling, simulation and optimization projects sponsored by the senior executive team. He/she will support our strategic plans, both creating and implementing strategic operational improvements to enable expansion of our businesss scope and scale. This role is part of the Walmart eCommerce Supply Chain Strategy & Analytics team a future-focused, action-biased, data-driven department chartered with improving all aspects of the supply chain from network design to inbound/outbound transportation and multi-channel initiatives by leveraging big data. This is a high-impact and high-visibility role within the organization with expectations to deliver immediate results. A Principal Data Scientist is responsible for analyzing large data sets, developing custom models and authoring deployable algorithms. Principal Data Scientists typically work within project teams to provide technical and analytical leadership. Principal Data Scientists are often responsible for building large data sets from multiple sources. Principal Data Scientists are also responsible for researching new trends in the industry and utilizing up-to-date technology and analytical methods in their assigned projects. Responsibilities include:Manage and execute entire projects from start to finish including cross-functional project management, data gathering and manipulation, analysis and modeling, and communication of insights and recommendations.Demonstrate a high degree of originality and creativity when developing solutions to improve existing business processes within supply chain utilizing methods such as statistical analysis, regression modeling and optimization.Work independently to manage multiple projects at once while ensuring deadlines are met and data output is accurate and appropriate for the business. Must also be able to deal with ambiguity and make independent decisions about what data and approach is best for the task at hand.Build scalable and complex supply chain models and processes to optimize supply chain strategies with goals to deliver excellent customer experience while balancing operating cost and asset efficiency.Identify areas of opportunity and drive results partnering with cross functional partnersDevelop relationships with Wal-Mart functional areas in San Bruno, CA, as well as in Bentonville, AR, to identify best practices, solicit input/data, coordinate inter-disciplinary initiatives and to gather support for recommendationsPotential projects can include:Create models to analyze the supply chain network need to support future sales growth with scenario modeling capabilities to understand the sensitivity to multiple variables; provide insight to Logistics executives on opening, closing, or repurposing DCs; analyze impact to multiple networks simultaneously; and create scenario analyses extending beyond the five-year modeling horizonDevelop optimization logic and tool to determine truckload lane strategy for outbound transportation balancing cost and SLA requirementsDevelop logic and tool to determine optimal share of volume to process in various customer buying channels in the company balancing inventory availability, capacity, cost, and service level requirements"}