{"jobID": "2644032930", "jobLocation": "San_Antonio_TX", "jobTitle": "Clinical Laboratory Scientist - IRL Tech_SA", "companyRating": "2.7", "companyInfo": {"Website": "www.biobridgeglobal.org", "Headquarters": "San Antonio, TX", "Size": "501 to 1000 employees", "Founded": " 2013", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "26", "jobDescription": "QualTex Laboratories, a subsidiary of BioBridge Global, is one of the largest independent non-profit testing laboratories in the United States for blood and plasma products. QualTex Laboratories is dedicated to supporting global public safety with the timely delivery of high-quality testing services for patients, donors and regulated biological products.  Job Title: Clinical Laboratory Scientist, IRL Technologist  Shift: Monday-Friday, 9pm-5:30am, on call and rotating weekends  FLSA: OT Eligible  Location: San Antonio  Dept.: IRL  Business Unit: QualTex-SAGeneral SummaryResponsible to perform Transfusion Medicine and Immunohematology Reference Laboratory processes assigned to the department. Recognize unusual test results and resolve discrepancies. Maintain knowledge of all current theories and principals required to perform effectively. Maintain excellent communication with the Department and other Laboratory Services personnel.  Commit to and abide by the character of BioBridge Global’s Core Values of Accountability, Stewardship, Pioneer, Integrity, Respect and Excellence (ASPIRE).  Provide world class customer service by capturing and being responsive to the voice of the customer (including donors) through established feedback channels in order to resolve issues and drive satisfaction in accordance with the BBG customer engagement, feedback, and complaint processes.Major Duties and ResponsibilitiesEssential Tasks Consistently and competently perform all assigned departmental duties. May perform Pre-Analytical tasks [receipt, qualification, and preparation of samples for testing] and complex testing on patients, donors, and/or biologic products.  Evaluate test results in an accurate and timely manner, and recognize and report unusual test results. Analyze quality control data and resolve discrepancies.  Operate equipment utilizing established protocols and within quality control limits.  Recognize equipment malfunctions and/or technical problems and take appropriate steps to resolve.  Use independent judgment and/or knowledge to resolve highly complex problems. For issues unable to be resolved will escalate to appropriate department technical specialist or management.  Maintain strict adherence to Standard Operating Procedures (SOPs). Prepare and maintain reports/records and perform computer data entry. Maintain departmental supplies within established inventory levels.  Commit to and embrace the mission, vision, and core values of QualTex Laboratories: Positive work attitudeRespect for co-workers and management staffExcellent customer service [for both internal and external customers]Adherence to all safety, regulatory, and quality requirementsContinuous improvement Participate in continuing education and attend meetings as required.  Assist with training and/or mentoring of new employees and/or volunteers.  Participate in team-oriented work projects for the development and implementation of strategic initiatives, validations, process improvements, and Standard Operating Procedures (SOPs).  Department specific functions for patient/donor/source plasma specimens. Perform high complexity testing for: Perform ABO/Rh, antibody screens, routine and 30 day pre-opPerform ABO/Rh discrepancy resolutionPerform antibody identification using routine and complex methodologiesPerform DAT and elutionsInvestigate transfusion reactionsPerform serologic and genetic phenotypingPerform HLA Antibody TestingPerform HLA Platelet MatchingPerform antibody titrationPerform sickle cell testingEnter test results in laboratory computer systemCreate reports in blood bank computer systemManage reagents including reagent preparation, inventory, ordering, receipt, and validationPerform daily quality control and maintenance of department equipmentMaintain blood inventory for department Performs other duties asassigned. Non-Essential Tasks Assist in other areas as directed.EducationRequires a Bachelor’s Degree from an accredited college or university with major course work relative to the field of assignment. The required major is Medical Laboratory Science/Medical Technology or Applied Science. Licenses and/or Certifications Certified MT, CLS, or MLS required  BB Certification preferredExperienceNo prior specific work experience required.  Prefer one year of transfusion medicine (blood bank) or Immunohematology Reference Laboratory experience.KnowledgeMust have a working knowledge of Medicine and Immunohematology Reference laboratory processes.  Must obtain a working knowledge of regulatory/quality requirements and perform within all Standard Operating Procedures (SOPs) and policies.SkillsMust maintain competency in laboratory skills for liquid and material handling.  Must be capable of evaluating, interpreting and reporting accurate/valid test results.  Must have strong computer skills.  Must have excellent written and oral communication skills.AbilitiesMust be able to keep information confidential.  Must be able to work with interruptions, meet deadlines, and perform accurate work and/or reports.  Must be neat in appearance and well groomed.  Must be professional, detail oriented, self-motivated, innovative, creative, assertive, organized, communicative, and have the ability to work independently.  Must perform well in repetitive work situations.  Must work well independently and as a team member.Working EnvironmentWorks in a well-lighted air conditioned and heated laboratory/department. Laboratory consists of complex setting with robotic instrumentation. May be exposed to electrical, mechanical and chemical hazards and other conditions common to a laboratory environment. May be exposed to blood borne pathogens and other conditions common to a clinical laboratory environment. May have bodily exposure to refrigerator/freezer temperature, especially hands and face. Will work extended hours during peak periods. May be required to work any time of the day, evening or night during the week or weekend to include being on-call. Physical Requirements Requires manual and finger dexterity and eye-hand coordination.  Will require walking, bending, and prolonged sitting and/or standing during work hours.  Required to carry up to 25 lbs. and occasionally lift up to 40 lbs.  Requires normal or corrected vision and hearing corrected to a normal range.All Full Time Positions Qualify for an Affordable and Competitive Benefits Package to include:• Competitive salary  • 100% Employer Paid Life Insurance• Variable Compensation Plan  • 100% Employer Paid Long-term Disability Plan• Paid Time Off (PTO)  • 100% Employer Paid AD&D;• Extended Illness Benefits (EIB)  • 100% Employer Paid Employee Assistance Program• Shift Differentials  • Group Health Medical Plan w/prescription coverage• Paid Holidays  • Variety of Voluntary Supplemental Insurances• Leaves of Absence  • Voluntary Dental Coverage• Educational Assistance Program  • Voluntary Vision• Professional Development Plan (PDP)  • Flexible Benefit Cafeteria Plan• Credit Union  • Tax Deferred Retirement Plan• 100% Employer Paid Pension PlanQualTex Laboratories, a subsidiary of BioBridge Global, is proud to be an Equal Opportunity Employer committed to providing employment opportunities to minorities, females, veterans, and disabled individuals. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, genetic data, sexual orientation, gender identity, or any other legally protected characteristics. For more information about your EEO rights as an applicant under the law, please click here. QualTex Laboratories maintains a Tobacco & Drug-Free Workplace."}