{"jobID": "2816420310", "jobLocation": "San_Diego_CA", "jobTitle": "Senior Data Scientist-Global Fraud Management", "companyRating": "3.5", "companyInfo": {"Website": "www.playstation.com/en-us", "Headquarters": "San Mateo, CA", "Size": "5001 to 10000 employees", "Founded": " 1994", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Microsoft, Riot Games, Activision Blizzard"}, "estimatedSalary": "130000", "jobDescription": " PlayStation isnt just the Best Place to Play its also the Best Place to Work. Weve thrilled gamers since 1994, when we launched the original PlayStation. Today, were recognized as a global leader in interactive and digital entertainment. The PlayStation brand falls under Sony Interactive Entertainment, a wholly-owned subsidiary of Sony Corporation.  Interested in working on strategic initiatives that allow for creativity and room for growth? Are you an expert in statistical analysis? Are you a strong believer in using data to drive the best business decisions? If so, read on  Sony Interactive Entertainments (SIE) Global Fraud Management (GFM) and Security Teams are the guardians of customer trust for PlayStation and the PlayStation® Network (PSN). We provide innovative solutions to support every element of the platform, various platform services, customer service teams, a diverse developer community, and more.  SIE is currently building a next generation fraud and risk platform that will support the global, fast growing PlayStation® Network customer base, world class PlayStation® consoles, hand-held devices, PlayStation® TV, and network entertainment services such as PlayStation® Vue, PlayStation® Music, PlayStation® Video and PlayStation® Now. GFMs Data Science team is responsible for evaluating online transactions for potential fraud across this new platform. Our job is to provide quantitative assessments of all customers and identify those individuals who pose the most risk to our businesses. We are currently looking for a high-caliber individual to join our team and to help create world-class, analytic solutions aimed at minimizing risk and maximizing revenue for the company. Responsibilities:Use statistical techniques to design predictive models that detect fraud and other eCommerce risks. Iteratively test, refine, and improve the algorithms. In this role, the Data Scientist will be required to be an expert in building predictive, statistically valid models.Expert level statistical analysis to conduct robust data analysis using hypothesis testing, design of experiment, inferential statistics, and more.Design and support A/B/N Experimentation framework using statistically valid designs and unbiased measurements of success.Develop deep understanding of business challenges and develop data features and functionality that can contribute to identifying risk and possible fraud.Assist the Software Development and Peer team members in testing and deploying decision changes (rules, models, etc.) on the newly created platform.Requirements:Masters degree in Statistics, Operations Research, Machine Learning or other related fields (Ph.D. preferred) and a minimum of 5-7 years related work experience.5+ years in using statistical modeling techniques (regression, CHAID, neural networks, cluster analysis, RFs, GBTs, etc.).5+ years experience with a statistical programming package such as SAS/SPSS/R/Python/Java is required.Preferred Skills:Proven hands-on experience developing statistical models, optimization, statistical analysis, machine learning or text classification algorithms.Strong understanding of predictive modeling, data manipulation, and data value assessment. Creation and understanding of macros for automating above mentioned processes is strongly preferred.Ability to be flexible enough to jump in and act as a team-member, taking immediate ownership of unanticipated attack scenarios, and responding to ad hoc requests requiring self-serve data pull to conduct analysis using SQL/Hadoop/AWS Data Analytics tools.The candidate should demonstrate high energy/creativity, a passion for analyzing highly complex data sets, strong communication and project management skills, an entrepreneurial spirit, a relentless customer-focus, a practical understanding of quantitative methods, and superb attention to detail. Sony is an Equal Opportunity Employer. All persons will receive consideration for employment without regard to race, color, religion, gender, pregnancy, national origin, ancestry, citizenship, age, legally protected physical or mental disability, covered veteran status, status in the U.S. uniformed services, sexual orientation, marital status, genetic information or membership in any other legally protected category.  We strive to create an inclusive environment, empower employees and embrace diversity. We encourage everyone to respond.  We sincerely appreciate the time and effort you spent in contacting us and we thank you for your interest in PlayStation.  #LI-GM1"}