{"jobID": "2761552633", "jobLocation": "Deerfield_IL", "jobTitle": "Data Analyst - NCH", "companyRating": "3.1", "companyInfo": {"Website": "www.valassis.com", "Headquarters": "Livonia, MI", "Size": "5001 to 10000 employees", "Founded": " 1970", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": "BUILD your career with a global leader in business solutions that has a successful, 60-year history providing the redemption, settlement, audit and analysis of paper and digital coupon offers. As part of Valassis, a leader in intelligent media delivery, you will be an integral contributor in a multi-billion dollar, growing organization. LIVE your passion through a culture that actively supports community involvement and delivers hope to missing children and their families across the nation through its involvement in the Have You Seen Me?® Program. CREATE our future through unwavering commitment to quality, integrity and advanced technology, helping many of the world's largest manufacturers and retailers protect more than $4 billion in fast-moving promotional funds. Rewards · Take charge of your future with our generous 401K savings plan with company match, which is vested from day one.  · Participate in our company wide well-being program that also serves to lower your annual health insurance premiums.  · Explore new education opportunities with our Tuition Reimbursement Plan which covers up to $5,250.  · We offer work-life flexibility, meeting personal obligations along with professional success. Your Opportunity as a Data Analyst: Deliver data analytics to CPG and Retail clients using our superior data and analysis capabilities. Collaborate with internal and external client teams to create innovative, data-driven analyses using SAS and SQL. Use Tableau to create data visualizations to draw conclusions and identify insights with data.  We are seeking a detail oriented analyst experienced using SAS and/or SQL to gather data and design reports. You will use your effective communication skills to partner with our Account Management team in understanding client data needs and provide guidance and recommendations on reporting layout. You will also use your strong analytical and communication skills to review data and explain results. Required Experience and Skills:Bachelor’s degree with strong math skills.2-3 years of experience in a market research or data analysis position using SAS or SQL.Demonstrated analytical, written and customer service skills.Tableau experience a plus.Experience in the CPG and consumer promotion industry is a plus.The ability to be flexible in a changing and team oriented work environment. We are located in Deerfield, IL – just a short walk to the Metra train. For more information about NCH, visit www.nchmarketing.com.  NCH Marketing Services is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.  Applicants who have disabilities may request that accommodations be made in order to complete the selection process by contacting our Recruiting Coordinator, Meaghan Brown at . EEO is the law. To review your rights under Equal Employment Opportunity please visit:www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf."}