{"jobID": "2837761606", "jobLocation": "Grand_Haven_MI", "jobTitle": "Wetland Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.cardno.com", "Headquarters": "Brisbane, Australia", "Size": "10000+ employees", "Founded": " 1945", "Type": " Company - Public (CDD) ", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " AECOM, Stantec, CH2M"}, "estimatedSalary": "42000", "jobDescription": " Cardno is seeking a Project Scientist to work in Michigan. The position is responsible for implementing project work in the ecological and environmental consulting fields and assisting with business development for consulting services. The position will require experience in typical and atypical wetland delineations, regulatory permitting, endangered species surveys, vegetation monitoring, understanding of Midwest ecological systems both terrestrial and aquatic and a working knowledge of ecological restoration.  Responsibilities include but are not limited to:  > Serve as Project Manager for multiple consulting projects  > Collect field data, conduct analysis, and report preparation  > Knowledge and experience with wetland delineation methodologies  > Develop local, state, and federal wetland and waterbody/watercourse permit applications  > Prepare local and state erosion and sediment control permit applications  > Knowledge and experience with vegetation monitoring and sampling methodologies  > Soil identification and identification of hydric soil indicators  > Responsible for projects budgets, scope changes and schedule commitments  > Participate in business development activities such as proposal development and client meetings  > Attend conferences and annual meetings to develop business and market the Cardno brand  RequirementsBasic Qualifications: > Bachelor degree or higher in botany, plant ecology, wetlands ecology, wildlife or related science  > 5-10 years of related, professional experience  > Experience conducting fieldwork, including wetland delineations (Routine Methodology and Atypical Situations), using at least one of the USACE Midwest, Northeast and Northcentral Regional Supplements  > Experience working with Michigan regulatory permitting  > Strong field botany skills and ability to conduct fieldwork, at times for long hours or under strenuous circumstances  > Excellent oral and written communication skills  > Strong problem-solution orientation, detail oriented and resourceful  > Positive, flexible, team-oriented approach, with the willingness and desire to work as part of a multi-disciplinary team  > Effective time management and follow-through Desired Qualifications: > Experience working on projects involving utilities, oil/gas companies, and alternative energy projects  > Business development experience, ability to secure projects for the office  > Ability to work well independently with a diverse team in a fast-paced environment  > Strong interpersonal skills Please Note that selected candidates will be required to pass a drug, background and reference screening. Cardno is a professional infrastructure and environmental services company, with expertise in the development and improvement of physical and social infrastructure for communities around the world.  We are an equal opportunity and affirmative action employer. EEO/AA/M/F/V/D  If you need assistance applying, please leave a message with jobs@cardno.com. General inquiries and submissions of resumes will not be reviewed or routed internally. "}