{"jobID": "2791372053", "jobLocation": "Rockville_MD", "jobTitle": "(Associate/Senior/Principal) Scientist, Pharmaceutical Continuous Manufacturing", "companyRating": null, "companyInfo": {"Website": "www.usp.org", "Headquarters": "Rockville, MD", "Size": "1001 to 5000 employees", "Founded": " 1820", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " This is a non-supervisory scientific position in the General Chapters Group within the Compendial Science Department. The incumbent is responsible for providing support in the development and revision of general USP-NF chapters and supports USP Expert Committees and associated Expert Panels.  Most of the activities are related to the development of USP standards related to pharmaceutical continuous manufacturing including but not limited to: analytical techniques applicable to physical characterization of materials, in-process testing, process analytical technology, spectroscopy, etc.  These activities will require the critical evaluation of relevant documents and other information, the performance of literature searches on related topics and the development and drafting of pertinent documents for other scientific staff and/or Expert Committee review. Roles and Responsibilities:Works closely with a team of high-performing scientists responsible for the development and revision of documentary standardsFacilitates all aspects of the development and revision of USP-NF General Chapters, from development of the initial proposal to the publication of the documentary standard.Evaluates and analyzes supporting data, and translates into USP editorial style and format.Assists in the activities of the USP Expert Committees and Advisory Panels, as needed.Responds to telephone and written inquiries pertaining to USP-NF monographs and General Chapters included in the USP-NF.Serves as a member on USP cross-functional teams, as neededKeeps abreast of current trends and developments in related scientific fields.Communicates with other USP departments regarding projects related to continuous manufacturing and related topics.Works closely with the Principal Investigator – PCM to provide the scientific and technical input to USP’s broader PCM strategy Performs other related duties as requiredBasic QualificationsAssociate Scientific Liaison: Ph.D. degree in Chemistry, Engineering or a related field and five (5) years of relevant experience, or an M.S. and seven (7) years of experience in analytical development for pharmaceuticals. Scientific Liaison: Ph.D. degree in Chemistry, Engineering, or a related field and eight (8) years of relevant experience, or an M.S. and ten (10) years of relevant experience in analytical development for pharmaceuticals. Senior Scientific Liaison: Ph.D. degree in Chemistry, Engineering, or a related field and ten (10) years of relevant experience, or an M.S. and twelve (12) years of relevant experience in analytical development for pharmaceuticals. In addition, at least 5 years of this experience should be in a regulated pharmaceutical environment applying USP standards. Principal Scientific Liaison Ph.D. degree in Chemistry, Engineering, or a related field and ten (10) years of relevant experience, or an M.S. and thirteen (13) years of relevant experience in analytical development for pharmaceuticals. In addition, at least 6 years of this experience should be in a regulated pharmaceutical environment applying USP standards. Critical success factors that must be demonstrated for Principal Scientific Liaison: track record of proven results and scientific impact,leading functional/technical expertise in one or more areasstrong leadership capabilities, including ability to resolve complex scientific issues, and influencing without authorityexperience in conducting cross-functional teams, working on complex challengesExperience with analytical techniques used for process control (i.e. spectroscopic methods used in PAT environment) is requiredExperience with physical characterization of materials is requiredPreferred QualificationsExperience with real-time release approaches and equivalence determination between analytical procedures is preferredAble to establish and nurture relationships with individuals of varying backgrounds and learning styles.Able to operate independently where appropriate, yet understands when to escalate issues and how to establish effective working relationships.Strong presentation and communication skills (written and oral).Well-developed organizational, interpersonal communications, negotiation, writing, and strong listening skills.Practical experience in scientific, analytical techniques.Project Management skills required.Knowledge of the pharmaceutical industry and the associated regulatory framework is essential.Must be able to share technical information with non-technical or non-scientific staff, and to communicate effectively with representatives from pharmaceutical companies, government, and academic institutions.Experience with, and knowledge of the USP-NF is preferred. USP offers an impressive benefits package, including: Generous paid time off – 13 paid holidays, 10 sick days and 15 vacation days per year to startAn annual 401(k) contribution, beginning after 1 year of service, of 10% of pay (base and bonus) every pay period that vests immediatelyComprehensive individual and family healthcare plans with affordable premiums and low annual deductibles ($250/individual or $500/family) The U.S. Pharmacopeial Convention (USP) is a scientific nonprofit organization that sets standards for the identity, strength, quality, and purity of medicines, food ingredients, and dietary supplements manufactured, distributed and consumed worldwide. USP’s drug standards are enforceable in the United States by the Food and Drug Administration, and these standards are used in more than 140 countries.  Being a part of USP means belonging to a diverse culture made up of more than 1,000 talented professionals working together at five international locations. We share our expertise in science, IT, human resources, quality assurance, communications, administrative management, and more...all to support an overall mission dedicated to making a difference by providing standards and programs that help improve the quality of medicines, dietary supplements, and foods worldwide.  USP is proud to be an equal employment opportunity employer (EEOE) and affirmative action employer. Employment selection and related decisions are made without regard to sex, race, age, disability, religion, national origin, color, veteran status, sexual orientation, gender identity or any other protected class. We are committed to working with and providing reasonable accommodation to individuals with disabilities.  USP does not accept unsolicited resumes from 3rd party recruitment agencies and is not responsible for fees from recruiters or other agencies except under specific written agreement with USP.Required Skills Required Experience Job Location  Rockville, US-MD "}