{"jobID": "2726407839", "jobLocation": "San_Francisco_CA", "jobTitle": "Full Charge Bookkeeper", "companyRating": "4.3", "companyInfo": {"Website": "www.bpmcpa.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Novogradac & Company, Moss Adams LLP, Armanino"}, "estimatedSalary": "22", "jobDescription": "BPM is a full service accounting firm providing comprehensive assurance, tax, and consulting services to clients globally. We are one of the largest California-based accounting firms and have built our success by focusing on our clients and our people. Our client base encompasses a complex array of sophisticated clients that keep our staff intellectually challenged every day.Our people-centered culture and firm motto Because People Matter has allowed us to be consistently recognized as one of the Best Places to Work in the Bay Area. We are dedicated to providing meaningful careers for all of our employees along with fostering an environment that allows an integrated lifestyle. Our flexible culture allows our professionals to live a balanced lifestyle between their work responsibilities and personal commitments.Learn more about BPM on Glassdoor or our key leaders on LinkedIn like Jenise Gaskin and Rich Gunn. You will likely meet some of these people during your interview process!Accounting Advisory OverviewBPMs Accounting Advisory team (internally referred to as the Business Enterprise Service Team) provides comprehensive financial and business advisory services to private, owner-run companies, including family-owned businesses and start-ups.As part of the Advisory Service Line, the Full-Charge Bookkeeper position requires the ability to handle a diverse client base from high net worth individuals, nonprofit organizations to corporate accounting. It also requires a clear understanding of accrual and cash basis of accounting. This person will need to have attention to detail along with flexibility. They will be responsible for processing accounts payable, customer invoicing, bank reconciliations, preparing business compliance filings such as 1099s, payroll, and sales tax. We Have: A unique people-centered culture that attracts the brightest and most forward-thinking accounting professionals.The resources, expertise, and global capability of a Big Four accounting firm together with the responsiveness and accessibility of a local firm.A regional presence in the Bay Area, while still serving our clients nationally and internationally.Recognition as one of the Bay Areas Best Place to Work and No. 1 Best Large Accounting Firm to Work For by Accounting Today.You Have (Requirements):5+ years of bookkeeping experienceExperience using QuickBooks and Intacct (aka Sage Intacct)A clear understanding of accrual and cash basis of accountingExcellent attention to detailBachelor's degree is requiredExcellent written and verbal communication skillsPro-advisor certification in recent versions is a plusKnowledge of various accounting systems including NetSuite, Intacct and MRI is a plusYou Will (Job Responsibilities):Handle diverse client base from high net worth individuals family office, nonprofit organization to corporate accountingProcessing accounts payable, customer invoicing, bank reconciliations, preparing business compliance filings such as 1099s, payroll, and sales taxBe willing to take ownership of client base is necessaryBPM bookkeepers may be required to work at client sites as well as in the office on an as need basisExcellent written and verbal communication skillsOpportunity to become certified with accounting software like Intacct and NetSuite.Firm support to pursue your CPA licenseLinkedIn Code: #LI-AW2"}