{"jobID": "2803196830", "jobLocation": "Lawrenceville_NJ", "jobTitle": "Associate Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Associate Research Scientist Be part of a company that delivers life-changing healthcare solutions. Eclaro is looking for an Associate Research Scientist for our client in Lawrenceville, NJ.  Eclaro’s client is a leader in the Biopharmaceutical Industry, providing quality, innovative, and affordable medicines that make a difference in the lives of patients all over the world. If you’re up to the challenge, then take a chance at this rewarding opportunity! Position Overview: The Translational Research team at Client is focused on identifying biomarkers to monitor pharmacodynamic responses and to predict responses for our Oncology and Immunoscience assets. The team is seeking a research scientist to assist with processing of patient samples. Responsibilities:Isolation of lymphocytes from tumor and colon resectionsIsolation of plasma and lymphocytes from peripheral bloodInventory maintenanceExtraction of clinical information from patient report formsRequired Experience:Bachelor of Science or Master’s degree with 1-3 years post graduate experiencePreferred Experience:Excellent communication skills and the ability to work in a matrixed teamPrevious experience working with human blood and tissuesIf hired, you will enjoy the following Eclaro Benefits:401k Retirement Savings Plan administered by Merrill LynchCommuter Check Pretax Commuter BenefitsEligibility to purchase Medical, Dental & Vision Insurance through Eclaro If you feel you are qualified with the required skills and if you are interested, please free to send your word version most updated resume TAILORED to the job description above to June@eclaro.com or call (212)804-7476. Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status."}