{"jobID": "2831668291", "jobLocation": "Washington_DC", "jobTitle": "Computer Scientist at NAS PAX River", "companyRating": "3.1", "companyInfo": {"Website": "www.solute.us", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Google, Microsoft, Amazon"}, "estimatedSalary": "111000", "jobDescription": " SOLUTE is a recognized industry leader in providing Program Management, CyberSecurity / Information Assurance, Program Support, Innovation, Systems Integration Engineering and consulting services to the United States government and prime government contractors. Our experts bring a wealth of operational knowledge and technical excellence to numerous clients throughout the Department of Defense. SOLUTE Inc. promotes a team-oriented environment, which is instrumental to our success.  SOLUTE is seeking talented and inspired computer scientists who are interested in a career working with US Navy combat aircraft and supporting aircraft weapon systems. These state-of-the-art systems require on-going software development and revisions to keep pace with emerging technologies, and we are seeking candidates with practical software development experience to assist with these tasks. Software development efforts will be in support of a variety of aircraft and associated mission systems and weapon systems at NAVAIR like the Air Acoustic Signal Processing (AASP) Project which is engaged in development of Signal Processing Applications for the DoD at Naval Air Station Patuxent River. The successful candidate will be intimately involved in the development of software code used for operation and support of naval aircraft in real-world battlefield environments. Responsibilities will include writing, modifying and adapting computer programs in high-level programming languages, and performing research on applications for hardware, software and operating systems.  If you are a motivated and determined engineer who is looking to take the next step your career and want to be part of the team that designs, develops, integrates, and tests software solutions for Naval Aviation then join us at SOLUTE!. RequirementsFunctional duties:Applies knowledge of computer science concepts and techniques, mathematics, and methods of statistical analysis to develop and apply automated solutions to engineering, scientific, or business data acquisition and management problems.Uses mathematical, statistical, and scientific logic to identify conceptual or theoretical solutions to problems of automated data processing (ADP) hardware or software systems design and operations.Analyzes and formulates architectural and functional specifications, interfaces, and data structures.Researches applications for ADP hardware, software, and operating systems.Writes, modifies, and adapts computer programs in machine level, assembly, and third or fourth generation programming languages.May act as team leader or supervisor, developing project plans, guidelines, or controls, and directing the work of other computer scientists, specialists, and technicians.Required Education: BS or BA degree in a Computer Science, Electrical Engineering, or Mathematics.Required Experience: At least five (5) years of computer science experience with C++, C#, and/or Java.At least one (1) year of the foregoing experience shall have been as a team leader or supervisor.At least one (1) year of the foregoing experience shall have consisted of performing computer scientist functions in a Department of Defense (DoD) Aircraft Weapons SystemsClearance level of “Secret” is requiredBenefits401(k) matchMedical, Dental, Vision, and morePaid Time Off (PTO)10 paid holidaysHighly competitive salaryEductional assistance"}