{"jobID": "2832036912", "jobLocation": "South_Plainfield_NJ", "jobTitle": "Innovation Scientist - Skin Biology", "companyRating": null, "companyInfo": {"Website": "www.sensient.com", "Headquarters": "Milwaukee, WI", "Size": "1001 to 5000 employees", "Founded": " 1882", "Type": " Company - Public (SXT) ", "Industry": " Manufacturing", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " International Flavors & Fragrances, McCormick & Company, D. D. Williamson"}, "estimatedSalary": null, "jobDescription": "JOB SUMMARY: A Research & Development Innovation Scientist will work in the expanding cosmetic technology group and focus on new skincare products (functional ingredient to biologically active ingredients). ESSENTIAL DUTIES & RESPONSIBILITIES: Propose a complete characterization and substantiation program for new Ingredients in collaboration with CROs (from in Vitro to in Vivo)  Collaborate with other Sensient business units to bring in ingredients for cosmetics  Work independently to design, run and document experiments as well as be able to present findings to the innovation team and possibly customers in presentation and written format  Plan and carry out experiments related to development of skin care ingredients from basic evaluations in formulation to substantiations studies SKILLS & ABILITIES: Ability to work effectively both independently and as part of a team with diverse groups of people at various levels  Ability to meet deadlines and budgets while being flexible to changes in priorities and interruptions  Excellent record keeping with complete, accurate and legible data  Excellent knowledge in working with various computer software systems such as JD Edwards, DevEx and Microsoft Office  Well-versed and comfortable working with standard and pilot-scale laboratory equipment  Familiar with procedures to transfer technologies from the laboratory to the production environment  Knowledge of equipment and procedures for making dispersions and handling powders will be considered a plus  Excellent verbal and written communication skills  Knowledge of cGMP procedures and processes is required EDUCATION & EXPERIENCE: Master's degree in Skin biology or related scientific field (i.e. Biology, Dermatology, dermopharmacy)  Minimum of 4 years' experience working in the laboratory environment  Experience in skincare industry and skin biology  Experience in patent search and filing is a plus ABOUT SENSIENT COLORS: Sensient Color Group is a leading developer, producer and supplier of natural and synthetic color systems for customers around the globe. The Company's high-performance products play a central role in the manufacture of foods and beverages, cosmetic and pharmaceutical colors and coatings, inks for commercial and consumer printers, and colors for agricultural uses, household cleaners and paper products. The Color Group is located in St. Louis, Missouri. ABOUT SENSIENT TECHNOLOGIES CORPORATION: Sensient Technologies Corporation is a leading global manufacturer and marketer of colors, flavors, and fragrances. Sensient employs advanced technologies at facilities around the world to develop specialty food and beverage systems, cosmetic and pharmaceutical systems, inkjet and specialty inks and colors, and other specialty and fine chemicals. The Company's customers include major international manufacturers representing most of the world's best-known brands. Sensient is headquartered in Milwaukee, Wisconsin.  As a dynamic and diversified global leader, we offer an excellent salary and comprehensive benefits package. For more information, visit our website at http://www.sensient.com.  Equal Opportunity EmployerSDL2017"}