{"jobID": "2837581193", "jobLocation": "Alexandria_VA", "jobTitle": "Unstructured Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.itacsolutions.com", "Headquarters": "Birmingham, AL", "Size": "201 to 500 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Type: Temp-to-Hire Pay Rate: Up to per hour, DOE In this job, here are some of the duties to be performed:Under direct supervision, the incumbent receives detailed instructions on all work. The incumbent is assigned metadata creation related tasks that are routine in nature. Assignments will be in the areas of reviewing documents, identifying metadata information from the documents, and keying in the metadata information.  Perform other duties as assigned.Education: Bachelor's Degree  (Required) To be considered for this job, candidates may be required to have the following skills and experience:PERSONNEL SKILL QUALIFICATIONS The on-site representative will be trained and skilled in overall computer systems and applications (i.e., Microsoft Word, PowerPoint, and Excel) as defined in this SOW. Each on-site representative will meet certification level requirements to the degree defined in the GSA contract. For example, FS08, the individual should have at a minimum, a Bachelors Degree with two years of experience; FS09, the individual should have at a minimum, an Associates Degree with three years of related experience; and FS10, the individual should have at a minimum, an Associates Degree with five years of experience.  Due to the nature of the work, previous military or DOD experience is a plus, but not required. SECURITY REQUIREMENTS All on-site representatives are required to hold current United States of America citizenship. Minimum Top Secret security clearance is required to perform this task.Company Overview: Were in the business of connecting professionals with employment/career opportunities  in fields such as accounting and finance, technology, engineering, office administration, marketing, sales and just about any other position from the front desk to the corner office.  Whether your need is for temporary or contract employment or for full-time employment, our goal is to help you make the right connection. Think this posting is a perfect match for your  experience, skills, and qualifications? Apply below! If this job isnt for you but sounds like a great opportunity for someone you know, please share with a friend. "}