{"jobID": "2837221772", "jobLocation": "Austin_TX", "jobTitle": "Senior Data Scientist", "companyRating": "4.2", "companyInfo": {"Website": "www.retailmenot.com/corp", "Headquarters": "Austin, TX", "Size": "501 to 1000 employees", "Founded": " 2009", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "162000", "jobDescription": "At RetailMeNot we believe that gaining valuable insights using our data is core to our future success. Our Data Science team is seeking a Senior NLP Data Scientist to drive search-oriented modeling and automated language processing to make savings opportunities more discoverable by consumers.In this role you will collaborate with a multidisciplinary team of data scientists, software engineers, data engineers, business analysts, product managers, and other internal customers to find the best opportunities to apply data science in RetailMeNot's business. You will lead key initiatives through development, iterative experimentation, and productization of winning solutions. We can provide you access to large-scale master and analytics data sets; in return you will see the application and impact of your work to millions of users.Do you love working with people, taking on these new challenges, working in an energizing environment and using data to tackle large and impactful problems? We have tons of work to be done, so lets get started.Who You Are You have an MS/PhD in NLP, computational linguistics, machine learning, applied mathematics, or related quantitative field or equivalent self-studyYou have a deep knowledge of natural language processing, text mining and statisticsHave a track record of building scalable and robust personalized search engines preferably in the retail spaceYou bring specific experience in Neural Networks, preferably RNNs, LSTMs and Deep LearningYou have experience with Topic Modeling, Parsing, Semantic Composition and Relationship ExtractionExperience in productization of machine learning algorithmsYou have the ability to apply a pragmatic approach to problem solving, establishing conceptual connections to data sources, understanding relationships among data, and comfort with uncertainties/approximationsYou have great communication and collaboration skills What You'll Do You'll use machine learning and NLP techniques to design and develop system for searchYou'll design and implement scalable algorithms and models, as well as repeatable workflowsYou'll develop and code software programs, algorithms and automated processes to interpret unstructured textual data from various sources and contextsYou'll communicate effectively to different audiences, both technical and non-technical, through good storytelling and data visualizationYou'll mentor junior engineers/scientists on data science techniques, process, and new technologiesStay ahead of new technologies. Technologies we use today include: TensorFlow, Spark, JanusGraph, Python, and Elasticsearch Who We Are We have an open environment where engineers are given a lot of responsibility and the freedom to make a huge impactWe have lots of smart people to work with and learn fromWe work on large scale challenges with a variety of technologiesWe have a great open vacation policyWe'll provide you with food, food, and more foodWe believe in giving prizes, bonuses, and recognition for doing what you enjoyRewardsWe offer an opportunity to be an integral part of a company that eagerly pursues disruption in its space to continue to drive innovation and lead the competition. Benefits of being an employee of RetailMeNot, Inc. include, but are not limited to the following:Competitive base & bonus packages; salary negotiableLong Term Incentive PlanPerformance based rewards & recognition for your hard work and serviceVery competitive benefits packages, including best-in-class parental leaveOpen & flexible PTOCell phone & gym membership reimbursementsFully stocked break room & onsite catered breakfasts & lunches multiple days/weekAbout UsRetailMeNot, Inc. is a leading digital savings destination connecting consumers with retailers, restaurants and brands, both online and in-store. The company enables consumers across the globe to find hundreds of thousands of digital offers to save money while they shop or dine out.U.S. Equal Employment Opportunity/Affirmative Action InformationIndividuals seeking employment at RetailMeNot, Inc. are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, or sexual orientation. You are being given the opportunity to provide the following information in order to help us align with federal and state Equal Employment Opportunity/Affirmative Action record keeping, reporting, and other legal requirements."}