{"jobID": "2335783900", "jobLocation": "Battle_Creek_MI", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ageatia.com", "Headquarters": "Schaumburg, IL", "Size": "51 to 200 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Description Manipulate large quantities of data to extract meaningful content and deliver concise, relevant and decision-enabling information in an appealing and attractive format to allow various stakeholders access to clear and accurate financial information Interpret data and analyze results using statistical techniques and provide ongoing reports. Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality. Acquire data from primary or secondary data sources and maintain databases/data systems. Filter and \"clean data, and review performance indicators to locate and correct data problems. Locate and define new process improvement opportunities. Conduct basic internal communication activities -- develop key messages and content. Document business and functional requirements, use cases, and test scenarios. RequirementsSkills: Proven working experience as a data analyst. Technical expertise regarding data models, database design development, data mining and segmentation techniques. Strong working knowledge of and experience with reporting packages, databases and analysis tools. Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy. Adept at queries and report writing. Excellent skills in Microsoft Office applications SAP systems experience Experience: 0-2 data analysis Preferred: 3-5 years data analysis Education: HS/Diploma or GED with some college/experience in data analysis Preferred: BA"}