{"jobID": "2684309919", "jobLocation": "San_Carlos_CA", "jobTitle": "Data Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.upstart.com", "Headquarters": "San Carlos, CA", "Size": "51 to 200 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "148000", "jobDescription": "Upstart is solving a problem that can have tremendous impact on people's financial health. Over 80% of people do not default on loans; however, only 45% of people have access to credit. Our Data Science team is figuring out how to bridge that gap by applying machine learning techniques to better predict credit and give more people access to fair and easy credit.  Data Science and predictive modeling is at the core of our success. Underwriting more accurately and using variables that no other lender considers are what allow us to give people the rates they deserve, which in turn gives our business its biggest competitive advantage. That means that your role at Upstart will drastically impact our company's success. Joining Upstart in our Data Science team means you'll have a position on a team that is collaborative, intelligent, open, and thoughtful with a leader that has strong belief in challenging and growing the members of the team.  We need thoughtful Data Scientists that are passionate and enjoy working in a fast environment. Because our challenges are so new, this person will need to have strong creative problem solving skills, in addition to a background in statistics. If you think that this could be the right role for you, we would like to learn more about you. Here are some of the requirements that we're looking for:Strong academic credentials with a M.S. in Computer Science, Statistics, Data Science or related field with a preference for Ph.D.Rigorous quantitative backgroundComfort with programming (ideally in Python and R)Intellectual curiosity balanced with humilityPredictive modeling experience is preferredApplying to a Data Science role at Upstart: Please apply through our website. If you see multiple Data Science roles open, or if you have applied within the past year, there is no need to apply again. We're currently reviewing all previous applications. We also consider candidates for all levels of Data Science roles when candidates apply. About Us: Upstart is the first lending platform to leverage artificial intelligence and machine learning to price credit and automate the borrowing process. ~80% of U.S. borrowers pay back their loans, yet only ~45% of these people have access to prime credit. Our engineering team uses non-conventional variables at scale in an underwriting model that improves constantly to solve this problem. Upstart was founded by three diverse leaders that bring their individual approach to Upstart creating a culture where “we get to the truth, move fast, and bring everyone in.” Based in San Carlos, CA, Upstart is backed by Google Ventures, KPCB, Khosla Ventures, Founders Fund, First Round Capital, Eric Schmidt, and Mark Cuban."}