{"jobID": "2829264894", "jobLocation": "San_Diego_CA", "jobTitle": "Bioinformatics Scientist", "companyRating": "2.9", "companyInfo": {"Website": "jobs.labcorp.com", "Headquarters": "Burlington, NC", "Size": "10000+ employees", "Founded": " 1995", "Type": " Company - Public (LH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": " Sequenom, a wholly-owned subsidiary of Laboratory Corporation of America Holdings (LabCorp), is a CAP accredited and CLIA-certified molecular diagnostics laboratory, dedicated to the development and commercialization of laboratory-developed tests (LDTs) for prenatal conditions, cancer, and other diseases.  At Sequenom, we foster innovation in molecular diagnostics, and we have a guiding vision in enabling healthier lives through the development of our products and services. Join the Bioinformatics team and take part in expanding the extremities of clinical diagnostics!  We are looking for a Bioinformatics scientist with experience in next generation sequencing and a strong understanding of statistics. The Bioinformatics scientist will have the opportunity to participate in data analyses, datamining, and pipeline development pertaining to company's current and future NIPT products and variety of oncology liquid biopsy projects. The ideal candidate must be able to work in a collaborative research environment and be able to provide evidence of relevant research expertise in the form of presentations, software, technical publications, and/or knowledge of applications. *Responsibilities** : + Analyze and model structured data using advanced statistical methods and implement algorithms and software needed to perform analyses  + Cluster large amounts of R&D; and clinical laboratory generated content  + Perform explanatory data analyses, generate and test working hypotheses, prepare and analyze historical data and identify patterns  + Develop, enhance and QC annotation and interpretation methods for Non-Invasive Prenatal (NIPT) and liquid biopsy (LB) testing *Requirements** + PhD in Bioinformatics, Computational biology, applied Computer Science, Mathematics or Statistics with 0-2 years of relevant experience. Or Master's degree in Bioinformatics or related field with a minimum of 5 years relevant experience in industry setting  + Experience with general NGS data analysis tools such as SAMtools, Picard Tools, Bowtie, BWA  + Comfortable working with command line tools in a Linux shell environment and LSF  + Experience in data mining, information retrieval and machine learning algorithms  + Strong programming skills in R, Perl or Python  + Must be a detail-oriented self-starter who can organize workloads *Shift**1*Schedule** 1st Shift-Monday-Friday  As an EOE/AA employer, the organization will not discriminate in its employment practices due to an applicant's race, color, religion, sex, national origin, sexual orientation, gender identity, disability or veteran status."}