{"jobID": "2788653304", "jobLocation": "Wyandotte_MI", "jobTitle": "Machine Learning and Artificial Intelligence Scientist", "companyRating": "3.9", "companyInfo": {"Website": "www.basf.com", "Headquarters": "Ludwigshafen am Rhein, Germany", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Dow, Eastman"}, "estimatedSalary": "78000", "jobDescription": " At BASF, we create chemistry through the power of connected minds. By balancing economic success with environmental protection and social responsibility, we are building a more sustainable future through chemistry. As the world’s leading chemical company, we help our customers in nearly every industry meet the current and future needs of society through science and innovation. We achieve this through our commitment to continuous improvement and operational excellence, which gives us the opportunity to set and deliver on ambitious, long-term goals.  We provide a challenging and rewarding work environment with a strong emphasis on process safety, as well as the safety of our employees and the communities we operate in, and are always working to form the best team—especially from within, through an emphasis on lifelong learning and development. This allows for our employees to innovate and generate new ideas, put them into action, and gain insights from them to further advance our collective expertise.  At BASF, we are constantly striving to become an even better place to work. BASF has been recognized by Forbes Magazine as one of America’s Best Employers in 2017. We strongly support the spirit of collaboration through effectively involving team members and colleagues from other relevant units when developing and executing strategies and projects. Come join us on our journey to create solutions for a sustainable future! Data Science and AI Scientist (63039655) – Tarrytown,NY, Wyandotte, MI, Charlotte, NC or Iselin, NJ Data Analytics is a core contributor to innovation. Data Analytics comprises Statistics, Machine Learning, and Artificial Intelligence for all kinds of materials, systems, and processes at BASF. We support the live cycle of a material from ideation in research to quality management in production.  If a system observes its environment and takes actions that maximize its chance of success at a given goal, we call it Artificial Intelligence (AI). The mission of the Data Analytics team is to learn from leading institutions in academia and commerce in the region, to develop ML models and algorithms in a global context, and to incubate AI systems in North-America.Where the Chemistry Happens... We are searching for a professional like you to play a key role in the planning, design and execution of machine learning and artificial intelligence applications to accomplish project objectives. You will disseminate the value proposition of data science in our R&D; organization. Through machine learning and artificial intelligence, you enable regular researchers to integrate sophisticated mathematical models into their lab workflow, e.g. by developing tailored apps.  You will be relied on to provide knowledge and expertise in achieving research targets, interpreting results, and reporting them to key stakeholders. Formula for SuccessLeveraging your educational and professional background in data analytics, machine learning, artificial intelligence, or a related scientific discipline, you will conceptualize new projects and programs while contributing to a research direction that provides innovation and breakthrough advantages for the business.Your familiarity with different analytical areas of expertise in AI (e.g., machine/reinforcement learning, statistics, analytics) will be critical as you explore technical possibilities and create ideas together with internal non-AI-expert business partnersSuccessfully engaging across and outside the organization, you will interact frequently with colleagues as well as with consultants and universities.Relying on your strong programming skills, you will develop applications that make complex machine learning models accessible to both lab technicians and business partners.Your strong communication skills help us bridge the gap between mathematics and real world applications.Create Your Own Chemistry: What We Offer You Adding value to our customers begins with adding value to you. You@BASF is the suite of benefits, perks, programs and unique opportunities we offer to support you—the whole you—in all stages of your life and career. With you@BASF, you create your own chemistry.  The total rewards that you receive as a BASF employee go way beyond a paycheck. From competitive health and insurance plans, to robust retirement benefits that include company-matching contributions, to making sure you never stop learning, we believe investing in you is investing in our success. Working for a large, global organization, you’ll have a chance to grow professionally and personally, expand your network and build a rewarding and dynamic career.  BASF provides interesting and challenging learning and developmentopportunities to help you make the most of your talents and your job."}