{"jobID": "2746209590", "jobLocation": "Washington_DC", "jobTitle": "Research Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.jll.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1997", "Type": " Company - Public (JLL) ", "Industry": " Real Estate", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " CBRE, Cushman & Wakefield"}, "estimatedSalary": "64000", "jobDescription": "At JLL we are always looking for great talent for our Research Team. The description listed below is for a position we will recruit for in the near future, and is not a current need. If you are interested in exploring this opportunity please submit your application. If your background is a fit for this position, we will contact you to begin a conversation. If you would like to stay up to date on positions at JLL, please join our Talent Network.Our Analyst will build and continue to elevate a best-in-class research program that differentiates JLL and drives a competitive advantage in the marketplace through market expertise, analysis and insight. You will be responsible for achieving data excellence, to enhance our offerings in the areas of business intelligence, data visualization, and graphical output. Our analyst will have primary responsibility for collecting and analyzing data, maintaining and constantly elevating the quality of our data, and working with the Research team to present data in a compelling way. You will assist in tracking and analyzing all aspects of the local commercial real estate market and will leverage that knowledge proactively for research products, client projects and business development efforts. Our Analyst will have direct responsibility for the DC commercial real estate market and will work closely with JLL research leadership in the DC office, as well as colleagues throughout the Americas research group.What this job involves:Responsible for the collection and auditing of JLL’s proprietary database of commercial real estate properties, lease and sale comps for office, industrial, and retail properties.Collaborate at a high level with local market leadership and sales force to execute the data collection and auditing planSet up processes to ensure data excellence within our proprietary database, and regularly audit and refine datasetsExpand and improve the research platform, program, and output that demonstrates the firm’s market expertise through data excellenceDevelop and share best practice standards for the region and the Americas Research GroupDevelop strong relationships with internal and external clients and facilitate the use of our technology toolsPartner with Research team to enhance the statistical and analytical program for the DC real estate marketsMaintain an acceptable level of data completeness to include data validation and audit levelsPresent as needed to internal teams and clients to demonstrate our tools and abilitiesCreate compelling visual communications, integrating JLL’s proprietary research data, for the purposes of business development, external distribution, and client requestsSound like you? Before you apply it’s worth knowing what we are looking for:Strong organizational, data collection, validation and auditing skills.Up to one year in commercial real estate research, economic and demographic analysis or closely related fieldCommand of local markets and businessHigh level analytical skills and problem solving ability and written and oral communication skillsAbility to execute and professionally meet client expectations and positively represent the firmAbility to multi-task, succeed under pressure and effectively manage time and workloadProactive and strategic thinking and ability to align research with the business and innovate research outputCommand of requisite technology including Excel, PowerPoint, and Word and database systemsComfort with visualization toolsBachelor’s degree in business, economics or related field requiredMotivated and self-starting with a desire to succeed and contribute to the success of a teamA desire to work within a diverse, collaborative, and driven professional environmentAbout JLL Research:JLL Research consists of 400 full time professionals globally and is the largest research group in the real estate industry and among the best of any world-wide professional services firm. Our mission is \\\"To create clear competitive advantage for our clients through the strategic use of accurate data, market intelligence and innovative thinking from around the world\\\". Our research activities include maintaining comprehensive property market databases, analyzing current market conditions and future trends, understanding the factors that drive property performance and occupancy trends, and providing research-led strategy and advice to investors, developers and occupiers around the world. We are committed to developing new metrics and methodological tools to capture and understand the factors driving office, retail and warehousing/logistics real estate markets across the world and bring insight to the future for our clients.What you can expect from us:You’ll join an entrepreneurial, inclusive culture. One where we succeed together – across the desk and around the globe. Where like-minded people work naturally together to achieve great things.Our Total Rewards program reflects our commitment to helping you achieve your ambitions in career, recognition, wellbeing, benefits and pay. We’ll offer you a competitive salary and benefits package.Join us to develop your strengths and enjoy a fulfilling career full of varied experiences. Keep those ambitions in sights and imagine where JLL can take you.Apply today!#LIJLL Is an Equal Opportunity EmployerJLL is committed to developing and maintaining a diverse workforce. JLL strongly believes in equal opportunity extended to all individuals in all aspects of the employment relationship, including recruitment, hiring, training, promotion, transfer, discipline, layoff, recall and termination without regard to race, color, religion, belief, creed, age, sex, pregnancy or maternity (including childbirth and related conditions), family responsibility (e.g. child care, elder care), nationality, ethnic or national origin or ancestry, citizenship, marital status, civil partner status, sexual orientation, gender identity or expression, transgender status, veteran’s status, genetic information, trade union membership, social position, political view or status as a qualified individual with a disability, protected leave status or any other protected characteristic in accordance with applicable law. The company also endeavors to make reasonable accommodations for known physical or mental limitations of otherwise qualified employees and applicants with disabilities unless the accommodations would impose an undue hardship on the operation of our business and ensures that employment decisions are based only on valid job requirements.For employees in the United States, please see a fully copy of our Equal Employment Opportunity and Affirmative Action policy at https://jll2.sharepoint.com/CorporatePolicies/HR%20Policies/Equal%20Employment%20Opportunity%20and%20Affirmative%20Action.pdf. If you have questions about careers at JLL or are disabled and require further assistance in applying for a position, please contact us at careers@am.jll.com"}