{"jobID": "2753373860", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst III, Business Insights", "companyRating": "3.0", "companyInfo": {"Website": "www.lacare.org", "Headquarters": "Los Angeles, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Government", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Health Net, Kaiser Permanente, Molina Healthcare"}, "estimatedSalary": "102000", "jobDescription": " Data Analyst III, Business Insights Job Category:  Information Technology Department:  Enterprise Data Strategy (307) Location:  Los Angeles HQ, California, US Position Type:  Full Time Requisition ID:  802 DUTIES:The Data Analyst III of Business Insights is responsible for supporting short and long term operational and/or strategic business initiatives. This role will develop, enhance, and maintain operational information and models that will have an impact on business decisions. Through the application of data analytics, joining disparate data sources, and working with raw data, this role will work to deliver valuable insights and recommendations to improve operational performance.  The Data Analyst III of Business Insights will work in a highly matrixed environment, working closely with senior leaders, management, and line staff to understand root cause, propose recommendations for improvement, and develop solutions on key business challenges. This position will serve as a mentor to team members. QUALIFICATIONS & REQUIREMENTSEDUCATION:Required: High School Diploma Preferred: Associate's or Bachelor's Degree in Computer Science, Finance, Engineering, Math, Physics, Economics and other related technical disciplines. EXPERIENCE:Required: With High School Diploma: At least 10 years of collecting, manipulating, and analyzing data in business and/or finance Preferred: With Associate's Degree: 7 years of collecting, manipulating, and analyzing data in business and/or finance  With Bachelor's Degree: 5 years of collecting, manipulating, and analyzing data in business and/or finance  With Master's Degree: 3 years of collecting, manipulating, and analyzing data in business and/or finance"}