{"jobID": "2786871401", "jobLocation": "Menlo_Park_CA", "jobTitle": "Pharmacokinetics & Metabolism Scientist", "companyRating": null, "companyInfo": {"Website": "www.sri.com", "Headquarters": "Menlo Park, CA", "Size": "1001 to 5000 employees", "Founded": " 1946", "Type": " Nonprofit Organization", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " SAIC, Leidos, Battelle"}, "estimatedSalary": null, "jobDescription": "Title Pharmacokinetics & Metabolism Scientist  21-May-2018 Job Description The Drug Metabolism and Pharmacokinetics (DMPK) group at SRI International seeks a highly qualified candidate to perform pharmacokinetic (PK), toxicokinetic (TK), and pharmacodynamic (PD) data analyses from in vivo studies. Responsibilities include performing PK (GLP and non-GLP) analyses, PK/PD analyses, and predictive PK and TK modeling using appropriate recent software, e.g. Phoenix WinNonlin, and scientific interpretation of PK/TK data and writing study reports for submission to the FDA. The candidate may also assume the role of a Study Director to conduct non-GLP and GLP studies supported by NIH and other government funds and commercial sources, which will include planning and management of all aspects of in vivo studies including preparation of study protocols and coordination with other groups (such as Bioanalytical Chemistry, Formulation, and Toxicology). The studies will include compounds of various therapeutic classes (e.g. neurotherapeutics, anti-cancer, anti-infective). The scientist will participate or assume lead authorship in resulting manuscripts from these studies and present abstracts in meetings/conferences. Opportunities also exist within our group to pursue independent research interests in the form of grants and contracts, as well as working closely with other research scientists/mentors in the areas of drug metabolism, pharmacokinetics and toxicology. Auto req ID1616BRLocation(s) Menlo Park, CA Other Requirements-A post-offer, pre-laboratory placement physical examination may be required.Employment Status Full Time Qualifications Ph.D. degree in Pharmacokinetics, Pharmaceutical Sciences, Pharmacology, Toxicology or related discipline with 1 – 3 years of post-doctoral experience in academia or industry. Experience in advanced PK and PK/PD modeling and use of appropriate software and interpretation of PK/PD data is required. Experience with performing clinical pharmacokinetic data analysis is desirable. Experience report writing for preclinical GLP studies is highly desirable. Excellent skills in written and oral communication as well as time management/multi-tasking are required. EOE/AA SRI is an Equal Opportunity Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. Background Check Candidates who receive a conditional offer of employment will be subject to a background check. "}