{"jobID": "2542100430", "jobLocation": "Jersey_City_NJ", "jobTitle": "Data Analyst - Expert", "companyRating": null, "companyInfo": {"Website": "www.eclaroit.com", "Headquarters": "New York, NY", "Size": "51 to 200 employees", "Founded": " 1999", "Type": " Contract", "Industry": " Information Technology", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Data Analyst - Expert Kick start your career in Financial Services. Eclaro is looking for a Data Analyst - Expert for our client in Jersey City, NJ.Eclaro’s client is a full-service bank providing a wide spectrum of corporate, commercial, retail banking, and wealth management solutions with offices across the United States. If you’re up to the challenge, then take a chance at this rewarding opportunity!RESPONSIBILITIES:Requirements Elicitation, Gathering, Clarification, and Analysis.Participate in the creation of Business Requirements Document.Use Case Analysis and Documentation.Data Analysis and Documentation and proficiency in SQL.Create Functional Design Document. Create Detailed Design Document.Ensure business requirements are organized and coherent for application architects and developers to understand.Test Planning and Coordination.Ensure application meets business requirements.Create and Track Test Plans, Cases, and Scripts. Migration Planning and Coordination.Provide Project Support (Issues Tracking, User Training).Create Application Documentation (User Guide, Operations Guide, Training Manual, etc.).Familiarity with modern web application designs and concepts.Strong knowledge of Software Development Life Cycle (SDLC).Work with business for requirements.Work with technical team to write the detailed and functional design documents.EXPERIENCE/SKILLS REQUIRED:Individual will have up to 8-10+ years of experience.Strong ETL and Data Warehouse knowledge is a plusIf hired, you will enjoy the following Eclaro Benefits:401k Retirement Savings Plan administered by Merrill LynchTransitChek Pretax Commuter BenefitsEligibility to purchase Medical, Dental & Vision Insurance through EclaroInterested in applying? Contact Anne Amorsolo at Anne@eclaro.com now.Equal Opportunity Employer: Eclaro values diversity and does not discriminate based on Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status."}