{"jobID": "2837403484", "jobLocation": "San_Francisco_CA", "jobTitle": "Digital Marketing Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " This is an incredible opportunity for an experienced analyst with a strong background in digital marketing to be part of a team that is leading the creation of a center of digital excellence. You will be working for our clients Media & Entertainment division but also have responsibilities for their product brands  As an analyst of our client team, you will lead efforts that analyze data (by channel, across channels and cross device) to glean business insights and behaviors that help tweak or alter the clients digital marketing strategy. You will play a key role in determine next stage iterations on testing, content, copy, go-to-market strategy and many other important aspects of marketing programs to gain better engagement, subscriptions and long-term revenue.  This role encompasses analysis of all areas of the marketing funnel: awareness (social media channels/content/video/blogs), consideration (trials, ebooks, Youtube tutorial videos, forums), Purchase (cart optimization tactics, pricing strategy) and retention (working with renewal teams and cart teams to optimize pull through and increase ARR (Annual recurring revenue).  The ideal candidate must be analytical but possess the skills to translate data into simple business strategies for all levels of leadership. This person will be responsible for daily/weekly monitoring as well as leading meetings to help relay key data points and recommended strategies for digital marketing. If you are the person who is interested in not only doing data analysis for a single digital channel - but across all and over many devices, then this position is for you.  Your entrepreneurial/analytical mindset and hands-on approach will be key in driving the digital strategy forward. Responsibilities: Focus on the paid channels and optimize spending based on analysis, refine and optimize the end-to-end campaign strategy and tactics for lead acquisition and conversionCharting new territory in defining digital attribution methods and practicesHelp monitor the launch of new channels to recommend tweaks to the strategy, experience or buy to lower costs and increase conversionsSome advanced analysis to identify correlations like regression analysisPulling and synthesizing data from sources like Impact Radius, Data warehouse, Adobe Analytics, Google Analytics, etc. Weekly reports out and quarterly business summariesWorking with internal digital marketing strategy team members to identify trends quickly and work with them on monitoring recommended actionsOverall accountability forecasting, business monitoring and trend analystMinimum Qualifications:BS undergraduate degree, MBA a plus5+ years of experience in analytics for a consumer brand and/or a B2B brandPreferred Qualifications:Strong understanding of digital technologyattribution, cookies, cross channel cannibalization, and understanding how the various digital channels workStrong communicatorable to take analysis and communicate key findings or learnings in an easy to understand formatSolid understanding of online conversion optimization and UX principlesUnafraid to try new things or challenge the status quoJob Type: Full-time Experience:"}