{"jobID": "2810000997", "jobLocation": "Oakland_NJ", "jobTitle": "Machine Learning Scientist/Engineer", "companyRating": "3.3", "companyInfo": {"Website": "www.topcon.co.jp", "Headquarters": "ITABASHI-KU, Japan", "Size": "1001 to 5000 employees", "Founded": " Unknown", "Type": " Company - Public (77320) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": " Topcon Healthcare Solutions (THS), headquartered in Oakland, NJ, is a leading software engineering company of the eye care industry. THS is responsible for R&D;, engineering, marketing, sales, and support of software solutions to the global market.  Topcon's mission is to make the impossible possible, by constantly innovating optical, imaging, and measurement technologies and developing new and advanced image management and networking solutions. Our goal is simple: to provide the ophthalmic medical community with the most innovative and indispensable software solutions so that doctors and researchers can better serve patients, ultimately improving outcomes in eye and vision care. THS is newly established in 2017 to provide the most advanced software solutions to the global market. We focus on IoT, Cloud and AI technologies to enable “Healthcare through the eye”.  Topcon Healthcare Solutions is a wholly owned subsidiary of Topcon Corporation of Tokyo, Japan.  An exciting opportunity for a highly motivated scientist/software engineer to work creatively within a dedicated R&D; team with global impact contributing to cutting-edge ophthalmic medical devices. Primary responsibilities include the following: Develop machine learning/deep learning algorithms and infrastructure for medical imaging applications, including detecting and classifying objects, biomarkers, and pathologies in 2D and 3D medical images.Intellectual ownership and responsibility related to the design, development, testing and delivery of the machine learning and image analysis algorithms into the Topcon production workflow.Support both prototype and commercial system development efforts, including work with internal teams and customers to enhance the solution and systems, troubleshooting etc.Keep up with the latest deep learning and big data analysis techniques, especially in the medical imaging field. You will need to be able to demonstrate a keen knowledge and expertise in machine learning as well as the ability to generate production quality code. Qualifications: Expertise in C/C++ and Python required.Familiarity with Ubuntu, Tensorflow, and Keras, hands-on experience with machine learning and deep learning required, especially in image classification, object detection and localization.Experience in image and video processing, computer vision, augmented reality (AR), or virtual reality (VR), and algorithm development experience strongly preferred.Experience with cloud computing and big data analysis highly preferred.Experience in high-performance scientific computing and GPU programming preferred.Familiarity with medical imaging and prior experience working in the medical device field a plus.Excellent oral and communications skills required.Must be a team player with a strong work ethic.2 to 5 years industry experience or equivalent laboratory experience preferred.Educational Requirements:PhD or MS in Computer Science, Computer Engineering, Biomedical Engineering, or Electrical Engineering."}