{"jobID": "2802103472", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist Machine Learning with Asen Computer Associate", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " The position listed below is not with Chicago Interviews but with Asen Computer Associates  ChicagoInterviews is a private organization that works in collaboration with government agencies to promote emerging careers. Our goal is to connect you with supportive resources to supplement your skills in order to attain your dream career. Job Description Position: Data Scientist  Duration: Contract to Hire/ Full Time  Location: Northbrook, IL  The successful Data Scientist will translate business needs into analytic questions; design and conduct rigorous analyses of clinical, financial, customer, and operational data; and translate these analytic findings into predictive models and evaluation results for our business partners.  Key job functions include, but are not limited to, the following:  · Consulting with key internal and external stakeholders to determine how best to leverage machine learning and advanced analytic methods to support business objectives across CVS Health.  · Able to select several potential appropriate modeling approaches for a given analytic problem (machine learning methods such as ensemble models, decision trees; operations research; statistical modeling such as multivariate techniques).  · Efficiently implement the models in a variety of modeling tools, achieving highly accurate models.  · Understands the underlying statistical concepts and computational approaches that enable efficient execution of models and may be able to design and implement modifications and enhancements to the computations.  · Developing sound analytic plans based on available data sources, business partner needs, and required timelines.  · Able to apply innovative approaches to understand and predict what will happen across the business.  · Managing deliverables across multiple projects in a deadline-driven environment and project related to a wide variety of business settings and clinical needs.  · Presenting analytic findings in a variety of formats (reports, PPT, graphs, figures and tables), formulating recommendations, and effectively presenting the results to non-analytic audiences.  Required Qualifications To be considered for this exciting opportunity on the Advanced Analytics team, candidates will need to have the following experience: A minimum of 5 years of professional post-graduate experience in constructing, validating, and executing machine learning solutions.Advanced skills and training in machine learning in areas such as: Random Forest, Decision Trees, Neural Networks, Ensemble Models, Operations Research, Generalized Linear Models, Stochastic Modeling and Multivariate Analysis.Experience in translating business problems across disciplines into advanced analytic projects with measurable business value.Experience with theoretical modeling approaches and matching analytic modeling approaches to a wide range of business applicationsAnalytics experience within the retail and/or financial services, with experience deploying capabilities across a wide range of business disciplines.Demonstrated effective project management and time management skills.A strong curiosity to explore and uncover hidden relationships in data, and a proactive desire to translate findings into actionable business insights.Fluent and recent hands-on experiences in R, Python, SAS, etc. Experience with computer development languages (Java, C++). Preferred Qualifications Familiarity with navigating in both a relational (Teradata-based) and non-relational (Hadoop) environment.Recent hands-on experience with finance modeling, pricing elasticity, optimization, and value at risk (VaR) is strongly preferred.Education PhD in Statistics, Computer Science, Mathematics, Economics, or directly related field.  Will also consider candidates with a Master’s degree in these fields, plus 7+ years of relevant post graduate professional paid work experience with an outstanding track record of developing and deploying advanced quantitative analytics to support business objectives  ​Company DescriptionAsen has been in business since 1975 and we are 1st tier preferred vendors for our MSP,VMS clients. Fortune 500 companies. We stay in the top 5 on most recent report cards for IT,Clinical, Creative and Engineering. Our recruiters are well trained and long time employees who love to pick up the phone and talk to you. Bringing our business back to personal to get the best candidates for the positions we are looking to fill. We are a certified woman owned company with government security clearance.  Apply"}