{"jobID": "2792433888", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.ibm.com", "Headquarters": "Armonk, NY", "Size": "10000+ employees", "Founded": " 1911", "Type": " Company - Public (IBM) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Accenture, Microsoft"}, "estimatedSalary": "112000", "jobDescription": "Job Description IBM Global Business Services (GBS) is a team of business, strategy and technology consultants enabling enterprises to make smarter decisions and providing unparalleled client and consumer experiences in cognitive, data analytics, cloud technology and mobile app development. With global reach, outcome-focused methodologies and deep industry expertise, IBM GBS empowers clients to digitally reinvent their business and get the competitive edge in the cognitive era in over 170 countries. DO YOUR BEST WORK EVER The Public Service consulting practice is a trusted advisor to federal, state and local governments, partnering to meet challenges and responding quickly to citizen demands, business needs, new economic conditions, and changing legislative priorities and policies.  Ready to transform the way the Federal Government works and solves its problems? At IBM, we're strongly committed to the advancement of open Internet standards and applications. Join us to help IBM deliver world-class solutions for our public service customers - some of the most important customers in the world! Show them how the complex can be made easy.  The Data Scientist collaborates with customer base to discover knowledge in very large data collections and develop/apply machine learning to data problems. Gathers, analyzes, and portrays data in meaningful ways.  Level (entry, journeyman, senior, master) will be determined based on education and years of experience.  This position is contingent on the contract being awarded to IBM by the US Federal Government. It is located in northern Virginia. BENEFITS Health Insurance. Paid time off. Corporate Holidays. Sick leave. Family planning. Financial Guidance. Competitive 401K. Training and Learning. We continue to expand our benefits and programs, offering some of the best support, guidance and coverage for a diverse employee population. CAREER GROWTH Our goal is to be essential to the world, which starts with our people. Company wide we kicked off an internal talent strategy program called Go Organic. At our core, we are committed to believing and investing in our workforce through:  Skill development: helping our employees grow their foundational skills  Finding the dream job at IBM: navigating our company with the potential for many careers by channeling an employees strengths and career aspirations  Diversity of people: Diversity of thought driving collective innovation  In 2015, Go Organic filled approximately 50% of our open positions with internal talent that were promoted into the role. CORPORATE CITIZENSHIP With an employee population of 375,000 in over 170 countries, amazingly we connect, collaborate, and care. IBMers drive a corporate culture of shared responsibility. We love grand challenges and everyday improvements for our company and for the world. We care about each other, our clients, and the communities we live, work, and play in!  http://www.ibm.com/ibm/responsibility/initiatives.html  http://www.ibm.com/ibm/responsibility/corporateservicecorp (2252) PSHJ GBSTSSCI TSSCIFSP18 Required Technical and Professional Expertise Active TS/SCI clearance + Full Scope PolygraphFive or more years experiences as a data scientist or quantitative analystKnowledge of R and/ or scripting languages (e.g. Pig, Python, SciPy)Experience working in the Intelligence CommunityBachelors degree or equivalent experience Preferred Tech and Prof Experience Experience analyzing large volumes of dataAdvanced degreeKnowledge of JavaFamiliarity with HadoopExperience with statistics and/ or data visualization tools such as i2 Analysts Notebook, Palantir, Tableau, Microsoft BI, Excel PowerQuery and PowerPivot, and/ or SPSS Modeler EO Statement  IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status. "}