{"jobID": "2815748914", "jobLocation": "Stanford_CA", "jobTitle": "Data and Reporting Analyst, Strategic Reporting and Analytics", "companyRating": "4.2", "companyInfo": {"Website": "www.stanford.edu", "Headquarters": "Stanford, CA", "Size": "10000+ employees", "Founded": " 1891", "Type": " College / University", "Industry": " Education", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "75000", "jobDescription": "79392Job Code: 4745  Job Grade: I Data Analyst 2 –  Medical Center Development Note: Not all unique aspects of the job are covered by this job  description This  position will be moving to the new Stanford Redwood City campus in mid-2019.JOB PURPOSE:Under minimal supervision, perform  the most complex technical work associated with a wide variety of analytical  data and produce routine, single data sources’ information requests.About  Medical Center Development:Medical Center  Development (“MCD”), a division within Stanford University’s Office of  Development, provides fundraising support for the key institutional  priorities of Stanford Medicine, comprised of Stanford University Medical  School – a premier research-intensive medical school, and Stanford Health Care  – nationally recognized for quality patient care and leading-edge technology.  With its donor-centric approach to development, every staff member within the  Office of Development plays a role in providing the university’s donors with  the service and attention that ensures an exceptionally positive and fulfilling  philanthropic experience.  Stanford  MCD is the fundraising office for Stanford  Medicine, which comprises Stanford’s School of Medicine and the broader  Stanford Health Care system. Stanford Medicine successfully completely  five-year $1.7B+ fundraising campaign in 2016.  The  Research, Strategic Reporting, and Prospect Advancement team in Stanford MCD seeks  candidates for an experienced data analyst within the team. The role supports  the strategic reports and systems which provide high-level business  intelligence on prospect pipelines and financial progress to MCD’s executive  leadership and managers.CORE DUTIES*:Work under  consultative or self-initiated direction to assess and produce relevant,  standard, or custom information (reports, charts, graphs and tables) from  structured data sources by querying data repositories and generating the  associated information. Distribute and disseminate reports to applicable  agencies, researchers, management and other internal end-users.Devise  methods for identifying data patterns, trends in available information  sources using a variety of qualitative and quantitative techniques.  Determine and recommend additional data collection and reporting  requirements.Design and customize  reports based upon data in the databases including Postgrads, PostPAM  (SQL), CARD (Salesforce) and OBI Financials.Create  non-routine databases and their related information summary; develop  algorithms and statistical model; and perform statistical analyses  appropriate to complex data and reporting requirements.Serve as a resource  for non-routine inquiries such as requests for statistics or surveys.Lead the  implementation of data standards and common data elements for data  collection.Collaborate  with technical staff and partner teams to  standardize and systematize routine reports, dashboards, and reporting metrics.May test prototype  software and participate in approval and release process for new software. * - Other duties may also be  assignedMINIMUM REQUIREMENTS:Education & Experience:Bachelor's degree and three years  of relevant experience or combination of education and relevant experience.  Experience in a quantitative discipline such as economics, finance, statistics  or engineering.Knowledge, Skills and Abilities:In-depth knowledge  and experience using and applying analytical software, database management  system software, database reporting software, database user interface and  query software, and data mining software.Expert ability to  collect data using a variety of methods, such as data mining and hardcopy  or electronic documentation study, to improve or expand databases.Ability  to operate with a high level of discretion, as the data extracted is highly  confidential and protected under HIPPA.Strong listening,  verbal and written communication skills.Ability to manage  multiple activities in a deadline-oriented environment; highly organized,  flexible and rigorous attention to detail.Ability to use  logic to calculate data; efficiently construct a database or scrutinize  the form of a question.Ability to work  with data of varying levels of quality and validity.Demonstrated  ability to produce data in a clear and understandable manner meeting user  requirements.Ability to work  effectively with multiple internal and external customers.Ability to take a  leadership role on projects and with users/clients.Certifications and Licenses:"}