{"jobID": "2836349391", "jobLocation": "Princeton_NJ", "jobTitle": "Applied Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.wolterskluwer.com", "Headquarters": "Alphen aan den Rijn, Netherlands", "Size": "10000+ employees", "Founded": " 1836", "Type": " Company - Public (WKL) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thomson Reuters, Pearson"}, "estimatedSalary": "101000", "jobDescription": " Wolters Kluwer Global Business Services is designed to provide services to the business units in the areas of technology, sourcing, procurement, legal, finance, and accounting which includes our North American-Accounting Center. These global centers promote team collaboration using best practices around a specific focus area to drive results and enhance operational efficiencies. There is a constant endeavor to benchmark against best-in-class industry standards to improve the quality of deliverables, increase cost savings, enhance productivity and reduce time to market for products and applications.  Do you want to use your skills and talent to make a meaningful impact to deliver expert solutions in a diverse set of professional domains: healthcare, compliance, legal and regulatory and tax and accounting?  Wolters Kluwer is a fast-growing and innovation-driven global company that has successfully made a transition from print publishing to a digitally-driven provider of professional software, online expert content and integrated workflow products.  We are searching for a data scientist who is passionate about technology and solving real world problems to build models and applications in areas such Machine Learning, Deep Learning and Natural Language Processing. You should be willing to take on challenges of unknown dimensions, and work hand in hand with business, product leaders, customers, and developers. You will need to have very strong technical skills in data sciences and a proven ability to deliver customer-facing products to the market.  Reporting into the Information Solutions and Advanced Technology team, this role is crucial to the continued growth and evolution of one of the leading companies providing expert solutions to the healthcare, compliance, legal and tax markets globally.  We are looking for an Applied Data Scientist for our Artificial Intelligence, Cognitive Computing and NLP division! Responsibilities:Develop Predictive models with AI, Deep Learning networks, Gradient Boosting, Random Forest, SVM, and Logistic Regression using both generative and discriminative algorithmsPerform data insights analysis using clustering, agglomerative clustering, graph based clustering, and analysisDefine and develop features (abstract), selections, and ranking with PCA, Ridge/Lasso, or Deep LearningModel problems using Differential/Difference Equations, ARMA/ARIMA, Monte Carlo methods or Markov modelsDevelop algorithms using Reinforcement Learning and/or similar methodsEngage as a key member of the advanced technology team to investigate solutions and support their delivery to productionRapidly research, experiment and build prototypes using commercial, Open Source and proprietary solutions for machine learning, deep learning and NLP including an assessment of production suitabilityDevelop data science solutions in a highly collaborative team, that can cost effectively be leveraged across the organizationCommunicate prototype results in an actionable form, including lessons learned and next steps for technical teams in the AI CoE and other technology groupsIdentify and drive best practices for data science solutions developmentA self-starter who can align the technology solution with a business goalAssess various machine learning frameworks and packagesCollaborate effectively with other data sciences teams across Wolters Kluwer to align on direction and leverage existing tools and knowledgeMonitor trends in Machine Learning, Deep Learning and NLP to influence the solutions within all Wolters Kluwer divisionsAuthor peer reviewed journal articles and white papers related to the Data Science solutionsQualifications* Required Masters in Computer Science, Engineering, Mathematics or equivalentPreferred: PhD in Computer Science, Engineering, Mathematics or equivalent; specializing in machine learning or a related fieldA passion for excellence and exceeding customer expectations is requiredActive listening skills, and deep analytical ability are required1 year experience in Software engineering1 year experience in analyzing dataFamiliar with Python and Shell ScriptsExperience in Text Mining and NLP is highly recommendedDemonstrated ability to function in multi-disciplinary teams across technology and businessStrong written and oral communication skillsDemonstrate professional scholarly activity: conference presentations, published in peer-reviewed publications / journals is required Preferred Qualifications  The following is highly desired, but not required: PhD with academic experience in machine learning or deep learning or NLPStrongly prefer Experience in Data Science, Machine Learning, and/or Deep LearningStrongly prefer Experience in programming in languages such as Python, R, Java, or C/C+ About Wolters Kluwer  Wolters Kluwer N.V. (AEX: WKL) is a global leader in information services and solutions for professionals in the health, tax and accounting, risk and compliance, finance and legal sectors. We help our customers make critical decisions every day by providing expert solutions that combine deep domain knowledge with specialized technology and services.  Wolters Kluwer reported 2016 annual revenues of 4.3 billion. The company, headquartered in Alphen aan den Rijn, the Netherlands, serves customers in over 180 countries, maintains operations in over 40 countries and employs 19,000 people worldwide.  Wolters Kluwer shares are listed on Euronext Amsterdam (WKL) and are included in the AEX and Euronext 100 indices.  For more information about our solutions and organization, visit www.wolterskluwer.com, follow us on Twitter, Facebook, LinkedIn, and YouTube. EQUAL EMPLOYMENT OPPORTUNITY Wolters Kluwer U. S. Corporation and all of its subsidiaries, divisions and customer/business units is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orie"}