{"jobID": "2822287753", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.vungle.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " AdColony, Unity, AppLovin"}, "estimatedSalary": "125000", "jobDescription": " Vungle's mission is to deliver the most engaging video ads in apps. The data science team models the effectiveness of hundreds of millions of daily video views across different apps, users, languages, and geographies, to name a few. We work with tens of thousands of advertisers, providing customized predictive models on their behalf for all sorts of metrics like user value, app installs, and future in-app purchases. Our teams work with app developers on the same scale, ensuring they get the highest possible revenue from the ads within their apps.  Our data scientists work hand in hand with machine learning engineers to design and maintain production systems that process hundreds of millions of ad requests daily. Data scientists work on the offline models as well as the real-time production code, relying on frameworks like Apache Spark, TensorFlow, and scikit-learn, as well as custom implementations of the latest machine learning algorithms.  Our data scientists are highly engaged with Vungles business. We help determine product requirements, provide frameworks for network-wide multivariate testing, consult with sales operations to inform various optimization projects, and deliver insights about the workings of our predictive models to a broad audience. What youll do:Explain statistical and machine learning concepts to both technical and non-technical audiencesBe eager to apply your data science skills across a broad range of business and technical problemsPerform offline analysis, feature engineering, model design, and online testing to improve modelsMaintain current knowledge regarding relevant research and publications in the fieldRequirements:2+ years of experience as a data scientist with 5+ years of total experienceStrong production level skills applying machine learning to large scale data problems1+ years experience developing statistical models for production applications1+ years professional experience with at least one programming language, such as Python, Java, Scala (we primarily use Python)Strong understanding of fundamental machine learning concepts and algorithmsExpert in SQL and comfortable with various SQL or noSQL databasesExperience producing data visualizations and presentations in a professional environmentPreferred:PhD or MS work specifically involved the application of machine learning and data science techniquesExperience mentoring junior data scientistsPrior experience with Spark or HadoopExperience with TensorFlow, SparkML and scikit-learnAbout Vungle: Vungle is the leading performance marketing platform for in-app video ads. Advertisers depend on Vungle's creative and LTV optimization technologies to reach and acquire high-value users worldwide. Top publishers rely on Vungle to generate revenue with engaging video ads that enhance the user experience.  Vungle is trusted by 50,000+ mobile apps worldwide with key developer and advertiser partners such as Supercell, King, Zynga, EA, Ubisoft, Smule, MZ, Google, Honda, Allstate, Procter and Gamble, L'Oreal, Coca-Cola, and Nissan. Vungle serves 3+ billion video views per month on 350+ million unique devices and is consistently ranked #1 for cross-platform user retention by industry mobile performance indexes. Vungle is backed by Google Ventures, Thomvest Ventures, Crosslink Capital and SoftTech VC. The company is headquartered in San Francisco with offices in New York, London, Berlin, Beijing, Tokyo, Singapore, and Seoul."}