{"jobID": "2792275839", "jobLocation": "Dearborn_MI", "jobTitle": "Data Scientist - IoT and Supply Chain Analytics Innovation", "companyRating": "3.9", "companyInfo": {"Website": "www.ford.com", "Headquarters": "Dearborn, MI", "Size": "10000+ employees", "Founded": " 1903", "Type": " Company - Public (F) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Tesla, General Motors, Uber"}, "estimatedSalary": "102000", "jobDescription": "Job DescriptionPosition Description/Overview Ford Motor Company's Global Data, Insight, and Analytics (GDIA) organization is looking for a seasoned analytic professional that has a deep business understanding of data science. You will have the opportunity to work with some of the brightest global subject matter experts that are transforming the automobile industry.  The role spans the full lifecycle from analytic question definition, through data gathering, analysis, reporting/visualization development, testing, and operational deployment and support iterations. The incumbent must be able to work with business users to gather goals and illicit requirements, translate those into technical designs, coordinate with multiple source data owners, and then develop the end user friendly reporting and analytics platform of standard reports and self-service analytics interfaces.  This role requires a detail oriented, creative technologist, comfortable working in a highly collaborative, entrepreneurial environment, able to work with a variety of customers and manage and prioritize competing customer demands, while incrementally building an integrated reporting and analytics self-service platform end state vision. Responsibilities Identify and explore white space projects leveraging IoT, Supply Chain, Manufacturing and PD analytics to reduce production cost and improve efficiency of Ford Supply Chain operations: Work closely with GDIA Supply Chain and Manufacturing Departments, R&A;, IT, MP&L; and Manufacturing to develop efficient and effective data collection models and methodsDevelop methods and tool chain for production scheduling and logistics optimizationWork with IT to explore the opportunities for business viable propositions based on IoT analyticsConduct analysis of large data sets to distill insights and connect disparate ideas into cohesive recommendations and executive presentationsFacilitate data quality processes and consistent use and adoption of measures, hierarchies, tools and reporting standards.Develop models to assess trends, project needs, surface challenges, and estimate costsJob Requirements:Basic Qualifications:Master's degree in computer science, operations research, artificial intelligence, or applied sciences OR in lieu of Masters degree, a Bachelor's degree AND 10+ years of similar technical experience2+ years of experience using quantitative and qualitative analytical strategies and working with multiple data sources to generate insights from analyses (e.g. dashboards, tables, metrics), answering questions or creating solutions, and manipulating data (e.g., check for data issues, clean, merge)2+ years of experience using data visualization (e.g., tables, charts, graphs) to tell a storyPreferred QualificationsPh.D. degree preferred2+ experience in IoT communication protocols and technology including MQTT, RFID, NFC preferred5+ years experience in MP&L;, IT or Supply Chain2+ years of project management experience2+ years of experience in using SQL and Excel Macros highly preferredAPICS CPIM or INFORMS Supply Chain Management CertificationProven track record of innovation (patents, trade secrets, research papers)Proven capability to balance multiple priorities, and excellent written and visual communication skillsA strong sense of curiosity about the world and social behaviorStrong desire and aptitude for deep analysis, building models, designing impactful data visualizationExperience working with Analytics, Data Science, or Business AnalyticsExperience with Ford IT, MP&L;, ManufacturingAbility to handle multiple tasks and responsibilitiesStrong business communication, presentation and writing skillsAbility to communicate technical information and data to a non-technical audience in a logical, concise mannerAbility to understand strategic objectives and translate into delivery via compelling, well framed presentationsStrong problem formulation and problem solving skillsSuperior learning agility; able to learn independently from a variety of sources; ability to thrive in ambiguous situationsCollaboration skills to develop buy-in and consensus that drives progress and results At Ford Motor Company, the distance between you and an amazing career has never been shorter. Join the Ford team today, and discover the benefits, rewards and development opportunities youd expect from a diverse global leader.  Candidates for positions with Ford Motor Company must be legally authorized to work in the United States. Verification of employment eligibility will be required at the time of hire. Visa sponsorship is not available for this position.  Ford Motor Company is an equal opportunity employer committed to a culturally diverse workforce. All qualified applicants will receive consideration for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, disability status or protected veteran status. Ford Motor Company also is committed to take affirmative action to employ and advance in employment such persons. "}