{"jobID": "2817044917", "jobLocation": "Morristown_NJ", "jobTitle": "Senior Data Scientist - Morristown, NJ - $160k +", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Senior Data Scientist - Morristown, NJ - $160k + My client is looking for a Data Scientist to start THIS MONTH! Senior Data Scientist - Morristown, NJ - $160k +Required Experience & Qualifications:Natural Language processing experienceComputer vision, deep learning, and time scale experienceMust have enterprise level experience and largerPhD is preferred as a basic proof of competency, not required.Real production experience in large scale projectsExperience with AWSBenefits & BonusCompetitive base and bonusFull medical/health insuranceOpportunity to work with the newest technology in the industryFree lunches everydayMetro passPaid certificationsWeekly work happy hoursFree Snacks If you or someone you know is interested in this position, please send your resume directly to [Click Here to Email Your Resumé] or call 212-731-8282. My client is looking to start the interview process as soon as possible.  Jefferson Frank is the Amazon Web Services (AWS) recruiter of choice. We work with organizations worldwide to find and deliver the best AWS professionals on the planet. Backed by private equity firm TPG Growth, we have a proven track record servicing the AWS permanent and contract recruitment market and, to date, have worked with over 30,000 organizations globally from our offices in North America, Europe, and Asia-Pacific.  At Jefferson Frank, our mission is simple: we want happy customers. Whether you're an AWS professional walking into your dream AWS job, or an organization hiring an incredible contractor for your cloud migration project, our goal is to deliver an unrivalled customer experience. Work with us and you'll get the personalized experience you deserve - one you'll simply not find at any other recruitment agency. At Jefferson Frank, we find great people great jobs in AWS.  I understand the need for discretion and would welcome the opportunity to speak to any Big Data and cloud analytics candidates that are considering a new career or job either now or in the future. Confidentiality is of the upmost importance. For more information on available AWS Big Data Jobs as well as the cloud market, I can be contacted at 212-731-8282. Please see www.jeffersonfrank.com for more information.  #aws #bigdata #datascience#aws #bigdata #datascience"}