{"jobID": "2837230496", "jobLocation": "Northbrook_IL", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.uleduneering.com", "Headquarters": "Princeton, NJ", "Size": "51 to 200 employees", "Founded": " 1980", "Type": " Company - Public", "Industry": " Education", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " Overview  Other companies make products. We make a difference! Click Here!Contribute to a Safer, More Secure, and More Sustainable World. At UL, we know why we come to work. Thousands of us around the world wake up every day with one common purpose - to make the world a safer, more secure, and more sustainable place to live. We clear the way for our customers to introduce the latest products, technological advances, and systems in an increasingly complex world so they can provide peace of mind to the market. Our integrity is woven throughout our company and shapes the way we approach and deliver our solutions. We are proud that the work we do every day has a meaningful contribution to society. We continue to build upon our legacy of trusted expertise and partnership to keep our communities safe and secure as we march forward into the future. This helps us to sleep better at night, and we are confident that the millions of people we touch rest easier too. Responsibilities Uses advanced mathematical and statistical concepts and theories to collect and analyze data and construct solutions to complex business and research problems. Performs advanced statistical analysis on experimental or business data to identify, validate and quantify solutions based on problem statements from business or research leaders. Constructs advanced predictive models, algorithms and probability engines to support data analysis or product functions; verifies model and algorithm effectiveness based on real-world results. Develops project proposals based on knowledge of applicable business and research domains. Designs research plans and methodologies to generate, collect and analyze data for strategic business programs. Leads data science projects that address strategic business and safety science initiatives that solve customer, industry and societal problemsDevelops innovative and effective approaches to solve analytics, business and research problems.Leads programs of multiple complex experiments, hypotheses, and models to explore significant and complex business and safety science systems.Conducts advanced data analyses using traditional and complex statistical methods. Designs and implements software systems and algorithms to perform analyses on retrospective and real-time data.Aggregates, transforms and integrates multiple, large data sets to test hypothesis, model complex systems and identify patterns. Prepares and analyzes program/model output to allow for efficient data analysis.Writes methodology, analysis and data insights for research papers, proposals and presentations. Synthesizes all aspects of a data science project to lead non-technical audiences through the goals, methods and implications of the project.Transforms complex data and results into creative graphs, tables, charts and other graphics to present and/or share the data in a compelling and concise manner. Ability to \"tell the story\" that is in the data.Works with business leaders and researchers to suggest other projects and initiatives that will advance the organizations goals.Coaches, mentors and teaches data analysts, data scientists and others on the methods, processes, and technologies associated with data science and analytics.Performs other duties as directed.Qualifications University Degree (Equivalent to Master's degree) in Mathematics, Statistics, Computer Science or a related discipline plus generally 5-7 years of experience in data and statistical analysis. Solid technical knowledge and experience working with R, SAS, Java or Python programming language. 3-5 years' experience manipulating large datasets and using databases with experience in general purpose programming language such as Hadoop. Ability to develop solutions to loosely defined business or research problems by leveraging innovative methods on large data sets. Experience using machine learning algorithms, pattern recognition, neural networks and other advanced data science tools. Ability to organize, analyze and correlate data information."}