{"jobID": "2587613632", "jobLocation": "Sunnyvale_CA", "jobTitle": "Lead Data Engineer", "companyRating": "3.4", "companyInfo": {"Website": "www.target.com", "Headquarters": "Minneapolis, MN", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (TGT) ", "Industry": " Unknown", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "131000", "jobDescription": " Description: Data Science and Engineering team at Target is a fast growing, dynamic team. Data Engineers work closely with Data Scientists to create valuable insights using voluminous data collected from external and internal systems. Business operations are empowered with these insights to help achieve Targets overarching purpose of providing joy of everyday shopping to each Target guest.As a Lead Data Engineer, you will be expected to create software solutions using Agile practices and DevOps principles. Responsibilities will include designing, programming, debugging and supporting high quality, distributed, large scale software solutions.We are looking for a highly-motivated engineering professional who is a team player and can engage with both technical and business team members.Key Responsibilities:Develop software systems using test driven development employing continuous integration practicesPartner with other engineers and team members to develop software that meets business needsFollow agile methodology for software development and technical documentationInnovate constantly and stay current with latest technologies while staying focused on solving problems at hand.Requirements3+ years experience in developing software applications1+ years experience working on Bigdata technologies like Hadoop, Spark and Hive.BS degree in Computer Science or related field.Understand application/software development and design.Proficiency in at-least one of the following languages: Java, Scala, PythonWorked on building and supporting Web Services. Experience with REST services preferred.Experience/knowledge of streaming solutions is a plus.Qualifications:"}