{"jobID": "2822169699", "jobLocation": "Amarillo_TX", "jobTitle": "Senior Data Warehouse Analyst", "companyRating": "2.7", "companyInfo": {"Website": "www.ardenthealth.com", "Headquarters": "Nashville, TN", "Size": "10000+ employees", "Founded": " 1993", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": "Ardent Health Services invests in people, technology, facilities and communities, producing high-quality care and extraordinary results. Based in Nashville, Tennessee, Ardent’s subsidiaries own and operate 31 hospitals in seven states with more than 25,000 employees including 1,150 employed providers. Ardent facilities exceed national averages in Overall Hospital Quality Star Rating as ranked by the Centers for Medicare & Medicaid Services; 89 percent of its hospitals received a three-star rating or above in comparison with 73 percent of all hospitals ranked. Seven of the company's hospitals were recognized by Modern Healthcare as \"Best Places to Work\" in 2017 – more than any other system in the country. Ardent's corporate office was named \"Top Work Places\" for Nashville based companies in 2017 & 2018.  We have an exciting opportunity for a Senior Data Warehouse Analyst, Oracle Server to join our Decision Support team.  The Senior Data Warehouse Analyst, Oracle Server is charged with the creation and maintenance of existing reporting functions of AHS’ data warehouse, including all data validations of the Data Warehouse elements. The successful candidate will support the Company’s BI strategy by integrating new developments into existing enterprise reporting solutions. This position should be skilled in BI best practices, assessments, business processes, in-depth data analysis, requirements gathering, data modeling, relational and multi-dimensional databases. This position is a high profile, fast paced position that regularly works with senior company leaders."}