{"jobID": "2637055323", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Scientist - Inference", "companyRating": "4.1", "companyInfo": {"Website": "www.airbnb.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Travel & Tourism", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": "Note: Due to volume of applications we receive, we kindly ask that you only apply to a maximum of one Data Scientist role from among those posted. This does not preclude you from being considered for multiple roles. Thank you. Airbnb has become a global platform that connects travelers and hosts from over 34,000 cities. As such, experimentation is core to our growing business. We want to take a scientific approach to decision-making through careful hypothesis generation and testing and drive actions/refine strategies through insights from experimental analysis.  Our inference data scientists are deep in understanding the complications of running experiments in a two-sided marketplace, power analysis and stopping criterions, and statistical models to improve power/significance. Another interesting problem space is understanding what to do when we are unable to conduct experiments. How do we understand the impact of something new?  We are looking for experienced Data Scientists to join our team and expand upon the work we have done. Here are some examples of projects we currently need help with: Develop experiments to reduce friction in the listing creation process for hostsDesigning experiments to measure the lift when displaying hotel rooms on our platformCreate product experiments (on service fees, early demand, etc) and measure the impact on market dynamics (such as competitors).Improve the statistical methodology behind our experimentation platform to ensure that our understanding of product changes is rigorous and accurate To learn more, read about our Inference data science work: 4 Principles for Making Experimentation CountScaling Airbnb's Experimentation Platform We have a strong team of Data Scientists, our work is highly sought-after, and our impact on the business is tremendous. If you have a proven background in this field and are excited to help build Airbnb’s community, we want to hear from you.  Some examples of traits we value: A passion for Airbnb’s mission of helping people Belong AnywhereAbility to write clean and concise code, especially in R or Python3+ years in industry experience and a Master's degree in a quantitative field or Economics; PhD is a plusSolid understanding of statisticsKeen eye for detail and thoughtful investigation of data before relying upon itIntuition for data science best practices, stemming from proven experienceSteadfast focus on creating impactful changeAbility to partner with cross-functional teams using strong written and verbal communication"}