{"jobID": "2809115491", "jobLocation": "Oakland_CA", "jobTitle": "IT Senior Support Administrator", "companyRating": "4.6", "companyInfo": {"Website": "www.xantrion.com", "Headquarters": "Oakland, CA", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Eze Castle Integration, Synoptek, Endsight"}, "estimatedSalary": "91000", "jobDescription": " This position is ideal for systems administrators who are looking to improve their security skills and work in a positive, flexible work environment. In general, Xantrion IT senior support administrators are responsible for resolving Information Technology (IT) issues and helping clients adhere to the Xantrion Security Policy. Work includes, but is not limited to: identifying, researching, and solving Windows server, Active Directory, security, Exchange email, Office 365 and networking problems. The position requires accurate documentation and problem monitoring to ensure timely problem resolution. Work is performed remotely and at client locations. Required IT Senior Support Administrator Experience and Qualifications 10 - 15 years of relevant experience is required. For example: Experience with managing on premise Windows servers and servers in the cloud.Familiar with Microsoft Active Directory (AD), Azure AD, Exchange mail servers and Office 365 email environments.Able to implement security best practices.Able to troubleshoot advanced security technologies such as Single Sign On and Multi-factor Authentication.Knowledgeable of SMTP, DNS, DHCP, VLANs, and routing.Experience with backup technologies (VEEAM, Crashplan, etc.)Strong diagnostic and analytical skills.Able to quickly and accurately determine incident scope and impact.Pleasant demeanor and the ability to communicate in user-friendly language.Able to multi-task with an appropriate sense of urgency.Used to working in a teamoriented, collaborative environment.Desired IT Senior Support Administrator Experience and QualificationsBachelors Degree in a field appropriate for this position (Management Information Systems, Information Systems, Information Technology, Computer Science, etc.) or relevant professional experience.Technical certificates from Cisco, Microsoft, ITIL, Citrix etc., preferred.Knowledge of VoIP a plus.BenefitsSalary commensurate with skills and experience.100% of medical, dental, and vision for you and your family, 80% covered for Kaiser.401K with company match up to 4% of salary.17 days/year PTO.Certification and training reimbursement.Bonuses for referring new clients or employees. If you are among the best of the best and ready to take your IT senior support administrator career to the next level, apply today."}