{"jobID": "2696106500", "jobLocation": "McLean_VA", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.kwabsc.com", "Headquarters": "Carson, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist needed to support staff with applying established or new programmatic and quantitative methods to find patterns and relationships in large datasets in support of auditing and oversight of the organization’s data-handling obligations under numerous authorities. Conduct mathematical, statistical, geospatial modeling, or other data-driven problem-solving analyses to address business operations or compliance questions; collaborate with compliance, legal, IT staff, and analysts to determine the data needed to address compliance problems; incorporate insights and findings into a broad range of well-crafted, sophisticated reports and products. Transform/translate and stage data in support of auditing and reporting; use and report on data-handling and use in order to ensure compliance with data handling requirements and identify instances of non-compliance including but not limited to translation/transformation and staging of audit log data for review by less technical members of Sponsor’s team and analytic managers.  Operate, maintain and modify existing SharePoint site used for CTG workflow tracking. Assist with performing O&M; of all Adobe Insight servers, report servers, sensors and workstations for all existing and future capabilities for the Compliance program, and assist Insight Workstation users become familiar with the tool. Design, test, implement, maintain and document the auditing and reporting processes used to ensure appropriate use of existing and future data, emerging technologies, new systems/applications in its on-premises and cloud environments. Design, test and implement compliance processes/regimes, including auditing, reporting, and training for new datasets, emerging technologies, new systems/ applications, or to achieve efficiencies in processes. Conduct technical investigations and extraction/translation/formatting of technical investigation/audit results related to data-handling compliance incidents for review by less technical team members. Draft comprehensive compliance incident reports and work with other teammates to incorporate findings. At least annually, update existing data-handling compliance training courses and materials to provide refresher training on the data-handling requirements. Schedule, facilitate and provide training in support of compliance auditing activities.  -Demonstrated experience with Splunk, creating scripts to pull identified data from Splunk on an ongoing or recurrent basis; and monitoring application and server logs to ensure continued logging to Splunk. Demonstrated experience coding/scripting in one or more of the following: Perl, Python, HTML, SQL, or JavaScript.Working knowledge of appropriate analytic methods and methodological tools in one or more of the following areas, a.) data visualization; b) computer programming (e.g. programming languages, statistics/math packages, computer science, machine learning, or scientific computing; and/or c) applied mathematics (e.g. probability and statistics, formal modeling, and computational social sciences).Ability to develop comprehensive software applications.Ability to translate complex, technical and policy findings into an easily understood narrative (i.e. tell a story with data) in graphical, verbal, or written form.  **Open to various skill levels**"}