{"jobID": "2805978525", "jobLocation": "Los_Angeles_CA", "jobTitle": "Sr Data Engineer", "companyRating": "3.2", "companyInfo": {"Website": "www.neustar.biz", "Headquarters": "Sterling, VA", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Adobe, Akamai, Oracle"}, "estimatedSalary": "128000", "jobDescription": "Neustar, Inc. is a leading global information services provider driving the connected world forward with trusted, holistic identity resolution. More information is available at https://www.home.neustar.Job Requisition:R-1688 Sr Data Engineer (Open)Primary Location:LOS ANGELESJob Description:Senior Data EngineerThis position is dedicated to processing, analyzing, and preparing data for downstream tools and processes. As a Senior Data Engineer you bring marketing analytics and data technologies together to deliver best-in-class insights. A hands-on data guru, you communicate unusual and questionable findings to the cross-functional project team, advise on best practices and data structure, and lead junior analysts.You will be working in the marketing analytics environment; either having experience in that area or learning it quickly is expected of you.If you are quick, proficient in data engineering, curious, passionate for data technologies, we would like to hear from you.Responsibilities & Key Tasks:Lead adoption of new data technologies by creating easy to use scalable frameworks that address needs of data processing operational teamAutomate processes by reverse engineering and optimizing data flows and analyst experienceApply data engineering to analytical data pipelinesParticipate in establishing best practices while team is transitioning to new technologies, tools and infrastructure, contribute heavily to cRecommend and implement process improvementsMaintain specifications and meta data; follow and develop best practicesCoach and technically train data analystsSkills and Qualifications:Strong data management skills: accessing and reading raw data files, creating data structures, data processing, merging, handling missing values, programming and debugging, data validationSound knowledge of relational, structured, semi-structured and unstructured data systems, and the experience to know when to use each type of systemExperience working with a range of data systems (e.g., Spark, Hive, Postgres, MySQL)Have excellent Python, and SQL programing skillsExperience working in AWS is a strong plusSpark knowledge is a plusStrong data management skills: accessing and reading raw data files, creating data structures, data processing, merging, handling missing values, programming and debugging, data validationSelf-motivated and willing to take ownership. Capable of working independently on multiple projects to meet deadlinesCreative problem solving and analytic skills, ability to handle ambiguity while striving for clarityEffective communication across diverse audiencesAnalytical and BI reporting experience desirableBachelor’s Degree in Computer Science, Mathematics, Economics, or experience in related analytical fieldNeustar does not accept unsolicited resumes from external firms or agencies. Neustar will not be responsible for placement fees associated with unsolicited resumes.DIVERSITYDiversity, inclusion and teamwork are second nature to Neustar; and these values permeate our entire business structure. Neustar is committed to creating an environment where a wide spectrum of opinions and beliefs are actively sought, listened to and respected. Further, our talented workforce draws from the many geographic areas and markets in which Neustar operates worldwide, which represents a distinct competitive advantage. The rich and varied personal and professional backgrounds of our employees make Neustar a dynamic and rewarding company at which to build a career. We invite you to join us.EOE of Minorities/Females/Vets/DisabilityNeustar, Inc. considers all applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, or status as a Vietnam-era or special disabled veteran in accordance with federal law and other state and local requirements. Neustar, Inc., complies with applicable state and local laws prohibiting discrimination in employment and provides reasonable accommodation to qualified individuals with disabilities in accordance with the American with Disabilities Act (ADA) and applicable state and local laws."}