{"jobID": "2831763861", "jobLocation": "Chicago_IL", "jobTitle": "Environmental Engineer/Physical Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Duties Help Duties Summary  This is a Recent Graduates position in the Pathways program. This program provides individuals who have completed a qualifying associate's, bachelor's, master's, professional, doctorate, vocational, or technical degree or certificate with an entry-level developmental experience with the potential to lead to a career in the Federal government after successfully completing the program. More information about the Recent Graduates program can be found at USAJOBS Information Sheet.  This position is located in Region 5, Air and Radiation Division, Air Programs Branch, Chicago, IL. For more information on this office, visit their website: Region 5  If selected, you must work at the location stated in this announcement.  Your salary will be based on the grade level for which you are selected and the duty location of the position.  Learn more about this agency Responsibilities At the entry level of this position, you will: Communicate policy and procedural guidelines to state, local, and tribal air agencies, and work with them to coordinate the development of required revisions to State Implementation Plans (SIPs) and source-specific SIP actions.Review and evaluate portions of straightforward state-submitted SIP revisions for technical, procedural, and/or regulatory adequacy and compliance with Clean Air Act (CAA) requirements; and work with higher-grade specialists to produce technical documentation supporting the Agency's decision on SIP rule making actions.Perform assigned portions of professional and technical projects to provide technical assistance to state, local, and tribal air agencies in the control of air pollutants to meet the requirements of the CAA related to the National Ambient Air Quality Standards (NAAQS) and other control programs, including the review, development, or revision of SIPs. When entering a Federal job at a grade level lower than the highest promotion potential level, you may be promoted to more complex duties and work more independently, as your career progresses.  Travel Required  Occasional travel - You may be required to travel 1 to 5 days per month.  Supervisory status  No  Promotion Potential 12 Who May Apply This job is open to  Recent Graduates who have completed a qualifying degree or certificate from a qualifying educational institution or technical education program within the preceding two years of the announcement closing date (the two years begins on the date all course requirements are met). Preference eligible veterans unable to apply within two years of receiving their degree due to military service obligation may apply up to six years after degree or certification.  Questions? This job is open to 4 groups. Job family (Series) 0819 Environmental Engineering  1301 General Physical Science  Similar jobs Engineers, EnvironmentalEngineers, SoilEnvironmental EngineersSoil EngineersRequirements Help Requirements Conditions of Employment Position has educational/degree requirements (see Qualifications section).EPA and non-EPA applicants must submit transcripts/course listings.You must submit a resume and required documents (see How to Apply section).You must be a U.S. citizen.If you are selected, a pre-employment background check is required. As part of the application process, you are required to submit college transcripts or a list of courses as described in the Required Documents section of this announcement. However, if you are selected, you must provide official educational transcripts before you start work with EPA. More information on verification of education can be found here: EPA Announcement Policies and Procedures.  If you are selected, you must complete a one year probationary period.  This position is designated as Low Risk and requires a background investigation. Unless an appropriate background investigation is already on record with the Office of Personnel Management, you must undergo a background investigation.  A bachelor's degree from an accredited or pre-accredited college or university in [insert the education majors referenced from the qualification handbook or briefly describe the combination of education and experience]. Qualifications In addition to the eligibility requirements for the Recent Graduates program, this position has specific educational requirements in order to qualify as described below:  A bachelor's degree from an accredited or pre-accredited college or university in Engineering .  As part of the application process, you are required to submit college transcripts or a list of courses as described in the Required Documents section of this announcement. However, if you are selected you must provide official educational transcripts before you start work with EPA. More information on verification of education can be found here: EPA Announcement Policies and Procedures.  In addition to the educational requirements, we are looking for at least one year of specialized experience related to this position as described below:  To qualify for the GS-07 level, you need to have at least one year of full-time experience equivalent to the GS-05 level defined as providing general guidance and advice on environmental issues, and assist in the review of scientific or technical documents OR 1 full year of graduate level education or superior academic achievement (Superior Academic Achievement Definition) degree in the academic discipline as described above.  To qualify for the GS-09 level, you need to have at least one year of full-time experience equivalent to the GS-07 level defined as providing policy and/or procedural guidance on environmental issues, assist in the production or review of scientific/technical documents, and provide stakeholders or others with advice on environmental issues OR master's or equivalent graduate degree or 2 full years of progressively higher level graduate education leading to such a degree in the academic discipline as described above.  Environmental Engineering, 0819  Degree: professional engineering. To be acceptable, the curriculum must: (1) be in a school of engineering with at least one curriculum accredited by the Accreditation Board for Engineering and Technology (ABET) as a professional engineering curriculum; or (2) include differential and integral calculus and courses (more advanced than first-year physics and chemistry) in 5 of the following 7 areas of engineering science or physics: (a) statics, dynamics; (b) strength of materials; (c) fluid mechanics, hydraulics; (d) thermodynamics; (e) electrical fields and circuits; (f) nature and properties of materials (relating particle and aggregate structure to properties); and (g) any other comparable area of fundamental engineering science or physics, such as optics, heat transfer, soil mechanics, or electronics. OR Combination of education and experience -- college-level education, training, and/or technical experience that furnished (1) a thorough knowledge of the physical and mathematical sciences underlying professional engineering, and (2) a good understanding, both theoretical and practical, of the engineering sciences and techniques and their applications to one of the branches of engineering. The adequacy of such background must be demonstrated by one of the following: Professional registration Current registration as a professional engineer by any State, the District of Columbia, Guam, or Puerto Rico. Absent other means of qualifying under this standard, those applicants who achieved such registration by means other than written test (e.g., State grandfather or eminence provisions) are eligible only for positions that are within or closely related to the specialty field of their registration. For example, an applicant who attains registration through a State Board's eminence provision as a manufacturing engineer typically would be rated eligible only for manufacturing engineering positions.Written Test-- Successfully passed the Engineer-in-Training (EIT) examination, or the written test required for professional registration, administered by the Boards of Engineering Examiners. Applicants who have passed the EIT examination and have completed all the requirements for either (a) a bachelor's degree in engineering technology (BET) from an accredited college of university that included 60 semester hrs of courses in the physical, mathematical, and engineering sciences, or (b) a BET from a program accredited by the Accreditation Board for Engineering and Technology (ABET) may be rated eligible for certain engineering positions at  Graduates of other BET programs are required to complete at least 1 year of additional education or highly technical work experience of such nature as to provide reasonable assurance of the possession of the knowledge, skills, and abilities required for professional engineering competence. The adequacy of this background must be demonstrated by passing the EIT examination. Specified academic courses Successful completion of at least 60 semester hrs of courses in the physical, mathematical, and engineering sciences and in engineering that included the courses specified in the basic requirements. The courses must be fully acceptable toward meeting the requirements of a professional engineering curriculum as described in paragraphRelated curriculum Successful completion of a curriculum leading to a bachelor's degree in engineering technology or in an appropriate professional field, e.g., physics, chemistry, architecture, computer science, mathematics, hydrology, or geology, may be accepted in lieu of a degree in engineering, provided the applicant has had at least 1 yr of professional engineering experience acquired under professional engineering supervision and guidance. Ordinarily there should be either an established plan of intensive training to develop professional engineering competence, or several years of prior professional engineering-type experience, e.g., in interdisciplinary positions. (The examples of curricula aren't all-inclusive.) Professional ability to apply engineering knowledge is defined as the ability to (a) apply fundamental and diversified professional engineering concepts, theories, and practices to achieve engineering objectives versatility, judgment, and perception; (b) adapt and apply methods and techniques of related scientific disciplines; and (c) organize, analyze, interpret, and evaluate scientific data in the solution of engineering problems. Graduate Education:Individuals can be converted noncompetitively to a GS-9 position if they complete all the requirements of a Federal graduate-level student-trainee program, including completion of a master's degree in engineering and completion of 640 hrs of work experience, 320 hrs of which was at GS-7.Regardless of the field of undergraduate study, completion of the requirements for a master's or higher degree in engineering is fully qualifying for the grade indicated, provided the applicant's total background, i.e., education and any experience, demonstrates evidence of knowledge, skills, and abilities that are substantially equivalent to those acquired through the successful completion of the courses specified above. General Physical Science Series, 1301  Degree: physical science, engineering, or mathematics that included 24 semester hrs in physical science and/or engineering science likes mechanics, dynamics, properties of materials, and electronics.  or  Combination of education and experience - education equivalent to one of the majors above. Education Your answers to the online assessment will be used to evaluate your competencies in the following areas: Knowledge of federal environmental laws and regulations;Knowledge of air quality programs;Skill in written communication to respond to or evaluate technical documents;Skill in oral communication;Ability to collaborate with external stakeholders to provide advice;Ability to interpret environmental regulations and policy. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.  If you have part-time work experience, read this: EPA Announcement Policies and Procedures.SDL2017"}