{"jobID": "2616230819", "jobLocation": "Washington_DC", "jobTitle": "Applied Data Scientist, Enterprise", "companyRating": null, "companyInfo": {"Website": "www.improbable.io", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our PurposeImprobable is dedicated to building powerful technology designed to help solve previously impossible problems and enable the creation of new realities. Improbable unlocks truly next-generation virtual worlds of unprecedented scale, persistence and richness.Our technology lets developers transcend the limits of regular computation, allowing swarms of servers running in the cloud to cooperate in order to simulate worlds far larger and more complex than any single server could. We hope to answer critical questions through simulations that could lead to a better functioning world.We are proudly building a diverse workforce, driven by a shared desire to improve and achieve extraordinary things. Were crafting technology for the future and fostering a problem-solving culture that embraces innovation through iteration and experimentation.Your MissionImprobable believes that in-silico experimentation and large-scale simulation can help us both to understand and transform the world around us. The tools we develop have the potential to deliver previously unachievable insight and facilitate a more prosperous and secure planet - an optimised world.We are building a new data science and machine learning capability to enable our customers to better understand their most challenging problems. Our applied data scientists are delivery focused, working in diverse technical teams to design, build, deploy and evaluate data models. Our simulations are currently solving problems in industries as diverse as telecoms, urban planning and governance, training and more.You can read about the engineering culture of the division here.Responsibilities Work closely with our customers to develop a strategy to extract the maximum possible value from the available dataBe involved throughout customer interaction from project scoping to final deliveryCritically assess the type and quality of customer data and work with them to appreciate their toughest problemsWork independently or with our research team to develop a modelling strategy to sit at the core of a data-led simulation-based approach to problem solvingTake ownership of ensuring and demonstrating the reliability of the models that we createAdditionally you will drive thought leadership within the company and help our clients to understand their data needs and design their data strategies. This involves keeping up-to-date with a diverse body of cutting-edge research, designing and prototyping pioneering new technical approaches and rapidly developing expertise in new subject areas to support new bids and projects. Competencies Strong background and experience in delivery of technical, data-rich projects ideally for external clients.Degree in a scientific or mathematical field, ideally with a computational elementPragmatic coding ability - with fluency in at least one relevant programming language and the openness to learn and adapt to a variety of languages. We mainly use Python, Pandas and many related tools and libraries.Enthusiastic about continuously improving and rapidly developing new competencies.Currently possess a minimum TS clearance with experience working directly with government The following would be advantageous, but isn't essential Working with large data sets and big-data technologies such as SparkBayesian methodsEffectively communicating and visualising analysis of rich data setsProbabilistic programmingOur office is currently located in Tysons, VA with client sites across N. VirginiaEqual OpportunityThe best ideas are often the least expected and require new ways of thinking; thats why our teams at Improbable are made up of an incredible range of talented people. Improbable is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, related medical conditions and lactation), sexual orientation, gender identity, gender expression, national origin, marital status, age, protected veteran or disabled status, genetic information, or any other legally protected status."}