{"jobID": "2808729390", "jobLocation": "Detroit_MI", "jobTitle": "Analyst, Data and Analysis", "companyRating": null, "companyInfo": {"Website": "www.digitas.com", "Headquarters": "Boston, MA", "Size": "5001 to 10000 employees", "Founded": " 1980", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " 360i, AKQA, R/GA"}, "estimatedSalary": null, "jobDescription": " OverviewAnalyst – Data & Analysis Digitas is a highly-caffeinated playground where brilliant minds come together to bring bold, award-winning ideas to life.  The Data & Analysis team uses data-driven insights to fuel strategic growth for clients. We believe that data should never exist in a vacuum; instead, it should be put to work to bring the best ideas and stories to our clients  To help with this, we’re looking for an outstanding Analyst – someone who has a knack for understanding data and telling the story of why it matters. You’ll learn from the best in the business as you work with the team to bring actionable insights to our clients. Up for it? Read on. What you’ll do: As an Analyst, you’ll lay the groundwork and contribute to day-to-day reporting needs for client marketing efforts. You’ll work on brand campaigns, acquisition campaigns, site optimization, and/or online testing strategy. Day-to-day, your role includes:Keeping a pulse on day-to-day performance data, including display media, site, search, email, and/or social campaignsWorking in a variety of reporting systems and databases for the creation of recurring reports and dashboardsIdentifying nuances in data to optimize our clients’ businessSupporting marketing initiatives across project and campaign lifecycles, including measurement plans, primary and secondary research, and performance reportingExpanding industry knowledge and relevant skillsets through internal trainingWe’re looking for strong, impactful work experience, which typically includes:1-3 years of work experience in a relevant industryA four-year college degreePassion for digital marketing, eagerness to learn in a constantly-changing space, and a natural curiosityFamiliarity with Excel and/or other data analysis tools such as SQL or Tableau a plusComfortable in a fast-paced and deadline-driven environment Got what it takes? We’d love to hear from you."}