{"jobID": "2732162606", "jobLocation": "Washington_DC", "jobTitle": "Space Planner - CAD Assistant", "companyRating": null, "companyInfo": {"Website": "www.jkmoving.com", "Headquarters": "Sterling, VA", "Size": "501 to 1000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Atlas Van Lines, United Van Lines, Mayflower Transit"}, "estimatedSalary": null, "jobDescription": "Space Planner - CAD AssistantLocation: Washington, DC Employment Type: Full Time Regular Description: Support operations staff, Client Representatives and Construction Managers in the development of space plans and designs from blueprints or sketches. Responsibilities:Prepare designs and layouts to include site plans, floor plans, furniture/equipment plans, interior and exterior elevations and related sections and details utilizing a computer with industry-specific software, to include AutoCAD and GIZA.Complete diagrams, schedules, design sketches, presentation drawings, working drawings and other computer-generated or hand-drafted documents from prepared drawings for client use.Organize, layout and coordinate drafted documents.Possess a working knowledge or architectural symbols and graphic standards.Assist in the development of presentations for customer such as furniture specifications, fabrics and finishes, proposals, as well as pricing.Maintain working relationship with Client Representatives and Construction Managers.Accompany in-house staff to meetings with the customer as required, attend and participate in design presentations for special projects, conduct field surveys and document existing conditions required to complete project documents.Provide administrative and day-to-day operational support including coordination/completion of job filesQualifications:Bachelor's degree (B.A.) from four-year college or university; or three to five years of related experience, preferably in the systems furniture industry, desirable; or equivalent combination of education and experience.Experience with work space/office design.Knowledge of AutoCAD/GIZA, Excel, MS Windows. ABOUT JK MOVING SERVICES:Got moxie? Love connecting the dots? Then you belong on JK’s award-winning team! As the largest independent mover in North America, JK delivers superior relocation and logistics services to military service members, government agencies, large corporations, businesses and homeowners around the world….and the list goes on! JK actively seeks dedicated professionals ready to positively impact domestic and global communities.  As a SmartCEO 2016 Corporate Culture Award winner, JK places high standards on the care of its employees. From charitable giving to competitive compensation to fun corporate events, JK invests in each employee’s professional and personal growth. This level of commitment sets JK apart from other companies – why not consider joining JK Moving Services today!JK Benefits:  In addition to great medical/dental/vision insurance and ancillary coverages, JK offers: Recruitment and customer referral bonusesService award programsSafety & performance bonusesTuition reimbursementWellness and quality of life programsDiscount programs with local and national suppliersCompany-paid insurance protection programs for employees and their familiesCompany-funded profit sharing and retirement programsTax deferred savings programs including flexible spending and health savings account Equal Opportunity/Affirmative Action Employer"}