{"jobID": "2836767855", "jobLocation": "San_Francisco_CA", "jobTitle": "Retail Sales-Samsung Electronics", "companyRating": null, "companyInfo": {"Website": "www.2020companies.com", "Headquarters": "Fort Worth, TX", "Size": "5001 to 10000 employees", "Founded": " 1991", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Mosaic Sales Solutions, MarketSource, MarketStar"}, "estimatedSalary": null, "jobDescription": " Overview  2020 Companies has immediate part-time opportunities representing our client, Samsung Electronics America. ABOUT THE JOB As a Samsung Experience Consultant, you will: Demonstrate, sell, and evangelize Samsung products in the country's most well-known retailers.Ensure that consumers have the latest and most relevant product information at their fingertips when making a purchase decision.Be able to not only promote the Samsung brand to customers, but work closely with store associates and management to build tight-knit relationships. What's in it for you? Competitive payPaid trainingExciting work-environmentWork with state-of-the-art technologyContinued educationWork within a leading big box electronics storeCAREER OPPORTUNITY With 2020's rapid growth comes an exciting career path and professional development opportunities. We represent companies throughout the US across multiple industries affording unlimited growth. 2020 will ready you with the best technology and training to be flexible, engaging, and adept at solving problems.  A typical career path starts here and progresses to either:  SupervisorDistrict/Market Manager (supported by a leadership training program for those who qualify).Regional Manager (supported by a leadership training program for those who qualify).  Your course is limitless! ABOUT SAMSUNG Samsung Electronics America is a recognized innovation leader in consumer electronics design and technology. Samsung delivers a broad range of groundbreaking products and services, such as appliances, home entertainment, mobile computing, smart phones, virtual reality, wireless infrastructure, and wearables. Samsung is dedicated to enriching the lives of consumers and remain at the forefront of innovation. ABOUT 2020 COMPANIES For nearly 25 years, 2020 Companies has been the premier outsourced sales and marketing agencies in the US launching and advocating new products and brands, penetrating new consumer segments, and executing sales and marketing strategies. 2020 Companies recruits, hires, trains, and cultivates Sales Representatives, Brand Ambassadors, Merchandisers, and Casted-Talent, in order to tailor a full-package solution to clients wanting to grow their market share, build brand awareness, expand distribution channels, and connect people with consumers. 2020 is committed to inspire our LEADERSHIP values for a far-reaching impact in the industry.  Click \"apply\" now for immediate consideration.  Duties and Responsibilities Sell products and services in a retail store, kiosk, and/or event environmentsMaintain professional interaction with both customers and fellow employeesMeet or exceed personal sales goals on a monthly basisCourteously welcome customers and offer assistanceDirect customers by escorting them to displays; assess needs and suggests products to fit those needsAdvise customers by providing information on products and servicesHelp customers make selections by building customer confidenceAccurately document and report salesContribute to team effort by accomplishing related results as neededResponsible for accurately tracking and communicating all activity to Retail OperationsEnsure work station/kiosk is clean, well-organized, functional and presentable at all timesResponsible for submitting all paperwork completely and accuratelyPerformance Measurements:Regular and prompt attendanceMeet established monthly/weekly sales quota/goalsCustomer/client satisfaction based on rejection percentage and substantiated complaintsQualifications:High school diploma or equivalent required; Business degree preferredSix (6) months prior sales, retail, telecom or marketing experienceDemonstrated knowledge of products and servicesExcellent communications, presentation, interpersonal and problem-solving skillsImpeccable integrity and commitment to customer satisfactionAbility to multi-task in a fast-paced, team environmentAbility to work flexible weekends including evenings, weekends and holidaysAbility to maintain customer confidentiality"}