{"jobID": "2826719340", "jobLocation": "Houston_TX", "jobTitle": "Supply Control Administrator/ Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.superiorgroup.com", "Headquarters": "Williamsville, NY", "Size": "10000+ employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Superior Group is looking for a Supply Control Administrator/ Production Analyst- 77037Pay Rate - $20/hour Long Term Contract The Supply Control Administrator is responsible for the administration and analysis of Cylinder Tracking program. -Resolve data discrepancies and perform accounting adjustments in the cylinder tracking program and ERP system, JD Ewards. -Document best practices and SOP’s. -Identify opportunities to improve the cylinder tracking process. -Maintain cylinder tracking data integrity. -Understand cylinder tracking program, handheld functionality and JD Edwards and provide support on all aspects of cylinder tracking implementation and administration. -Manage spending and inventory levels of cylinder tracking related materials. -Work with branches and users to ensure compliance with all aspects of cylinder tracking. -Create and provide operations with key performance metrics regarding compliance to the cylinder tracking program. -Perform physical cylinder audit for customers as requested by the sales team. This includes preparation, visiting the customer, counting the cylinders at customer sites and reporting the results. -Manage and resolve cylinder balances in JD Edwards and the cylinder tracking program. -Understand the order to cash business processes and system interactions. Required Skills / Qualifications: Minimum 4 years' Administrative work related experienceMinimum 3 years’ work related experience with Microsoft ExcelPreferred Skills / Qualifications:JD Edwards software is HIGHLY PREFERREDGo Beyond. www.superiorjobs.com.EEO Employer – Minorities / Females / Disabled / Veterans / Sexual Orientation / Gender Identity"}