{"jobID": "2682420112", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Scientist Snr Director", "companyRating": "3.4", "companyInfo": {"Website": "www.oracle.com", "Headquarters": "Redwood City, CA", "Size": "10000+ employees", "Founded": " 1977", "Type": " Company - Public (ORCL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " SAP, Salesforce, Microsoft"}, "estimatedSalary": "197000", "jobDescription": " Leads a team of people who design, develop and program methods, processes, and systems to consolidate and analyze unstructured, diverse “big data” sources to generate actionable insights and solutions for client services and product enhancement.  Plans, manages, and controls the activities of a team that interacts with product and service teams to identify questions and issues for data analysis and experiments. Brings expertise or identifies subject matter experts in an effort to integrate and evaluate large datasets from multiple disparate sources. Advises business groups by providing strategic direction to initiative prioritization, integration and resource application. Ensures that policies and procedures align with corporate vision. Selects, develops, and evaluates personnel ensuring efficient operation of the function.  Directs and ensures the implementation of operational policies through subordinate managers. Interacts internally and externally with executive management; negotiation of difficult matters to influence policy. Functional expertise and broad company knowledge. Demonstrated leadership and people management skills. BS or MS degree or equivalent experience relevant to functional area. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status or any other characteristic protected by law.Our mission: As the leading marketing platform provider, our mission is to help companies target and reach their customers not he right channel, at the right time, with the right message - leading to desired outcomes. We need talented, passionate people working together to make this happen. We are looking to grow our teams with people who share our energy and enthusiasm for creating the best experience for marketers who use our tools and services. The team: We are a rapidly growing and highly capable product & engineering team building the most popular marketing tools on the planet. Every day, over 3000 brands send well over a Billion emails and count on us to create precise and impactful targeting capabilities, personalization, customization, and optimize these marketing campaigns on many fronts. With engineering hubs in Redwood Shores, Portland, Toronto, Boulder, London, Bangalore, and Hyderabad, we are helping our customers acquire new customers, engage and re-engage existing customers, and drive their businesses towards growth. Your job: As the Head of Data Science at Oracle Marketing Cloud (OMC) your role is to build and manage a team of Data Scientists who solve key problems in our platform, helping our customers towards their end goals. Your team will analyze and visualize data, create models and algorithms, solve for customization, personalization, and optimization of campaigns. You will work hand in glove with the engineering and product leaders across OMC to pick the right problems to target, and then get these solutions into production. You will have access to unparalleled resources within OMC to grow and develop both personally and professionally.  We are looking for a mixture between a statistician, scientist, machine learning expert and engineer: someone who has passion for building and improving Internet-scale products informed by data. The ideal candidate understands human behavior and knows what to look for in the data, and can work closely with the engineering and product management teams to solve complex problems with unique data, analysis, algorithms, and insights. Above all, we are looking for a true leader who can utilize and put to work a broader organization that is eager to learn, grow and contribute. We want Data Science to be permeated across all OMC. About you: Requirements Ph.D. or M.S. in a quantitative field such as Computer Science, Statistics, or MathematicsMinimum 8-10 years of professional industry experience in data scienceExpertise in machine learning and statistical modelingExperience in Ad:tech or Mar:tech space is a plusPassion to answer Product/Engineering questions with dataStrong ability to code in various languages, use big data platforms, extract and analyze dataManaged a team of data scientists, preferable in multiple geographiesHas a strong network to hire from We get excited about candidates who Have full stack experience in data collection, aggregation, analysis, visualization, productionization, and monitoring of data science productsAre proficient in small data modeling work: Python, R, Julia, OctaveAre proficient in big data modeling work: Hadoop, Pig, Scala, SparkCan fish for data: SQL, Pandas, OracleDeploy data science solutions: Java, Python, CCommunicate concisely and persuasively with engineers and product managersAre well known in the industry, speak at conferences, write blogs and articles, well published"}