{"jobID": "2808240752", "jobLocation": "Chicago_IL", "jobTitle": "Litigation Technology Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.mwe.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1934", "Type": " Company - Private", "Industry": " Accounting & Legal", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " McDermott Will & Emery LLP is a leading international law firm with a diversified business practice representing commercial, industrial and financial enterprises both publicly and privately held. The Firm has a long history of social responsibility and supporting the communities in which our people live and work.  Our Discovery Department is seeking a Litigation Technology Data Analyst. This position supports project managers and case teams with collection, processing and production of eDiscovery data. This position analyzes and prepares client data for the processing system.  As a Litigation TechnologyData Analyst, you will: Process, extract, convert, and manipulate data utilizing eDiscovery software and forensic toolsDocument, execute and track electronic data processing requests through the ticketing system; assist with the maintenance of project trackingConvert unstructured data to structured data and transfer processed data between systems (load file)Generate and analyze processing reports; review exceptions to ensure final product qualityAccumulate, manage and summarize document review statistics and metricsJob Requirements:Bachelor's degreeOne (1) year of related work experienceKnowledge of Microsoft Office Suite (Excel, Outlook, PowerPoint, and Word)Knowledge of eDiscovery or Computer Forensic Software and eDiscovery Review SoftwareStrong mathematical and analytical skillsAbility to work under tight deadlines and prioritize responsibilitiesAbility to handle and maintain confidential informationAbility to work effectively in a fast-paced environment"}