{"jobID": "2726408220", "jobLocation": "Washington_DC", "jobTitle": "Systems Software Engineer, Enterprise", "companyRating": null, "companyInfo": {"Website": "www.improbable.io", "Headquarters": "London, United Kingdom", "Size": "201 to 500 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Our PurposeImprobable is dedicated to building powerful technology designed to help solve previously impossible problems and enable the creation of new realities. Improbable unlocks truly next-generation virtual worlds of unprecedented scale, persistence and richness.Our technology lets developers transcend the limits of regular computation, allowing swarms of servers running in the cloud to cooperate in order to simulate worlds far larger and more complex than any single server could. We hope to answer critical questions through simulations that could lead to a better functioning world.We are proudly building a diverse workforce, driven by a shared desire to improve and achieve extraordinary things. Were crafting technology for the future and fostering a problem-solving culture that embraces innovation through iteration and experimentation.Your missionAs a systems software engineer in the Enterprise platform team at Improbable, you will be responsible for building, running and troubleshooting the software and systems which underpin our large-scale, real-time, distributed simulations for Enterprise customers.This team is responsible for providing a production environment where our customers can run simulations can run reliably and at scale. To this end, you will initially be tasked with working with our US federal clients to design and maintain flexible services and tooling to move SpatialOS onto our clients preferred private infrastructure.We build on cutting-edge products including Kubernetes, Prometheus, the CoreOS stack, Docker, AWS and more.You will work with smart, motivated and curious people, driven by solving globally significant problems across the private and public sector; the kind of problems that keep senior leaders awake at night. We also include personal 20% time to make sure that we're always thinking about the future & innovation.You can read about the engineering culture of the division here.CompetenciesComfortable with a range of programming and scripting languagesExperience using the typical Unix/Linux toolbox of software and management tools.Experience with large scale distributed systems in productionGood knowledge of internet networking and performancePassionate about troubleshooting, debugging, and automationStrong Linux knowledgeStrong knowledge of deploying and running services on IaaS providers (preferably AWS or GCP). Knowledge of best practices and tooling (e.g. Terraform)Experience with clustering and containerization technologiesYou will currently possess a US security clearance of the highest levelEqual OpportunityThe best ideas are often the least expected and require new ways of thinking; thats why our teams at Improbable are made up of an incredible range of talented people. Improbable is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, childbirth, related medical conditions and lactation), sexual orientation, gender identity, gender expression, national origin, marital status, age, protected veteran or disabled status, genetic information, or any other legally protected status."}