{"jobID": "2810031665", "jobLocation": "Houston_TX", "jobTitle": "ALIZENT - Stage Data Scientist F/H", "companyRating": null, "companyInfo": {"Website": "www.lvl-medical.com", "Headquarters": "Lyon, France", "Size": "501 to 1000 employees", "Founded": " 1989", "Type": " Company - Public (LVL) ", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ALIZENT - Stage Data Scientist F/H Apply  Job title  ALIZENT - Stage Data Scientist F/H  Contract Type  Internship  Publication date  2018-06-06 Country  Présentation du GroupeAir Liquide est le leader mondial des gaz, technologies et services pour l’industrie et la santé. Présent dans 80 pays avec environ 65 000 collaborateurs, le Groupe sert plus de 3,5 millions de clients et de patients. Oxygène, azote et hydrogène sont des petites molécules essentielles à la vie, la matière et l’énergie. Elles incarnent le territoire scientifique d’Air Liquide et sont au coeur du métier du Groupe depuis sa création en 1902.  Air Liquide a pour ambition d’être le leader de son industrie, d’être performant sur le long terme et de contribuer à un monde plus durable.Descriptif de l'entité et de l'activitéAlizent, filiale d'Air Liquide, regroupe plus de 200 salariés qui sont basés à Paris, Madrid, Montréal, Houston et Leeds. Son activité comprend notamment le développement, l'hébergement, l'exploitation et la maintenance de solutions informatiques industrielles permettant d'améliorer la performance des systèmes industriels selon cinq axes principaux : traçabilité, télémétrie, gestion de production, supervision industrielle (SCADA) et optimisation logistique.  Grâce à sa forte capacité d’innovation, sa dimension internationale (projets, équipes, implantations) et la maîtrise complète de ses solutions, de la conception à l’exploitation, Alizent est aujourd’hui un acteur de premier plan en informatique industrielle.  L’équipe data analytics au sein de l’équipe Innovation d’Alizent a pour vocation d’être des consultants en interne au groupe Air Liquide pour les sujets autour de l’analyse de la donnée.Missions & ResponsabilitésLe stagiaire aura l’occasion de travailler sur différents projets orientés « data analytics » et pourrait donc participer aux missions suivantes : Gestion des données sur le Datalake HadoopExtraction de donnéesCleaning et feature engineeringExploration statistiqueAlgorithmes, machine learning, deep learningCréation de visualisations, dashboard & KPIProfil et compétencesIdéalement issu d'une école d'ingénieur avec une formation de niveau Master dans le domaine de la data science.  Bonne connaissances des technologies de data science : Indispensable :Python/RSQLExcelNon indispensables mais souhaitables :SparkTableau SoftwareTibco SpotfireMicrosoft Power BILinux En plus de connaissances techniques, le stagiaire fera preuve de ses qualités personnelles : Résolution de problèmes techniquesTravail en équipeRigueur et dynamismeEsprit d’initiativeCapacité d’adaptationCréativitéInformations complémentairesLocalisation : La Défense"}