{"jobID": "2766437729", "jobLocation": "Washington_DC", "jobTitle": "Data Integration Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.eab.com", "Headquarters": "Washington, DC", "Size": "1001 to 5000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "59000", "jobDescription": "About EAB EAB is an education best practices firm that uses a combination of research, technology, and services to improve the performance of 1,200+ educational institutions. Headquartered in Washington, D.C., EAB forges and finds the best new ideas and proven practices from its network of thousands of leaders, then customizes and hardwires them into every level of member organizations, creating enduring value.  At EAB, we serve not only our members but each other—that's why we are always working to make sure our employees love their jobs and are invested in their community. See how we've been recognized for this dedication to our employees by checking out our recent awards.  For more information, visit our Careers page. The Role in BriefData Integration Analyst Their primary responsibility is to develop and deploy data integration and configuration procedures between client IT systems and EAB technology. In addition, they work collectively with other EAB project and product development staff to manage client relationship, set and execute against project milestones, and manage quality, client satisfaction, and engagement throughout the implementation life-cycle.  This role is based in Washington DC or Richmond VA. Primary Responsibilities:Conceptualize, develop and deploy data extraction procedures working collaboratively with clientsDevelop recommendations for internal leadership around preferred data integration methodologiesEnsure barriers to timely completion of Data Integration Services projects are anticipated and overcomeWork effectively with internal and external project managers to ensure timely delivery of implementationEncapsulate findings through new product integration exercises for the overall benefit of EAB data integration effortBuild and foster strong relationships with all levels of technical and non-technical staff at client institutionsProactively identifies, recognizes, and acts on opportunities for improvement in order to advance business goals. Confronts problems, change, and/or challenges quickly and enthusiastically Basic Qualifications:Education: Bachelor’s degree1+ years’ experience extracting data from a variety of platforms, performing data mapping, data transformation, and loading data to the target systemClient facing experience implementing software solutionsFluency in SQL skillsExperience managing multiple clients/projects/stakeholders simultaneouslyDemonstrated experience serving as a project owner including managing communication progress to stakeholders, risk identification and mitigation and facilitating problem solvingProven ability to communicate ideas and obtain buy-inValid Driver’s LicenseWillingness to travel up to 15% domesticallyBenefits Consistent with our belief that our employees are our most valuable resource, EAB offers a competitive benefits package: Medical, dental, and vision insurance, dependents eligible401(k) retirement plan with company matchGenerous PTODaytime leave policy for community service or fitness activities (up to 10 hours a month each)Wellness programs including gym discounts and incentives to promote healthy livingDynamic growth opportunities with merit-based promotion philosophyBenefits kick in day one, see the full details here."}