{"jobID": "2781812837", "jobLocation": "San_Francisco_CA", "jobTitle": "Maintenance Coordinator", "companyRating": "3.4", "companyInfo": {"Website": "www.veritasinvestments.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Real Estate", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "46000", "jobDescription": "JOB SUMMARY The Maintenance Coordinator supports Resident Managers, and Regional Property Managers to protect our assets by ensuring that all life safety, building systems and other general building repairs are consistently maintained. The Maintenance Coordinator also assists with bridging the gap between vendors and residents, working together to rectify issues that arise in our residential and commercial buildings in a timely manner so that residents are able to continue the quiet enjoyment of their homes. ESSENTIAL DUTIES AND RESPONSIBILITIESReview and respond to all maintenance requests/emails dailyGenerate work orders for issues that arise in commercial and residential buildings, within 24 hoursDetermine and dispatch the correct vendor pertaining to each specific issueClose work orders that vendors have completed work for after the Resident Manager has confirmed with the ResidentEdit work orders to reflect updates or changes in vendor/work descriptionsCancel work orders when an issue is resolved without assistance from a vendorTrack NOV’s (Notice of violations) and make sure complete prior to re-inspection dateTrack Life and Safety certificationsCreate and send out Life & safety work orders to correct vendors for annual, quarterly and five year inspectionsUpdate Life & safety spreadsheet once certifications are receivedScan and store certification on server and in YardiCreate and track Remediation work ordersManage remediation projects from start to finishOrders appliancesSKILLS AND ABILITIESExcellent customer service skillsExcellent communication skills to relate effectively with people from diverse backgroundsMust possess clerical abilityAbility to prioritize work ordersStrong organizational skillsAble to work in a fast-paced environment with frequent interruptionsA basic understanding of maintenance operationsQUALIFICATIONSHigh school diploma or equivalent required; college degree preferredComplete and maintain California Certified Resident Manager Certification (CCRM)1-2 years of experience as Maintenance Coordinator or industry related experience preferredProficiency in computer programs (Microsoft Suite), required and Yardi, preferredWORKING CONDITIONSThe conditions herein are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the job functions. PHYSICAL REQUIREMENTS This position will spend long hours sitting and using office equipment and computers which can cause muscle strain. The position requires talking, expressing or exchanging ideas by means of the spoken and written word to impart information to clients or to the public, and to convey detailed spoken instructions to other workers accurately, loudly, or quickly. DISCLAIMER This job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job.  We provide employment opportunities (EEO) for all employees and job applicants without regard to race, color, religion, national origin, gender, sexual orientation, age, marital status or disability. We hire and promote individuals solely on the basis of their qualifications for the job to be filled. Qualified job applicants with arrest and conviction records will be considered for the position in accordance with San Francisco’s Fair Chance Ordinance. ABOUT VERITAS INVESTMENTS Headquartered in San Francisco, Veritas Investments is an experienced real estate investment manager that specializes in owning and operating mixed-use multifamily and retail properties in the San Francisco Bay Area.  The company offers institutional and Individual investors a vertically-Integrated platform and a clearly defined investment strategy that focuses on acquiring under managed multifamily and urban retail properties and then enhancing their income and value through building and management improvements. The company holds a track record for moving quickly on opportunities, executing efficiently on strategy, and delivering superior financial performance to investors while giving back to the community.  Veritas Investments has been fortunate to be the recipient of many awards including two recent honors: IREM's Workplace Environment Award for Employee and Leadership Development and was also named Real Estate Investment Fund of the Year by REFI. "}