{"jobID": "2836997690", "jobLocation": "San_Jose_CA", "jobTitle": "Data Engineers x4 New", "companyRating": "4.1", "companyInfo": {"Website": "www.stepaheadsolution.com", "Headquarters": "Cupertino, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "111000", "jobDescription": "JOB_ID – KF-20180710Job Title: Data Engineers x4Location : Rockville, MDDuration : 6 months/contract to hire BR: W2 Emp or 1099 hourly - No C2CVisa status accepted: (Greencard or US Citizen are preferred but will entertain H1 due to the difficulty)Federal/Commercial client: FederalNumber of Openings – 4Interview Process: Phone w/HR/ 30 min phone with Tech Lead / 1 hr online coding exerciseBI/Drug Test required upon offer: Yes/must pass client based background/drug test….will be vetting for Public Trust down line2 MUST be filled by end of July…the other 2 by no later than 8/15!!  We are looking for Data Engineers to join our growing team using ground breaking cloud and big data technologies. These Data Engineers will collaborate with data scientists from prominent ivy league institutions to identify user needs, find solutions, and take our products from concept to launch. We have Mid, Senior and Lead roles available. Build data pipelines using Apache Spark, Scala, Python, Apache Airflow etc.Collaborate with User Experience and Engineering teams in the planning of new productsWrite unit tests and get close to 100% code coverageWork on AWS – S3 for storage, EC2 and EMR for processing/analysisFollow Agile methodology for the software developmentIdentify problems and propose resolutionsQualifications 6+ year of engineering experience; focus on back-end development and/or data engineeringIn-depth programming knowledge with Java, Python, and Scala Experience with Spark, Hadoop, or HIVE Strong experience with AWS; including EC2, EBS, EMR, ELB, SNS, RDS, CloudFormation, and more Experience with tools like Maven, Jenkins, Git Able to perform as an effective member of a geographically dispersed team across multiple time-zonesEducation Bachelor’s Degree in related field of study; experience is accepted in lieu of degree Clearance: Must be eligible to obtain a Public Trust"}