{"jobID": "2807729447", "jobLocation": "Ne_Jersey", "jobTitle": "Sr. Scientist/ Manager Engineering/ Manager Research - AI ML", "companyRating": null, "companyInfo": {"Website": "www.verisk.com", "Headquarters": "Jersey City, NJ", "Size": "5001 to 10000 employees", "Founded": " 1971", "Type": " Company - Public (VRSK) ", "Industry": " Business Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " CoreLogic, MSB, LexisNexis Risk Solutions"}, "estimatedSalary": null, "jobDescription": " Verisk Analytics Job OpportunitiesView Job  Careers | Contact Verisk  HomeAbout VeriskConferencesPressInvestorsBlog  U.S. Job Search  Login to Job Section  My Candidate Home  Help with Job Application  Non-U.S. Job Search  Careers Overview  Sr. Scientist/ Manager Engineering/ Manager Research - AI & ML  Job ID: ********-11301-MGV Company Name: Verisk Analytics Description: Internships and Full-Time Jobs in AI, Machine Learning, Computer Vision, Text Analytics, ASR & NLP  The AI Innovation Lab at Verisk Analytics has multiple openings at all levels - internships, postdocs, engineers, scientists, managers, in the areas of AI and big data (deep) machine learning for applications in computer vision, text analytics, speech understanding as well as for other structured and unstructured data. Position Summary: We seek qualified, highly motivated candidates interested solving pure and applied research problems in (not limited to) the following areas and their application to solving business problems. large scale ML with deep neural networks; supervised, unsupervised, weak/ self-supervised and reinforcement learning; learning from imagination and simulations for applications in computer vision, natural language processing and automatic speech and document understanding;knowledge representation including common sense knowledge; Markov logic networks; probabilistic symbolic reasoning; causal and interpretable AI;probabilistic graphical models; deep learning on graphs; variational Bayesian methods; free energy minimization; active inference;intelligent human machine collaborative systems; crowd-sourcing; interaction and communication policy; continuous and active learning.Ongoing projects: media forensics, fraud detection, IIE from documents, document classification, aerial image understanding, activity understanding for retail videos, modeling weather phenomena, domain-adaptive speech recognition, GANs for discrete data, images (compositional models) and videos; disentangling factors of variation in image & text; multimodal VAEs; stability analysis of DCNs; deep learning on graphs, etc.What you'll need:An M.S. or Ph.D. in computer science, electrical engineering, or a related disciplineExpertise & hands-on experience in AI, ML, CV, NLP, ASR or related area; publication in relevant top-tier conferences or journals highly desirableProficiency in relevant programming languages and relevant tools and librariesFamiliarity with Hadoop/Sparc, GPU programming, SQL, noSQL DBs; experience with application development in Linux/ Windows desirableExcellent communication, problem-solving, and analytical skills; ability to learn quicklyPassion for theoretical and applied research and for answering hard questions with dataAbility to work both autonomously and with a teamWho we are: Verisk Analytics is a leading data analytics provider serving customers in insurance, natural resources, financial services, government, and risk management. We're a member of Standard & Poor's S & P 500 Index and part of the Nasdaq-100 Index. In 2016, Forbes named Verisk to its World's Most Innovative Companies list and to its America's Best Large Employer list. Verisk is one of only 14 companies to appear on both lists. We're headquartered in Jersey City, New Jersey, right across the Hudson River from downtown Manhattan. We are hiring in Jersey City (US), Germany (Munich) and India (Hyderabad, Bangalore) and can consider other locations.  The AI Innovation Lab conducts applied R & D in AI and ML focused on computer vision, document understanding, NLP, and speech understanding. We work in collaboration with leading academic experts. We build deployment-robust AI-based solutions for 13 business verticals. Lab members are expected to conduct and/ or supervise high impact research leading to publications and the engineering of robust AI-based products leading to inventions and patents  If this opportunity looks exciting and challenging to you, please click Submit Now to apply. #LI-MV1Requirements: ExpertiseInformation Technology  EducationMasters  Job TypeFull Time  LocationNJ-Jersey City  All members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.  Privacy PolicyConditions of UseVerisk Analytics Trademarks"}