{"jobID": "2612433730", "jobLocation": "Newark_NJ", "jobTitle": "Data Science Specialist", "companyRating": null, "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": null, "jobDescription": " If your skills reside at the intersection of analytics, technology, business and innovation, then we have a unique and exciting opportunity for you!  Prudential Financial is looking for a high-energy Data Scientist to join our diverse team of Engineers, Economists, Computer Scientists, Mathematicians, Physicists, Statisticians and Actuaries tasked with mining our industry-leading internal data to develop new analytics capabilities for our businesses.  The role requires a rare combination of sophisticated analytical expertise; business acumen; strategic mindset; client relationship skills, project management; and a passion for generating business impact. This is an exciting opportunity to be a part of a strategic initiative that is evolving and growing over time.  Primary responsibilities for this position include leading, designing, building, testing and presenting forward-thinking, high-impact Data Science projects focused on strategic business initiatives.  Prudential Financial employs 48,000 across the US, Asia, Europe and Latin America providing insurance, investment management and other financial products that are vital to the wellbeing of our customers and their families in over 30 countries. Prudential is reinvigorating Newark’s downtown area with our new Prudential Tower and Hain building development. Newark is Prudential’s Global Headquarters with over 5,000 employees across four downtown locations. We’re located a short walk or shuttle ride from Newark’s Penn and Broad Street Stations: a direct train ride or short drive (with free parking) from most of Northern and Central New Jersey and New York City. Responsibilities:Develop and maintain consultative relationships with key business stakeholdersIdentify, source, transform and join public, proprietary and internal data sourcesModel large structured and unstructured data sources (e.g. financial transactional, time-series, text, speech/audio and image)Implement advanced statistical methods for prediction and optimization including a wide variety of machine learning technologies (logit, regression, decision trees/forests, boosted models, clustering, etc.) for purposes including explorative analysis, survival analysis, segmentation, prediction and recommendation systemsPerform analysis and implement solutions that maximize business impactPrepare and present written and verbal reports to key stakeholdersSome domestic travel may be required Execute all aspects of an advanced analytical projects with minimal guidance"}