{"jobID": "2819995614", "jobLocation": "Santa_Clara_CA", "jobTitle": "Sr Scientist - Analytical Ops", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Abbott Park, IL", "Size": "10000+ employees", "Founded": " 1888", "Type": " Company - Public (ABT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. JOB DESCRIPTION: Abbott Vascular is searching for an individual to strengthen our Equipment Operations team which supports R&D; engineers and scientists and ensures the instruments, equipment and software meet the rigor of current regulatory standards. We are looking for an individual who enjoys a wide range of responsibilities and new challenges.  Responsible for equipment operations and compliance support of multiple R&D; projects:  Working within a quality system, ensure equipment is properly maintained, qualified, and/or calibrated. Provide customer support to R&D; engineers, chemists, microbiologists, and technicians to ensure their equipment/instrument needs are met. Apply the principles of GAMP to computerized instruments, equipment qualification, and calibration practices. Have a strong understanding of Data Integrity and 21 CFR Part 11 requirements. Have a strong understanding of regulatory requirements specific to medical devices. Work closely with instrument vendors to ensure compliance with contractual agreements; ensure documentation of activities complies with the quality system; Create and coordinate vendor contracts and activities. Provide internal and external audit support for evaluation (of compliance with external regulations/standards e.g. ISO13485, 21 CFR Part 210, 211, and 820, etc.). Understand of GLP requirements with regards to equipment, software, and data, per 21 CFR Part 58. Participate in the establishment of project goals, operational strategies, and process improvements.  Accountability  (Influence/Leadership) Establishes and cultivates an extensive network of support to facilitate completion of assignments. Participates in the development of less experienced staff by setting an example, providing guidance and work direction, and offering counsel. May lead a project team. Participates in determining goals and objectives for projects. Influences middle management on technical or business solutions.  (Planning/Organization) Plans and organizes non-routine tasks. Initiates or maintains work schedule. Establishes priorities of work assignments.  (Decision Making/Impact) Exercises judgment in selecting innovative, practical methods to achieve problem resolution. Failure to obtain results or erroneous decisions or recommendations would typically result in serious program delays and considerable expenditure of resources. Qualifications Bachelor's degree (Scientific) plus 6+ years of related work experience with a strong understanding of specified functional area. Advanced degree preferred.  (Technical/Business Knowledge (Job Skills)) Wide application of technical principles, practices, and procedures. Strong understanding of business unit function and cross group dependencies/relationships. Will perform this job in a quality system environment. Failure to adequately perform tasks can result in noncompliance with governmental regulations.  (Cognitive Skills) Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors. Exercises judgment within generally defined practices and policies in selecting methods and techniques for obtaining solutions. Has a sound knowledge of various technical alternatives and their impact. Additional requirements:Extensive Knowledge of cGxP, GDP, GAMP, 21CFR Part11, Annex 11, MHRA guidance, and industry best practices.Thorough understanding of the principles of computer systems validation, SDLC, VLC methodologies, and electronic data integrityStrong understanding of good documentation practicesExcellent with communication, interpersonal skills, and customer supportAble to function as a software administratorProven ability to work independently to research and resolve technical issuesAbility to work with cross-functional teamsClear and effective communication&writing; skillsNO RELOCATION ASSISTANCE IS AVAILABLE FOR THIS POSITION JOB FAMILY:Manufacturing  DIVISION:AVD Vascular  LOCATION:United States>Santa Clara : Building B - SC Floor-2 ADDITIONAL LOCATIONS: WORK SHIFT:Standard  TRAVEL:Yes, 10 % of the Time  MEDICAL SURVEILLANCE:Yes  SIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day), Continuous standing for prolonged periods (more than 2 consecutive hours in an 8 hour day)  Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.  EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf  EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}