{"jobID": "2776555585", "jobLocation": "Pennington_NJ", "jobTitle": "Senior PV Scientist", "companyRating": null, "companyInfo": {"Website": "www.spectraforce.com", "Headquarters": "Raleigh, NC", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Title: Senior PV Scientist Duration:- 06 months Location:- Pennington, NJ 08534 Job description: Purpose/Objective of the job Support Medical Safety Assessment Physicians (MSAP) in leading Safety Data Review (SDR) Teams. Appropriately perform core signal detection activities, elevate program or portfolio issues impacting key Medical Surveillance Team (MST) programs, priorities, resources, milestones. Author safety data query responses, contribute to specified sections of the Periodic Benefit Risk Evaluation Report (PBRER) and Development Safety Update Report in a specified therapeutic area and perform core signal detection activities. Ensure pharmacovigilance regulatory compliance with limited or no oversight as needed. Mentor less experienced scientists and teams in aspects of project management, MST requirements, core signal detection, and authoring of safety data query responses and sections of the PBRER and DSUR as appropriate to meet individual or group of MST/subteam needs. Key Responsibilities and Major Duties 1. Lead Safety Data Review (SDR) Teams, and participate in related PV and product-development subteam(s) in a specified therapeutic area. Appropriately elevate issues impacting key MST activities, milestones, documents to the MST Chair with limited or no oversight as needed. 2. Mentor individuals in aspects of project management, drug development and MST requirements, as appropriate to meet overall MST/subteam needs. 3. Author PV contributions to specified sections of the PBRER and DSURs with limited or no oversight as needed. 4. Periodic review and summary of pertinent safety-related literature, analysis of pre-determined core signal data with limited or no oversight as needed. Provides advice and mentoring to scientists of summaries, evaluations and conclusions. 5. Author safety data query responses to health authorities including coordination and integration of input from other functional groups, as needed to support responses to ad hoc queries with limited or no oversight as needed. Mentor and supervise scientist review and authoring of safety data queries as appropriate. 6. Collaborate within and across Client functions with appropriate disciplines to identify and ensure management of internal and external documentation and support when required with limited or no oversight as needed. 7. Apply knowledge of product goals, strategy, drug development stage milestones, partnership agreement, HA commitments, and individual functional area responsibilities. Mentor individuals and teams on these applied learnings. List of minimum requirements • Degree/Certification/Licensure BS/RN/MS/PharmD/PhD/MD, or equivalent with relevant scientific experience and/or training discipline • Experience – Responsibility and minimum number of years Minimum of 6-9 years BS/RN; 4-6 years MS/PharmD/PhD/MD or equivalent relevant Pharmaceutical Industry experience; Demonstrated ability to mentor and coach others. Competencies – knowledge, skills, abilities, other 1. Good working understanding of medical concepts and some familiarity with safety activities in drug development and postmarketing and global safety health authority requirements. 2. Good working understanding of team priorities and milestones. Ability to manage timelines and quality of work using organizational and interpersonal communication skills. Appropriately communicates items that could impact timelines or quality. 3. Demonstrated strong writing skills and experience in authoring and managing the production of strategic scientific documents (eg,safety-risk related documents, clinical documents, PBRER, DSURs). 4. Ability to work well in cross-functional teams. 5. Strong collaborative and communication skills with scientific subject matter. 6. Attention to detail along with strong scientific, analytical and conceptual skills and the ability to reach reasoned conclusions. Ability to understand complex medical-scientific data from a broad range of disciplines (eg, clinical trial laboratory data, nonclinical data, postmarketing reports, scientific literature, and regulatory documents). • Software that must be used independently and without assistance (e.g., Microsoft Suite) Understand aspects and methods for data analysis, interpretation and presentation. Possess good working skills in MS Word, Excel and PowerPoint, including statistics."}