{"jobID": "2802640386", "jobLocation": "Chicago_IL", "jobTitle": "Provider Data & Credentialing Analyst", "companyRating": null, "companyInfo": {"Website": "www.delawarelife.com", "Headquarters": "Waltham, MA", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Insurance", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Clear Spring Health  Provider Data & Credentialing Analyst  Chicago, IL Company Overview Clear Spring Health is a newly formed health insurance company within Delaware Life Insurance Company building a health insurance operation headquartered in Chicago, IL. Clear Spring Health’s insurance operations are conducted through multiple health insurance plans. The Clear Spring Health management team is located in “The Loop” of Downtown Chicago and provides all supporting services to the health insurance plans and Clear Spring Health Holding Company. Job Summary Performs the operations of all credentialing and provider data management functions ensuring compliance with National Committee for Quality Assurance (NCQA), Center of Medicaid/Medicare Services (CMS) and other regulatory standards. Performs all reporting and data requirements for the health plan, including but not be limited to such activities as: network development reporting, provider data reporting and data comparisons for startup and ongoing operations, extractions for directory submissions, maintenance of data among multiple systems for integrity, operational scorecards, and other reporting and data requirements as defined by the plan. Main AccountabilitiesOversee the provider setup processes ensuring accurately and timely setup for claims payment, member assignment and directory display. Coordinate with vendors to address Network Data errors and claims processing issuesOversee the credentialing and re-credentialing of all physicians, mid-level practitioners and organizational providers according to the plan specifications and ensures the process between credentialing and provider data integrity is seamlessEnsure compliance with NCQA and DHHS credentialing requirements and participate in activities related to plan NCQA accreditationCollaborate with the health plans and various departments on network expansion efforts, large claims and contract amendment projects and various related initiativesReview and update departmental policies and procedures to ensure compliance with NCQA, CMS and other regulatory agenciesFacilitate Credentialing Committee activities and serve on Quality Improvement Committees, when neededDirect oversight and coordination of GeoAccess reports and provider network reports required for submission to CMS on an ongoing basisAccountable for any ad hoc reporting needs as defined by the health planResponsible for all other provider data functions including provider set up forms, maintenance of provider records and audit provider data recordsEnsure all provider data entries and updates are completed accurately and timelyManage and monitor provider data integrity, accuracy, and trendingOther duties as assignedConduct audits on provider setup and credentialingQualificationsBachelor’s degree in Business Administration, Communications or related field3+ years of provider data management, credentialing or healthcare operations experience (i.e. claims processing, billing, provider relations or contracting)Experience performing data analysis in MS Excel or similar tools is requiredExperience in a managed care, Insurance or medical office environment is preferableImmaculate attention to detail and excellent proofreading skillsStrong data analysis skills"}