{"jobID": "2758310713", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Postdoctoral Fellow or Research Scientist - Structural Biology", "companyRating": "4.3", "companyInfo": {"Website": "www.vai.org", "Headquarters": "Grand Rapids, MI", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "32000", "jobDescription": " Van Andel Research Institute’s Huilin Li Laboratory, led by Huilin Li, Ph.D. is seeking to hire either a Postdoctoral Researcher or a Research Scientist. Van Andel Research Institute (VARI), a leading independent biomedical research facility, is dedicated to determining the epigenetic, genetic, molecular and cellular origins of cancer, Parkinson’s and other diseases, and translating those findings into effective therapies. The Institute is home to more than 200 scientists and support staff that work in on-site laboratories and in collaborative partnerships that span the globe.  Dr. Li and his lab use advanced technologies such as cryo-electron microscopy (cryo-EM) to investigate eukaryotic DNA replication, the bacterial proteasome system, and several membrane protein complexes. Qualifications:A Ph.D. (or equivalent degree) with experience and publications in the fields of biochemistry, biophysics, structural biology, or other related fields.Description of a Successful Candidate:A self-motivated and driven individual who is able to exhibit exceptional research productivity and take responsibility for independent management of the project.A detail-oriented researcher that thinks critically to effectively design experiments and solve complex research problems.A strong ability to take initiative and work independently, as well as in a team environment.A collaborative, hands-on researcher who proactively shares knowledge and expertise with lab members.Application Process: Qualified applicants should provide a cover letter outlining research experience and interests, a curriculum vitae, and the names and address of three references  If you possess these attributes and desire to help us drive science from the bench to the clinic; while benefiting from a highly generous compensation package; we would welcome speaking with you and encourage you to apply today.  This position will be open until filled. If you have any difficulty uploading your application or any questions, please email Eric Miller at eric.miller@vai.org. VAI is actively striving to diversify its workforce and strongly encourages qualified individuals from underrepresented groups to apply. Van Andel Institute is an EEO and Affirmative Action Employer.About Grand Rapids, MI Van Andel Research Institute is located in downtown Grand Rapids, MI which is the second largest city in Michigan and the largest city in West Michigan. Grand Rapids offers a remarkable combination of cosmopolitan atmosphere and small town warmth, known for its philanthropic and sustainability-driven community, and is ranked one of \"America's Top 100 Places to Live.\"  Located on the banks of the Grand River, Grand Rapids offers all the big-city excitement you'd expect from a million-resident metropolis, featuring hundreds of restaurants and nightspots, theatres, museums, sports and concerts. The safe and clean downtown is surrounded by an eclectic mix of walk-able neighborhoods.  With a medical and life sciences industry boom, strong entrepreneurial activity, dedication to green building and living, and innovative employers, Grand Rapids' diverse economy continues to grow, offering endless career opportunities.  Required Skills Required Experience Job Location  Grand Rapids, US-MI "}