{"jobID": "2830065000", "jobLocation": "Fort_Worth_TX", "jobTitle": "Business Intelligence Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.cookchildrens.org", "Headquarters": "Fort Worth, TX", "Size": "5001 to 10000 employees", "Founded": " 1918", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Children's Health, Texas Health Resources, Baylor Scott & White Health"}, "estimatedSalary": "73000", "jobDescription": "Summary: Emerging IT professional within the Business Intelligence family developing and applying expertise in one or more IT disciplines that support Cook Children's infrastructure.  Jobs in this family are responsible for developing, testing, maintaining, installing, and/or deploying technologies. In addition, they are responsible for the establishment, development, and promotion of standard architectures, as well as hardware and software components. This role provides consulting services to application development teams and/or customers regarding technologies and the application of specific technology standards.  Disciplines for this job description include: Amalga, Business Intelligence (BI), ETL processes & tools, SQL development and optimization, business process monitoring (BPM) & key-performance-indicators (KPI), reports & dashboards, analytics, database design, data warehousing, source code control, and the Microsoft BI stack (e.g., SSIS, SSRS, and SSAS). Qualifications:Position requires at least 3 years of direct experience and a high school diploma or equivalent.A BA/BS degree in IS or Business preferred.Epic Clarity Certification in Reporting Workbench and Radar is highly preferred.Strong working experience with Reporting Workbench and Radar is highly preferred.Certification in Epic Inpatient module is highly preferred.Prior experience as an Epic Application Reporting Lead (ARL) is a plus.Experience with SQL development is a plus. Cook Children's is an EOE/AA - Minority/Females/Disability/Vet "}