{"jobID": "2821204921", "jobLocation": "Royal_Oak_MI", "jobTitle": "Public Relations Intern", "companyRating": "3.2", "companyInfo": {"Website": "www.detroitzoo.org", "Headquarters": "Royal Oak, MI", "Size": "201 to 500 employees", "Founded": " 1928", "Type": " Nonprofit Organization", "Industry": " Non-Profit", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41000", "jobDescription": "The Detroit Zoological Society is seeking college student interns who are in their junior or senior year and studying Public Relations, Communications, Journalism or related fields. Interns are responsible for researching and drafting press releases, talking points, newsletter profiles, social media posts and other PR-related copy; scheduling and coordinating media interviews; escorting media through the Detroit Zoo; updating website content; and performing other PR-related assignments. Interns work closely with the Communications staff and other interns while learning valuable skills needed in the public relations workforce. Excellent writing and public speaking skills are a plus.  The duration/hours of the internship are as follows: Winter early January through early May; 16 hours a weekSummer early May through late August; 16 hours a weekFall late August through mid-December; 16 hours a weekThis is a unpaid internship, and it is mandatory that students receive course credit. Public Relations Intern will work closely with the Communications Director, Communications Manager and other interns while learning valuable skills needed in the Public Relations workforce. Principal Duties and ResponsibilitiesResearching and drafting press releases, newsletter profiles, talking points, Facebook content, and other PR-related copyScheduling media interviews and video/photo shootsEscorting media through the ZooAssembling and organizing publicity reports, media clips and press kitsWorking Conditions: Office attire is business casual. Interns are expected to dress professionally and appropriately at all times. Regular work schedule may include weekends or may be required to work occasional evenings, weekends, and early-mornings. The work environment is generally comfortable and more work is indoors although the position may require work outdoors with exposure to seasonal weather conditions for special events, tours, openings, etc. Physical Requirements: Must be able to perform the principle duties of the job. Requires moderate physical effort on a daily basis such as walking, bending, stooping and standing for extended periods of time. Must be able to use a computer and telephone, communicate with employees, candidates, vendors and visitors and use reasoning and calculation skills and make decisions. Must be able to lift and move 20 pounds. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions of the job. Knowledge, Skills, and Abilities (Minimum):Must be a college junior or senior studying Public Relations, Communications or related fieldThis is a non-paid internship, and it is mandatory that students receive course credit.Must be available to work 16 hours/2 days per week, 9 a.m. to 5 p.m.Must have strong written and oral communication skillsMust be responsible and organizedMust be able to work effectively both individually and in a teamMust be prompt and thoroughStrives to excel and shows dedication through their workMust always exhibit professionalismThe deadline for applications is August 1, 2018."}