{"jobID": "2367628369", "jobLocation": "Midland_MI", "jobTitle": "Registered Nurse RN - Neuro Trauma ICU", "companyRating": "3.6", "companyInfo": {"Website": "www.midmichigan.org", "Headquarters": "Midland, MI", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Covenant HealthCare, McLaren Health Care, Spectrum Health"}, "estimatedSalary": "27", "jobDescription": " Position Information  Exempt: No  Any Shift: Hours per schedule (CASUAL)  Weekend & Holiday Rotation: Per schedule  Pay Grade: 14  Position Summary  This position performs a variety of integrated neurological/neurosurgical and trauma critical care functions, intuitively, using the nursing process while applying a broad nursing knowledge in a caring, concerned manner.  Responsibilities ESSENTIAL DUTIES AND RESPONSIBILITIES: (25%) Assesses patient for physical, emotional, psych/social and family support.  (25%) Organizes and coordinates all aspects of patient care according to the patient’s real and/or perceived needs.  (25%) Evaluates patient progress by correlating patient information with nursing knowledge to determine if goals are being met according to the patient’s plan of care or clinical path.  (25%) Consults and collaborates with members of the healthcare team in planning and implementing total patient care for individuals. OTHER DUTIES AND RESPONSIBILITIES: Provides for the age specific needs of the population served according to department standards and policies/procedures as evidenced by observation, documentation and peer feedback for the following:  Adolescent - 13 to 17 years  Adult - 18 to 64 years  Later Adult - 65 years and older  Demonstrates proficiency (according to hospital and unit policy and procedure) in nursing skills to carry out the patient’s plan of care.  Communicates interactions, both verbal and written, that clearly and positively accomplish desired patient care as a collaborative effort.  Educates patients and families.  Provides teaching, support and coordination of healthcare plans for patient and family through the acute phase of illness, as needed.  Promotes clinical knowledge development including critical thinking skills and improves strategies for comparing clinical judgment through research and continuing education.  All other duties as assigned.  Qualifications  * Associates Degree or higher in Nursing required. Bachelor's degree in nursing preferred.  * Registered Nurse license in the State of Michigan required.Basic Life Support (BLS) certification is required within 90 days of hire or transfer date.Dysrhythmia Interpretation Man (DIMC) is required within 12 months of hire or transfer dateAdvanced Cardiac Life Support (ACLS) certification is required within 12 months of hire or transfer date.Completion of orientation process as directed by the NTICU nurse manager.Interpersonal skills needed to communicate successfully with individuals and groups and interact with people at all levels to communicate ideas and concepts in a clear and understandable manner.MidMichigan Health is a technology driven organization and employees need to demonstrate competency in Microsoft® Windows. An employee may be required to participate in further learning opportunities offered by MidMichigan Health.CCRN certification preferred.ECCO (Essentials of Critical Care Orientation) preferred.  Physical/Mental Requirements and Working Conditions  Exposure to stressful situations, including those involving public contact, as well as, trauma, grief and death. Able to wear personal protective equipment that includes latex materials or appropriate substitute if required for your position.  Is able to move freely about the unit and hospital.  Overall vision is necessary; including reading, depth perception, close-up work and must have a peripheral field of vision.  Hearing and speech on the phone as well as in person are necessary.  Must be able to communicate verbally in person, on the phone and in writing.  Frequently required to sit/stand/walk for long periods of time.  Some exposure to blood borne pathogens and other potentially infectious material.  Ability to handle multiple tasks, get along with others, work independently, regular and predictable attendance and ability to stay awake  Is frequently required to aide patients, including lifting.  Must be able to lift a minimum of 50 lbs.  Overall dexterity is required, including handling, reaching, grasping, fingering, and feeling.  Must follow MidMichigan Health bloodborne pathogen and TB testing as required.Apply!"}