{"jobID": "2766360000", "jobLocation": "Chicago_IL", "jobTitle": "Business Analytics Manager", "companyRating": "3.9", "companyInfo": {"Website": "www.parkwhiz.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Transportation & Logistics", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": "ParkWhiz is looking for a Business Analytics Manager who will dive into our product to uncover opportunities, answer important questions, and help us scale efficiently. We're constantly looking for ways to improve our product and this position is responsible for using the massive amount of data we aggregate to deliver on that mission. Reporting into our Head of Business Intelligence, the Business Analytics Manager ultimately enables our success by providing accurate, timely analysis and insights to all departments. Are you passionate about data and the power it yields in optimizing product? If so, read on.What you'll be doing Work with variety of data sources - extracting knowledge and actionable information from massive datasetsBe a passionate problem solver - breaking down problems and developing analytical insightsOwn our data visualization and reporting toolsAnalyze A/B experiments and dig into how users are engaging with product featuresConvey your work and results to a wide variety of internal and external stakeholders nerds and non-nerdsDrive the development of analytics frameworks and the strategic roadmap for the data teamManage and mentor business analysts What you bring to the table 3-5 years supporting a product organization in an analytics capacityA love for insights, innate curiosity, and a deep desire to find ways to create valuePassion for automationComfort in a complex data environment and understanding of data structuresExperience with SQL and Excel. Experience with some flavor of data visualization (we use Looker)Familiarity with transactional and data warehouse environments (Postgres, Redshift)The business sense to understand why you're pulling data and whether it seems accurate...not just pulling itYou like to formulate the right questions versus just seeking answers to make sure the best and smartest decisions get made What you get A data environment that isn't a total messThe tools - or additional tools, if need be - to get the job doneSolve big problems across departments and for leadershipHigh functioning and capable teammatesOpportunity to directly impact success for a rapid growing business in a fast paced industryWho will I work with?We are a very tight knit team that is inclusive, fun and hard working. Our number one priority after producing a great product is keeping that spirit alive. We have a firm, non-negotiable no jerk policy. We accept you for who you are and consider everyone on an equal opportunity basis without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status."}