{"jobID": "2764714619", "jobLocation": "Chicago_IL", "jobTitle": "Computational Biologist: Phenotypic and genomic data analysis", "companyRating": "3.3", "companyInfo": {"Website": "www.tempus.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "74000", "jobDescription": " Passionate about using complex data to make an impact in the world of cancer?  With the advent of genomic sequencing, we can finally decode and process our genetic makeup. We now have more data than ever before but healthcare ecosystem doesn't have the infrastructure or expertise to make sense of said data. Here at Tempus, we believe the greatest promise for the detection and treatment of cancer lies in the deep understanding of molecular activity for disease initiation, progression, and efficacious treatment based on the discovery of unique biomarkers.  We're on a mission to connect an entire ecosystem to redefine how genomic, clinical, and imaging data are used in clinical settings. We are looking for data scientists who are passionate about developing and applying state of the art techniques to processing and analyzing vast amounts of clinical, genomic, and molecular data. Data scientists will collaborate with product, research, and business development teams to build the most advanced data platform in cancer care.  What You'll Do Research and development of novel imaging data based machine learning algorithms for the product platform.Apply statistical and machine learning methods to analyze large, complex data sets.Communicate highly technical results and methods clearly.Interact cross-functionally with a wide variety of people and teams. Qualifications PhD degree in a quantitative discipline (e.g. statistics, statistical genetics, imaging science, computational biology, computer science, applied mathematics, applied physics or similar) or equivalent practical experienceExperience developing, training, and evaluating deep-learning models using public DL frameworks (e.g. TensorFlow, Keras, and PyTorch)Experience developing, training, and evaluating classical machine learning models, such as linear and logistic regression, SVMs, Random Forests, and Gradient BoostingFamiliar with CUDA and GPU computingExperience modeling genomic and phenotypic dataSelf-driven and work well in an interdisciplinary team with minimal directionThrive in a fast-paced environment and willing to shift priorities seamlessly Nice to Haves Kaggle.com competitions and/or kernels track recordExperience with AWS architectureExperience working with survival analysis, clinical and/or genomic dataExperience working with Docker containers and cloud-based compute environments.Familiarity with neural network techniques (batch-norm, residual connections, inception modules, etc)."}