{"jobID": "2674173653", "jobLocation": "Sunnyvale_CA", "jobTitle": "Sr. Data Scientist", "companyRating": "3.1", "companyInfo": {"Website": "www.oath.com", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "175000", "jobDescription": " Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.Oath, a subsidiary of Verizon, is a values-led company committed to building brands people love. We reach over one billion people around the world with a dynamic house of 50+ media and technology brands. A global leader in digital and mobile, Oath is shaping the future of media.Our MissionBuild brands consumers loveBuild platforms customers loveBuild a company talent lovesA Little About UsOur Analytics team is responsible for use case and experimental analysis for Yahoo Search, Phone Top and Mail Assistance Products. We are passionate about data driven product development and deep dive into large data sets to gather actionable insights to influence product and business decisions. We drive logging standards to ensure high data quality and accurate measurement of product performance. We design and analyze experiments to help improve user experience and monetizationA Lot About YouYou have strong organizational skills, intellectual curiosity, and a passion for achieving practical business impact leveraging big data and analytics. We are looking for someone who is excited about experimentation (A/B testing), driving and documenting logging standards, writing new metrics specs based on research work, troubleshooting data issues, and is skilled at turning data into actionable product insights. You are self motivated, have excellent collaborative and communication skills to successfully work with cross-functional teams.Your DayEstablish and drive instrumentation standards and validation across all productsWork closely with product team to understand their requirements and provide guidance on experiment design and test planAnalyse and present test results with launch recommendationsCoordinate with product and engineering teams and troubleshoot any data issues Work with product teams to understand business problem, frame the problem into questions that can be answered through data analysis, formulate analysis plan, analyze data and deliver actionable insights.Extract data from Hadoop file system using Pig/Hive and use statistical tools and techniques to analyze data to improve user experience and monetization.Use deep analytical capabilities to transform data into actionable insights and effectively present your findings to product partners and executives to help make data-driven product and business decisions.You Must HaveBS or MS with focus on Economics, Statistics, Mathematics or Computer ScienceExperience with data analysis tools such as Excel, SQL, or RExperience with big data technologies such as Hadoop, Pig, Hive, or SparkExperience with programming languages such as Python or Perl Familiar with large scale data, modern data mining and machine learning methodsAbility to tell compelling, data-driven stories based on large, complex data setsIdentifying, quantifying and resolving data discrepancies to insure high-accuracy reportingExperience with Experimentation Frameworks for A/B Testing and MultiVariate Testing, Test design and measurementExcellent problem solving, analytical skills and business acumen combined with ability to collect and organize data, analyze and formulate insights, present and deliver recommendations effectively to influence product and business decisionsExcellent communication and collaborative skillsSelf-motivated and results-drivenOath is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or other protected category. Oath is dedicated to providing an accessible environment for all candidates during the application process and for all employees during their employment. Please let us know if you need a reasonable accommodation to apply for a job or participate in the application process by contacting us at hr-benefits@oath.com, or call us at 1-866-772-3182.Submission of this information is voluntary and refusal to provide it will not subject you to any adverse treatment.Currently work for Oath? Please apply on our internal career site. ​"}