{"jobID": "2837913465", "jobLocation": "Silver_Spring_MD", "jobTitle": "Financial Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.tiag.net", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 1999", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "48000", "jobDescription": "tiag has an opening for a Financial Data Analyst supporting the Walter Reed Army Institute of Research (WRAIR) located in Silver Spring, MD.  The Financial Analyst will utilize GFEBS, General Fund Enterprise Business System. This systems is the US Army's web-based enterprise resource planning (ERP) solution that leverages commercial off-the-shelf business enterprise software (SAP) to enable organizations to compile and share accurate, up-to-date financial and accounting data across the entire active Army, Army Reserves and Army National Guard.Description of Responsibilities:Provide Resource Management (RM) transactional data input and support into GFEBS in the following functional areas: Funds Management/Funds Distribution, Spending Chain, Government Purchase Card (GPC), Payroll, Labor Allocation, Cost Management, Project Systems, and Travel Reimbursements.Run management and financial reports in GFEBS to include but not limited to: Status of Funds Reports, Open Commitment Reports, Open Obligation Reports, and Cost Management Reports.Customize financial reports and create detailed worksheets with financial information pertaining to commitments, obligations, expenses, and other activities to be used for reconciliation and informational purposes.Review and analyze error reports in order to make corrections in GFEBS.Provide SAP expertise within different areas of the organizations, and assist in finding solutions and creating financial business processes. Create job aids as needed.Provide system administrator services for GFEBS to include Governance, Risk, and Compliance (GRC) Administrator and Training Co-Coordinator services.Provide technical assistance, monitor the status of GFEBS initiatives, and coordinate meetings as requested by the organization. Assist in the establishment of any new GFEBS functionalities such as Project Systems/cProjects.Develop and standardize policy and process measures for SAP transactions and reporting requirements.Deliver training to include developing job aids at both the individual and group levels.Directly assist with creating Purchase Requisitions, Work Breakdown Structures (WBSs), and reports in ERP and BI.Job Requirements:"}