{"jobID": "2822597828", "jobLocation": "Torrance_CA", "jobTitle": "Customer Support Agent", "companyRating": null, "companyInfo": {"Website": "www.tricomquest.com", "Headquarters": "Gardena, CA", "Size": "1 to 50 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Pasona NA, Interesse International, Interplace"}, "estimatedSalary": null, "jobDescription": " Posted on Customer Support Agent  TriCom Quest  in  Torrance, CA USA Compensation  $16 to $18 Hourly Benefits Offered  Dental, Medical, Vision Employment Type  Full-TimeCustomer Support AgentGrowing Consumer Goods Manufacturing CompanyA popular consumer goods manufacturer in the household/home goods sector is in search of a Customer Service Representative with people skills and a knack for troubleshooting. B2C call center customer service experience is required.Title: Customer Support Agent Location: Torrance, CA Status: Temp - Hire / Non-Exempt Schedule: Monday – Friday, 8:00am – 5:00pm (flexible with 1 hour earlier/later shifts) Compensation: $16 – 18 / hour depending on experience-level Job Description: Provide high-level phone, e-mail and chat support:  · Answer incoming customer service phone calls  · Respond to customer inquiries via ticketing system  · Provide optimal customer support to troubleshoot any issues that arise  · Provide chat support when needed  · General order entry  · Perform other related duties as assigned Requirements: · Strong verbal and written communication skills  · Strong follow-up and follow-through skills  · Customer service experience in a B2C call center  · Consumer goods or related industry experience would be a major plus  · Familiarity with social media  · Patient team-player with a positive attitude  · Tech-savvy  · Proficient in MS Office Suites About TriCom Quest:For over twenty years, TriCom Quest has been a leader in the employment consultant industry, providing staffing services for both employers and job seekers, at virtually every level - from entry to executive. Our service spans the United States, providing placements for a broad range of companies, including those headquartered in the Pacific Rim with satellite offices within the United States. Yet what makes us stand out from the employment \"crowd\" is our service. Whether you're hiring employees or in search of a job, TriCom Quest is committed to quality service, from the very first handshake to placement, and beyond.Company website:  http://www.tricomquest.com  Other applicants:  20+ 20+ other people applied to this job.  Posted date:  13 days ago  View all Jobs at TriCom Quest"}