{"jobID": "2817712615", "jobLocation": "Houston_TX", "jobTitle": "ETC - Web Application Development and Data Analytics Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.chevron.com", "Headquarters": "San Ramon, CA", "Size": "10000+ employees", "Founded": " 1879", "Type": " Company - Public (CVX) ", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " ExxonMobil, Shell, BP"}, "estimatedSalary": "85000", "jobDescription": " Salary/Rate N/A Permanent  Location  Houston, TX Texas, US, United States  Posted By  Chevron  Date Posted  33 minutes ago  Expires 22 Jun 2018 Qualifications None  ETC - Web Application Development and Data Analytics Analyst in Houston, TX Texas, US, United States  Houston, TX Texas, US, United States | N/A | Permanent  Chevron is one of the world's leading energy companies, with approximately 60,000 employees working in countries around the world. We explore, produce and transport crude oil and natural gas; refine, market and distribute fuels and other energy products; manufacture and sell petrochemical products; generate power; and develop future energy resources, including biofuels and geothermal energy.  Chevron is accepting online applications for the position of Web Application Development and Data Analytics Analyst located in Houston, TX / USA through June 5, 2018 at 11:59 p.m. (Eastern Standard Time).  Requisition ID#******  This position is in Chevron Energy Technology Company/Technical Computing Department/Subsurface Work Flow and Data Management Unit/Exploration Application Services team to develop web applications and data analytics solutions to support Chevron Exploration Work Flow under Global Exploration organizations  Responsibilities for this position may include but are not limited to: Works with Chevron Exploration Organizations to provide web application development services for Chevron Exploration Work Flow.Gathers business requirements, designs, develops, tests, and deploys new solutions or enhancements for existing web solutions as well as new initiativesIntegrates emerging technologies, such as Azure cloud and data analytics, as well as ArcGIS services, to serve Exploration WorkflowsCreate and deploy new Power BI solutions as well as migrate Spotfire files into Power BIProvides data management in ArcSDE; Create maps in ArcMap for deployment into web server; Create and manage Esri Services as well as deployment of services in GeoCortex; Work with Business Unites to capture polygons.Required Qualifications:Bachelor's degree in computer science, engineering, or math is required.Proficiency in software development skills: Microsoft .NET Framework, MS Visual Studio, C#.NET, *******, MVC design pattern, SOA web service, relational database design, Oracle and SQL server database object development (stored procedure, trigger, and etc.). Minimum 3-5 years experience is required.Proficiency in software development life cycle management process. Able to independently gather business requirements, design and implement enhancements, and coordinate user testing. Minimum 3-5 years experience is requiredPreferred Qualifications:Data analytics knowledge/experience is a plus.Any ArcGIS experience is a plus.Excellent business engagement and communication skills.Capable of maintaining and strengthening working relationship with upstream business partners and effectively communicating to different level of management.Customer focused and demonstrated strong analytical and independent problem-solving skills.Excellent team player with the ability to work independently and in a group environment.Experienced with managing multiple concurrent work streams in a fast-paced working environment.Relocation Options: Relocation may be considered. International Considerations: Expatriate assignments will not be considered.  Chevron regrets that it is unable to sponsor employment Visas or consider individuals on time-limited Visa status for this position. Regulatory Disclosure for US Positions: Chevron is an Equal Opportunity / Affirmative Action employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status, or other status protected by law or regulation.  Chevron participates in E-Verify in certain locations as required by law.  Job Reference *****-en_US"}