{"jobID": "2693291122", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Operations Analyst (Sequoia One)", "companyRating": null, "companyInfo": {"Website": "www.sequoiasolution.com", "Headquarters": "Solana Beach, CA", "Size": "1 to 50 employees", "Founded": " 2012", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "As Sequoia Ones Data Operations Analyst, you will plan, implement, communicate and manage the administration of our clients employee benefit programs. You will be responsible for ensuring data integrity within the HR management system (PrismHR) as well as managing a successful partnership with third party benefit and system providers. You will design and develop scalable benefits admin processes and focus on creating operational efficiencies for the organization. Success in this role requires both creative, long-term thinking and a hands-on get it done approach.What You Get To DoTriage and respond to system errors and data requests via ticketing systemProvide customer support to both internal and external customersProvide hands-on support for HRMS (PrismHR) and oversee system testingPerform problem and root cause analysis. Outline resolution options and take appropriate actions to resolveQualifications3+ years professional experience with HR systems or administering employee benefits preferredAdvanced Excel skillsAdvanced problem solving skills and the ability to work collaboratively with other departments to meet complex business needs Solutions-oriented team player who takes initiative and is accountable for resultsOrganized, detail and process-oriented thinker with strong analytical skillsSequoias Culture Our most important asset:• Integrity• Passion for service• Innovative• Growth oriented• Caring for others• Promise-centric• Focused on relationship buildingCompensation & BenefitsSequoia provides competitive compensation including base salary, performance based bonus programs, and comprehensive benefits package including 401(k) matching."}