{"jobID": "2553681314", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.1", "companyInfo": {"Website": "www.geteuclid.com", "Headquarters": "San Francisco, CA", "Size": "1 to 50 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "164000", "jobDescription": "Have you ever wanted to explore vast sets of WiFi data to tease out behavioral patterns of consumers? Do you laugh in the face of difficult classification problems, where labelled data is hard to come by? Does the prospect of using state of the art big data tools such as Scala, Spark and Elastic Map Reduce thrill and excite you? If you answered yes to these questions, you would be a perfect fit for Euclids Senior Data Scientist position. Were looking for an experienced data scientist to lead the development of our cutting edge behavioral metrics designed to aid retailers and restaurants competing in an increasingly omnichannel world. What is the role / what is your day to day? Be a technical leader in the design decisions on data products to leverage Euclids massive and distinct datasetHelp steer the roadmap of Euclids data driven capabilities to aid a wide variety of clientsQuickly design, scope and prototype new data productsDevise strategies to understand, classify and QA performance of our various predictive metrics being used by our clientsBe a mentor to the more junior data team members including guidance on model design as well as leading code and design reviews What skills do we look for? Robust skills in statistics, probability, and/or machine learning2+ years with relational database and querying languages (e.g. SQL)3+ years experience with scripting languages for pre-processing and statistical analysis (e.g. Python + Pandas, R )Experience with Scala or other functional programming a plusExperience with Spark, Flink or other map-reduce technologiesComfortable working in an AWS environment with strong Linux keyboard skillsHave full stack experience in data collection, aggregation, analysis, visualization, productization, and monitoring of data science productsBonus:Can concretely explain the difference between an monoid and a monadPassion for continuous integration and automated testingPerks and Benefits:Competitive compensationStock options401kTop-of-the-line health, dental, and vision insuranceLife insuranceStrong upward mobility and career growth opportunities\"Take-it-as-you-need-it vacation policyBright office in the Mission district of San FranciscoCatered lunches, snacks galore and thirst-quenching beveragesFrequent team eventsfrom casual drinks to faux game shows to service daysEuclid Analytics illuminates identity and behavior in the physical world. Todays mobile-first customer provides the opportunity to recognize every visitor who walks in the door, understand what drove that visit and retarget to influence a purchase. Marketers from the leading retail and restaurant brands rely on Euclids data platform to better reach, inspire and serve their customers, increasing their lifetime value in the process. Euclid's growing offline network captures hundreds of millions monthly visits from over one billion unique devices across tens of thousands of locations. Euclid is backed by leading venture capital firms Benchmark Capital and NEA, as well as Cox Enterprises and Groupe Arnault, the controlling shareholder of LVMH Moet Hennessy Louis Vuitton, the world leader in luxury products."}