{"jobID": "2817016371", "jobLocation": "Chicago_IL", "jobTitle": "AML Data Quality Analyst", "companyRating": null, "companyInfo": {"Website": "www.ifgprojectresourcing.com", "Headquarters": "Toronto, Canada", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Subsidiary or Business Segment", "Industry": " Finance", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: AML Data Quality Analyst  Location: Chicago, IL  Job type: Contract  Job Description:  This is a Senior role in the AML Data Quality program, focused on Data Quality, data issue root cause and analysis. The role has a lot of do with examining data, triaging data and working through data quality rules, being able to analyze the data quality rules and setting out precedent for to help with AML regulation. This role works with key stakeholder to elaborate more on their findings.  GROUP INFORMATION/CULTURE:  The AML Data Management group is responsible for develop for Data quality monitoring and data quality analysis and rule development. This group helps the entire bank is compliant to AML regulations and procedures. Team is made up of data modelers, data quality analysts etc.This group is very fast paced environment but is an open group, very friendly and accommodating, very focused.  RESPONSIBILITIES:  The AML Data Quality Analyst is responsible for driving Data Quality Rules, measures and results across all in-scope AML initiatives. The incumbent will work within the AML LOB to ensure the proper data is acquired and performing adequately to meet AML control needs. The incumbent must have a working knowledge of AML controls, systems and data to meet this need. The incumbent will be called on to perform duties in projects, production as well as ad-hoc analysis of data to meet business needs. The ability to understand and create data mapping and movement from source to target is critical.  ACCOUNTABILITIES:  Key deliveries and work effort will include: Time will be spent working on Data Quality Rules and related activities across all in-scope AML initiatives. This includes data quality assessment of existing rules as well as working the CDEs down to the source systems, working with the AML Business and Governance to create the rule request for hand-off to EDG for review. Participate in the EDG review with the Sr Data Quality Manager to jointly support AML needs and justifications.Time will be spent using and enhancing the AML Metadata in the Metadata hub tool. This includes, but is not limited data lineage (source to target) transformations as well as data glossary. Use of this tool is key as the primary for to analyzing the status of the data. The incumbent will represent needs and requirements to the EDG/Hub Teams for inclusion in the tool. The incumbents goal is to ensure the tool serves AML Data and Analytics needs and provides AML D&A; with a self-service capability. In doing so, the incumbent will act as the SPOC to EDG, representing AML. The incumbent will work with the AML Data Operations manager to bring key areas of improvement and focus on the tool to the EDG/Hub Teams.Time will be performing Data Lineage spot checks as required by the AML Data and Analytics team; driving results for correction back to the IDP data Lineage COE and the MetaData tool support team. In addition, the incumbent will work closely with the US and CA Model Management teams by reviewing model documentation with respect to Critical Data Elements, Data Flows (Source to target, systems doc) as well as addressing DQ questions and concerns. Other key tools of which SME is required are Aginity Workbench, Power Designer as well as a deep knowledge of SQL. DAILY RESPONSIBILITIES: Collect and analyze a wide variety of data from the sources to the consuming AML applications. Analysis to include but not limited documenting the business and value of the data to conclude recommendations on data quality thresholds, mapping and/or corrections to ensure the data meets the business needs.Conduct a comprehensive review of data issues to drive out root cause and offer corrective recommendations with plans to execute as needed.Monitor data quality and threshold output results on a regular basis, perform root cause analysis, offer plans for correction and execution.Be called upon to create reports related to Data quality up put and conditions. Work within the Data Management team to improve reporting and monitoring capability.Present formal results to various levels stakeholders and levels of management within the AML program. These results should capture the health of data for the program as well as indicate areas for improvement.Perform detailed analysis on data, deliver results sets as requested by business groups within AML such as FIU/HRU, Data Governance or Technology Modeling and Analytics.Ensure adherence to all aspects of First Principles, our code of Business Conduct and Ethics, including individual accountability as it relates to potential conflicts of interest, safeguarding of customer information, trading in securities, anti-money laundering, privacy and disclosure of outside business activities. REQUIRED KNOWLEDGE & SKILLS (Must Haves): 5-7+ years of experience as a data analyst.Prior banking experience is required for this role.Need to be curious about why the systems work the way they do and then being able to bridge the gap between the business requirement and the AML regulationsStrong understanding of data analytics, data architecture/movement and how data is used within AML for critical controlsAbility to work independently given general directions/guidanceDemonstrated experience in Data Quality ManagementWorking knowledge of applicable Bank systemsAnalytical Thinking (In-depth)Problem solving (In-depth)Strong communications skill, oral and writtenOrganizational Understanding (Working)Risk Management (In-depth)The ability to convey clear and concise thoughts and recommendationsAMLEO knowledgeSQL queries is required NICE TO HAVES: AML data quality experience is a very nice to have.Hadoop is a very nice to haveStrong working knowledge in SASAginity workbench experience.Knowledge of capital markets products would be an asset - correspondent banking, trading products, trade finance transactions SOFT SKILLS: ConfidenceDriven, have purposeSelf-startingGood communication and presentation skills (to upsell theory and concept)DiligenceBroad thought process TECHNOLOGY USED ON A DAILY BASIS: IBM Meta Hub ToolAginity Work BenchHadoop/HivePower DesignerExtreme ExcelSQLSkypeVisio For immediate consideration, send your word.doc resume to [Click Here to Email Your Resumé]"}