{"jobID": "2817607355", "jobLocation": "Houston_TX", "jobTitle": "Senior Data Scientist/Computational Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.chemence-us.com", "Headquarters": "Alpharetta, GA", "Size": "51 to 200 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Consumer Services", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "121000", "jobDescription": " Senior Data Scientist/Computational Scientist ============================================= Date: Jun 14, 2018  Location: Houston, TX Texas, US  Apply now Apply now Start apply with LinkedIn Start apply with LinkedIn Help * Start apply with Seek Start apply with Seek  Help * Apply Now  Help Start* Please wait... Loading  Chevron is one of the world's leading energy companies, with  approximately 60,000 employees working in countries around the world.  We explore, produce and transport crude oil and natural gas; refine,  market and distribute fuels and other energy products; manufacture and  sell petrochemical products; generate power; and develop future energy  resources, including biofuels and geothermal energy.  Chevron is accepting online applications for the position of Senior  Data Scientist/Computational Scientist located in Houston, TX Texas /  United States through June 29, 2018 at 11:59 p.m. (Eastern Standard  Time).  Requisition ID#******  This role functions as an Senior Data Scientist/Computational  Scientist on the Emerging Data Science and Analytics Team within the  Technical Computing Unit in Chevron s Energy Technology Company (ETC).  ETC is Chevron s premier innovation hub and home to our industry  leading technical expertise. ETC partners with Chevron s business  worldwide to solve the technical challenges of finding and producing  energy. The role reports to the Data Science R&D; Team Lead within the  ETC Technical Computing Emerging Tehcnology Unit.  Responsibilities for this position may include but are not limited to: Will contribute to the team by applying Machine Learning methods to some of the more complex problems using latest Machine Learning  and AI technologies and methodologies This individual will be expected to both develop their own code, as well as install/test/experiment with commercial and open source  software packages related to data science, big data technology,  and machine learning. Required Qualifications:B. S. in technical discipline required, i.e.: Computer Science, Mathematics, Physics, Engineering, Geoscience 5+ years of experience in technical capacityBackground in computational and applied mathematics, computational physics, base sciences, programming for scientific computing, and  a strong knowledge of high performance computing infrastructure. This individual should understand the relation between mathematical models, the numerical methods needed to implement  them, and the hardware on which they will run. Details: Strong scripting/programming skills. Ability to take idea from inception to full working prototype. Strong Linux/Unix skills helpful for quickly experimenting with new Hadoop-related technologies Strong Python skills, bash or csh, C/C++/C# or Java, SQLHas delivered projects using Machine Learning libraries, such as TensorFlow, AML, scikit-learn, MatLab, NumPy, etc. Familiarity with high performance infrastructure, ability to experiment with installation of new packages and software. Evidence of delivering innovative solutions having challenged conventional thinking and demonstrated how data science can  inform and support decision making. Preferred Qualifications:M.S./PhD in technical disciplines preferredDeep knowledge of at least one petroleum functional discipline (e.g. Geology &Geophysics;, Facilities Engineering, Petroleum  Engineering, etc.) and understanding of how these areas can  benefit from application of artificial intelligence and high  performance computing. Understanding of advanced methodologies like DeepLearning is desirable. Familiarity with high performance computing, storage and networking Fluency with a range of numerical methods: e.g. solvers, simulation modeling methods (e.g. ensemble kalman filter, etc.),  Genetic Algorithms, multi variate regression, Regularization  Techniques, Boosting, Random Forests, SVM, convolution and  deconvolution, inverse problems, wavelet/fourier/laplace  transforms, Weibull Distribution, etc. Demonstrated experience in evaluating technologies and developing solutions that address current and future business capability  needs. Innovative creative thinker capable of envisioning the future, mapping out a plan and executing the plan to generate business  value. Broad working knowledge of technologies including modeling, data analytics and IT infrastructure technologies. Ability to operate in a multi-functional team providing expertise and technical acumen in a wide variety of technologies, provide  assistance and guidance through influence to groups outside of the  team, and collaborate across different cultures and time zones if  necessary. Leadership abilities considered a plus.Relocation Options: Relocation may be considered. International Considerations: Expatriate assignments will not be considered.  Chevron regrets that it is unable to sponsor employment Visas or  consider individuals on time-limited Visa status for this position. Regulatory Disclosure for US Positions: Chevron is an Equal Opportunity / Affirmative Action employer.  Qualified applicants will receive consideration for employment without  regard to race, color, religion, sex, sexual orientation, gender  identity, national origin, disability or protected veteran status, or  other status protected by law or regulation.  Chevron participates in E-Verify in certain locations as required by  law.  Nearest Major Market: Houston  Apply now Apply now Start apply with LinkedIn Start apply with LinkedIn Help * Start apply with Seek Start apply with Seek  Help * Apply Now  Help Start* Please wait... Loading"}