{"jobID": "2824120587", "jobLocation": "Silver_Spring_MD", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.verizon.jobs", "Headquarters": "New York, NY", "Size": "10000+ employees", "Founded": " 2000", "Type": " Company - Public (VZ) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amazon, Microsoft, Google"}, "estimatedSalary": "123000", "jobDescription": "What you’ll be doing...Summary Verizon’s Security, Risk, and Compliance group is looking to hire a Lead Data Analyst for its Data Platform and Analysis team. Candidates filling this position should be comfortable acting in a subject matter expert role, working with broad guidance, and conducting independent research and experimentation. A qualified candidate will be fluent in at least one (if not more) programming language(s) used in the data science, data analytics, and/or machine learning discipline. Additionally, the candidate should be competent in observational and inferential statistics, methods, and algorithms. The candidate will work within a technical team as well as across the organization, including with business sponsors and other technology teams. The successful candidate will have a strong drive to explore diverse sets of data, critically analyze the data in the context of key business requirements and deliver valuable guidance to be leveraged by cross-organizational leadership teams. ResponsibilitiesAnalyze data related to the security, risk management, and compliance regimes for Verizon Wireline Business UnitsAcquire, visualize, and model business and operational data setsWork with business process owners to derive actionable intelligence from untidy dataLead the data science process from acquisition of relevant data to presentation of your findingsEvaluate and research established and emerging analytical technologies, develop proofs of concept, and cross-train team members as requiredServe as a senior member of the Data Intelligence team and lead other team members in solving problems via prototyping, self-guided exploration, and iterative developmentDevelop data analysis, reporting, visualization and prediction applications in R, Python, or other languages/platformsWhat we’re looking for...Must have:A 4 year degree and 6 or more years of relevant work experience as a data analyst or data scientistSix or more years of work experience in a data analysis or data science positionAdvanced R or Python programming experienceEven Better If You Also Have:Bachelor’s degree or Master's Degree in Mathematics, Computer Science, Data Science or similar technical fieldA solid foundation in statistics, with strong competencies in data structures, algorithms and data modelsHigh levels of creativity and quick, problem solving capabilitiesExpertise in feature design and cleaning dataExperience with scalable storage systems like HDFSExperience with data visualization tools and frameworksExperience in data science methods and exploratory analysisKnowledge of machine learning and predictive models such as decision forests, Naïve Bayes, etc.Two or more years working with a software or product development team, or a verifiable history of significant material contribution to an open-source data science project.Familiarity with the following tools and platforms is desired Compute Platform: Amazon EC2, RDS, S3, CloudFormationsLanguages: Python, R, SQLFrameworks: R Tidyverse, Pandas/Numpy, Shiny, matplotlib, Keras and other applicable tootsets.Databases: MariaDB, MS-SQLBig Data: Hadoop, Spark, HiveData Pipelining: Apache Kafka, Apache NiFiProject Governance Tools: Atlassian Confluence, Atlassian Stash/Bitbucket (git compatible SCM), Atlassian Jira, JenkinsWhen you join Verizon... You’ll be doing work that matters alongside other talented people, transforming the way people, businesses and things connect with each other. Beyond powering America’s fastest and most reliable network, we’re leading the way in broadband, cloud and security solutions, Internet of Things and innovating in areas such as, video entertainment. Of course, we will offer you great pay and benefits, but we’re about more than that. Verizon is a place where you can craft your own path to greatness. Whether you think in code, words, pictures or numbers, find your future at Verizon. Equal Employment Opportunity We're proud to be an equal opportunity employer- and celebrate our employees' differences, regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or Veteran status. Different makes us better."}