{"jobID": "2812280182", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.ncsoft.net", "Headquarters": "Seoul, South Korea", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (036570) ", "Industry": " Media", "Revenue": " $10+ billion (USD) per year", "Competitors": " Blizzard Entertainment, Riot Games, Electronic Arts"}, "estimatedSalary": "81000", "jobDescription": " NCSOFT is seeking a talented Data Analyst to work across multiple released and unreleased mobile game titles. The Data Analyst is responsible for collecting data, generating reports, and analyzing player behavior. Youll work closely with Game Designers and Product Managers on data-driven business decisions for our portfolio of free-to-play mobile games.  NCSOFT is focused on making high-quality, cutting-edge, and conceptually innovative Massively Multiplayer Games. NCSOFT is a great place to work, fostering creativity and collaboration. Because of this it has attracted top talent from the best of the best in the MMO industry. A casual, friendly work environment, comprehensive benefits package, a competitive salary, and more are all part of what makes NCSOFT a great place to work. If you love making great games and have the skills to make it happen, then NCSOFT is the place for you. RESPONSIBILITIES:Work closely with game teams to define, drive and track progress of game KPIs.Analyze game systems, economies, and player behavior to drive game development and business practices that maximize player enjoyment and profitability.Understand, analyze, and predict trends in player data.Collect and help to elaborate on data reporting requirements, primarily from game design, customer service, and business departments.Create and run A/B & multivariate tests within game and marketing environments.Generate reports from accumulated data using SQL, Excel, HTML, Google Analytics, Tableau, and Qlikview, as well as defining automated procedures related to data collection.Communicate findings, actionable recommendations, and data limitations to stakeholders to facilitate data-driven decisions.Formulate process improvement suggestions through ad hoc analyses and data mining.Take ownership of data integrity to ensure that the data are correctly supporting the analyses and recommendations being proposed.REQUIREMENTS:Bachelor's degree in Computer Science, Statistics, Mathematics, Economics or related field, or equivalent experience with data analyticsExperience using SQL to query for and to aggregate dataQuantitative skills including statistical analysis and hypothesis testingUnderstanding of game design and in-game economiesStrong communications skills and ability to work on a teamPLUSES:Previous MMO development experience or avid gaming experienceExperience with big data software like HadoopOther programming or scripting skills (i.e. Python)"}