{"jobID": "2796403948", "jobLocation": "Washington_DC", "jobTitle": "Sr. Systems Engineer", "companyRating": "3.5", "companyInfo": {"Website": "www.keywcorp.com", "Headquarters": "Hanover, MD", "Size": "1001 to 5000 employees", "Founded": " 2008", "Type": " Company - Public (KEYW) ", "Industry": " Aerospace & Defense", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " CACI International, SAIC"}, "estimatedSalary": "117000", "jobDescription": "Position DescriptionThe Senior Systems Engineer:Uses analysis and design techniques to solve business problems using information technology.Serves as change agents who identify the organizational improvements needed, design systems to implement those changes, and train and motivate others to use the systems.Identifies, understands, and plans for organizational and human impacts of planned systems, and ensure that new technical requirements are properly integrated with existing processes and skill sets.Develops system architecture from the ground up by interacting with internal users and customers to learn and document architectural requirements.Interacts with software architects and developers to understand software limitations. Understands and can develop use cases, flowcharts, UML and BPMN diagrams.Participates or supports related architecture maturity management activities, and maintains the enterprise architecture framework(s) used for the IT systems architecture.Prepares recommendations for system improvement for management and user consideration.Provides technical input into business case analyses and supports analysis of technical alternatives.Leads jr level engineersPosition RequirementsBA/BS degree or higher in Information Systems, Computer Science, Engineering, Business, or related field.Four years’ experience with the design, execution, and oversight of large- scale information technology (IT) projects.Minimum of two years of progressive experience in selecting and implementing Commercial- Off- the- Shelf (COTS) enterprise solution applications.Highly specialized in one or more phases of software systems conceptualization, systems integration, or network engineering.Experience leading the design, configuration, and implementation of enterprise- wide COTS hardware and software solutions at the functional module level.8-10 years of experience applying analytical techniques when gathering information from users, defining work problems, and recommending technology solutions and procedures to resolve the problems.Ability to make decisions on the techniques and approaches to be used.Clearance Requirement: This position requires a Top Secret Clearance. How to Apply? Please click apply on the right.  KeyW is a pure-play national security solutions provider for the Intelligence, Cyber and Counterterrorism Communities' toughest challenges. We support the collection, processing, analysis and dissemination of information across the full spectrum of their missions. We employ and challenge more than 2,000 of the most talented professionals in the industry with solving such complex problems as preventing cyber threats, transforming data into intelligence and combating global terrorism.  KeyW, together with its direct and indirect subsidiaries, encourages and actively supports a policy of Equal Employment Opportunity and commits to provide equal opportunity to each individual, regardless of race, color, religion, gender, sexual orientation, age, national origin or ancestry, marital status, veteran status, disability or any other classifications protected by Federal, State or local law. In fact, we foster an environment that promotes diversity, balance and fun—because we believe in the importance of having a workplace as unique as the challenges we solve.Apply!"}