{"jobID": "2803116457", "jobLocation": "Washington_DC", "jobTitle": "Operations Research Analyst, Senior", "companyRating": "3.6", "companyInfo": {"Website": "www.mantech.com", "Headquarters": "Herndon, VA", "Size": "5001 to 10000 employees", "Founded": " 1968", "Type": " Company - Public (MANT) ", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": "Req ID 98792BR  Business Title Operations Research Analyst, Senior  Group MSS  Location USA DISTRICT OF COLUMBIA Washington  Clearance Level Needed Secret  Category Scientific / Analytical  Job Duties and Responsibilities At ManTech, our Operations Research Analyst' have the opportunity to work, not only at our facilities but on-site with customers performing operational analysis using a variety of computer models and simulations such as Brawler Air Combat Simulation, Combat Forces Assessment Model (CFAM), Advanced Framework for Simulation, Integration, & Modeling (AFSIM), Synthetic Theater Operations Research Model (STORM), and Extended Air Defense Simulation (EADSIM). You would conduct complex logical analysis of management problems and management information requirements and formulates mathematical models of problems for solutions by computer. Prepare mathematical models of problem areas in forms of one of several equations that relate constants and variables, restrictions, alternatives, conflicting objectives and their numerical parameters. Lastly, you would gather, relate, identify data with variables in models by applying personal judgment and mathematical tests.Requirements1. Bachelor's Degree in related field or equivalent experience and five to seven years of related experience or Master's degree and three to five years of related experience.2. Operations Research (OR) Degree desired.3. Previous Modeling and Simulation (M&S;) analysis experience highly desired.4. Knowledge and/or experience in Air Force and/or Navy Air-to-Air and/or Air-to-Surface operations is desired.5. Previous M&S; and Tool development and some computer programming skills (C++, FORTRAN, etc.), data base development, Geographic Information System (GIS), and management is desired.6. A current Secret security clearance with the ability to obtain Top Secret (current Top Secret desired).QualificationsRequires Bachelor's degree in a related discipline or equivalent, seven to nine years of related experience, and proficiency in the use of computer-spread sheets, databases and other related tools.Additional Qualifications Years of Experience: 07-09 years w/Bachelor’s Degree 05-07 years w/Master’s Degree Qualifications Requires Bachelor’s degree or equivalent, and five to seven years of related experience.  Degrees Equivalent Experience/EducationBachelor's Degree Years of Experience 11-13 years w/High School Diploma05-07 years w/Bachelors Degree02-04 years w/Masters Degree Position Type Full-Time  Shift Day  Overview For more than 40 years, ManTech employees have been solving complex problems for the national security community. We are comprised of approximately 10,000 talented employees around the world. We adhere to the simple, no-nonsense values on which ManTech was founded more than four decades ago, aligning squarely with the mission objectives of our customers. As our customer base continues to expand and diversify, we continue to diversify our workforce and solutions. Half our employees have a military background, and more than 70 percent hold a government security clearance. As a leading provider of innovative technology services and solutions for the nation's defense, security, space, and intelligence communities; we hold nearly 1,000 active contracts with more than 40 different government agencies. "}