{"jobID": "2811477738", "jobLocation": "Chicago_IL", "jobTitle": "Principal Research Scientist", "companyRating": "3.8", "companyInfo": {"Website": "www.abbvie.com", "Headquarters": "North Chicago, IL", "Size": "10000+ employees", "Founded": " 2013", "Type": " Company - Public (ABBV) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Amgen, Baxter, Bristol-Myers Squibb"}, "estimatedSalary": "153000", "jobDescription": "The Analytical R&D; department at AbbVie is seeking an experienced  senior scientist, group leader preferably with expertise in the areas of process  analytical, CMC, regulatory filings and pharmaceutical sciences.  The individual  will be responsible to lead the analytical support of API development and  commercialization while working with other functional areas to advance projects  through the pipeline. Responsibilities:Experience in leading cross-functional teams focused on  drug substance control strategy and specification setting across all  stages of API development. Sound understanding of overall CMC development.Expertise in analytical method  development and validation, method transfer in a cGMP environment. Experience  in working with CRO and CMO is highly preferred.Familiar with API control strategy, regulatory starting  material (RSM) justification and mutagenic impurity (MI) assessment.Experience in filing IND/IMPD. Filing experience on NDA  and/or MMA is not a must but considered as a plus.Experience in mentoring junior scientists and strong  record of successfully influencing key stakeholders and collaborators to  drive decisions.Excellent communication skills and demonstrated record  of building lasting partnerships across organizational boundaries.Record  of leading research focused on long-term competitiveness and experience in  leveraging external innovation and resources to augment internal capabilities.Basic:Bachelors, Masters, or PhD with 14+ (BS), 12+ (MS), and 6+ (PhD) years of experience in pharmaceutical or related industry.Preferred educational background  includes but is not restricted to Analytical Chemistry, Organic chemistry,  Biochemistry, Pharmaceutical Sciences or Chemical Engineering.Key Leadership Competencies:Builds strong relationships with peers and  cross-functionally with partners outside of team to enable higher  performance.Raises the bar and is never satisfied with the  status quo.Learns fast, grasps the \"essence\"  and can change course quickly where indicated.Creates a learning environment, open to  suggestions and experimentation for improvement.Embraces the ideas of others, nurtures  innovation and manages innovation to reality.Equal Opportunity Employer Minorities/Women/Veterans/Disabled"}