{"jobID": "2745096389", "jobLocation": "Austin_TX", "jobTitle": "Data Analyst", "companyRating": "2.8", "companyInfo": {"Website": "www.hhsc.state.tx.us", "Headquarters": "Austin, TX", "Size": "10000+ employees", "Founded": " 1912", "Type": " Government", "Industry": " Government", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": "Posting Type: Open to All ApplicantsCategory: Computer and Mathematical FLSA Exempt/  Non-Exempt: ExemptAgency: Health & Human Services Comm Department: HDIS Operations SupportJob Title: Data Analyst Posting Number: 379451Full Time/Part Time : Full Time Regular/Temporary: RegularJob Location: 909 W 45TH ST City: AUSTINContact: AccessHR Service Center Telephone: 888-894-4747Salary Range: $4,301.16 - $5,670.54 Salary Group: B22Shift: Days (First) Travel: 5%Closing Date:Job Description: The Data Analyst (Systems Analyst IV) reports to the Data Analytics and Reporting Team (DART) Manager in Health, Developmental and Independence Services (HDIS), Medical and Social Services Division. The Systems Analyst IV conducts agency data analysis for reporting on agency operations and programs within HDIS and for management decision support. The Systems Analyst IV interacts with HDIS program subject matter experts to define business problems, understand specialized programs, and gather data for reporting, and coordinates projects with other analysts in the unit as needed. The Systems Analyst IV is responsible for monitoring the evaluation of existing complex business systems and procedures. Duties include program system maintenance and analyses in areas of specialization. The position works under limited direction with considerable latitude for the use of initiative and independent judgment. The amount of travel involved is expected to be minimal. The Systems Analyst V will perform other duties as assigned, including those required to maintain HDIS operations.Essential Job Functions: Conducts ad hoc, routine, and long-term data analyses using highly advanced analytical and data-conversion methods and reports results in an appropriate format, including performing quality assurance review and documenting processes for technical and non-technical users. These analyses will be planned and conducted with considerable latitude for independent judgement. (30%) Uses SAS, Excel, and other software to prepare concise, comprehensive technical reports to present and interpret data for the suite of programs in Health, Developmental and Independence Services. May perform quality assurance and serves as a subject matter expert on data integrity, extraction, and compilation. May identify alternatives, and make and justify recommendations on data revisions. (20%) Collaborates with DART team members, program staff, and subject matter experts to provide technical expertise to aid in decision making and problem resolution. (25%) Consults with internal and external customers and stakeholders to identify data needs. May present data findings to customers and stakeholders. (15%) Other duties as assigned may include actively participating during a disaster response and/or recovery effort, serving in a supporting role during a disaster response and/or recovery effort, and assisting in work to maintain continuity of operations of the agency during a disaster response and/or recovery effort. (10%)Knowledge Skills Abilities: Knowledge of the collection, analysis, and dissemination of health and human services data, including applying state and federal reporting requirements and guidelines. Knowledge of research methods, principles, techniques and philosophies. Knowledge of statistical concepts, methods, and their application to data analysis. Skill in analyzing complex data and synthesizing large amounts of information using computer software package applications including but not limited to SAS, SQL, Tableau, or SPSS. Skill in analyzing and evaluating systems and procedures. Skill in preparing, interpreting, and presenting complex statistical and data analysis reports. Skill in communicating and interacting effectively with stakeholders including co-workers, program managers, and program staff. Skill in organizing research findings and developing creative solutions for presentation and implementation. Skill in developing presentations. Skill in writing concise reports. Skill in planning, coordinating, and monitoring projects and/or supervising the work of others. Skill in functioning effectively as both a team member. Ability to work under tight deadlines and manage multiple projects and deliverables. Ability to follow program directives and policies. Ability to coordinate activities. Ability to organize tasks and projects. Ability to communicate orally and in writing, including presenting research results in non-technical language.Registration or Licensure Requirements: Initial Selection Criteria: Graduation from an accredited four-year college or university with major coursework in a relevant field (e.g., information technology, computer science, statistics, public health, epidemiology). Minimum two years’ experience in SAS programming, data analysis, or similar job function. Additional work experience may substitute for education on a year-for-year basis. Master’s degree preferred."}