{"jobID": "2759387197", "jobLocation": "Chatham_NJ", "jobTitle": "Environmental Engineer/Geologist/Scientist – Junior Staff Position (1-3 Years) – AK", "companyRating": "2.3", "companyInfo": {"Website": "www.bemsys.com", "Headquarters": "Chatham, NJ", "Size": "51 to 200 employees", "Founded": " 1990", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "54000", "jobDescription": "About UsBEM Systems, Inc. (BEM) is a small environmental consulting firm, which provides comprehensive environmental services to federal, state, and local government agencies. Our areas of technical practice are focused on environmental planning and compliance, remediation, water resources, and environmental data management and software development. Our firm enjoys a distinguished reputation for client responsiveness and creative problem solving. As an employee-owned small business, we look for team players who demonstrate individual initiative and embrace new challenges.Job DescriptionBEM has an excellent opportunity for a junior-level Environmental Engineer/Geologist/Scientist position to support our growing backlog of challenging projects in the State of Alaska. This individual will work directly with project managers providing support to various projects, including developing sampling plans, conducting field investigations, data analysis and site characterization and report writing. This person’s main responsibilities are to support several projects under different managers, become an expert in executing field investigations and preparation of a summary report while working under the wing of experienced Engineers, Geologists and Scientists.Key ResponsibilitiesSupport and eventually lead field investigations (soil, groundwater, sediment, surface water, etc.). Includes coordination of field events, soil characterization and boring logs, monitoring well installations, overseeing soil and groundwater remediation activities (e.g., excavation, injections, etc.).Provide office support for projects, including preparing Alaska Department of Environmental Conservation (ADEC) submittals, sampling plan development, report writing.Be familiar with ADEC rules, regulations and guidance documents.Provide GIS and data management support for projects, if applicable.RequirementsBachelor’s degree in Engineering/Geology/Environmental Science or related field; Masters a plus.1 to 3 years of experience in site remediation, including developing sampling plans, conducting field investigations and report writing.ADEC Qualified Environmental Professional per 18 AAC 75.333 (or ability to become one).ADEC Qualified Sampler per 18 AAC 75.333 (or ability to become one).Knowledge of ADEC guidance documents, and experience working under an ADEC Qualified Environmental Professional and/or an ADEC Qualified Sampler.Knowledge of federal environmental programs such as RCRA, CERCLA, CWA, CAA, ESA, etc.40-Hour OSHA HAZWOPER, USACE EM 385-1-1, NSTC Unescorted, first aid, and CPR certifications preferred.Abilities and SkillsGood field skills preferred such as soil logging, soil and groundwater sampling, vapor investigations, etc.Proficient with MSWord, Excel, PowerPoint, and Outlook software.Good verbal and written communication skills.Ability to perform well under pressure and within established deadlines.Ability to work extra hours during periods of high volume.Ability to travel to complete field investigations in adverse weather conditions carrying objects up to 50 pounds.Ability to travel to remote field locations in small aircraft including helicopters.Demonstrated passion for your profession and how it impacts your world.Experience with GIS and AutoCAD a plus.Chemical background with experience in reviewing data reports and conducting data validation a plus.Professional-in-training license (EIT, GIT) a plus.Possess a valid driver’s license, clean driving record, and ability to provide documentation.Ability to access United States Department of Defense facilities (access coordination provided through BEM Systems, Inc.). HR Manager  BEM Systems, Inc., Corporate Office  100 Passaic Avenue  Chatham, NJ 07928  E-Mail: dbushey@bemsys.com  Fax: 908.598.2622  Equal Opportunity Employer  M/F/D/ "}