{"jobID": "2812603633", "jobLocation": "Westwood_CA", "jobTitle": "MR Scientist", "companyRating": null, "companyInfo": {"Website": "www.uclahealthcareers.org", "Headquarters": "Los Angeles, CA", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Cedars-Sinai Medical Center, Loma Linda University Medical Center, Harbor Hospital"}, "estimatedSalary": null, "jobDescription": "ResponsibilitiesYou can align with a legacy of innovation. As a MR Scientist at UCLA Health you will have access to cutting-edge research and technology through designing, implementing, and testing MR pulse sequences for various research projects.  This work will fall under the general supervision of the Principal Investigator of the UCLA Brain Tumor Imaging Laboratory (BTIL) within the Center for Computer Vision and Imaging Biomarkers (CVIB) in the Department of Radiological Sciences.  If you are independent, inquisitive and have the ability to self-manage deadlines, this role is perfect for you.  Selected Duties  Creating new pulse sequences for morphological and quantitative imaging  Developing and implementing novel protocols for neuro imaging and data analysis techniques  Assisting investigators with experimental design and data analysis  Providing technical training and support including MR physics and data analysis  Programming on Siemens, GE and Bruker scanners  Conducting phantom and tissue specimens study  Attending and preparing for meetings and presentations as needed  Keeping up to date with evolving technical standards and application frameworks  Backing up and restoring databases using enterprise managerQualificationsPh.D. in medical physics, biomedical engineering, physics, or equivalent experience in a related field.  Extensive knowledge of MR-related hardware, software and analysis techniques.  Strong publication record in MRI.  Background in Siemens programming; developing sequences on Siemens scanners.  Experience with human and/or animal imaging using diffusion MRI, perfusion MRI, MR spectroscopy, CEST, or hyperpolarized MRI.  Minimum of five years experience in medical image processing, segmentation/registration techniques, generating high quality multimodal neuroimages, and quantitative analysis.  Ability to use dedicated CAD packages/pipelines for specific processing (e.g. Bash or python pipelines containing FSL, Freesurfer, AFNI, R, MATLAB, Osirix, or SPM scripts), and neuro-imaging software.  Previous exposure to OpenCV Neural Networks.  Knowledge of relational database software (Oracle, Postgres, MS-SQL).  Working knowledge of modern, structured programming/scripting languages (Python, C++, TCL, Perl. Javascript, Pl-SQL) and development tools.  Knowledge of Unix and Linux operating system, emacs editor, CVS, SVN.  In-depth knowledge of cross-sectional anatomy and physiology  Aptitude for computer software for word processing, data tabulation, and graphing.  Proficiency with software development and source control (e.g., GIT, Subversion) including gathering requirements, designing, implementing the design, and validating the implementation against the original requirements.  Database design, performance tuning, and maintenance of data integrity.  Create complex queries and stored procedures with cursors, create views, triggers, and functions.  Excellent interpersonal skills for interaction to communicate diplomatically and effectively with faculty, peers, patients, physicians, collaborators, researchers, administrators, and University faculty and staff."}