{"jobID": "2693131841", "jobLocation": "Mill_Valley_CA", "jobTitle": "Public Relations Coordinator", "companyRating": null, "companyInfo": {"Website": "www.glassdoor.com", "Headquarters": "Mill Valley, CA", "Size": "501 to 1000 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Indeed, LinkedIn"}, "estimatedSalary": null, "jobDescription": " Want to love your work? At Glassdoor, one of the world’s largest and fastest-growing job and recruiting sites, our mission is to help people everywhere find a job and company they love. As a fast-growing technology company, we are disrupting the employment industry on a global scale by changing how people search for jobs and how companies recruit talent. This is an opportunity to join an innovative company at a time of amazing growth.  Glassdoor is looking for a dynamic full-time Public Relations Coordinator who is ready to make an impact on a growing company. In this role, you will help our fast-paced PR and Corporate Communications team reach and influence a range of audiences including job seekers, employees, employers, recruiters, HR professionals and analysts. Responsibilities:Leverage news, company milestones, economic research, data, editorial content and events to create and grow awareness of the business as one of the leading job and recruiting sites, while also driving traffic back to Glassdoor and supporting employer lead generation activitiesWrite, edit and proofread communication materials (e.g. news releases, blogs, fact sheets, FAQs, pitches, corporate emails, briefing books, etc.) ensuring accuracy, quality and consistencyField incoming media requests, own select media contacts during outreach, and utilize pitching skills to secure coverage (Lots of media relations in this role!)Build and maintain positive relationships with key influencers, including online and broadcast news reporters and producersResearch and find new influencers, including news media, to help elevate Glassdoor’s job and recruiting leadershipMaintain and build media, employer and influencer listsManage corporate communication team assets (i.e. press center)Monitor and analyze daily news coverage - specific to company, industry and business newsProvide thoughtful research that supports and/or informs PR and marketing campaigns, product news announcements or other team assignmentsSupport timely PR, corporate communication or marketing campaigns as they ariseServe as a good ambassador of the business: smart, reliable, proactive, responsible and responsiveIdeal candidate will meet the following requirements:Demonstrated media relations skills and successBA or defined education in marketing, PR, communications, journalism or related concentrationAt least 1 year public relations experience, preferably with a consumer and/or B2B technology agencyStrong written and verbal communicationYou love media relations, a lotOutstanding organizational skillsStrict attention to detail and the ability to work under tight deadlinesResponsive and proactive on timely and priority campaigns and/or tasksProficient in Google Drive applications, i.e. Docs, Sheets, SlidesProficient in online social applications i.e. WordPress, Facebook, LinkedIn, Twitter, Instagram, Pinterest, YouTube, TweetDeck, Quora, etc.Experience with Google Analytics, Cision and/or Critical MentionYou have a ‘make it happen’ attitude – someone who is scrappy, creative, asks questions, provides status updates and speaks to performance around key resultsYou live and breathe ‘accountability’ – say what you’ll do and do what you sayYou demonstrate passion & dedication - we’re changing an industry after all. We need people who believe in what we are doing.You’re fun, upbeat & positive – sure, we work hard, but we also have fun along the way!*PLEASE INCLUDE COVER LETTERS WITH APPLICATION  Why Glassdoor?Work with purpose – join us in creating transparency for job seekers everywhereGlassdoor gives back! Glassdoor is a Pledge 1% member; all employees receive 3 paid volunteer days per year100% company paid medical/dental/vision/life coverage; 80% dependent coverageLong Term Incentive PlanSunny & peaceful Mill Valley offices located right on the waterWalking, running and biking trails steps away from the officeOnsite gym and fitness classesFree catered lunch; new menu dailyPaid holidays and flexible paid time offYour choice between Mac or PCDog-friendly office (with dog-free zones if you are so inclined)Free parking Glassdoor is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Glassdoor is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation."}