{"jobID": "2833878850", "jobLocation": "Canoga_Park_CA", "jobTitle": "Scientist I, Manufacturing Sciences", "companyRating": null, "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": null, "jobDescription": " Job DescriptionWhen youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.  The Scientist I, Manufacturing Sciences will perform Antibody Detection Preproduction processes.  Responsibilities: Assist with all aspects of receiving and quality control testing of raw materialsUpdate raw material inventoriesPerform antigen-bead conjugationPerform and analyze assaysAssist in processing of final productPrepare buffer solutionsAssist in keeping a safe environmentAbility to solve problems that may come up in the departmentAble to efficiently handle multiple tasks and projects simultaneouslyFrequent contact with Production Department, Warehouse, Purchasing and other laboratory personnelAssist supervisor in all aspects of preproduction processesMaintain confidentiality of laboratory data and processExpected to maintain work schedules as assignedAll laboratory personnel are expected to notify their supervisor or manager of any unsafe conditions and/or practices and to take appropriate corrective actionsMinimum Qualifications:Bachelors degree from an accredited higher learning institution in the Biological Sciences or ChemistryKnowledge of and one (1) year work experience in laboratory procedures and practicesBasic knowledge of Microsoft Word and ExcelOrganize self and maintain assigned work schedulesRead, understand and implement written laboratory proceduresAble to handle and work with biological and chemical reagentsWorking Conditions/Physical Requirements:Frequently work at laboratory workstation, low temperature freezers, and computer workstationsSome lifting of objects including laboratory instrumentation of 35 pounds This position has not been approved for relocation.  At Thermo Fisher Scientific, each one of our 50,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer. Apply today http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}