{"jobID": "2815435431", "jobLocation": "Chicago_IL", "jobTitle": "Capital Modeling Analytics Consultant", "companyRating": "3.2", "companyInfo": {"Website": "www.cna.com", "Headquarters": "Chicago, IL", "Size": "1001 to 5000 employees", "Founded": " 1897", "Type": " Company - Public (CNA) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Chubb, Zurich Insurance Group, The Hartford"}, "estimatedSalary": "90000", "jobDescription": "Job SummaryThis is an exciting opportunity to be part of an economic capital modeling team within an Enterprise Risk Management organization at a large P&C; company. The successful candidate will be able to liaise with subject matter experts within the organization, build individual and/or aggregate risk models, and deliver timely high quality results to senior management for making business decisions and formulating strategy. There will be opportunities to perform enterprise stress testing as part of Own Risk and Solvency Assessment analyses, work with rating agency capital models, analyze the capital impact of reinsurance and M&A; activities, and participate in the ongoing development, implementation and enhancement of various ERM / ORSA-related processes related to capital.The ideal candidate will be a rapid learner, able to adapt to changing priorities to respond to changing goals, and able to manage completing assignments with competing deadlines. They will also be innovative, have relevant credentials (e.g. ACAS/FCAS and/or MS/MBA) and be experienced in capital modeling with a keen interest in being part of a dynamic highly impactful team.Essential Duties & Responsibilities1. Performs complex modeling for the purpose of forecasting and analyzing various economic or business conditions and their impact on specific lines-of-business, the company or the industry and makes recommendations to senior management.2. Assists in developing methodologies, assumptions, quantifications, and computer programs to capture data for complex analyses. May include designing and writing programs using a variety of programming languages and software tools.3. Provides quantitative support in financial analysis, management reporting, and other financial and statistical research.4. Assists in producing highly technical reports and spreadsheets, and communicates with other analytical staff and management, including presentations to senior management.5. Facilitates communication and provides technical guidance, as needed, to business units and senior management regarding findings and recommendations.6. Work closely with other risk team members and may lead and/or participate in special projects.May perform additional duties as assigned.Reporting RelationshipDirector or aboveSkills, Knowledge & Abilities1. Strong knowledge of core functions of an insurance company and general insurance.2. Relevant technical knowledge of financial, economical and statistical practices, procedures and principles, which may include a specialty area.3. Strong interpersonal, communication and presentation skills. Ability to effectively interact with all levels of CNA’s internal and external business partners.4. Strong analytical, critical thinking and problem solving skills with the ability to effectively resolve complex situations and issues.5. Solid project management, organization and planning skills with the ability to manage multiple projects effectively and lead teams.6. Ability to exercise professional judgment and provide input on critical business decisions effectively within scope of authority based on data analyses and reviews.7. Ability to solve issues with a sense of urgency; utilizes and manages the available resources to assist on key decisions in the pursuit of achieving results.8. Ability to creatively and effectively solve complex and technical issues and make recommendations on course of actions.9. Ability to comprehend business data and metrics to further articulate analyses of data within internal reports.10. Solid knowledge of Microsoft Office Suite and other business-related software systems, including processing systems and applications, hardware and software tools, programming languages, computer modeling, and spreadsheet applications.Education & Experience1. Bachelor's Degree in a relevant discipline, or equivalent.2. Familiarity with Igloo or other commercially available capital modeling tools.3. Typically a minimum of three years of related work experience."}