{"jobID": "2689892916", "jobLocation": "Foster_City_CA", "jobTitle": "Driver - Atria at Foster Square", "companyRating": null, "companyInfo": {"Website": "www.atriaseniorliving.com", "Headquarters": "Louisville, KY", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " ResponsibilitiesResponsible for providing safe, courteous transportation service and serve as support staff for the Engage Life Director or Maintenance Director. Coordinates vehicle pre-maintenance, maintenance, and repair to ensure vehicle longevity. Drive vehicle from community to social and other various destinations according to assigned schedule.Assist residents into and out of vehicle in a safe manner.Secure passengers' wheelchairs to restraining devices to stabilize wheelchairs during trip.Practice safe driving techniques at all times.Clean and service vehicle with fuel, lubricants, and accessories and report and coordinate vehicle maintenance repairs.Establish and monitor daily and weekly trip inspection and preventative maintenance programs, as well as maintain records regarding the maintenance of all vehicles.Deliver groceries and other belongings to resident’s apartments.Assist the Engage Life Department in activities and programs as needed.Ensure charges are submitted to the business office daily for community travel expenses.Maintain a safe driving record according to Company guidelines.Handle emergency situations and basic First Aid.Report potentially unsafe conditions to the Executive Director.May perform other duties as needed and/or assigned.QualificationsHigh school diploma or general education degree (GED); or one (1) to three (3) months of related experience and/or training; or equivalent combination of education and experience.Five (5) or more years of driving experience and knowledge of vehicle preventative maintenance programs.Commercial driver's license required to operate commercial size vehicles.Able to operate a seven (7) to sixteen (16) passenger bus, unless otherwise required by Atria or state law. Able to operate a limousine or car, tire changing equipment, First Aid Kit, wheelchair lift, and dollies/hand trucks.Experienced with vehicle emergency repairs, able to change automobile tires and handle minor on-road maintenance.Knowledgeable of all streets within an 8-mile radius of the community.Position requires driving responsibilities (may use Company provided vehicle and/or personal vehicle).Must satisfactorily meet and be in compliance with Atria’s Motor Vehicle Record Policy standards. Driver, Transportation, Chauffeur, Motorist, Vehicle Operator, Automobilist, Drivers, BusOverviewAtria Senior Living is a leading operator of independent living, assisted living, supportive living, and memory care communities in 190 locations in 27 states and seven Canadian provinces. We are the residence of choice for more than 21,000 seniors, and the workplace of choice for more than 14,600 employees. We create vibrant communities where older adults can thrive and participate, know that their contributions are valued, and enjoy access to opportunities and support that help them continue making a difference in our world.  Atria is an equal opportunity employer. Atria provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, age, national origin, disability, veteran status, or any other classification protected by applicable law. Atria also does not condone or tolerate an atmosphere of intimidation or harassment based on these protected classifications. We require the cooperation of all employees in maintaining a discrimination-free and harassment-free work environment."}