{"jobID": "2823987921", "jobLocation": "San_Diego_CA", "jobTitle": "Bioinformatics Scientist Algorithm and Data Science", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "116000", "jobDescription": " Our group is focused on tackling some of the most challenging problems in cancer genomics spanning diverse research and clinical applications. If you are an expert in one or more of the following areas, we would like to hear from you.  Responsibilities  Algorithm development – develop algorithms for analysis of vast amount of studies across various data types and platforms for translational research and clinical applications.  Data analysis – apply best practice statistical/computational methods to analyze large-scale biological data, such as gene expression, copy-number, mutation, methylation, next-generation sequencing, etc. in a fast-paced product development environment.  Pipeline development – design and develop pipelines to address novel analytical challenges and to automate established analysis so that thousands of studies can be analyzed in a robust manner  Required Skills and Experience  PhD in Bioinformatics, Computational Biology, Biostatistics, Computer Science  Expert knowledge on current bioinformatics/genomics/proteomics resources available at NCBI, Ensembl, UCSC, Broad Institute, etc.  Deep knowledge in cancer biology, immuno-oncology and NGS assay development  Expert in Python, R, high performance computing, and/or C/C++/C#  Strong experience in statistics, data analysis and pipeline development  Ability to contribute independently and collaboratively, and to excel in a fast-paced environment  Superior written and verbal communication skills  Desired Skills and Experience  Background in oncology or clinical experience  Strong background in machine learnin"}