{"jobID": "2591298165", "jobLocation": "Orange_CA", "jobTitle": "Care Coordinator", "companyRating": null, "companyInfo": {"Website": "www.newportacademy.com", "Headquarters": "Newport Beach, CA", "Size": "1 to 50 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Summary: Newport Academy, the premier adolescent treatment program, is seeking full and part-time Care Coordinators. This is an EXCELLENT OPPORTUNITY TO BE PART OF A GREAT TEAM, MAKE AN IMPACT IN THE LIFE OF OUR TEENS.  Under the supervision of the Residential Coordinators, the Care Coordinators provide, ssupervision, protection and care of our adolescent clients (individually and in groups) at all times; Assistance to each client in working with a group and in handling individual problems; Administration of discipline and setting of limits for behavior; and Notation of the client’s progress, identification of the possible need for professional services, and communication of such findings to professional staff. Essential Duties and Responsibilities include the following. Other duties may be assigned. Facilitate residents' daily activities in residential setting including assistance with daily activities, chores supervision, assistance with meal service, laundry, etc.Transport residents to and from necessary appointments and outside 12-Step meetingsObserve and monitor residents' behavior and intervenes based on schedule, individual treatment plans and house needsFacilitates assigned groups and/or meetings and/or activities per Newport Academy programDocuments observations and interventions in resident records (minimum of one entry per shift)Coordinates milieu treatment with Counseling staff (via client record, staff communication, counseling/residential interface meeting)Documentation in Newport Academy shift log including check in and check out as well as a summary of the events during the Care Managers shiftProvides transportation to and supervision while at Young Person 12-Step Meeting in communityTransports clients to outside professional appointments, court hearings, etc.Ensures transportation safety by conducting van inspections following use of Newport Academy van and following documented safety rulesEnsures that resident telephones are available during designated hoursSupervision of self-administration of resident medications per physician orders andmaintain training in medication dispensement per State of California Community Care LicensingEnsures physical plant safety and security by conducting regular shift checks, fire drills, and disaster drills per Policy and Procedures of Newport Academy and State of CaliforniaOrientation of all new residents to policies of Newport AcademyConducts introduction/check-in to Newport Academy with new residents including search of all items prior to admittance and lock up of contraband and medicationsOne-to-one supervision of residents at risk for AMA, suicidal risk, eating disorders, etc.) per directive of the Clinical DirectorFollows all emergency procedures including paging protocol, following directives given exactly, transportation protocol, etc.Working actively with residents who may be at risk for AMA including one-to-one counseling, notification of assigned Counselor and immediate notification to the Clinical Director or Executive Director when residents vocalizes ideations about leaving the residential programSupports aftercare component by facilitating aftercare groups as assigned by the Clinical DirectorConduct Urinary Analysis screening and collection when directed by the Clinical Director, following appropriate proceduresSearch of resident’s rooms when there is suspicion of illegal drugs or contrabandInteraction (counseling) between the employee and the child and/or others aimed at preparing the adolescent to analyze and better understand their placement. Helping the client understand the reason for placement and to handle associated emotional problems.Resolving the difficulties between client and family that led to the need for placement, and planning for the return of the client.Intake studies as specified in Title 22 Group Home Regulations, Section 84068.1.Intake Assessments and Intake Studies. Obtain, develop, and record information necessary to the completion of an Intake Study.Needs and Services Plan — development, review, and evaluation, updating and modification of the plan.Discharge planning and Discharge Plans — development and maintenance of a written removal or discharge plan.Complete standard appraisals of the children in a format approved by Licensing.Behavioral observation in milieu.Active participation in intervening with staff in milieu to troubleshoot and improve proper use of behavioral intervention techniques specified in the behavioral intervention plans.Attendance at meetings per prior arrangement, and participation as an interdisciplinary team member.Documentation of services as required by applicable law and regulation, and other duties as assigned to facilitate program success and the ability of residents to benefit from programming.To perform the job successfully, an individual should demonstrate the following competencies:Dependability: Commits to doing the best job possible; Follows instructions, responds to management direction; Keeps commitments; Meets attendance and punctuality guidelines; Responds to requests for service and assistance; Takes responsibility for own actions. Planning & Organization:Integrates changes smoothly; Plans for additional resources; Prioritizes and plans work activities; Sets goals and objectives; Uses time efficiently; Works in an organized manner. Customer Service: Displays courtesy and sensitivity; Manages difficult or emotional customer situations; Meets commitments; Responds promptly to customer needs; Solicits customer feedback to improve service. Communication: Exhibits good listening and comprehension; Expresses ideas and thoughts in written form; Expresses ideas and thoughts verbally; Keeps others adequately informed; Selects and uses appropriate communication methods; Writes clearly and informatively. Engage in appropriate written and verbal communication with families, referral sources and other professionals. Ethics: Treats people with respect; Keeps commitments; Inspires the trust of others; Works with integrity and ethically; Upholds organizational values. Problem Solving: Develops alternative solutions; Gathers and analyzes information skillfully; Identifies problems in a timely manner; Resolves problems in early stages; Works well in group problem solving situations. Team Work: Balances team and individual responsibilities; Contributes to building a positive team spirit; Exhibits objectivity and openness to others' views; Gives and welcomes feedback; Puts success of team above own interests. Qualifications:To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Education/Experience required: H.S. Degree, Bachelors Level degree preferred, PSYCHOLOGY AND HUMAN SERVICES MAJORS PREFFERRED Language Ability:Ability to read and interpret documents such as safety rules, operating and maintenance instructions, and procedure manuals.Ability to write routine reports and correspondence.Ability to speak effectively before groups of customers or employees of organization.Reasoning Ability:Ability to define problems, collect data, establish facts, and draw valid conclusions and define measurable outcomes.Computer Skills: Proficient in Microsoft office, basic computer skills. Certifications orLicenses:Must have a valid driver’s license and eligibility for insurance with agency’s vehicle.Must have a valid First-Aid, CPR, Pro-Act training, fingerprint clearance and child abuse clearance as defined by CCL.Physical Demands: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Must be able to lift up to 25 pounds"}