{"jobID": "2764830875", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - Ads", "companyRating": "3.5", "companyInfo": {"Website": "discover.king.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": " Providing accurate data, insights and analysis for decision makers and stakeholders  Designing, implementing, and analysing multivariate tests using relevant statistical methods  Looking at ads from a network perspective, helping to drive a consistent approach within games teams and getting new teams up to speed  Presenting and visualising results in a clear and concise way to senior management for decision making  Analysing ads as a part of a larger ecosystem  Skills to create thrills  Capacity to deeply understand the problems the business wants to solve and define the right data-driven approach. Understanding of A/B tests a plus.  Working with the product team to identify opportunities to optimize the ad experience and its effect on players  Be a subject matter expert and analysis lead for ads products, helping game teams improve their analysis and use of ads as a revenue source  Identify and disseminate best practices across Business Performance groups in terms of ads-related tools, systems and processes  Identify new levers to move key business metrics  Working alongside other highly skilled Data Scientists and Business Analysts, youll be strategic in outlook and highly analytical in delivery with responsibility for using data to ensure we make the right business decisions  Ad-hoc analysis - assist and resolve requests from the business (i.e. analyzing A/B tests, strange player behaviour, etc.)  Create reports and dashboards that allow the advertising team to understand and optimize our advertising initiative using tools such as Python, R and Looker  Bonus points  Ability to analyze huge volumes of data from our advertising activities, by writing complex SQL queries and using tools such as Hive, Impala and Hadoop  Ability to learn quickly and work in a fast paced, rapidly changing and collaborative environment, while communicating effectively with teams and individuals across King.  The ability to write complex SQL queries and work effectively with both Hive/Impala  Ability to identify the appropriate statistical techniques to use in different circumstances  Able to develop good ways of communicating, visualising or reporting your results/analysis so they are clear and unambiguous. This will include building reports and presenting the results of your analysis using tools such as Looker, Qlik Sense and others  An interest in and understanding of coding a plus  BA/BS in Computer Science, Math, Physics, Engineering, Statistics or other technical field"}