{"jobID": "2799294261", "jobLocation": "Los_Angeles_CA", "jobTitle": "Computer Scientist - Embedded Systems", "companyRating": "4.3", "companyInfo": {"Website": "www.usc.edu", "Headquarters": "Los Angeles, CA", "Size": "10000+ employees", "Founded": " 1880", "Type": " College / University", "Industry": " Education", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "137000", "jobDescription": "Information Sciences Institute (ISI), a unit of USC’s Viterbi School of Engineering, is a world leader in the research and development of advanced information processing, computing, and communications technologies. ISI is home to nearly 250 researchers in a variety of fields, including computational systems and technology, intelligent systems, and networking, who carry out world-class research in a collaborative, academic environment. ISI scientists have the opportunity to spend the majority of their time doing the research they love. Projects are critically accelerated by research programmers and Ph.D. and M.S. students. ISI operates one of the world’s largest academic high-performance computing clusters. ISI has three research campuses: one in Marina Del Rey, CA; one in Arlington, VA; and one in Waltham, MA. *This position is located in Arlington, VA.* Information Sciences Institute (ISI) seeks a highly talented and motivated researcher with demonstrated expertise in embedded systems to join a team developing the system software for the next generation of high performance space processors. Required Qualifications & ExperiencePhD in Computer Science, Computer Engineering, or a related field.Strong background in one (preferably multiple) of the following areas: real-time systems, control theory, and heartbeat messaging.Demonstrates research excellence with publications in top-tier conferences and journals and contributes research ideas as part of ongoing and future programs.Comfortable interfacing with sponsors and speaking in front of technical audiencesHighly self-motivated, able to set goals, coordinate with teammates, and work semi-autonomously. The University of Southern California values diversity and is committed to equal opportunity in employment.Minimum Education: Master's degree, Combined experience/education as substitute for minimum education  Minimum Experience: 3 years  Minimum Field of Expertise: Knowledge of research processes and computer science."}