{"jobID": "2815785075", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Engineer", "companyRating": "3.1", "companyInfo": {"Website": "www.genomichealth.com", "Headquarters": "Redwood City, CA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Public (GHDX) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "145000", "jobDescription": "Genomic Health is seeking a highly talented and motivated Data Programmer / Analyst. The Data Engineer will be directly responsible for ensuring the accurate, complete and timely collection, delivery and tracking of data from Research, Commercial and Manufacturing laboratories for analysis, reporting and presentation.  In addition this position will be responsible for supporting Bioinformatics (primarily RNAseq) activities in R&D; as needed. The ideal candidate will have experience with aspects of data engineering, computer programming, and bioinformatics.  The position will report to the Associate Director within the Biomedical Data Computing organization. RESPONSIBILITIES / DUTIES:Perform accurate, complete and timely collection, validation and tracking of research, commercial and manufacturing data.Construct datasets and visualizations for reportingMaintain accurate documentation of programs and proceduresDevelop programs for collection, extraction, analysis, presentation or tracking of dataPerform RNAseq analysis of NGS data as requiredOther responsibilities as assigned.QUALIFICATIONS:REQUIREDBachelor’s degree in life sciences, computer science, scientific or other relevant disciplinesMinimum 2 years experienceExperience with SQLExperience with statistical programming (R, S, SAS or MatLab)Familiar with Bioinformatics analysis of NGS data (RNAseq)Strong communicator with the ability to maintain open communication with internal employees, managers, and customers as neededAble to integrate and apply feedback in a professional mannerAble to prioritize and drive to results with a high emphasis on qualityAbility to work as part of a teamDESIREDExperience with scripting languages (Python, Perl, Ruby)Experience with cloud computing (AWS, Azure)Familiarity with molecular biologyExperience working with LIMS"}