{"jobID": "2712139956", "jobLocation": "Reston_VA", "jobTitle": "Data Scientist", "companyRating": "3.4", "companyInfo": {"Website": "www.caci.com", "Headquarters": "Arlington, VA", "Size": "10000+ employees", "Founded": " 1962", "Type": " Company - Public (CACI) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " CSC, ManTech, SAIC"}, "estimatedSalary": "135000", "jobDescription": "Job DescriptionWhat Youll Get to Do: As a Data Scientist, you will develop and operationalize innovative Big Data software solutions in direct support of an unconventional warfare client. More About the Role: You will perform as a data scientist, helping the team on a distributed, scalable Big Data store, including Apache Accumulo, Apache Hadoop, MapReduce programming and technologies, and real-time data processing with Apache Spark.  You will participate in the development of machine learning, data mining, and statistical or graph-based algorithms designed to fuse and analyze massive data sets. Your expertise will ensure the proper implementation and usage of employed algorithms and bring in cutting-edge innovations from industry and academia.  You will also leverage knowledge of requirements analysis, installation, integration, evaluation, enhancement, maintenance, testing, and diagnosis or resolution. Additionally, you will conduct software development, software integration, statistical analysis, modeling, and simulation all in a rapid DevOps environment.  Responsibilities will also include actions to sync across functional teams, ensuring data science is supporting mission-focused analytic teams and work with rapid prototyping teams on site to deploy new data science capabilities through existing toolsets. Youll Bring These Qualifications:Current Top Secret/Specialized Compartmented Information Security Clearance, willingness to submit to a CI Poly.Possess the ability to effectively communicate both orally and in writing.More than three years of experience with high-level languages, including Java.More than two years of experience with distributed scalable Big Data storage, including Accumulo, Cloudbase, HBase, or Bigtable.Experience in MapReduce programming with Apache Hadoop, the Hadoop Distributed File System (HDFS), and processing large data storesExperience with using Agile software development methods in a DevOps environment.Experience with a real-time, large-scale data processing engine, including Apache Spark.Experience with developing solutions and integrating and extending free and Open-source software (FOSS) or COTS products.DoD 8570 Compliant Security+ or CISSP Certification prior to starting on contract.Willing to work rotating shifts if needed.Bachelors degree and three years of experience, or associates degree and seven years of experience, or nine years of relevant work experience.These Qualifications Would be Nice to Have:Experience in working with various intelligence disciplines, including GEOINT, HUMINT, MASINT, OSINT, and SIGINT and a comprehension of the data and tools associated with these disciplines.Experience with intelligence or operations analysis in the DoD or intelligence community.Experience with deploying applications in a Cloud environment.Experience with designing and developing automated analytic software, techniques, and algorithms.Experience with open source software, including GeoWave and MapReduce Geo (MrGEO).Ability to work independently with some government oversight and function effectively as part of a team in a joint working environment.What We Can Offer You:CACI-WGI (The Wexford Group International) is a wholly-owned subsidiary of CACI with a reputation for uncompromising standards of quality in its people and its performance. Joining the CACI-WGI team is a mark of excellence for those employees who complete our rigorous Recruiting, Assessment, and Selection (RAS) process.CACI-WGIs mission places its personnel against the governments most critical emerging challenges. Work with us and youll be working with a team making a difference across the globe.CACI-WGI offers competitive benefits as well as numerous learning and development opportunities.Job Location US-Reston-VA-VIRGINIA SUBURBAN  CACI employs a diverse range of talent to create an environment that fuels innovation and fosters continuous improvement and success. At CACI, you will have the opportunity to make an immediate impact by providing information solutions and services in support of national security missions and government transformation for Intelligence, Defense, and Federal Civilian customers. CACI is proud to provide dynamic careers for employees worldwide. CACI is an Equal Opportunity Employer - Females/Minorities/Protected Veterans/Individuals with Disabilities."}