{"jobID": "2819306248", "jobLocation": "Cranbury_NJ", "jobTitle": "Scientist III/IV Bioassay Development", "companyRating": null, "companyInfo": {"Website": "www.oncobiologics.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About the OrganizationMission Statement: Oncobiologics is a publicly traded biopharmaceutical company focused on the advancement of its pipeline of biosimilar products, two of which are currently in clinical development. Led by a team of biopharmaceutical experts, Oncobiologics operates from a state-of-the-art 40,000 sq. ft. fully-integrated R&D; and manufacturing facility in Cranbury, NJ. The company employs its BioSymphony development model to ensure that biosimilar assets meet the stringent requirements of U.S. and European regulators, while also achieving accelerated development and technical excellence in creating affordable medicines for global patients who so urgently need them.  Oncobiologics provides a scientifically disciplined and speed-to-market approach to biosimilar development. By leveraging its scientific talent and technical infrastructure, the company has established a unique CMC engine designed to provide scientific rigor, speed and cost efficiencies. Through these capabilities, Oncobiologics is uniquely positioned to deliver a robust CMC package as required by the FDA, EMA and other regulatory bodies. The company is executing a commercial strategy to advance its biosimilar assets to global markets.  Oncobiologics actively fosters a collaborative, entrepreneurial culture. With years of experience in large organizations, the Oncobiologics team understands the critical importance of agile, rapid decision-making and strives to infuse all activities with urgency, creativity and disciplined thinking. Key Facts: Founded January, 2011  Employees: ~64  Focused on the development of 'large molecules' (i.e., biologics) Description Opportunity and Summary of Position: Oncobiologics has an immediate opening for Scientist III/IV in Bioassay Development. The group supports the release and stability testing of monoclonal antibody therapeutics. The main mission of the group is the development and qualification/validation of bioassays to support the drug development. As part of this overall goal, the candidate would be required to perform routine and non-routine testing, assist in the method development and qualification/validation of the bioassays, and creation and execution of experimental plan which assess the functional characteristics of biological drug candidates. This includes routine and non-routine testing, generating, documenting, and analyzing data for discussions and technical reports. Reporting Relationships: This position will report to Senior Scientist/Principal Scientist - Bioassay Development. Position Responsibilities: ? Perform routine and non-routine potency assays, functional assays, and effector function assays such as ADCC and CDC to support the process development of monoclonal antibody therapeutics.  ? Develop, qualify/validate, and transfer bioassays.  ? Establish proper cell culture techniques, prepare reagents, and maintain appropriate cell lines for each project.  ? Train junior scientists and maintain/troubleshoot laboratory instruments.  ? Keep real-time experiment records in ELN and prepare SOPs and reports.  ? Contribute to departmental activities such as safety inspections and internal audits.  ? Provide technical supports to QC for OOS/OOT investigation.  Position Requirements Candidate Qualifications: The company is seeking an individual with the following qualifications and who is willing to make a long-term commitment to the organization:  ? Education/Certification  MS/BS in Biology/Cell Biology/Biochemistry or related field (MS preferred)  ? Qualifications and Skills  ? Minimum 2 years (MS) or 5 years (BS) of progressive industry experience in the Bioassay laboratories in biotechnology or biopharmaceutical industry.  ? Hands-on experience in cell based assays, ELISA binding assays, and SPR based assays (Biacore, Octet).  ? A thorough understanding of cell culture technique is required.  ? Basic understanding of statistical data analysis and familiarity with Softmax and Parallel-Line Analysis (PLA) software is desirable.  ? An ability to effectively and collaboratively participate in team discussions (e.g., communication of test results, OOT results, scientific principles).  ? An ability to prepare clearly written documents (e.g., SOPs, technical reports, method qualification/validation reports).  ? Excellent verbal and written communication skills.  ? An ability to work independently with little supervision and be flexible with changing project timeline to support the process development.  ? Experience in the analysis of monoclonal antibody or the late stage biologics support is desirable.  ? Familiarity with CMC and GMP is desirable.  ? Compensation  An attractive compensation package will be offered to the successful candidate. It will include a competitive base salary and incentive bonus. A benefits package customary to the position will also be provided including 401k match, medical and dental.  LocationOncobiologics EOE StatementWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law."}