{"jobID": "2834344788", "jobLocation": "Torrance_CA", "jobTitle": "Market Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Number: 2121726 Market Data AnalystTorrance, CACompensation: $45-52K SUMMARY Do you have experience in the consumer-packaged goods industry? Are you highly analytical, an effective communicator, and have advanced Excel skills?  Our client, a global leader in consumer products, is pursuing a Market Data Analyst to help support collaboration with retailers through a focus on analyzing data and financials such as market share, competition, pricing, forecasting and research. The ideal candidate will have 5 years of analytical experience in a related field. Market Data Analyst Responsibilities:Perform analysis of market share data to identify trends and opportunitiesPerform financial reviews of SKU performances such as trends and profitability with insight on how to maximize performanceCompile and analyze monthly and weekly sell-through data communicating trends and opportunitiesDevelop retailer, competitor and pricing matrixes for both US and CanadaProvide forecasting for product launches - early roadmap, pre-production planning, ongoing forecastingCollaborate with internal teams to execute or support quantitative or qualitative researchMarket Data Analyst Requirements:5+ years of experience in an analytical role (consumer packaged goods preferred)Advanced Excel skillsStrong commercial acumenStrong communication skillsLocal Trade experience preferredMarket Data AnalystTorrance, CACompensation: $45-52K  About Nelson:  For more than 45 years, we've been passionate about helping people find jobs they love - rewarding jobs that further career goals. At Nelson, we partner with companies that have outstanding reputations. Working with innovative startups to Fortune 500 companies, our skilled recruiters have access to opportunities beyond what you can find on your own.  With Nelson, you'll get the most out of your career. Together, we'll set career goals and find you a position where your skills shine. Whether you are looking for a position in: accounting & finance, administration, computer gaming, digital media, engineering, human resources, legal, light industrial, manufacturing, or technology, Nelson helps place people in full-time, temporary, temp-to-hire, project, and contract positions. For a full listing of jobs, go to: www.nelsonjobs.com and click \"Find Work.\""}