{"jobID": "2766785391", "jobLocation": "Arlington_VA", "jobTitle": "Big Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "75000", "jobDescription": "Job Number: R0028224 Big Data AnalystKey Role:  Design, evaluate, and implement database applications to accommodate a variety of user needs. Analyze and determine the informational needs and elements, data relationships and attributes, proposed manipulation, data flow and storage requirements, and data output and reporting capabilities of the user department. Define logical attributes and interrelationships and design data structures to accommodate database production, storage, maintenance, and accessibility. Test designed applications using database management software or general programming software. Install, implement, and support systems within the user base. Perform system-level database maintenance. Propose detailed specifications and flow charts and coordinate the installation of new or revised systems.  Basic Qualifications:  -5+ years of experience with delivering IT solutions in a team environment  -Experience with software development throughout the software development life cycle (SDLC)  -Experience with working on Scrum or other Agile development-based methodologies  -Knowledge of how data analytics and data visualization support analytics design  -Knowledge of software development support tools, including JIRA  -Ability to obtain a security clearance required  -BA or BS degree  Additional Qualifications:  -Experience with data visualization tools, including Tableau  -Possession of excellent oral and written communication skills  -IT Certifications  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}