{"jobID": "2820726916", "jobLocation": "Chicago_IL", "jobTitle": "Business Analytics Manager", "companyRating": "3.4", "companyInfo": {"Website": "www.pnc.com", "Headquarters": "Pittsburgh, PA", "Size": "10000+ employees", "Founded": " 1845", "Type": " Company - Public (PNC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " J.P. Morgan, Bank of America"}, "estimatedSalary": "106000", "jobDescription": "Position Overview At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. As the manager of the visualization and development team within PNC's C&IB; Data Analytics and Solutions organization, you will be responsible for defining /managing the data consumption models via web application development and leading the report management and information distribution strategy. The successful candidate will meet the following qualifications: Solid Understanding of UX principles and demonstrated experience with delivered solutionsExceptions attention-to-detail and previous experience with visualization development (e.g. Tableau, Gephi, Zoomdata)Experience using web application frameworks (e.g. Angular, React, Ember)Good understanding of SDLC and application development best practicesKnowledge of JavaScript technologies (e.g. Node, D3) as well as databases (relational, NoSQL)Previous technical leadership preferredWorking knowledge of Agile methodologyJob ProfileManages the development, implementation and support of business analytics initiatives and projects.Identifying, sizing and prioritizing business opportunities for improvement through analytics.Assessing the scope and resources required of various analytics projects and working with manager to define necessary resources.Managing client relations to ensure that expectations for dashboards are managed, and fulfilled.Monitoring and communicating key performance metrics and operational challenges.Leadership CompetenciesBuilds Winning Teams - Extensive ExperienceDevelops talent by creating engaged, inclusive and diverse teams who are empowered to speak freely and act with integrity.Leads Effective Change - Extensive ExperienceRecognizes the need for, takes personal accountability to adapt, and leads others through organizational change.Drives for Results - Extensive ExperienceDemonstrates energy and a desire to succeed; follows through on commitments; pushes self and others to deliver exceptional results.Establishes Vision and Purpose - Working ExperienceCreates a compelling vision of the future and translates it into action, linking others' contributions to the success of PNC.Core CompetenciesManages Risk - Extensive ExperienceAssesses and effectively manages all of the risks associated with their business objectives and activities to ensure activities are in alignment with the bank's and unit's risk appetite and risk management framework.Customer Focus - Extensive ExperienceKnowledge of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions, and ability to leverage that information in creating customized customer solutions.Job Specific CompetenciesBusiness Analytics - Extensive ExperienceKnowledge of technologies, techniques and practices for the evaluation of business performance data; ability to analyze business performance using advanced statistical methods to justify and drive future business planning decisions.Organizational Savvy and Politics - Extensive ExperienceKnowledge of organizational politics and political tactics; ability to effectively navigate formal and informal communication and decision-making channels.Effective Communications - Extensive ExperienceUnderstanding of effective communication concepts, tools and techniques; ability to effectively transmit, receive, and accurately interpret ideas, information, and needs through the application of appropriate communication behaviors.Decision Making and Critical Thinking - Subject Matter ExpertiseUnderstanding of the issues related to the decision-making process; ability to analyze situations fully and accurately, and reach productive decisions.Analytical Thinking - Extensive ExperienceKnowledge of techniques and tools that promote effective analysis and the ability to determine the root cause of organizational problems and create alternative solutions that resolve the problems in the best interest of the business.Emerging Technologies - Working ExperienceKnowledge of and ability to design, apply and evaluate new information technologies for business environments in order to improve work productivity and accuracy.Preferences/Skills Software Engineer  Big Data  Python R Tableau  Gephi  Zoomdata Required Education and Experience Roles at this level typically require a university / college degree, with 5+ years of industry-relevant experience. At least 3 years of prior management experience is typically required. In lieu of a degree, a comparable combination of education and experience (including military service) may be considered. EEO Statement PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law"}