{"jobID": "2809430601", "jobLocation": "Detroit_MI", "jobTitle": "Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.dataspace.com", "Headquarters": "Ann Arbor, MI", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "77000", "jobDescription": "Our client, one of the world’s most recognizable names in the health insurance field, has asked us to provide them with a few super-strong experts to build out their data science team and execute critical predictive analytics initiatives.Is this you? If so, please submit your resume and fill out our questionnaire ASAP!THE WORK: The chosen consultant will work on a highly skilled team with some of the latest data science technologies to establish analytic approaches and build a wide variety of analytic models. LOCATION: This client is located in Detroit, Michigan - a diverse city experiencing a new renaissance of technology, food, arts, and culture. Building on its storied history as the “Motor City”, Detroit is now reinventing itself as a home for a vibrant community of well-funded startups and plethora of tech Meetups.  With its constant offering of music and theatre performances, several of the nation’s best known museums, a trio of new sports arenas, and distinct neighborhoods of every flavor, Detroit truly has something for everyone! MODE: Permanent. REQUIRED: Applicants must be very strong in the following skills: Data science including the use of R, Python, or similar technologiesMachine learning (natural language processing would be a huge plus)Verbal communicationDESIRED: In addition, it would be great if you had some background in: Big data technologiesExperience with healthcare payersData visualizationCOMPENSATION: This company is offering a competitive compensation plan including a salary ranging from $130,000 to $150,000 per year plus bonuses and extremely strong benefits. INTERESTED? If you're interested and have the skills, we'd love to hear from you. Please answer our questionnaire and submit your resume right away! Thanks!  NOTE: Dataspace performs background and drug screens on accepted candidates prior to their employment or contract start dates.- provided by Dice  Data Science, R, Python, Machine learning, data visualization"}