{"jobID": "2658717078", "jobLocation": "San_Diego_CA", "jobTitle": "Research Scientist/ Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.leidos.com", "Headquarters": "Reston, VA", "Size": "10000+ employees", "Founded": " 1969", "Type": " Company - Public (LDOS) ", "Industry": " Aerospace & Defense", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "88000", "jobDescription": "Description:Leidos's Military & Veterans Health Solutions Group is currently seeking a full-time Research Scientist / Data Analyst to support theHealth and Behavioral Sciences Program at the Naval Health Research Center in San Diego, CA.  This position will support the data science team in developing a research infrastructure that will facilitate and support collaborative military research efforts focusing on behavioral health and epidemiology research topics. The Research Scientist/ Data Analyst will work on a variety of research projects that use large, complex databases created by merging military personnel and medical records from multiple sources. The successful candidate will work closely and collaboratively with Principal Investigators, analysts and subject matter experts to identify ways to answer complex mental and physical health questions with population-level military medical and personnel electronic records. The ideal candidate will be detail-oriented, able to take initiative, and work well both independently and as a team.Qualifications:Required Qualifications Masters degree in statistics or relevant social science field (e.g., epidemiology, public health, psychology)  Advanced proficiency in BASE SAS, SPSS or other statistical software  Demonstrated ability to build statistical models, test hypotheses, visualize, summarize, interpret, and report results  Experience in constructing and analyzing complex databases Preferred Qualifications Demonstrated SAS user with 5 years of experience  Minimum 2 years of experience working with large, complex databases  Experience conducting research using medical records or medical reimbursement data.  Knowledge of data manipulation and data visualization techniques,  Due to federal contract restrictions, candidate must be a U.S. citizen and able to obtain a Secret Clearance.  NHWLeidos Overview: Leidos is a global science and technology solutions leader working to solve the worlds toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The companys 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported pro forma annual revenues of approximately $10 billion for the fiscal year ended January 1, 2016 after giving effect to the recently completed combination of Leidos with Lockheed Martin's Information Systems & Global Solutions business (IS&GS;). For more information, visit www.Leidos.com. The companys diverse employees support vital missions for government and commercial customers. Qualified women, minorities, individuals with disabilities and protected veterans are encouraged to apply. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an Equal Opportunity Employer."}