{"jobID": "2616230386", "jobLocation": "San_Mateo_CA", "jobTitle": "RISC-V Software Intern", "companyRating": null, "companyInfo": {"Website": "www.sifive.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "At SiFive, you will be part of a fun, engaging team and get an opportunity to grow with the company. You will work side-by-side with the founders of RISC-V and bring to fruition the new RISC-V architecture and enable its rapid adoption by implementing new tools, breakthrough design methods and services. We need people who are trail-blazers, arent afraid to take a chance, and dont always go with the flow.The platform software team at SiFive is in charge of the RISC-V software ecosystem. This includes toolchains, runtimes, system libraries, debug tools, and distributions. SiFive provides a unique opportunity to work on software for a new ISA. As an platform software intern at SiFive you will be mentored by an developer experienced in open source software development, and will be expected to directly interact with the open source community.A list of possible projects is below, but if you're interested in something else then feel free to bring it up when you submit an application.Possible Project Areas binutils and GCC: auipc optimization pass, RVC branch target alignment, GP in shared librariesLLVM: Support for linker relaxation, integration with SiFive's software flow, optimization for SIFive processorsFreeRTOS: Integreation with SiFive's software flow, upstream maintenanceZephyr: Support for SiFive systems, integration with SiFive's software flowLinux: Upstreaming a driver, optimizing trap handlers, optimizing locks and atomics,buildroot: Cleaning up and submitting a port to upstream, integration with SiFive's software flowOpenEmbedded: Submitting RISC-V packages to upstream, integration with SiFive's software flowIf you are a student interested in systems software, SiFive is a great place to get some hands-on experience working on open source software!SiFive is proud to be an equal employment opportunity workplace. We offer a competitive compensation package that includes flexible paid time off, health, vision and dental benefits, 401(k) plan, employee stock option program, and much more. If you yearn to be challenged and wish to work in an environment where the boundaries of your creativity and skills will be tested, then SiFive is place for you!"}