{"jobID": "2815782908", "jobLocation": "Grand_Rapids_MI", "jobTitle": "CNC Programmer Operator - 3rd Shift", "companyRating": "2.6", "companyInfo": {"Website": "www.challenge-mfg.com", "Headquarters": "Grand Rapids, MI", "Size": "1001 to 5000 employees", "Founded": " 1981", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "44000", "jobDescription": "POSITION PURPOSE:The CNC Programmer Machinist is responsible for setup and build of tooling/die components to precise tolerances utilizing CNC technology by means of programming, setup, and operating a CNC machine. They will operate a CNC machine to produce parts, all of which must meet the dimensional specifications of the mechanical engineered drawing. Challenge Mfg. Company offers newer and well-kept CNC equipment in a climate controlled environment. Equipment includes Haas CNC Mills and Mitsubishi Wire EDM. RESPONSIBILITIES AND RESULTS:Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Operate computer numerically controlled machine (e.g., make, add, edit, N/C programs).Test run programs prior to actual cutting operation to ensure programming is correct, as required.Determine adjustment for cutting requirements to material being cut, as required.Maintain/check file system for availability of resources prior to operation of machine.Clean/deburr production parts (e.g., remove residue, burrs, sharp edges) prior to release from department, as required.Resolve problems and determine parts to be cut working through inter organization coordination (e.g., planning, engineering, production, tooling), as required.Accountable for producing quality parts and meeting efficiencies within the department.Uses precision measuring equipment to ensure part meets specifications. Inspects and measures parts, as required, to maintain quality records.Attention to detail; maintains accurate counts of parts; attaches labels or tags to finished part containers identifying customer, part number, quantity and shop order information.Utilizes the data collection system to accurately record production activities including time spent, quantity produced and any rejected parts.Communicates with co-workers and supervisor to receive instructions and coordinate job activities.Follows all safety procedures and wears safety equipment or apparel as required.Performs all job functions to meet acceptable quality and performance standards.Ensures daily that the work area is clean and orderly including machine, tooling and workstation.Perform all daily, weekly and monthly maintenance as required.Understands job description and required tasks.SKILLS AND KNOWLEDGE:Basic manual machining experienceBuild stamping tooling & press components for in-house Deep draw metal stamping presses. Utilizing a CNC machine & consistently achieving blue print specifications.Create NC programs utilizing MasterCam softwareDesign & build special fixturing to manufacture required toolingMaintain sufficient tools, cutters, and supplies to perform their operation.Assist in keeping tool room equipment and work area clean and organized. Lubricating machines daily and identifying equipment problems.Operating equipment in a safe manner and promote safety.Minimum of two years' experience programing and operating CNC wire EDM and/or CNC Mills.Experience operating manual tool room equipment including lathes, mills, grinders and drill presses.Ability to read and interpret blue prints.Excellent mechanical, organizational and interpersonal skills.BEHAVIORAL REQUIREMENTS:Has high standards of performance for self.Takes responsibility for actions, results, and mistakes.Is thorough, accurate, and reliable when performing and completing job tasks; demonstrates honesty and integrity in all aspects of work.Takes positive action to objectively resolve conflict by listening, staying focused on issue to find resolution, and monitoring progress.Maintains positive relationships by constructively resolving conflicts.Uses feedback from others to continuously improve performance and work relationships.Moves within own and/or other work areas (flexes) to support plant flow.Works with sense of urgency to meet needs of customers.Has necessary experience, skills, and knowledge to perform all aspects of job; rotates through all job responsibilities.Maintains knowledge and skills to perform job effectively.Has ability to focus on benefits of change and see it as positive; approaches change or newness in constructive/objective manner; views change as learning opportunity.Looks for good in others; works collaboratively with others; shares information and knowledge.Is at work when scheduled and ensures coverage when absent; takes timely breaks/lunches; uses time wisely.SUPERVISORY RESPONSIBLITY:This position has no supervisory responsibilities. WORK ENVIRONMENT / PHYSICAL DEMANDS:Lifting requirement of 40lbsThis is a high pace work environment that requires a sharp sense of your surroundings.Ability to be on your feet for long periods of time, and cover a lot of ground. In the summer months it does get very hot, and you must keep yourself hydrated.REQUIRED EDUCATION AND EXPERIENCE:Must have a minimum of two years' work experience as a CNC Programmer or Machinist / OperatorSome college or technical school preferredTool and Die experience or training strongly preferredOther Duties:Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled"}