{"jobID": "2708815943", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Analyst, UberEverything", "companyRating": "4.2", "companyInfo": {"Website": "www.uber.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 2009", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "About Uber We’re changing the way people think about transportation. Not that long ago we were just an app to request premium black cars in a few metropolitan areas. Now we’re a part of the logistical fabric of more than 600 cities around the world. Whether it’s a ride, a sandwich, or a package, we use technology to give people what they want, when they want it.  For the people who drive with Uber, our app represents a flexible new way to earn money. For cities, we help strengthen local economies, improve access to transportation, and make streets safer.  And that’s just what we’re doing today. We’re thinking about the future, too. With teams working on autonomous trucking and self-driving cars, we’re in for the long haul. We’re reimagining how people and things move from one place to the next. About the Role At Uber, providing world-class customer support for all of our products is a core feature of our experience. Delivering the caliber of customer support we expect isn’t easy—it takes leaders who can understand Uber’s operations, adapt to our constantly changing business, and help solve problems where no solution currently exists.  The Data Analyst, UberEverything is first and foremost a creative analytical explorer. You will leverage structured and unstructured data to evolve how our worldwide Product, Operations and Customer Support program leaders think about how to ensure our product experiences for UberEATS and other emerging business lines feel truly customer obsessed. You will be responsible for uncovering and assessing hypotheses our data isn’t yet primed to answer, be it the impact and efficacy of our support protocols, the predictive value of our KPIs, or the tactics we need to scalably improve customer experience. What You’ll DoDevelop a deep understanding of the impact product flows, operational defects and support interactions have on customer experience and loyaltyCreate data visualizations and automate reporting to ensure operational program leaders are informed of variations and opportunities across geographies and teamsAdvise and analyze controlled pilots to recraft processes, policies and service modelsAnalyze predictive power of operational and satisfaction metrics on customer loyalty (engagement, investment and advocacy) to hone the suite of KPIs we track and prioritizeAnalyze unstructured behavioral data to uncover events and activities most damaging to customer experience and scalabilityTransform the way your teammates around the world think about delivering exceptional customer experience through your creative data insightWhat You’ll NeedMinimum 2 years of work experience developing a premier understanding of databases, data relationships and data integrityBachelor’s degree in Math, Physics, CS, Statistics, Economics or another quantitative fieldExpertise with SQLSolid proficiency in R and/or PythonResearch mindset and an ability to produce actionable resultsAbility to structure a project from idea to experimentation to prototype to implementationA preference for quality over quantity; you get the math right and aspire to find the right solutionExcellent communication skills and attention to detailBonus Points ifExperience working with support data, contact management analytics or customer insights"}