{"jobID": "2830132065", "jobLocation": "Chicago_IL", "jobTitle": "Data Scientist - NexLP", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " NexLP is a VC-backed startup which focuses on machine learning and artificial intelligence to solve enterprise risk. NexLP stands for Next Generation Language Processing because we leverage NLP technology like no one else in the industry. Our product, Story Engine, is used by law firms and corporations to find the stories in their lawsuits, internal investigations and insider threats. Founded in 2013, NexLP is entering its next phase of growth and is seeking professionals to join our team.  As a Data Scientist you will utilize your machine learning expertise to help sort, analyze and deliver relevant information from unstructured data for Story Engine. We are looking for someone to be part of the Data Science and Machine Learning team and bring strong quantitative skills to our data science capabilities. You will work in a small team to develop data models using algorithms for pattern detection. As we are a startup, you should strive to continue developing and enhancing our software and be flexible to working within a growing company. Responsibilities:Build our core product, Story EngineUtilize strong programming skills in large-scale data analysisLeverage strong math skills and statistical knowledge to advanced data mining and data analysis activitiesCollaborate with other data science team members to review and provide feedback on the analytics work being done and seek feedback from other team members about your own workStay current with respect to machine learning/statistical/mathematical/informatics modeling methodologies to maintain proficiency in applying new and varied methods, and be competent in justifying methods selectedUnderstand patterns within large quantity of data and to reference key characteristics using visualization techniquesRequirementsPh.D. in Computer Science, Math, Statistics or Machine Learning3+ years' professional experience in machine learning and natural language processingProgramming experience in Java, C#, .NET and ability to work on projects with minimal engineering supportExperience with machine learning frameworksAbility to communicate complex quantitative results in a clear, precise and actionable mannerSelf-motivation and an ability to handle multiple competing priorities in a fast-paced environmentAbility to work both independently and collaboratively within a teamExperience in software development environment, Agile, and code management/versioningBenefitsMedical, dental and vision insuranceShort- and long-term disability insuranceLife insuranceFSA/HSA401kSDL2017"}