{"jobID": "2822325064", "jobLocation": "San_Francisco_CA", "jobTitle": "Lead Software Engineer, Data Services", "companyRating": "4.1", "companyInfo": {"Website": "www.unity3d.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Epic Games, Electronic Arts, Zynga"}, "estimatedSalary": "244000", "jobDescription": " Unity Technologies provides the most popular gaming and VR/AR platform in the world. Supporting 30 different platforms, in 2016 games built with Unity were downloaded 16 billion times on 2.6 billion devices by 700 million unique users. Unity enables the democratization of game development with tools that help developers create truly immersive digital experiences.  Data at a massive scale is at the heart of Unity. It is data that allows our developers to analyze and improve their games, and it is data that allows our developers to monetize all their hard work. Our Data Platform Team empowers other teams within Unity through data -- data about the games and the hundreds of millions of people who play them. Our team provides a highly scalable data collection and processing system, tracks relevant metadata and statistics, and provides hands-on assistance with data integration projects. We work closely with machine learning experts and data scientists to extract as much value as possible from our data. If you join our team, you will be working on some of the most interesting and challenging problems with a world class team that is dedicated to providing our customers with the data they need to succeed. About You You are passionate about non-trivial challenges and know what it takes to build a good answer from scratch. You love to implement research papers and optimize your code to squeeze a few more bits in or gain extra clock cycles. You value the delicate balance between leveraging open source technologies and inventing the missing pieces. You like to learn. ResponsibilitiesDesign, implement, test, and maintain Unitys Data Platform and associated services that are capable of handling real time and batch processing of tens of thousands of requests per second and billions of daily eventsWork closely with other teams within Unity to leverage our data and data infrastructureRequirementsBS in Computer Science or equivalent5+ years professional software engineering experience in C++, Go, or Rust with an emphasis on data-structures and high performance5+ years experience with common data technologies such as Spark, Kafka, Druid and distributed data-storesPractical experience focusing on (but not limited to) graph algorithms, lock-free programming, consensus protocols, etc.Deep, multi-faceted appreciation of how complex stream processing systems are designed and operatedExperience with Kubernetes, Terraform, Salt and major cloud platformsWho We Are // About Unity Unity is the creator of the worlds most widely-used real-time 3D (RT3D) development platform, providing content creators around the world with the tools they need to build rich, interactive 2D, 3D, VR and AR experiences. In fact, apps made with Unity reach 2.7 billion devices worldwide, and were installed more than 24 billion times in the last 12 months.  The global engineering team keeps Unity at the forefront of technology and working alongside partners like Magic Leap, Google, Facebook, Oculus and Microsoft ensures optimized support for the latest technology and platforms. Unity is powering the real-time revolution, expanding beyond games and breaking into other industries including automotive, film, architecture, engineering, construction and more. Unity is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. Therefore, we provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. If there are preparations we can make to help ensure you have a comfortable and positive interview experience, please let us know.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity."}