{"jobID": "2685280780", "jobLocation": "San_Francisco_CA", "jobTitle": "Spiritual Support Counselor, Cantonese Speaking", "companyRating": null, "companyInfo": {"Website": "www.hospicebythebay.org", "Headquarters": "Larkspur, CA", "Size": "201 to 500 employees", "Founded": " 1975", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Pathways Home Health and Hospice, Sutter Care at Home, VITAS Healthcare"}, "estimatedSalary": null, "jobDescription": "Hospice by the Bay is seeking an experienced Cantonese Speaking Spiritual Support Counselor to fill a per-diem position in our San Francisco/San Mateo area. The successful candidate will be responsible for providing spiritual services to patients and their families in accordance with the patient/family's desires and belief system and in compliance with organization policies and procedures and applicable laws and regulations. Essential Duties & Responsibilities include (but are not limited to): Provide spiritual/pastoral services when indicated and appropriate as soon as possible after admission.Complete a chaplain’s spiritual assessment for patients requesting spiritual services.Provide pastoral/spiritual counseling for patient/family in accordance with patient/family on-going wishes, needs, and applicable traditions including bereavement follow up with family as appropriate.Arrange for clergy/spiritual leaders from specific traditions to visit patient/family as needed and appropriate.Conduct religious/spiritual services of prayer, worship and rituals for patients/families as appropriate including providing funeral and memorial service planning and services.Education/Experience:Graduate of accredited seminary or school of theology or equivalent education in a related field. Masters of Divinity degree preferred.Minimum of two years’ experience providing spiritual services, preferably in a health care setting, or equivalent experience in a chaplaincy or in pastoral counseling.Certificates, Licenses, Registrations:"}