{"jobID": "2829512319", "jobLocation": "Austin_TX", "jobTitle": "Data Scientist (Big Data) IV (8 years)", "companyRating": null, "companyInfo": {"Website": "www.turnberrysolutions.com", "Headquarters": "Blue Bell, PA", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Embedded Software Engineer in Austin, TX 78730Interview Logistics: Phone Interview  F2F Interview Required Skills Set:Years of Experience: 8+ Education Required: Bachelors Degree or Equivalent Work Experience Bachelor’s Degree in Computer Science, Information Systems, or other related field. Or equivalent work experienceTypically has at least 8 years of IT work experience in business intelligence tools and systemsPossesses working knowledge of Relational Database Management Systems (RDBMS) and data warehouse front-end toolsMust have an extensive knowledge of data warehouse and data mart conceptsExperience in systems analysis, design and a solid understanding of development, quality assurance and integration methodologiesTypically has 8+ years of programming/systems analysis experienceAdditional Preferred Skills:Knowledge of the Android Radio Interface Layer (RIL) a plus.Knowledge of the ZigBee wireless protocol a plusProject Description: Responsible for the design, implementation, and testing of embedded software that will run in the security touchscreen. Will work closely with other embedded software developers and testers. Responsible for fixing any problems and defects found within the software. Documents clearly and thoroughly the design and decisions made. Is an expert in C and Java. Responsible for gathering and assessing business information needs and preparing system requirementsPerforms analyses, development and evaluation of data mining in a data warehouse environment which includes data design, database architecture, Meta data and repository creation.Uses data mining and data analysis tools. Reviews and validates data loaded into the data warehouse for accuracyInteracts with user community to produce reporting requirementsProvides technical consulting to users of the various data warehouses and advises users on conflicts and inappropriate data usageResponsible for prototyping solutions, preparing test scripts, and conducting tests and for data replication, extraction, loading, cleansing, and data modeling for data warehousesMaintains knowledge of software tools, languages, scripts, and shells that effectively support the data warehouse environment in different operating system environmentsMakes recommendations towards the development of new code or reuse of existing code.Responsibilities may also include participation in component and data architecture design, performance monitoring, product evaluation and buy versus build recommendationsPhysical Environment and Working Conditions: Must be able to work on site in Austin, TX"}