{"jobID": "2758282190", "jobLocation": "Troy_MI", "jobTitle": "Internal Communication Specialist", "companyRating": "3.4", "companyInfo": {"Website": "www.msgcu.org", "Headquarters": "Clinton Township, MI", "Size": "201 to 500 employees", "Founded": " 1954", "Type": " Nonprofit Organization", "Industry": " Finance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": "Michigan Schools & Government Credit Union (MSGCU) has been providing families with trustworthy financial products and dependable services for over sixty years. Through our rich history, and following our mission of being a caring organization dedicated to promoting financial success for our members, we have grown to be the 7th largest Credit Union in Michigan and the largest Credit Union in Macomb county. We have over 115,000 members who trust us to be their financial partner, and over $1.8 billion in assets. MSGCU is continuing to grow and has 14 branches across Macomb, Oakland and Wayne counties.If you have a passion for helping people and giving exceptional and dependable service, we want you on our team!The credit union’s success is dependent on not only what we do but how we do it. Therefore we have identified competencies that are critical for each team member to uphold in their role. You will find these competencies defined and outlined In the job description below.Overview of Responsibilities:Supports the organization’s internal communications strategy through a variety of communication channels including multimedia, online, and a team member portal. Develops and delivers a dynamic architecture of effective internal communications that promotes team member engagement and is in alignment with MSGCU’s strategic objectives and desired future state. Essential Duties and Responsibilities:Researches, develops, designs, and implements messaging through multiple channels of direct and indirect communications for all team members, potential team members, and other target audiences as appropriate, in the form of: written announcements, photography, podcasts, videos, training demos, presentations, user surveys, annual team member report, etc.Develops and maintains team member portal and in-house micro sites, effectively using concepts that include organization, web design, and are aligned with organizational philosophies. Serves as primary liaison with portal vendor to continuously explore ways to enhance and improve the end user experience.Researches and assesses technologies and innovations in digital communication to expand and enhance internal communications.Serves as the primary lead for internal communication needs/requests of Human Resources team members and stakeholders across the organization.Partners with Marketing team on internal communications for campaigns, marketing projects, and events.Establishes plans, measurement procedures, benchmarks, and success criteria for internal communications. Ensures communication execution is consistent and reflects the organization’s strategic vision, while managing multiple communications projects simultaneously.Maintains an internal communications calendar for the organization and proactively reaches out to stakeholders to keep communication timing on track.Develops and manages internal digital signage network content to help drive results, engagement, and deliver key messages. Partners with stakeholders to identify objectives, create templates, and ensure content is relevant and up to date at all times.Participates in organizational and departmental projects and initiatives to ensure effective internal communication by working closely with project leaders, managers, and executive team members to identify needs, review, and recommend enhancements regarding communication plans, stakeholders, timing, frequency, and message clarity.Facilitates team member training sessions covering communication skills and other topics such as the team member portal.Essential Knowledge, Skills, and Abilities:Member Focus: Builds strong member relationships (internal/external) and delivers effective internal communication solutions by exceeding expectations and providing superior quality service in a professional, efficient, and courteous manner.Action Oriented: Takes on new opportunities and tough challenges with a sense of urgency, high energy, and enthusiasm and consistently achieves results, even under tough circumstances. Possesses strong organizational and time management skills and the ability to manage and prioritize multiple tasks and responsibilities simultaneously in a fast-paced environment.Plans and Aligns: Plans and prioritizes work and is a conceptual thinker, with the ability to execute plans effectively to meet commitments aligned with organizational goals.Collaborates: Builds partnerships, works collaboratively, and influences others to meet shared objectives.Communicates Effectively: Must be approachable, articulate, persuasive, and possess excellent written communication skills, as well as strong editing skills to write on behalf of others, incorporating their style and tone. Demonstrates the ability to condense, organize, and convey complex information in a logical, visually pleasing, and user-friendly manner, in order to develop and deliver multi-mode communications that convey a clear message to meet the needs of different audiences.Instills Trust: Gains the confidence of others by modeling honesty, integrity, and authenticity. Models behaviors that align with organizational values. Makes responsible choices and exemplifies courage by stepping up to address difficult issues and saying what needs to be said. Maintains a trusting relationship with all team members.Demonstrates Self-Awareness: Uses a combination of feedback and reflection to gain productive insight into personal strengths and weaknesses. Applies feedback to personal development using both formal and informal development channels.Creative and demonstrates the ability to think outside of the box.Intermediate proficiency in Microsoft Office software products (Word, PowerPoint, Excel, Outlook, Publisher). Proficient with technology as an end-user, with a willingness to self-teach new technologies as needed.Essential Preparation and Experience:Bachelor’s degree in Communications, Human Resources, Business Administration, or another closely related field; and2 years of internal communications experience including corporate communications, writing and editing.2 years of digital content creation (written and designed) and video production experience preferred.Preferred technology experience includes: Adobe CS (Premiere Pro, Photoshop, Flash, Acrobat, and Captivate); web/portal software; HTML; and creation of visually effective graphics, multi-media, and digital signage (such as Four Winds Interactive).Working Conditions:Office and branch location environment with little discomfort from noise, extreme temperature, dust, or other factors.Required to travel throughout the MSGCU's service area as business needs require.Exposed to potentially hazardous conditions, such as robbery. Receives detailed instructions and security procedures on an annual basis to minimize risk.This work involves sitting most of the time with brief periods of walking or standing and may occasionally require lifting and/or moving up to 25 pounds."}