{"jobID": "2747634215", "jobLocation": "Chicago_IL", "jobTitle": "Python Software Engineer, Data Science", "companyRating": "3.3", "companyInfo": {"Website": "www.tempus.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "76000", "jobDescription": " Passionate about making a difference in the world of cancer genomics?  With the advent of genomic sequencing, we can finally understand our genetic makeup. We now have more data than ever before but providers don't have the infrastructure or expertise to make sense of said data. Here at Tempus, we are building the infrastructure to modernize cancer treatment. By analyzing a patients genetic data in the context of molecular therapies, We empower physicians to make real-time data-driven decisions in clinic based on the comprehensive computational analysis of a patients unique pathology. We're looking for engineers who are passionate about changing the status quo and bringing cancer care into the 21st century.  What You'll Do:  A little bit of everything. Youll be straddling the line between an Engineer and a Product Manager. Youll handle projects from start to finish, liaison with science and sales to figure out what needs to be built, and youll also be building some pieces of the puzzle that arent quite ready for to be built into a GUI-based tool.  Qualifications:  Must Have: Experience in Python (pandas preferred) and SQLOutstanding problem solving skillsExcellent communication skillsExperience in automating business operationsExperience in agile environments and comfort with quick iterationsIntellectual curiosity to pursue the unknown and to continuously learnThrives in a fast-paced environment and willing to shift priorities seamlesslyStrong desire to build products that will save lives and change the course of cancer Good to Have: Experience with data science and the major Python data science packages, such as numpy and pandasExperience as a Product or Project ManagerExperience with the structure and usage of REST API's About Tempus:  Tempus is a tech company that is building the worlds largest library of molecular and clinical data and an operating system to make that data accessible and useful. We enable physicians to deliver personalized cancer care for patients through our interactive analytical and machine learning platform. We provide genomic sequencing services and analyze molecular and therapeutic data to empower physicians to make real-time, data-driven decisions. Our goal is for each patient to benefit from the treatment of others who came before by providing physicians with tools that learn as we gather more data. For more information, visit tempus.com."}