{"jobID": "2812515402", "jobLocation": "Washington_DC", "jobTitle": "Account Executive", "companyRating": null, "companyInfo": {"Website": "www.ddn.com", "Headquarters": "Chatsworth, CA", "Size": "501 to 1000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " EMC, NetApp"}, "estimatedSalary": null, "jobDescription": " Overview.  Job Title: Account Executive - HPC & Life Sciences  Job ID: 2018 # Positions: 1 Overview: DataDirect Networks (DDN.com) is a world leader in massively scalable storage. We are the leading provider of data storage and processing solutions and professional services that enable content-rich and high-growth IT environments to achieve the highest levels of systems scalability, efficiency and simplicity. DDN enables enterprises to extract value and deliver results from their information. Our customers include the world's leading online content and social networking providers, high performance cloud and grid computing, life sciences, media production organizations and security & intelligence organizations.  Responsibilities:  We are currently seeking an Account Executive HPC & Life Sciences - ChinaJob DescriptionJob Title: Account Executive – DDN China  Job ID: 2018 # Positions: 1 Overview: DataDirect Networks (DDN.com) is a world leader in massively scalable storage. We are the leading provider of data storage and processing solutions and professional services that enable content-rich and high-growth IT environments to achieve the highest levels of systems scalability, efficiency and simplicity. DDN enables enterprises to extract value and deliver results from their information. Our customers include the world's leading online content and social networking providers, high performance cloud and grid computing, life sciences, media production organizations and security & intelligence organizations.  Responsibilities:  We are currently seeking an Account Executive – DDN ChinaJob Summary: The Account Executive will work in the development of new HPC & Research, AI, Financial, Video, Oil and Gas accounts in a given geographic territory. The Account Executive is required to be in front of the end user, even if not selling direct, to build the relationship and share the DDN story. This position will be field based and involve travel approximately 50% of the time. The job involves managing a territory and growing business through their own experience, including previously established relationships; so a successful applicant must have strong industry contacts and a demonstrated success in personally closing business in the HPC & Research, AI, Financial, Video, Oil and Gas space. Success involves a long and complex sales cycle and the majority of sales go through channel partners; so strong contacts with related channels are a requirement. Responsibilities for this role include but are not limited to; Drive new business through strong partner and customer contacts and industry knowledge.Create and maintain a customer pipeline, hitting revenue goals and growing the territory.Meet committed sales numbers on a quarterly basis.Build relationships with Channel and OEM partners to grow brand presence to end users.Establish executive level relationships, understanding the needs and language of customer’s specific business.Lead and coordinate complex, team selling efforts (with internal and external partners).Develop and maintain a strong partnership with all DDN staff, specifically with Sales Engineers and technical support staff.Develop a strong understanding of the customers’ technology infrastructure, strategy and business requirements.Partner with internal staff to create successful Proposals and Presentations in response to RFPs and other customer needs.Drive a territory strategy in alignment with DDN brand strategy.Accurately forecast sales figures and projections.Consistent communication with DDN Sales Leadership including sales reports.Manage accurate data and record keeping in SalesForce.com to increase customer satisfaction and brand penetration.Attend trade shows and other activities to raise DDN’s presence in the industry.Successfully negotiate with internal and external partners and end-user customers.Manage customer relationships post-sale; including a strategy to close repeat business.Qualifications for this role are;  Must have 6-8 years of experience in selling storage, with strong technical expertise, including deep industry knowledge and contacts.  A successful Account Executive will be expected to drive business through their own experience, including previously established relationships.  Must consistently be in the top 25% of sales force in quota attainment.  Must have experience negotiating large transactions and be instrumental in closing deals.  BA or BS in a related field is required.  A demonstrated knowledge of DDN SAN/NAS appliance product lines is desired. Critical Success Skills: The following are a list of critical skills for this job and examples of behaviors related to those skills.  Develops Sales Leads: Demonstrates the initiative to uncover sales opportunities; actively attracts the interest of potential customers; networks to increase contacts; stays on top of market conditions to uncover new leads; consistently follows up with leads to assess their interest in the product/service offering. Creates and maintains a strong network in the industry. Leverages relationships for introductions to key decision makers. Has consistent face-to-face meetings with partners and customers and consistently makes pro-active sales calls.  Qualifies prospects with standard probes: Uses a formula or series of questions to determine the prospect’s fit with the product; expects to sell to the majority of prospects since they are known to need the seller’s products; reacts quickly and objectively to the answers to standard probes by disqualifying the prospect or proceeding through the selling process. Asks questions of customers and partners to uncover needs.  Uses knowledge of industry to identify potential targets for business. Leverages network to uncover potential new business. Consistently digs to find cross-selling opportunities.  Makes Persuasive Presentations: Excites the customer with an enthusiastic presentation style; demonstrates value and actively promotes products and services by making an emotional appeal; holds the customer’s attention and interest by keeping the presentation content relevant; varies style to build toward a buying decision. Effectively responds to RFP’s with impact and success. Partners with SE’s to create powerful presentations. Clearly articulates DDN’s selling points verbally and in writing. Gets customer to commit to case studies and success stories to tell future clients.  Commits Time and Effort to Ensure Success: Thrives on working; tends to achieve higher results in direct proportion to the time he is willing to commit to his work; remains focused on the goal and is not easily discouraged or distracted; uses work as an opportunity for interaction and incorporates interpersonal contacts into task accomplishment and sees work as a major source of personal satisfaction. Constantly invests in and manages their professional network. Driven toward success and doing what’s needed to win. Constantly striving to understand the industry and the direction it is moving. Receives accurate feedback and takes appropriate action.  Maximizes results by partnering as a customer advocate: Consistently achieves above-average sales results by understanding the customer’s business, empathizing with their problems, and setting a plan to meet their needs; tirelessly focuses on building strong relationships with customers by acting on their behalf to work the seller’s internal systems to meet their requirements; sees partnering with customers as the efficient method to reach personal sales career goals. Asks questions to uncover customer needs strives to find solutions for customer problems.  Effectively works with channel partners to understand their needs and requirements. Adapts approach to Different Buyer Motivations: Gathers essential information to determine the benefits customers need in order to be sold; is willing to adjust sales approach to fit different buyer motivations; influences or persuades others by determining how the other individual can benefit, and then communicates those advantages. Works to understand the different motivations of partners and end-user and uncovers the real business case of each customer to clear path for the sale. Strives to understand the state of the industry (including competition) and trends that customers face. Changes sales style to match the decision maker of each transaction. Critical Success Skills: The following are a list of critical skills for this job and examples of behaviors related to those skills.  Develops Sales Leads: Demonstrates the initiative to uncover sales opportunities; actively attracts the interest of potential customers; networks to increase contacts; stays on top of market conditions to uncover new leads; consistently follows up with leads to assess their interest in the product/service offering. Creates and maintains a strong network in the industry. Leverages relationships for introductions to key decision makers. Has consistent face-to-face meetings with partners and customers and consistently makes pro-active sales calls.  Qualifies prospects with standard probes: Uses a formula or series of questions to determine the prospect’s fit with the product; expects to sell to the majority of prospects since they are known to need the seller’s products; reacts quickly and objectively to the answers to standard probes by disqualifying the prospect or proceeding through the selling process. Asks questions of customers and partners to uncover needs.  Uses knowledge of industry to identify potential targets for business. Leverages network to uncover potential new business. Consistently digs to find cross-selling opportunities.  Makes Persuasive Presentations: Excites the customer with an enthusiastic presentation style; demonstrates value and actively promotes products and services by making an emotional appeal; holds the customer’s attention and interest by keeping the presentation content relevant; varies style to build toward a buying decision. Effectively responds to RFP’s with impact and success. Partners with SE’s to create powerful presentations. Clearly articulates DDN’s selling points verbally and in writing. Gets customer to commit to case studies and success stories to tell future clients.  Commits Time and Effort to Ensure Success: Thrives on working; tends to achieve higher results in direct proportion to the time he is willing to commit to his work; remains focused on the goal and is not easily discouraged or distracted; uses work as an opportunity for interaction and incorporates interpersonal contacts into task accomplishment and sees work as a major source of personal satisfaction. Constantly invests in and manages their professional network. Driven toward success and doing what’s needed to win. Constantly striving to understand the industry and the direction it is moving. Receives accurate feedback and takes appropriate action.  Maximizes results by partnering as a customer advocate: Consistently achieves above-average sales results by understanding the customer’s business, empathizing with their problems, and setting a plan to meet their needs; tirelessly focuses on building strong relationships with customers by acting on their behalf to work the seller’s internal systems to meet their requirements; sees partnering with customers as the efficient method to reach personal sales career goals. Asks questions to uncover customer needs strives to find solutions for customer problems.  Effectively works with channel partners to understand their needs and requirements. Adapts approach to Different Buyer Motivations: Gathers essential information to determine the benefits customers need in order to be sold; is willing to adjust sales approach to fit different buyer motivations; influences or persuades others by determining how the other individual can benefit, and then communicates those advantages. Works to understand the different motivations of partners and end-user and uncovers the real business case of each customer to clear path for the sale. Strives to understand the state of the industry (including competition) and trends that customers face. Changes sales style to match the decision maker of each transaction.DDN Core CharacteristicsDDN has a very strong orientation towards these 4 characteristics and any successful employee will demonstrate these capabilities: Self-Starter - Takes independent action to identify and solve problems. Seeks out relevant information needed to make decisions. Gets involved with new initiatives. Success/Achievement Orientation - Delivers quality results consistently. Targets, achieves (or exceeds) measurable results. Sets challenging goals, focuses on critical priorities, and is accountable. Problem Solving - Recognizes problems and responds with a systematic assessment that identifies and addresses cause of issue. Practical, realistic, and resourceful. Innovative - Builds and improves key business processes that enhance the effectiveness of DDN. Generates new ideas, challenges the status quo, and solves problems creatively. DataDirect Networks, Inc. is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity, gender expression, transgender, sex stereotyping, sexual orientation, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law."}