{"jobID": "2695590174", "jobLocation": "Dearborn_MI", "jobTitle": "Talent Acquisition Specialist/Recruiting Specialist- Dearborn, Michigan automotive industry!", "companyRating": "2.8", "companyInfo": {"Website": "www.percepta.com", "Headquarters": "Dearborn, MI", "Size": "1001 to 5000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "31000", "jobDescription": "Brand new position created for our growing HR team!Talent Acquisition Specialist/ Recruiting Specialist opportunity in the Dearborn, Michigan automotive industry!*The Talent Acquisition Specialist/Recruiting Specialist will work out of our Dearborn, Michigan officeCareer field: Talent Acquisition, Recruiting, Human Resources.Talent Acquisition Specialist/Recruiting Specialist Position Summary The Talent Acquisition Specialist/ Recruiting Specialist is responsible for acquiring the most qualified employees to meet the staffing needs of the departments supported by the Dearborn Human Resources Team. Develops new strategies and programs to attract both qualified internal and external candidates to open positions and ensures a constant pipeline of qualified candidates are available for interviewing. This position works closely with the site management team on determining best recruiting strategies, forecasting staffing needs, customizing skill and testing requirements and implementing high quality interviewing selection techniques. This position will also assist with various other Human Resources duties as needed.Talent Acquisition Specialist/Recruiting Specialist Duties and ResponsibilitiesDevelop and maintain strong working relationships with hiring managers and other team members to create a partnership that yields success, predictable results, and credibility.Learn and understand each position responsible for filling.Develop and maintain a network of contacts to help identify and source qualified candidates.Build applicant sources by researching and contacting community services, colleges, employment agencies, and internet sites; providing organization information, opportunities, and benefits; making presentations; maintaining rapport.Build and maintain the candidate pool; keeping in touch with applicants to build interest in Percepta for future openings.Post, update and ensure consistency of all internal and external job postings.Leads candidate selection activities including screening, assessment process and interviewing.Review resumes and credentials for appropriateness of skills, experience, and knowledge in relation to position requirements.Provide complete, accurate, and inspiring information to candidates about the company and position.Prescreen candidates and present to hiring managers for interview.Coordinate all communication with candidates.Help with scheduling and logistics of all interviews between candidates and hiring managers.Works closely with hiring managers and peer Talent Acquisition Specialists to ensure a satisfactory interview process, leaving candidates with a great experience.Stay abreast of current legislation and policy changes to ensure recruiting activities follow all processes and procedures outlined by Percepta policies and Federal, State, and Local employment law.Facilitate post-offer process with employees once offer has been accepted.Conduct on-boarding and orientation with new hires.Administrative duties as needed. Talent Acquisition Specialist/Recruiting Specialist EducationAssociate's Degree required, Bachelor's preferred. Talent Acquisition Specialist/Recruiting Specialist Experience3-5 years of progressive recruitment experience in a high volume recruitment environment (agency recruiting experience a plus).Knowledge of sourcing techniques using social media and experience using LinkedIn, Twitter and Facebook to identify and engage talent.Strong (and current) knowledge of all laws and regulations pertaining to employment and equal opportunity.HR Information System experience.College recruiting experience desirable.Strong organizational, time management, planning and problem solving skills.A strong sense of urgency and the ability to work in an environment with time sensitive deadlines. Talent Acquisition Specialist/Recruiting Specialist SkillsAbility to think on their feet and thrives under pressureManages effectively in a results driven environmentOutstanding written and verbal communications skillsMust possess strong Internet, active, and passive candidate search skillsExcellent organizational skills, including the ability to manage multiple assignments and excel in a high volume demanding environmentProficiency in HRIS and Applicant Tracking Systems requiredProficiency in Microsoft Applications (Word, Excel, Power Point) requiredUnderstands the external marketplace (Melbourne) and the impact it has on sourcing strategies (i.e. competition, unemployment rate, movement of companies in/out of area)Ability to develop strong relationships with all levels of management and external resourcesAbility to effectively present information and respond to questions from groups of managers, clients, and applicants Percepta requires all employees hired in the United States to successfully pass a background check and depending on location and client program a drug test, as a condition of employment. Percepta is an Equal Opportunity Employer."}