{"jobID": "2679479563", "jobLocation": "Mountain_View_CA", "jobTitle": "Scientist / Senior Scientist - Statistical Genetics", "companyRating": null, "companyInfo": {"Website": "www.23andme.com", "Headquarters": "Mountain View, CA", "Size": "201 to 500 employees", "Founded": " 2006", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Come join the growing 23andMe research team! We are looking for a colleague with training and experience in statistical genetics to join our highly productive Research Team. This person will be involved in the analysis of human genetic data and the development of computational methods, which requires a mix of computational skills, statistical knowledge, creativity and biological insight. Who we are Since 2006, 23andMes mission has been to help people access, understand, and benefit from the human genome. We are a group of passionate individuals pushing the boundaries of whats possible to help turn genetic insight into better health and personal understanding. Our Research Team 23andMes Research Team prides itself on driving cutting edge, industrial-scale science that makes an impact that belies the teams size, in an environment and culture that fosters creativity, innovation, collaboration and fun. Our science has garnered the respect of many members of the broader scientific community. As 23andMe continues to grow, we are looking for people who are excited by the potential discoveries we can make with our innovative research framework.  See our recent publications here: hhttps://research.23andme.com/publications/ Who you are We are looking for a colleague with extensive training and experience in statistical genetics to join our highly productive, world-class research team. The successful candidate will work within and across teams to support our research efforts. The job requires strong statistical and computational skills, a deep understanding of human genetics, and excellent writing abilities. Candidates for the senior statistical geneticist role should also have multiple years of experience playing a leadership role in genetic association studies and executing independently developed ideas, as well as a demonstrated ability to communicate clearly and effectively with a wide range of audiences. What youll doDesign and execute a wide range of analyses for both internal and external customers.Work collaboratively with members of the research, product, and engineering teams to develop our research platform.For senior scientists: supervise, develop, and mentor junior scientists. Manage teams to execute complex projects.What youll bringPh.D. in Statistics, Genetics, or a related field.Research experience in statistical human genetics.Hands-on experience working with very large data sets in Python or R; experience with C/C++ is a plus.At ease in a Linux environment.Excellent verbal and written communication skills.Enthusiasm for working in a highly collaborative environment.About Us 23andMe, Inc. is the leading consumer genetics and research company. Our mission is to help people access, understand and benefit from the human genome. The company was named by MIT Technology Review to its 50 Smartest Companies, 2017 list, and named one of Fast Companys 25 Brands That Matter Now, 2017. 23andMe has over 5 million customers worldwide, with ~85 percent of customers consented to participate in research. 23andMe is located in Mountain View, CA. More information is available at www.23andMe.com.  At 23andMe, we value a diverse, inclusive workforce and we provide equal employment opportunity for all applicants and employees. All qualified applicants for employment will be considered without regard to an individuals race, color, sex, gender identity, gender expression, religion, age, national origin or ancestry, citizenship, physical or mental disability, medical condition, family care status, marital status, domestic partner status, sexual orientation, genetic information, military or veteran status, or any other basis protected by federal, state or local laws. If you are unable to submit your application because of incompatible assistive technology or a disability, please contact us at accommodations-ext@23andme.com. 23andMe will reasonably accommodate qualified individuals with disabilities to the extent required by applicable law.  Please note: 23andMe does not accept agency resumes and we are not responsible for any fees related to unsolicited resumes. Thank you."}