{"jobID": "2813846415", "jobLocation": "Plymouth_MI", "jobTitle": "Account Sales Representative", "companyRating": null, "companyInfo": {"Website": "www.tramgroup.com", "Headquarters": "Plymouth, MI", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Subsidiary or Business Segment", "Industry": " Manufacturing", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Overview of Position:Is it time for a change? If you’re ready to push yourself and your career to new levels you should consider TRAM, where we manufacture automotive components that make the driving experience a seamless and natural extension of the human body. Our Senior Account Representatives work on exciting critical projects that provide creativity to the products that drivers will touch and feel every day and in the future. As part of this, we now have an opening for a Senior Account Representative! Check out the details and apply now! Tasks/DutiesPrepare pricing quotation and obtain customer agreement.Track engineering changes and price impact over program life.Collect customer specifications and provide to internal departments.Follow up with customer purchase orders and ensure the Finance Department is given the information.Negotiate with the customer concerning commercial issues.Coordinate with all plant locations to ensure customer satisfaction.Assisting with Annual Price Review (APR).Forecast annual sales and 5 year sales plan by product number.Track open issues and see them through to close.Travel to customers to build relationships and inquire about new business opportunities. Job Requirements Requirements Applicants must be currently authorized to work in the United States without the need for visa sponsorship now or in the future. Bachelor’s degree in Economics, Accounting, Finance, Math, Economics, Marketing or related degree.Strong analytical skillsIntermediate to advanced MS Excel ability.Ability to interact positively with people of diverse cultural backgrounds.Benefits:Benefits start on your first day (no waiting period)!We offer Medical, Prescription, Dental & Vision coverageLow yearly deductiblesLow payroll contributionMost claims paid by plan at 100%401(k) with generous company matchingRoth 401(k) optionTuition Assistance13 paid Holidays per yearPaid Vacation with unused days that carry over to the next yearFlexible spendingLife Insurance coverage 100% at no cost to youTRAM, Inc. is an Equal Opportunity Employer."}