{"jobID": "2817632886", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.roberthalftechnology.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 1994", "Type": " Company - Public", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "70000", "jobDescription": " A prestigious media company is looking for their next Data Analyst to join their growing team in Miracle Mile! A full suite of benefits are offered! In this role, you will assist in the analytics process for our top clients and help take analytics to the next level. As an Analyst, you will become a subject expert in audience research, the measurement of media outcomes (reach, impression, frequency, verification and validation). You will help drive the development use of audience investment decision tools. This entry-level opportunity will kick-start your career in media and provide a platform to partner with the world's leading consumer brands.  Essential Functions  · Manipulate multiple sources of data to analyze the state our clients' businesses across multiple dimensions (sales, brand equity, search interest, website visits, social media, advertising activity)  · Compile and assess competitive advertising media intelligence  · Data Extraction, Transformation Loading (ETL), Quality Hygiene  · Create Dashboards using a variety of data visualization tools  · Apply independent critical thinking to analyze vast data sets to uncover media insights, what's working, what's not working.  · Participate in brainstorming sessions with communication planners, creative assets, media planners, buyers, clients and other partner agencies  · Contribute to the department's overall capabilities and understanding of media and communications channels ****LOCAL LOS ANGELES COUNTY APPLICANTS ONLY! NO C2C! MUST BE ELIGIBLE TO WORK IN THE U.S. AND REQUIRE NO SPONSORSHIP!***************FOR IMMEDIATE CONSIDERATION, PLEASE EMAIL YOUR RESUME DIRECTLY TO CHELSEA.CUA@RHT.COM!******"}