{"jobID": "2617051622", "jobLocation": "Summit_NJ", "jobTitle": "Principal Scientist, Research Analytics", "companyRating": null, "companyInfo": {"Website": "www.celgene.com", "Headquarters": "Summit, NJ", "Size": "5001 to 10000 employees", "Founded": " 1986", "Type": " Company - Public (CELG) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Principal Scientist, Research Analytics Req #: 1701105Location: Summit,  NJ USJob Category: Research and Early DevelopmentWork Location: 556 Morris Avenue CELSUMWEST 07901Organization: Celgene CorporationSchedule: 40Shift:Employee Status: Full timeJob Type: RegularJob Level:Travel:Other Locations:US- NJ- Summit West DescriptionCelgene is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Our purpose as a company is to discover and develop therapies that will change the course of human health. We value our passion for patients, ​quest for innovation, spirit of independence and love of challenge. With a presence in more than 70 countries, and growing - we look for talented people to grow our business, advance our science and contribute to our unique culture.  We seek a talented, collaborative inter-disciplinary scientist to lead work on the computational analysis of high-dimensional tissue, cell and molecular profiling data. This individual will play a key scientific role leveraging innovative computational analysis strategies and rich patient data to empower data-driven decisions for therapeutic programs in Celgene’s Immunology & Inflammation (I&I;) Thematic Center of Excellence (TCoE).  Applications range from providing deep insight into therapeutic mechanisms of action for existing and novel therapies as they transition into clinic, identification and predictive leverage of patient phenotypes associated with therapeutic effect and outcome in key indications, and downstream development of molecular biomarker hypotheses into clinical diagnostics. Analysis scenarios will involve exploratory clinical data and output from transcriptomic, proteomic, genomic, and a wide range of innovative cell-molecular profiling platforms.  The position would suit an individual with strong scientific leadership potential and excellent communication and collaboration skills. Applications are encouraged from those involved in innovative translational biomarker research for complex indications in clinical or industrial research environments. The role offers the opportunity to impact directly the delivery of truly transformational and life-changing therapies in key diseases of unmet medical need.  Strong interest in the inter-disciplinary application of computational analysis methods to life sciences data is imperative. Areas of particular focus include: elucidation of pharmacogenomics and pharmacodynamics hypotheses derived from trial data; methods to highlight clear mechanistic differentiation of Celgene assets comparing to existing therapeutics in key indications; and predictive patient stratification to identify biomarker-defined subgroups of unmet medical need and/or enriched therapeutic response via machine learning analysis of molecular profiling data. ResponsibilitiesWorking in collaboration with computational, biological and clinical scientists across the Celgene Research and Early Development organization, responsibilities include but are not limited to:Pursuit and supervision of leading computational biology research towards key Celgene scientific objectives, including potential for line management of junior staff.Active participation as a core team member in the RIKU Research Analytics group and focused collaboration with translational researchers in our I&I; TCoE.Coordinated application of novel computational analysis and biological interpretation approaches to leverage internal, public and partner datasets and empower data-driven decisions across therapeutic programs.Multi-disciplinary collaboration to investigate compound and disease properties, influence decision making across the translational research and clinical development process, and feedback to inform early development of novel therapies.Guide development of molecular patient selection and biomarker hypotheses towards clinical diagnostics.Participation in and oversight of scientific report writing. Presentation of methods, results and conclusions to a publishable standard.Contribution to planning and execution of collaborative projects with leading academic and commercial research groups worldwide.Background experience & complementary knowledgeA Ph.D. in computational biology, bioinformatics, or related field from a recognized higher-education establishment.8+ years post-doctoral experience of inter-disciplinary computational and molecular biomarker research in university, hospital or biotechnology environments.3+ years experience in pharma/biotech research environment preferable.Strong knowledge required of predictive analytical practice and molecular diagnostic development. Working knowledge of clinical statistics desirable.Previous experience of research supervision and track record of peer-reviewed publication in relevant scientific journals.Expertise in algorithmic implementation, statistical programming and data manipulation, using e.g. R/Bioconductor, Matlab, Python, and contemporary, open-source bioinformatics tools and database structures.Proven problem-solving skills, collaborative nature and adaptability across disciplines.Excellent verbal and written communication skills. Fluent verbal and written English language skills prerequisite. #LI-POST  BIO-USCelgene is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Celgene complies with all applicable national, state and local laws governing nondiscrimination in employment as well as employment eligibility verification requirements of the Immigration and Nationality Act. All applicants must have authorization to work for Celgene in the U.S."}