{"jobID": "2626860490", "jobLocation": "San_Francisco_CA", "jobTitle": "Regional Director, Business Development - West Coast", "companyRating": "3.5", "companyInfo": {"Website": "www.tklresearch.com", "Headquarters": "Fair Lawn, NJ", "Size": "51 to 200 employees", "Founded": " 1944", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "95000", "jobDescription": " We are seeking a highly motivated Regional Director, Business Development for our growing organization!  In this role, you will be responsible for identifying new TKL clients, managing the sales cycle, and securing contracts for services which can include companies in the pharmaceutical, consumer health, medical device, and nutritional communities.  Responsibilities include but are not limited to: Prospects and develops new opportunities for Phase I servicesWorks independently to identify new clinical trial opportunities from industry intelligence, follow-up on leads generated from industry/therapeutic meetings, and networking with colleaguesProvides client services to key accountsManages sales cycle for Requests for Proposals (RFPs), with response to be developed in collaboration with internal team, follows up on submitted proposals, and participates in client meetings to secure contractsDevelops annual sales plans to achieve yearly corporate goal; (individual yearly goals to be set based on experience and current client base)Contributes to BD strategy to achieve long term plan for corporate growthEnters and tracks all contacts through the Customer Relationship Management (CRM) SystemPrepares monthly client contact reports and business development pipeline reportsMay need to attend conferences or work at booth when TKL is exhibitingPerforms miscellaneous duties, as necessary, in support of the business development and operations initiatives and TKL business priorities and objectives Minimum Bachelor’s degree. Ideal candidate will have at least 3 years experience in health sciences, business, or communications and 3 to 5 years direct sales and/or clinical operations experience. Strong communication skills, attention to detail, and organizational skills are required. Must have knowledge of FDA regulations and GCP/ICH guidelines as they apply to the conduct of clinical research. Working knowledge of Microsoft Office Suite and Publisher. Must exhibit a collaborative working style and have the ability to translate high level management discussions into specific action plans. Excellent mentoring, supervisory and communication skills are required in order to build a staff that works as a team delivering a uniform product to each sponsor. Excellent verbal and written communication skills. Preferred home-based location is on the West Coast USA. We offer a competitive compensation package for full time employees, commensurate with your background and experience, including salary, commission, full benefits, 401(k) with match and a profit sharing plan."}