{"jobID": "2774918489", "jobLocation": "Long_Beach_CA", "jobTitle": "Seeking Junior Scientist or Geologist to Support Emergency Response Contract", "companyRating": "3.2", "companyInfo": {"Website": "www.westonsolutions.com", "Headquarters": "West Chester, PA", "Size": "1001 to 5000 employees", "Founded": " 1957", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "64000", "jobDescription": "Job Description: Perform as a member of the START emergency response team providing our EPA client with accurate and pertinent scientific data according to agreed upon methods, procedures, and techniques. Provides sound conclusions and recommendations based upon field investigations and literature reviews within the established project schedules. Position Duties: Duties will include rotations as an \"on-call\" responder available 24hrs a day for a week at a time. Calibration and maintenance of a variety of multi-media monitoring and sampling equipment. Document field activities and prepared daily and final reports for EPA client.  In-field multimedia sampling.  Proficient in the writing of technical documents and plans.  Use level D-A PPE to make entries into potentially hazardous areas. Technical and Operational Scope:  Exercises judgment on applicability of methods and approaches in use, and determines best approaches  to problem solving when standard procedures are inadequate.  Determines best method of data gathering, data base management, and analysis of data to achieve goals.  Consults with outside specialists to obtain most accurate and timely data possible qhile meeting project specifications and time tables.  Prepares reports on methods and procedures as part of overall project. Major Accountabilities:  Maintain preparedness for immediate mobilization while on-call.  Produces quality samples and sampling techniques from which sound scientific data can be drawn into relevant and pertinent evaluation reports to the client's satisfaction.  Provides completed projects including draft and final reports within the established budget and schedule.  Provides accurate identification of specimens and/or sound ecological assessment and evaluations. Qualifications: BS or BA in Environmental Science plus 0-3 years experience. MS plus 0-3 years experience.  Skills Required: Data Management, training in and use of the scientific method, some personnel  supervision, various exposure to technical and scientific procedures, Decision making, people skills for client contact and personnel management, great ability to be flexible and adaptable. Microsoft Office. Preferred Skills: Field instrumentation. Familiarity/ability to utilize air monitoring and sampling equipment. Abilities include calibration, implementation in field, and interpretation of results.  Familiarity with the Incident Command System (ICS) 100-800 is a plus.SDL2017"}