{"jobID": "2766605797", "jobLocation": "San_Francisco_CA", "jobTitle": "Sales Operations Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.riverbed.com", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Cisco Systems, F5 Networks, EMC"}, "estimatedSalary": "74000", "jobDescription": " Company OverviewWith a powerful combination of Digital Experience, Cloud Networking, and Cloud Edge solutions, Riverbed – The Digital Performance Company – provides a modern IT architecture for the digital enterprise, delivering new levels of operational agility and visibility, while dramatically accelerating business performance and outcomes. As businesses transform digitally and experiment with new technologies, they partner with Riverbed to push boundaries, increase performance, and rethink possible.  Riverbed is a pre-IPO opportunity with over $1 billion in revenue and 30,000+ customers – including 98% of the Fortune 100 and 100% of the Forbes Global 100.About this PositionTitle: Sales Intelligence AnalystLocation: San Francisco, CAJob Description:We are looking for a Sales Intelligence Analyst to join the Worldwide Sales Operations team. This role is part of the Sales Analytics team working cross functionally with Sales, Finance, Manufacturing and IT in order to report the worldwide sales forecast, funnel and bookings activity for Riverbed. This role will support standardized metrics, new sales metrics as required, ad-hoc reporting requests, and then will analyze results to provide insights, conclusions, and general guidance to the sales organization. The ideal candidate will be a high-energy, hands-on, detail-oriented individual with experience reporting bookings data from CRM and ERP systems for a large, global sales team, with a proven record of turning data into actionable insights. This person will support our dynamic sales organization by providing timely and accurate data to support decision making and productivity improvement.Responsibilities:Create bookings reports for executives and sales management, segmented by geography, product family, partner channel, customer vertical, customer size, etc.Design sales reports and dashboards in alignment with strategic initiatives by gathering business requirements, providing subject matter expertise, creating, testing and deploying.Help sales management enhance the understanding of their business, improve decision making and increase sales productivity.Assist with manufacturing demand planning by providing visibility into Salesforce.com sales funnel.Fulfill ad-hoc reporting and analytics requests from the global sales team.Drive process improvements, system enhancements and automation opportunities where possible.Participate in and/or lead cross-functional initiatives.Coordinate and manage simultaneous data analysis requests of varying size and scope.Qualifications:Bachelor’s degree with a minimum of five years of experience working at a technology company within sales, sales operations or finance (MBA’s with less, but relevant experience will also be considered).Exceptional data analysis skills and problem solving ability, including advanced proficiency in business intelligence (Oracle Business Intelligence preferred) or decision support systems, as well as Excel (lookups, pivot tables, macros, etc.).A minimum of three years with CRM systems (Salesforce.com preferred) and ERP systems (Oracle preferred, Oracle Business Intelligence proficiency a plus).Excellent verbal and written communication skills, including the ability to interact professionally with all levels of the organization.Experience working with large, complex data sets and creating executive dashboards and summary presentations.Should be a creative, self-starting, fast learning, detail oriented team player who thrives with multi-tasking in a fast-paced environment.Ability to combine different vantage points and requirements into standardized metrics.Proficiency in turning data into actionable insights. About RiverbedIf you are a high-achiever who wants to be part of a dynamically growing, billion dollar plus company, then you should look closely at Riverbed. We offer the rewarding experience of working with the best minds in the industry that are changing the world through cutting edge technology and applications. The company has been recognized multiple years for attracting and retaining today’s top talent as a great place to work by Glassdoor, Fortune magazine’s 20 Great Workplaces in Tech and by numerous other publications.  Learn more at www.riverbed.com.  Riverbed is proud to be an affirmative action (AA) and equal employment opportunities (EEO) employer. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.  *LI-TC1"}