{"jobID": "2819854501", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - Ad Platform", "companyRating": "3.5", "companyInfo": {"Website": "discover.king.com", "Headquarters": "London, United Kingdom", "Size": "1001 to 5000 employees", "Founded": " 2003", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "98000", "jobDescription": "Senior Data Scientist - Ad PlatformActivision Blizzard Media is a young and rapidly growing business that has been created to connect advertisers with our 195M + global consumer base. This thriving start-up effort, which is currently embedded in the business unit of King (the makers of the # 1 mobile game Candy Crush Saga) is rapidly scaling and is poised to become one of the largest advertising companies in the world.  The business has been focusing on the introduction of premium, innovative advertising experiences to King's 195+ M casual gaming players. Looking ahead, we are planning the launch of advertising across the rest of the Activision Blizzard portfolio including high growth areas like eSports. This is a really exciting time to join this growing business.  King is seeking a talented and creative Data Scientist interested in driving business decisions by understanding advertising performance within the gaming industry.Your role within our KingdomUsing data to understand how software releases can impact the system performance of our games and to make critical ad platform decisionsProviding insights and recommendations to enhance our Ad Platform based on analytical findingsPresenting and visualising results in a clear and concise way to senior management for decision makingAnalyzing ads as a part of a larger technology ecosystemSkills to create thrillsCapacity to deeply understand the problem space of advertising and its underlying technologiesWork with the product and engineering teams to identify, diagnose, and improve the advertising platform from a data-driven perspectiveBe a subject matter expert and analysis lead for the ad platform, helping game teams as they adopt new advertising productsIdentify and disseminate best practices across Business Performance groups in terms of ads-related tools, systems and processesWorking alongside other highly skilled Data Scientists and Business Analysts, you'll be strategic in outlook and highly analytical in delivery with responsibility for using data to ensure we make the right business decisionsAd-hoc analysis - assist and resolve requests from the business (i.e. analyzing A/B tests, strange platform behaviour, emergent stability issues, etc.)Create reports and dashboards that allow the advertising team to understand and monitor the health and performance of our ad platformBonus pointsAbility to analyze huge volumes of data from our advertising activities, by writing complex SQL queries and using tools such as Hive, Impala and HadoopAbility to learn quickly and work in a fast paced, rapidly changing and collaborative environment, while communicating effectively with teams and individuals across King.Ability to identify the appropriate statistical techniques to use in different circumstancesAble to develop good ways of communicating, visualising or reporting your results/analysis so they are clear and unambiguous. This will include building reports and presenting the results of your analysis using tools such as LookerAn interest in and understanding of coding a plusBA/BS in Computer Science, Math, Physics, Engineering, Statistics or other technical fieldA great saga needs all sorts of heroesMaking games is fun. Especially when you do it with people who share the same idea of what makes a good workplace, great. We design games for everyone, no matter where they are or who they are, and we employ all sorts of people from all kinds of backgrounds to bring them to life. Truth is, we simply can’t expect diversity in our players and originality in our games without first nurturing it in our people. A great saga needs all sorts of heroes. And that’s it.We’re Seriously PlayfulOfficially, we’re a leading interactive entertainment company for the mobile world. Unofficially, we’re a serious business that’s not afraid to have fun. Every day at King, we mix intuition with logic, art with science and magic with mathematics to create the games the world loves to play. Together with our parent company Activision Blizzard, our mission is to bring moments of magic to everyday life. If you think this is something you can help us achieve, let’s talk.Apply now!Want to join our Kingdom? You’ll find all you need to apply, plus more information on our culture, values and benefits, including relocation packages at jobs.king.com. All applications should be made in English."}