{"jobID": "2836816941", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Research Scientist – Planning & Logistics", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "186000", "jobDescription": "Senior Research Scientist – Planning & Logistics Job Number: 113605935Santa Clara Valley, California, United StatesPosted: Jul. 3, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  Senior Research Scientist will work closely with Logistics & Planning team, BPR to develop optimization models for critical decisions like supply allocation, Carrier selection, placement of Distribution centers, Supplier SOB allocation.Key Qualifications 3-4 years hands-on experience in optimization modelingWorking knowledge of optimization tools (Gurobi, Cplex, or Xpress)Experience with data acquisition tools (e.g. SQL, Apache Spark etc.), large datasets (Hadoop) and data miningExperience prototyping and developing software in programming languages (Java/ C++/Python/Perl)Hands on experience in Python programming ,using various libraries not limited to Pandas,Numpy, sqlalchemy, Anaconda distribution Description- Understand business needs and design solutions to effectively automate them Ability to explain analytical outcomes and technical roadblocks in business terms (maybe this is similar to the interpersonal skills)Design, Develop and support end to end optimization modelsProvide detailed level of efforts for new projects annually and on ad-hoc basisLead development team and their deliverablesDocument system critical processesPresent design to key IS&T; and business partnersInterview and select consultants suitable for each assignmentCreate and deliver end user trainingHelp production support team on ad-hoc basisDedicated to meeting project/initiative objectives and willing to put in extra effort when required to ensure quality and timely deliverablesWe seek a self starter, visionary person with strong leadership capabilitiesAbility to communicate effectively, both written and verbal, with technical and non-technical multi-functional teamsYou will interact with many other group’s internal team to lead and deliver exclusive products in an exciting fast paced environment.Demonstrate initiative, adaptability and problem-solving skills in a changing and dynamic environmentAble to prioritize tasks effectively Ability to influence others; handle conflict appropriately, know when to delegate issues upward and when to apply common senseWe explore and evaluate new technologies and solutions to push the capabilities forward, getting ahead of customers’ needs, innovate and continually improve.You set priorities while working expertly in an exciting environment and demonstrate ability to deliver high quality results on timeDynamic, smart people and inspiring, innovative technologies are the norm here. Will you join us in crafting solutions that do not yet exist?EducationPhD in Computer Science, Statistics, Applied Math, Operations Research or a related field"}