{"jobID": "2805316387", "jobLocation": "Chicago_IL", "jobTitle": "Machine Learning Scientist I", "companyRating": "3.9", "companyInfo": {"Website": "www.lifeatexpedia.com", "Headquarters": "Bellevue, WA", "Size": "10000+ employees", "Founded": " 1996", "Type": " Company - Public (EXPE) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Priceline.com, Booking.com, Kayak.com"}, "estimatedSalary": "122000", "jobDescription": " ExpediaAre you inspired by the idea of solving real world problems with advanced machine learning methods?  Are you interested in joining one of the largest online travel companies in the world?  Are you ready to help people go places?  Our team is looking for a machine learning practitioner to join the core machine learning team within the Expedia Worldwide Engineering team. We use large-scale data in the cloud to power various business areas including, but not limited to, bidding algorithms for the meta and SEM marketing channels, NLP work for SEM keywords, and image and text processing for media and content. We build suggestion models support our customers as they search for the best travel options for them, and we optimize search results for relevance. We also run multiple revenue optimization and management pipelines for various lines of business (hotel, car, air, etc). We develop package pricing algorithms to grow transactions and profit, and we perform media campaign optimization to help our partners generate more revenue with their display ads.  Your contributions will affect millions of our customers and will have a direct impact on our business results. You will help develop state-of-the-art algorithms to tackle complex business problems. Our challenges include deriving value from sparse, noisy, or limited data, building models that scale to multiple languages, using behavioral data for personalization, and much more. Expedia has deep and rich data sets, many still untapped, and your real passion for machine learning and analysis has the power to unlock tangible business growth.  As a Junior Machine Learning Scientist, you come to us with a solid theoretical foundation in machine learning. You have experience applying research best-practices and methodology (masters or PhD preferred). Together with your experience using Python for analysis and object-oriented programming, you will make strong contributions to our team working side-by-side with expert machine learning practitioners. You work well with others and enjoy communicating your results both verbally and in writing to both technical and non-technical audiences. If this sounds like you, or the person you are ready to become, then lets talk!"}