{"jobID": "2725535451", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist/Deep Learning Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.intel.com", "Headquarters": "Santa Clara, CA", "Size": "10000+ employees", "Founded": " 1968", "Type": " Company - Public (INTC) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "130000", "jobDescription": "Job DescriptionWhat you will be working on: Development and optimizations of state-of-the-art deep learning models using Deep Learning frameworks, covering computer vision, object detection and localization, speech recognition, natural language processing, reinforcement learning etc.Work with framework software developers to facilitate end-to-end optimizationDistribute the model training and inference into multi-node systems, allowing scalable optimization and performance.Design and enable next generation deep learning systems.Development of deep learning algorithms to exploit novel distributed processor architectures. The ideal candidate should exhibit the following behavioral traits:  - Problem-solving skills  - Ability to multitask  - Strong written and verbal communication skills  - Ability to work in a dynamic and team-oriented environment QualificationsYou must possess the below minimum qualifications to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates. Experience listed below would be obtained through a combination of your school work/research and/or relevant previous job and/or internship experiences.  Masters or PhD in Computer Science, Electrical Engineering or any related fields (Statistics, Applied Math, or Computational Neuroscience)  1+ years of experience in the following area:  • Background in DL, ML algorithms and model development.  • Experience designing and developing professional software using Python, C++.  Preferred Qualifications:  • Experience with model tuning and optimization through data science projects or data competitions  • Familiarity with DL, ML frameworks (eg. TensorFlow, Caffe, Neon, PyTorch etc.)  • Familiarity with details of implementing algorithms on multi-core CPUs, clusters (MPI), GPUs,  heterogenous clusters, distributed frameworks (eg. GraphLab, Spark, Hadoop) Inside this Business GroupIntel AI, leveraging Intel's world leading position in silicon innovation and proven history in creating the compute standards that power our world, is transforming Artificial Intelligence (AI) with the Intel AI products portfolio. Harnessing silicon designed specifically for AI, end to end solutions that broadly span from the data center to the edge, and tools that enable customers to quickly deploy and scale up, Intel AI is inside AI and leading the next evolution of compute. Other Locations US, California, San Diego;Posting Statement. Intel prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status."}