{"jobID": "2837613848", "jobLocation": "Oak_Brook_IL", "jobTitle": "Sr. Analyst, DMO - SAP Master Data", "companyRating": null, "companyInfo": {"Website": "www.chamberlaingroup.com", "Headquarters": "Oak Brook, IL", "Size": "1001 to 5000 employees", "Founded": " 1900", "Type": " Company - Private", "Industry": " Manufacturing", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Changing the world is all in a day's work at Chamberlain Group. If you love innovation, here's your chance to make a career of it. Join us at the Chamberlain Group as a Senior Analyst, SAP Master Data at Oak Brook IL location.Senior Analyst, SAP Master Data Experience:5 years of experience in Business and/or Information Technology5 years of experience with SAP Master Data or equivalent ERP system5 years of experience in a manufacturing environmentData expertise in one or more domain(s) Material Master, Customer Master and or Vendor MasterHands-on experience with Bills of Materials (BOM) construction and maintenance, Material master creation, Mass updates, SOP developmentFamiliarity with Master Data Governance (MDG) combines Data Services and Information Steward with a Master Data Management (MDM) toolsKnowledgeable with SAP transaction tools LSMW, MM17, SQVI, SE16N, MM01/MM02, CS01/CS02, CC01/CC02, CV01N, XD01/XD02Experience with Excel add-in or SharePoint workflow tools like Winshuttle Studio and Foundation or similar tools a plusExperience with Lean, Agile and Six Sigma tools and processes a plus, i.e., scrum, JIRA, Value Stream Mapping, etc.Experience with Informatica, MDM tools, i.e. Information Data QualitySenior Analyst, SAP Master Data Overview:Senior Analyst, SAP Master Data position is responsible for developing and managing Master Data Management (MDM) processes, documentation, and metrics for materials, customers and vendors across the enterprise.Responsible for the collection, facilitation, audit and coordination of operational MDM processes and master dataCoach and train team members, end users, business partners on MDM processes and master data lifecycle to enable accurate, efficient, timely and quality processes and dataCreate, improve and facilitate documentation and use of the MDM data standards/definitions, process flows and supporting systemsCreate, measure and analyze master data content & quality to identify opportunities to improve the quality, accuracy and usability of the master dataProject management of data collection for new product promotion and changes or improvements to existing productsData auditor to ensure the highest quality of data to support these programs and enable speed to market and customer satisfactionLeverage continuous improvements to identify opportunities and recommend/implement solutions to business problems/challenges related to master dataFacilitate and implement updates to data standard/definitions, process flow documentation or development of supporting system improvementsProvide analysis of business and organization implications and options for Master Data structures and changesAdministering and maintaining adherence to established master data processes and metricsData analysis & processing; measure and present work outputsObserve and review data governance, organization, policies, standards, processes, and systems to keep current with latest organization and business partner needsConduct training and on master data and master data processes for the team, users and business partnersSenior Analyst, SAP Master Data Minimum Education Qualifications: Bachelors in Business Administration, Information Systems or equivalent.For Immediate Consideration:Please submit your resume via our career page at http://www.chamberlaingroup.com/careers/?postid=q6X4XcePyxY View our recruiting video by visiting our website. Share our immediate openings with your circle of friends, business Associates and family members. We have awesome opportunities.Senior Analyst, SAP Master Data opportunity offers a competitive base salary and excellent benefits including medical, dental, vision, 401(k) with company match and in-service bonus, and more! We're an organization who values its human capital and provides support to assist its employees succeed. Chamberlain Group is proud to be an Equal Opportunity Employer. You will be considered for this position based upon your experience and education, without regard to race, color, religion, sex, national origin, age, sexual orientation, ancestry; marital, disabled or veteran status. We are committed to creating and maintaining a workforce environment that is free from any form of discriminations or harassment. NOTE: Staffing agencies, headhunters, recruiters, and/or placement agencies, please do not contact our hiring managers via email or phone or other methods"}