{"jobID": "2797073253", "jobLocation": "Santa_Clara_CA", "jobTitle": "Staff Quality Engineer/Scientist", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "77000", "jobDescription": " Job DescriptionJob Title: Staff Quality Engineer/Scientist Requisition ID: 69571BR  Thermo Fisher Scientific Inc. (NYSE: TMO) is the world leader in serving science, with revenues of more than $20 billion and approximately 65,000 employees globally. Our mission is to enable our customers to make the world healthier, cleaner and safer. We help our customers accelerate life sciences research, solve complex analytical challenges, improve patient diagnostics, deliver medicines to market and increase laboratory productivity. Through our premier brands Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific and Unity Lab Services we offer an unmatched combination of innovative technologies, purchasing convenience and comprehensive services. Responsibilities:Leads/participates in cross-functional and multi-site team projects (e.g. sustaining NPI, Risk Assessments, Complaint/Product Investigations) ensuring that project deliverables and investigations comply with quality standards and regulations.Responsible for ensuring that design activities are appropriately defined, executed and reported in support of effective transfers to manufacturing.Guides development and implementation of validation plans and master validation plans.Provides guidance in planning and execution of risk management activities and deliverables.Guides resolution of complex and critical problems, including identification of root cause, and ensures corrective/preventive actions are identified to ensure timely resolution of such problemsManages the Internal Audit Program and Microarray Quality MetricsManages Training and Learning Management System (LMS)Manages and supports Engineering Change Control process by reviewing Engineering Change RequestsPrepares clearly written business communications, investigation summaries, policies and proceduresSupports RUO and GMP activitiesParticipates in continuous improvement.Minimum Qualifications:Bachelors degree, preferably in biology, chemistry, biotechnology or related science.Minimum 10 years Quality Assurance or related experience with working knowledge of FDA QSRs, ISO 13485 and/or cGMP environments.Experience leading risk managementExperience with Design Control/Design Transfer/Design Changes and Process Validation/Analytical Method ValidationMust demonstrate sound independent judgment and the ability to apply quality standards and regulations to operational processes and activitiesMust demonstrate effective leadership in guiding project teams to adopt practices consistent with ISO 13485 and GMP requirements, as applicableStrong computer skills (MS Office, Visio, Project); experience with SAP, Agile, TrackWise and database systems preferred.Must have effective communication skills and demonstrated ability to work collaboratively and cross-functionallyMust demonstrate strong organizational skills and attention to detail.Must be able to acknowledge sense of urgency, adapt to organizational changes and work in a fast paced environmentPreferred Qualifications:Masters degree is a plus.Working knowledge of FDA QSRs and ISO 13485Experience facilitating CAPAs, reviewing/analyzing data, working on product development teams, and TrainingCertified Quality Engineer (CQE)Certified Quality Auditor (CQA)This position does not have relocation assistance At Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer. Apply today http://jobs.thermofisher.com  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.  Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}