{"jobID": "2730325828", "jobLocation": "Itasca_IL", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.ally.com", "Headquarters": "Detroit, MI", "Size": "5001 to 10000 employees", "Founded": " 1919", "Type": " Company - Public (ALLY) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Career Area: Loan Administration/Operations Experience Level: Experienced Available Work Locations: Illinois (Itasca) Ally Requisition #:18-5451 Job Description:Position Description This position will be responsible to participate in developing analytics to drive loss control, operational efficiencies and operational preparedness within the DP&S; Insurance Operation. The ideal candidate is adept at using large data sets to find opportunities to optimize claims operation. They must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools and building and implementing models. They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes. Job ResponsibilitiesDevelop good understanding of our claim handling systems, processes and data being captured.Proficiency with Oracle SQL and data modeling tools (SAS, R) required. Data visualization experience is a plus.Break down requests for data/analysis into smaller, actionable plans to guarantee the end user will get their real questions answered.Build interactive dashboards using tools such as PowerBi, Tableau, Excel, etc.Provide validated & reconciled data extracts for audits, and other user requestsConduct thorough analyses, including coming up with your own hypotheses, testing, revising, and ultimately providing data-driven, evidenced recommendations.Effectively provide key summaries of actionable takeaways while also providing deeper evidence and analysis for end users wanting deeper insight.Assist with data governance support, including data definitions and subject matter knowledgeQualificationsBachelor's degree in Mathematics, Economics, Statistics, Information Science or similar background3-5 Years of Data and Business Analysis requiredproficiency in Oracle SQL, SAS, R, Data Visualization tools (PowerBi, Tableau), ExcelStrong organizational, analytical and interpersonal skillsAbility to work across cultures and functionsComputer Science or Predictive Analytics degree preferredAlly Overview Ally Financial Inc. (NYSE: ALLY) is a leading digital financial services company and a top 25 U.S. financial holding company offering financial products for consumers, businesses, automotive dealers and corporate clients. Ally's legacy dates back to 1919, and the company was redesigned in 2009 with a distinctive brand, innovative approach and relentless focus on its customers. Ally has an award-winning online bank (member FDIC), one of the largest full service auto finance operations in the country, a complementary auto-focused insurance business, a growing digital wealth management and online brokerage platform, and a trusted corporate finance business offering capital for equity sponsors and middle-market companies.Business Unit/Enterprise Function Ally Insurance is a leading provider of automobile-related insurance, vehicle maintenance and reinsurance products, and services for automobile dealers and their customers. Ally offers vehicle service and maintenance contracts, including our flagship, industry leading product, Ally Premier Protection which is available for new and used vehicles of virtually all makes and models, as well as other ancillary F&I; products, such as our GAP and Tire & Wheel products. Ally Insurance also services the insurance needs of our dealers' businesses by offering dealer inventory insurance, and liability and property protection, as well as provides training and consultative services to help their businesses succeed. Total Rewards Ally's compensation program offers market-competitive base pay and pay-for-performance incentives (bonuses) based on achieving personal and company goals. Plus, we have a flexible paid-time-off program including time off for volunteer opportunities. Ally's Total Rewards Program is designed to enrich your life at work -- and outside of it and includes: Industry-leading 401K retirement savings plan with matching and company contributionsWellness program encouraging healthy living with financial rewardsFlexible health insurance options including dental and visionPre-tax Health Savings Account with generous employer contributionsPre-tax commuter benefitsOther work-life integration benefits including parental and caregiver leave, adoption assistance, backup child and adult/elder day care program, child care discounts, tuition reimbursement, LifeMatters® Employee Assistance Program, subsidized and discounted Weight Watchers® program and other employee discount programsAlly is an Equal Opportunity Employer We extend equal employment opportunities to qualified applicants and employees on an equal basis regardless of an individual's age, race, color, sex, religion, national origin, disability, sexual orientation, gender identity or expression, pregnancy status, marital status, military or veteran status, genetic disposition or any other reason protected by law."}