{"jobID": "2798630671", "jobLocation": "Cupertino_CA", "jobTitle": "Machine Learning Engineer / Data Scientist / Software Engineer, iCloud", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": " Imagine what we could do here. At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and theres no telling what we could accomplish.  Were looking for talented data scientists, machine learning scientists, and strong engineerings (at all levels of seniority) passionate about building products and initiatives from the ground up. This is a brand new team driving data efforts across the iCloud organization.  In this role, youll implement novel machine learning algorithms, drive data science analysis for decision-making, and build efforts through to production at massive scale. These systems help us understand and improve Apples user experience, and are a significant part of our strategic focus optimizing user experience and engagement with personal iCloud accounts. Youll work in a small and dynamic team, building new functionality and collaborating across groups. Youll also participate in crafting systems, algorithm development, and optimization efforts to ship huge impact.  This position requires a broad set of software engineering skills, focusing on exabytes of data. You built and deployed ML algorithms, optimization efforts, and/or data science driven systems. You should have experience working with massive datasets and shipping production scale systems.  Key Qualifications: You've earned a: (a) PhD in Machine Learning, Statistics, Optimization or related field, with experience building production systems, or (b) MS in CS with 4+ years of experience in working with large data projects, or © BS in CS with 6+ years of experience in the industry with at least 3 years in data science / machine learning.Consistent track record delivering production software.Deep fluency in Java, C++, or another production language.Experience with Spark, Hadoop, MPI, or other distributed frameworksSolid mathematical knowledge; understanding of machine learning, statistics.Strong data-driven thinking.  Description:"}