{"jobID": "2837651990", "jobLocation": "Chicago_IL", "jobTitle": "Senior Analyst - Data Analytics", "companyRating": null, "companyInfo": {"Website": "www.united.com", "Headquarters": "Chicago, IL", "Size": "10000+ employees", "Founded": " 1926", "Type": " Company - Public (UAL) ", "Industry": " Travel & Tourism", "Revenue": " $10+ billion (USD) per year", "Competitors": " American Airlines, Delta Air Lines, Southwest Airlines"}, "estimatedSalary": null, "jobDescription": "Sr. Analyst - Data VisualizationOverview United Airlines is seeking talented people to join the Data Analytics division. We leverage data and decision sciences to enhance organizational and commercial effectiveness across the company. Responsibilities · Develop visual analyses and interactive dashboards that management can use to produce informed business decisions  · Develop and automate large data sets for the purpose of data mining, analysis, and reporting  · Data mining and analysis for ad hoc projects Education · Bachelors degree Knowledge/Skills Required  · Strong understanding of data visualization and data storytelling.  · Strong analytical and data mining skills, with an aptitude for deriving and applying useful insights from data analytics, quantitative and qualitative research.  · Significant experience with SQL, relational databases, and data manipulation/blending.  · Desire to attack complex data sets  · Ability to work independently and manage several simultaneous projects with a focus on results  · Experience with R or Python.  · Experience with JavaScript, D3, and HTML  · Experience with Spotfire, Tableau, Qlickview, or any other data visualization tool.  Preferred  · Proficiency in graphic design software such as Illustrator, Photoshop, InDesign, etc.  · Experience with creating infographics Experience · 2+ years of experience as Data Analyst, Business Intelligence Developer, or a related analytical role Other · Must be legally authorized to work in the United States for any employer without sponsorship Experience · 2+ years of experience as Data Analyst, Business Intelligence Developer, or a related analytical role Other · Must be legally authorized to work in the United States for any employer without sponsorship Equal Opportunity Employer – Minorities/Women/Veterans/Disabled/LGBT"}