{"jobID": "2689376640", "jobLocation": "Washington_DC", "jobTitle": "Infrastructure/Facility Data Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": "75000", "jobDescription": "Job Number: R0024775 Infrastructure/Facility Data AnalystKey Role:  Apply expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and comprehend how users interact with core business products. Leverage enthusiasm for analyzing data and translating it into recommendations when working with various teams across the organization. Anticipate client needs and formulate solutions to client issues.  Basic Qualifications:  -4+ years of experience with data analytics, including supporting infrastructure or facility condition analyses and prioritization  -Experience with Overseas Building Operations (OBO)  -Experience with using Microsoft Office, including Word and Excel or equivalent spreadsheets and databases  -Knowledge of facility condition assessments and how to use data analytics to prioritize funding priorities  -Ability to be an innovative, resourceful, and collaborative problem-solver  -Ability to learn and try new assignments  -Ability to perform research and provide analysis on research performed  -Ability to work core hours at a Booz Allen facility or on client site  -Ability to obtain a security clearance  -BA or BS degree  Additional Qualifications:  -Experience with supporting the federal government in facility condition assessment or portfolio prioritization  -Experience with the Department of State (DOS), Federal Aviation Administration (FAA), Department of Transportation (DOT), or similar civil agency  -Knowledge of programming languages, frameworks, and data architecture or infrastructure  -Possession of excellent critical thinking and analytical skills  -MA or MS degree preferred; PhD a plus  -Project Management Professional (PMP) or other certifications  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}