{"jobID": "2746752163", "jobLocation": "Ledgewood_NJ", "jobTitle": "Formulation Scientist", "companyRating": null, "companyInfo": {"Website": "www.imprimispharma.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Title: Formulation Scientist  Status: Non-Exempt Reports to: Pharmacist In Charge (PIC)  Supervises: Pharmacy Technicians and Staff About Imprimis Pharmaceuticals Imprimis Pharmaceuticals, Inc. (NASDAQ: IMMY) is a pharmaceutical company dedicated to producing and dispensing high quality innovative medications in all 50 states. The companys unique business model increases patient access and affordability to many critical medicines. Headquartered in San Diego, California, Imprimis owns and operates production facilities located in California and New Jersey. For more information about Imprimis, please visit the corporate website at www.ImprimisRx.com. Job Summary Under the direct supervision of the Pharmacist-In-Charge, the formulation scientist is responsible for collaboratively creating and implementing drug formulation development strategies for topical ophthalmic, injectable pharmaceuticals, including oral and topical dosage forms for a variety of therapeutic areas. Position Responsibilities Develop pre-formulation and formulation strategy and designs experimental plan for new formulations with DOE and QbD principles for injectable, ophthalmic and oral dosage forms. Design and perform quality scientific experimentation to develop robust processes in support of Formulation/Process Development activities. Refines formulations and processes through targeted DOEs and develops control strategy. Selects raw materials, packaging components, and process equipment based on scientific principles. Act as subject matter expert with clients and regulatory agencies. Coordinate and oversee the new analytical method development methodologies. Review and compile analytical data. Write, generate, and review SOPs, protocols, development reports, and master batch records. Help develop processes and assist in evaluating new equipment. Validate processes, procedures, and formulations, consistent with GMP requirements. Source, develop, and work with outside laboratories and manufacturing facilities to identify and support innovative products and delivery methods. Formulate and modify existing formulas to meet regulatory guidelines, cost parameters, and claims. Collaborate with others to define project scope, timing, and costs. Maintain a working knowledge of industry trends through regular research and perusal of relevant publications. Maintains a level of professional competency and remains current in the field of pharmacy and the pharmaceutical sciences. Attend and participate in staff meetings. Performs other duties as assigned.Requirements Excellent verbal and written communication skills 2-5 years relevant experience in drug development, including experience in aseptic manufacturing and regulatory affairs Experience with injectable, topical ophthalmic and oral dosage forms Working knowledge of analytical testing methods Experience using design of experiments (QbD) when developing new formulations. Experience in formulation development, process development and/or manufacturing. Experience in process optimization and scale up strategies for complex dosage forms Knowledge of 503 A and 503 B FDA Guidance. Knowledge of GMP manufacturing Knowledge of FDA requirements for different dosage formulations Creative thinking and strong problem-solving skills Excellent team and interpersonal skills Ability to interact successfully with multiple cultures Strong attention to detail and ability to multitask and prioritize assignments Ability to work under pressure to meet deadlines Willingness to work flexible hoursDesired Requirements PhD in Biochemistry or a related field, PharmD, or the equivalent qualification, past industry or equivalent experience.Supervisory Responsibility This position supervises pharmacy technicians and other pharmacy staff. Work Environment/Physical Demands: The employee may frequently be required to sit and talk or hear. The employee is occasionally required to stand; walk; use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl, and smell. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities by this job include close vision, depth perception and ability to adjust focus.AAP/EEO Statement Imprimis believes in creating long-term relationships by being responsive and relevant and by consistently delivering value to our community of customers. Specifically, with our employees, we focus on attracting, developing and retaining the best talent for our business, challenging our people, demonstrating a can-do attitude and fostering a collaborative and mutually supportive environment.  Diversity creates a healthier atmosphere: All qualified applicants will receive consideration for employment without regard to age, ancestry, race, color, religion, sex, national origin, protected veteran status, disability status, marital status, medical condition, genetic information, national origin, gender (including gender identity and expression), or sexual orientation.  Imprimis Pharmaceuticals, Inc. is a drug-free workplace. Candidates are required to pass a drug test before beginning employment. In addition, employees in certain positions are subject to random drug testing."}