{"jobID": "2756007818", "jobLocation": "Palo_Alto_CA", "jobTitle": "Business/Data Analyst Support Operations", "companyRating": "3.8", "companyInfo": {"Website": "www.pivotal.io", "Headquarters": "San Francisco, CA", "Size": "1001 to 5000 employees", "Founded": " 2013", "Type": " Company - Public (PVTL) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " IBM, Cloudera, Amazon"}, "estimatedSalary": "101000", "jobDescription": "About UsVIDEO Founded in 2013, Pivotal Software, Inc., combines our leading cloud-native platform, tools, and methodology to empower the worlds largest organizations to adapt to change and build great software. Our technology unleashes developer productivity, while fulfilling our mission to transform how the world builds software.  Get it done, make it work, and then make it sing. Pivotal is seeking a Sr. Business/Data Analyst to help Product Support operations by optimizing Support business processes and financial reporting. Do you enjoy bridging the worlds between Business, Support, Finance and IT? Do you hear a problem and run towards it? Then its time for us to talk.What does Pivotal do? We are transforming the way the world builds software. Were building a Pivotal suite of software and services to help every company, large and small, create great software at startup speed. What does Pivotal Support do? We keep our products working so that our customers can focus on what they do best. We value personal communication, time, and helping each other learn. We are passionate about providing our customers with the highest level of service and work in small teams around the globe, supporting our customers 24x7. We believe in doing the right thing and working at a sustainable pace. What do we need from you? We are looking for a Business Analyst with a passion for optimizing business processes, enhancing customer experiences and improving Supports performance metrics. The ideal candidate brings analytical rigor and business intelligence experience with a healthy dose of curiosity for driving performance improvement strategies. Strong communication, teamwork, and understanding of Support business and Finance experience are critical for success in this role.  In this role, you will bring together data and business analytics that support critical people and financial decisions -- allowing our managers and executives to act with confidence and take our business to the next level. Qualifications and factors for success:5+ years of relevant experienceSolid understanding of Support business and associated financeThe ability to develop creative solutions to problems, both the complex and the mundaneExperience working with globally distributed sites and teamsDemonstrated ability to communicate inside and outside the organization, both verbally and in writingSelf-starter requiring minimal direction for research and knowledge transferProven ability to collect, organize and analyze significant amounts of information, transforming the results into action items for a variety of audiencesBachelor's degree in Business Administration, Information Technology or equivalentAbility to write and execute queries against databases is a plusThis position requires US Citizen on US SoilResponsibilitiesIdentify, analyze, and interpret trends or patterns for large data sets.Track and manage performance improvement opportunities to prioritize efforts across the Support, Operations, Product Management and Development organizations.Build and maintain relationships with cross departmental stakeholders to increase collaboration and productivityClearly articulate and document business requirements and validate proposed solutions.Recommend and support implementation of enhancements to systems and reporting functions"}