{"jobID": "2754120558", "jobLocation": "Princeton_NJ", "jobTitle": "Associate Research Scientist, National/International Educational Assessment", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Job Description:POSITION SUMMARYETS Research & Development has an opening at the Associate Research Scientist level in the Center for Assessment Analytics & Research (AAR) unit within Psychometrics, Statistics and Data Sciences (PSDS). The successful candidate will contribute to projects aimed at advancing the science and practice of international large scale survey assessments such as the Programme for International Student Assessment (PISA) and the Programme for the International Assessment of Adult Competencies (PIAAC). The successful candidate will contribute to external and internal research projects designed to develop and evaluate measurement and explanatory models suitable for modeling data collected in these and other international comparative studies. A primary focus of the area is to contribute to externally-funded projects as well as provide service to the program areas of ETS, including foundational and applied psychometric and statistical research.BASIC FUNCTIONS AND RESPONSIBILITIESProvide scientific and technical skills so as to contribute to conceptualizing, designing, obtaining support for, conducting, and managing one or more of the following: (1) research projects or (2) development projects, particularly those for which scientific principles are applied to the creation of (1) tools to improve the efficiency or quality of the practice of test development or statistical analysis; (2) new item types; (3) the scoring of responses to open-ended items; (4) innovative assessment prototypes or products. Disseminate results and implications of projects.Generate or contribute to new or modified research methodology and analytic or interpretative procedures in the area of international large scale educational surveys of student and adult populations.Contribute to the work on design, analysis and reporting for these assessments including contributions to products or services for multi-national international organizations as well as clients at the national and international level.Assist in the development of proposals and project budgets for these assessment products.Assist in the design and conduct of studies that contribute to the science and practice of these assessments.Assist in the conduct of research studies by accomplishing directed tasks according to schedule and within budgetParticipate in dissemination activities through the publications of research papers in peer review journals and in the ETS Research Report series, the issuing of progress and technical reports, the presentation of seminars at major conferences and at ETS, or the use of other appropriate communication vehicles, including books and chapters, that impact practice in the field or at ETS.Develop professional relationships as a representative, consultant or advisor to external advisory and policy boards and councils, research organizations, educational institutions and educators. Required Experience:EDUCATIONA Ph.D. or Ed.D. in a quantitative psychology, educational measurement and statistics, or a related discipline is required.EXPERIENCEOne year of independent substantive research in quantitative psychology, educational statistics, or mathematical/statistical psychology is required.Knowledge in and experience with item response theory (IRT) modeling and analyzing data using statistical/psychometric techniques with software such as SPSS, SAS, STATA, R or MPLUS are required. Experience may be gained through doctoral studies.EDUCATIONAL TESTING SERVICE is an Equal Opportunity and Affirmative Action Employer of Women and Minorities.EDUCATIONAL TESTING SERVICE is an Equal Opportunity and Affirmative Action Employer of protected Veterans and Individuals with Disabilities.EDUCATIONAL TESTING SERVICE is a Drug-free workplace. Keyword: research, scientist, psychometrics, statistics, assessments, quantitative psychology, educational measurement and statistics  From: Educational Testing Service"}