{"jobID": "2818151403", "jobLocation": "San_Diego_CA", "jobTitle": "Staff Scientist", "companyRating": "4.3", "companyInfo": {"Website": "www.illumina.com", "Headquarters": "San Diego, CA", "Size": "5001 to 10000 employees", "Founded": " 1998", "Type": " Company - Public (ILMN) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Thermo Fisher Scientific, Roche"}, "estimatedSalary": "103000", "jobDescription": " Do you want to make a difference? Illuminas mission is to improve human health by unlocking the power of the genome. If that inspires you, lets talk. Weve built a culture fueled by innovation, collaboration and openness, and established ourselves as the global leader in DNA sequencing and array-based technologies. Our people and our technology change lives by driving advancements in life sciences, oncology, reproductive health, agriculture and other emerging markets. Life at Illumina is about working with teammates who are deeply passionate about what we do, because we know that our work has the power to improve lives. Were an established company with a track record of phenomenal growth. Just check out our investor events and presentations to learn about our financial accomplishments. Our growth isnt just in financials, weve been busy hiring the best and the brightest. Perhaps thats why MIT has ranked Illumina near the top of its Worlds Smartest Companies each of the last three years. If you thrive in a brilliant, fast-paced, and mission-driven environment, Illumina is the place for you. Join the journey of a lifetime. Join Illumina.Position Summary:Staff Scientist, New and Emerging Screening ApplicationsIllumina has seen unprecedented growth in direct-to-consumer (DTC) genomics space in the recent years, with an inflection point reached in 2017: Out of the 12 million samples processed to date, 7 million were processed in 2017. This role presents a rare opportunity to shape the future of applied genomics by joining a cross-functional team focusing on the next wave of product applications for population-scale screening in the rapidly growing applied genomics markets, such as consumer genomics and healthy human screening. As a Staff Scientist on the team, you will lead the technical evaluation activities as part of the product ideation process. This process will include technical deep-dives into new applications, driving proof of concept (POC) studies, understanding critical parameters that would impact definition of minimally viable products (MVP), internally and in collaboration with external partners. You will also serve as a liaison on product development projects stemming from the most successful ideas and will play an active role in defining product roadmaps.The role will require you to work in a highly matrixed setting, both within Illumina and with external collaborators. It is expected that you will have proficient interpersonal, verbal, and written communication skills in addition to having a quality-driven and results-oriented mindset. To be successful in this role, you will be the kind of person who enjoys getting out of your comfort zone; feeling equally comfortable interacting with R&D; and commercial teams, senior management, customers, and key opinion leaders (KOLs).What you will be responsible forPartner cross-functionally to define POC success and MVP design requirements, design experiments, drive design and technical reviews, recommend appropriate external development partners, and meet product development schedules in a fast-paced product development environment, for several concurrent projects.Lead focused matrixed teams of research associates, scientists and mechanical and software engineers from both collaborators and Illuminas staff to ensure a smooth handover of MVP and protocols to product development teams for turning them into commercial products.Serve as one of the key contributors to the product ideation process. Serve as a subject matter expert in idea reviews and strategic meetings.Perform data analysis; prepare brief reports and customer/collaborator facing project status updates.Make significant contributions to scientific literature, including white papers, application notes, and/or peer-reviewed publications.Manage goals within defined target timeframes and make decisions regarding the goals and progress of small project teams.Collaborate and communicate with various departments, including core R&D;, technology development, sales, marketing, operations, and finance.Perform resource and budget planning for POC and MVP activities.Solve complex technology and development challenges.What we are looking for:Highly motivated, curious individual with the proven ability to think innovatively toward solving problems in fast-paced research and/or product development environment.Flexible and open to new opportunities and changing priorities.6+ years of product development experience in the life science or medical diagnostics space.Advanced hands-on experience with genomics technologies, such as arrays, NGS, or hybridization technologies is required. Experience with multiple technologies is highly desired.Experience working in a similar role in at least one biotechnology or biomedical device company is required. Experience with multiple companies is highly desired.Experience with DNA and RNA based genomic assay and consumable development with control materials and inline and final QC metrics is required.Outstanding publication record, patent history, product launch history, or other evidence of scientific excellence and collaborations are required.Ability to rationally design experiments, perform data analysis for others, and have a demonstrated experience driving technical results-oriented decisions as the leader or part of a team is required.Excellent communication, presentation, and people leadership skills are required to drive both external collaborations and internal projects goals to timely completion.Knowledge of development operations processes and software, such as Confluence, JAMA, Microsoft Project is a plus.Ability to travel domestically and internationally up to 25% of the time is required.Strong connections with the academic, clinical, or biotechnology communities are highly desired.Statistical and scripting experience is a strong plus.Core team leadership/project management experience is a strong plus.General understanding of business and finance concepts is a plus.Location in San Diego headquarters is required.EducationPh.D. in applied molecular biology, genetics, genomics, or related field. Illumina believes that everyone has the ability to make an impact, and we are proud to be an equal opportunity employer committed to providing employment opportunity regardless of sex, race, creed, color, gender, religion, marital status, domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition, sexual orientation, pregnancy, military or veteran status, citizenship status, and genetic information. If you have a disability or special need that requires accommodation, please contact us at applications@illumina.com. To learn more, visit: https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf"}