{"jobID": "2794263239", "jobLocation": "San_Mateo_CA", "jobTitle": "Market Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.trinet.com", "Headquarters": "Dublin, CA", "Size": "1001 to 5000 employees", "Founded": " 1988", "Type": " Company - Public (TNET) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Paychex, Insperity, ADP"}, "estimatedSalary": "78000", "jobDescription": " TriNet is a leading provider of comprehensive human resources solutions for small to midsize businesses (SMBs). We enhance business productivity by enabling our clients to outsource their HR function to one strategic partner and allowing them to focus on operating and growing their core businesses. Our full-service HR solutions include features such as payroll processing, human capital consulting, employment law compliance and employee benefits, including health insurance, retirement plans and workers’ compensation insurance. TriNet has a nationwide presence and an experienced executive team. Our stock is publicly traded on the NYSE under the ticker symbol TNET. If you’re passionate about innovation and making an impact on the large SMB market, come join us as we power our clients’ business success with extraordinary HR. SummaryThe market data analyst gathers data and performs analysis to help TriNet understand the market opportunity and how to best market its products. The role requires a variety of methods to gather data on buyer demographics, preferences and purchasing patterns. The analyst also helps identify TriNet’s position in the market through competitive research. Responsibilities• Apply data analytics and forecasts to provide insights in areas such as market sizing, segmentation, product/market fit, competitive trends, client retention and LTV, marketing campaign ROI, etc.; explain and visualize analyses to internal stakeholders • Build reports and dashboards by collecting, analyzing and summarizing data in marketing and sales productivity, etc. • Design and implement market research programs to assess buyer journey, preferences and willingness-to-pay• Maintain the marketing database and monitor the integrity of the data reported• Partner with PR & Demand Generation to deliver thought leadership content (e.g. benefits benchmarking) based on data analytics Qualifications• Bachelor’s or master’s degree in a field that emphasizes analyzing, displaying, or reporting on data or 2+ years of equivalent work experience• Proficiency with Tableau or other data visualization tools.• Experience with data management, specifically with data collecting and validating from multiple sources• Comfortable with SQL and statistical concepts. Knowledge of SQL and R is a plus• Experience with Salesforce.com and Eloqua is a plus • Strong critical thinking and problem-solving • Effective communications skills• Detail-oriented• Proficiency with Microsoft Office (Excel, Word and PowerPoint)Please Note: TriNet reserves the right to change or modify job duties and assignments at any time. The above job description is not all encompassing. Position functions and qualifications may vary depending on business necessity.TriNet is an Equal Opportunity Employer and does not discriminate against applicants based on race, religion, color, disability, medical condition, legally protected genetic information, national origin, gender, sexual orientation, marital status, gender identity or expression, sex (including pregnancy, childbirth or related medical conditions), age, veteran status or other legally protected characteristics. Any applicant with a mental or physical disability who requires an accommodation during the application process should contact a company manager, a company officer or a TriNet HR representative to request such an accommodation."}