{"jobID": "2837223509", "jobLocation": "Pleasanton_CA", "jobTitle": "Sr. Data Informatics Analyst", "companyRating": null, "companyInfo": {"Website": "www.elliemae.com", "Headquarters": "Pleasanton, CA", "Size": "1001 to 5000 employees", "Founded": " 1997", "Type": " Company - Public (ELLI) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Ellie Mae (NYSE:ELLI) is the leading cloud-based platform provider for the mortgage finance industry. Ellie Maes technology solutions enable lenders to originate more loans, reduce origination costs, and reduce the time to close, all while ensuring the highest levels of compliance, quality and efficiency. Visit EllieMae.com to learn more.Responsible for meeting with business stakeholders, documenting user requirements and translating them into BI/DW solutions. Responsible for the delivery of the Business Intelligence solutions using Tableau, Talend, Python, SSIS and SQL Server 2008/2012. Design and develop ETL solutions using Talend/SSIS/Python. Responsible for design and development of enterprise data warehouse (EDW) solutions to be consumed across the organization. Participate in work stream planning process including inception, technical design, development, testing and delivery of BI (Business Intelligence) solutions. Initiate, design or modify highly complex ETL processes and procedures. Understand and apply industry practices, community standards in designing reporting/ETL solutions. Lead or provide direction for the planning, designing, and execution of Data Warehousing testing effort. Oversee the implementation (i.e., testing, issues resolution) of new enhancements or modifications to existing data warehouse solutions. Ensure that Reporting solution is easy to use and understand and meets the functional requirements. Design end to end Tableau reporting solutions as per the requirements provided by users.Require a Bachelor's degree in Computer Science, Engineering, Information Systems, Business, or a related field plus 5 years of experience. Must have 5 years of experience with all of the following: Tableau, SQL Server, Data warehousing (DW), Business Intelligence (BI), SSIS & ETL.40 hours/week. Must also have authority to work permanently in the U.S. Applicants who are interested in this position may apply at www.jobpostingtoday.com, Ref #38286.Ellie Mae is an Equal Opportunity/ Affirmative Action Employer. Minorities, Females, Disabled and Veterans are encouraged to apply.We do not accept resumes from headhunters, placement agencies, or other suppliers that have not signed a formal agreement with us."}