{"jobID": "2822327356", "jobLocation": "San_Francisco_CA", "jobTitle": "Front End Developer", "companyRating": null, "companyInfo": {"Website": "www.blockchain.com", "Headquarters": "London, United Kingdom", "Size": "51 to 200 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Coinbase, Circle"}, "estimatedSalary": null, "jobDescription": "Blockchain is the world's leading software platform for digital assets. Offering the largest production blockchain platform in the world, we share the passion to code, create, and ultimately build an open, accessible and fair financial future, one piece of software at a time. Blockchains development team is building technologies that are revolutionizing the financial services industry by empowering millions across the globe to authenticate and transact immediately and without costly intermediaries.  We are looking for a Front End Developer to join our growing development team in San Francisco, CA to rapidly create, iterate and launch high quality software that empower users all over the world. Ultimately, you should be able to adapt easily to meet the needs of our fast growth and the rapidly evolving crypto ecosystem.  Our development team is tackling some of the most interesting problems in the crypto space while rapidly and securely scaling a distributed platform that touches millions of people a day. We want you to join us! WHAT YOU WILL DO:Build beautiful user interfaces across our exciting product portfolio, working closely with our designers through to implementation to best serve the needs of current a future customers.Write well-tested, reliable code for use by millions of users who use our wallet.Proactively collaborate with team members, ensuring the sharing of knowledge and efficient division of labour.Work on the most interesting and challenging problems in the cryptocurrency space.Get exposure to the latest technologies and developments in a technology and product driven company.Work on an industry-leading product with millions of users.WHAT YOU WILL NEED:The foremost quality for this position or any position at Blockchain is integrity.At least 2-3 years experience working with JavaScript and client-side web applications preferred.You thrive on learning new technologies and dont believe in one-size-fits-all solutions. That being said, you can expect to work with ES6, Styled Components, and React/Redux.You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment.You rely on others' candid feedback for continuous improvement.You understand requirements beyond the written word and have a sharp eye.Strong analytical and problem solving skills.COMPENSATION & PERKS:Amazing and accessible office location in the heart of San Francisco.Unlimited vacation policy; work hard and take time when you need it.Apple equipment.Full-time salary based on experience and meaningful equity in an industry-leading company.Benefits: Medical, Dental, Vision, 401K, Flexible Spending Account, Commuter, Life, Short Term & Long Term Disability.APPLICATION:Resume and/or CV and LinkedIn profile.Link to Github or Stackoverflow.Personal websites or blogs (if applicable).Your favorite GIF."}