{"jobID": "2729777748", "jobLocation": "Irvine_CA", "jobTitle": "Data Scientist II", "companyRating": "3.2", "companyInfo": {"Website": "www.kbb.com", "Headquarters": "Irvine, CA", "Size": "201 to 500 employees", "Founded": " 1926", "Type": " Subsidiary or Business Segment", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Edmunds.com, TrueCar, Cars.com"}, "estimatedSalary": "106000", "jobDescription": "DescriptionThe Data Scientist anticipates future business needs and identifies opportunities for complex analysis.The Data Scientist, Lead will gather and analyze data to solve and address highly complex business problems and evaluate scenarios to make predictions on future outcomes and provide prescriptive solutions that support decision making.The Data Scientist will be involved in all phases of (Big Data) analytics projects including question formulation, research, development, implementation and testing. The Data Scientist will be able to explore and understand data and build advanced analytical models, then present and discuss the resulting models to any level of audience.The Data Scientist will design and drive the creation of new standards and best practices in the use of statistical data modeling, big data and optimization tools for Cox Automotive. Identify and direct special studies and analyses for unique business problems and scenarios. Proactively identify algorithms or products with high intellectual property content, assist in the evaluation of their potential for patents, where appropriate assist in the patent applications, and contribute to the intellectual property protection for Cox Automotive.QualificationsEducation RequirementsM.S, or Ph.D. in math, statistics, operations research, computer science engineering, econometrics, or other quantitative fieldRequired Experience and QualificationsMust have at least 3+ years of actual working experience performing advanced quantitative analyses.Advanced hands-on working knowledge of Python/SQL required.Working knowledge of SAS/R is preferred.Working knowledge of big data manipulation is plus.Ability to apply advanced statistical methodologies such as mixed model (random and fixed effects), simultaneous equations, ARIMA, neural networks, and multinomial discrete choice. Ability to apply mathematical operations to such tasks as cluster analytics, sampling theory and design of experiments, analysis of variance, correlation techniques, and factor analysis.Ability to apply advanced optimization methodologies such as linear and mixed integer optimization.Ability to apply advanced simulation modeling methodologies and techniques.Utilize complex computer operations (intermediate programming in 3rd and 4th generation languages, relational databases, and operating systems) and advanced features of software packages (word-processing, spreadsheet, graphics, etc.).Must have relational database experience.A strong passion for empirical research and for answering hard questions with dataAbout Cox Automotive Cox Automotive is transforming the way the world buys, sells and owns cars with industry-leading digital marketing, retail, financial and wholesale solutions for consumers, dealers, manufacturers and the overall automotive ecosystem worldwide. The Cox Automotive family includes Autotrader®, Dealer.com®, Dealertrack®, Kelley Blue Book®, Manheim®, NextGear Capital®, vAuto®, VinSolutions®, Xtime®, incadea®, and a host of other brands. With a complete and connected view of the automotive ecosystem, Cox Automotive is a global company connecting people, cars and capabilities with services that link the automotive value chain. Cox Automotive is a subsidiary of Cox Enterprises. For more information about Cox Automotive, visit www.coxautoinc.com.  Cox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individuals age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.Organization: Cox Automotive Primary Location: US-CA-Irvine-195 Technology Dr Employee Status: Regular Job Level: Individual Contributor Shift: Day Job Travel: Yes, 5 % of the Time Schedule: Full-time Unposting Date: Ongoing"}