{"jobID": "2804482207", "jobLocation": "Ann_Arbor_MI", "jobTitle": "Executive Leadership Development Program", "companyRating": "3.4", "companyInfo": {"Website": "www.dominos.com", "Headquarters": "Ann Arbor, MI", "Size": "10000+ employees", "Founded": " 1960", "Type": " Company - Public (DPZ) ", "Industry": " Restaurants, Bars & Food Services", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Pizza Hut, Papa John's, Little Caesar's"}, "estimatedSalary": "53000", "jobDescription": " Dominos, which began in 1960 as a single store location in Ypsilanti, MI, has had a lot to celebrate lately: were a reshaped, re-energized brand of honesty, transparency and accountability not to mention, great food! In the rise to becoming a true technology leader, the brand is now consistently one of the top five companies in online transactions and 60% of our sales in the U.S. are taken through digital channels. The brand continues to deliver the dream to local business owners, 90% of which started as delivery drivers and pizza makers in our stores. Thats just the tip of the icebergor as we might say, one slice of the pie! If this sounds like a brand youd like to be a part of, consider joining our team!The Leadership Development Program was established to prepare and develop our future strategic leaders. By providing operations, business and leadership training, we are preparing participants to lead and grow our business into the future. After learning our business model from the ground up, you will be uniquely prepared to move into any number of other roles in the company. Well work together to specifically select these roles to help you achieve your long-term career goals. The focus of the Program is to:Identify and select early-career, high-potential candidates who have the aspiration and aptitude to grow into future strategic leader roles as Directors and Vice PresidentsProvide participants with operations, business, and leadership training to prepare them to lead and grow our business Leadership Development participants will be fully integrated into the operations of Dominos. A company-sponsored relocation to one of our many markets will be required in conjunction with completion of our in-store experience. CORE MANAGEMENT ROTATIONS (2-3 Years):Acclimation Period, Ann Arbor, MI (2-3 months) Meet the executive team, complete various training requirements and learn company culture and objectives.Assistant Manager, Various U.S. Corporate Locations (3-6 months) In-store experience: Complete required training as you prepare to be a successful store GM.General Manager, Various U.S. Corporate Locations (6-9 months) In-store experience: Run your own store with full profit and loss responsibility. Build and motivate a winning team. Complete the MCO Training program.Manager of Corporate Operations, Various U.S. Corporate Locations - Manage multiple corporate stores (18-24 months) Transition from a single-store to multi-unit manager responsible for the success of four stores. Then drive business results in your eight-store area by training, developing and motivating your team.NEXT STEPS IN YOUR CAREER FUTURE After successful execution of these initial core rotations, you will have the opportunity to move to other important leadership roles throughout the company. Some examples of future career options you may consider might include, but are not limited to, opportunities in the International Division, Consulting, Business Development, Franchise Development and Operations, Supply Chain, Marketing, Training, and Franchising. SELECTION AND ELIGIBILITY We are very particular about who is chosen for the Leadership Development Program and the interview process is challenging. If you have an interest in this prestigious leadership development opportunity, and if you meet the qualifications listed below, we would like to invite you to apply. Bachelors Degree and minimum cumulative GPA of 3.0 on a 4.0 scaleCommit to relocation for assignments and future career opportunitiesLess than five years of professional work experience, excluding internships or positions held while attending collegeCommitment and passion to develop into a role model who will lead teams and make a direct impact on company successDemonstrated ability to lead and motivate otherAbility to effectively deal with difficult peopleCreative problem solving skills and quick thinking, practical, decision making skillsValid Driver's License"}