{"jobID": "2824829944", "jobLocation": "San_Antonio_TX", "jobTitle": "Junior-Mid Level Environmental Engineer/Scientist", "companyRating": null, "companyInfo": {"Website": "www.bbesound.com", "Headquarters": "Fullerton, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " BB&E; is a civil, environmental and energy engineering and consulting company, headquartered in Northville, Michigan, which services both the Federal and Industrial sectors throughout the United States. BB&E; team members specialize in civil and environmental engineers and professionals providing Environmental consulting, Facilities Engineering and Program/Project Management Services to Federal and private sectors.  BB&E; is an equal opportunity employer (EOE).  Please submit your resume/qualifications and salary requirements.  QUALIFICATIONS  Educational Level/Years of Experience: Three (3) to ten (10) years of experience and a BA/BS or MA/MS degree. Basic training in environmental restoration accomplished under the Resource Conservation & Recovery Act (RCRA) and the Comprehensive Environmental Response, Compensation and Liability Act (CERCLA).  Demonstrated performance of work in the following areas:  1). PBR/PBC experience with the Defense ERP.  2). Expertise in various phases of the Federal Acquisition Regulation (FAR) acquisition process, preferably related to PBR contracts.  3). Ability to organize and gather project data, conduct analysis, prepare reports and provide recommendations without assistance  4). Strong written and verbal communication skills.  5). Utilizing and applying computer software including Microsoft Office (Excel, Word, PowerPoint), MXT, EESOH-MIS  6). Pre-award/post-award experience with tracking and monitoring performance based contracts (PBCs).  7). Knowledge of state and federal environmental regulations, Defense Environmental Restoration Program (DERP) and FAR.  Security Requirement: US Citizenship and DoD government security clearance NACI"}