{"jobID": "2761616605", "jobLocation": "San_Francisco_CA", "jobTitle": "HR Data Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.cca.edu", "Headquarters": "Oakland, CA", "Size": "201 to 500 employees", "Founded": " 1907", "Type": " College / University", "Industry": " Education", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Academy of Art University"}, "estimatedSalary": "62000", "jobDescription": " The HR Analyst is a full-time staff position reporting to the HR Operations Manager. This position will support technical documentation, data management and conversion, state/academic/and regulatory reporting. The HR Analyst works closely with the college’s Administrative Information Systems team for data processing, internal and external reporting, and to support the needs of the HR department. As a main user of the HRIS system, the HR Analyst helps ensuring the integrity and accuracy of HR data, and often interfaces with the Payroll team. The HR Analyst further works to update HR materials and documents, so that employees have access to reliable and current HR information.MAIN RESPONSIBILITIES:Data Management – 40%This will require managing, reviewing, manipulating, and cleaning large and complex sets of data that are part of our student information system. Advanced spreadsheet skills, attention to detail, and a systematic and organized approach are essential to this function.Uses reports and conducts audits to help ensure the accuracy and integrity of HRIS data.Assist in the management of large, complex sets of data, including reviewing, cleaning, and manipulating data.Data preparation and conversion support, applying advanced spreadsheet skills such as data formatting, LOOKUP formulas, and IF functions.Maintain confidentiality of sensitive information.Ability to create, run, configure reports in Workday a plus.Technical Documentation – 30%Prepare and maintain detailed documentation of business processes, technical and functional system requirements.Applies advanced document management and analytical skills to maintain documentation that is clear, concise, complete, consistent and easily accessible.Documentation may utilize word processing, spreadsheets, or diagrams.Prepares system documentation, which may include screenshots, illustrations and clear step-by-step instructions.Maintains HR forms, user guides, booklets, and other information, ensuring they are updated in hardcopy and online to ensure employees have access to current information.Data Entry – 20%Processes staff changes, terminations, payment requests etc in the HRIS; and acquires the appropriate documentation for exceptions or activities that occur outside of the system when appropriate.Interfaces with Payroll on various items, including entries into the HR system, benefits invoice reconciliation, and other items as appropriate.System Testing – 10%The HR Analyst will assist in system testing by completing prescribed test scenarios in the system to ensure the system operates as expects. This includes documentation of issues, and potentially supporting other team members to complete the test scenarios. It will also include supporting others to complete test scenarios, including preparing for testing sessions, and reviewing and analyzing test results that are documented by others.Using prescribed test scenarios, execute system tests and document results.Maintain documentation that supports others in executing and documenting system testing.Analyze and assimilate test results from other users.Support preparation for system testing sessions, which may include scenario setup, instructions, preparing test response forms or scheduling sessions.Non-Essential Job DutiesPerforms additional duties as assigned.Back-up office support as needed.MINIMUM QUALIFICATIONS:Bachelors Degree and 2 years of experience in an HR department in a similar role, or an Associates Degree and 3 years of experienceStrong analytical skills with demonstrated proficiency in data retrieval and report writing, knowledge and or experience with an ERP/HRIS, Workday experience a plus!Experience developing detailed documentation, preferably technical in natureExperience working with detailed and complex data sets highly desiredAdvanced word processing and spreadsheet skills, in Google Drive preferredProficiency using a variety of productivity software strongly desiredExcellent organizational and analytical skillsExperience using diagrams, flowcharts or other visual documentation highly desiredExcellent interpersonal skills; ability to work independently as well as in a team environmentAbility to maintain confidentiality of sensitive informationExcellent written and oral communication skillsAbility to multitask and perform work efficiently in a fast-paced environment; ability to work under pressure of competing deadlinesExperience working in higher education a plusTimeliness, good attendance, and strong work ethic a must.LocationOaklandAdditional LocationsSan FranciscoApplication InstructionsApplicants are required to attach a cover letter and resume. Incomplete applications will not be considered. Recommended document file formats are Word or PDF. If there are multiple attachments, we recommend compressing/zipping your files into a zip format file. There is also a place in the application for you to provide a link to large documents. Please submit an application form for each position for which you believe you are qualified. Applications are not kept on file for future positions.Application DeadlineFor staff positions, screening begins immediately and continues until the position is filled.EEO StatementAs an educational and cultural institution, California College of the Arts has a responsibility to provide access and opportunities for all people, with special attention to supporting groups historically underrepresented in higher education.We believe that a culturally diverse campus is integral to academic excellence, and our student, faculty, staff, and trustee bodies should reflect the diverse world in which we live, with attention to race, ethnicity, religious creed, national origin, age, sex, sexual orientation, gender identity or expression, and ability.California College of the Arts is an equal opportunity employer and encourages applications from individuals who will contribute to its diversity.Questions?Please address any questions to hr@cca.edu."}