{"jobID": "2759425200", "jobLocation": "Cupertino_CA", "jobTitle": "Senior Software/Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "187000", "jobDescription": " Apple Maps is a data-driven organization confronted with the most challenging large-scale problems in the world. Our mission is to maintain a useful and accurate digital representation of the entire Globe. We ingest a staggering amount of data and wish to discover new ways to use that data to improve the customer experience of Apple Maps.  Data Engineering team collaborates with the data science team to productize and scale models that evaluate quality of maps data, and identify specific issues. In this role, you would enjoy working in a diverse technical team, where everyone learns from each other's unique skills and knowledge. Your bias for action means you thrive in an environment where you can get things done. We encourages and respects critical thinking. Challenge yourself, challenge the data, challenge us.  Key Qualifications: A track record of designing, implementing and delivering scalable, performant data pipelines and data services.Extensive experience in building solutions that scale out or scale up. Your multithreading experience and long range viewpoint on distributed systems mean you recognize when something is technically feasible, but a bad idea in the real world.Strong architecture and design background. You know which architecture, technology, and schema can make or break the success of a system.Strong analytical skills and experience with machine learning algorithmsYou rigorously demonstrate on best coding practices, while moving flexibly among technologies and programming languages.  Description: The successful candidate will join our Maps Data Evaluation team. Were responsible for leveraging statistical models and machine learning to identify hard-to-detect issues in Maps data.  You will develop batch and real-time data pipelines and data storage/management architectures.  You will design and implement workflows for data science to apply statistical testing on massive data.  You will work cross-functionally to drive platform architecture and design, analyzing data, and producing insights.  You will coordinate with data scientists to facilitate experimentation/prototyping.  You will scale and integrate the most effective models into critical systems that gate releases and protect our customer experience.  Education:  PhD or Masters in Computer Science, Mathematics, Statistics  Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants."}