{"jobID": "2832580627", "jobLocation": "Austin_TX", "jobTitle": "Clinical Research Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "86000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.  This position will work closely within the Neuromodulation clinical study team including the medical director, biostatistician, study management personnel, data management personnel, and other clinical study personnel. This position will also have significant interaction with executive leadership, physicians and regulatory authorities.  Main Responsibilities-  + Supervise the generation of study-related documents and/or contribute content and oversight of such documents, which may include, but are not limited to, reports of priors, investigational brochures, protocols, and case report forms  + Serve as an active member of study teams and provide scientific support to justify trial design and ongoing scientific analysis during protocol development. May include generation of pre-protocol documentation of scientific information  + Synthesize literature and competitive information for trial designs and results for assigned therapeutic area  + Review and critically analyze statistical analysis plans  + Lead study level publication planning  + Generate documents to support regulatory submissions for SJM products and/or respond to questions from regulatory authorities about existing submissions  + Lead publications for clinical study data through coordination with investigator authors and project management of reviews and revisions for abstracts and manuscripts  + Serve as lead reviewer for physician-initiated studies for assigned therapeutic area in Neuromodulation  Qualifications-  + Minimum qualification for this position is a Master?s degree in a relevant science  + At least 5 years of relevant work experience  + Experience conducting research in human subjects  + This position will work in a highly matrixed and geographically diverse business environment.  + This position requires strong verbal and written communication skills and interpersonal skills.  + This position also requires strong leadership skills as it will require significant interaction with executive leadership, physicians and regulatory authorities.  + This position will require some travel. Preferred Qualifications: + A Ph.D. in a relevant science is highly desirable  + Prior clinical research support in Medical Devices or Neuromodulation clinical trials  Qualifications-  + Minimum qualification for this position is a Master?s degree in a relevant science  + At least 5 years of relevant work experience  + This position will work in a highly matrixed and geographically diverse business environment.  + This position requires strong verbal and written communication skills and interpersonal skills.  + This position also requires strong leadership skills as it will require significant interaction with executive leadership, physicians and regulatory authorities.  + This position will require some travel. Preferred Qualifications: + A Ph.D. in a relevant science is highly desirable  + Prior clinical research support in Medical Devices or Neuromodulation clinical trials  An Equal Opportunity Employer  Abbot welcomes and encourages diversity in our workforce.  We provide reasonable accommodation to qualified individuals with disabilities.  To request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}