{"jobID": "2787505283", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Product Data Analyst", "companyRating": "4.2", "companyInfo": {"Website": "www.steelcase.com", "Headquarters": "Grand Rapids, MI", "Size": "10000+ employees", "Founded": " 1912", "Type": " Company - Public (SCS) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": "About Steelcase Inc. Inspired by over 100 years of insight, Steelcase leverages the power of place to offer a comprehensive portfolio of workplace, healthcare, and education products, furnishings and services to serve the world’s leading organizations. Founded in 1912, Steelcase is the global leader in enhancing how people work, heal, and learn.  We’re a globally-integrated organization with over 10,000 employees around the world. Our employees are our greatest asset, who showcase a strong commitment to integrity and doing the right thing for their customers, employees, business partners, associates, and neighbors.  We’re looking to hire a Product Data Analyst in Grand Rapids, MI.Position Description: Facilitate and coordinate the creation and maintenance of product data models for new and existing Steelcase Products as required by Marketing, Engineering, Sales, PIC, Sourcing, Manufacturing Operations, and Distribution. Design, Load, and Validate the data representation of these product models on the SAP product database in support of the product development, order fulfillment, life-cycle maintenance, customer service, specials, pricing, order planning and scheduling, inventory management and electronic catalog processes. Insure consistency between database and publications. The emphasis is on data integrity, providing efficient order specification, pricing, manufacturing and shipping for improved product profitability and dealer/customer satisfaction. Use PDM Product Data Analyst Technical Proficiency Components to analyze, conceptualize, organize, and load product information with a high degree of precision, accuracy, and speed within the Steelcase product database environment.Required Skills Ability to analyze, conceptualize, and logically organize database information with a high degree of precision and accuracy.Thorough knowledge of the techniques, methods and data standards employed to represent product information on the SAP product database, Electronic Catalog, and Specification Guides.Comprehensive understanding of SAP Variant Configuration methods and techniques as employed at Steelcase, Inc. including the ability to develop rules containing executable code.Thorough comprehension and knowledge of the business processes and systems which interact and utilize product information (Order Entry, Pricing, PIC, Manufacturing Operations, Distribution etc.)Thorough understanding of the Product Development Process, the departments involved and the associated information flow.Proficiency in the use of SAP, Excel, Access, and various Mass Loading Tools for Data Loading.Excellent problem solving skills and techniquesThe ability to read and understand various technical documentation (such as Statement Of Line, Engineering documents) and to make recommendations of their application as it relates to data and processes.Ability to communicate with a wide variety of internal and external groups, including managementProficiency in the use of Steelcase applications, Microsoft Office, including Microsoft AccessRequired ExperienceFour-year degree in a related field preferred. Steelcase provides employment opportunities to all qualified employees and applicants without regard to race, color, creed, genetic information, religion, national origin, gender, sexual orientation, gender identity and expression, age, disability, or veteran status and bases all employment decisions only on valid job requirements.Job Location  Grand Rapids, "}