{"jobID": "2806289544", "jobLocation": "Cranbury_NJ", "jobTitle": "Senior Scientist, Biophysical Characterization", "companyRating": null, "companyInfo": {"Website": "www.oncobiologics.com", "Headquarters": "Cranbury, NJ", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About the OrganizationMission Statement: Oncobiologics is a publicly traded biopharmaceutical company focused on the advancement of its pipeline of biosimilar products, two of which are currently in clinical development. Led by a team of biopharmaceutical experts, Oncobiologics operates from a state-of-the-art 40,000 sq. ft. fully-integrated R&D; and manufacturing facility in Cranbury, NJ. The company employs its BioSymphony development model to ensure that biosimilar assets meet the stringent requirements of U.S. and European regulators, while also achieving accelerated development and technical excellence in creating affordable medicines for global patients who so urgently need them.  Oncobiologics provides a scientifically disciplined and speed-to-market approach to biosimilar development. By leveraging its scientific talent and technical infrastructure, the company has established a unique CMC engine designed to provide scientific rigor, speed and cost efficiencies. Through these capabilities, Oncobiologics is uniquely positioned to deliver a robust CMC package as required by the FDA, EMA and other regulatory bodies. The company is executing a commercial strategy to advance its biosimilar assets to global markets.  Oncobiologics actively fosters a collaborative, entrepreneurial culture. With years of experience in large organizations, the Oncobiologics team understands the critical importance of agile, rapid decision-making and strives to infuse all activities with urgency, creativity and disciplined thinking. Key Facts: Founded January, 2011  Employees: ~64  Focused on the development of 'large molecules' (i.e., biologics) Description Opportunity and Summary of Position: Biophysical Characterization group is responsible for the development, qualification, validation and technical transfer of robust biophysical test methods for biosimilar monoclonal antibodies, and the sample testing to support biosimilarity assessment and formulation/process development. Methodologies include but are not limited to DSC, CD, FT-IR, HIAC, MFI, AUC, HPLC and mass spectrometry. She/he will be responsible for planning, execution, analysis, and reporting of experiments related to the development and characterization of biosimilars in all stages of development. Reporting Relationships: This position will report to the Director, Biophysical Characterization, Analytical Sciences Position Responsibilities:Take a lead in method development in secondary, tertiary structure characterization (DSC, CD, FT-IR), aggregation and particulates analysis (AUC, HIAC, MFI) and primary structure characterization (peptide mapping identity-UPLC, glycan profiles-UPLC, extinction coefficient, free thiol content, amino acid sequence, sequence variants, Intact mass, IdeS subunits, disulfide bond conformation and post-translational modifications)Lead the activities of method qualification and validation including preparation and review of protocols, SOPs and reportsLead the sample analysis for formulation development, process development, CQA assessment, similarity assessment, stability studies, and forced degradation studiesTake a lead for troubleshooting of analytical challenges when they ariseDevelop and implement innovative, value-added assays/platforms to support similarity assessmentProvide training to junior scientistsMaintain accurate and timely data records and documentation in both ELN and paper systemsOperate safely according to company requirements and take a lead in lab inspectionAuthor or participate in peer reviewed publication of scientific work as well as patent applications when appropriate Position Requirements Candidate Qualifications: The company is seeking an individual with the following qualifications and who is willing to make a long-term commitment to the organization:  Education/Certification  M.S. or Ph.D. in Analytical Chemistry, Pharmaceutical Sciences, Biochemistry or equivalent life science  Qualifications and Skills PhD with minimum 2 - 4 years of experience or MS with minimum of 6-8 years of experience in the pharmaceutical industry with antibody/protein characterization using various technologies for higher order structure characterization and aggregates/particulates analysis e.g. DSC, CD, FT-IR, HIAC, MFI and AUCExperience with biosimilar development is a plusIn-depth understanding of analytical method development, qualification, validationInternal expert on data interpretation, applications and instrumentation and the theory in protein higher order structureGood conceptual, analytical, problem solving, and organizational skills must be detail-oriented, well organized, and able to work independently and in teamsSupport the continuous improvement of data quality systems required for the stability testing and filingExcellent communication skills, both verbal and written, and the ability to interface effectively with functional groupsA âœhands-onâ energetic individual who enjoys challenges, a quick pace, and is capable and dedicated to getting the job doneWell-organized and accustomed to changing priorities and maintaining excellent records LocationOncobiologics EOE StatementWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability status, protected veteran status or any other characteristic protected by law.SDL2017"}