{"jobID": "2837707677", "jobLocation": "Palo_Alto_CA", "jobTitle": "Senior Scientist, Mass Spectrometry (Protein Sciences)", "companyRating": "3.7", "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "142000", "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Merck Research Laboratories is seeking to recruit an experienced Mass Spectrometry scientist with deep and broad experience in Biologics analytical characterization (including proteins, antibodies, bispecifics and multispecifics, various proteins scaffolds, ADCs) to join the Protein Sciences Department in Palo Alto, CA.  The position will be hands - on at the bench and will report to the mass spectrometry group leader.  Responsibilities:  Perform mass spectrometry analysis for biologics lead optimization, drug candidate selection and Protein Sciences core activities.  Develop and implement mass spectrometry methods to characterize molecules by intact mass and peptide mapping, including data analysis, report generation, and communication of results to stakeholder and teams.  Perform analytical routines for LC - MS systems maintenance, including calibration, system suitability, and troubleshooting.  Qualifications  Education Minimum Requirement:  B.S. degree with at least 6 years of relevant experience OR a M.S. with at least 4 years of relevant experience OR Ph.D in relevant area.  Required Experience and Skills:  Have knowledge and direct experience with state - of - the - art technologies and methods for mass spectrometry - based analytical characterization of proteins, antibodies, bi - specifics and multi - specifics, various proteins scaffolds, and / or ADCs.  Hands-on experience with Acquity / Waters QTOF, and high resolution Q - Exactive mass spectrometers platform;  Experience with software platforms for intact mass deconvolution and peptide mapping analysis, including, MaxEnt I and III, UNIFI, Proteome Discoverer, MASCOT, PEAKS, Skyline, and BioPharma Finder.  Attention to details and good understanding of protein structure, post-translational modifications and potential sequence liabilities (e.g., oxidation, deamidation, isomerization, clipping).  Preferred Experience and Skills:  Understanding and working knowledge of various analytical methods for protein characterization such as SEC, IEX, RP - HPLC.  Experience with glycosylation analysis (released glycans and glyco peptides) of biotherapeutics and proteins.  Excellent oral presentation and written communication skills"}