{"jobID": "2796220233", "jobLocation": "Chantilly_VA", "jobTitle": "Mission Data Analyst", "companyRating": "3.4", "companyInfo": {"Website": "www.engilitycorp.com", "Headquarters": "Chantilly, VA", "Size": "10000+ employees", "Founded": " 2012", "Type": " Company - Public (EGL) ", "Industry": " Business Services", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "About Engility: Engility delivers innovative solutions to critical challenges facing the nation and the world. As a premier provider of integrated services for the U.S. government, we support the Department of Defense, intelligence community, space communities, federal civilian agencies and international customers. Engility is dedicated to making lives better, safer and more secure. Description: Engility is seeking an experienced professional to join the Space and Missions Group (SMSG). SMSG provides specialized program management, engineering, analysis and operations support to a variety of Intelligence Community (IC) and Department of Defense (DoD) customers. We support the generation after next of national security-related systems based in space, in the air and on the ground.  SMSG has an opening for a Mission Data Analyst to provide systems engineering and technical advisory services to a Government Intelligence Community (IC) customer. The customer is developing the next-generation of space and ground systems architectures, hardware and software solutions.  Responsibilities include but are not limited to:  Conduct analysis of mission data and models from on-orbit payload demonstrations Develops new and/or integrates existing system simulation frameworks, performance models and algorithms, threat models and command and control models. Models operational environments, performs trade studies via computer simulation and provides decision support for alternative architectures. Performs operational analysis and mission effectiveness analysis. Assist the Government in developing operational concepts (CONOPS), mission threads, and approaches to employment of next-generation of space and ground systems Ensure research and development (R&D;) efforts are planned and conducted on a sound engineering basis including management of technical risks Provide technical support to customer activities and programmatic processes Develop documents and briefings to communicate work or study status, brief Government and industry as requiredQualifications: Bachelor degree in engineering, science, or related disciplines Minimum of 5 years of related experience with a Bachelor degree or at least 3 years of related experience with a Master degree Knowledge of how space and ground systems are designed, developed, and tested Effective customer engagement, interpersonal communications, writing, and briefing skills Demonstrated ability to work in a fast paced, dynamic, and energetic environment Working knowledge of MS Office applications, and modelling and simulation software Aptitude for on-site Systems Engineering and Technical Advisor (SETA) work Active TS/SCI with Poly is required to start.Desired Qualifications: Advanced degree in engineering, science, or related disciplines Experience in the design, development, and testing of space-based and ground-based systems and components Experience in developing component specifications, tolerances, simulations, and test procedures for space and ground systems and components Experience with Department of Defense (DoD) or the Intelligence Community (IC) R&D; organizationsEEO Statement: Engility Corporation is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action employer, making decisions without regard to race, color, religion, creed, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. U.S. citizenship is required for most positions. For our complete EEO/AA and Pay Transparency statements, please click here ."}