{"jobID": "2817298452", "jobLocation": "Sylmar_CA", "jobTitle": "Global Regulatory Operations Clinical Risk Management Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Abbott Park, IL", "Size": "10000+ employees", "Founded": " 1888", "Type": " Company - Public (ABT) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "80000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve. JOB DESCRIPTION: We are looking for a high caliber Global Regulatory Operations Clinical Risk Management Scientist to provide scientific expertise throughout product development related to management and alignment of risk information for Cardiac Rhythm Management (CRM) and/or Heart Failure (HF) management products. Writes and manages risk master lists, and interacts with various cross-functional teams in order to assist in strategy, plans, and project deliverables.  Core Job Responsibilities Responsible for compliance with applicable corporate and divisional policies and procedures. Ensures compliance to applicable regulations (ISO13485, ISO14155, ISO14791, MEDDEV 2.7.1, EU and FDA guidance documents) and DOPs.Develops and maintains Risk Master List DOP and associated documentation, provides input to cross-departmental SOPs and DOPs describing risk information processes. Develop templates taking into account all applicable regulations.Provide and implement innovative ideas and solutions to risk management group (e.g. database, LEAN projects), develop and roll out functional trainings as required.Independently creates and maintains Risk Master List for Abbott products. Maintains thorough knowledge of assigned products. Identifies appropriate sources of relevant data, interprets, evaluates and incorporates information from various sources including literature, clinical data, and medical references. Oversees CROs, actively manages timelines and project delays/risks, develops scenario's and recommendations for management.Leads risk alignment committee meetings (departmental multidisciplinary team), facilitates therapeutic team participation as appropriate, facilitates informed decision-making and dissemination of scientifically balanced and quality risk information regarding products. Ensures effective communication to clinical safety, clinical science, clinical internal and external operations, product performance, medical affairs, Clinical R&D;, Quality Engineering, regulatory affairs, product labelling, sr management, and external CROs or medical writers. Conducts team meetings, sends routing communications and/or presents regular updates to senior staff.Reviews IFUs, patient guides, RAMs, CEPs/CERs, IBs, study protocols, study ICFs, physician training materials, ensuring alignment of risk information. Involves in responses to complex costumer queries (e.g. regulatory authority, ethical committee, ) related to risk information. Reviews and gives input to Post-Marketing Surveillance Plans (PMS) and Post-Marketing Clinical Follow-up Plans (PMCF).Facilitates regulatory submissions and communications by communicating with Regulatory Affairs during the submission process.Participates in and supports audits. May actively participate in root cause analysis. May participate in root cause analysis, preventive or corrective actions, and effectiveness monitoring, as requested by managementActs as a mentor to less-experienced staff Accountability / Scope / Budget Reports to Sr Manager Global Regulatory Operations Clinical Risk ManagementUnderstands business environment and relates extensive knowledge of internal and external activities to trends.May lead a project team. Provides technical leadership to business unit, and oversees and directs external CROs and medical writers. Interfaces with senior management on significant matters, often requiring the coordination of activity across organizational units.Acts as a mentor to less-experienced staff and may provide work direction or supervise other technical employees. Participates in the development of other technical contributors by facilitating training and providing feedback and guidance.Exercises judgment independently. Plans and organizes project assignments of substantial variety and complexity. Erroneous decisions or recommendations would typically result in failure to achieve major organizational objectives.Will perform this job in a quality system environment. Minimum Education and Experience Advanced biomedical degree, e.g. MD, PhD, Pharm D. Must be familiar with medical conditions. MD preferred.Experience in clinical research and/or risk surveillance and management and/or clinical evaluation plans and reports and/or labelling and/or company core datasheets (medical devices or equivalent in pharmaceuticals). The minimum number of combined years of experience must equal 5.Experience in cardiac rhythm management or heart failure therapeutic areas is desiredKnowledge of EU MDD/MDR, FDA medical device regulations, ISO13485, ISO14791, ISO14155, MEDDEV 2.7.1 Rev 4 (or equivalents in pharmaceuticals)Needs to have worked in a quality environment beforeGood literature evaluation skills, ability to critically evaluate medical data. Able to independently write routine technical documents, and perform independent analyses. Works on complex problems where analysis of situations or data requires an in-depth evaluation of various factors. Exercises judgment within broadly defined practices and policies in selecting methods, techniques and evaluation criteria for obtaining results.Must have solid clinical understanding of disease state and the implications of treatment as it relates to the patient.Proven written and verbal communication skills in a team setting and/or informal leadership role.Uses in-depth knowledge of business unit functions and cross group dependencies/ relationships. Is recognized as an expert in work group and across functions. Knowledge of functional areas involved in risk IFUs, patient guides, RAMs, CEPs/CERs, IBs, study protocols, study ICFs, physician training materials.Will perform this job in a quality system environment. Failure to adequately perform tasks can result in noncompliance with governmental regulations. JOB FAMILY:Clinical Affairs / Statistics  DIVISION:AVD Vascular  LOCATION:United States>Sylmar : 15900 Valley View Court  ADDITIONAL LOCATIONS:United States>Minnesota : 5050 Nathan Lane N., United States>Santa Clara : Building A - SC Floor-2  WORK SHIFT:Standard  TRAVEL:Yes, 15 % of the Time  MEDICAL SURVEILLANCE:No  SIGNIFICANT WORK ACTIVITIES:Continuous sitting for prolonged periods (more than 2 consecutive hours in an 8 hour day)  Abbott is an Equal Opportunity Employer of Minorities/Women/Individuals with Disabilities/Protected Veterans.  EEO is the Law link - English: http://webstorage.abbott.com/common/External/EEO_English.pdf  EEO is the Law link - Espanol: http://webstorage.abbott.com/common/External/EEO_Spanish.pdf"}