{"jobID": "2791798061", "jobLocation": "Somerville_NJ", "jobTitle": "Scientist III, Quality Control", "companyRating": null, "companyInfo": {"Website": "www.amneal.com", "Headquarters": "Bridgewater, NJ", "Size": "1001 to 5000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Merck, Bayer"}, "estimatedSalary": null, "jobDescription": "Description:The Scientist III - Quality Control is responsible to perform testing of raw materials, in-process and finished pharmaceutical dosage forms, products on stability, cleaning verification samples following written procedures and applicable SOPs, calculate and report results on applicable specification documents, participate in method transfer activities within departments or between facilities or organizations. This role will also provide feedback on systems and analytical procedures to promote continuous improvement and enhancement of compliance posture.1st Shift: Monday through Friday 8:00 am to 4:30 pmEssential Functions:Perform physical and chemical analysis of raw materials, in-process, and finished pharmaceutical products, including products on stability, according to written methods, material specification, and company policies as identified in standard operating procedures (SOPs). Comply with cGMps, SOPs, and STPs to avoid out-of-specification situation. Assure compliance with state and federal regulations.Actively participate in any project work as and when assigned. Perform process validation and cleaning validation/verification testing on various drugs. Assist other scientists with analytical, instrument and software related problems as required. Use sonic sifter, laser diffraction, Karl Fischer, UV-Vis spectrophotometer, Infra-red spectrophotometer, HPLC with UV detection as well as with conductivity detection, TLC, pH meter, and dissolution. Calibrate HPLC, Dissolution apparatus equipped with auto-sampler and /or in-line UV, pH meters, analytical balances, and Karl-Fischer titrator.Document steps followed during analysis execution, calculate and report results. Actively participate in investigation of laboratory results.Review laboratory analysis data for completeness, specification compliance, and compliance with company’s written policies.Report any abnormal findings to the Supervisor. As assigned, perform in-depth review of analytical records/reports to assure that calculations and other data are technically correct and compliant to relevant specifications.Additional Responsibilities:Assist the laboratory supervisor with handling non-routine special projects requiring activities such as out-of-specification investigations and out-of-alert limit investigations in the laboratory.Ensure that expired chemicals and reference standards are removed from laboratory area.Perform calibration of HPLC, GC, and other equipment as assigned by the supervisor.Assist with hands-on training of newly hired Technicians or Scientists 1 and 2 levels.Education:Bachelors Degree (BA/BS) Chemistry or related science discipline - RequiredExperience:Must have 5 years or more of testing of pharmaceutical productsSkills:Must be precise and consistent in day to day analysis, easily trainable and ready to learn. - AdvancedMust be able to work in a team environment and be flexible to easily adapt to changes in assignments. - AdvancedMust be able to execute compendial procedures involving complexity with no or minimal supervision. - IntermediateMust be able to effectively communicate results, problems or issues, verbally as well as in writing. - IntermediateMust be able to assume a role of a leader in team environment as and when required. - IntermediateMust be computer literate and savvy with MS office applications, software programs related to LIMS. - IntermediateMust be willing to work extended hours, including weekends, as and when required. - IntermediateMust follow safe practices as identified in appropriate MSDS during working with chemicals, and must follow applicable state and federal regulations. - AdvancedMust be capable of maintaining clear and concise laboratory records and communicating clearly both within and between departments. - AdvancedMust be thoroughly familiar with cGMP applicable to laboratories in pharmaceutical settings and with method verification/validation concepts. - AdvancedMust be able to review laboratory records to ascertain compliance with applicable specifications, methods, and SOPs. - IntermediateSpecialized Knowledge:Must possess in-depth knowledge of analytical chemistry techniques, such as spectrophotometric, dissolution and drug release, chromatographic techniques (standalone or hypenated) and measuring physical parameters (viscosity, particle size or droplet size by laser diffraction, melting point by DSC, water content by TGA, identification by XRPD, and other techniques).Must be able to follow compendial (USP/EP/BP/JP) procedures for analysis.Must understand and apply cGMP requirements applicable to quality control laboratory.Must have ability to apply advanced technical skills to troubleshoot and resolve complex analytical and instrument-related problems effectively and in a timely manner and report actions to the laboratory management in a timely manner.Must be able to identify trends in analytical data."}