{"jobID": "2767010395", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.airmap.com", "Headquarters": "Santa Monica, CA", "Size": "1 to 50 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Senior Data EngineerAirMap is looking for a Senior Data Engineer to join our team and help build, test, and continually improve AirMaps distributed, dynamic geospatial database and APIs that allow drones to connect with the data. This hands-on position is an opportunity to serve as the technical lead for our data engineering group, while also individually contributing to all aspects of the software process: including architecture, specification reviews, automated testing, implementation, code reviews, debugging, and documentation.Whats it like to work at AirMap?AirMap is the worlds leading airspace services platform for unmanned aircraft. Developed by experts in technology, aviation, and policy, AirMaps family of APIs and SDKs are used by nearly 80% of the worlds drones to exchange dynamic information, creating a safe and efficient environment in low-altitude airspace.Based in our Santa Monica office, you will work closely with a small, nimble, globally distributed cross-functional team of platform architects and software engineers passionate about the challenges of contextual airspace and delivering the future of unmanned flight.AirMap has offices in Santa Monica and Berlin with employees across the globe. We value thoughtful discussion and knowledge-sharing among a diverse set of peers and colleagues and are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status.You may be a good fit if some of the following describe you:Youve been employed as a software engineer for 7+ years,You have a solid grounding in Computer Science fundamentals, data structures, algorithms, and a deftness at object-oriented design and systems architecture.You have an expert-level understanding in one or more of the following programming languages: Go, Python, JavaScript, C++, Java, or Scala.You have a deep understanding of SQL, and you know how to build quick and reliable distributed databases, taking large data pipelines from heterogeneous sources and turning them into homogenous and useful information.You are familiar with geographic information systems and tools (e.g. ArcGIS, QGIS, PostGIS), and OGC standards.You're experienced with container technologies and have experience building distributed applications and microservices with tools like Docker and Kubernetes.You understand the most popular solutions offered by cloud providers like AWS, Azure, or Google Cloud, and know when to use which tool for the job (and when to build your own).You maintain a nuanced understanding of the tradeoffs in technical decisions, and have the ability to make pragmatic, well-reasoned recommendations in the face of risk and uncertainty.You enjoy communicating complex technical issues to cross-functional teams and seek to engage in a culture of curiosity and healthy debate.Bonus points if:You like aviation and drones! You have experience with mapping technologies and handling geospatial data.Youre familiar with mapping technologies (e.g. Mapbox, Google, Apple Maps), and data visualization tools (e.g., D3.js).You understand machine learning, data mining, and data science.You have experience working with large data sets and distributed computing tools (MapReduce, Hadoop, Hive, Spark, CockroachDB, Cassandra, or similar development platforms).AirMap provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, gender identity, national origin, age, sexual orientation, disability, parental or pregnancy status, veteran status or genetics.In addition to federal law requirements, AirMap complies with applicable state and local laws governing nondiscrimination in employment in every location in which AirMap has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training."}