{"jobID": "2821555643", "jobLocation": "Chicago_IL", "jobTitle": "Senior Scientist III, Chemical Engineer", "companyRating": null, "companyInfo": {"Website": "www.smithhanley.com", "Headquarters": "New York, 061", "Size": "1 to 50 employees", "Founded": " 1980", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Kforce, PageGroup, Robert Half"}, "estimatedSalary": null, "jobDescription": " Senior Scientist III, Chemical EngineerLocation: Chicago, ILIndustry: Pharmaceutical / Biotech - R&D;Overview:The Process Research and Development organization department invents synthetic processes to prepare active pharmaceutical ingredients (APIs) to enable the development of our pipeline, and ultimately to provide commercial manufacturing processes.We are seeking a highly motivated individual with a proven track record of accomplishment to join the API Pilot Plant Technical Operations (Tech Ops) group. This position will serve as a liaison between the Process Research and Development scientific functions and the API Pilot Plant organization. The successful candidate will assist in the optimization and scale-up of synthetic processes and facilitate the implementation of the processes and new technologies in to the API Pilot Plant. The Scientist will also provide technical oversight during production campaigns and will support technical transfer to the ultimate commercial manufacturing site.Responsibilities:\"Management of processes entering the API Pilot Plant, including scheduling, equipment selection, materials tracking, authoring direction sets, obtaining safety analyses, and executing pre-runs.\"Technical oversight of processes running in the API Pilot Plant, and responsibility for process-trouble shooting in collaboration with the project teams.\"Serves as primary point of contact between API Pilot Plant, project teams, Quality Assurance, and Environmental Health and Safety.\"Responsible for review and documentation of data for cGMP execution of chemical processes. Authors campaign summary reports.\"Identify, evaluate and implement new technologies for the pilot plant and/or identify opportunities to modify or leverage existing assets to enhance operational efficiency. Examples include automation, flow chemistry, novel separation, Process Analytical Technology (PAT) feedback control and drying technologies.\"Support the implementation of PAT. Assist with equipment specification, setup, data collection and analysis.\"Interface with project teams to ensure that processes are safe and operable.\"Partner with API development teams to optimize processes for scale-up. Identify appropriate equipment and configurations.\"Assist with technology transfer of late stage processes to commercial sites, including process fit, identification of equipment needs, and facility modifications.Basic Qualifications:\"BS, MS, PhD in Chemical Engineering with 14+ (BS), 12+ (MS), or 6+ (PhD) years of experience\"3 Years (minimum) in drug substance development \"Understanding of cGMP, process safety requirements, and OSHA chemical hygiene plans.\"Working Knowledge of analytical techniques such as HPLC, GC, NMR, and microscopy\"Experience with Process Analytical TechnologyPreferred:\"Experience with laboratory experiments, process scale-up from lab to pilot plant and/or transferring a process from pilot plant to a commercial facility.\"Experience working in an API Plant environment. Familiarity with operation of chemical process equipment and systems.\"Strong technical background in chemical processing unit operations including reactions, crystallization, distillation, extraction, membrane separation, chromatography, centrifugation, filtration, drying and milling.Details:Competitive Base SalaryFull-time BenefitsRelocation Assistance AvailableInterview Travel Reimbursed7+ to 10 years of experienceManagement Experience Not RequiredMinimum Education - Bachelor's DegreeVisa Candidates Considered"}