{"jobID": "2837812601", "jobLocation": "San_Diego_CA", "jobTitle": "Data Engineer", "companyRating": "4.0", "companyInfo": {"Website": "www.viasat.com", "Headquarters": "Carlsbad, CA", "Size": "1001 to 5000 employees", "Founded": " 1986", "Type": " Company - Public (VSAT) ", "Industry": " Telecommunications", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Harris, Gogo, Inmarsat"}, "estimatedSalary": "101000", "jobDescription": " ViaSat designs, builds, and operates high-capacity satellite networks - bringing broadband Internet access to the world.  Our Team  We employ the latest technologies (Spark, Kafka, Impala, Hadoop) to analyze the Petabytes of data our operational systems produce. We employ developers, data scientists, and engineers to gain insight; solving both business and technical problems. Our innovative solutions are a result of the diversity of our team.  Your Opportunity  As a team member, you'll build a breadth of knowledge including software development, distributed systems, machine learning, and data science. You will design, develop, and deploy systems to solve analytics questions across multiple business areas and disciplines.  Our Ideal Candidate  We value curiosity, learning, and adaptability. Our ideal candidate loves solving tough problems using data.  In this position, you will: Design and build big data collection & storage systems Design and build analytic tools RequirementsAt a minimum, we are looking for people with the following skills: A BS in Computer Science, Computer Engineering, Software Engineering, Electrical Engineering, Math, Physics or related field Familiar with several languages, including Python, Java, Scala, C/C++ Familiar with any scripting language (Python, Ruby, BASH, etc) Familiar with Linux environment and common tools Experienced designing highly scaled systems Preferences  You'll be especially competitive if you have any of:  Experience with Hadoop, map/reduce, Spark, Kafka, Impala, or other big data technologies Familiarity with RDBMS technologies (PostgreSQL, MySQL, Oracle, etc.) Understanding of distributed and parallel computing architectures Experience with modern DevOps toolchains, including Ansible Built highly-available, API-driven web services before (Node.js, Angular.js, d3) 2 to 3+ years of development experience How to Apply: Follow the link below.  Alternatively, send an email Sean Berger for an initial, confidential discussion."}