{"jobID": "2771160481", "jobLocation": "Chicago_IL", "jobTitle": "Manager of Clinical Data Analytics", "companyRating": "3.3", "companyInfo": {"Website": "www.tempus.com", "Headquarters": "Chicago, IL", "Size": "51 to 200 employees", "Founded": " 2015", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " Passionate about making a difference in the world of cancer genomics?  With the advent of genomic sequencing, we can finally understand our genetic makeup. We now have more data than ever before but providers don't have the infrastructure or expertise to make sense of said data. Here at Tempus, we are building the infrastructure to modernize cancer treatment. By analyzing a patients genetic data in the context of molecular therapies, Tempus empowers physicians to make real-time data-driven decisions in clinic based on the comprehensive computational analysis of a patients unique pathology.  We're on a mission to connect an entire ecosystem to redefine how genomic data is used in clinical settings. We're looking for managers who are passionate about changing the status quo and bringing cancer care into the 21st century.  What youll do:  At Tempus, were building the largest library of oncology clinical data in the world. As the Manager of Clinical Data Analytics, youll be responsible for setting the standards and authoring the rules that align our key clinical data inputs to our proprietary Tempus data model. Youll be leading efforts to ingest oncology data from hundreds of different sources, normalize it to a common set of standards and push forward our thinking on ways to maximize the analyses and insights that can be generated from the data.  Responsibilities: Manage clinical standards of proprietary Tempus data model, in collaboration with Head of Clinical Data Solutions and other domain experts within the organizationLiaise with informatics, software engineers, data scientists, and Tempus clinical leadership to ensure solutions and standards are implemented efficiently and accuratelySolve complex clinical data challenges by building custom datasets and ensuring accuracy of standardization and normalization processes Qualifications/Skills: Proficient in SQL and familiarity with data warehousing solutions (i.e. Amazon Redshift)Exposure to clinical informaticsKnowledge of cancer types including classification by morphology codeCancer staging schemes"}