{"jobID": "2829035905", "jobLocation": "San_Francisco_CA", "jobTitle": "Ad Tech Data Quality Engineer", "companyRating": "4.4", "companyInfo": {"Website": "www.demandbase.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2007", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Engagio, Marketo, Evergage"}, "estimatedSalary": "101000", "jobDescription": " Demandbase, a leading SaaS-based B2B marketing technology company and San Francisco Business Times #5 Best Places to Work, is looking for more inspired and driven people to join us in our downtown San Francisco office. With a roster of dedicated, blue-chip customers thats growing every single day, were in a phase of tremendous growth and establishing the team that will take us to the next level. As a company, were as committed to growing careers as we are to building extraordinary B2B marketing technology, all while enjoying an unparalleled work-life balance. If you love innovating and collaborating with highly intelligent, motivated people who are also pretty fun to hang out with, youre probably a good fit for us.  The Ad Tech Data Quality Engineer will own all aspects of data quality testing including design, implementation, integration, maintenance and production deployment of test automation, scripts and test-suites associated with the Demandbase Ad Tech product line. You will be responsible for building and enhancing highly visible and scalable test frameworks that use all the modern framework paradigms, techniques and tools in order to assure robust data quality.  You should possess proven analytical, design, and problem diagnosis skills. You like thinking outside the box, are not afraid of ambiguity, get excited about difficult challenges, and are a go-getter. You are a strong team player and thrive in a startup environment where flexibility is essential and delivering rock solid, customer focused solutions is paramount. What youll be doingYou will provide core capabilities that will be used to build rich data testing frameworks. You will be an evangelist for data quality and provide guidance and expertise in your area.Use large scale distributed systems or data platforms including Spark, Flink, Dataflow, BigQuery, BigTable, etc.Work alongside our most senior engineers and data scientists to help us build and maintain a massively scalable data testing framework to deliver software in an iterative, continual-release environment..Learn and contribute to the communities creating technologies we use.What were looking forBachelors Degree in Computer Science or equivalent3+ years prior experience in data engineering, big data automation testing or data quality analysisExperience building data testing automation frameworks and scripts based on requirementsExperience writing intermediate to advanced queries in databases like BigQuery, Postgres, MySQL or Oracle DBs.Effective written skills and the ability to document automation and test harnessesExcellent communication skills and the ability to work productively in a teamExperience working with Linux/Unix based web and application serversHands on experience working with source control tools, preferably GitStrong knowledge of infrastructures such as Amazon Web Services or Google ComputeHighly Desired: Experience with products that use big data, machine learning or AI ; Experience working with terabyte level, real-time datasets; Knowledge of statistics and its application toward testing big dataBonus: Experience with performance, load and stress testing; Experience in the Advertising Technology space (DSPs, Ad Exchanges)Why join us?Be part of a rapidly-growing, pre-IPO companyOpportunity to extend our ABM leadership position and fast-track innovation behind AI-powered Account-Based Marketing solutionsDrive the next generation of intelligent CRM technologies and invent how Artificial Intelligence, product design, and applications convergeWork with a best-in-class team of engineers, PMs, data scientists, sales and marketersHave the flexibility of a start up with the security of a sizable, well-funded organization (we recently closed a $65M round of funding)About Demandbase: The Demandbase B2B Marketing Cloud is a comprehensive set of marketing solutions that are transforming the way companies market and sell to other businesses. Demandbase is powered by patented technology that makes it possible to deliver personalized ads to people at specific companies across the web and tailor the website message to engage and convert these companies to customers. It easily connects into existing technologies including CRM, CMS, and marketing automation, analytics, chat and others so marketing leaders get a comprehensive view of the performance of their marketing programs- from awareness through pipeline and closed revenue. Leaders at fast-growing companies such as Adobe, Box, CSC, DocuSign, Dell and others use Demandbase to drive better B2B marketing performance. For more information, visit http://www.demandbase.com. Benefits: Our benefits include 100% paid for Medical, Dental and Vision for you and your entire family, short-term/long-term disability, life insurance, 401k, flexible vacation, commuter benefits, snacks, catered lunch every Friday, Pinot Noir Fridays, chair massage, weekly yoga and much more!"}