{"jobID": "2821088436", "jobLocation": "Dallas_TX", "jobTitle": "Compliance Data Analyst II", "companyRating": "2.6", "companyInfo": {"Website": "www.santanderconsumerusa.com", "Headquarters": "Dallas, TX", "Size": "5001 to 10000 employees", "Founded": " 1995", "Type": " Company - Public (SC) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Ally Financial, Exeter Finance, GM Financial"}, "estimatedSalary": "66000", "jobDescription": "Summary of Responsibilities: Compliance Data Analysts are responsible for performing analytical research in support of the Compliance department. This includes the design, development, and implementation of information-based business solutions. Compliance Data Analyst will work closely with all compliance groups and other departments to ensure complete, consistent and accurate information is captured and reported in order to support the monitoring, measurement, and mitigation of compliance risk. . Essential Functions:Responsible for production of compliance MIS, ad-hoc analysis and KPIs/KRIs and performs analysis of the underlying data and highlights trends, issues and findings.Performs comprehensive analysis of complex issues and organizational needs to identify areas of improvement and program efficiencies.Supports technology implementation initiatives order to enhance the Consumer Compliance data repositories, reporting, analytics and overall program.Responsible for documentation of Compliance risk metrics and monitoring toolsExtracts, analyzes, and interprets data using SQL and applied statistical techniques to assist Compliance Department team and relevant business units with actionable intelligence on compliance risk.Reviews data elements used in reports to identify issues and propose remediation.Work with the business data stewards to capture business rules and provide data quality requirements.Provides requisite information in support of independent audit activities.Develops a thorough understanding of the firms operations, business practices, compliance monitoring and testing activities, and production systems.Other Functions:Special projects as requested.Performs other duties as assigned.Requirements:Bachelors degree in a related field, or equivalent combination of education and experience, required.Two (2) Four (4) years of progressively responsible experience in Reporting or Data Analysis required.Demonstrated ability to merge, concatenate, clean, and prepare extremely large datasets from multiple relational databases using SQL and ETL (Extract, Transform, and Load) tools.Experience working within MIS/reporting, risk management and data management functions.Strong working knowledge of MS Office Suite including MS Project.Analytical, technical and problem solving skills, with strong attention to detail. Strong written and verbal presentation skills and ability to communicate well with senior management with minimal guidance.Strong collaboration, and time management skills.Ability to adapt to various work environments and project schedules.Ability to work effectively in a team environment with all levels of personnel.Strategic and tactical thinker with ability to multitask and prioritize.Preferences:Prior experience in a similar data analyst role preferred.Additional knowledge of SAS and R preferred.Working Conditions: The working conditions described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Extended working hours may be required as dictated by management and business needs.Travel to multiple facilities may be required.May be required to lift, push, or pull materials weighing up to twenty (20) pounds.May be required to sit and review information on a computer screen for long periods of time.May require repetitive motions of the hands and wrist related to writing and typing at an electronic keyboard.May be required to sit and review information on a computer screen for long periods of time.May require repetitive motions of the hands and wrist related to writing and typing at an electronic keyboard.Employers Rights: This job description does not list all the duties of the job. You may be asked by your supervisors or managers to perform other duties. You will be evaluated in part based upon your performance of the tasks listed in this job description.  The employer has the right to revise this job description at any time. This job description is not a contract for employment, and either you or the employer may terminate employment at any time, for any reason."}