{"jobID": "2823233726", "jobLocation": "Washington_DC", "jobTitle": "Data Scientist Data Quality and Fraud Analytics", "companyRating": "4.8", "companyInfo": {"Website": "www.erpi.net", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": "96000", "jobDescription": "ERPi is currently seeking a fulltime Data Quality and Fraud Analyst to provide onsite support at our Washington, DC site.The Role: ERPi is experiencing a period of tremendous growth, including the expansion of its core service offerings into the areas of data science, fraud prevention, and analytics. We are seeking candidates who combine a consulting background with expertise in data science, fraud prevention, or analytics to help build an analytics capability for the firm, as well as deliver associated services to clients in the Federal government. Within the Department of Veterans Affairs (VA), the Veterans Benefits Administration (VBA) is transforming its ability to serve Veterans, including the creation and stand-up of a new program and analytical capability to a) detect and prevent benefits fraud/waste/abuse, and b) address recurring data quality issues. VBA manages over $90B annually in benefits. In support of this effort, ERPi is looking for qualified Data Scientists with expertise in data quality and/or fraud/waste/abuse identification and prevention to:Design and develop data mining, data science tools, and models to predict and prevent fraudulent activity against Veterans, identify waste, and prevent abuse of taxpayer dollarsCreate machine learning, data mining, and statistical and graph-based algorithms via technologies like R and Python to provide real-time fraud/waste/abuse monitoring capabilitiesSupport efforts to improve the policies, procedures, and tools the agency has at its disposal to prevent fraud/waste/abuse and improve data qualityDesign and develop analytic algorithms and techniques in support of robotic processing automation, machine learning, and/or other forms of artificial intelligenceReviewing application and enterprise data models (conceptual, logical, physical) to identify data quality problems;Configuring test and training data sets for use by team members;Analyzing VBA and external databases to identify data quality issues, identify fraud indicators, potential patterns of fraud/waste/abuse, identify vulnerable veterans, verify victims of fraudPerforming root cause analysis to determine the cause of identified issuesWorking with VBA system owners to identify needed changes (i.e. technical, process, policy, etc.) to prevent future recurrence of identified issuesAssisting in standing up and running a VBA data quality and fraud prevention governance programsFacilitating working sessions to understand the data quality and fraud/waste/abuse issues affecting VBAGuiding development of data quality algorithms, tools, models, and new processes to improve operational efficiency and make the VBA environment hostile to fraudDeveloping white papers, analyses, and position papers either describing/reviewing /analyzing specific issues, or providing justification or support for recommendations to affect change within VBACreating briefings with impactful visualizations to share with leadership on indicators of data quality and fraud/waste/abuse issuesRequired Skills and Experience:BA/BS Degree in a quantitative discipline5+ years of relevant experienceExperience using analytical tools, such as R/R Studio, Python, SAS, SQL, or advanced data quality/fraud analysis toolkitsGood analytical skills with a focus on critical thinking, problem-solving, numeric reasoning, and creativityFamiliarity with transaction, OLAP, and data warehouse data modelsExperience with data standardization and data governance processesDemonstrated strong communication and presentation skills (particularly to non-technical audiences)Good team player, able to manage multiple assignments, and adapt to changing client needsAbility to work in a dynamic, collaborative, results-driven environmentAbility to obtain a NACI clearanceDesired Skills and Experience:MA/MS in related field (Data Science, Operations Research, Statistics, Applied Mathematics, etc.) preferredExperience designing and developing analytic algorithms and techniques in support of robotic processing automation, machine learning, and/or other forms of artificial intelligenceExperience working with Veterans Affairs (VA), Veterans Benefits Administration (VBA), and/or Veterans Health Administration (VHA) preferredExperience working with data quality, fraud detection/prevention, and business improvement initiatives preferredExperience using data visualization tools such as Power BI or TableauExperience with AWS is a plusClearance: Public TrustABOUT ERPi: ERPi, a Service-Disabled Veteran Owned Small Business (SVDOSB) specializing in management consulting for the federal government (www.erpi.net). ERPi is undergoing a period of significant growth and offers talented candidates a chance to perform project management, strategic planning, process improvement, quality management, data analysis, and human capital planning on some of the Federal governments largest and most complex business challenges. Our work environment is highly entrepreneurial and is staffed with some of the brightest and most capable technical and management consultants in the industry. ERPis compensation and benefits plan are designed to attract and retain the industrys most capable professionals and executives. We offer tuition reimbursement for selected graduate schools, 401(k) profit sharing, awards to recognize exceptional performance immediately, customized health plans, and charitable donation matching, in addition to competitive base salaries. EEO Statement: It has been and will continue to be a fundamental policy of ERPi not to discriminate on the basis of race, color, religion, sex, gender, sexual orientation, gender identity or expression, pregnancy, parental status, marital status, citizenship, national origin, age, disability, genetic information, military status, veteran status, or any other protected category with respect to recruitment, hiring, training, promotion, and other terms and conditions of employment."}