{"jobID": "2802481720", "jobLocation": "San_Diego_CA", "jobTitle": "Scientist / Associate Scientist, Immunology", "companyRating": null, "companyInfo": {"Website": "www.fatetherapeutics.com", "Headquarters": "San Diego, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Public (FATE) ", "Industry": " Accounting & Legal", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Fate Therapeutics is seeking a highly motivated and talented molecular immunologist to support  our research programs. Knowledge and experience in a wide-range of immunology, immunooncology,  transcriptome sequencing, and gene-editing strategies is required. Experience and  expertise in genome-wide CRISPR screening and/or single-cell characterization and  corresponding data analysis techniques is highly desired. This position will be a key member of  our immuno-oncology team and will assist in performing and analyzing studies involving in vitro,  ex vivo, an in vivo testing of Fate Therapeutics’ novel cellular therapy products. This is a fulltime,  bench-level position and is located at the Company’s corporate headquarters in San Diego,  California. Responsibilities:Gene editing of human immune cells including the application of the most commonly used gene editing strategies (e.g., Lenti, CRISPR) Genetic screening of human immune cells (e.g. CRISPR screens)Creation of Next Generation Sequencing (NGS) libraries from isolated genomic DNA and/or total RNA Development and execution of methods for preparing tissue and tumor samples for indepth single cell analysis (e.g., NGS, FACs) Development and execution of novel single cell molecular biology schemes, including combined Protein/RNA-seq (e.g., CITE-seq, REAP-seq) Application of traditional immunological, cellular and molecular biology techniques to support Fate’s programs in the areas of tumor immunology and cellular based  immunotherapies Work closely with cross-functional teams to interpret NGS data from single cell and tissue samples to guide Fate’s product development pipeline Presentation of data to immunology groups and larger program-specific teams  Qualifications  • Ph.D. degree in Immunology or Molecular Biology or other related fields with at least 2 years of post-doctoral experience; applicants with MS or BS degree and extensive (> 8 years)  experience may also be considered for the position Expertise in cell-based screening, particularly genetic screens utilizing genome-wide CRISPR approaches Experience in single-cell genomics or functional genomics is a plusProven ability to develop advanced cell, tissue, and tumor analysis methods highly desiredIn-depth experience in developing and executing immunological assays utilizing primary human T- and NK-cells Proven ability to coordinate with multiple researchers for scheduling and execution of complex experiments Excellent communication and organization skills are a mustPositive outlook and a team-oriented attitude Working Conditions and Physical Requirements Will require working with cells and cell lines of human and/or animal originOccasional weekend and/or evening hours required100% on site work at corporate headquarters in San Diego, CA"}