{"jobID": "2776078024", "jobLocation": "Austin_TX", "jobTitle": "Chief Scientist / Architect, Machine Learning", "companyRating": null, "companyInfo": {"Website": "www.amd.com", "Headquarters": "Santa Clara, CA", "Size": "5001 to 10000 employees", "Founded": " 1969", "Type": " Company - Public (AMD) ", "Industry": " Information Technology", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Intel Corporation, NVIDIA, Qualcomm"}, "estimatedSalary": null, "jobDescription": " What you do at AMD changes everything  At AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies building blocks for gaming, immersive platforms, and the data center.  Developing great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the extra mile to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team.  Fellow Lead Machine Learning Systems Architect  AMD is looking for a Lead Machine Learning Systems Architect to develop our long-term machine learning vision, which will have significant impact for AMD, and the future of our products.  In this role, you will lead the definition of forward-looking projects and novel system concepts to significantly impact AMDs machine learning product portfolio. You will be responsible for driving the development of large-scale heterogeneous machine learning platforms that utilize AMDs server-class CPUs paired with accelerator technologies including, but not limited to, GPUs and FPGAs. You will work closely with teams across AMD to define scaled-out machine learning platforms, algorithms, and proofs of concept that solve tomorrows large-scale machine learning challenges. Your team will also help define AMDs hardware and software architectures with insights gained from the development of machine learning algorithms and techniques suited toward the platform that you develop.  AMD Research is an entrepreneurial research organization with a strong track record of pushing research concepts into AMD products. Our research teams work closely with outside customers and internal teams to develop hardware, software and systems technologies into next generation computing platforms. As part of AMD Research, you will have the opportunity develop a winning team that will collaborate with customers, explore new machine learning algorithms and techniques, and lead the development of best-in-class hardware, software and systems technologies that our customers will use for real-world problems. You will have the opportunity to: Lead algorithmic and systems research in machine learning, AI, and DNN areas  Develop software and systems solutions that address the evolving needs of AMDs customers  Drive research and development, proofs of concept, technology transfer, and customer interactions that lead to the development of AMD best-in-class machine learning platforms  Collaborate with research, engineering, and other AMD teams to drive software and systems solutions for machine learning applications. The best applicant will have: PhD or equivalent experience in a field associated with machine learning such as applied mathematics, statistics, or computer science.  Expertise with machine learning systems architecture.  Experience with machine learning frameworks, for example, TensorFlow or PaddlePaddle  Large-scale machine learning software experience  Expertise with GPGPU or FPGA acceleration of machine learning algorithms  Familiarity with new application areas of machine learning and DNN techniques in science, manufacturing, medicine, or similar.  Requisition Number: 42821  Country: United States State: Texas City: Austin  Job Function: Design  AMD does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. AMD and its subsidiaries are equal opportunity employers. We consider candidates regardless of age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status. Please click here for more information.  Nearest Major Market: AustinSDL2017"}