{"jobID": "2766178656", "jobLocation": "Warren_NJ", "jobTitle": "Principal Development Scientist-Medicated Skin", "companyRating": null, "companyInfo": {"Website": "www.gsk.com", "Headquarters": "Brentford, United Kingdom", "Size": "10000+ employees", "Founded": " 1830", "Type": " Company - Public (GSK) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Pfizer, AstraZeneca, Merck"}, "estimatedSalary": null, "jobDescription": "Your Responsibilities:  Position Overview:A Principal Development Scientist in Medicated Skin (Lamisil, Fenistil, Abreva/Zovirax), New Product Development is a• Broad-based technical leader that spans across multiple scientific disciplines and is a recognized expert in the scientific community • Technical leader that assists in developing and executing technical strategies for the Category• Project Leader of complex global projectsThey will demonstrate world class technical expertise in formulation science (i.e. semisolids, liquids, new topical technologies), providing leadership in the direction and development of that specialist area regarded as critical to future business growth. They will operate at the interface of functional disciplines, both inside and outside of NPD, and coordinate the activities of specialists to design work programmes and participate in their execution to provide support to development projects or existing projects.She/He may lead complex global projects or have overall leadership responsibility for multiple projects (2-5). She/He will manage cross-functional technical subteams in support of these projects. They will manage overall work priorities and ensure team activities are in accordance with company standards and regulations, taking into account scientific, budgetary and timing objectives. This Principal Development Scientist may provide technical leadership in the development and execution of technical strategy and acts as a technical expert in supporting all NPD and Innovation in his/her areas of expertise. Can help facilitate resolution of complex technical problems. Coaches and mentors staff to become proficient in technical skills and to develop new technical skills in support of technical strategy and/or business needs. Key Job Responsibilities:• Makes wide ranging, independent decisions on projects and technical issues• Acts as a liaison to evaluate external technology and develop new technical expertise internally • Stays current with technologies and industry practices and applies relevant information to GSK Consumer Healthcare• Develops strong links with external scientific community including academia, trade associations and professional bodies• Identifies, evaluates and delivers new technology, materials or ingredients• Ensures that research upholds highest scientific standards• Presents finding at conferences, publishes paper, authors patents• Coaches and mentors peers and other staff to develop new technical skills.• Works with Manager to assess staff for potential growth for others within the organization• Communicates collaboratively and influences staff at all organisational levels with both internally and externally with specific organizations.• Works across different scientific disciplines and integrates knowledge from a variety of sources; resolves conflicting data and opinions between these functions is essential.• Champions creativity in teams to deliver innovation to the business.• Operates on specific assignments which may be of short duration (e.g. due diligence of development partners), or long term (e.g. lead outsourcing initiative to low cost country) in a manner that reflects the challenges in a professional and confidential manner.• Provides technical input and direction from a product development perspective to the Therapeutic Category Team and related functions as the expert for that category.• Thinks strategically and provides recommendations and decisions which have a major impact on project plans.• Thinks innovatively for better, more efficient ways of doing things. Actively looks to eliminate non-value-added steps out of processes and procedures• Demonstrates ability to deliver product from idea to concept with path to claim substantiation *GSK-LI "}