{"jobID": "2736539323", "jobLocation": "San_Francisco_CA", "jobTitle": "People Data Analyst", "companyRating": "3.9", "companyInfo": {"Website": "www.cloudflare.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "104000", "jobDescription": "What You Would Do Here: Cloudflare is growing our People & Places team, which is focused on getting the best people to work at Cloudflare and then allowing them to do their best work. A big part of our mission is to enable and promote a culture of data-driven decision making when it comes to our workforce. To do that, we need a robust people analytics strategy and BI solution, which we are in the early phases of defining. To join us in this effort, we are looking for a People Data Analyst to combine our people data and maintain the source of truth that enables our company to draw insights and drive decisions about our workforce. Your findings and analysis will define what projects we take on to enable our employees to do their best work. You will report to the Head of People Systems and Operations and partner closely with other HR team members, cross-functional partners and with business management. The person must thrive in a fast-paced business environment, be detail-oriented, independently motivated, and have the confidence and ability to interact with stakeholders in a professional, approachable, and positive manner. Who You Are: Passionate about data, you like to share the insights you find with your partners and make it easier for them to do the same. Your background has introduced you to concepts from fields like HR, Operations, I/O Psychology, Recruiting, or Business intelligence and you are excited to combine these concepts to help our team interpret how our workforce is growing and craft the best experience we can for our peers. You have the technical skills to dive into data warehousing, Integrations, scripting, and statistics, while also finding joy in teaching both our technical and non-technical partners how to interpret and leverage our data to make informed decisions about where we are going. You are equally comfortable combining/analyzing large data sets and distilling the information into a story for our partners and business leaders. You seek out learning opportunities and are ready to bring new ideas and technology that emerge in people analytics to our team so we can grow together.Responsibilities"}