{"jobID": "2806196461", "jobLocation": "Farmington_Hills_MI", "jobTitle": "Air Quality Scientist I _", "companyRating": null, "companyInfo": {"Website": "www.cornerstone-environmental.com", "Headquarters": "Flagstaff, AZ", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Cornerstone Environmental Group , LLC a Tetra Tech company is a leading provider of consulting, engineering, and technical services worldwide. Our reputation rests on the technical expertise and dedication of our employees-16,000 people working together across disciplines and time zones to provide smart, sustainable solutions for challenging projects. We are proud to be home to leading technical experts in water, environment, infrastructure, resource management, energy, and international development. Tetra Tech combines the resources of a global, multibillion dollar company with local, client-focused delivery in 400 locations around the world. We offer competitive compensation and benefits and are searching for innovative people to join our teams.Air Quality Scientist 1 at Plymouth, WI officeSummary: With guidance and mentoring from experienced air quality engineers and scientists, provide air quality services for solid waste and industrial clients. Help navigate complex air quality regulations for permitting, on-going compliance and reporting. Assist project managers by performing calculations, preparing monitoring plans, providing audit assistance, and evaluating ever-changing regulations. Additional work may involve environmental site investigations, data management, and field services as needed.Essential Duties and Responsibilities include the following:  Read and understand federal, state and local air quality regulations. Routine review and compilation of monitoring data and evaluate for compliance with conditions of the facility's Title V Air Permit and standard operating procedures. Perform routine emission calculations and/or other types of calculations as required by a facility's Title V Air Permit. Prepare greenhouse gas, monthly or more frequent deviation notices, semi-annual and annual compliance reports. Prepare plans required by the Title V Air Permit and state and federal regulations. Prepare requests that address alternatives to permit conditions and federal and state regulations. Assist project manager and client with addressing state regulators concerns and responses to requests and permit applications. Work with client operation and maintenance staff on maintaining compliance. Assist in preparation of construction and operation air permit applications. Collect samples and ship to laboratory for testing and prepare follow up reports, as necessary. Assist with performance testing of control devices. Perform evaluations of gas collection and control systems to improve operation and/or compliance. Perform quarterly methane surface monitoring for landfills. Work at landfills, hazardous waste sites, contaminated sites, and/or other sites where heavy equipment, contamination, or other health hazards may exist. Train with experienced staff on landfill wellfield tuning activities. Assist in proposal efforts as directed. Assist project manager with notifying clients of compliance status, as directed. Implement safe work practices.Key Competencies:Communications  Exhibits good listening and comprehension  Expresses ideas and thoughts in written form  Expresses ideas and thoughts verbally  Keeps others adequately informed  Selects and uses appropriate communication methodsInitiative  Asks for help when needed  Looks for and takes advantage of opportunities  Seeks increased responsibilities  Takes independent actions and calculated risks  Undertakes self-development activities  Volunteers readilyJob Knowledge  Competent in required job skills and knowledge  Displays understanding of how job relates to others  Exhibits ability to learn and apply new skills  Keeps abreast of current developments  Requires minimal supervision  Uses resources effectivelyProblem Solving  Develops alternative solutions  Gathers and analyzes information skillfully  Identifies problems in a timely manner  Resolves problems in early stages  Works well in group problem solving situationsTeamwork  Balances team and individual responsibilities  Contributes to building a positive team spirit  Exhibits objectivity and openness to others' views  Gives and welcomes feedback  Puts success of team above own interestsQualifications:  To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Education/Experience:  Bachelor's degree in environmental science or related discipline and 0 to 2 years' experience in a related or similar field, or the equivalent combination of education and experience. Experience level in this position may vary by individual based on skill levels and performance.Language Ability:  Good communication skills. Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Competency in technical writing including ability to write reports, business correspondence, and procedure manuals. Ability to effectively present information orally and respond to questions from peers and supervisors.Reasoning Ability:  Ability to define problems, collect data, establish facts, and draw valid conclusions. Ability to interpret an extensive variety of technical instructions in mathematical or diagram form and deal with several abstract and concrete variables. Ability to perform scientific calculations. Team oriented.Computer Skills:  To perform this job successfully, an individual should have intermediate knowledge of Microsoft Office, email, and other software as necessary to perform job functions. Knowledge of data management and GIS software a plus.Certificates and Licenses:  Progress toward or professional registration or certification is preferred. Must obtain/maintain OSHA HAZWOPER certification per company policy and job duties. Must have a valid driver's license.Work Environment:  The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Work environment may be indoors, or outdoors for field assignments (in various climatic conditions). Field assignments may involve travel and extended periods away from home.The noise level in the work environment may vary based on the assignment. Hearing protection may be necessary. Work may involve use of personal protective equipment (PPE) including a respirator.Physical Demands:  The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.While performing the duties of this Job, the employee is regularly required to stand, walk, or sit based on the assignment. The employee is frequently required to use hands to finger, handle, or feel; reach with hands and arms; climb or balance; stoop, kneel, crouch, or crawl; talk or hear, and smell. The employee must regularly lift and/or move up to 10 pounds, frequently lift and/or move up to 25 pounds and occasionally lift and/or move up to 50 pounds. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and ability to adjust focus. Must be able to work at a computer for extended periods, and have good visual and color skills.Physical clearance to wear PPE is required. An annual medical exam may be necessary based on the work assignment.This job description should not be construed to imply that these requirements are the exclusive standards of the position. The above statements are intended to describe the general nature and level of work being performed by individuals assigned to this position. They are not intended to be an exhaustive list of all responsibilities, duties, knowledge, skills, and abilities required of individuals so classified.Employee will follow any other instructions, and perform any other related duties, as may be required by the supervisor."}