{"jobID": "2821123753", "jobLocation": "San_Francisco_CA", "jobTitle": "Project Assistant for a renovation and expansion project", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Leadwell Global Property LLC, the owner of a luxurious hotel in San Francisco, is seeking a Project Assistant with experience in construction project to assist in the renovation of the hotel. The Project Assistant will mainly be based and work in San Francisco and assist the company’s renovation team to carry out the entire renovation project (including but not limited to Concept/Schematic Phase, Construction Documents, Permitting/Preconstruction Phase, and Construction Phase.).  Responsibilities:  Assist the company’s renovation team to do the following tasks:  1. Assist hotel team and facilitate engineers to develop project program requirements  2. Coordinate with hotel team on scheduling between hotel operation and construction schedule  3. Assist hotel executives on design directions, project scheduling  4. Coordinate with external project management/construction management team, design team and contractor on:  a. Program verification and advise on system and operation upgrade  b. Assist on budgeting and project scheduling  c. Provide design input and design management  d. Provide construction oversight management  e. Monitor progress on construction and report to hotel executives  Requirements:  - Engineering Degree in Construction Management or building construction or architecture or Mechanical Engineering  - Minimum 3-4 years working experience in the construction industry Have MEP knowledge and background  - Excellent theoretical and practical knowledge of design and construction engineering concepts  - Experience with Bid Packages, Award Phase, Contract Administration and Coordination, Construction Phase, Cost Reports, Permits, Building Codes preferred  - Development and/or construction experience in San Francisco  - Excellent analytical, verbal and written communication skills, as well as business presentation skills  - Self-motivated with the ability to work independently or to work as part of a team. Ability to interact with co-workers, contractors, consultants, etc. in an articulate, courteous, and business-like manner at all times. Proven ability in problem identification and strong problem solving skills  - Ability to communicate in mandarin preferred  - Local candidates (in San Francisco) preferred"}