{"jobID": "2788763662", "jobLocation": "Bridgewater_NJ", "jobTitle": "Product Development Scientist (Pressure Sensitive Adhesives)", "companyRating": "3.4", "companyInfo": {"Website": "www.henkel.com", "Headquarters": "Dusseldorf, Germany", "Size": "10000+ employees", "Founded": " 1876", "Type": " Company - Public (HEN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " L'Oréal, Unilever, Procter & Gamble"}, "estimatedSalary": "77000", "jobDescription": "Henkel Adhesive Technologies is a worldwide leader in bonding, sealing and surface treatments - thanks to our ambitious people. We create unique value for our clients and our technologies can be found in many objects touching our lives every day. Our success is built on constant innovation and people who strive for excellence. Working at Henkel is much more than just a job. It's a passion. Have you got what it takes? The Development Scientist is responsible for the product development of pressure sensitive hot melt adhesives. This role requires understanding of hot melt technology and applying new technology to develop better solutions to meet customer's adhesive needs. Product development activities include independent project management, laboratory scale formulation, performance testing, lab personnel supervision and communicating the findings and solution to internal or external clients. What we offer (Position Description):Provides product development direction, application expertise and innovative solutions to support business opportunities for Henkel's Nonwovens and PSA business.Performs standard and advanced test methods/coating techniques/ways to characterize raw materials and formulations; summarizes and interprets data; determines trends and designs future experiments.Leads product development projects and manages multifunction teams to deliver commercial results.Prepares and delivers technical and project presentations for customers, management and technical audiences; establishes good relationships and communicates effectively across internal functions and with external customers.Travels to customer locations for technical support, product introduction, line trials and trainings.Manages and supervises lab technicians, junior chemists and summer interns.Ensures staff safety by identifying hazards, training lab personnel, and maintaining all SHE requirements.Who we are looking for (Position Requirements):Bachelor's degree with a minimum of 3 years product development experience in the adhesive or polymer material field and a record of accomplishment in the industry.Advanced degree (MS/PhD) in polymer science, chemical engineering, chemistry or related discipline preferredPrior people management or team management experience is preferredAbility to multi-task and manage time efficientlyPrior industrial experience with customer focus and direct customer contact a plusMust be willing and able to travel to customer sites and production facilities as requiredStrong attitude in support of safe work practices to eliminate all potential chemical hazards.Henkel is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.Apply online if this sounds like your next challenge. Refer to the job ID mentioned above and get one step closer to starting your new job at Henkel.Discover our winning culture: www.henkel.com/career"}