{"jobID": "2534043602", "jobLocation": "Springfield_VA", "jobTitle": "Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.calnet.com", "Headquarters": "Reston, VA", "Size": "201 to 500 employees", "Founded": " 1989", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "94000", "jobDescription": " Careers > Jobs List > Job Detail Data ScientistJob Code - JC1237 Job Location - Various - Springfield, VA; St. Louis, Mo,USDivision - Intelligence Security Clearance - Top Secret/SCISkills -Founded  in 1989, CALNET, Inc. has become one of the fastest growing privately held  companies in the Technology, Intelligence Analysis, and Language Services  consulting arena. Headquartered in Reston, VA and with a branch office in San Diego, CALNET employees deliver true  value to our customers by employing best practices, world class technologies  industry expertise in every project. CALNET is a CMMI-Level III (SVC and DEV),  ISO 20000 and ISO 9001:2008 certified.  We are currently looking for experienced, professional Data Scientist with the following skill levels: Journeyman - Minimum of 3-10 years of experienceSenior - Minimum of 10-20 years of experienceExpert – 20+ years of experienceJob RequirementsCurrent and active TS/SCI security clearance Conceive and prepare thorough, well-articulated tactical or strategic data science products (e.g. technical articles, years of this experience visualizations, graphics, intelligence reports)that summarize the methods and results of data science solutions. Design a range of research projects, data collection and methodologies. Identify, retrieve, manipulate, relate and/or exploit multiple structured data sets from various sources. Identify problems to which data science can be applied and initiate appropriate solutions. Identify and appropriately evaluate a wide range of existing methods, models and algorithms in familiar domains for a variety of mission driven problems; recognizing the capabilities and limitations of methods. Demonstrated good oral and written communication skills. This opportunity is  located in the Washington, DC metro area. To be considered for this  opportunity, please send your Word resume to helena@calnet.com.  CALNET, Inc. offers  a competitive salary and a generous benefits package. This package includes  medical, dental, vision, life, short and long term disability insurances, a  401(k) retirement savings plan, and generous leave time.  CALNET, Inc. is an  Equal Opportunity Employer; all qualified applicants are encouraged to apply.www.calnet.com EEO/M/F/D/V"}