{"jobID": "2565513799", "jobLocation": "Hamilton_NJ", "jobTitle": "Research Scientist, Nucleotide Chemistry", "companyRating": null, "companyInfo": {"Website": "www.genesisbiotechgroup.com", "Headquarters": "Trenton, NJ", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Requisition Number 17-0350  Post Date 3/8/2018  Title Research Scientist, Nucleotide Chemistry  City Hamilton  State NJ  Company Venenum Biodesign, LLC  Description VENENUM BIODESIGN LLC is dedicated to the discovery and identification of novel small molecule therapeutic products. Venenum is seeking a Research Scientist in Nucleotide Chemistry to join our growing drug discovery team in Hamilton, NJ.Job Duties:Drive our discovery projects forward through the design and multistep synthesis of novel nucleoside and nucleotide therapeutics. Mentor a team of chemists toward the optimization of compounds. Communicate results and design experiments as a member of a multi-disciplinary team.  Requirements Job Requirements:2-4 years of experience in nucleic acid chemistry. PhD in organic chemistry. Creative nucleotide chemist with strong synthetic organic background. Laboratory chemist with an ability to lead by example at the bench. Proven expertise in multi-step synthesis of novel nucleoside monomers, phosphoramidites, and oligonucleotides. Expertise in interpretation of in vitro and in vivo assay data. Experience leading a research team is a plus. Excellent ability to communicate as a member of a multi-disciplinary effort. Motivated self starter, able to take a leadership role to get things done in a fast paced environment. We Offer:Competitive Salary Medical, Dental & Vision Insurance Short and Long Term Disability Life Insurance Dependent Care Flexible Spending Account Voluntary Policies (Accident, Hospital Indemnity, Critical Illness & Supplemental Short Term Disability) Legal Plan & Identity Theft Protection 401(k) Plan Paid Vacation & Holidays Business Casual Work Environment Credit Union Visit us at www.venenumbiodesign.comVenenum Biodesign, LLC. is an equal opportunity employer."}