{"jobID": "2745991298", "jobLocation": "Newark_NJ", "jobTitle": "Director, Data Science", "companyRating": null, "companyInfo": {"Website": "jobs.prudential.com", "Headquarters": "Newark, NJ", "Size": "10000+ employees", "Founded": " 1875", "Type": " Company - Public (PRU) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " AIG, MetLife, Fidelity Investments"}, "estimatedSalary": null, "jobDescription": " Prudential Financial is looking for an enthusiastic Director of Data Science to help build out a centralized advanced data analytics capability as an enterprise service. The role requires a rare combination of deep and sophisticated analytical expertise; business acumen; a strategic and technical mindset; and client, relationship and project management proficiency, together with a passion for building new capabilities and teams. This is an exciting opportunity to drive customer-centric thinking in a new and growing organization. The Customer Office team merges the entrepreneurial spirit of a start-up with the stability of one of the world’s most established financial services companies. We operate in a fast-paced environment and are looking for someone who takes the initiative and is excited about being part of a cultural and business transformation. Experimentation and innovation are encouraged.  Responsibilities for this position include building the framework, sourcing, leading and presenting forward-thinking, high-impact Data Science projects  focused on key strategic initiatives. You will lead a team in an exciting and engaging environment, using your skills and experience to make key  contributions to our business, push your creative boundaries, socialize new ideas and, most importantly, have fun.  Responsibilities: Lead and develop a team of data scientistsBuild scalable digital personalization solutions that create significant business value and best-in-breed customer experiencesUse Hadoop and other data platforms along with the relevant programming / statistical package (such as R or Python) for large-scale problem solvingUnderstand complex business challenges, develop hypotheses, convert into the right analytical problems, and communicate the results back to the partnerteams with limited or no analytical background to drive the business strategyAnalyze internal / external, online / offline, and structured / unstructured data such as speech analytics, digital footprints, financial information,  proprietary market research and secondary sources to identify insights into customer behavior patternsApply new computing technologies and niches with cutting-edge machine learning or statistical modeling techniques for personalized digital customer experiencesDeliver strong written and verbal communications to collaborate with and influence business partners in driving high-value strategic decisionsDirect project plans, timelines, and vendor relationships to ensure projects are delivered with the highest quality, on time and within budget •Advanced degree in Mathematics, Statistics, Engineering, Computer Science or other quantitative / statistical disciplines  •A minimum of 5-10 years of relevant work experience in data science  •Experience analyzing digital customer footprint data  •Extensive experience in analyzing large data sets using software such as R and Python  •Experience with data mining, machine learning, statistical modeling tools, underlying algorithms, relational databases and SQL  •Proven track record of using data to provide actionable business results  •Excellent interpersonal and collaboration skills, ability to explain complicated mathematical concepts, algorithms and data structures to all business partners  •Intellectual curiosity, action focus, innovation, passion, speed and resilience in dealing with data  •Strong influencing and partnership skills with ability to balance responsiveness to diverse requests from many stakeholders  •Polished written and oral communication skills, with ability to present and clearly explain data to non-technical executive audiences  •Strong project management skills and deep experience managing projects, budgets, and schedules to successful completion  •Prior exposure to financial services or insurance industry"}