{"jobID": "2803350712", "jobLocation": "San_Mateo_CA", "jobTitle": "Data Engineer", "companyRating": "3.7", "companyInfo": {"Website": "www.fanaticsinc.com", "Headquarters": "Jacksonville, FL", "Size": "1001 to 5000 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " Lids"}, "estimatedSalary": "128000", "jobDescription": " Data Engineer Location(s)  San Mateo, CA Job Code 3047 # of openings 1Apply NowAt Fanatics, we are passionate about leveraging data to drive growth and operational efficiencies. We firmly believe in putting data at the forefront of delivering an engaging experience for our sports fans!  Fanatics is looking for highly motivated individuals to join our Data Science and Engineering team. You will collaborate closely with data scientists and cross functional business units to develop data pipelines, infrastructure and applications in the following areas: Behavioral Tracking and Analytics: core infrastructure for monitoring and deriving insights from site traffic.Product Recommendation and Personalization: providing personalized product recommendations and user experience for sports fans in e-commerce sites as well as on emails.Product Finding: deploying key components of online-search, including ranking models, spell correction, query expansion and query understanding. Job Responsibilities Develop robust and scalable data infrastructure components for monitoring and tracking, messaging, real-time streaming and batch data processing use cases.Integrate and productionize machine learning and statistical models into real-time services, as well as BI & Visualization layers.Work closely with data scientists to assist on feature engineering, model training frameworks, and model deployments at scale.Provide engineering leadership in the the design and architecture of data infrastructure and applications. Job Requirements 2+ years of experience with big data processing in Spark, Hadoop, Hive and/or Redshift.Expertise with Java or Scala.Experience designing and developing data models, integrating data from multiple sources, building ETL pipelines, and supporting all aspects of the software development lifecycle.Strong SQL programming knowledge and experience.Experience developing web services, API integrations, and data exchanges with third parties is preferred.Ability to communicate quantitative analysis and analytical findings in a clear, precise, and actionable manner.Energetic, enthusiastic, detail-oriented, and passionate about producing high-quality analytics deliverables.Knowledge of basic statistical analysis and machine learning a plus.MS/BS in Computer Science, MIS, Mathematics, Physics or other quantitative field or relevant work experience."}