{"jobID": "2835291352", "jobLocation": "Chicago_IL", "jobTitle": "Data Operations Analyst", "companyRating": null, "companyInfo": {"Website": "www.beaconhillstaffing.com", "Headquarters": "Boston, MA", "Size": "501 to 1000 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Aerotek, WinterWyman, Hollister Staffing"}, "estimatedSalary": null, "jobDescription": " his role will work in an operational mode in managing the exchange of data. This function also is intended to include those that involve researching and resolving member related issues as it pertains to the correctness of data and its exchange. Responsibilities:Performs daily management and monitoring of Electronic Data Interchanges (EDI), including manual intervention and error log review and resolutionProvide troubleshooting, analysis for ETL, and data issuesYou will be responsible for consulting with internal and external customers on data usage, file layouts and file transfersIntermediate to advanced SQL experience writing complex queries, user-defined functions, and stored procedures, and tuning query performanceExtract and transform raw data from various data sources into useful information to enable more effective strategic, tactical, and operational insightsDetermine best method to gather, model, manipulate and present data. Gather business requirements and translate business questions into requirementsQualifications:Experience developing reports and dashboards in data visualization BI Tools (Power BI is strongly preferred)Experience with SQL Server Reporting Services plusAbility to present analytical findings/reports to an audience of 10+Prior experience working with multiple database technologiesGood understanding of logical/physical data modelsSolid understanding of business intelligence concepts and experience working with Business Intelligence tools and techniques Find Us on Facebook!  Follow Us on Twitter!  Beacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply. Company Profile: Beacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries on a contract, direct (permanent), contract-to-direct and project basis. Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs.  Beacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles.  Learn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Pharma and Beacon Hill Technologies by visiting www.beaconhillstaffing.com.  We look forward to working with you.  Beacon Hill. Employing the Future™ - provided by Dice  Data Operations Analyst"}