{"jobID": "2828416096", "jobLocation": "Plano_TX", "jobTitle": "Data/Business Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.bankofamerica.com", "Headquarters": "Charlotte, NC", "Size": "10000+ employees", "Founded": " 1904", "Type": " Company - Public (BAC) ", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "65000", "jobDescription": "Job Description: Bank of America is looking to build out their Application Development capabilities in the Plano, TX, market.  Grow your career in our dynamic and fast paced environment of diverse software platforms and challenging projects that shape the future of the banking industry. Enterprise Role Overview: Develops, enhances, debugs, supports, maintains and tests software applications that support business units or supporting functions. These application program solutions may involve diverse development platforms, software, hardware, technologies and tools. Participates in the design, development and implementation of complex applications, often using new technologies. May provide technical direction and system architecture for individual initiatives. Serves as a fully seasoned/proficient technical resource. Will not have direct reports but may lead projects and direct activities of a team related to special initiatives or operations. May have responsibility for a project and project budget. May collaborate with external programmers to coordinate delivery of software application. Routine accountability is for technical knowledge and capabilities. Works under minimal supervision, with general guidance from more seasoned consultants. Typically requires 5-7 years of experience. **Candidates requiring visa sponsorship will not be considered for this position**This position will be located at our Plano, TX, technology center only.Job Specific Description: Bank of America is looking for a Developer who will be involved in the following:  Be a core element of the business, working as a team with world-class professionals to use information in design, development and implementation of solutions to meet various business needs. Primary responsibility will be to develop and maintain relational solutions that will satisfy a wide range of business critical needs. Routine accountability is for technical knowledge and capabilities as a team member or as an individual contributor. Work under minimal supervision, with general guidance from more seasoned consultants or managers.  Typical responsibilities:  - Interfacing with business users/analyst to clarify business requirements for technical design.  - Facilitate meetings to collect, analyze, validate and document business and technical requirements.  - Perform workflow analysis to improve efficiency and productivity and contribute to the solution design.  - Takes ownership for assigned projects and report current status to supervisor on a frequent basis  This position is part business analyst, data analyst, and PM. Within the CEH org the role is called Business Analyst. It requires detailed understanding of event data flowing into CEH, the CEH taxonomy, and how the REST services work to retrieve data from CEH. Required Skills (Must have these skills to be minimally qualified): - Must have 3+ years of system analysis experience including SQL scripting  - Must have conceptual knowledge of NoSQL, SQL scripting, Stored Procedures, Functions and Triggers  - Must be familiar with data management principles  - Excellent verbal and written communication skills.  - Self-directed. Candidate needs to be a quick learner, critical thinker and a problem solver, with ability to operate in a dynamic environment with tight deadlines and rapidly evolving requirements  - Ability to take requirements and translate to technical specifications  - Remediation of issues found during testing - candidates need to be problem solvers and troubleshoot issues based on specifications provided  - Strong organizational and analytical skills  - Strong Written and verbal communication skills  • Bachelors degree or higher in computer science, engineering or a related field  • Understanding of Agile/Scrum methodologies, Test Driven Development and SDLC  • Ability to work in a global delivery model  Desired Skills: - Previous Experience in Financials Services and/or data oriented organizations  - Understanding of enterprise change control systems and processes  - Able to identify risks and mitigation  - Comfortable working in a matrix environment  - Familiarity with NoSQL data structures Shift:1st shift (United States of America)Hours Per Week:40"}