{"jobID": "2697608752", "jobLocation": "Houston_TX", "jobTitle": "Research Scientist - Polymers & Resins", "companyRating": "3.3", "companyInfo": {"Website": "www.huntsman.com", "Headquarters": "The Woodlands, TX", "Size": "10000+ employees", "Founded": " 1970", "Type": " Company - Public (HUN) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " Dow, DuPont"}, "estimatedSalary": "73000", "jobDescription": "Job Description:  We are currently looking for a dynamic individual as a Research Scientist for our Performance Products organization at our Advanced Technology Center located in The Woodlands, Texas.  Our team is part of the Global Technology & Innovation team which is tasked to develop new products for use in various polymer applications. We are looking for a chemist to help develop new products that can be used in the polyurethane and epoxy markets. What will be expected from you?Synthesize new molecules and test new molecules used in our markets and contribute to the overall organizationMust have the ability to develop new products in small scale reactors and then help develop the product for commercial scale productionSpecify and setup experimental laboratory equipment for performing organic synthesis workDesign, agree, plan and independently carry out non-routine, innovative experimental programs and specify the timing and resource needsIndependently seek information and find solutions to problems encountered during the execution of the experimental programsCommunicate the outputs, conclusions and recommendations to the project stakeholders in order to provide a technical basis for strategic decisionsWrite technical reports in line with the report guidelines and secure peer review and line management approval prior to publicationMaintain an advanced awareness of “state-of-the-art” organic chemistry in order to develop the organic synthesis competency furtherEnhance her/his area of research and technical expertise by maintaining an up-to-date knowledge of key scientific competitive developments in organic chemistryApply organic synthesis to create ideas and to propose development programs for innovation in the fields of polymer science targeted at achieving competitive advantage, thereby contributing to strategic business development opportunitiesAct as the main researcher and project leader in several R&D; projects, meeting project milestones and directing and reviewing supporting activitiesKeep abreast of relevant competitive IP literature in order to direct own research and to develop a strategically aligned intellectual property portfolio in the field of organic chemistry as applied to polymer science and write appropriate invention reportsMust be an innovative and analytical thinker who is able to influence key individuals of all disciplines and levels inside and outside the organization in order to progress innovationWhat are we looking for in the ideal candidate?Doctorate in Chemistry with 5+ years of relevant experienceRequired experience in polymer modification for urethane foamsRequired experience with raw materials going into urethane foamsExperience with urethane catalyst is desiredOrganic chemistryPolymer chemistryUrethane chemistryHighly innovative and willing to take initiative to tackle complex technical challengesAble to apply good project management principles to their own work and the work of small project teamsGood communication skills and fluency in English, other languages are an assetGood IT skillsExcellent interpersonal skills and ability to coach othersJob holder must be prepared to occasionally travel globally and work across international boundaries **Sponsorships now or in the future are not approved for this role** What can we offer you? Huntsman offers unsurpassed opportunities to build a successful future. We are a global specialty chemical company with locations in 30 countries around the world, employing over 11,000 associates. Our diverse portfolio creates a range of career fields including manufacturing, research and development, technical services, sales and marketing, customer service – and the list goes on. The successful candidate will receive a competitive compensation and will be eligible to participate in a comprehensive benefits package which includes: medical, vision and dental, basic life insurance, AD&D; insurance, and 401k. Here, you can make an impact and make a difference. Come join us! Additional Locations:"}