{"jobID": "1920927039", "jobLocation": "Gibbstown_NJ", "jobTitle": "Quality Control Scientist", "companyRating": null, "companyInfo": {"Website": "www.techusa.net", "Headquarters": "Millersville, MD", "Size": "1001 to 5000 employees", "Founded": " 1998", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " -Perform quality control testing on raw materials, intermediates and finished products. Issue adjustments, approvals and rejections as needed. -Assist in the generation and maintenance of KRP quality system documentation, including but not limited to batch cards, QCAs, COAs, SOPs and retains. -Perform review and onboarding tasks for new and revised products. Train QC team members to new product specifications and methods. -Interface with analytical team for routine and advanced analytical work including but not limited to; method development, instrument maintenance, data management, review and reporting of results. -Interface with production management for advanced troubleshooting of quality issues and evaluation and validation of designed process improvements. -Oversee training of new QC team members and maintain appropriate training records, as needed. -Assign supplemental projects to QC team members and supervise/oversee the related tasks as directed by senior management. -Under the guidance of senior laboratory staff, develop products to meet customer needs. -Participate in internal and external audits -Investigate product quality complaints (as assigned by laboratory management). Document, file and report results to appropriate personnel. -As needed, directly interface with suppliers, sales staff and customers as part of the product development process and/or quality management process. -Produce customer specialty samples as necessary. -Participate in the general upkeep of the QC/ R&D; laboratory facility. -Work safely with hazardous chemicals and waste. -Complete special assignments as required. Qualifications:5+ years of experience in a laboratory atmosphere.Excellent oral and written communication skills.Excellent organizational skills.Excellent analytical skills.Proficient in MS Office Suite applicationsEducation/Certifications:B.A. or B.S. degree in Chemistry, Biology, Biochemistry or related scienceDesired SkillsHands-on HPLC and GC experiencePrior experience with enterprise resource planning and/or laboratory information management software"}