{"jobID": "2820374519", "jobLocation": "Princeton_NJ", "jobTitle": "Machine Learning Engineer", "companyRating": null, "companyInfo": {"Website": "www.kinetixtt.com", "Headquarters": "Princeton, NJ", "Size": "51 to 200 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Developing and implementing advanced analytics approaches including statistical modelling, machine learning algorithms, text mining, regression, web analytics etc. to answer business questions and drive actionable insights.  × Work with very large Data Sets (both structured and unstructured) and design, develop and implement R&D; and pre-product prototype solutions.  × Perform Data cleansing / transformation, feature engineering, apply statistical analysis, data visualization, data mining.  × Establish scalable, efficient, automated processes for model development, model validation, model implementation and large scale data analysis.  × Communicate analytical results in a way that is meaningful for business stakeholders and provides actionable insights.  × Any other relevant responsibility that may arise from time-to-time.  Skills Required:  × Should possess extensive knowledge of and experience in applying Data Mining and Machine Learning techniques in a project context  × Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc.  × Experience with common Data Science Toolkits such as Weka, NumPy, MatLab, etc {depending on specific project requirements}, Kaska, Spark.  × Proficiency in programming languages like Python, R, Java, C++.  × Proficiency both in RDBMS and in using Query Languages such as Hive, Pig, SQL.  × Knowledge of Big Data platforms like Hadoop and its eco-system will be preferred.  × Experience with data visualisation tools, such as D3.js, GGplot, Tableau, etc.  × Good applied statistics skills, such as distributions, statistical testing, regression, etc.  × Good Communication skills.  × Data-oriented personality."}