{"jobID": "2745473807", "jobLocation": "Austin_TX", "jobTitle": "Scientist, Bioinformatics", "companyRating": "3.3", "companyInfo": {"Website": "jobs.thermofisher.com", "Headquarters": "Waltham, MA", "Size": "10000+ employees", "Founded": " 1902", "Type": " Company - Public (TMO) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Illumina, Agilent Technologies, Roche"}, "estimatedSalary": "89000", "jobDescription": " Job DescriptionJob Title: Scientist III, Bioinformatics Requisition ID: 67712BR  When youre part of the team at Thermo Fisher Scientific, youll do important work, like helping customers in finding cures for cancer, protecting the environment or making sure our food is safe. Your work will have real-world impact, and youll be supported in achieving your career goals.  Thermo Fisher Scientific is a leader in promoting global health. As part of that mission, we are seeking a bioinformatics scientist to contribute to genotyping by sequencing (GBS) projects related to trait selection for plant and animal breeders. As a member of our team, the scientist will design panels for massively multiplexed amplification and targeted sequencing of specific variations of interest to customers within plant and animal genomes. The scientist will utilize and assist in the development of analysis pipelines for automating the design of custom genotyping panels and for analyzing GBS data. The scientist will work with an interdisciplinary team to develop and support next-generation sequencing-based products to that end. Our group also has an active program around microbial detection in Animal Health and the scientist may also contribute to those projects as needed. The scientist will communicate the results of bioinformatics analyses in oral presentations and written reports to biologists and others unfamiliar with computational tools and methods. The candidate must be self-motivated and independent and be able to manage time among a number of projects related to microbial detection. RESPONSIBILITIES:Provide bioinformatics support for genotyping by sequencing (GBS) projects related to trait selection for plant and animal breedingEstablish and maintain local databases for housing data and metadata related to GBS projectsUtilize existing pipelines for design of targeted sequencing panels and develop new pipelines related to identifying genome-wide patterns of genetic variation in plants and animalsDesign automated pipelines for next-generation sequencing analysis including variant callingWork with resident biologists to improve targeted sequencing panels based on customer requirementsEffectively communicate results of computational analyses to biologists and others unfamiliar with bioinformatics toolsSupport bioinformatics for microbial detection projects as neededREQUIREMENTS / EDUCATION:Masters or Ph.D. in bioinformatics, molecular biology, statistics or related field.Proficient in Linux/Unix work environment.Demonstrated expertise in a scripting language (Perl or Python).Demonstrated expertise in statistical programming (R, SAS)Relational database experience (MySQL, Oracle).Experience in next-generation sequencing analysis.Expertise with comparative genomics tools (BLAST, multiple alignment, phylogenetic analysis).Previous experience with variant calling (SNPs/indels) from next-generation sequencing data is highly desirable.Previous experience with whole genome genotyping, GWAS or QTL studies is highly desirablePrevious experience with analysis/annotation of plant and/or animal genomes is highly desirable.Primer design experience highly desirable.Strong communication skills. At Thermo Fisher Scientific, each one of our 65,000 extraordinary minds has a unique story to tell. Join us and contribute to our singular missionenabling our customers to make the world healthier, cleaner and safer.  Apply today! http://jobs.thermofisher.com Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status. Thermo Fisher Scientific is an EEO/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status."}