{"jobID": "2827773732", "jobLocation": "Chicago_IL", "jobTitle": "Geospatial Data Scientist - Urban Planning and Policy", "companyRating": "4.0", "companyInfo": {"Website": "www.uic.edu", "Headquarters": "Chicago, IL", "Size": "Unknown", "Founded": " 1982", "Type": " College / University", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": " This position is responsible for teaching activities and managing and conducting research and service within the areas of geospatial analysis and visualization technologies as pursued by the Department of Urban Planning and Policy (UPP) and the Urban Data Visualization Lab (UDVL). Due to the teaching responsibilities included in this role there will be a faculty component associated with this position. Duties:Job responsibilities include:Teaching Geospatial Information and Visualization Technology courses (two courses per semester).Contributing expertise to the development of research projects and service proposals including designing, conducting, and coordinating research on UDVL initiatives and priority areas.Analyzing findings, writing research reports and presenting research findings to public audiences and funders.Pursuing external funding for UDVL research including developing relationships with funders, writing grants and coordinating applications with grants and contracts staff people.Developing and promoting relationships with peer research organizations in mutually beneficial ways.Providing professional service on awarded projects, including professional and peer reviewed publications and journals.Consulting and support to students and faculty with dissertations and/or projects that incorporate geospatial and visualization technology applications.Managing UDVL office operations including supervision of research and teaching assistants, preparing annual UDVL reports, coordinating the lab's data and technology resources.Performing other related duties and participating in special projects as assigned.Qualifications:A PhD degree in Urban Planning, Geography, Engineering, Data Science, Computer Science or related field required.A minimum of one (1) year of experience in using software applications, teaching, grant writing and publishing.Knowledge of spatial data analysis and visualization methods and technologies.Knowledge of pedagogical approaches to teaching software.Relevant experience in research-based organizations with the development of research ideas and agenda preferred.Basic computer programming for geospatial analysis and visualization applications.Advanced computer programming for geospatial analysis and visualization applications preferred.Demonstrated proficiency in geospatial data management and analysis, visualization and/or decision support tools and softwareStrong writing/reporting skills.Proven knowledge and experience in Geospatial analysis and visualization application development.Ability to apply and integrate geospatial and visualization technologies with other information and communication technologies and tools, including mobile apps, social media, and spatial data infrastructures (SDIs).Ability to develop relationships with stakeholders, communities and external constituents.Demonstrated ability in geospatial and visualization research and research administration.Work experience in an interdisciplinary and diverse setting.Ability to supervise staff and plan and manage budgets.Research ideas and agenda development knowledge and experience. All application materials must be submitted via HireTouch. For fullest consideration, candidates must submit a cover letter outlining their qualifications for and interest in the Geospatial Data Scientist position, a current curriculum vitae, and the names and contact information of three professional references. Please submit by July 10, 2018 to: https://jobs.uic.edu/job-board/job-details HireTouch Job ID/EEO #98073.  The University of Illinois at Chicago is an affirmative action, equal opportunity employer that has a strong institutional commitment to the principle of diversity and is particularly interested in receiving applications from a broad spectrum of people, including members of ethnic minorities, women, covered veterans, and individuals with disabilities. The University of Illinois conducts background checks on all job candidates upon acceptance of contingent offer of employment. Background checks will be performed in compliance with the Fair Credit Reporting Act."}