{"jobID": "2834412557", "jobLocation": "Santa_Clara_CA", "jobTitle": "Senior Data Scientist", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "178000", "jobDescription": "Senior Data Scientist Job Number: 113357062Sacramento, California, United StatesPosted: May. 19, 2018Weekly Hours: 40.00 Job SummaryImagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.  The Information Systems & Technology (IS&T;) team manages key business and technical infrastructure at Apple -- how we take an order online, the experience with technology in our retail stores, how much network capacity we need around the world, the processing of every credit card an iTunes customer uses and closing the books. IS&T; does it all.  The IS&T; HelpLine and Network Operations Center (NOC) provide technical support services to Apple’s employees, contractors, and vendors throughout the world, 24 hours a day, 365 days a year. We support Apple’s products and services from hardware to software. We also support Apple’s world-class information technology infrastructure from our data centers through our data and voice networks to each user’s Mac or IOS device…and everything in between.  We are currently looking for a highly motivated, technically savvy, Senior Data Scientist who has excellent analytic and data visualization skills to join our HelpLine team. This is an extremely fast-paced and highly demanding environment. If you have what it takes, we would like to talk to you.Key Qualifications Desire and ability to thrive in a fast-paced, highly demanding, dynamic business and information technology environmentAbility to maintain composure and focus in stressful situationsCustomer service orientationHigh standard for attention to details and 100% accuracyExcellent verbal and written communication skillsSuperb time management and multi-tasking skillsAbility to meet and exceed goals and objectives with minimal direct supervision and only high-level directionExcellent risk management and information security knowledge, skills, and abilitiesFluency in SAS, R, Spark, UNIX shells (bash and ksh) or Python, with experience writing scripts that are part of a production-type analytic solutionSolid technical database knowledge (Oracle, Hadoop, Teradata, data modeling) and experience optimizing SQL queries on large dataKnowledge and experience working with a variety of data structures and formatsIn-depth knowledge and skills to use and apply descriptive and inferential statistics including probability, hypothesis testing, estimation, associations, correlation, regression analysis, and forecastingAnalytic and business intelligence skills to identify meaningful patterns, analyze them, and then integrate and communicate them via data visualization and reporting techniquesKnowledge and experience with data modeling using R or other similar softwareStrong data visualization, reporting, and communications skills and abilitiesFamiliarity with enterprise information technologyEffective communication; up, down and laterallyPreferred Experience and SkillsKnowledge and experience producing reports with Business ObjectsKnowledge and experience with SplunkKnowledge and experience with map reduce using Hadoop or similar softwareKnowledge and experience with Tableau or other visualization tools DescriptionThe Senior Data Scientist operates independently and is responsible for coordinating the retrieval, presentation, and analysis of data for the IS&T; HelpLine and Network Operations Center. The Data Scientist will present data to peers, managers, directors, and VPs; and highlight data patterns that could be useful for making business decisions. Effectively plans and leads projects and tasks to determine data needs, data sources, and data usersCoordinates with other data producing and data consumer groupsCoordinates data access with other data stewards and data usersDevelops data requirements document and collaborates with developers and data miners to obtain the required dataValidates data quality by:Filtering dataAnalyzing and removing errorsAnalyzing and removing inconsistenciesEnsures that the data is accurate and meets the stipulated requirementsAnalyzes data using various methods including:Data visualizationBasic descriptive statistical measuresStatistical dependency (association) and correlationTrend analysisPredictive analyticsModelingDevelops data visualizations and reports on the data, trends, probabilities, forecasts, and other business intelligence based on dataSkillfully communicates the data, reports, and findings using a number of media including:Oral presentationsWritten reports, charts, and graphsWeb-based, interactive reports and data visualizationsTakes the initiative to develop and automate regular and ad-hoc reportsResearches, and if applicable, implements new technologies and methods in the areas ofData analysisData visualization and presentationData glossaries and librariesEducationPhD is required in Business (with quantitative emphasis), Statistics, Data Mining, Machine Learning, Analytics, Econometrics, Mathematics, Operations Research, Industrial Engineering, or related field"}