{"jobID": "2810622685", "jobLocation": "Franklin_Lakes_NJ", "jobTitle": "Sr. Manager, Data Science", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Job Description SummaryThe Sr. Manager, Data Science will lead GCD's approach to identification and access to large external and internal data bases containing information relevant to BD's human investigations. In an effort to support strategic requirements, drive innovation, business-making and the setting of strategies and priorities, this role will work with a team of individuals from Medical Affairs (MA), Information Systems (IT), Health Economics & Outcomes Research HEOR), Global Health (GH), Digital Health (DH) and others to identify and utilize internal and external sources of data that will provide information, analytics and insights to GCD and other functional teams. This role will also build and lead a team of Data Scientists in the future. Job Description Primary Responsibilities and Duties Leads data stewardship activities for the GCD team including strategy for accessing, linking and analyzing internal and external large databases.Leads evaluation of current and future data assets including partnerships for sourcing data and analytics tools.Facilitates discussions and collaborate among GCD, MA, IT, GH, DH, HEOR and others, as well as external vendor partners.Aids in the development of data feeds/flow strategy from various sources ensuring timely and accurate information for business users.Creates GCD analytics strategy and roadmap in partnership with internal stakeholders and external parties.Builds and leads a team of Data Scientists to support business needs.Drives innovation via the use of data driven insights to business functions.Builds and advocates data-driven evidence that help cross-functional partners improve outcomes.Provides insight into leading analytic practices and produce new and creative analytic solutions.Drives the interaction and partnership between the GCD analytics function and the business units. Ensure close cooperation in identifying and defining analytical needs, and generating business insights and evidence.Provides leadership on matters pertaining to the utilization of data, implementation of the analytics strategy and tactics. Ensure a broad understanding of the value of analytics and insights to the product value demonstration.Leads advanced analytical initiatives to uncover new business opportunities and insights.QualificationsMinimum of MS, PhD strongly preferred, in statistics/data science, machine learning, or related quantitative discipline.Minimum 8 years experience in relevant areas of Data Science.Minimum of 4 years supervisory experience.Accomplished academic background in medical applications preferredStrong analytical and problem-solving skillsExcellent communication and presentation skills, proficiency in data interpretation, delivering messages with impact to internal and external customersAbility to anticipate and resolve problemsAbility to lead cross functional efforts and teamsAbility to work independently as well as collaboratively within a team setting Primary Work LocationUSA NJ - Franklin Lakes  Additional Locations  Work ShiftSDL2017"}