{"jobID": "2786705001", "jobLocation": "San_Francisco_CA", "jobTitle": "Data Systems Analyst I, II or III", "companyRating": "3.4", "companyInfo": {"Website": "www.newyorkfed.org", "Headquarters": "New York, NY", "Size": "1001 to 5000 employees", "Founded": " 1914", "Type": " Company - Private", "Industry": " Finance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "134000", "jobDescription": " The Federal Reserve Bank of San Francisco believes in the diversity of our people, ideas, and experiences and are committed to building an inclusive culture that is representative of the communities we serve. A key focus is on excellence in engaging and investing in our workforce. Cash Product Office: The mission of Federal Reserve Cash Services (FedCash® Services) is to supply currency and coin to meet both domestic and international demand, maintain the quality and integrity of currency and coin in circulation, and ensure Depository Institutions have ready access to Cash Services. The Cash Product Office's (CPO) primary goal in meeting our mission is to maintain confidence in U.S. currency through well-controlled operations with sufficient capacity to meet the needs of the marketplace on a daily basis and in times of stress. Although both financial and operational efficiency are important goals for Cash Services, they remain secondary to maintaining confidence. The CPO partners with Reserve Banks to accomplish the Fed's mission by providing leadership, coordination, and support. Highlights of Responsibilities: As a Data Systems Analyst, on the CPO's new Data Strategy team, you will be responsible for building data analytics tools and capabilities that improve CPO business processes. Candidates should have: A passion for applying data management practices to drive process efficienciesStrong programming and data management skillsStrong self-management skills to gather input and prioritize needs from multiple internal stakeholdersStrong interpersonal and collaboration skills to work with internal technology partnersQualifications:Experience with SQL, scripting, statistical/mathematical programming languages, reporting/business intelligence tools, and data visualization products (e.g., Python, R, SAS, Stata, Tableau, Business Objects)Bachelor's Degree or higher in a relevant analytical field, or equivalent experienceExcellent interpersonal, emotional intelligence, collaboration skillsWillingness to developing informal and formal business relationships with partners and stakeholdersPreferred Skills:Background in the use of data within the Federal Reserve, ideally within FedCash® Services or another Fed Financial Services business line.Graphic design experienceSDL2017"}