{"jobID": "2826737242", "jobLocation": "Woodcliff_Lake_NJ", "jobTitle": "Medical Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.hiredbymatrix.com", "Headquarters": "Glen Rock, NJ", "Size": "201 to 500 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job SummaryOur Client, a human health care pharmaceutical company, is seeking a Medical Data Scientist possessing a Medical Degree, Physician Assistant or PharmD or graduate of adequate health care related course with commensurate experience in use of dictionaries in Clinical trial setting.ResponsibilitiesUnder the supervision and guidance of a manager, candidate should be able to perform first pass coding using a standard medical dictionary (MedDRA, WHODD); Generate queries related to clarity of reported terms; Perform coding listings review and provide feedback. Review of protocol and CRF in relation to coding and evaluation of safety data. Logical thinking in grouping of MedDRA terms and medications for use in data analysis. (80%)Apply clinical/medical background to review medical conditions; perform reconciliation between clinical database and CIOMS/MedWatch or safety related reports; review patient profiles and identify inconsistencies, or missing data. (20%)Quantitative Analysis - Performs a comprehensive review for the all the reported and coded terms. To assure the presence of all coding targets not limited to LLT, PT and SOC and Trade name, Preferred Name ATC 2 and ATC 4 and their respective dictionary versions. Generate coding queries and queries related to any safety data review.Qualitative Analysis - Evaluates coding consistency and adequacy. Ensures that the selected codes accurately reflect the term as provided by the investigator. Reviews the codes for ICH compliance and adherence to coding guidelines and conventions. Ensures to write a quality and comprehensive narratives.Performs all duties according to company policy and regulations and guidance.Performs other duties assigned by the head of Clinical Coding & Safety Data Review or its manager.No travel required.QualificationsEducationMedical Degree, Physician-Assistant or PharmD or graduate of adequate health care related course with commensurate experience in use of dictionaries in Clinical trial setting.Experience5-8 years' experience.Educational background in medical field with strong understanding of pathophysiology of diseases.Strong knowledge of medical terminology, ability to apply to clinical coding using standard medical dictionaryKnowledge of Central coding or any coding tool system a plus, if not will trainExperience with INFORM is a plus, otherwise ability to use/learn complex computer systemKnowledge of Oncology Clinical trial Study is a plus, or ability to learn and apply experience in the area of clinical researchSkillsNarrative writing skills preferredComputer proficiency and Expertise on use of Excel and wordStrong oral and written communication skillsSelf-motivated, pro-active, organized and quick learnerAble to work with minimum supervision and work independentlyPlease submit your resume for consideration. Once submitted, feel free to contact Rushi at 858-703-6733 for additional information.Approx. Duration: 12 monthsAbout Hired By Matrix Hired by Matrix, Inc. founded in 1986, is a certified Woman-Owned Business Enterprise (WBE) dedicated to providing the highest quality of job opportunities to our candidates and staffing services to our clients. We are a full service staffing firm with experience recruiting and delivering for IT, Accounting & Finance, Administrative & Clerical, Clinical & Scientific, and Marketing disciplines. Our long history in the staffing industry and dedication to excellence are the key differentiators that have fueled our success for over 30 years.  As the staffing industry evolves, Hired by Matrix continues to develop and grow. By combining our expertise with a keen understanding of each client's needs we are able to source for the most qualified candidates. Our commitment to servicing our clients corresponds with our commitment to finding the perfect match between our clients and candidates and maintaining our relationships long term.  Hired by Matrix offers our contract professionals competitive salaries, benefits after 60 days and a 401k option after one year.  Equal Opportunity Employer  WBENC Certified  WOSB Certified CEO Sharon Olzerowicz serves on the WBENC Board and is a long-standing member of the Forum Governing Group. Connect with us on LinkedIn and see how we can impact your career!  Hired by Matrix Career Center: http://bit.ly/HbMCareers"}