{"jobID": "2812091328", "jobLocation": "Austin_TX", "jobTitle": "Business Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Data Analyst be supporting AML and Sanctions data analytics and reporting  3 Must have skills: Must be able to write SQL Queries and work with Teradata (think more of a technical side of a Business analyst), Strong data analytical skills, Strong excel and Tableau experience  This positions responsibilities include data ingestion, analysis, modeling and distribution.  Candidate will be joining a global, fast-paced environment, where cross-functional teamwork, high standards, and precise execution will be critical to their success.  Candidate will interact with various teams like Compliance Operations, AML - Legal, Product and Technology, Production, Operations, Collections, & Finance, etc. to build effective reporting solutions. Primary Job Responsibilities:Partners with Compliance Operations team in data gathering and analytics for AML DetectionAnalyze high-volume data to investigate, identify and report trends linked to AML compliance.Develops standardized reporting packages, and deliver ad-hoc reporting/analysis as required by businessWorks with large volumes of data for extraction and transformation leveraging Clients massive and rich databasesInvestigate, Identify and report tends linked to transaction monitoringDesigns optimal data architecture for data management and high performance.Designs and execute reports to measure success and performance of business initiatives.Automates data driven system controls for Operational proceduresPerforms data modeling, documents and present analysisBachelor/Masters Degree in Computer Science, Management Information Systems, or closely related quantitative discipline4+ years of related professional experienceExcellent written and verbal communication skillsAdvanced SAS programming skills on a UNIX/LINUX based environmentStrong PL/SQL programming skillsExperience working on multiple databases like Oracle, Teradata, MySQL etc.Experience with Statistical modeling using SAS, SPSS or RKnowledge of Business Intelligence Tools like MicroStrategy, Tableau is a plusStrong Excel skills, advance level a plusAssist in developing and testing of new risk mitigating rules through automated rules engineSupport the Global Payments Risk and Compliance team with ad-hoc analysis. Preferred Qualifications Knowledge in core AML products, risk typology, segmentation, scenarios, models, methodology, and AML toolsExperience with AML/Fraud Transaction Monitoring, Financial Investigations or similar disciplineCommunicate analytical results, findings and solutions clearly and concisely to all levels of leadershipAbility to multi-task and work without supervisionAbility to set timelines and meet deadlines; problem-solving skills and ability to conduct qualitative and quantitative analysis"}