{"jobID": "2788787721", "jobLocation": "Redwood_City_CA", "jobTitle": "Data Analyst", "companyRating": "4.5", "companyInfo": {"Website": "www.capitalgames.com", "Headquarters": "Sacramento, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Subsidiary or Business Segment", "Industry": " Media", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "73000", "jobDescription": " Electronic Arts Inc. is a leading global interactive entertainment software company. EA delivers games, content and online services for Internet-connected consoles, personal computers, mobile phones and tablets. Data AnalystLocation: Redwood Shores, CAThe Challenge Ahead: As a Data Analyst within the EA Mobile Quality Verification team you will play a key role in analyzing our operational data to improve our Quality Verification strategies. You should be a sharp, curious, and analytic individual who has a passion for diving into data to solve business problems. Your insights will influence how we build and verify the quality of ours games. What a Data Analyst does at EA:Receives questions from your game team, understands the questions, and determines the data needed to answer them.Assembles data from multiple sources, conducts analyses, performs research, designs, documents and implements analytical solutions.Presents analysis conclusions to the game team in a clear, understandable, and valuable way. Tells compelling stories supported by data!Takes responsibility and ownership for their active projects, always looking for new problems to solve and new concepts to implement.Communicates clearly (and as often as needed) with team members and business stakeholders.Builds strong relationships across the data analyst community, to share knowledge and learn from others.Presents high quality reports and findings in Power BI or as presentations.Builds metrics reporting systems and tracks process improvements across the team.Conduct analysis using statistical software, databases, spreadsheets, and reporting tools Design, evaluate and monitor key metrics, understanding root causes of changes in metricsDevelop and maintain scripts and queries to import, manipulate, clean, transform data from different sourcesBuild and share live dashboards and reports complete with user documentationPerform quality assurance on generated results to ensure accuracy and consistencyThe next great Data Analyst needs:2-3 years in a past analytical role.Data Analysis - Good knowledge of R language, MS Excel mastery, including VBA, PivotTables, and array functions -or other similar tools used for discovering data patterns and correlations through statistical methods.University degree in a technical field (e.g. Computer Science, Statistics, Engineering, Mathematics, Operations Research, etc.)Good math and analytical skills including statistics, simulation, and optimization - understanding of correlation, regression, classification and other statistical methods used to look at the data from different angles for use in prescriptive and predictive models.Expert data visualization techniques for charts and reports - good knowledge of Microsoft Power BI and/or Tableau.Must have very good database and SQL knowledge.Strong problem solving and creative thinking skills.Ability to start and maintain strong partnerships between valuable customers.Professionalism in working with clients and working in a team environment."}