{"jobID": "2725246961", "jobLocation": "Arlington_VA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.kenjya-trusant.com", "Headquarters": "Columbia, MD", "Size": "201 to 500 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Job Description: Kenjya-Trusant is seeking a candidate to fill the role of Data Analyst at The Office of Inspector General (OIG), Office of Audits (AUD), Audit Compliance and Follow-up Division (ACFD). The Data Analyst will assist the office in compiling, searching, and filing data; transmitting correspondence; and gathering and preparing information based on special requests. Clearance Requirement - Secret *Must have at time of application*Duties, Tasks and Responsibilities:Inputs data from incoming and outgoing compliance correspondence into the Compliance Analysis Tracking System (CATS) (an Access database) (Please note that the office may migrate the information in this database to TeamMate)Transmits outgoing correspondence prepared by compliance officers/analysts from the AUD compliance mailboxHandles classified material dailyPrepares templates for compliance correspondence after final audit report is issuedPerforms data searches in CATS and Teammate, as requestedSearches prior OIG audit and inspection reports in response to requests for informationSaves and files documents and e-documents in varying systems and formatsUpdates databases and spreadsheets timely and accuratelyCompiles data and other information into reportsUpdates and maintains Excel spreadsheetsCompiles and analyzes database informationMaintains electronic and hard copy folders that contain compliance materials, documents, and correspondence from final report to final action and report closureAssists the ACFD team in performing various administrative dutiesMaintains administrative reference materialsPrepares, or assists in preparing and formatting SOPs, presentation materials and other documentsDrafts meeting minutesRequired Experience:Strong ability to identify and interpret data and analyze data search resultsAbility to identify, analyze, and interpret trends or patterns in dataCapacity to acquire data from primary or secondary data sources and organize information logicallyDemonstrated skills using the Microsoft Suites and ability to convert documents into AdobeKnowledge of Teammate is preferredStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at queries, report writing and presenting findingsStrong attention to detail and precision in reporting data and informationDemonstrated knowledge of mathematics (or computer science, computer programming, or information management)Please note all candidates are required to provide the previous five (5) years of employment history as well as their most recent paystub for the purpose of salary verification.THE KENJYA-TRUSANT GROUP, LLC is a Service-Disabled Veteran-Owned Small Business that was established in 2015 as a merger between The Kenjya Group, Inc. and Trusant Technologies, LLC. Our mission is to implement, support and protect the nations advanced technology systems, business processes and high-technology facilities. Working with the Department of Defense, Department of Homeland Security, the Intelligence Community, state and local governments, and commercial clients, Kenjya-Trusant provides cyber protection, information technology, engineering, construction management and acquisition support services. We are a small company with big company benefits, including Health, Dental, Vision, 401K, Bonus Potential, Flexible Spending Account, Life Insurance, Short- and Long-Term Disability, Paid Time Off, and a culture of teamwork and continuous learning. Come grow with us! The Kenjya-Trusant Group is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. If you require accommodations, please contact our Human Resources Department at (410) 740-4045."}