{"jobID": "2709542162", "jobLocation": "Los_Angeles_CA", "jobTitle": "Senior Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": " Reporting to the Quality Director, the Senior Data Analyst is responsible for designing, developing, testing and documenting as well as maintaining reports. Analyze data for accuracy/inaccuracies. Recommend and implement new or modified reporting methods and procedures to improve report content and completeness of information. Provides subject matter expertise on all data elements and report content related to the data warehouse. Essential Functions:Extracts information from major systems/databases (Clarity from Epic in Teradata/Oracle) using techniques to validate, clean, complete and/or project values to address analytical questions.Provides assistance to departments in developing/modifying reports to measure and improve organizational performance.Responsible for testing reports for accuracy, modifying existing reports and enhancing reports as necessary.Serves as a technical resource to co-workers by assisting in problem resolution for data source analysis.Applies statistical analysis, clinical research design methods and systems analysis to address issues related to clinical interventions, goal monitoring measurement, health status and other health related analysis and projections.Guides/coaches and educates clients in the areas of quality improvement processes including establishing data sources and methods of collection, display and analysis. We are looking for a fairly technical person with great SQL knowledge and also with knowledge of a visualization tool (preferably Tableau or Crystal reports); Also, this person needs to communicate very well, so they can talk to users to get the requirements. Requirements Basic Qualifications: Minimum 6 years of experience manipulating large/complex data systemsMinimum 6 years of experience using SQL (within Teradata and/or Oracle is a plus)Experience using Visualization tools required (Business Objects Crystal Report and/or Tableau is a plus) Education Bachelor's degree in computer science or business analysis (or related degree or certification). Additional Requirements: Capable to understand business needs and translate them into technical specificationsAbility to manage multiple priorities effectively and work both independently and as part of a team requiredExcellent communication and organizational skillsExperience with Access and ExcelBenefitsSalary:Commensurate with experience.Cross Ocean Technologies, Inc. is an Equal Opportunity Employer that actively pursues and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, disability (mental or physical), gender identity or expression, genetic information, marital status, medical condition, military veteran status, national origin, political affiliation, pregnancy, race, religion or creed, sex, sexual orientation, or any other factor that is not related to the job."}