{"jobID": "2786396656", "jobLocation": "Troy_MI", "jobTitle": "Data Center Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Company Overview Nippon Seiki is a world-class manufacturer of instruments for vehicles, agricultural, and construction equipment. Established in 1945, Nippon Seiki Co., Ltd. is headquartered in Japan, with numerous facilities worldwide. N.S. International, Ltd. (\"NSI\"), a group company of Nippon Seiki, located in Troy, MI, is a tier one supplier of instrument clusters and head-up display units for FCA US, General Motors, BMW, Honda, Harley Davidson, Suzuki, Polaris, Arctic Cat and other OEM's.Purpose of Job The Data Center Analyst serves as a technical expert on architecture, design, implementation and support advanced technology solutions from Cisco, Dell, Lenovo, NetApp, EMC, Microsoft, VMware, and other vendors, in a variety of large and complex computing environments. This position serves as a staff specialist on multiple operating systems and platforms supporting enterprise-wide or large-scale computing. Responsible for troubleshooting all aspects of the data center equipment as reported by Nippon Seiki’s North American group companies’ (NSNA) users. The Data Center Analyst applies significant professional experience and training in information technology to the most complex assignments requiring sizing and optimization, systems monitoring and modification of systems, performance analysis, maintenance and management of networking, storage, backup, and appliances, and security administration.Major Duties/Responsibilities Top duties or activities with the approximate percentage of time spent on each duty in a given year. Not all tasks/steps performed are listed.Rank% ofRole FocusMajor Duty/Responsibility of Job 1. 30% Data Center Management – Supports maintaining the integrity, structure, performance, capacity, and security of the data center environment across North America. Designs, builds, configures, implements, maintains and provides support of servers including physical hardware, SAN storage, VMware/Windows/Linux operating systems, and data backup systems.  2. 20% Disaster Recovery Systems Management – Ensuring all systems are adhering to the appropriate schedules for backup and replication. Performs testing of backup solutions to ensure availability in case of DR situation. 3. 10% Capability Assessment - Interpret existing configurations and understand how the systems fit into the overall data center design and customer solution and offer recommendations to ensure systems are sized appropriately for workload. 4. 10% Audit Response – Responsible for performing internal audits and responding to external audits as required by the business. 5. 10% Network Administration – Implements and manages networking technologies such as routing, switching, firewalls, wireless, and unified communications.  6. 10% System Administration - Troubleshoots system errors or applications not operating, isolates problems from symptoms, assists with determining solutions or alternatives and implementing a resolution; if problem is user error then improve user instructions or train for better understanding.  7. 10% Other duties as assigned. Education, Experience and Knowledge Required and/or preferred level of education, knowledge and skills that are necessary.EducationBachelor’s Degree in related field, or equivalent applicable work experience.Related Experience7-10 years of overall IT experience strongly preferred. 3-5 years in a data center administration role strongly preferred. 1-2 years in a data center architect role strongly preferred. 1-2 years in a system administrator role preferred. 1-2 years in a network administrator role preferred. Special Training or Competency CCNA/CCNP, MCSA/MCSE Windows Server, VCA/VCP/VCAP preferred NSI CompetenciesAdaptation/Flexibility: Includes keeping an open mind regarding new ideas and ways of doing things. Willing to consider alternative interpretations or ways of looking at the situation. Demonstrating flexibility.Initiative/ Results Driven: Includes setting high standards of performance for self and others. Striving to accomplish goals even if it means personal sacrifice. Putting the goals of the organization above own goals.Judgment/ Decision Making: Includes making decisions and takes actions that have beneficial impact. Effectively evaluating information in order to come up with sound conclusions and recommendations.Resource Management: Includes setting clear objectives to guide action for self or others to accomplish goals. Organizing or adjusting information, people and materials to meet those goals.Team Work: Includes encouraging and supporting the ideas and effort of others. Finding ways to help the team or group perform effectively.Additional Information Work Hours Monday-Friday, 8:00 am – 5:00pm. Off-hours as needed. Travel Requirements Up to 10% international and/or domestic. Additional InformationUnsolicited resumes from search firms or employment agencies, or similar, will not be paid a fee and become the property of N.S. International, Ltd.DISCLAIMER The above information on this description has been designed to indicate the general nature and level of work performed. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job.N.S. International, Ltd. is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class."}