{"jobID": "2804622702", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Software Engineer, Front End", "companyRating": "4.6", "companyInfo": {"Website": "www.terminus.com", "Headquarters": "Atlanta, GA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "117000", "jobDescription": "Join Terminus' BrightFunnel team in San Francisco, and help B2B marketers show their true impact on revenue with the BrightFunnel Revenue Intelligence Suite. Terminus is one of the fastest-growing companies in B2B marketing technology and an Inc. Magazine Top 50 workplace in the nation. Since BrightFunnel became part of Terminus in January, weve been rapidly hiring in our San Francisco Sutter Street office.Founded in 2014, Terminus created the industry-leading Account-Based Marketing (ABM) platform and #FlipMyFunnel community that leads the ABM category. Now, were investing in marketing analytics and attribution, and were looking for more Terminators to join our team.Everyone at Terminus strives to provide the best customer experience and fanatically obsess over making each of our customers successful. We have a relentless commitment to supporting the personal and professional growth of our Terminators.Terminus is looking for a passionate Senior Software Engineer, Front End for our Application team in San Francisco. We are looking for a hands on leader who can help build our ABM Platform and products. Our application stack includes Angular, Rails, Go, Postgres, Elasticsearch and DynamoDB.Our ideal candidate is a skilled problem-solver with a deep understanding of user experience design and front-end development (HTML, CSS & JavaScript) as well as experience with emerging, modern JS frameworks. As a fast growing startup, Terminus offers an incredible opportunity for an engineer to learn, grow personally and professionally, and be part of building our company and culture.Responsibilities: Write and maintain scalable, efficient front-end code for the Terminus productWork with product, design and engineering team members to build features from concept through implementationMentor and share expertise and guidance with teammatesBe a major contributor in defining the direction of our web application and productQualifications:4+ years of significant experience with JavaScript or other modern programming languageSignificant experience with JavaScript Frameworks such as Angular, React, or VueSignificant experience with HTML and CSSUnderstanding of Web Services and JSONExperience with Typescript is a plusExperience with Postgres or MySQL is a plus What it takes to be a success: You love all things JavaScript and want to be an expert (or already are!)You have exposure to Angular or an eagerness to learn AngularYou strive to deliver quality production code, user interfaces and experiences.You have experience using Git/GitHub or other source control tool Incredible Company, Incredible Benefits! 100% employer paid Health, Dental, and Vision Insurance for employee only coverage100% Short-term and Long-term Disability Insurance401K with company matchUnlimited vacationGym membership reimbursementCasual dress all-day, everydayRegular team outings, parties, and surprisesWeekly free lunch, unlimited snacks and drinksWork from home dayCulture that emphasizes personal and professional growth"}