{"jobID": "2693958560", "jobLocation": "Downers_Grove_IL", "jobTitle": "Data Analyst", "companyRating": "3.0", "companyInfo": {"Website": "www.adtalem.com", "Headquarters": "Downers Grove, IL", "Size": "5001 to 10000 employees", "Founded": " Unknown", "Type": " Company - Public (ATGE) ", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "60000", "jobDescription": " As a Data Analyst for Chamberlain University, your primary responsibility is management of the data collection process. This including the manipulation and statistical analysis of multiple data sets, including sets that are both internal and external to the College. You are responsible for performing statistical analyses and translating the findings into conclusions and recommendations that can be understood by a non-technical audience. Collect/extract student-level data from various data sources, including student and faculty data (OSS), third party vendors, faculty and staff as well as other sources. You utilize various software and hardware interfaces including, but not limited to, OSS, Banner, and SQL.Merge data from multiple data sets using matching variables to create larger data sets.Develop new databases and data elements.Conduct quality checks on the completeness and accuracy of data pulled and merged into larger files.Perform statistical analyses on merged data sets using SPSS/PASW software.Present findings of analysis in non-technical terms that can be understood by a wider audience.Interface with IT project management office and IT personnel to ensure creation of the institution data warehouse - according to specifications and institution requirements.Merge campus-level and on-line program course schedules to create master schedule.Attend and participate in technical and other training.Assist with the writing and presentation of surveys and reports.Complete other duties as assigned. To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Below are the minimum requirements of the education, experience, knowledge, and skills required to competently perform in this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Bachelor’s degree in computer science, statistics, market research, educational research or related field is required. A Masters degree is preferred.A minimum of two years experience working with relational databases, preferably in an educational setting.Strong analytical skills.The ability to present complicated information in understandable terms.Knowledge of Microsoft Office Suite, SPSS, Access, relational databases, SQL required.Knowledge of Oracle Student System, Banner or Campus View student data platforms preferred.Knowledge of and experience using web-enabled survey platforms such as Insight Express, SurveyMonkey preferred.Experience with Sales Force.com and SharePoint, MS Power BI and R preferred.Experience working with a portfolio of multiple projects is highly desired.Ability to interact with personnel at all levels of an organization is highly desired. We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing. Thank you for applying for this outstanding opportunity today.  Chamberlain University is a rapidly-expanding university rich with opportunities for growth and offering competitive wages and benefits. If you enjoy being a part of an exciting team and working in a collaborative, dynamic environment, then Chamberlain University might be right for you.  Through Chamberlain Care®, we believe in taking care of those who take care of others. We offer a wide range of benefits that are intended to meet the diverse needs of our colleagues. Whether it's advancing your career, maintaining a healthy lifestyle or saving for retirement, our comprehensive benefit offerings can help you reach your goals.  As an educational organization, we also support and encourage colleagues to further their educations by offering tuition assistance and seminars through our Leadership Development Center.  If you are ready to join an institution like ours, we welcome you to apply."}