{"jobID": "2787693929", "jobLocation": "Dallas_TX", "jobTitle": "Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.moneymartfinancialservices.com", "Headquarters": "Malvern, PA", "Size": "Unknown", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Unknown", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Data Scientist Dallas, TX, USAFull-timeCompany DescriptionAre you interested in working with an energetic group of people? Looking for a fun and challenging environment where you are empowered to make decisions? Would you like the opportunity to progress within a growing, industry-leading company? If so, you've come to the right place. Let Us Inspire You!Who are we? Money Mart Financial Services has been helping people with their financial needs for over 30 years. We know that different hardworking folks have different financial needs, which is why we offer a range of different products and services including installment loans, payday loans, check cashing, prepaid cards, and money transfer. We believe our customers shouldn’t have to work hard to get the financial help they need, which is why Money Mart Finance Services is committed to evolving to meet the changing needs of our customers. With branches open late, it’s easy to see why more and more people choose us for fast, friendly, hassle-free solutions.  For anyone interested in working within the financial services sector, Money Mart Financial Services offers an excellent career path. We empower you to make decisions, foster career growth, and reward hard work. What do you do? This is a career, not just any ordinary job!! What do we need? You to have an amazing personality and communication style.  That you are super-organized and are a problem solver.  That you take pride in everything that you do, and it shows.  And most importantly that you have unquestionable integrity. Why work for us? We invest in our employees, and offer extensive training, and development programs to set you up for future success.  If we sound like a fit, and you’re ready to start an exciting career with an organization that fosters employee growth, apply today!Job DescriptionDUTIES/RESPONSIBILITIES Develop marketing, credit risk models, segmentation, and risk analyticsPerform all required tests and measures of developed modelsDeliver comprehensive model documentation (e.g., Model Development Document, Technical Specification Document) of modeling projectsUnderstand and follow modeling procedures, credit policies, and deliver technical/regulatory documentation for internal/external reviewsCommunicate technical information verbally and in writing to both technical and non-technical audiences QualificationsEDUCATION Advanced Degree (Masters or PhD preferred) in Statistics, Applied Mathematics, Operations Research, Statistics, Economics, Quantitative Finance. MBAs should apply only if they are interested in career in specialized quantitative risk management discipline EXPERIENCE Entry level position. Any experience in statistical modeling fields is preferred SKILLS Very strong knowledge of statistics methods and machine learning techniquesStrong numerical programming ability using a range of languages (SAS, R, Python); working experience with SQLDetail-oriented with high degree of accuracyStrong analytical, problem-solving and critical-thinking skillsExcellent verbal and written communication skills Additional InformationWe offer a full benefit package, 401k matching, tuition reimbursement, free gym access, 12 paid holidays, paid time off, etc.  All your information will be kept confidential according to EEO guidelines.I'm interested"}