{"jobID": "2827043364", "jobLocation": "Los_Angeles_CA", "jobTitle": "Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.cbsinfosys.com", "Headquarters": "Fremont, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "83000", "jobDescription": "Job Title :Data ScientistLocation:Los Angeles, CA.ROLE: Data Science:Position PurposeThe main purpose of this position is to help our clients solve their business problems by providing deep, meaningful and interpretable business insights using advanced analytics and machine learning techniques. It is intended that these business insights will directly aid our clients in the decision-making process to solve their pressing business challenges and problems related to operations, finance, and/or IT. Position Responsibilities:Understand & Define business problems, research analytical solutions, and figure out the data to be used in providing the needed business insight(s).Query, assemble, clean, normalize and transform (if needed) datasets in preparation for analysis.Analyze data using a variety of advanced analytics and machine learning techniques in order to build an initial proof of concept for your solution.Build high-quality prototypes and implement the solution in a scalable framework, e.g. Spark.Train, Test and Validate the analytical models to ensure that the model achieves and/or exceeds the expected accuracy levels.Communicate findings to product owner and a broader audience of technical and non-technical co-workers.Lead projects, work on teams, and mentor junior analysts/ data scientists.Innovate and continue to improve the accuracy of the models using variety of techniques.Collaborate with other data scientists as needed to improve the models and the insights.QualificationsExperience with statistics, mathematical modeling, and/or machine learning, and experience implementing such methods to tackle business problems.Experience with Programming in Python &Spark; &Spark; Streaming is neededKnowledge of big data tools and frameworks, such as Spark, Hadoop, Sqoop, Kafka is a plus.Hands on experience with supervised as well as unsupervised machine learning techniques to solve business problems.Experience in the Financial asset / wealth management industry is preferred but not mandatory.Experience working in an Agile environment is preferred but not mandatory.Educational QualificationsA Bachelor's degree plus 4-5 years of experience as a Data Scientist or a Master's degree plus 2-3 years of experience in a related field.Master's degree in Business/Data Analytics is a plus Central Business Solutions, Inc,  37600 Central Ct.  Suite #214  Newark, CA 94560."}