{"jobID": "2786501835", "jobLocation": "Washington_DC", "jobTitle": "Advocacy Account Manager", "companyRating": null, "companyInfo": {"Website": "www.fiscalnote.com", "Headquarters": "Washington, DC", "Size": "51 to 200 employees", "Founded": " 2013", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About Account Management at FiscalNoteCommitted to turning clients into champions, the Account Management team dedicates itself to fully understanding client goals, highlighting workflows and solutions that help achieve those goals and encouraging successful adoption of our platform across all client users. Understanding that the client is king, the team works to incorporate valuable client insight in the product development process, while also aligning with Business Development and Marketing to relay successful use cases to both the FiscalNote team and the greater world. Account Management team members are the renaissance men and women of FiscalNote -- always up to the task of intelligently speaking about any issue a client may toss their way. About the PositionWe are in search of an engaging Advocacy Account Manager to act as not only our clients’ advocate, but also their unofficial consultant in helping them leverage our powerful solutions throughout their lifecycle. Skilled at uncovering client pain points and adept at understanding organizational goals, our Advocacy Account Manager serves as an extension of their clients’ team, collaborating with them to provide solutions and ensuring FiscalNote is delivering value across all levels of an organization. Personable and analytical, this individual can aptly leverage policy and technical skills to implement customized software projects, while building strong, personal relationship that lead to renewal and contract expansion. You Will- Manage a portfolio of clients with an emphasis on our Voter Voice grassroots advocacy solutions - Work closely with our Business Development team to identify opportunities that will increase revenue within portfolio through cross-sell and upsell - Minimize both client and revenue churn- Lead and manage renewal process for client portfolio- Identify and drive best practices across client portfolio- Partner with our implementation and support team to ensure new clients and new users are onboarded successfully - Actively collaborate with Product and Marketing teams - Track and monitor client metrics- Intelligently engage in conversation regarding the advocacy space, as well as legislative and regulatory processesAbout YouA team player, willing and enthusiastic to pitch in wherever necessary to support both clients and the company. Poised and confident, you are both a skilled listener and a convincing presenter with an eye for detail. You can comfortably navigate the worlds of both technology and policy and easily tailor communication across levels of an organization. Tackling the root cause of others’ issues and creatively identifying solutions brings you immense joy in both your professional and personal lives. You prefer data-driven insights rather than anecdotal evidence to drive your decisions and actions and are comfortable talking data, tech and current events. You Have- A bachelor’s degree- 2+ years of relevant professional experience in grassroots advocacy and/or technology and project management- High-performance record of people and relationship management- Strong written and verbal communication abilities, as well as exceptional organization skills- Sales experience and proven track record of hitting sales goals (preferred)- Proficiency with Salesforce (preferred)- Experience working in an account management/client success capacity with a SaaS product (preferred)Company BenefitsFiscalNote offers competitive salaries, equity packages, and retirement accounts to ensure we’re all FN owners. We work hard, so we want you to play hard; our open vacation policy and vacation expense contribution help us ensure you’re getting the R&R; you need. We offer a comprehensive health, vision, and dental insurance options including a Flexible spending account. We have a slew of other benefits which you can check out at careers.FiscalNote.comFiscalNote values diversity. We are committed to equal opportunities and creating an inclusive environment for all our employees. We welcome applicants regardless of ethnic origin, national origin, gender, race, religious beliefs, disability, sexual orientation or age. FIscalNote is an EEOC.FiscalNote uses E-Verify to confirm the employment eligibility of all new employees. To learn more about E-Verify, including your rights and responsibilities, please visit www.DHS.gov/E-VerifyApply"}