{"jobID": "2817435228", "jobLocation": "Santa_Clara_CA", "jobTitle": "Automotive Service Manager Hiring Bonus-Up to $2K", "companyRating": "3.4", "companyInfo": {"Website": "www.aamco.com", "Headquarters": "Horsham, PA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Construction, Repair & Maintenance", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "63000", "jobDescription": " As a Sales Representative you will be responsible for creating and building relationships with new and existing customers to ensure outstanding customer service. Hitch a ride with the biggest player in the industry as we remake a business that will be vibrant and viable as long as there are cars on the road!  We are looking for a talented and competitive Sales Representative that thrives in a quick sales cycle environment. The successful candidate will play a fundamental role in achieving our ambitious customer acquisition and revenue growth objectives. You must be comfortable making dozens of calls per day, generating interest, qualifying prospects and CLOSING SALES.Position Responsibilities:Meeting and greeting customersManaging technician workflowRecommending services to customersOrdering parts and inventoryKeeping customers updated on the status of their vehicles' repairsManaging and tracking lead counts as well as customer satisfaction ratingsGenerating and closing salesDeliver a high level of customer service and quality control over all aspect of the center's business, operations, and work productWhat We Offer:Competitive compensation packages and incentive programsOngoing training and field supportHigh Income PotentialDaytime work hoursGrowth opportunityJob Requirements:Minimum of 2-3 years of sales experience with a track record of successThis is not a retail sales role! Complex sales experience is requiredExcellent one time closing skillsStrong commitment to customer service and relationship buildingAbility to communicate and use interpersonal skills at a sustained high levelCapable of multi-tasking and executing in a fast paced environmentHonest, goal-oriented and energetic team playerMust have valid driver's license If you are interested in this position, please feel free to apply through this site or contact Megan Cabot at 267-464-7252,"}