{"jobID": "2786922164", "jobLocation": "San_Francisco_CA", "jobTitle": "Sales Operations Manager", "companyRating": "4.3", "companyInfo": {"Website": "www.socialchorus.com", "Headquarters": "San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2008", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "91000", "jobDescription": "The modern workplace is changing. It seems strange but in a world of connected everything, employees are feeling more disconnected than ever. Want to fix that?SocialChorus is the leading mobile workforce communications platform that transforms how workers and organizations connect every day. Designed for every worker from head office to the front line, our solution enables a more informed, connected and supported workforce. Organizations that depend on SocialChorus are able to connect and align their teams, power organizational initiatives and measure the business outcomes.We are currently seeking a Sales Operations Manager to be the centerpoint of our Sales Development, Field Sales, Partner Support, Sales Support, Deal Desk and Revenue Management team. You will report to the VP of Worldwide Sales and work across these teams to ensure the systems, workflow, and people are aligned and working smoothly to consistently enable delivery of sales.ResponsibilitiesProvide thought leadership, insightful analysis, and recommendations in the sales operations function.Partner and collaborate with key stakeholders to optimize our existing processes and tools, and replace/integrate new ones when appropriate.Define and continually improve our reporting strategies and processes, and develop the associated reports and dashboards.Support and optimize the finance related aspects of sales ops & revenue recognition.Lead the deal desk function, with support from finance and sales enablement. Includes pricing, quoting, and contract management.Administer our Salesforce instance to support marketing, sales, services, partners and finance.Manage the associated tool stack that enables business processes across all teams. These tools include (but are not limited to): Outreach, ReachForce, 6sense, ZoomInfo, DiscoverOrg. Critical Success Factors Highly team-oriented and collaborative, ability to work effectively in an ambiguous and constantly changing environment.Ability to design and execute changes in sales operations that significantly impact the business.Overall business acumen and judgment, with application in deploying internal resources, budgets, contracts, and customer negotiations.High degree of productivity and time management skills; able to continually juggle multiple (often competing) requests and deliver the desired business results.Quickly learn and continually expand knowledge of market-leading sales tools, our SaaS platform, and the markets we serve.QualificationsBA/BS degree5+ years of sales operations, sales and/or sales support experience. Including:3+ years of sales operations in a SaaS or similar environment.3+ years of sales operations in a SaaS or similar environment.3+ years administrative experience with Salesforce.com (MUST HAVE Salesforce experience).Thorough knowledge of Salesforce configurations.Proficiency with associated tools & applications: (Dataloader / Workbench) and 3rd party sales enablement and business automation platforms.Solid business analytical skills, and strong capability to implement in Excel and Tableau or similar data analysis tools.Why SocialChorus?Because you care. About people, the work you do, and the connections you make. Work is such a large part of life, it only makes sense to make it awesome.If you want to engage brilliant minds in a true start-up environment where ideas are rewarded regardless of who they come from, join us. This is a rapidly changing space so if you thrive on ambiguity, are hungry for a challenge, and have the guts to speak your mind it could be a perfect fit.Come for the challenges, come for the people, and the unlimited PTO, stock options, health benefits, 401(k) plan, casual and friendly environment, and a leadership team who truly believes in your growth both professionally and personally will keep you here."}