{"jobID": "2705265777", "jobLocation": "South_San_Francisco_CA", "jobTitle": "Principal Scientist - NGS assays", "companyRating": null, "companyInfo": {"Website": "www.freenome.com", "Headquarters": "South San Francisco, CA", "Size": "51 to 200 employees", "Founded": " 2014", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "About The Role At Freenome, you will help develop the assay technologies used to analyze patient samples and contribute to our mission of early detection and intervention in human disease. As a Principal Scientist, you will be the internal subject matter expert in next-generation-sequencing (NGS)-based analyses of DNA and RNA. You will be responsible for the conception, design, execution, and optimization of new assays for measuring cell-free nucleic acids by high-throughput sequencing. You will work closely with Computational Biologists and Machine Learning Engineers to develop new pipelines for analyzing NGS data, to identify ways to rapidly iterate and improve on existing analytical methods, and to evaluate new technologies that can enhance our end-to-end test performance.Responsibilities Apply expert knowledge of molecular biology, nucleic-acid biochemistry, and next-generation sequencing to develop new (and refine existing) assays for DNA and RNA analyses, including genome-wide and targeted approaches. Optimize protocols and workflows upstream of sequencing, including biofluid sample collection, nucleic acid extraction and quantitation, and library preparation. Lead from the bench by training and mentoring a team of scientists while also performing your own experiments in order to facilitate rapid progress toward project goals. Provide expert advice and guidance to the other members of the lab R&D; team, especially on matters related to NGS-based assays and data analysis. Collaborate with Computational Biologists and Machine Learning Engineers to build analysis pipelines and to evaluate the cost/benefit of integrating new molecular technologies into our analytical workflow. Collaborate with clinical laboratory members to transition development protocols into clinical production, including automation, validation experiments, and SOP development.What We're Looking For PhD (or equivalent industry experience) in molecular biology, biochemistry, genetics, chemistry, or a related field. 5+ years post-PhD experience in NGS-based assay development. Broad, expert-level knowledge of next-generation sequencing assays for DNA and RNA, including both general nucleic acid biochemistry as well as specific optimizations for different applications, sequencing platforms, and analytes. Proven track record of establishing new methods for NGS-based measurements of biology (*-seq) that go beyond kitted assays. Ability to perform basic bioinformatics analyses to enable experimental iteration independent of external support. Experience managing scientific teams and mentoring junior scientists. Clear communications skills and ability to work with team members in the same and adjacent disciplines.Nice to Haves Knowledge of bioinformatics tools used for NGS data analysis and ability to independently perform advanced analyses of sequencing data. Understanding of the biology of human cell-free nucleic acids, single-cell analysis methods, immunology, and/or cancer biology. Ability to design for automated platforms in plate-based, low-volume formats and/or microfluidics and experience working with automated liquid handlers. Advanced computing skills, including expertise in Linux and a general-purpose or scientific programming language (Python, R, Java, C, C++). Hands-on proficiency in managing technology transfer requirements, including guard-banding and stability studies, in-process quality control, etc. Experience working in a regulated laboratory environment (CLIA, GLP/GCLP, IVD development)."}