{"jobID": "2795346660", "jobLocation": "Bellmawr_NJ", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "We’re looking to add a detail-oriented, methodical, and collaborative data analyst to our growing team of driven professionals. We need someone who is willing to role up their sleeves and help take us to the next level. As a data analyst, you will play a key role in our organization. Your primary goal will be to leverage data and communicate your findings to help us make smarter, data-backed business decisions. Experience working in a manufacturing environment is a plus!Data Analyst Job Duties and ResponsibilitiesAnalyze data using statistical methods.Create reports to share your findings and recommendations with the internal team and other stakeholders.Collaborate with leaders and managers to determine and address data and reporting needs for various company projects.Create statistical models that depict company-wide trends.Perform testing and validation of data sets.Determine the meaning of data and explain how various teams and leaders can leverage it to improve and streamline their processes.Document structures and types of business data.Data Analyst Job Requirements and QualificationsBachelor’s degree in mathematics, statistics, computer science, information technology, or related field.Ability to identify useful information in data sets and suggest conclusions that support decision making.Strong analytical capabilities.Expert with Microsoft Excel and various business intelligence and analytical tools.Understanding of data gathering, inspecting, cleansing, transforming, and modeling/diagramming techniques.Communication skills with the ability to distill complex subjects to a wider audience.Excellent leadership, collaboration, and project management skills.Keen attention to detail.Willingness to make decisions and solve problems.At least 5 years of experience in a data analyst roleExperience with Weka, KNIME or QlikView required"}