{"jobID": "2547905945", "jobLocation": "Laurel_MD", "jobTitle": "Combat Systems Data Analyst/Engineer", "companyRating": "4.6", "companyInfo": {"Website": "www.jhuapl.edu", "Headquarters": "Laurel, MD", "Size": "5001 to 10000 employees", "Founded": " 1942", "Type": " Nonprofit Organization", "Industry": " Aerospace & Defense", "Revenue": " $1 to $2 billion (USD) per year", "Competitors": " MIT Lincoln Laboratory, Lockheed Martin, Northrop Grumman"}, "estimatedSalary": "84000", "jobDescription": "Combat Systems Data Analyst/Engineer-15161Position DescriptionIntroduction: The Force-Level Computing and Systems Development Group (A3A) of the Air and Missile Defense Sector (AMDS) is looking for a full-time combat system analyst to assist in the test and evaluation of next generation combat systems for the Navy. The ideal candidate will be self-motivated, organized, detail-oriented, curious, and will like to solve puzzles. Job Summary: Participate in analysis of combats system data systems engineering efforts to develop effective functionality for next generation surface Navy combat systems. Duties (Listed in order of importance with the estimated amount of time spent at each task):Analyze data from combat system test events and simulation environments with an initial focus on anti-air warfare (AAW) fire control loop (FCL). (50%)Further investigate system-of-systems interactions through requirements analysis, root cause analysis, interface description documents, and consultation with subject matter experts. (30%)Perform simulation studies in support of root cause analysis, issue resolution, and testing. (10%)Support sponsors by observing test events and communicating evaluation of end-to-end combat system performance. (10%)Note: This job summary and listing of duties is for the purpose of describing the position and its essential functions at time of hire and may change over time.Qualifications: Required Qualifications:BS in Engineering, Mathematics, Physics, Computer Science or equivalent.1-5 years of demonstrated ability to develop innovative solutions and conduct detailed analysis or similar experience gained academically via coursework or school projects.Familiarity with MATLAB, C++, Java, or similar programming languages.Familiarity with established systems engineering best practices. Knowledge of probability and statistics.Demonstrated analytic capabilities, firm math foundation, strong written and oral communication skills.Must have ability to obtain a Secret clearance.Desired Qualifications:MS or PhD in Engineering, Mathematics, Physics, Computer Science or equivalent.Demonstrated ability to work with others to reach a common goal.Experience using MATLAB and Simulink.Knowledge of advanced physics, and computer programming.Background in combat systems, radar systems, Cooperative Engagement Capability, and/or missile integration.Current SECRET (or above) clearance.Special Working Conditions Travel as required to meetings in the DC region including Dahlgren, VA. This position requires infrequent (20-25%) CONUS travel to government and contractor facilities to support test and analysis. It also requires very infrequent work hours outside of normal business hours to support off-site test events. Occasional travel to contractor sites or test facilities requiring air travel. Security: Applicant selected will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship. Benefits: APL offers a comprehensive benefits package including a liberal vacation plan, a matching retirement program, significant educational assistance, a scholarship tuition program for staff with dependents, and competitive salaries commensurate with skills and experience. For more information about our organization, please visit our web site at www.jhuapl.edu. Equal Employment Opportunity: Johns Hopkins University/Applied Physics Laboratory (APL) is an Equal Opportunity/Affirmative Action employer that complies with Title IX of the Education Amendments Acts of 1972, as well as other applicable laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, sexual orientation, gender identity, national origin, disability, or protected Veteran status.Primary Location *United States-*Maryland-*LaurelSchedule Full-time -"}