{"jobID": "2822539818", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Business Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.addastaff.com", "Headquarters": "San Mateo, CA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "We are looking for candidates that are local to San Francisco, CA or that reside in the San Francisco bay area within a reasonable commute to San Francisco. Job title: Senior Business Data Analyst  Location: San Francisco, CA  Type: Long term contract  The Senior Business Analyst interacts between the business users and the technical organization involved in planning, conducting, and directing the analysis of highly complex business problems. The Analyst supports multiple lines of business in projects loading data into the data mart and extracting data from the mart. They build technical specifications that ensures the business receives the right data. Responsibilities: Performing business analysis and design activities at the strategic, operational, and organizational level Collaborating with management to ensure timely and successful issue resolutionProviding new capabilities and driving value from existing capabilitiesCoordinating the efforts of internal and external technical and nontechnical staff, and of key users in the support of existing data Works with the business to come up with technical solutions for data projects Define and document business and functional requirementsEngage and direct business partners and subject matter experts to identify priorities, scope, and requirements for complex business problemsManage and perform complex business and systems analysisProvide technical assistance in identifying, evaluating, and developing systems and procedures that are cost effective and meet business requirements.Engage technical development team members to transition requirements to design, and to determine appropriate design approachPlan and execute system testing and user acceptance testingServe as a subject matter expert and visionary for the business community and technical teamsProject planning and management of business team deliverables Experience 10+ yrs. in Business Intelligence & Analytics performing business & data analysis for risk data marts and other related projectsInterfacing with business and understanding business requirements and existing systems.Analyze existing systems and data used by businessSQL must be able to form simple SQL queriesProduce source->target mapping documentsProduce BRDs, functional & technical specification, test plans, test casesTesting data warehouses and data martsKnowledge of banking and financial industry including Loans, Deposits, GL, Wealth ManagementPreferred experience with risk data in a banking domain To view all our open roles, please visit http://www.addastaff.com/careers/ "}