{"jobID": "2829295401", "jobLocation": "Santa_Clara_CA", "jobTitle": "Scientist - Materials Analyst", "companyRating": "3.6", "companyInfo": {"Website": "www.abbott.com", "Headquarters": "Mumbai, India", "Size": "10000+ employees", "Founded": " Unknown", "Type": " Company - Public", "Industry": " Biotech & Pharmaceuticals", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "110000", "jobDescription": " At Abbott, we're committed to helping people live their best possible life through the power of health. For more than 125 years, we've brought new products and technologies to the world -- in nutrition, diagnostics, medical devices and branded generic pharmaceuticals -- that create more possibilities for more people at all stages of life. Today, 99,000 of us are working to help people live not just longer, but better, in the more than 150 countries we serve.  Primary Job Function Provides Abbott Vascular R&D; Engineering Staffs Legal, Marketing, and external clients with data regarding questions and problems concerning materials,  processes, new technologies, and methods related to the development and use of Abbott Vascular products. This data will be generated  utilizing thermal chemistry, spectroscopic chemistry, optical microscopy, electron microscopy and/or elemental analyses. The data will be in the  form of images and/or spectra. Official Abbott Vascular reports will be written,  archived, and issued by the analyst.  Core Job Responsibilities Responsible for compliance with applicable Corporate and Divisional Policies  and procedures. Evaluates written requests to perform materials analysis. Determines if the request can be accomplished with in-house technology or if it has to be assigned to an Abbott Vascular authorized, outside laboratory.; Prepares samples for the specific type of analysis required or requested (FTIR, DSC, Confocal RAMAN, TGA, DMA, FEM, SEM, EDS, etc.).;Analyzes specific characteristics of the material, process, or failure morphology by comparing with known characteristics from which to  draw conclusions.; Creates Abbott Vascular reports using the Laboratory Information Management System (LIMS), for all requests. Archives data, images, and  analyses.; Maintains laboratory instrumentation in good working order. Arranges for service and repairs from vendor for major problems.; Creates Departmental Operating Procedures (DOPs), Laboratory Operating Procedures (LOPs), Business Documents (BUS), Equipment Validations (EQPs),  and Testing Protocols/Validations, as required, in order to assure consistent and proper operation, calibration, and maintenance of the laboratory's  instrumentation.  (Supervision Received) Works under general supervision. Receives limited  supervision on standard issues, and detailed instructions on new assignments.  Work is reviewed for soundness of judgment, overall adequacy and accuracy.;  (Supervision Provided) May provide limited work direction and guidance to  exempt and/or skilled nonexempt levels of employees; may be asked to  evaluate performance of and assist in career development planning for  subordinates.  Position Accountability / Scope (Influence/Leadership) Cultivates a wide range of internal networks and begins  to develop an external network of resources to facilitate completion of tasks.  May demonstrate basic project management skills by acting as a project lead on small, well defined projects. Provides guidance to less  experienced staff. Influence exerted at peer level and occasionally at first levels  of management.;  (Planning/Organization) Plans, organizes, and prioritizes own daily work  routine to meet established schedule.;  (Decision Making/Impact) Exercises authority and judgment within  defined limits to determine appropriate action. Failure to achieve results or erroneous decisions or recommendations may cause delays and may result in  the allocation of additional resources.  Minimum Education  Bachelor's degree (Chemistry preferred) plus 2-5 years of related work  experience with a good understanding of specified functional area, or an  equivalent combination of education and work experience.  Minimum Experience / Training (Technical/Business Knowledge (Job Skills)) Working knowledge and application of business concepts, procedures and practices. Will perform this  job in a quality system environment. Failure to adequately perform tasks  can result in noncompliance with governmental regulations.;  (Cognitive Skills) Works on problems of moderate scope where analysis  of situations or data requires a review of identifiable factors. Exercises judgment within defined procedures and practices to determine  appropriate action. Has a general knowledge of technical alternatives and  an understanding of their impact on the systems environment. NO RELOCATION ASSISTANCE IS AVAILABLE FOR THIS POSITION. An Equal Opportunity Employer  Abbot welcomes and encourages diversity in our workforce.  We provide reasonable accommodation to qualified individuals with disabilities.  To request accommodation, please call 224-667-4913 or email corpjat@abbott.com"}