{"jobID": "2834431482", "jobLocation": "Santa_Clara_CA", "jobTitle": "Data Scientist, AMP Marketing Analytics", "companyRating": "4.0", "companyInfo": {"Website": "www.apple.com", "Headquarters": "Cupertino, CA", "Size": "10000+ employees", "Founded": " 1976", "Type": " Company - Public (AAPL) ", "Industry": " Information Technology", "Revenue": " $10+ billion (USD) per year", "Competitors": " Google, Microsoft, Samsung Electronics"}, "estimatedSalary": "163000", "jobDescription": "Data Scientist, AMP Marketing Analytics Job Number: 113796339Santa Clara Valley, California, United StatesPosted: Jul. 3, 2018Weekly Hours: 40.00 Job SummaryAt Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. If you are a self-motivated, high-energy individual who is not afraid of challenges, we’re looking for you.  Apple is seeking an expert Data Scientist to join a team passionate about Marketing Analytics for Apple Media Products (AMP), which covers the App Store, Apple Music/iTunes, Video and other services.  This role will involve working with internet-scale data across numerous customer touch points, developing capabilities tied to audience profiling, marketing attribution and performance monitoring, plus undertaking deep quantitative analysis and building models to drive program/channel strategy.  The team’s culture is led by a dream to get things done iteratively and rapidly with open feedback and debate along the way, plus collaboration with Product, Engineering, Business and Marketing partners.Key Qualifications 3+ years of experience in a Data Scientist or Data Analyst role, preferably for an app or digital subscription business.You should have a strong and curious business mindset with an ability to condense complex concepts and analysis into clear and concise takeaways that drive action.Well-versed SQL languages. Experience with big data technologies such as Hadoop and Spark preferred.Familiarity with Python or R and data visualization tools such as Tableau for full-stack data analysis, insight synthesis and presentation.Experience using relevant statistical packages to build predictive/ML models.Familiarity with A/B test experimentation design.Expertise in modern marketing technologies, techniques and strategies across Performance, Owned, Brand and Partnership channels.Excellent communication, interpersonal and presentation skills with meticulous attention to detail.Excellent time management skills with the ability to lead work to tight deadlines and handle the pressure of executive requests and product launches. Description- Segment and cluster accounts according to activity and engagement. Develop attribution models spanning multiple customer touch points and domains to accurately reflect and monitor marketing performance.Help build timely dashboards to measure marketing performance by line of business, channel, platform and country.Undertake deep quantitive analysis and design A/B test experiments to optimize marketing program/channel strategy according to line of business, audience, content and scheduling.Build models to predict account acquisition, churn, retention, winback and LTV plus more automatically trigger relevant and timely marketing messages.Collaborate with Product, Engineering, Business, Marketing and Executive teams to compile regular presentations for C-level about the ongoing performance of Marketing.Partner with other Apple organizations on data privacy, data gathering, data governance, evangelizing critical metrics and democratizing data.EducationMinimum of a Bachelor’s degree in Computer Science, Statistics, Mathematics, Engineering, Economics or relevant field. Ideally, Masters in related field."}