{"jobID": "2804023955", "jobLocation": "Santa_Monica_CA", "jobTitle": "Senior Big Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.mwpartners.net", "Headquarters": "Santa Ana, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Unknown", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "MW Partners is currently seeking for an experienced Senior Big Data Engineer to work for our client who is a technology driven marketing solutions company. In this position you will be advancing the development of new and existing analytic audience products through quant and engineering principles. You will also be working with big data to solve business challenges with math and software development.Responsibilities and duties:Translate business challenges into analytic frameworks and apply data operations and machine learning methods to massive data sets to create business value.Rapidly architect, research, design, prototype, and implement scalable, efficient, analytic solutions.Design and implement measurement instrumentation for method evaluation, monitoring, and optimization.Work independently, but also collaborate within Data Science team and with other engineers and stakeholders.Requirements:Minimum of 5 years software development experience.Deep understanding of computer science, especially data structures and algorithm design.Knowledge of theory and application of {machine learning, data mining, and statistics} methods for large, complex data sets.Experience owning the complete modeling life cycle from data exploration, feature management, model building, and evaluation.Experience with big data tools (Map/Reduce, Hadoop, Hive, Spark, etc.).Fluency with one or more high-level programming languages (Python, Scala, Java, C, C++)Ability to build quick prototypes to demonstrate value – and then improve them.Proficiency in Linux (shell tools, scripting, and basic admin).Ability to communicate complex ideas in data science to relevant stakeholders.Excellent organization skills and attention to detail.Collaborative, positive attitude with desire to work in a demanding, fast-paced, and dynamic work environment.Strong problem-solving skills with focus on business value creationSelf-sufficiency to understand problems and frame/execute their solutions.Leadership, passion, and curiosity.For a confidential discussion or to find out more, contact Sophia Wilkoszewski on 949-468-1070 or apply now."}