{"jobID": "2766786719", "jobLocation": "McLean_VA", "jobTitle": "Data Exploitation Analyst", "companyRating": null, "companyInfo": {"Website": "www.boozallen.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1914", "Type": " Company - Public (BAH) ", "Industry": " Business Services", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Accenture, Deloitte, PwC"}, "estimatedSalary": null, "jobDescription": "Job Number: R0004871 Data Exploitation AnalystKey Role:  Lead data exploitation, analysis, and outreach efforts on financial data. Apply expertise in the energy sector or commerce, banking, or trade industries to conduct trend analysis and inform customers of intelligence gaps and opportunities. Serve as an officewide resource to assist analysts and targeters with the development of financial networks using financial data. Present findings in a format appropriate for presentation to national security policymakers. Conduct outreach to communicate capabilities and train mission partners on methodologies, as needed.  Basic Qualifications:  -Experience as an all source or intelligence analyst for the US Intelligence Community (IC)  -Experience with energy, commerce, banking, trade, or finance  -Knowledge of the East Asia AOR  -Ability to work on multiple concurrent tasks in a fast-paced environment  -Ability to network across several components and organizations to support a variety of projects  -Ability to extrapolate relevant information from unstructured data sources  -Ability to interact with various IC partners daily TS/SCI clearance with a polygraph  -BA or BS degree required  Additional Qualifications  -Experience with analyzing financial data or relevant financial services  -Experience in working with the US Treasury or other financial sanctions and enforcement entities  -Knowledge of emerging financial technologies and US Financial Privacy and Foreign Intelligence Surveillance Act laws  -Ability to show proficiency in Korean language preferred  Clearance:  Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; TS/SCI clearance with polygraph is required.  Were an EOE that empowers our peopleno matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, or veteran statusto fearlessly drive change."}