{"jobID": "2766765181", "jobLocation": "Menlo_Park_CA", "jobTitle": "Research Scientist, Connectivity Labs - ML/AI Communications", "companyRating": "4.5", "companyInfo": {"Website": "www.facebook.com", "Headquarters": "Menlo Park, CA", "Size": "10000+ employees", "Founded": " 2004", "Type": " Company - Public (FB) ", "Industry": " Information Technology", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Google, Snap, Uber"}, "estimatedSalary": "153000", "jobDescription": " Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities we're just getting started.We believe connecting the world is one of the greatest challenges of our generation, and that everyone deserves access to the knowledge, tools and opportunities that come from being connected. Thats why we, along with other tech companies, launched Internet.org, a global partnership to make the Internet available to the two thirds of the world's population that doesnt have it. The Connectivity Labs team works on developing new platforms and solutions for connectivity. Connecting the un- and under-connected requires advanced technological breakthroughs, and Machine Learning (ML)/Artificial Intelligence (AI) is uniquely positioned to make communication systems more efficient using large datasets at various stages.  We are looking for someone who has demonstrated success as a leading researcher and is adept at collaboratively evaluating problems from a global level to the nanoscale in a variety of domains that include, but are not limited to; optical, wireless and wireline communications systems and software. Come join us and help grow a world class research team to support our connectivity efforts. Responsibilities:"}