{"jobID": "2586472757", "jobLocation": "Houston_TX", "jobTitle": "Data Analyst", "companyRating": "3.5", "companyInfo": {"Website": "www.mustangcat.com", "Headquarters": "Houston, TX", "Size": "501 to 1000 employees", "Founded": " 1952", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $500 million to $1 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "43000", "jobDescription": "Mustang Cat, the authorized Caterpillar earthmoving equipment, power systems, and vocational truck dealer in Southeast Texas, has one single focus: partnering with our customers to help them solve their toughest problems. As a Cat dealer with more than 60 years of experience, we have dedicated ourselves to providing customers complete solutions for all their equipment needs.  Mustang’s reputation is built upon solving our customers’ problems and providing world-class service. Our heritage of innovation and relentless pursuit of continuous improvements is focused on improving our customer’s business and being an asset to the communities we serve.The Data Analyst is the Mustang CAT owner for customer and prospect data used to support marketing campaigns and related decision making. This position also completes segmentation and data analysis used to target customers and prospects for marketing efforts, reviews and analyzes external information, identifies market trends, target groups, and opportunities, and facilitates marketing, business decision making, and targeted sales expansion through meaningful analyses and presentation of relevant findings.  A Bachelor’s degree in Marketing, Business Administration, Business Management, Statistics, or related field is required. Qualified candidates will possess experience creating and documenting date capture and analysis processes from multiple sources, 1+ years’ experience with Microsoft Dynamics CRM, and the ability to perform complex analysis such as regression, trending, and forecasting preferred. Five+ years of experience in a similar role in marketing, forecasting, business operations or related field, knowledge of relational databases, and experience with business-to-business marketing or capital goods industry is preferred.Mustang Cat has many exciting opportunities for exceptional people who want a career with an industry leader. If you are looking for a solid, growth-oriented company with a commitment to its customers and its employees, Mustang Cat is the place for you.  EOE/Minorities/Females/Vet/Disability"}