{"jobID": "2828466412", "jobLocation": "Detroit_MI", "jobTitle": "Data Strategy & Analytics Consultant", "companyRating": "3.8", "companyInfo": {"Website": "www.gm.com", "Headquarters": "Detroit, MI", "Size": "10000+ employees", "Founded": " 1908", "Type": " Company - Public (GM) ", "Industry": " Manufacturing", "Revenue": " $10+ billion (USD) per year", "Competitors": " FCA Fiat Chrysler Automobiles, Ford Motor Company, Toyota North America"}, "estimatedSalary": "98000", "jobDescription": "Who we areAt General Motors, we embrace the opportunity to thinkbigger and aim higher. Its the confidence in knowing our ideas produceexceptional vehicles and mobility solutions that move the world in exciting newways. With strong leadership and bold vision, were directing the future oftransportationand enriching peoples lives along the way.What we doBreakthroughs happen every day herefrom advances in vehicleelectrification and fuel cell technology to automation and connected carplatforms. The knowledge and perspectives of our diverse workforce offerinsight into the changing needs of our customers, spark inventive ways toimprove our vehicles and elevate our business. And were developing moresustainable methods along the way that maximize our planets resources andbenefit our surrounding communities.Why work with usWe combine the passion of a startup with the influence of aglobal powerhouse. We offer careers that are built on a strong foundation andare motivated by discovery. We encourage you to explore few of the many reasonsto unleash your talent with General Motors.  GM has led the automobile industry for years with itsconnected cars, OnStar service, 4G Wifi in virtually every automobile, and mostrecently its venture into autonomous cars. The prevalence of these data acrossliterally millions of cars translates into massive amounts of data ranging fromcar performance (tire pressure, gas consumption, radio utilization, etc.) todriver behavior (speeding, sudden stops, location, and the like).  Simultaneously, over the past 5 years, InformationTechnology has created a best-in-class Hadoop environment to house these andother data about the customer including digital behavior, third-partydemographics, service and warranty transactions, and many more.  To-date, most of these data have gone untapped and theChairman and CEO believes there is opportunity to create better customerexperiences, maximize safety, drive incremental revenue, and monetize the dataexternally through marketplaces and new products. To solve for this, thecompany recently hired its first Chief Data & Analytics Officer, who willshepherd a cross-enterprise endeavor to maximize the ROI of its Data andAnalytics efforts.The FunctionThe Data Strategy & Analytical Consulting team iscomprised of two separate functions: The Consulting arm of the team liaiseswith the business and IT to identify business opportunities, frame thechallenge within an analytical construct, coordinate the alignment of dataassets, and design a measurement framework to assess the efficacy of theanalytical solution. The consultant will help business partners adoptself-service analytical tools and ensure they reach a level of comfort andmaturity in order to compress the amount of time spent socializing and gainingbuy-in.  Most analytical programs fail to cross the last yard,which is bringing programs to fruition and embedding them in the operations.The Analytics Consultants will work closely with business operations teams toensure insights get adopted, plugged into operational systems, and benefits arerealized by the Chief Financial Officer.The RoleThe Consultant will understand how to sell the concept ofAnalytics into a business, leading business partners through the AnalyticalProcess, influencing the business line to take action, establish a framework tomeasure success, implement recommendations, and monitor results until they arefinalized. As such, they must have both strong quantitative skills, as well asstrong business acumen and communications. They must lead through influence andinspire change to an already successful operation.  This consultant must be proficient in IT terminology andadvances in technology, but simultaneously know the business language anddynamics to address business challenges, establish methodologies to frame theproblem, lead business leaders through the process, prescribe an analyticalsolution to solve the problem, communicate results of said solution, plug theminto the operations, and create results. Finally, they must know how tocommunicate results in a financially compelling way to realize the valuecreated.  They must also be comfortable with most major analyticaltechniques, and have sufficient knowledge to explain them to businesslaypersons.Key partnersLine of Business and Function leaders (client)Information Technology (for data and tools)Data Science & Advanced Analytics group (tocomplete the analytical work)Demonstrated SkillsMust have experience with in-market experimentaldesign, major analytical techniquesCollaborative team player orientation towardswork relationships, strong culture awarenessProject OversightHighly developed skills in priority setting andalignment of project priorities with business strategyAbility to break down complex problems andprojects into manageable goalsAbility to influence people, skilled in communicatingthe benefits of Data analysis to business line professionals to create a valuepropositionEffectiveness in building trust, respect andcooperation among teamsExperience8-10 years minimally requiredPreferred Experience in analytical consultingengagements, preferably with the top consulting firms (McKinsey, Deloitte,Accenture, Bain, BCG, etc.).Also accepted experience in companywideanalytics at a company known for implementing results (Capital One, Coca-Cola,UPS, USAA, Amazon, major national retailers).Also accepted analytical consultant within atop Data Services and Analytics service provider (Fair Issac, Experian, AcxiomEquifax) or agency (e.g. Merkle).EducationBachelors degree required, major in QuantitativeScience with MBA or Masters Preferred"}