{"jobID": "2789112633", "jobLocation": "Irvine_CA", "jobTitle": "Data Scientist", "companyRating": "2.8", "companyInfo": {"Website": "www.bootbarn.com", "Headquarters": "Irvine, CA", "Size": "1001 to 5000 employees", "Founded": " 1978", "Type": " Company - Public (BOOT) ", "Industry": " Retail", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Sheplers Western Wear, Cavender's, Cabela's"}, "estimatedSalary": "116000", "jobDescription": " JOB DESCRIPTION: Data Scientist / E-commerce Analytics REPORTS TO: Chief Digital Officer STATUS: Exempt BOOT BARN, INC. HUMAN RESOURCES DEPARTMENT EFFECTIVE: APRIL 2018 SUMMARY The Data Scientist / Head of E-Commerce Analytics will take the lead on delivering data-driven business insights, including the development and delivery of in-depth analyses and presentations of site shopping behavior, user profiles, category and item performance to aid in decisions pertaining to site merchandising and on-site marketing strategies across bootbarn.com, sheplers.com, countryoutfitters.com, and company microsites. The ideal candidate for this role is highly analytical and possesses proven problem-solving skills in ambiguous environments. This role reports to the Chief Digital Officer.  ESSENTIAL DUTIES AND RESPONSIBILITIES Partner closely with e-commerce team to identify impactful business problems and translate them into structured analyses, actionable insights, and reports and dashboards.Manage multiple data sources, identify gaps in the data capture process and make suggestions on improvements/enhancements for data hygiene.Perform exploratory and predictive analytics, analyzing online user behavior patterns on site, category and item performance, using a combination of descriptive statistics, segmentation techniques, and predictive modeling to inform and impact business decisions – site merchandising, pricing, and marketing strategiesCreate both standardized, automated reports as well as more in-depth analyses on the e-commerce businesses.Synthesize qualitative and quantitative user data from multiple sources to develop comprehensive views of user behavior and attributes for each brand.Frame the right questions, write queries and perform ad-hoc analysis to support immediate business data needs supplemented with clear recommendations and next steps.Design, analyze, and interpret the results of experiments to test the validity of hypotheses around online user acquisition, purchasing optimization, and retention strategies. SUPERVISORY RESPONSIBILITIES This position does not have supervisory responsibilities. ADDITIONAL RESPONSIBILITIES Demonstrates high degree of professionalism in communication, attitude and teamwork with customers, peers and managementDemonstrates high level of quality work, attendance and appearanceAdheres to all Company Policies & Procedures and Safety RegulationsAdheres to local, state and federal lawsPerforms any other duties that may be assigned by managementUnderstands and complies with all company rules and regulations MINIMUM QUALIFICATIONS 3-5 years of experience in data / customer analytics role, preferably in an omni-channel retail environmentExperience in analytics tools such as Looker, QlikView, TableauBA/BS degree in Business Analytics, Mathematics, Computer Science, Data Science, Business or related analytical degree or experienceStrong experience with techniques such as A/B testing, predictive modeling, acquisition and churn analysis, clustering, segmentation.Extensive experience in SQL, PL/SQL or other programming languages JOB DESCRIPTION: Data Scientist / E-commerce Analytics REPORTS TO: Chief Digital Officer  STATUS: Exempt BOOT BARN, INC.  HUMAN RESOURCES DEPARTMENT EFFECTIVE: APRIL 2018 Experience with statistical software (ex. R, SAS, SPSS) to conduct statistical analyses (regression, multivariate testing, segmentation etc.)Experience with data visualization; creation of metrics reports and dashboard viewsDetail-oriented with ability to balance detail and holistic, strategic perspective of businessAbility to communicate complex concepts in a clear and concise manner to audiences from staff to senior executive levelMust work well with multi-functional work teams and be willing to take initiative COMPETENCIES: · Adaptability Communication · Decision MakingInitiativeInnovationMotivatorOrganizationProfessionalismResults Orientated PHYSICAL DEMANDS: In general, the following physical demands are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to allow differently-abled individuals to perform the essential functions of the job. Standing, walking and squatting less than fifty percent of the work shiftRequired to lift, move and carry up to 40 poundsAbility to read, count and write to accurately complete all documentation and reportsMust be able to see, hear and speak in order to communicate with employees and other customersSpecific vision abilities include close vision, distance vision, peripheral vision, depth perception and ability to adjust focusManual dexterity required using hands to finger; handle, feel and type; reach with hands and arms (Check the box that applies by double clicking on the box.) Sedentary: Limited activity, no lifting, limited walking Moderate: Mostly standing, walking, bending, frequent lifting Light: Office work, some lifting, bending, stooping or kneeling, walking Arduous: Heavy lifting, bending, crawling, climbing WORK ENVIRONMENT: In general, the following conditions of the work environment are representative of those that an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to allow differently-abled individuals to perform the essential functions of the job within the environment. The work space is clean, orderly, properly lighted and ventilated with the proper safety complianceNoise levels are considered moderate Boot Barn, Inc. reserves the right to make exceptions to, modify or eliminate this document or its content. This document supersedes all previous policies, procedures or guidelines pertaining to this subject. JOB DESCRIPTION: Data Scientist / E-commerce Analytics REPORTS TO: Chief Digital Officer  STATUS: Exempt BOOT BARN, INC.  HUMAN RESOURCES DEPARTMENT EFFECTIVE: APRIL 2018 I have read and understand the essential functions of the job and know that other duties may be assigned and/or changed at any time. Employee Name (print) Employee Signature Date Supervisor Name (print) Supervisor Signature Date"}