{"jobID": "2693054121", "jobLocation": "Chicago_IL", "jobTitle": "Decision Scientist", "companyRating": null, "companyInfo": {"Website": "www.tmsw.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 1986", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " FCB Global, Arc Worldwide"}, "estimatedSalary": null, "jobDescription": " OverviewThe Marketing Store, a HAVI company, is a privately held global Agency that innovates, optimizes and drives marketing promotions and supply chains of many of the best known brands in the world. When you work at The Marketing Store, you have a chance to make your mark – to be a part of work that drives value, brings a smile and keeps everyday life moving forward. Which means it’s not the size of our global footprint, but rather your personal fingerprint, that has the power to make a real difference for our customers… and to touch the lives of people both at home and around the world.  We are staffed by a senior team of classically trained marketing professionals. Having developed an insightful, strategic, brand-building process for creating advertising campaigns, we have adapted this same thinking to promotions, digital, direct, the Internet, CRM, loyalty, premiums and events. The result is unique solutions that cover the gamut of marketing channels. Our clients include McDonald’s, Nissan, Infiniti, T-Mobile and more!  The Decision Scientist will be responsible for developing and executing strategic programs that deliver results against client goals. The position is a hybrid analyst/strategist role that will require collaboration across multiple marketing teams to deploy an integrated customer CRM program utilizing an omni-channel approach.  To be successful, the Decision Scientist must work closely with internal stakeholders and agency offices to create strategic plans, analytical assessments, insights, and measurement designs.  The Decision Scientist will be responsible for understanding customer and industry trends, and will need to develop data and insights to drive the development, execution and optimization of customer segmentation, channel mix, data models/sources, and multivariate tests across omni-channel campaigns.  A successful candidate will have demonstrated understanding of omni-channel marketing (web, mobile, social, email, direct mail, call center and vehicle) and analytics, having worked on digital/CRM initiatives in their career tenure.  The position requires extensive ability to create insights and strategy from analytics data, outstanding written and verbal communication, creative problem solving and ability to manage multiple responsibilities and deliverables. Must be able to develop strong relationships with agency partners and team members.Responsibilities Advise external clients on building and continuously improving Customer Engagement Marketing programs and initiatives.Advise internal and external decision makers around customer and industry trends, and how those trends impact current and future marketing channels & technologies.Develop CRM programs, plans and creative briefs and manage their execution across multiple customer touch points (web, mobile, social, email, direct mail, call center and vehicle) in an effort to nurture relationships and ensure continuity and consistency in all customer contact.Proactively develops insights and builds business cases to drive optimized or new tactics/strategies, which will move business performance and customer experience forward.Define learning agendas within and across CRM programs that continually test, learn and leverage variables such as timing, segments, messaging, creative, and offers to optimize program results against business objectives.Coordinate BI reporting for clients as instructed including weekly, monthly and quarterly reports and summaries, and augment reports by researching and pulling data queries.Works closely with our database team to ensure program needs are being maintained, continuously improved and to address any areas of risk.Understand industry standards for omni-channel marketing and develop key performance indicators for all CRM initiatives.Manipulate, cleanse and perform statistical analyses against dataParticipates in ad hoc special projects as required, and other tasks as assigned Desired Skills & Experience Post-Secondary Degree in a quantitative discipline (Math, Statistics, Political Science, Economics or Computer Science).Minimum of 2-5 years of experience in CRM or one to one marketing strategy/analytics.Ability to identify, communicate and inspire an organization around the next generation of omni-channel CRM experiences to dramatically grow the business, and be able to work through issues and overcome challenges while maintaining good relationships.Ability to design multivariate experiments, while ensuring statistical significance of results.Ability to provide strategic thought leadership in reinventing CRM in an emerging media world.Must have worked on CRM strategies and analytics across channels, including digital engagement and database growth.Expert written and verbal communication skills to interpret and discuss programs, technologies, and analytic methods with internal and external stakeholders.Superior analytical and problem solving skills.Strong and proven track record/performance.Experience in hands-on use of tools such as SQL, R, Python, or SAS.Experience in Google Analytics, Tableau/PowerBI preferredExperience cleansing, manipulating, and transforming data.Expertise in Microsoft Excel, Word and PowerPoint presentations.Travel required. BenefitsThe Marketing Store provides comprehensive benefits offerings to all full-time employees starting on day one. Our benefits include options for medical and dental insurance, 401(k) plan with Company matching provision, profit sharing, flexible spending accounts, tuition reimbursement, life insurance, health and wellness benefits (including discounts on products & services), employee assistance program, and disability insurance.  Thank you for your interest in The Marketing Store.  Please note that we will only contact candidates who are selected for an interview.  The Marketing Store is an equal opportunity employer.  We do not accept unsolicited calls, resumes or candidate referrals from recruiters and agencies."}