{"jobID": "2580841650", "jobLocation": "Vienna_VA", "jobTitle": "Business Data Analyst II", "companyRating": "4.5", "companyInfo": {"Website": "www.hil.us", "Headquarters": "Vienna, VA", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "81000", "jobDescription": "Horizon Industries Limited (HIL) is a dynamic IT and Management Consulting firm based in the Washington, DC area. We are currently seeking a Business Data Analyst II for a full-time position, remotely supporting the Defense Logistics Agency (DLA).  Job Description:  The JETS Program provides the full range of IT services, technical and management expertise that support applications, software, hardware, infrastructure, and systems, across the DLA IT Enterprise. Support is provided for information technology solutions, technical support, maintenance, and sustainment; operations support; application development, maintenance and technical support; and lifecycle management. Additionally, the program also supports administrative program management support for IT program offices and DLA Information Operations (J6) Office. The program provides support technology services across the DLA Information Operations Enterprise, the DLA Program Executive Offices (PEO), and all other technology services currently supported through DLA Contracting Services Office (DCSO) acquisitions.  This task order will provide for the resources to sustain data synchronization initiatives and common electronic catalog tools for business intelligence. The primary purpose of this requirement is to sustain the Product Data Bank (PDB) and its MedPDB application and Medical Master Catalog (MMC) data feeds for medical/surgical items by building the necessary standardized and synchronization data foundation monthly, which data is made available by the MedPDB and MMC applications to improve medical decision-making best practices. The PDB moves federal government partners in healthcare related missions, such as the Veterans Administration (VA), towards a single unique methodology of product identification to enhance sourcing and best practices while supporting both peacetime and contingency logistics, e.g. national disaster, war, or global emergencies. This action also enables government to operate within commercial healthcare initiatives to standardize product data that promotes both patient safety and supply chain efficiencies.  Duties of a Business Data Analyst II may include: Provide support in collecting and organizing information required for preparation of user manuals, training materials, installation guides, proposals, and reportsEdit functional descriptions, system specifications, user manuals, special reports, or any other customer deliverables and documentsProvide support in performing financial and administrative tasksPreparing and/or maintaining systems, programming, and operations documentation, procedures and methodsMaintain a current internal documentation libraryProvide or coordinate special documentation services as requiredOn occasion, short duration (1-5 days) site visits may be required as authorized by the Government. Required Skills / Experience: Five (5) years relevant experienceMust possess IT-II security clearance or have a current National Agency Check with written Inquiries (NACI) at time of proposal submissionMust have experience with the following programs: MS Suite Word Excel AccessProject ManagementPower Point Education: none  Location: Remote  Company Overview:  Horizon Industries Limited was founded in 1996 and based in Vienna, Virginia; Horizon is a dynamic, SBA-certified Small Disadvantaged Business (SDB) with professional and talented strategists, technologists, and consultants with a wide range of expertise, experiences and personal accomplishments. Horizon provides expertise in the areas of IT, analysis and evaluation, data analytics, business process management, acquisition and financial management, cost and risk assessments, Independent Verification & Validation, program management, systems engineering and design, databases design and management, logistical warehouse services and administrative support services. Horizon also offers capabilities related to financial, operational and technology consulting and risk management services, strategic planning, leadership effectiveness, anti-fraud waste and abuse programs, financial and operational assessments, regulatory compliance, workflow automation, and audit readiness services.  Horizon is an Equal Employment Opportunity employer and it is our policy to consider all applicants for employment without regard to sex, race, color, creed, religion, national origin, sexual orientation, marital status, age, disability, veteran status, alienage, ancestry, citizenship status, or any other factors prohibited by law. Horizon will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Horizon’s legal duty to furnish information.  EOE M/F/D/V"}