{"jobID": "2820340226", "jobLocation": "Austin_TX", "jobTitle": "Senior Business Process Analyst Metadata and Data Quality", "companyRating": "3.5", "companyInfo": {"Website": "www.schwab.com", "Headquarters": "San Francisco, CA", "Size": "10000+ employees", "Founded": " 1973", "Type": " Company - Public (SCHW) ", "Industry": " Finance", "Revenue": " $5 to $10 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "84000", "jobDescription": " Description:Austin - TX, AUS1, 2309 Gracy Farms Lane, 78758  Charles Ott Jones  20180402-2229 We believe that, when done right, investing liberates people to create their own destiny. We are driven by our purpose to champion every client’s goals with passion and integrity. We respect and appreciate the diversity of our employees, our clients, and the communities we serve. We challenge conventions strategically to create value for our clients, our firm and the world. We live and bring to life the concept of ‘own your tomorrow’ every day. We champion our employee strengths, guide their development, and invest in their long-term success. We hire optimistic, results-oriented, curious, innovative, and adaptable people with the desire to help our clients and one another succeed.  As a company, we were established by Chuck over 40 years ago to champion Main Street over Wall Street, and to help Americans transform themselves from earners to owners. Through advocacy and innovation, we work to make investing more affordable, accessible and understandable for all. As we enter our fifth decade, we are looking for talented, innovative and driven people who believe they can help themselves, and our clients, create a better future. Our Opportunity: The Schwab organization is looking for an experienced and highly motivated Senior Business Process Analyst with solid metadata and data quality experience to lead process design for Schwab’s IT Data Management tools and services. He or she will develop in depth knowledge of Schwab’s technology and data governance standards and policies, as well as IT Data Management’s tools and service. The selected candidate with then apply knowledge of industry best practices to design efficient, repeatable, measurable, and consistent metadata and data quality processes. This Senior Business Process Analyst will deliver documentation and communication and will ensure the associated process are measured and reported. Reports to the Program Director of Global Data Technology IT Data Management. What you’ll do:Develop and maintain an in-depth understanding of Schwab’s Technology Services and Data Governance Office policies and standards and establish solid working relationships with associated resources.Maintain a solid working relationship with peers in IT Data Management to understand their current tools and services and address gaps and opportunities around related processes.Serve as a thought leader to design processes around IT Data Management’s tools including, but not limited to, engagement, onboarding, integration, and support.Create associated process documentation and communication artifacts and influence the change management, communication, and training strategy and execution for data management at Schwab.What you have:8+ years of experience delivering technology solutions3+ years of data management experience (including data governance, metadata management, data quality execution)2+ years of technology process design experienceProven track record of delivering large, cross-division or enterprise projectsSolid analytical and troubleshooting skillsConsistent attention to detailExcellent customer facing, verbal, and written communication skillsStrong desire to work in a fast paced, exiting, growing, environment and make it a success Preferred Skills: B.S in Computer Science or other related area desiredExperience with data management tools such as Collibra Data Governance Center, IBM Information Governance Catalog, and Oracle Enterprise Data Quality a plusExperience within the financial services industry preferredWhat you’ll get:Comprehensive Compensation and Benefits packageFinancial Health: 401k Match, Employee Stock Purchase Plan, Employee Discounts, Personalized advice, Brokerage discountsWork/Life Balance: Sabbatical, Paid Parental Leave, New Mothers returning to work Program, Tuition Reimbursement Programs, Time off to volunteer, Employee Matching Gifts ProgramEveryday Wellness: Health and Lifestyle Wellness Rewards, Onsite Fitness Classes, Healthy Food Choices, Wellness ChampionsInclusion: Employee Resource Groups, Commitment to diversity, Strategic partnershipsNot just a job, but a career, with an opportunity to do the best work of your life Learn more about Life@Schwab.  Charles Schwab & Co., Inc. is an equal opportunity and affirmative action employer committed to diversifying its workforce. It is Schwab's policy to provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), gender identity or expression, national origin, ancestry, age, disability, legally protected medical condition, genetic information, marital status, sexual orientation, protected veteran status, military status, citizenship status or any other status that is protected by law. Schwab also does not discriminate against applicants or employees because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. At Schwab, we believe that every employee, through their diverse abilities and experiences, can contribute to our growth, innovation and client loyalty. We embrace diversity and are committed to providing equal opportunity to all employees and applicants. If you have a disability, and require reasonable accommodations in the application process, call Human Resources at 800-725-3535. We will be happy to assist you. Schwab will only share your accommodation request with those individuals who have a specific need to know. The request for an accommodation will not affect Schwab's hiring decisions. All other submissions should be performed online.Job Specifications  Relocation Offered?: No Work Schedule: Days Languages: English - spoken Current Licenses / Certifications: None Relevant Work Experience: IT-Other Specialty Engineering-2-5 yrs Position Located In: TX - Austin Education: BA/BS Job Type: Full Time Category:Information Technology  Activation Date: Friday, May 18, 2018  Expiration Date: Wednesday, August 1, 2018  Apply Here"}