{"jobID": "1801227093", "jobLocation": "Morris_Plains_NJ", "jobTitle": "Big Data Engineer", "companyRating": "3.8", "companyInfo": {"Website": "www.prolim.com", "Headquarters": "Farmington Hills, MI", "Size": "51 to 200 employees", "Founded": " 2005", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "102000", "jobDescription": "Description:PROLIM Global Corporation (www.prolim.com) is currently seeking Big Data Engineer in Morris Plains, NJ with one of our top Clients. Job DescriptionLead the developing strategic architecture and design patterns to process and store high volume data setsDesign and build scalable infrastructure and platform for very large amounts of data ingestion, aggregation, integration and advanced analytics in Hadoop, including Map Reduce, Pig/Hive, Spark, Storm, HBase and other NoSQL databasesInnovate by researching and deploying new tools, frameworks and patterns to build a sustainable big data platform.Translate complex functional and technical requirements into detailed design.Perform analysis of vast data stores and uncover insights.Hands-on technical leadership and support for customer issues and incidents regarding the analytics platforms through to resolution.Triage, deep dive and troubleshoot complex issues in the analytics applications.Identify opportunities to leverage and train 1st line support to prevent escalations in the future.Develop, manage and follow operational policies and procedures including documentation and training.Maintain security and data privacy.Lead the implementation of new technologies and provide recommendations on technology roadmapProvide insight on new technology performance and recommendations of adoption opportunities. Experience4+ years of experience with advanced JAVA programming and associated scripting languages (i.e. Spark Python, Scala, Pig)2+ years of hands-on implementation experience(preferably lead engineer) working with a combination of the following technologies: Hadoop, Map Reduce, Pig, Hive, Impala, HAWQ1+ years experience with streaming technologies such as Kafka, Storm, SparkSQL. Additional Qualifications:Strong knowledge of noSQL of at-least one noSQL database like HBase and Cassandra.2+ years experience with spring frameworkWorking experience of designing & developing solutions in cloud environments (Azure, AWS etc.) with focus on analytics stack.Experience working with and evaluating open source technologies and demonstrated ability to make objective choicesExperience in developing the full life-cycle of a Hadoop solution. This includes creating the requirements analysis, design of the technical architecture, design of the application design and development, testing, and deployment of the proposed solution.Experience working in agile development methodology.Strong Knowledge of Big Data Ingestion and Data processing patterns.Working Experience with continuous integration and continuous delivery toolsKnowledge of Chef scripting, Docker containersExperience with multiple cloud computing platformsExperience with more than one data streaming technologiesUnderstanding of Machine Learning skills (like Apache Mahout, Spark MLib)Experience with Visualization Tools such as Tableau. Apply online for immediate consideration, please send your updated resume and contact info via email sameer.joshi@prolim.com or Contact (214) 919-4137. About PROLIM Corporation PROLIM is a global company focused on product innovation by leveraging IT and PLM Technologies. PROLIM has more than a decade of PLM Service history serving Automotive, Aerospace, High Tech and Industrial Machinery companies throughout the world.Our Product Lifecycle Management (PLM) practice is powered by a team of consultants who provide comprehensive end-to-end service offerings. We have a PLM Center-of-Excellence (CoE) that enables our customers to build innovative solutions to the most-pressing PLM challenges. The CoE is supported by the right skills, resources, technologies and methodologies and helps develop customized solutions to better manage the entire product lifecycle. "}