{"jobID": "2631034915", "jobLocation": "Valencia_CA", "jobTitle": "Principal Scientist - Product Research", "companyRating": null, "companyInfo": {"Website": "www.pharmavite.com", "Headquarters": "Northridge, CA", "Size": "501 to 1000 employees", "Founded": " 1989", "Type": " Subsidiary or Business Segment", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " The Nature's Bounty Co., Schiff Nutrition International"}, "estimatedSalary": null, "jobDescription": "Requisition Number:VALA4052Job Title: Principal Scientist - Product Research Full Time / Part Time/ Temp: Full Time - Regular Shift: 1st Shift Area of Interest: Science & Technology Location: Valencia A-VAL-A  Job Description:We currently are seeking a dynamic, strategic, and innovative Principal Scientist. This key position will be based in our facility located in Valencia, CA (So. CA).  For more than 45 years, Pharmavite has been a trusted leader in the wellness industry, recognized for providing quality vitamins, minerals and supplements under our Nature Made® brand name. Who We Are:Our mission is People creating new products for better health worldwide.What We Do: Our vision is inspiring the healthiest you through more complete nutrition... Wherever you are in life.As a member of the Pharmavite team, employees enjoy competitive salaries and an exceptional benefits package which includes medical, dental, vision, 401K, life insurance, and long term disability coverage. In addition, employees enjoy our employee incentive plan (EIP), educational assistance, credit union membership, substantial discounts on our products, 11 paid holidays per year, and an opportunity to be part of a health/wellness organization.Position Summary: Effectively manages all aspects of the formulation, product/process development, scale up and commercialization of dietary supplement dosage forms. Explores and conducts research in relevant technologies. Focuses on providing enabling technology advancements in dietary supplement dosage forms and functional foods to drive innovation and point of differentiation. Responsibilities:Explores, identifies and develops innovative and proprietary technologies that have strategic significance.Collaborates with outside entities to develop and drive advancements in technology.Conducts well-designed experiments. Presents relevant findings to the appropriate technical groups and management. Develops prototypes to demonstrate application of new technologies.Develops intellectual properties relating to composition, usage and manufacturing process that will result in viable patents and/or competitive advantages.Maintains a network of vendors, consultants and educators to leverage emerging and enabling technologies.Develops complex formulations and processes to support the development of new and novel products and/or optimization of existing products, meeting deliverables in a timely manner with excellent results. Responsible for performing and/or managing bench top, pilot, manufacturing scale-up and verification batches.Provides strong technical leadership to Marketing, Operations and other cross-functional disciplines to accomplish project goals.Trains others in developing new products; conducts appropriate experiments and instructs in the proper use of laboratory and manufacturing equipment.Performs other related duties as assigned.Minimum Qualifications:Education: Requires at least a four-year college or university degree or its equivalent in Food Science, Chemistry, Pharmacy, or other relevant science degree  A PhD or Master degree is preferred. Certification: None. Experience: Bachelor's degree requires a minimum of 12 years of relevant experience in product development in Food, Confectionary, Cosmetics or Nutraceutical industries.  Master's degree requires a minimum of 10 years of relevant experience in product development in the Food, Confectionary, Cosmetics or, Nutraceutical - Industries.  PhD degree requires a minimum of 8 years of relevant experience in product development in the Food, Confectionary, Cosmetics or Nutraceutical industries. Knowledge/Skills/Abilities: Requires: Proficient in applying theoretical principles to create applied guiding principles.Demonstrates deep understanding of technical product development knowledge and abilities.Comprehensive knowledge and practical experience in developing innovative functional products with bioactive fortification.Ability to communicate, lead, and influence effectively in a cross-functional team environment especially with Marketing and Operations. Ability to establish strong rapport with these functions.Ability to analyze data. Strong problem solving skills.Physical Requirements: General lab/office/pilot plant environment, ability to work in a lab, pilot, and plant and production environment and stand long period.  Ability to travel, up to 25% of time Environment: Moderate exposure to disagreeable elements. Safety: The incumbent must be able to perform this job safely without endangering the health or safety of self or others. Supervisory Responsibility: Mentors and/or Manages formulators and/or technicians. Pharmavite is proud to be an equal opportunity and affirmative action employer. F/M/Disability/Vet Visit our Product Web Site:  http://www.naturemade.com/"}