{"jobID": "2807428080", "jobLocation": "Bethesda_MD", "jobTitle": "Program Manager - Screening Services", "companyRating": "3.8", "companyInfo": {"Website": "www.wellnesscorporatesolutions.com", "Headquarters": "Bethesda, MD", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "51000", "jobDescription": " Are you a driven health/wellness professional with an internal motivation to change lives? Are you interested in working for a leader in corporate health and wellbeing? Wellness Corporate Solutions (WCS) is looking for a Program Manager to join our Biometric Screening Team. This outgoing, team-oriented individual will work directly with our client-partners to create, develop and oversee biometric screening programs for our corporate clients.  Wellness Corporate Solutions is on a mission to spread wellness in the workplace. By creating engaging corporate biometric screening campaigns programs, we seek to make behavior change. We currently work with hundreds of thousands of employees from small, local organizations to global business leaders. RequirementsPrimary ResponsibilitiesIn conjunction with the partner/client, develop an overall biometric screening program and oversee implementation of the campaignLead client meetings and serve as client-facing expertConduct site contact presentationsSet up program in WCS’s internal systemsIdentify opportunities to enhance the biometric screening program by offering additional wellness services, as appropriateCollaborate with internal departments (staffing, logistics, health informatics and customer care) to ensure success of biometric screening eventsOversee progress on the screening campaigns and take any required actionMaintain strong relationship with partner/clients through planning process and entire campaignDeliver wrap up presentation at end of campaign including aggregate reporting of screening resultsAbility to work in fast paced, deadline driven environmentExcellent organization skills and ability to manage multiple clients simultaneouslyOther Duties Performs other related duties in accordance with instructions from management.Additional Competencies:Microsoft Office (Outlook, Excel, Word, PowerPoint)GoToMeetingAttention to detailRequired Education and ExperienceBachelor’s degree required in a health promotion related field; Master’s degree strongly preferred.Minimum 5 years related experience.Experience in coordinating biometric screening events is an advantage.BenefitsThe Perks of being on the WCS Team WCS is looking for adventurous, passionate team members who talk the talk and walk the walk! We encourage an open, collaborative environment and strive to support our employees mind, body and spirit. Check out a few of our awesome perks: Sit-stand desks for each employeeTreadmill desks for your useHealthy snacks and weekly healthy lunchCasual workplace – wear your yoga clothes!Medical, dental and vision coverage401K plan, pre-tax Transportation Plan and Medical Savings Account15 days of PTO plus 3 personal days and 3 floating holidaysGym discountsWellness challenges and campaignsAAP/EEO Statement Wellness Corporate Solutions, LLC is committed to conducting all employment practices for employees at all levels without regard to race, creed, genetic characteristics, gender, color, religion, sex, national origin or ancestry, age, mental or physical disability, marital status, sexual orientation, veteran/military status, gender identity/transgender status, pregnancy, childbirth or related medical conditions, or any other characteristic protected by applicable state, federal, or local laws (except where a bona fide occupational requirement exists)."}