{"jobID": "2764482125", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Data Scientist - Data Products", "companyRating": "4.5", "companyInfo": {"Website": "www.udemy.com", "Headquarters": "San Francisco, CA", "Size": "201 to 500 employees", "Founded": " 2010", "Type": " Company - Private", "Industry": " Education", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "173000", "jobDescription": "ABOUT UDEMYWith a mission to improve lives through learning, Udemy is a global marketplace for learning and teaching online. More than 20 million students learn from an extensive library of over 65,000 courses taught by expert instructors. Whether learning for professional development or personal enrichment, students can master new skills through self-paced, on-demand courses, while instructors have a way to share their knowledge with the world. For companies, Udemy for Business offers subscription access to a collection of business-relevant courses as well as a simple platform to host and distribute their own content in one central place.Were a close-knit bunch that enjoys problem-solving and collaboration, and we share a serious commitment to delivering the best possible learning and teaching experiences. Udemys culture encourages innovation, creativity, passion, and teamwork. We also celebrate our milestones and support each other every day.Founded in 2010, Udemy is privately owned and headquartered in San Franciscos SOMA neighborhood with offices in Dublin, Ireland, Sao Paulo, Brazil, and Ankara, Turkey. Compensation includes full-time salary, equity compensation plan, and competitive benefits including healthcare, commuter benefits, parental leave, and a discretionary time off policy.JOB DESCRIPTIONFrom building the worlds most comprehensive knowledge graph to enabling content discovery across Udemys catalog of over 65,000 courses, data scientists at Udemy develop the algorithms and models that drive Udemys two-sided marketplace by combining software engineering best practices with rigorous quantitative approaches.As a senior data scientist in data products at Udemy, youll be partnering with product managers, designers, and engineers to build algorithmic and model-driven solutions to power data products that affect the user experience. Success in this role requires a combination of product intuition, data analysis skills, machine learning knowledge, and the coding chops to dive head first into development on production systems.Responsibilities: Collaborate with product managers, designers, and engineers to scope and build data productsPerform statistical analysis, key metrics, and feature engineering for data productsDevelop production-grade data pipelines to power ML-based data productsDesign and analyze experiments and monitor performance of data productsProactively influence product prioritization through data-driven insightsProvide technical mentorship for other team membersBuild Udemys technical brand through talks, blog posts, and publicationsQualifications:3+ years of experience building complex data products5+ years of hands-on industry experience in a data science-oriented roleAbility to communicate effectively with non-technical stakeholdersStrong knowledge of statistics, machine learning, and natural language processingProficiency with SQL and 1+ programming languages (e.g., Python or Scala)Familiarity with standard software engineering practices and distributed computingExperience using big data technologies (e.g., Hadoop, Spark)Udemy in the News:Fortune: Naspers Just Invested $60 Million In This Online Education StartupForbes: Learn At Work From Gary Vee, Seth Godin and Guy KawasakiUSA Today: Tech jobs are thriving nationwide -- up to 7.3MEntrepreneur: Workplace Stress Is at a Record High. Here's What's Causing It."}