{"jobID": "2616820896", "jobLocation": "Murray_Hill_NJ", "jobTitle": "Data Science Research Summer Coop", "companyRating": null, "companyInfo": {"Website": "www.nokia.com", "Headquarters": "Nokia, Finland", "Size": "10000+ employees", "Founded": " 1865", "Type": " Company - Public (NOK) ", "Industry": " Telecommunications", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ericsson-Worldwide, Huawei Technologies, Microsoft"}, "estimatedSalary": null, "jobDescription": "Nokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things. Serving customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.  The Nokia student co-op program runs parallel to a student’s current class work allowing them to remain in school while gaining work experience.  Co-ops must be actively pursuing an undergraduate or graduate degree to be eligible for the program. Key Job Responsibilities:Develop feature learning algorithms for time series data;Collect IoT data for testing;Evaluation of the algorithms on the collected data Skills and Experience: Experience in machine learning tools (especially on deep learning) and analyzing for IoT sensor data.  Required: Ph. D Required Qualifications:Must be pursuing a Ph. D degree from an accredited college/university.Must have at least a 3.0 GPA.Able to work from the Murray Hill, NJ office. We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class."}