{"jobID": "2722129117", "jobLocation": "San_Francisco_CA", "jobTitle": "Barista - Minnesota", "companyRating": null, "companyInfo": {"Website": "www.philzcoffee.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2003", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " About us  What you'll be doingAt Philz, we’re doing something bigger than coffee. We’re building culture and community, a place where the spirit of family is alive. We believe in warmth, authenticity, kindness, positivity and passion. Our barista team delivers that human connection to our customers, creating experiences that better people’s days—one cup at a time.  You'll be active all day with many responsibilities, including making drinks, preparing food orders, working the register, cleaning and stocking. With everything you do, you’ll have an eye towards creating an exceptional and memorable customer experience.  Our baristas are our family—a group of people dedicated to our mission and culture. As part of your day at Philz, you’ll take on and embody the following core values: Customers FirstOur customers are our top priority. If we put people first, we cannot fail.Believe In Being NiceTreat all with respect. We are kindhearted, positive, humble, and human.Keep It RealBe yourself. Be sincere. A genuine connection will outperform formality.Deliver On QualityBe proud of your work. Be committed to doing the very best with passion and focus.Make ProgressChallenge norms by questioning why. Always keep learning and improving. Action creates results.What you'll need to succeedWe make sure that every Philz is a fun, creative and vibrant workplace. A spot where you can be yourself, dress the way you want and have flexibility in your schedule to live your best life. Most importantly, you’ll be part of an environment dedicated to bettering people’s days and building community.  Don’t worry if you’ve never been a barista before. We’ll teach you everything you need to know. In addition, we offer medical, dental and vision insurance, plus a 401k, flexible scheduling and generous paid time off. We're an equal opportunity employer and embrace a diverse workforce.  We can’t wait to meet you!"}