{"jobID": "2816329209", "jobLocation": "Warren_NJ", "jobTitle": "QC Scientist - Bioanalytical, FACS, ELISA, qPCR", "companyRating": null, "companyInfo": {"Website": "www.apexlifesciences.com", "Headquarters": "Glen Allen, VA", "Size": "5001 to 10000 employees", "Founded": " 1985", "Type": " Subsidiary or Business Segment", "Industry": " Business Services", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " The QC Scientist is responsible for performing as a subject matter expert in the completion of the Quality Control bioanalytical testing or data review in direct support of clinical manufacturing / assay transfer activities. This includes the ability to interface with multiple groups and the ability to independently perform tasks, interpret results, and troubleshoot. Additionally, this position will be responsible for training and may participate in assay transfer. Responsibilities:Perform testing of in-process, final product, and stability samples.Utilize advanced scientific principles to assist in analytical testing methods and the proper use of laboratory equipment.Capable of handling complex issues and solving problems with minimum guidance.Comprehensive understanding of regulatory guidelines and can independently develop, write and execute methods, protocols, reports and other related documents. Drive and Manage projects within the groupAccepts responsibility for group projects; designs and executes experiments, analyzes results, and writes technical summary reports.Capable of handling complex issues and solving problems with minimum guidance.Prepare and present continuous improvement projects to management. * Utilize advanced scientific principles to assist in analytical testing methods and the proper use of laboratory equipment.Comprehensive understanding of guidelines and can independently develop, write and execute method, protocols, reports, and other related documents.Assist management with investigations and deviations. Provide Guidance and LeadershipPerform on-the-job training (OJT) for laboratory employees.Assist management with the development, implementation, and deployment of training.Coach analyst on troubleshooting analytical methods and scientific equipment.Teach junior scientists on theory and application of analytical methods.Lead and develop best practices.Requirements:Bachelors degree required, preferable in Science. Advanced Degree preferred.7-10 years of relevant work experience in a GMP regulated environment.Advanced hands-on experience with analytical techniques, including FACS, ELISA, qPCR, and knowledge in the characterization & transfer of pharmaceutical productsMust have FACS data review experienceAdvanced ability to accurately and completely understand, follow, interpret and apply Global Regulatory and cGMP requirements.Advanced technical writing skills.An equivalent combination of education and experience may substitute. #LI-KS1  EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178.  EEO Employer  Apex is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at [Click Here to Email Your Resumé] or 844-463-6178."}