{"jobID": "2469999077", "jobLocation": "Chicago_IL", "jobTitle": "Senior Advanced Analytics Consultant", "companyRating": "4.2", "companyInfo": {"Website": "www.westmonroepartners.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2002", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "87000", "jobDescription": " Senior Advanced Analytics Consultant  222 W Adams St, 11th Floor  Chicago, Illinois, 60606  United States Think you’re up to the challenge? West Monroe Partners is seeking an experienced Consultant to join our emerging Advanced Analytics Practice in the Chicago office developing technology solutions for our clients in the Business Intelligence, Data Warehousing, Data Visualization, Big Data, and Predictive Analytics. This is an excellent opportunity to work within our Information Management team with Fortune 250 clients developing BI strategy and road maps, implementing new customer facing reporting and analytics platforms, while gaining exposure to a variety of industries including healthcare, insurance, manufacturing, E&U;, and professional services. Candidates will need to demonstrate in-depth understanding and prior experience in Microsoft SQL Server Integration Services, ETL development, and reporting solutions. Core Responsibilities:Work closely with our clients as part of a development team to evaluate requirements and develop business intelligence and data warehousing solutions·Design and develop data warehouse database schemas·Design and develop extract, transform, and load (ETL) mappings, procedures, and schedules·Coordinate activities with data source application owners to ensure integration and data integrityDesign and develop reports, dashboards, KPIs, and data extractsQualifications:Bachelor’s degree requiredMinimum 2+ years of hands on professional development experienceStrong technical experience in ETL tools (Informatica, IBM DataStage, or Microsoft Integration Services), database platforms (Oracle or SQL Server), and reporting tools (IBM Cognos, SAP Business Objects, Microsoft Reporting Services, or Microstrategy)Experience with the Microsoft SQL Server platform (version 2008 or later) is requiredGood knowledge of standard concepts, best practices, and procedures within a data warehousing and business intelligence environmentExcellent organizational and communication skills to work in a fast-paced environment and manage and prioritize multiple tasks simultaneouslyAbility to work well in a team of 2 – 5 consultantsAbility to travel 50% nationally.#LI-SE1"}