{"jobID": "2824393326", "jobLocation": "Houston_TX", "jobTitle": "Administrative Assistant / Data Analyst Supporting the DEA #18-297", "companyRating": "3.3", "companyInfo": {"Website": "www.fsafederal.com", "Headquarters": "Ashburn, VA", "Size": "1001 to 5000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "41000", "jobDescription": " Salary: 20.69 Published Job Title: Administrative Assistant / Data Analyst Supporting the DEA Requisition::18-297Worksite::DEAPosition Schedule:: Full-time Description::Focused on delivering unsurpassed services in support of law enforcement and homeland security, FSA, a rapidly growing joint venture owned by trusted solutions providers Engility and AECOM, has a vacancy for a Data Analyst to support the Asset Forfeiture Program at the Drug Enforcement Administration. DEA implements major investigative strategies against drug networks and cartels. Enforcement operations have resulted in significant seizure and forfeiture activity.A Data Analyst executes the following duties:Provide organization and management of case filesReview data (completeness of information, proper execution)Extract data from data baseObtain additional information from other investigative agencies/data baseEstablish/maintain physical filePrepare notices/advertisementsReceive, suspense petitions, claims, process sharing requestsReconcile inconsistenciesPrepare declarationsGather information and organize investigative packageVerify case files and case tracking systemMaintain internal status information on the disposition of all forfeited assetsAssure information is accurate and perform analytical computations necessary to process dataConduct and reconcile inventoriesDistribute and receive documentsAssist lead analyst or official in obtaining/collecting all documents/information to complete case fileProvide administrative information and assistance concerning case to other investigative agencies, local law enforcement agencies, US Attorney, and other DOJ processing units, and higher headquartersExtract data from agency data base for management and program reportsPerform word processing relevant to case documentationPerform data entry relevant to caseRequirements::A Data Analyst must meet the following qualifications:High School diploma, bachelor's Degree preferredAbility to review and analyze data and information from multiple sourcesAbility to establish case/project filesAbility to enter and retrieve data from data basesAbility to prepare and format management reportsAbility to manipulate, transfer, and compute and print informationAbility to create and manipulate spreadsheetsAbility to prepare and correct reports and correspondence using word processing softwareAbility to obtain and maintain a Public Trust Security AccessThis position requires U.S. Citizenship and a 7 (or 10) year minimum background investigation.EEO Statement: Forfeiture Support Associates (FSA) LLC is proud to be an Affirmative Action/ Equal Opportunity Employer. We recruit, employ, train, compensate, and promote qualified persons in all job titles without regard to age, ancestry, color, gender, HIV status, marital status, medical condition, national origin, physical or mental disability, race, religion, sex, sexual orientation (including gender expression and identity) veteran status, family leave status, and any protected group status as defined by applicable law. FSA Internal Use Only::"}