{"jobID": "2836045118", "jobLocation": "Bridgewater_NJ", "jobTitle": "Director of Program Management, Data Sciences & Analytics", "companyRating": "4.0", "companyInfo": {"Website": "www.jnj.com", "Headquarters": "New Brunswick, NJ", "Size": "10000+ employees", "Founded": " 1887", "Type": " Company - Public (JNJ) ", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10+ billion (USD) per year", "Competitors": " Abbott Labs, Novartis, Covidien"}, "estimatedSalary": "136000", "jobDescription": " Johnson & Johnson is recruiting for Director of Program Management, Data Sciences & Analytics to join our Johnson & Johnson Enterprise Data Analytics team and help us bring innovation to life and help advance the health and well-being of people around the world, through ideas, products and services. This role is located in New Jersey with considerations being made for West Chester, PA and will require up to 25% domestic and international travel.  Caring for the world, one person at a time has inspired and united the people of Johnson & Johnson for over 125 years. We embrace research and science -- bringing innovative ideas, products and services to advance the health and well-being of people. Employees of the Johnson & Johnson Family of Companies work with partners in health care to touch the lives of over a billion people every day, throughout the world.  With $76.5 billion in 2017 sales, Johnson & Johnson is the world's most comprehensive and broadly based manufacturer of health care products, as well as a provider of related services, for the consumer, pharmaceutical, and medical devices and diagnostics markets. There are more than 265 Johnson & Johnson operating companies employing approximately 126,500 people and with products touching the lives of over a billion people every day, throughout the world. If you have the talent and desire to touch the world, Johnson & Johnson has the career opportunities to help make it happen.  Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to inclusion, J&J; is proud to be an equal opportunity employer.  We are one of only two industrial companies to hold a AAA Credit Rating. With our forward-thinking business practices, commitment to diversity and inclusion, smart management and social responsibilityas noted by our tenure in Fortune Worlds Most Admired company list for the 16th year in a row, and appearing in the top 20we are well positioned to transform Technology & Analytics to help innovate faster and compete more effectively, making science and technology equal partners in building the future of Johnson & Johnson.  The Director of Program Management, Data Science, is an important, integral part of the transformation within J&J; Enterprise Data Analytics team. The role is responsible for driving large-scale, cross-functional data science initiatives that typically require significant process change, technology enablement, and data engineering. The Director of Program Management will interface with Data Scientists, Data Engineers, business teams and information technology team to drive commercial Data Science and Analytics use cases/POCS, as well as productization and industrialization of solutions for the Medical Device, Vision, and Consumer Products organization of Johnson and Johnson.  Key Responsibilities:  • Define problem statements and charters for analytics use cases and POCs, including objectives, milestones, resources required  • Establish business case for projects in consultation with project managers and business partners.  • Lead team of project managers responsible for aligning, tracking, and ensuring proper execution of data science use cases and POCs, including, as required, resource planning, business process changes, training, financial health, and operational readiness.  • Partner with different program and project management groups to align project management demand and assign right-fit PM resources based on project complexity.  • Partner with Data Scientists, Data Engineers and cross functional teams to understand as is processes develop, pilot, and implement improvements incorporating results of data science use cases and POCs.  • Work w. Data Scientists and Data Engineers to deploy systematic Data Strategies, including automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability and industrialization of use cases and POCs.  • Work with cross functional technology, analytics and business team to convert use cases and POCs into technology enabled minimally viable products (MVPs) and ultimately into scalable full stack solutions, using Agile methodologies and ceremonies.  • Review and provide feedback on all key program management deliverables to drive improvements in overall program quality and foster program delivery excellence.  • Lead a team of program and project managers proactively performing development planning and providing career coaching and day-to-day supervision.  • Partner with technology and Business leaders and other key stakeholders to drive the development and implementation of holistic change and communication strategy that understands the impact of the program to current state roles, processes and technologies, and facilitates transition and full operationalization to the desired future.  • Overall accountability for organizations budget including planning, forecasting, monitoring and addressing budget variances. QualificationsMinimum of a Bachelors degree is required.Minimum of 8 years relevant business experience is required.Experience delivering and/or project managing analytics, data science, or data engineering projects is preferred.Experience working in or partnering with Information Technology personnel to design and build technology solutions for analytics, data science, or data engineering projects is preferred.Program and/or project management experience is required.At least 5 years leading globally distributed cross functional teams is highly is preferred.Experience planning and implementing a global or enterprise-wide programs with at least 5 concurrent project work streams if required.Track record mentoring effective project managers who are able to successfully execute complex initiatives is required.Financial Management for program budget of $15M - $20M is preferred.PMP certification is preferred.SCRUM Master certification is preferred.Must be able to demonstrate a clear bias for action and a sense of urgency.This role is located in New Jersey with considerations being made for West Chester, PA and will require up to 25% domestic and international travel.Primary Location United States-New Jersey-New Brunswick Other Locations North America-United States-New Jersey, North America-United States-New Jersey-Bridgewater, North America-United States-Pennsylvania-West Chester, North America-United States-New Jersey-Somerville, North America-United States-New Jersey-Raritan Organization Johnson & Johnson (6067) Job Function Strategic Planning Requisition ID 4405180226a "}