{"jobID": "2828836507", "jobLocation": "Chicago_IL", "jobTitle": "Senior Business Intelligence Analyst", "companyRating": null, "companyInfo": {"Website": "www.vitaver.com", "Headquarters": "Fort Lauderdale, FL", "Size": "1 to 50 employees", "Founded": " 1993", "Type": " Contract", "Industry": " Business Services", "Revenue": " $1 to $5 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "11827 - Senior Business Intelligence Analyst - Chicago, IL  Type: Full-time direct employment with Vitaver Staffing Client Salary: $95,000 to $110,000 range depending on your level of expertise. Additional Information: Full benefits available. Description: Our Client, an industrial building materials company, is looking to hire a Senior Business Intelligence Analyst in Chicago, IL. Responsibilities:Own external market metrics and analytics to support strategic direction-setting;Own models to estimate market growth across our products and segments;Leverage external data sources to monitor and assess the state of housing market;Manage share growth estimation and analysis for both short and long-term;Analyze macro and micro market dynamics that impact share growth goals;Deliver competitor analysis by leveraging external research to provide insights into business issues;Own long-range share growth modeling, partnering across commercial and capacity planning;Develop trend-based analysis around competitors and substitute products;Work with third parties to coordinate competitive intelligence reviews;Deliver ongoing assessment of new product or competitor entrants into the market;Proactively develop new competitive intelligence tools and reports for management;Support mission-critical analysis to drive management decision-making;Lead development and execution of strategic business intelligence reviews across Commercial & Operations;Proactively use business acumen to deep-dive into analytic findings, educating the business on risks and opportunities;Support management decision-making through analysis and modeling as needed;Occasional travel may be required.Requirements:Market analysis experience (5+ years);Experience with Microsoft Excel (required);Ability to manage multiple concurrent assignments while meeting deadlines and demanding quality execution;Ability to synthesize complex and detailed data and information into meaningful outtakes and decision base information;Ability to identify problems and think independently about alternative ways to solve problems based on analysis of data;Bachelors degree in Finance, Accounting, or Economics.Why apply?Join the $1.5B world-leader in Fiber Cement Siding;Work with a stable company with a track record of success and growth since 1888;Get additional value from exceptional health insurance plans and 401(k) match;Enjoy work / life balance, visit companies events and outdoors;Work in casual atmosphere without dress code;Enjoy free lunch days.If this job is not for you, earn a $2,100.00 referral bonus in cash by referring a Candidate or a Client to us. Vitaver Referral Program is one of the most generous on the market!"}