{"jobID": "2728667866", "jobLocation": "N_o_n_e", "jobTitle": "Programmer Analyst – Big Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.rsrit.com", "Headquarters": "Northville, MI", "Size": "501 to 1000 employees", "Founded": " 2004", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Department: Big Data – Job Type: Full – Time – Location: Nationwide Job Overview: Experienced Big Data Engineer who has a passion to build data products and data systems and who will work on the collecting, storing, processing, and analyzing of huge sets of data in real time. You will develop and deliver successful projects and solutions by being very hands-on technically and also provide architectural and design guidance to clients with best practices. You will research, evaluate, architect, and deploy new tools, frameworks, and patterns to build and develop sustainable big data platforms and solutions. Responsibilities: Closely follows the direction set by delivery management and senior team members to achieve common goals. Assist senior team members in collecting client requirements; analyze requirements, configuration, testing and validation of the software application.  Need to understand and translate client needs into business and technology solutions via documentation, analysis, design and/or development of best practice business changes.  Act as liaison between senior consultants and client users to provide support, communications regarding project updates, preparation, data analysis, documentation and training.  Learn and support of technology implementations from a technical perspective including data cleansing, conversions, specifications documentation, systems configuration and testing tasks.  Design, Develop and implement solutions around big data and advanced analytics utilizing NoSQL Databases (Cassandra, HBase), Spark and Data Visualizations.  Development activities in several Big Data and or Data Analytics platforms including – Master Data Management, Big Data, Data Warehousing, database technologies, Business Intelligence, Data Visualization, and Analytics Platforms.  Build big data solutions using technologies like Impala, HBase, Hive, Oozie, Flume, ZooKeeper, Solr, Sqoop.  Work on multiple big data vendor platforms like Hortonworks, Cloudera, Datastax, etc.  Monitor performance and advise any necessary architecture changes.  Gather and process raw data at scale (including writing scripts, write SQL queries, etc.).  Build proof of concepts for quick prototyping for new case studies and use cases.  Be a team player, able to work with minimal supervision yet also should be able to collaborate with local, remote teams with multiple departments.  Good at interfacing with the client on a professional and consultative level. SKILLS AND EXPERIENCE REQUIRED: Experience engineering server-side code for data processing applications  Prior working experience on implementing solutions on Hortonworks, Cloudera, MapR, Databricks or Datastax platforms  Prior expertise working on cloud platforms like Azure or AWS  Prior working on using Apache Spark (Spark ML, Spark Streaming)  Expert level programming skills in Java, Scala, Python, NodeJS, JavaScript  Experience working on NoSQL databases like Cassandra, HBase etc.  Working experience with Hadoop technologies such as Hive or Pig  Working experience with MapReduce-based frameworks  Experience with data concepts (SQL, NoSQL, Normalization) and working with complex data structures  Exposure to Agile/SAFE methodologies  Git or general version control experience Educational Qualifications: Required – Bachelor’s degree in Computer Science, Information Technology, Computer Engineering or closely related or equivalent  Preferred – Master’s degree in Management Information Systems (MIS), Computer Science, Big Data or Analytics or equivalent  Travel:  Open to travel based up on the nature of the engagement Equal Employment Opportunity Reliable Software employment does not discriminate on the basis of race, religion, gender, sexual orientation, age or any other basis as covered by federal, state, or local law.Employment decisions are based solely on qualifications, merit and business needs. Apply Now"}