{"jobID": "2671786745", "jobLocation": "Skokie_IL", "jobTitle": "Computational Biologist Modeler", "companyRating": "2.6", "companyInfo": {"Website": "www.lanzatech.co.nz", "Headquarters": "Skokie, IL", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "82000", "jobDescription": "About LanzaTech LanzaTech is turning our global carbon crisis into a feedstock opportunity with the potential to displace 30% of crude oil use today and reduce global CO2 emissions by 10%. LanzaTechs carbon recycling technology is like retrofitting a brewery onto an emission source like a steel mill, but instead of using sugars and yeast to make beer, bacteria convert pollution to products! Imagine a day when you can power a plane by recycled carbon emissions, when your yoga pants or sneakers started life as pollution from a steel mill. This future is possible using LanzaTech technology with the first 2 commercial units converting steel mill waste gases to fuels being built; in China with Shougang and in Belgium with the worlds largest steel maker, ArcelorMittal. LanzaTech has an additional 3 commercial projects in the pipeline, in India, South Africa and California. LanzaTech has already produced synthetic jet fuel from recycled carbon emissions and has a partnership with Virgin Atlantic.  In 2017, LanzaTech was recognized as the #1 Hottest company in the Advanced Bioeconomy by Biofuels Digest, the worlds most widely-read bioeconomy daily. The company was also inaugurated into the Cleantech100 Hall of Fame, having been listed in the top 100 cleantech companies over the last 7 years. In 2016, the company won the Young Global Leader Award for Circular Economy at the World Economic Forum, LanzaTech was also the top biofuels company in the 2016 CNBC Disruptor 50 Companies list. In 2015, LanzaTech was awarded the U.S. EPA Presidential Green Chemistry Award for Greener Synthetic Pathways. The companys accomplishments were recognized through a number of prestigious awards in 2014, including the Guardian Sustainable Business Innovation Award for Carbon and Energy Management, Breakthrough Innovation Award at the Platts Global Metals Awards, and the Technical Development Award from the World Petroleum Council. In 2013, the company was named a World Economic Forum Technology Pioneer. About the role LanzaTech has developed extensive metabolic modeling capability around our novel gas fermentation platform. This modeling capability is used to guide scientific, engineering and business decisions.  You will use your expert knowledge of microbial metabolism to computationally design, develop and refine new microbial strains that specialize in making chemicals from pollution. You will participate in the design-build-test feedback loop with scientists and engineers across the company to refine these strain designs and contribute to the ongoing development and refinement of our models. Key dutiesIntegrate metabolomic, genomic, proteomic and transcriptomic data sets to solve deep biological problemsContribute to ongoing development and refinement of genome annotations, metabolic knowledgebases and metabolic modelsDesign in silico experiments for biological discovery, computational strain design, process optimization and the prediction of cellular phenotypes.Carry out in silico experiments using the latest metabolic modeling technologyClearly document work and methods by integrating code and narrative text in Jupyter notebooksCommunicate your findings, insights and conclusions to other scientific teamsPresent summary of results to group in weekly meetingsEducation & ExperienceREQUIREDPhD in computational biology, quantitative biology, bioinformatics, computational systems biology or equivalentStrong knowledge of microbial biochemistrySignificant exposure to prokaryotic biology with emphasis on metabolism, ideally to a gas fermenting acetogenDeep knowledge of the principles behind genome-scale modeling, flux balance analysis and associated techniquesExpert user of genome-scale modeling tools such as cobrapy, cameo, Escher, OptFlux, COBRA ToolboxIntermediate Python knowledge or expert in another programming languageTeam player balanced with strong individual initiativeNICE TO HAVEIndustry experience highly desirableExposure to microbial fermentation highly desirableExperience with Gurobi, CPLEX, TOMLABExperience with Docker, Kubernetes, Travis CI, GitExperience designing interactive data visualizations using Bokeh, R Shiny or TableauExperience with ME and GEM-Pro genome-scale models, kinetic models and whole-cell modelsExperience in synthetic biologyThis position is open to candidates authorized to work in the United States on a full-time basis for any employer. LanzaTech is an Equal Employment Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, or veteran status."}