{"jobID": "2811113188", "jobLocation": "Rahway_NJ", "jobTitle": "Sr. Scientist, Informatics", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Job Title: Sr. Scientist, Informatics - CHE******  Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck's success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world's premier, most research-intensive biopharmaceutical company. Today, we're doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck's leading discovery capabilities and world-class small molecule and biologics R & D expertise to create breakthrough science that radically changes the way we approach serious diseases.  The Modeling and Informatics group is seeking a creative and self-motivated cheminformatician with exceptional interpersonal and problem solving skills to join our Informatics group in Boston. The successful candidate will work closely with discovery scientists to build and improve existing peptide/macromolecule design tools and apply these tools to the optimization of peptides in support of ongoing medicinal chemistry programs.  We are looking for a candidate with demonstrated experience in cheminformatics research and excellent programming skills. A plus are Experience in developing structure-activity relationshipsExperience with workflow applications and data analytics software (Pipeline Pilot, Knime, Spotfire, .)Demonstrated ability to visualize complex dataWorking knowledge of peptide and/or protein modelingExperience with machine learning2 years postdoctoral experience The candidate will be located in Boston but the role will entail cross-site collaborations. QualificationsEducation Minimum Requirement: Ph.D. in chemistry / biochemistry / biophysics with a computational emphasis or Ph.D. in computer science/statistics with an emphasis on life science applications Required Experience and Skills:0 years of drug discovery experience in industryExcellent knowledge in at least one programming or scripting language (Python, R, ...)Experience in the creation of data workflows as well as data analysis and interpretationWorking knowledge of molecular descriptors, e.g. 2D/3D fingerprintsTrack record of publications, patents, and/or scientific presentationsStrong communication skills, both written and oralAbility to work well in multidisciplinary teamsPreferred Experience and Skills:Demonstrated experience in machine learning and data science with applications to problems in the life sciencesWorking knowledge of peptide and/or protein modeling (e.g., improving stability, permeability), molecular descriptors, and the HELM notation Your role at Merck is integral to helping the world meet new breakthroughs that affect generations to come, and we're counting on your skills and inventiveness to help make meaningful contributions to global medical advancement. At Merck, we're inventing for life.  If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request to . Search Firm Representatives Please Read Carefully: Merck & Co., Inc. is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Merck via email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Merck. No fee will be paid in the event the candidate is hired by Merck as a result of the referral or through other means.  Visa sponsorship is not available for this position.  For more information about personal rights under Equal Employment Opportunity, visit:  Job Chemistry  Primary Location NA-US-NJ-Rahway  Other Locations Regular  Employee Status Yes, 10 % of the Time  Number Of Openings 1st  Categories Biotechnology / ScienceHealthcareInformation Technology"}