{"jobID": "2836057605", "jobLocation": "Rahway_NJ", "jobTitle": "Associate Principal Scientist, Outcomes Research", "companyRating": null, "companyInfo": {"Website": "www.merck.com", "Headquarters": "Kenilworth, NJ", "Size": "10000+ employees", "Founded": " 1891", "Type": " Company - Public (MRK) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " Description  Merck & Co., Inc. Kenilworth, N.J., U.S.A. known as Merck in the United States and Canada, is a global health care leader with a diversified portfolio of prescription medicines, vaccines and animal health products. The difference between potential and achievement lies in the spark that fuels innovation and inventiveness; this is the space where Merck has codified its legacy for over a century. Merck’s success is backed by ethical integrity, forward momentum, and an inspiring mission to achieve new milestones in global healthcare.  Merck is on a quest for cures and is committed to being the world’s premier, most research-intensive biopharmaceutical company. Today, we’re doubling down on this goal. Merck Research Laboratories is a true scientific research facility of tomorrow, and will take Merck’s leading discovery capabilities and world-class small molecule and biologics R&D; expertise to create breakthrough science that radically changes the way we approach serious diseases.  Position:  Economic and Data Sciences is part of Merck’s Center for Observational and Real World Evidence (CORE)  The Center for Observational and Real-world Evidence at Merck is responsible for generating the evidence to support scientific and commercial value of Merck’s portfolio to optimize access, reimbursement, and patient outcomes. In collaboration with internal and external partners, Economic and Data Sciences (EDS), provides strategic and technical leadership to enable patient access, measure and quantify the value of our products, inform internal and external decisions, and shape methodology and external health policy and practice.  Associate Principal Scientist: Role Summary  Under the direction of an EDS Executive Director, the Associate Principal Scientist provides strategic development and use of industry-leading predictive and economic models to enhance our understanding of disease and to quantify and communicate the value of our products to patients, providers, and payers. The scientist provides model-based business insights across all phases of drug and vaccine development. In addition, she/he serves as the EDS lead for one or more value evidence teams to develop health economic, disease, and predictive models to enable business insights for the product.  Primary Activities for Therapeutic Area  Utilize discovery, real world evidence, clinical trial and published data, and publically available information and tools to provide economic and integrated models to answer key questions in all phases of drug and vaccine development – Phase I through loss of data exclusivity.  Advance the use of integrated quantitative approaches, focusing on economic, disease, and predictive modeling and simulation in partnership with other internal groups and external organizations.  Liaise with statistics, pharmacokinetics, pharmacodynamics teams, IT, data management, and other quantitative groups in Merck to optimize strategy and align resources for their respective products.  Maintain awareness of external data, models and IT environment to collaborate across relevant internal stakeholders to enhance Merck capabilities in modeling, simulation, and data visualization.  Work closely with external (other companies, payers, academic and regulatory) collaborators and partners to assure that new methodologies, models and advanced analytics are fully utilized for our products.  Partner in defining and implementing the EDS vision and strategy to develop an innovative, world class Center of Excellence in data science as well predictive and economic modeling.  Ensure sharing of work product and relevant best practices across the Merck enterprise.  Qualifications  Education Requirement:  PhD (preferred) or Masters in Quantitative Sciences such as Health Economics, Health Services Research, Decision Science, Mathematics, Predictive Modeling, Statistics, Operations Research, Physics, Engineering or closely related field with 3 or more years beyond PhD or 5 or more years beyond Masters of relevant experience in healthcare  Required Experience and Skills:  Exceptional leadership skills with experience in leading teams  Experience in the design and development of model approaches to enable internal and external decisions  Experience in managing resources and driving implementation  Exceptional technical and problem solving skills  Deep knowledge and experience in the application of predictive modeling to solve problems in the pharmaceutical or biotechnology industry to enable internal and external decisions  Strong record of research publications in peer-reviewed journals  Excellent communication skills (oral and written) are expected  Preferred Experience and Skills:  Knowledge and experience in economic evaluation of oncology drugs and interventions  Experience with health technology assessment of oncology products"}