{"jobID": "2830912420", "jobLocation": "Union_NJ", "jobTitle": "Data Analyst - Mid-Level", "companyRating": "5.0", "companyInfo": {"Website": "www.techlink.com", "Headquarters": "Atlanta, GA", "Size": "1 to 50 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Job Title: Data Analyst - Mid-Level  Location: Central NJ  Job Type: Contract  Duration: 4-6 months+  Contact Info: Sharon Koribanics - skoribanics@techlink.com - 201-786-2417 Requirements: 5+ years SQL Server, MS Access Query, and T-SQL development experience including stored procedures and functions  3+ years in database design, data management, data migration, systems integration and testing; demonstrate expertise utilizing ETL tools such as SSIS, SAP Data Services (BO Data Integrator)  3+ year of practical programming work experience preferably C#, will also consider Python, jQuery, JavaScript  Strong expertise in MS Office functionality especially Excel (Macros, VBA, Pivot Tables, Lookups)  Experience with data visualization and reporting tools Functions: Develop plan and timeline for each new data set acquisition, in collaboration with the R&I; department  Review technical and data requirements and ensure data accuracy and quality  Ability to convey technical functionality to a non-technical audience  Perform data collection from internal and external sources  Perform analysis on data by writing up SQL queries and generate reports to identify and resolve data issues  Proven ability to test ETL processes  Exhibit excellent analytical, problem solving and troubleshooting abilities  All offers of employment at TechLink, Inc. are contingent upon clear results of a thorough background check. Background checks will be conducted on all final candidates.  Background checks will include: Social Security Verification, Prior Employment Verification, Professional References, Educational Verification, Criminal History, Motor Vehicle Records and e-verify"}