{"jobID": "2783135345", "jobLocation": "La_Jolla_CA", "jobTitle": "RESEARCH ASSOCIATE -CLINICAL RESEARCH RN", "companyRating": "3.7", "companyInfo": {"Website": "www.scripps.org", "Headquarters": "San Diego, CA", "Size": "10000+ employees", "Founded": " 1924", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Sharp HealthCare, UC San Diego, Kaiser Permanente"}, "estimatedSalary": "50000", "jobDescription": " Responsible for planning, implementation and oversight of a variety of clinical trials that fall within the scope of the RN licensure. Maintains compliance with all applicable institutional, state and federal regulations in collaboration with investigator and other research team members. May perform independently as a project manager to coordinate all aspects of clinical research projects including administrative functions and clinical functions per scope of practice. Other responsibilities include recruiting, retaining, motivating and educating research patients in clinical trials, training other research personnel in research procedures, oversees research finances and tracking patient enrollment. Works with other disciplines to execute trials, and acts as patient advocate to contribute to the overall research objectives of the program. Required Education/Experience/Specialized Skills:2 years RN experience. Advanced written, oral and interpersonal communication skills. Strong prioritization, organizational, and problem solving skills. Strong motivator/communicator in a compact clinical team working with aggressive timelines. Strong computer skills with Microsoft Office software. Required Certification/Registration:CA RN License, CCRC required or obtained within 1 year of hire. BLS. Preferred Education/Experience/Specialized Skills/Certification:BSN. Phlebotomy, IV skills.  Scripps Health is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex (including pregnancy, sexual orientation, or gender identity/expression), age, marital status, status as a protected veteran, among other things, or status as a qualified individual with disability."}