{"jobID": "2807767600", "jobLocation": "Austin_TX", "jobTitle": "Big Data and MDM Architect", "companyRating": null, "companyInfo": {"Website": "www.hpe.com", "Headquarters": "Palo Alto, CA", "Size": "10000+ employees", "Founded": " 2015", "Type": " Company - Public (HPE) ", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Oracle, Accenture"}, "estimatedSalary": null, "jobDescription": " The Big Data Architect is a key contributor to the implementation of our strategic Big Data platform, Data Lake, Analytic applications and other Enterprise IT strategies like Cloud computing. You will be responsible for planning, architecting and executing data lake, analytics, and machine learning applications on big data platform. You will plan and execute high-impact actionable insight generation through big data advanced analytics including predictive analytics, advanced Machine Learning Technologies that reduce cost and improve analytics speed to insight by accelerating the pace of Big Data innovation at HPE. The purpose of this position is, but is not limited to, strategically designing, developing, and implementation of a Big Data Hadoop platform that supports the creation of a unified data platform, housing raw & refined data from various sources of record, enabling: lean, faster delivery of data, enhanced data management & engineering, advanced analytical capabilities (for power users and data scientists), maintaining metadata repositories & data lineage, mastering data. The intent of this position is to build a Big Data foundation that can be leveraged to build services on an ongoing basis, which support multiple business areas across the organization.  Required Skills:  •Ability to build and architect next-generation Hadoop data lake and analytics applications on a group of core Hadoop technologies. Evaluate new technologies and products, and research to identify opportunities that impact business strategy, business requirements and performance that can accelerate access to data and automate key data flows. e.g Advanced Machine Learning Technologies.Highly scalable and extensible Big Data platform which enables collection, storage, modeling, and analysis of massive data sets from numerous channels.Define and maintain data architecture, focusing on creating strategy, researching emerging technology, and applying technology to enable business solutions.Analyze latest Big Data Analytic technologies and their innovative applications in both business intelligence analysis and new service offerings, adopt and implement these insights and best practices. Perform architecture design, data modeling, and implementation of Big Data platform and analytic applications.Experience in evolving/managing technologies/tools in a rapidly changing environment to support business needs and capabilities.Experience in conducting performance tuning of Hadoop clusters. Monitor and manage Hadoop cluster job, performance capacity planning, and security.Experience with Databases: NoSQL, SQL and Vertica. Able to think strategically and tactically.  •8+ years of Hands-on experience with big data platforms and tools including data ingestion (batch & real time), transformation and delivery in Hadoop ecosystem (such as Hadoop, Pig, Hive, Flume, Oozie, Avro, YARN, Kafka, Storm). Proficiency in Spark, Hive, DRUID, Hive LLAP Experience in architecture and implementation of large and highly complex projects using Hortonworks (Hadoop Distributed File System).6+ years of experience of MDM architecture and analysisDeep understanding of cloud computing infrastructure and platforms. History of working successfully with multinational, cross-functional engineering teams. Capability to architect highly scalable distributed systems, using different open source tools.  Education:  •BS/M.S. in Computer Science or Data Science or Business Analytics #LI-TL1Hewlett Packard Enterprise is EEO F/M/Protected Veteran/ Individual with Disabilities. HPE will comply with all applicable laws related to the use of arrest and conviction records, including the San Francisco Fair Chance Ordinance and similar laws and will consider for employment qualified applicants with criminal histories."}