{"jobID": "2776577434", "jobLocation": "Edison_NJ", "jobTitle": "Senior Principal Scientist, Analytical Development", "companyRating": null, "companyInfo": {"Website": "www.jobjuncture.com", "Headquarters": "Houston, TX", "Size": "1001 to 5000 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Business Services", "Revenue": " Less than $1 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": "Love your job! Our client is a global biopharmaceutical company leading the way in medical innovation to help patients live longer, better lives. Their purpose as a company is to discover and develop therapies that will change the course of human health. With a presence in more than 70 countries - and growing - they are looking for talented people to grow their business, advance their science and contribute to their unique culture.  The successful candidate will be highly motivated to work within a science focused, collaborative, multidisciplinary drug substance and drug product development environment to achieve the companys aggressive drug development targets. Responsibilities will include, but are not limited to, the following: The Senior Principal Scientist position will be responsible for the development and validation of analytical methodology for the characterization of our products and processes, the creation of fundamental product and process understanding, and the advancement of innovative approaches to drug development. Support for drug candidates across all stages of development and, as needed, within our commercial product portfolio will be required.  The Senior Principal Scientist will work with minimal supervision to support laboratory based de novo analytical methods development, chemical characterization studies and chemical stability characterization evaluations. Where required, leadership oversight will include activities that will be performed in accordance with cGLP/cGMP regulations, established business processes and protocols, and applicable standard operating procedures.  The Senior Principal Scientist will have organizational, interdepartmental and interdivisional responsibilities with regards to leading workgroups, cross-functional teams, strategy development/implementation/execution, and process improvement initiatives. Support drug substance process development including characterization of starting materials, intermediates and final API.Support drug product formulation and process development including characterization of the process and finished product.Develop, optimize and validate analytical methods through their own hands and those of other staff internal and external to the company.Support drug substance and drug product impurity characterization and identification.Generate clinical batch release and stability data.Qualify/transfer analytical methodology to quality control and contract laboratories.Where appropriate, oversee and manage the relationship with external partners.Responsible for the hiring, training, and management of technical staff.Provides mentoring and technical direction to other members of the staff, including those who may not directly report to the Associate Director.Serve on and lead departmental, interdepartmental and project teams.Report and discuss analytical results and conclusions both orally and in writing.Write formal reports for inclusion in regulatory filings and support the generation of appropriate responses to questions from regulatory authorities.Represent the company in discussions with regulatory authorities.Serve on company due diligence teams assessing external product development opportunities.Review analytical data for completeness and correctness.Adhere to all relevant compliance requirements.Ensure that all facilities, equipment and personnel are and remain in compliance with cGLP / cGMP, FDA and EMA requirements, appropriate SOPs and corporate policies.QualificationsCompleted BS in Chemistry (or relevant discipline) and minimum of 15+ years of pharmaceutical laboratory experience required; orCompleted MS in Chemistry (or relevant discipline) and minimum of 12+ years of pharmaceutical laboratory experience required; orCompleted Ph.D. in Chemistry (or relevant discipline) and minimum of 10+ years of pharmaceutical laboratory experience required: orCompleted Ph.D. in Chemistry (or relevant discipline) with post-doctoral academic research experience and minimum of 8+ years of pharmaceutical laboratory experienceSkills/Knowledge Required:Academic background in Analytical Chemistry or a related chemistry discipline (e.g. Physical, Organic) with demonstrated analytical capabilities.Comprehensive knowledge of chemistry with extensive expertise in measurement science.A demonstrated record of scientific accomplishment, laboratory experimentation, publication and presentation.Extensive laboratory experience with and an in-depth knowledge of conventional laboratory characterization techniques such as HPLC, GC, UV, IR, mass spectrometry, drug release testing, and NMR is a must.Hands-on proficiency with analytical methods and instrumentation.Fluency in more than one of the following areas is expected: synthetic chemistry, drug substance processing, formulation development, pharmaceutical processing or pharmaceutical sciences.Strong problem-solving and troubleshooting skills.Strong capabilities in experimental design and execution.A demonstrated record of leading a high performing technical organization.Ability to work and lead independently.Ability to provide scientific guidance, leadership and training to others within the department.Ability to directly supervise and manage others.An absolute commitment to and demonstrated proficiency in employee development.Exceptional verbal and written communication skills.Strategic thinking, judgment, and business acumen.Strong interpersonal skills and the ability and interest to serve as a team member/leader in an environment where individual initiative, collaboration and accountability are valued.Extensive knowledge of cGLP/cGMP and applicable FDA, EMA and ICH guidances.Familiarity with the USP and other compendia.Skills/Knowledge in one or more of the following areas are a plus:Advanced skills in statistics and statistical analysis of process capability.Advanced skills in DOE, Lean and/or Six Sigma.Knowledge of the biopharmaceutical classification system, and IVIVC / IVIVR.Modern laboratory automation.Quality by DesignAdvanced skills in PAT and chemometrics. #LI-SK1"}