{"jobID": "2725824130", "jobLocation": "McLean_VA", "jobTitle": "Data Analyst", "companyRating": "4.0", "companyInfo": {"Website": "www.hilton.com", "Headquarters": "Mc Lean, VA", "Size": "10000+ employees", "Founded": " 1919", "Type": " Company - Public (HLT) ", "Industry": " Travel & Tourism", "Revenue": " $10+ billion (USD) per year", "Competitors": " Ritz-Carlton, Wyndham Worldwide, Marriott International"}, "estimatedSalary": "76000", "jobDescription": " As the Data Analyst, you will work closely with a variety of data sources and consumers to capture and document requirements for ingesting data into Hilton’s Hadoop-based data warehouse. During data ingestion projects, you will analyze complex data structures to generate technical specifications, assist with documenting proposed solutions, and participate in data testing and validation. During the deployment phase, you will complete the business-facing documentation that will support self-service use of the company’s data assets.What will I be doing?As the Data Analyst, you will need to be familiar with the methodologies for gathering and documenting requirements in support of both technical and non-technical teams. You will need to possess strong communication skills and a willingness to grow and learn by challenging yourself and others to deliver quality data assets that support business growth and opportunity.  As a Team Member in this role, you will be responsible for: Working with the Business Governance team to construct clear requirements and specifications of how data assets will be ingested by explaining source system integrations, asset structure, relationships, scheduling constraints, known data issues and other related itemsUsing various tools, techniques, meetings and processes to expand the team’s collective understanding of data related processes and assetsPerforming data profiling and data quality validation processesUpdating and enhancing data asset documentation based upon knowledge gained through root cause analysis of data-related issuesCategorizing data elements into domain types; maintaining code mappings and source-to-target mappings; maintaining a living document that provides information where data comes from, its location in the warehouse, how data is processed, quality of the data, and how data is usedInternalizing and leveraging the knowledge gained through research and analysis to better support business and technical understanding of the company’s data assetsInterpreting and modifying SQL statements in order to independently analyze the gaps between business requirements and data assets to scope changes that will need to be implementedLeveraging experience and knowledge to test and validate data assets for completeness and correctness, against documented acceptance criteria and requirementsWhat are we looking for?To fulfill this role successfully, you must possess the following minimum qualifications and experience: Minimum Education: BA/BS Bachelor’s DegreeAdditional Requirements (i.e. > of travel time, etc.): Experience working in the technology related fieldHands-on experience with data and business process modeling toolsFamiliarity with MS SQL Server, Oracle DB and Hive SQStrong working knowledge of SQLExposure to MicroStrategy or other similar dashboard softwareFamiliarity with working in an Agile environment It would be advantageous in this position for you to demonstrate the following capabilities and distinctions: Minimum Years of Experience: One (1) year of exposure to Hadoop infrastructureMinimum Years of Experience: One (1) year working in JIRA and/or ConfluenceTechnical writing experienceWhat will it be like to work for Hilton?Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision “to fill the earth with the light and warmth of hospitality” unites us as a team to create remarkable hospitality experiences around the world every day. And, our amazing Team Members are at the heart of it all!"}