{"jobID": "2766673249", "jobLocation": "Reston_VA", "jobTitle": "Medical Assistant", "companyRating": "3.6", "companyInfo": {"Website": "www.spinemd.com", "Headquarters": "Reston, VA", "Size": "51 to 200 employees", "Founded": " 1992", "Type": " Company - Private", "Industry": " Health Care", "Revenue": " $5 to $10 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "18", "jobDescription": "Date Posted: 09/15/2017 Status: Full Time PLEASE EMAIL JOINOURTEAM@SPINEMD.COM TO APPLY.Job Purpose:The Medical Assistant is a multi-skilled health professional who works interdependently with other health care professionals to provide quality health care to the patient. The Medical Assistant will assist the providers with many aspects of patient care, including office visits, injections, writing orders, and patient education.Essential Job Responsibilities:Assist physicians and physician assistants with preparing patients for examinations and injections and performing routine screening tests. Escort patients to exam rooms and prepare them for office visit.Record patient interview, history and chief complaint.Write all medication prescriptions, physical therapy orders, diagnostic testing orders, and others in accordance with physician’s authorizations.Provide patient education with regards to office policies, medications, management of diseased, home treatments and special diets using appropriate medical terminology.Respond to patient phone calls and assist with their needs.Calling prescriptions to the pharmacy for the physician.Following appropriate legal and ethical professional conduct.Acquire data from patients for studies in which they may be enrolled.Maintain supplies, equipment, stocking, and sterilizing instruments ensuring work cores and patient rooms are presentable.Disposing of biohazard waste according to OSHA standards.Practicing OSHA safety standards.Skills/Qualifications/ATTRIBUTES:High school diploma required, Associate’s Degree or CMA preferredPossess superior customer service skillsAbility to work as part of a teamAbility to multi-taskPositive dispositionPLEASE EMAIL JOINOURTEAM@SPINEMD.COM TO APPLY."}