{"jobID": "2824465581", "jobLocation": "Jersey_City_NJ", "jobTitle": "Business / Data Analyst - Qlik", "companyRating": "2.9", "companyInfo": {"Website": "www.citco.com", "Headquarters": "George Town, Cayman Islands", "Size": "5001 to 10000 employees", "Founded": " 1948", "Type": " Company - Private", "Industry": " Finance", "Revenue": " Unknown / Non-Applicable", "Competitors": " State Street, HedgeServ, Northern Trust"}, "estimatedSalary": "101000", "jobDescription": " Business / Data Analyst - Qlik Location  United States - Jersey City IRC Number IRC30327 # of openings 1Apply NowBusiness / Data Analyst - QlikAbout Citco Since the 1940s Citco has provided specialist financial services to alternative investment funds, investors, multinationals and private clients worldwide. With over 6,000 employees in 45 countries we pioneer innovative solutions that meet our clients’ evolving needs, and deliver exceptional service.  Our continuous investment in learning means our people are among the best in the industry. And our corporate social responsibility programs provide meaningful and fulfilling work in the community.  A career at Citco isn’t just a job – it’s an opportunity to excel in an environment that genuinely supports your personal and professional development. About the Role: The Business Analyst (BA) is a critical champion for business users of CFS data and reporting and a primary liaison with IT. The BA readily understands business processes and needs and is able to translate both into actionable requirements and drive value-add scalable solutions. The BA comes with a strong background in fund accounting and operations while being analytical and very familiar with transactional systems like AExeo and experience with data warehousing platform and in turn Business Intelligence (BI) and reporting tools. The candidate excels at communicating over different media and at an individual, small group or large group context, and seamlessly collaborates with clients, internal users, and IT Job Duties in Brief:Representative and key voice for business needs and interests throughout the software development lifecycle for data warehouse, extracts and reporting tools.Seamlessly works alongside and guides various stakeholders to ensure consistent progress toward defined objectives and vision for data warehouse, extracts and reporting tools.Contributes to major initiatives such as migration to AWS/Amazon Web Services, migration and go-live with client dashboards and reports on QlikSense and NPrinting, upgrade to critical data warehouse transform service (ODI/Oracle Data Integrator), and integration of AExeo DM/Deal Manager portfolio financing.Independently project manage multiple and often conflicting requests from an equally diverse number of stakeholders while effectively prioritizing and communicating across the collective team – Product Development, Development, Quality Assurance/QA, PM/Project Management, etc.Contributes to future development pipeline by identifying, analyzing and documenting changes or enhancements for data/reporting accuracy or performance and assigns appropriate priority.Openly engages and effectively communicates with client and internal user requesters to solicit the right information and efficiently synthesize requirements.Works closely with IT to ensure what is designed and built meets business requirements today and in the future and provide feedback/critique every step of the way.Spearheads UAT/User Acceptance Testing and seeks ways to semi-automate testing efforts and provides on-going guidance and resources to the Quality Assurance/QA team.Provides escalation point for Production issues and orients/advises support and development teams.Demonstrates functionality and features succinctly and effectively for various audiences over WebEx or in-person meetings.Reviews and understands proposed changes to core source system(s) (AExeo) and identifies impact downstream for data warehouse and reporting tools.Authors value-add documentation including FAQs, user manuals, business requirements document, and release notes.About You:Proficient with fund accounting and operations for alternative investments including hedge funds, private equity and real estate and related/corresponding analytics and reporting.Minimum of 5+ years of business analyst experienceProficient on AExeo.Proficient with data warehousing and reporting.Experience working with agile software development.Track record in materially contributing to value-add IT projects from beginning to end.Experience interfacing and collaborating with IT.Strong communicator and ability to connect with people/users.Experience in test planning and execution.Leader, self-starter, hard-working, committed.Quick-learner and ability to anticipate next steps or follow-up requests.Bachelor’s degree in accounting or a financial discipline preferredWhat We Offer:A challenging and rewarding role in an award-winning global business.Opportunities for personal and professional career development.Great working environment, competitive salary and benefits, and opportunities for educational support.Be part of an industry leading global team, renowned for excellence.Confidentiality Assured."}