{"jobID": "2746540658", "jobLocation": "Richardson_TX", "jobTitle": "Quality Assurance Analyst - Data Warehousing", "companyRating": "2.8", "companyInfo": {"Website": "jobs.cvshealth.com", "Headquarters": "Woonsocket, RI", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CVS) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Walmart, Walgreens, Express Scripts"}, "estimatedSalary": "58000", "jobDescription": " Job DescriptionThe IT Quality Assurance Data Warehouse, Analyst is a high exposure position dealing with Data Warehousing and BI systems for the leadership of the company and our clients. This position will be overseeing multiple projects simultaneously overseeing Data Warehouse teams on and offshore. The IT Quality Assurance Data Warehouse, Analyst will be responsible for but not limited to:*Performing functional and regression testing in support of quality of IT products for business users. *Interacting with developers and business to understand requirements and timelines*Creating test plans, test cases and test beds*Creating and executing test specifications from design requirements*Executing tests, providing test results and reporting for product owners and other groups*Testing software manually and with auto-testing programs during releases*Identifying and reporting risks and problems*Verifying recommended solutions*Developing or overseeing and maintaining automation scripts *Gathering information from disparate systems to aid problem resolution*Collaborating with various upstream and downstream IT teams *Conducting defect review meetings*Achieving release consensus*Following testing standards*Verifying that compliance standards are followed*Providing technical test consultation to the business and vendors if needed*Ensuring Lessons Learned activities are conducted*Recommending Quality Improvements*Conducting complex workflow and process flow analyses*Participating in testing cycles*Acting as the information resource for QA related assigned projects A successful candidate in this position will have strong leadership and communication skills (written, oral, presentations) along with a proactive work ethic with the ability to deliver results and meet challenging deadlines . They will also have the ability to define problems, collect and analyze data, establish facts, draw valid conclusions and recommend solutions.Required Qualifications1+ years of QA experience required with strong technical experience in data warehouse testing, risk analysis, acceptance testing, automation, performance & reporting 1+ years Knowledge of QA Data Warehousing concepts and planning 1+ years Teradata experience. Informatica Tool skills/knowledge 1+ years Oracle PL/SQL experience 1+ years of designing, developing and executings tests against the Data Warehouse and strong analytical, technical and research skills to address complex issues 1+ years experience reviewing defects on the regular basis and perform root-cause analysis 1+ years testing skills to validate that the correct data is being extracted from the source, validate the transformation logic, diagnostic and debugging skills. Performing source-to-target-validation 1+ years of understanding testing methodologies such as levels of testing unit, smoke, system, end to end, regression, performance 1+ years validating for the error-handling logic and data throughput rates 1+ years of ensuring traceability of test cases to requirements 1+ years Unix experience 1+ years BTEQ scripts creation experience1+ years experience using ALM/Quality Center for defect tracking and Requirements Traceability Matrix1+ years Status Reporting and metrics experience 1+years of experience working in a collaborative environment with Business Analysts, DEVs and other QA teams Preferred Qualifications* Working knowledge of Hadoop technology stack* Ability to collaboratively resolve conflicts in a professional, tactful manner* Verify compliance standards are followed* Provide technical consultation to the business and vendors if needed * Provide technical leadership and supervision to the QA team (including onshore and offshore resources) in all areas of quality assurance * Ability to develop UNIX scripts for automation and re-use * Ensure Lessons Learned activities are conducted * Experience recommending quality improvements * Conduct complex workflow and process flow analysis * Experience with QC testing technologies and must be able to handle complex projects and tasks * Understand shell scripting * Knowledge of technical functions such as SAS processesEducationBachelors in Computer Science or equivalent experience Business OverviewCVS Health, through our unmatched breadth of service offerings, is transforming the delivery of health care services in the U.S. We are an innovative, fast-growing company guided by values that focus on teamwork, integrity and respect for our colleagues and customers. What are we looking for in our colleagues? We seek fresh ideas, new perspectives, a diversity of experiences, and a dedication to service that will help us better meet the needs of the many people and businesses that rely on us each day. As the nations largest pharmacy health care provider, we offer a wide range of exciting and fulfilling career opportunities across our three business units MinuteClinic, pharmacy benefit management (PBM) and retail pharmacy. Our energetic and service-oriented colleagues work hard every day to make a positive difference in the lives of our customers.CVS Health is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, ethnicity, ancestry, color, religion, sex/gender (including pregnancy), national origin, sexual orientation, gender identity or expression, physical or mental disability, medical condition, age, veteran status, military status, marital status, genetic information, citizenship status, unemployment status, political affiliation, or on any other basis or characteristic prohibited by applicable federal, state or local law. CVS Health will consider qualified job candidates with criminal histories in a manner consistent with federal, state and local laws. CVS Health will not discharge or in any other manner discriminate against any Colleague or applicant for employment because such Colleague or applicant has inquired about, discussed, or disclosed the compensation of the Colleague or applicant or another Colleague or applicant. Furthermore, we comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENTFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require assistance to apply for this job, please contact us by clicking EEO AA CVS HealthCVS Health does not require nor expect that applicants disclose their compensation history during the application, interview, and hiring process.For inquiries related to the application process or technical issues please contact the Kenexa Helpdesk at 1-855-338-5609. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352. Please note that we only accept resumes via our corporate website: https://jobs.cvshealth.com/"}