{"jobID": "2492343094", "jobLocation": "Marina_del_Rey_CA", "jobTitle": "Senior Data Scientist", "companyRating": "3.6", "companyInfo": {"Website": "www.dollarshaveclub.com", "Headquarters": "Marina del Rey, CA", "Size": "201 to 500 employees", "Founded": " 2011", "Type": " Company - Private", "Industry": " Retail", "Revenue": " Unknown / Non-Applicable", "Competitors": " Unknown"}, "estimatedSalary": "149000", "jobDescription": "ABOUT DSC: We’re on a mission to build a better bathroom. We started with razors way back in 2011, and now millions and millions of Members later, we’ve expanded into shave products, skin care, hair styling, with more to come. We’re always growing and reinventing, and we rely on killer talent to help us achieve our goal of owning the bathroom. If you’re a team-playing innovator, you’ll fit right in. A sense of humor helps, too. ROLE SUMMARY: We’re seeking a Senior Software Engineer who specializes in data pipelines, data exploration, statistical analysis, machine learning and other aspects of data science. This DATA SCIENCE ENGINEER will work in the Data Engineering Team, which is a Center of Excellence for Data Science, Data Transport and Cluster Computing at DSC. Key to success in this role will be strong curiosity and drive to learn technologies and architectures that create scalable, stable and secure data processing pipelines. Responsibilities:Enhance our machine learning software with the latest in machine learning algorithmsDesign and implement production data pipelinesEmploy statistical modeling and analysis to generate new features for our modelsDevelop mathematical solutions to our most pressing problemsDesign systems that generate predictive models for a variety of signals and tasksFormulate experiments and conduct hypothesis testingProductionize models and algorithms by implementing mathematical operations as efficient production codeReport insights via visualization and dashboardsHelp the Business and Engineering teams make decisions based on dataExplore large data setsMentor and guide team membersQualificationsMS or PhD in Computer Science, Mathematics, Physics or a related technical field; or equivalent work experience3+ years experience with Python, Java, Scala, or similar programming languagesFluency in SQL or equivalent query languageExpertise in statistics and data analysisBroad knowledge of machine learning, algorithm design, and software engineeringExperience translating math into efficient codeEnthusiasm to work in a fast-paced engineering teamDSC CULTURE: We work in an open-air, freshly renovated office in the heart of Silicon Beach. As we disrupt industries, our plan is to think big but stay small. No egos. No jerks. No prima donnas. Just awesome folks who live and breathe collaboration and dig the perks like haircuts, lunches and team happy hours. And yes, we have snacks. #LI-CB1"}