{"jobID": "2707826304", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Data Science and Reporting Analyst", "companyRating": "3.1", "companyInfo": {"Website": "www.meijer.com", "Headquarters": "Grand Rapids, MI", "Size": "10000+ employees", "Founded": " 1934", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $10+ billion (USD) per year", "Competitors": " Kroger, Walmart, SpartanNash"}, "estimatedSalary": "46000", "jobDescription": "Currently, Meijer is looking for a Data Science & Reporting Analyst. This position is an experienced role on the Merchandising Center of Excellence Analytics team. This role is responsible for developing and applying data science through enterprise BI solutions that will have a positive impact on sales, margin and profit performance of key business areas  Key Deliverables:  · Responsible for delivering material impact to the organization’s performance by: providing analytical support for Merchandising teams, identifying and executing against analytics-based business opportunities, and developing analytic approaches & reports that improve the efficiency of the Merchandising organization.  · Develop and apply advanced data science, quantitative methods, data mining, and modeling, through self-service analytical tools to solve complex business problems across Merchandising.  · Partner and Consult on report and tool solution designs that apply best in class analytics  · Effectively communicate complex business analysis and provide recommendations for improvements  · Keeps customer at the center of analytic approach, analysis and solutions and partner with cross functional teams to drive customer centricity at Meijer.  · Develop scorecards and partner with business stakeholders to improve reporting effectiveness.  · Collaborate and Build strong business relationships with Customer Marketing, Merchandising, and Marketing teams to deliver enterprise solutions.  · Leverage disparate data sources for holistic understanding to solve complex business problems through BI design.  This job profile is not meant to be all inclusive of the responsibilities of this position; may perform other duties as assigned or requiredQualifications Experience working in a cross-functional teams focused on: Business/Financial Analysis, Promotional Analytics, Customer Analytics, Pricing, Merchandising, Media Analytics, etc.Experience developing analytic techniques such as: forecasting, predictive modeling, segmentation analysis, simulation modeling, data mining.Experience in customer-facing industry (traditional or online retailing, retail financial services, etc.)Multi-channel experience preferred – familiar with both in-store/branch and online analytics · Advanced hands on experience using one or more of: SQL; R, Python, or other programming language; SAS Base programming, SAS Macro programming, SAS Advanced programming, SAS Enterprise Miner; SAS Visual Analytics; in-database and in-memory programming; MicroStrategy; MicroStrategy VI; Microsoft Power BI; Microsoft Power Apps; Qlik, Tableau; SAP Hana Solutions; Mobile applications; or other tools not listed.  · Strong work ethic complemented by a positive, can-do attitude.  · Excellent communication skills: listening, verbal and written.  · Experience developing communications and presenting to leadership  · Strong organizational, planning, and time management skills with ability to prioritize multiple/competing projects and assignments."}