{"jobID": "2759412684", "jobLocation": "San_Francisco_CA", "jobTitle": "Interior Designer / Space Planner", "companyRating": "3.5", "companyInfo": {"Website": "www.oneworkplace.com", "Headquarters": "Santa Clara, CA", "Size": "501 to 1000 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Retail", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "78000", "jobDescription": "Interior Designer / Space Planner – Systems FurnitureSan Francisco, Ca**Please provide a link to your on-line portfolio when applyingOverview Works to provide design services to customers, including site/inventory verification, programming, design concepts, ancillary furniture selections, space planning, specifications and installation drawings. Coordinates with outside consultants.  Works closely with sales, order entry and installation groups, as well as customers, to ensure accurate plans and specifications, conformance to client’s requirements, customer satisfaction and high quality project implementation.  Reports to the Design Director and seeks to continually align with project team leadership to accomplish OWP business objectives. Responsibilities:Meet with customers to gather project information (surveys, interviews, data collection, observations)Perform field measures, product inventory and product researchProduce and present design concepts to internal and external clientsProduce furniture block plans, space plans, finish palettes, furniture specifications, and installation drawingsAssist with design proposalsManage project hoursMay perform project audits for other designersServe as mentor to other designers as determined by level of experienceQualifications:Education/ExperienceBachelor’s (BA) Degree in Interior or Architectural Design from college or university5+ years’ design experience preferred; or equivalent combination of education and experienceKnowledge/Skills/AbilitiesKnowledge of Steelcase products or systems furniture a plusAdvanced proficiency in a variety of software: AutoCAD, CET Designer, Google SketchupStrong project management skills and ability to juggle multiple programs at a time to deliver on deadlineExceptional Customer Service skills with a passion to provide solutions to client needsYou like communicating with others through face-to-face interactionMust have a valid driver’s license and access to transportation to client sites around the Bay AreaPhysical RequirementsSeeing, hearing, color perception, clear speechAbility to travel to project sitesComplex reading and writing, basic math skillsProficient in EnglishWorking EnvironmentRegularly works alone and with others in person, over the phone and via emailGenerally, works in an office environment around moderate noiseJob StatusExempt **Please provide a link to your on-line portfolio when applying"}