{"jobID": "2820203210", "jobLocation": "Pennington_NJ", "jobTitle": "Research Scientist", "companyRating": null, "companyInfo": {"Website": "www.tsrconsulting.com", "Headquarters": "Hauppauge, NY", "Size": "201 to 500 employees", "Founded": " 1969", "Type": " Company - Public (TSRI) ", "Industry": " Business Services", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": null, "jobDescription": " TSR is a relationship-based, customer-focused staffing company. For over 40 years TSR, Inc. and its wholly owned subsidiary, TSR Consulting Services, have prospered in the Information Technology staffing business, earning the respect of companies both large and small with well refined candidate screening, timely placement, and a real understanding of the right skill sets required by our clients.  Industry: Pharmaceutical  One of our most prestigious clients is looking for a Research Scientist. This is a long term opportunity located in the Princeton NJ area. Skills required:Must have a strong background in flow cytometry including sample preparation, acquisition, and data analysisPrevious hands-on, daily flow cytometer maintenance and set-up are highly desiredExperience with the isolation, freezing, and thawing of PBMC from whole blood, and magnetic cell separation/enrichment, a plusThe main role of this position is to support biomarker sample analysis and data generation for ongoing clinical trialsOther duties entail multiple techniques for clinical sample processing for downstream biomarker analysisPrevious work in a clinical lab setting, familiarity with CAP/CLIA or GLP/GCLP, and knowledge in the fields of immunology and/or oncology are highly desirableExperience with Client flow cytometers is a plus, as well as experience with analysis software such as Flowjo or FCS ExpressThe candidate must be able to work in a collaborative team environmentThis position requires flexibility in schedule to cover to some 11AM to 7PM shifts, and occasional SaturdaysSDL2017"}