{"jobID": "2769869645", "jobLocation": "Pomona_CA", "jobTitle": "Senior Analytical Specialist 3 Data Analyst", "companyRating": "3.3", "companyInfo": {"Website": "www.sce.com", "Headquarters": "Rosemead, CA", "Size": "10000+ employees", "Founded": " 1879", "Type": " Subsidiary or Business Segment", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $10+ billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "93000", "jobDescription": "Job DescriptionENERGY FOR WHATS AHEAD Are you looking to make a difference in your career? Were working on smarter grids, cleaner energy and tools to help people manage energy more efficiently. About Transmission and Distribution Southern California Edisons (SCE's) Transmission and Distribution Organizational Unit (T & D) is responsible for planning, engineering, constructing, operating, and maintaining transmission and distribution facilities throughout the 50,000-square-mile territory. T&D; is the steward of roughly $19 billion in assets that safely and reliably deliver electricity to 14 million residents via SCEs 5 million customer accounts. Position Overview:  The Senior Analytical Specialist position works in the Reliability Analytics Department within the Maintenance, Performance, and Reliability (MPR) department within the Transmission & Distribution (T&D;) organization. The role examines raw data for the purpose of drawing conclusions about the information. This position will help organizations throughout T&D; discover the underlying drivers of performance using descriptive statistics, and develop predictive and prescriptive models to drive significant transformation of business processes leading to first quartile performance in safety, reliability, and affordability. This person will sort through huge data sets using sophisticated software and identify undiscovered patterns and hidden relationships between structured and unstructured data such as asset, geospatial, and operational data.  This position will have a significant role supporting General Rate Case (GRC) testimony, regulatory compliance filings, and operational performance metrics across multiple disciplines. As a subject matter expert (SME) on SCE data sources, extraction methods and data interpretation they will lead and/or participate on multiple critical initiatives. Their analysis will lead to changes in established business strategies and the implementation of new technologies. Typical Responsibilities: Responsible for T&D;'s analytics, data interpretation, data extraction and modeling.Develops, and assists or makes presentation to corporate officers, department and division management on initiatives supporting T&D; strategies.Performs analysis, testing, and/or measurement in a specialized area of expertise.Responsible for devising new, innovative models for determining metrics.Responsible for providing, analyzing and interpreting data in support of GRC testimony.Acts as a subject matter expert (SME) to analysts about data sources, extraction methods and data interpretation.Provides analysis for AOR in support of on-going company operations or in response to changing business strategies.Responsible for development, improvement and execution of processes that support T&D; in the execution of performance and metrics.Responsible for devising new innovative models for determining metrics and strategy effectiveness.QualificationsMinimum QualificationsFour or more years of experience in the field of analytics with operational data, providing consultation and recommendations on its underlying drivers.Bachelor Degree in a STEM (Science, Technology, Engineering, Mathematics) or Finance, Economics, Business, Statistics or related discipline.Four or more years of experience working with R, SAS, or experience running SQL queries.Desired Qualifications:Possess or working towards a Masters Degree in statistics, data science, mathematics or equivalent.Professional certification in Lean/Six Sigma or predictive/advanced analytics.Experience working with ERP (SAP, Oracle), Electric Utility Operations tools (OMS, SCADA, AMI) and/or Geospatial (ESRI, Smallworld, QGIS) data, and analytical tools such as Minitab or Python preferred.Five or more years of experience performing detailed analysis, querying, investigating and resolving problems, drawing conclusions from complex data and information, and presenting results to management and key stakeholders.Five or more years of experience working across disciplines and effectively engaging various levels of internal and external suppliers and stakeholders.Excellent communication skills both oral and written.Comments: Candidates for this position must be legally authorized to work directly as employees for any employer in the United States without visa sponsorship.Relocation does not apply to this position. Southern California Edison, an Edison International (NYSE:EIX) company, serves a population of nearly 14 million via 5 million customer accounts in a 50,000-square-mile service area within Central, Coastal and Southern California. Join the utility leader that is safely delivering reliable, affordable electricity to our customers for over 125 years.  SCE is a proud Equal Opportunity Employer and will not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status or any other protected status.  #LI-EA1"}