{"jobID": "1154248033", "jobLocation": "San_Jose_CA", "jobTitle": "Data Analyst", "companyRating": null, "companyInfo": {"Website": "www.lat36.com", "Headquarters": "Franklin, TN", "Size": "51 to 200 employees", "Founded": " 2000", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $25 to $50 million (USD) per year", "Competitors": " TEKsystems, Collabera"}, "estimatedSalary": null, "jobDescription": " Data AnalystJob  code: 10401Job Category: Data AnalystCity: San JoseJob Description:#114175 – Data Analyst – San Jose, CA – 12 MonthsPosition Overview The Business Services Operations team is responsible for communications, organization development, logistics, and financials in support of the VP of Business Services and her immediate staff. Key areas of focus for this group include: insuring completeness and timeliness of financial deliverables; budget analysis; managerial reporting of finances and headcount/HR data; staff meetings; leadership meetings; organization change management.  This position is responsible for supporting the staff of the VP of Business Services with common financial functions: resource analysis; financial analysis; financial and managerial reporting; budget reconciliation; assisting with project audits; team metric development and reporting; along with supporting executive reporting requirements. Responsibilities •Provide regular and ad-hoc analysis and reports on key deliverables such as budget/spend; resource constraints; allocations; accruals; etc.  •Support Business Services leadership in defining, gathering, tracking, analyzing and reporting on metricsDevelop and run tracking mechanisms to pro-actively manage financials and reconcile work performed to submitted invoices and expendituresOther tasks and analysis as required within the scope of supporting IT Business Services leadership Requirements • MBA or bachelor’s degree in either finance, economics, management or engineering seeking to develop skills in areas of IT operations and managerial financials  • Strong analytical skills coupled with the ability to formulate potential areas of risk from the data being processed.  •Proficient in the use of MS Excel.  •Excellent written, oral communication, and presentation skills  •Able to clearly articulate and present findings and recommendations at different levels  •Thrive on problem solving in a matrixed and dynamic organization  •Be detail oriented and enjoy working in a fast paced, results oriented environment  •Able to take responsibility and follow through on commitments managing multiple assignments  •Be flexible and comfortable working in a collaborative team environment, with limited direct supervision Priyanka Raj | Latitude 36, Inc | Technical Recruiter Work: 510-894-7001 | C: 510-390-0941 | Email:praj@lat36.com  Web: www.Lat36.com | Connect: https://www.linkedin.com/in/praj0007/ Connect with us on: Like us on Facebook  Follow us on Linked In  Tweet us on Twitter About us: Latitude 36 is a full-service staffing services firm, specializing in recruiting for Information Technology and Healthcare positions. Founded in 2000, Latitude 36 is a WBENC certified woman-owned company. Our clients include Fortune 1000, large (500MM+) privately-held companies and non-profit corporations. Latitude 36’s core service is staffing. Through time-tested recruiting programs, we offer our customers the highest-caliber, pre-screened resources to ensure our customers meet business and project objectives."}