{"jobID": "2756293831", "jobLocation": "Mountain_View_CA", "jobTitle": "Senior Data Scientist", "companyRating": null, "companyInfo": {"Website": "www.aeratechnology.com", "Headquarters": "Mountain View, CA", "Size": "51 to 200 employees", "Founded": " 2017", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " Elementum, Qlik, GT Nexus"}, "estimatedSalary": null, "jobDescription": "Do you want to shape the future of enterprise software?At Aera Technology, we apply Internet scale technology to the challenges facing enterprise businesses. Think of the self-driving car: connected, always-on, thinking, and autonomous. Our mission is to enable companies in the same way.We're looking for an expert Senior Data Scientist to be based in our Mountain View HQ. You will be working on new and challenging data science applications, using Machine Learning to solve complex business problems.Responsibilities Transform business problems into data problemsResearch and build statistical/machine-learning modelsPerform Exploratory Data Analysis and Statistical Analysis; clearly present the results of analysis to customer and managementCollaborate with other team members to build data-science products and services using the Aera platform About You B.S. in Computer Science or IT, with a demonstrated knowledge of computer science fundamentalsMaster's degree in Statistics, Operations Research or a related field, with a PhD preferred.5+ years of experience in developing and implementing analytical data models is required.Experience in predictive modeling, recommendation systems, classification and regression models, time-series models.Experience in Statistical Programming Language/Packages in Python is required.Expertise in Data Analysis and Data Wrangling. Ability to work with complex data and convert it into easy-to-understand analysis.Expertise in visualization and presentation. You should be able to clearly communicate your work to different groups using visualization, charts and presentations.Familiarity and hands-on experience with SQL is desiredWorking experience in Java or C++ is a plus.Excellent verbal and written communication skills are required.At Aera, we're on a mission to solve the biggest, most intractable challenges of enterprise software. We envision the rise of the Self-Driving Enterprise: a more autonomously functioning business with a central operating system that connects and orchestrates business operations. Our platform is increasingly used by the world's largest companies to identify and respond to market opportunities faster.If you share our passion for building the next generation of enterprise software, and implementing it for the most sophisticated customers in the world, youve met your match. Headquartered in Mountain View, California, we're growing fast, with teams in Mountain View and San Francisco (California), Bucharest and Cluj-Napoca (Romania), Paris (France), Munich (Germany), London (UK), Pune (India), and Sydney (Australia). So join us, and lets build this!"}