{"jobID": "2756876754", "jobLocation": "Duarte_CA", "jobTitle": "Staff Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.cityofhope.org", "Headquarters": "Duarte, CA", "Size": "5001 to 10000 employees", "Founded": " 1913", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " MD Anderson Cancer Center, Memorial Sloan Kettering, UCLA Health"}, "estimatedSalary": "64000", "jobDescription": "About City of Hope City of Hope, an innovative biomedical research, treatment and educational institution with over 5,000 employees, is dedicated to the prevention and cure of cancer and other life-threatening diseases and guided by a compassionate, patient-centered philosophy.  Founded in 1913 and headquartered in Duarte, California, City of Hope is a remarkable non-profit institution, where compassion and advanced care go hand-in-hand with excellence in clinical and scientific research. City of Hope is a National Cancer Institute designated Comprehensive Cancer Center and a founding member of the National Comprehensive Cancer Network, an alliance of the nations 20 leading cancer centers that develops and institutes standards of care for cancer treatment.  Requisition ID: 13353 Job Title: Staff ScientistPosition Summary and Key Responsibilities: A Staff Scientist position is available at City of Hope. The Staff Scientist series is designed for career research professionals whose primary function is to support the research infrastructure and activities of the institution. Staff Scientists will bring special skills, knowledge and experience to research programs or institutional core laboratories. Individuals appointed as staff scientists will receive a one-year fixed-term contract.  He or she will develop a research program of bioinformatics for basic and clinical research applications in conjunction with a career development mentorship plan. S/he will work with the research team to actively participate in project discussions and user support among bioinformaticians, statisticians, project manager and researchers. The job will include, but is not limited to, data pre-processing and interaction with scientists for user support and trouble shooting. Work closely with the research PI and Bioinformatics to provide responsible and skilled technical assistance in support of grant applications and manuscript preparation, data integration, and analysis. Responsibilities include keeping good time tracking for project management and documentation of research results and presentations to various technical and non-technical audiences for chargeback and overall COH missions. Background in physics and biomathematics strongly desired. Minimum Education and Skills Required for Consideration:The Staff Scientist must possess, at a minimum, the U.S. equivalent bachelors or masters degree in an appropriate discipline, and will often have a Ph.D. or other doctoral level degree in Molecular Biology, Biochemistry, Bioinformatics or related field.Experience with data analysis, visualization, and integration in the areas of genomics and functional genomics, including gene expression analysis, transcription regulation analysis, pathway analysis, and/or sequence analysis. City of Hope is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, or status as a qualified individual with disability."}