{"jobID": "2816617638", "jobLocation": "Freeport_TX", "jobTitle": "Research Scientist", "companyRating": "3.3", "companyInfo": {"Website": "www.olin.com", "Headquarters": "Saint Louis, MO", "Size": "1001 to 5000 employees", "Founded": " 1892", "Type": " Company - Public (OLN) ", "Industry": " Manufacturing", "Revenue": " $2 to $5 billion (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "99000", "jobDescription": " Apply Now  Olin Epoxy, a division of Olin Corporation, has an opening for a Research Scientist, located in Freeport, Texas. The Epoxy business is an integrated, leading global supplier of epoxy components and formulated systems for a variety of growing application areas, and with a strong record of innovation and value creation.  Olin Corporation is a leading vertically-integrated global manufacturer of chemical products and a leading U.S. manufacturer of ammunition. Olin is the world's leading producer or chlor alkali products and Vinyls, the number one supplier of epoxy materials, the number one global seller of membrane caustic soda and chlorinated organics and the number one North American seller of chlorine, bleach and hydrochloric acid. Winchester's principal manufacturing facilities produce and distribute sporting ammunition, law enforcement ammunition, reloading components, small caliber military ammunition and components and industrial cartridges. Essential Job Functions:Epoxy Process R&D; has a pipeline of challenging projects, with focus on optimization and debottlenecking of existing manufacturing operations, and process development for new products.This role is one with a global impact within R&D; and across the business.The person in this position will assume a technical leadership role in Epoxy Process Research with responsibility for opportunity identification, project leadership, planning experiments, modeling, designing lab rigs, developing fundamental understanding of processes, optimizing processes, and supporting scale-up from lab to pilot and manufacturing scales.Frequent interactions with the product research group, technical service, manufacturing, and other functions and businesses are expected.Minimum Requirements:*A degree in Chemical Engineering, with at least 5 years of experience in Process Research or related fields, such as reaction engineering, separations or modeling.A demonstrated record of technical leadership, problem solving, and driving complex global projects to success.Ability to manage multiple projects in parallel.Solid chemical engineering skills, including transport phenomena, unit operations and/or reaction engineering.A serious safety focus and attention to detail are necessary in this role.Ability to collaborate globally and cross-functionally on technical projects; communicating effectively regarding technology development plans and outcomes.A demonstrated track record of effective documentation of results in data books, reports, patent disclosures, and external publications.Experience in engineering and modeling tools such as ASPEN, Athena, CFD tools, etc. are a plus.Six Sigma certification and previous experience in process development, scale-up or Epoxy Technology are a plus.Degree must be from a school that is accredited by an accrediting agency recognized by the Secretary of Education of the U.S. Department of EducationThis position is not eligible for an expat assignmentOlin does not provide any form of sponsorship to applicants not authorized to work in the US. Olin is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.SDL2017"}