{"jobID": "2747240013", "jobLocation": "Marshall_TX", "jobTitle": "Data Scientist / Data Engineer", "companyRating": null, "companyInfo": {"Website": "www.seven.com", "Headquarters": "Marshall, TX", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Company - Private", "Industry": " Information Technology", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Bytemobile"}, "estimatedSalary": null, "jobDescription": " SEVEN Networks develops innovative mobile software solutions that help wireless carriers, mobile device manufacturers, application developers, and end users understand, analyze and optimize the wireless traffic between mobile devices and the cloud. We are looking for a team-oriented Data Scientist or Data Engineer to turn the vast amounts of data collected by SEVEN mobile applications and external data sources into actionable insights for customers of the analytics services, ecosystem partners, and for internal use.  This job will be based at our Marshall, Texas headquarters. Responsibilities:Overall responsibility for creating insights from internal and external data sourcesProvide insight into SEVEN product management and executive team on key performance indicators and improvement opportunities of SEVEN products and users at the marketplaceProvide analytics and insights on user behavior, network performance, and mobile application performance to respective customers and ecosystem partnersDrive and design improvements to SEVEN mobile products to incorporate data collection that allows continuously better insightsDrive and design improvements to SEVEN analytics products from data collection to data frameworks, processing, dashboards and presentationWork with customers and customer support in troubleshooting as a subject matter expert in mobile analyticsQualifications:2+ years of relevant experience in analysis and statistics, and corresponding analytics engineering skillsTechnical or Scientific Master’s degree is required with strong background in mathematics. Ph.D. or other advanced degrees are desirableExperience in SQL, R, Python for analytics, combining data from multiple sources, experience in cleaning up data before jumping to conclusionsExcellent verbal, written and visual presentation skillsDemonstrated ability and curiosity to find and explain stories and insights from the granular data, connecting the data to real-world benefitsExperience in business intelligence packages is preferredExperience in Hadoop is preferredPassion for mobile applications and smartphones"}