{"jobID": "2787631564", "jobLocation": "Chicago_IL", "jobTitle": "Marketing Measurement Data Scientist", "companyRating": "3.5", "companyInfo": {"Website": "www.allstate.jobs", "Headquarters": "Northbrook, IL", "Size": "10000+ employees", "Founded": " 1931", "Type": " Company - Public (ALL) ", "Industry": " Insurance", "Revenue": " $10+ billion (USD) per year", "Competitors": " Progressive Insurance, State Farm, Farmers Insurance Group"}, "estimatedSalary": "103000", "jobDescription": "Where good people build rewarding careers. Think that working in the insurance field can’t be exciting, rewarding and challenging? Think again. You’ll help us reinvent protection and retirement to improve customers’ lives. We’ll help you make an impact with our training and mentoring offerings. Here, you’ll have the opportunity to expand and apply your skills in ways you never thought possible. And you’ll have fun doing it. Join a company of individuals with hopes, plans and passions, all using and developing our talents for good, at work and in life.Job Description  We are the Marketing Measurement Science team, and we strive to execute best in class measurement and analytics strategies. Every. Day. We’re an intellectually curious team and are proud to be the independent, and unbiased voice of truth, influencing decisions that drive business results. Yes, we work at a fortune 500 company, but we strive to operate like a start-up – seriously, that’s the dream – data, resources, and budget of a large firm with the autonomy of a startup!! We are on a journey to build out a best-in-class team and are looking for enthusiastic, driven professionals. We have openings in Chicago and Charlotte, with regular work from home potential. We hire people with diverse backgrounds and differing perspectives who are passionate about solving business problems with data and analytics, and love what they do. And at Allstate, you truly are in good hands. We have training and development opportunities that are unmatched, with hundreds of data science roles throughout the company, providing for endless career advancement. So, ask yourself: Are you picky about pulling your own data, applying an analytic layer for answering business questions?Does the thought of working hands-on with industry leading digital data sets excite you (think Google, Facebook, and multi-touch marketing attribution)?Have you developed Tableau dashboards that transform complex data sets into easily digestible and actionable visualizations?Are you interested in conducting experimental designs in SAS in order to test & learn how to optimize marketing spend?If you answered Yes to 3 of the 4 questions above you are likely an ideal candidate to join Marketing’s Measurement Science team at Allstate and we look forward to meeting you!  Key Responsibilities  As a member of the Marketing Measurement Science team, you will get the opportunity to be on the front lines working with Sr. Managers and Directors of Allstate’s marketing team. You will be working with business and marketing leaders, every day, to make real business impact. A brief blurb of what this job is about: You will enjoy working with one of the broadest marketing mixes on the planet. We’ve got it all – from traditional TV/radio to Snapchat - you’ll find we have a marketing campaign for all eyeballs in the US!You will get a chance to apply your first-principles knowledge of statistics to real world experimental design to measure the effectiveness of a campaign (all those hours you spent taking statistics 101 now finally has a purpose!)You will contribute to work on data and problems across Marketing to drive improved business results through designing, building, and partnering to implement analytical processesYou will collaborate with the team to improve the effectiveness of marketing investment decisions through the creation of scalable analytics and rigorous deep-divesYou will develop and deliver insight that explains current campaign performance, and work with your manager to turn that insight into recommendations for future campaign improvementYou will work with your manager to develop effective project planning techniques to break down projects into tasks, and ensure deadlines are keptYou will maximize your personal professional development to ensure continuation of a personal contribution to the team and Allstate In essence, the scope is huge, the only limitation is your will!  Job Qualifications The perfect candidate will have a background in a quantitative or technical field, will have experience working with large data sets, and will have some experience in data-driven decision makingYou are focused on results, a self-starter, and have demonstrated success in using analytics to drive the understanding, growth, and success of a product/campaign/program.You have the analytic agility to deal with a variety of problems and quickly arrive at ‘what needs to be done’ and you do itYou have the ability to communicate complex analysis to non-technical audiences and the ability to deal with ‘Nay Sayers’ of your analysis in a respectful mannerYou are able to operate independently (but you can also work in teams effectively), are detail-oriented, and deliver results in a highly organized mannerBachelors or Master’s preferred in a quantitative field such as statistics, mathematics, finance, or economicsDemonstrated experience/expertise with at least one with statistical software such as SAS and R and a passion for data driven decision-makingExperience with distributed computing (Hive/Hadoop)Development experience in any scripting language (PHP, Python, Perl, etc.) is a huge plusThe candidate(s) offered this position will be required to submit to a background investigation, which includes a drug screen. Good Work. Good Life. Good Hands®. As a Fortune 100 company and industry leader, we provide a competitive salary – but that’s just the beginning. Our Total Rewards package also offers benefits like tuition assistance, medical and dental insurance, as well as a robust pension and 401(k). Plus, you’ll have access to a wide variety of programs to help you balance your work and personal life -- including a generous paid time off policy.  Learn more about life at Allstate. Connect with us on Twitter, Facebook, Instagram and LinkedIn or watch a video. Allstate generally does not sponsor individuals for employment-based visas for thisposition. Effective July 1, 2014, under Indiana House Enrolled Act (HEA) 1242, it is against public policy of the State of Indiana and a discriminatory practice for an employer to discriminate against a prospective employee on the basis of status as a veteran by refusing to employ an applicant on the basis that they are a veteran of the armed forces of the United States, a member of the Indiana National Guard or a member of a reserve component.  For jobs in San Francisco, please click \"here\" for information regarding the San Francisco Fair Chance Ordinance.  For jobs in Los Angeles, please click \"here\" for information regarding the Los Angeles Fair Chance Initiative for Hiring Ordinance.  It is the policy of Allstate to employ the best qualified individuals available for all jobs without regard to race, color, religion, sex, age, national origin, sexual orientation, gender identity/gender expression, disability, and citizenship status as a veteran with a disability or veteran of the Vietnam Era."}