{"jobID": "2615949192", "jobLocation": "Chicago_IL", "jobTitle": "Data Analyst, Operations Engineering", "companyRating": "4.3", "companyInfo": {"Website": "www.invenergyllc.com", "Headquarters": "Chicago, IL", "Size": "501 to 1000 employees", "Founded": " 2001", "Type": " Company - Private", "Industry": " Oil, Gas, Energy & Utilities", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "69000", "jobDescription": " Invenergy drives innovation in energy. Powered by decades of entrepreneurial experience and unparalleled execution, we solve the energy challenges facing our customers and communities. We provide power generation and storage solutions at scale around the world to create a cleaner energy future. We develop. We build. We own. We operate. We are Invenergy. Job DescriptionPosition Overview The Data Analyst, Operations Engineering provides technical support to a large operating fleet of renewable energy projects by utilizing vast streams of current and historical data. ResponsibilitiesDetect and diagnose performance issues in a large fleet of wind turbines, as well as solar and battery storage facilitiesDevelop tools to find predictive indicators of major equipment problems before they lead to down timeDevelop tools to identify under-producing wind turbines so that corrective action can be taken and energy output improvedEvaluate the effect of software changes and parameter modifications on equipment performanceCalculate key operating performance statistics and metricsRespond to requests from sites or other departments to perform investigative analysisMaintain databases of critical wind turbine equipment informationRequired SkillsBachelor’s or Master’s degree in Engineering, Applied Mathematics, Statistics, Data Science or related disciplineOne to three years of work experienceSome programming experience. MATLAB, Python, R, and VBA preferredExperience with SQL, OSIsoft PI, or wind energy a plusProficient in the use of Microsoft Office productsStrong organizational skills and attention to detailCritical thinking skills with the ability to identify and solve complex problems"}