{"jobID": "2771565900", "jobLocation": "Northbrook_IL", "jobTitle": "Senior Analytics Consultant", "companyRating": "2.8", "companyInfo": {"Website": "jobs.cvshealth.com", "Headquarters": "Woonsocket, RI", "Size": "10000+ employees", "Founded": " 1963", "Type": " Company - Public (CVS) ", "Industry": " Health Care", "Revenue": " $10+ billion (USD) per year", "Competitors": " Walmart, Walgreens, Express Scripts"}, "estimatedSalary": "72000", "jobDescription": " Job DescriptionAs a member of the Analytic Development organization, you will be responsible for the design, development and delivery of analytic solutions, focusing on opportunity analyses, outcomes, and patient segmentation for utilization management programs for common and rare chronic conditions. You will collaborate with business partners from product, operations, medical affairs, finance, and marketing to demonstrate the value of CVS Health products and services and enable data-driven, strategic decision-making and identify opportunities for existing product improvement and new product development. The essential roles and responsibilities of the role are: Collaborating with key internal and external stakeholders to gather and analyze needs and requirements to design and implement robust analytic solutions to support the identified needs; Developing rigorous methodology to measure the financial and clinical impacts and outcomes of programs and interventions; Working with pharmacy and medical claims data and data related to the administration and operation of the utilization management programs; Accessing, manipulating, analyzing and visualizing data from large databases using a variety of tools and techniques, such SQL, Python, R, SAS, and Tableau; Conducting analyses of the data, ranging from descriptive data exploration to advanced statistical modeling; Building dynamic dashboards using Tableau and drawing actionable insights from the data; Assessing existing available data, identifying data gaps, and collaborating with Data Strategy and business partners to develop approaches to closing the data gaps; Constructing and delivering written reports of the analytic findings in a variety of formats (reports, PPT, including visualization of data and findings), formulating recommendations, and effectively presenting the results to potential non-analytic audiences; Communicating complex technical subjects to technical and non-technical audiences;Required QualificationsTo be considered for this exciting analytical opportunity, candidates will need to have a minimum of 3 years of professional experience in an analytics role. Postgraduate education may count toward required years of experience. You will also need to have demonstrated experience in the following: Problem solving skills and experience constructing analytic solutions to business problems; Developing innovative analytic approaches leveraging available internal and external data sources; Experience developing methodology to measure program and intervention outcomes; Working knowledge of a variety of analytic processes and techniques, including health economics outcomes research, development of measurement methodologies, hypothesis testing, statistical significance testing, modeling, and machine learning; Experience working with large data sources, focusing on efficient data extraction from large databases, data manipulation, and setting up optimized summary data layers; Hands-on experience with SAS, SQL, Python, R, Tableau and/or other data, statistical, and data visualization tools and techniques;Preferred QualificationsExperience interacting with and influencing decision-making by business audiences; Experience working with multiple business areas, such as operations, finance, sales, product, and marketing; Experience conducting data analysis in healthcare settings; Working knowledge of health care industry products/services and operations, including pharmacy benefit management, pharmacy benefit utilization management programs, such as prior authorization and step therapy; Experience working with pharmacy or medical claims and clinical program data; Experience developing dashboards using visualization tools such as Tableau;EducationBachelors degree in qualitative field, such as statistics, biostatistics, analytics, epidemiology, public health, or economics. A graduate degree is preferred.Business OverviewCVS Health, through our unmatched breadth of service offerings, is transforming the delivery of health care services in the U.S. We are an innovative, fast-growing company guided by values that focus on teamwork, integrity and respect for our colleagues and customers. What are we looking for in our colleagues? We seek fresh ideas, new perspectives, a diversity of experiences, and a dedication to service that will help us better meet the needs of the many people and businesses that rely on us each day. As the nations largest pharmacy health care provider, we offer a wide range of exciting and fulfilling career opportunities across our three business units MinuteClinic, pharmacy benefit management (PBM) and retail pharmacy. Our energetic and service-oriented colleagues work hard every day to make a positive difference in the lives of our customers.CVS Health is an equal opportunity employer. We do not discriminate in hiring or employment against any individual on the basis of race, ethnicity, ancestry, color, religion, sex/gender (including pregnancy), national origin, sexual orientation, gender identity or expression, physical or mental disability, medical condition, age, veteran status, military status, marital status, genetic information, citizenship status, unemployment status, political affiliation, or on any other basis or characteristic prohibited by applicable federal, state or local law. CVS Health will consider qualified job candidates with criminal histories in a manner consistent with federal, state and local laws. CVS Health will not discharge or in any other manner discriminate against any Colleague or applicant for employment because such Colleague or applicant has inquired about, discussed, or disclosed the compensation of the Colleague or applicant or another Colleague or applicant. Furthermore, we comply with the laws and regulations set forth in the following EEO is the Law Poster: EEO IS THE LAW and EEO IS THE LAW SUPPLEMENTFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. If you require assistance to apply for this job, please contact us by clicking EEO AA CVS HealthCVS Health does not require nor expect that applicants disclose their compensation history during the application, interview, and hiring process.For inquiries related to the application process or technical issues please contact the Kenexa Helpdesk at 1-855-338-5609. For technical issues with the Virtual Job Tryout assessment, contact the Shaker Help Desk at 1-877-987-5352. Please note that we only accept resumes via our corporate website: https://jobs.cvshealth.com/"}