{"jobID": "2796209814", "jobLocation": "Grand_Rapids_MI", "jobTitle": "Research Scientist - Mass Spectrometry Services", "companyRating": "4.3", "companyInfo": {"Website": "www.vai.org", "Headquarters": "Grand Rapids, MI", "Size": "201 to 500 employees", "Founded": " 1996", "Type": " Nonprofit Organization", "Industry": " Biotech & Pharmaceuticals", "Revenue": " $50 to $100 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "45000", "jobDescription": " Research Scientist – Mass Spectrometry Services  Van Andel Research Institute (VARI), a leading independent biomedical research facility, is dedicated to determining the epigenetic, genetic, molecular and cellular origins of cancer, Parkinson’s and other diseases, and translating those findings into effective therapies. The Institute is home to more than 200 scientists and support staff that work in on-site laboratories and in collaborative partnerships that span the globe.  At the end of 2018, VARI will launch a new research program in Metabolic and Nutritional Programming, with the goal of improving health through prediction, prevention, diagnosis, and treatment. The launch of this program includes the recruitment of four additional faculty with expertise in metabolism and/or metabolomics.  Russell Jones., Ph.D., will be joining VARI in the summer of 2018 as Director of this new research program in Metabolic and Nutritional Programming. Dr. Jones is seeking to hire a fulltime Research Scientist, Mass Spectrometry and Metabolomics, as part of the Metabolism Program. The research of the program is focused, but not limited to, the following areas: Cancer metabolism: Understanding how cancer cells reprogram their metabolism to promote cell growth and adapt to limiting nutrients in their environment. Our goal is to understand how metabolic fluxes alter cellular behavior and/or cell fate decisions.Immunometabolism: Understanding the metabolic pathways critical for immune cell function, and elements of the tumor microenvironment that mediate anti-tumour immunity.Diabetes and Obesity: Analysis of human and animal samples to assess metabolic health.Epigenome – metabolism interface: Charting causal interaction interface between metabolism and transcriptional control.Method and model development: including novel tracers, tissue slice work, in vivo metabolic flux in animals and humans, and untargeted metabolite profiling. In this role as Research Scientist, Mass Spectrometry and Metabolomics, you will be instrumental in providing scientific expertise and leadership in delivering GC/MS (GC-MS, Gas chromatography–mass spectrometry) and LC/MS (LC-MS, Liquid chromatography–mass spectrometry) services to VARI members and outside collaborators. In this role, your primary duties will include:Oversee research projects requiring method development, and delivery of results to customers using the Mass Spectrometry facility.Design, write, implement and maintain LC/MS and GC/MS SOPs, protocols and research methods; resolve conceptual problems by troubleshooting and researching.Review & approve LC/MS and GC/MS data generated by other lab members.Develop, troubleshoot and implement new sample extraction and analysis methods by LC/MS & GC/MSOversee implementation of new methods by coordinating with other lab members in the establishment of said new methods.Extract, collect LC/MS data, analyze and review and evaluate research findings of customer samples according to established facility standard operating procedures (SOP)Develop and apply ad-hoc bioinformatics solutions for the analysis and visualization of complex metabolomics datasets.Disseminate research results and methodology, specifically the methods sections for client publications or grant applications.Lead or contribute the writing of manuscripts and data presentations.Manage technical staff involved in mass spectrometry servicesDisseminate of research results and developments at internal and external scientific meetings and in peer-reviewed scientific publicationsParticipate in scientific conferences to learn about new MS developments.The ideal candidate should possess experience with the following:A highly organized multi-tasker who pays attention to detail and values research integrity.D. in Chemistry, Biochemistry, or Molecular Biology, Cell Biology, Biomedical Life Sciences.5 years of research experience in mass-spectrometry including at least 3 years of direct experience in LC-MS equipment, technologies, and analysis.Demonstrated computer skills for the analysis of metabolomics data is required.Previous experience in processing and analyzing large datasets (i.e., metabolomics data, NGS data, genome annotation or developing analysis pipelines).Familiarity with databases, and statistical computing programs, R and Matlab, is an asset.Experience in the field of cancer research, metabolism, or immunology is an asset.Ability to work independently yet be a team player.HOW TO APPLY If you possess these attributes and enjoy working with motivated and driven people, we would welcome speaking with you and encourage you to apply today!A cover letter describing your research interests, experience, and how you might contribute to the Program in Metabolic and Nutritional Programming.An up-to-date Curriculum Vitae.A list of 2-3 individuals who have agreed to act as references along with their contact details. Please contact Eric Miller (eric.miller@vai.org) for further information or questions, or if you have any difficulty with the application process. VAI is actively striving to diversify its workforce and strongly encourages qualified individuals from underrepresented groups to apply. Van Andel Institute is an EEO and Affirmative Action EmployerAbout Grand Rapids, MI Van Andel Research Institute is located in downtown Grand Rapids, MI that is the second largest city in Michigan and the largest city in West Michigan. Grand Rapids offers a remarkable combination of cosmopolitan atmosphere and small town warmth, known for its philanthropic and sustainability-driven community, and is ranked one of \"America's Top 100 Places to Live.\"  Located on the banks of the Grand River, Grand Rapids offers all the big-city excitement you would expect from a million-resident metropolis, featuring hundreds of restaurants and nightspots, theaters, museums, sports and concerts. An eclectic mix of walk-able neighborhoods surrounds the safe and clean downtown.  With a medical and life sciences industry boom, strong entrepreneurial activity, dedication to green building and living, and innovative employers, Grand Rapids' diverse economy continues to grow, offering endless career opportunities.Required Skills Required Experience Job Location  Grand Rapids, US-MI "}