{"jobID": "2835006744", "jobLocation": "San_Francisco_CA", "jobTitle": "Senior Growth Strategy & Analytics Manager", "companyRating": "3.8", "companyInfo": {"Website": "www.twilio.com", "Headquarters": "San Francisco, CA", "Size": "501 to 1000 employees", "Founded": " 2008", "Type": " Company - Public (TWLO) ", "Industry": " Information Technology", "Revenue": " $100 to $500 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "158000", "jobDescription": "Because you belong at TwilioThe Who, What, Where and WhyWho As Senior Growth Strategy & Analytics Manager, you thrive at strategic thinking, solving problems, synthesizing ideas, and leading transformational change. You have a demonstrated track record of excellence in analysis, project management, communication, business judgment, and coaching/mentoring others. You are energized by a dynamic, high-growth environment, and are resilient in the face of challenges. Youve got experience developing scaled data and BI reporting, as well as strategy consulting, marketing operations and/or software industry experience. You are able to act as a management consultant who can help Twilio clarify fast-moving strategic priorities, tackle operational challenges, and enable growth. What As part of the analytics team, you will collaborate closely with business owners across functions, fully immerse yourself in data, draw insight from analysis, and then zoom out to develop compelling, synthesized recommendations. You will communicate your recommendations to senior executives, roll up your sleeves to help drive implementation, and manage the ongoing impact of your recommendations. Analytical rigor and strategic thinking are a must, but youll also need to get your hands dirty to drive real, sustainable impact. This is an ideal fit for a strategy consultant looking to transition into a high-profile operating role. Why Twilio is a company that is empowering the worlds developers with modern communication in order to build better applications. The Growth Strategy & Analytics team is driving this by acting as a trusted partner to Marketing & Sales leadership and plays a critical role in scaling the companys rapidly growing global go-to-market strategy. The team is chartered with providing strategic insights to run the business, evolving Twilios marketing strategy, and enabling maximum productivity across the organization. Our team is highly cross-functional, and strong relationships fuel our success.  Twilio is truly unique; we are a company committed to your growth, your learning, your development and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion and innovation and we want you and your ideas to thrive at Twilio. Come join us. Where This position will be located in our beautiful office at 375 Beale Street in San Francisco. You will enjoy our incredible perks: catered meals, snacks, game room, ergonomic desks, massages, Wednesday Night dinners, bi-weekly All Hands and more. What you will also get to experience is a company that believes in small teams for maximum impact; that strives to balance work and home life, that understands that this is a marathon, not a sprint; that continuously and purposefully builds an inclusive culture where everyone is able to do and be the best version of themselves. We seek people who naturally demonstrate our values, who are challenged by problems, empower others to thrive, people who can draw the owl and not be beholden to one playbook. About us:Twilio's mission is to fuel the future of communications. Developers and businesses use Twilio to make communications relevant and contextual by embedding messaging, voice and video capabilities directly into their software applications. Founded in 2008, Twilio has over 650 employees, with headquarters in San Francisco and other offices in Bogotá, Dublin, Hong Kong, London, Madrid, Mountain View, Munich, New York City, Singapore and Tallinn.Twilio is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal opportunity regardless of race, color, ancestry, religion, gender, gender identity, parental or pregnancy status, national origin, sexual orientation, age, citizenship, marital status, disability, or Veteran status and operate in compliance with the San Francisco Fair Chance Ordinance. #LI-POST"}