{"jobID": "2830945605", "jobLocation": "Sacramento_CA", "jobTitle": "Associate Business Intelligence Analyst", "companyRating": "3.2", "companyInfo": {"Website": "www.cda.org", "Headquarters": "Sacramento, CA", "Size": "51 to 200 employees", "Founded": " Unknown", "Type": " Nonprofit Organization", "Industry": " Health Care", "Revenue": " $10 to $25 million (USD) per year", "Competitors": " Unknown"}, "estimatedSalary": "61000", "jobDescription": " The California Dental Association (CDA) is recognized as one of the most innovative membership-based organizations in the country. Formed nearly 150 years ago by a small group of dentists, CDA has grown to become the single largest membership in the American Dental Association and a constant trusted resource for California dentists and their patients. In response to members call for support competing in Californias dynamic dental market, CDA created The Dentists Service Company (TDSC) as new subsidiary dedicated to helping members be more efficient and effective in the business side of practice. TDSC specializes in group purchasing solutions, offering significant savings on dental supplies through the TDSC Marketplace.  Bring your best to CDA and enjoy generous pay plus a benefits package that includes medical/dental/vision, 22 days of vacation, 401(k) matching, profit sharing and education reimbursement. In addition, CDA offers with a robust employee wellness program, casual Fridays, and learning and leadership opportunities. To learn more about working at CDA, visit cda.org/careers.  The Associate Business Intelligence Analyst is responsible turning data into information in meaningful ways. This is an exciting opportunity to support the growth of an e-commerce startup that is poised for rapid expansion. This role will work with the TDSC marketing and business operations team to turn data into insights through identification of key metrics and creation of data visualizations tools and dashboards. The role will also support the development of modeling tools that provide intelligence to drive critical business decisions.  Technical Skills and Analytics  Easily identifies meaningful patterns, analyzes them and then integrates and communicates them via data visualization and reporting techniques  Builds and maintains business intelligence reports and dashboards, including proactive identification of data/reporting needs to support rapid decision making  Maintains and expands website and email reporting using Google Analytics and other vendor data sources  Provides analytical support for marketing campaigns and segmentation. This includes campaign targeting assistance and post campaign analysis  Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors  Writes SQL queries to perform data analysis and creates reports from the data analysis to support business needs  Suggests changes and enhancements to databases and tools to drive improvement in data integrity  Cleans data manually and programmatically  Streamlines and automates processes to ensure data lineage, consistency, integrity, and transparency  Compiles data; prepares and distributes reports; and analyzes results using statistical techniques  Acquire data from primary or secondary data sources and maintain databases/data systems  Administrative  Ability to report KPIs at specified frequencies to varying stakeholders and audiences  Translate reporting requirements from stakeholders and interpret data needs  Respond to inquiries quickly and accurately while balancing multiple activities simultaneously  Consistently deliver high quality work in accordance with agreed upon deadlines  Required Education, Licenses & Experience  Bachelors degree or equivalent experience  Experience analyzing data from multiple sources and creating reports  Experience in analyzing, reporting and communicating data  2+ years of experience required  Experience with analytical tools supporting data analysis and reporting (Tableau, Qlikview, Power BI, or similar)  Experience using SQL for analytic research  Understanding of online metrics and experience using web analytic tools (Google Analytics, Omniture, etc.)  Basic knowledge of high level programming languages such as VBA or Python  Preferred Education, Licenses & Experience  Bachelors degree in Statistics, Math, Economics preferred  E-commerce/Retail experience preferred  Google Analytics experience preferred  Knowledge and experience with data modeling using R or other similar software  Knowledge around APIs and data warehousing (Redshift), specifically used for data analysis applications  Knowledge or experience with Salesforce or similar software  Working Conditions Occasionally (1-33%) Frequently (34-66%) Constantly (67-100%)  Constantly sitting"}