{"jobID": "2730429157", "jobLocation": "Plano_TX", "jobTitle": "SQL Data Analyst - Entry Level", "companyRating": "3.6", "companyInfo": {"Website": "www.ramquest.com", "Headquarters": "Plano, TX", "Size": "51 to 200 employees", "Founded": " 1991", "Type": " Company - Public", "Industry": " Information Technology", "Revenue": " Unknown / Non-Applicable", "Competitors": " SoftPro, Adeptive Software, Qualia"}, "estimatedSalary": "43000", "jobDescription": " RamQuest is a Texas-based corporation that has been serving the title industry since 1991. As the provider of the Land Title industry's most comprehensive title and settlement solutions, RamQuest's products are currently in use for closings in all 50 states.  We have a new opportunity to join our Compliance Team. This is a great opportunity for an entry level SQL analyst, who will utilize SQL knowledge to set up and configure rates data in RamQuest's products and solutions. We offer comprehensive and competitive benefits plan including medical, dental, vision and ESSPO Plan; paid vacation, paid sick and paid company holidays and more. Summary: Provide and support periodic software updates to meet Industry regulatory requirements. Participate in next generation software projects, utilizing advancements in Industry and technical solutions. Work with internal technical departments, understand and apply interactions between application components.  Job Duties: Be able to interpret documentation, statutes and regulations as published by legislative bodies, governmental regulatory agencies and underwriters. Determine how that information can be best applied to the RamQuest products and business processes. Utilize RamQuest One interface to configure, and export rate and endorsement templates. Import and configure rate and endorsement templates. Maintain rate template database libraries. Gain and utilize an understanding of the RamQuest products, software tools, and business processes. Train users (internal and external) on the premium and fee functionalities of the RamQuest One product lines.Skills & Knowledge Required: 2 years of SQL experience (SQL Management Studio and/or Oracle)  Ability to translate formal manual verbiage into a SQL stored procedure  Excellent verbal and written communication skills.  Excellent interpersonal and customer service skills.  Ability to prioritize and handle multiple projects.  Strong attention to detail and organizational skills.  Proficient in Microsoft Office Suite and Outlook. Knowledge/Skills/Experience Preferred: A.A.S. in Computer Science, Management or related course of study from an accredited institution of higher learning.  Experience in call center, or customer service environment supporting software application, or similar product.  CCE experience  Experience in title industry. (Closing, title production or escrow services.) Additional Information:This is a direct hire opportunity with RamQuestWe offer Health, Dental, Vision, and Life Insurance. Short-term/Long-term Disability coverage, and Retirement optionsPaid vacation, paid sick, and paid company holidaysConveniently located in Plano, TX off of the Dallas North Tollway and Plano ParkwayBusiness hours are 8am - 5pm with some flexibilityCasual dress code0Job Posted by ApplicantPro"}