{"jobID": "2761881193", "jobLocation": "Sunnyvale_CA", "jobTitle": "Chief Data Scientist", "companyRating": null, "companyInfo": {}, "estimatedSalary": null, "jobDescription": "Chief Data ScientistWhat is FogLogic all about?FogLogic is customer centric to the core. Our product is developed from the notion that things could, and should, be easier. That sentiment shines through in what we do, how we do it, and in our fun and friendly office culture. We are dedicated to empowering our employees to take ownership of their projects and drive them from start to finish. We facilitate our employees growth and allow them to exercise creativity within their field. We believe in autonomy, which fits in great with a healthy work life balance.Who are you?You thrive in an environment of trust and accountability - whether that is heading up a new project or choosing where the team eats lunch. You are confident in your abilities. You enjoy a challenging and stimulating environment that fosters career and personal growth. You take pride in your work and are customer orientated. You believe in the power and magic of great software. You enjoy a good corny joke from time to time as well as share a passion and enthusiasm for enjoying life whether youre at work or not.Whats your Role?We are currently looking for a passionate Chief Data Scientist. You will drive our Data Science vision and be our ML Platform evangelist. You love to present at various events and project FogLogic as the thought leader in Machine Learning.Responsibilities· Drive the vision of ML platform and be an evangelist· Analyze, develop, and productize ML platform at scale in a multi-tenant SaaS framework· Integrate the ML functionality efficiently into the data pipeline· Fulfill a cross-functional role, bridging between ML, Big Data Visualization, and other related functions, working on multi-faceted projects· Develop cloud-based distributed micro-services with restful interfaces· Use new technologies and methods that will provide FogLogic customers with new and innovative features· Work with other product development members to bring new feature to the product quickly and seamlessly· Effectively work in a fast-paced, energetic and experienced development team environment· Attract, nurture and build a team of Data Scientists· Be a humble approachable leaderQualifications· 8+ years experience in building large-scale, multi-tenant infrastructure platforms· Experience in building ML algorithms, and multi-tenant prediction systems· Knowledge in implementing various algorithms and know which works best in each use case· M.S. or Ph.D. in Statistics, Applied Mathematics, Computer Science or equivalent· Proficiency in Python· A self-driven, results-oriented mentality with strong analytical and problem-solving skills"}